{"windows":[{"symptom":"Unable to access BitLocker encrypted drive        I add bitlocker to one off my drive after window it cant open with the password and even with the bitlocker recovery key .***Original title: Bitlocker***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues while accessing a BitLocker drive on your PC. One of the things that you can try is using the bde command to try and decrypt the drive and see if you are able to access it. Refer the articlemanage-bde to unlock the BitLocker drive. However, we do have a dedicated forum where you should be able to find support. Let me help you in pointing towards the right direction. I would suggest you to post your query onTechNet forums, where we have support professionals with expertise on BitLocker to assist you with your query. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Bluetooth disappered from device manager with \"Unknown USB Device (Device Descriptor Request Failed)\" -error        Hi!I have some Bluetooth issues with my Asus UX330CAK notebook PC. Yesterday I tried to connect my bluetooth headphones to my computer like I normally would but, after pressing the bluetooth icon in notification center, the bluetooth icon disappeared. I looked it up on device manager, and I didn't find bluetooth there unless I clicked \"show hidden devices\". Now I can't find the bluetooth in hidden devices anymore. I can't enable bluetooth in settings, there is no bluetooth on switch anymore. Also I in device manager I have one device in USB devices which has yellow warning sign and says: Unknown USB Device (Device Descriptor Request Failed), error code is 43. I have nothing connected to the USB-ports so I think this can be related for my Bluetooth issue. I have found that some people had their Bluetooth hidden from device manager and had this issue too.I have searched this particular issue on web and I have found some threads and I tried all the following things to restore my Bluetooth:- I ran troubleshooting for Bluetooth, it just said that I dont have bluetooth enabled, I can try to enable it with external adapter.- I ran troubleshooting for Hardware and devices and it did show the \"Unknown USB Device (Device Descriptor Request Failed)\" issue, but didn't fix it.- Also, I tried to troubleshooters for network adapters and windows update but they didn't find any issues.- I've tried SFC \/scannow and DISM.exe but they didn't find any issues.- I have just updated newest Windows version, and I have tried install windows again, but the issue still persists.- I have tried to uninstall \"Unknown USB Device (Device Descriptor Request Failed)\" and also uninstall my main usb driver, but that didn't fix it.- I installed correct Bluetooth and network adapters from Intel's site and I also tried to delete them from installer and install again, but that didn't fix it too. -  I Installed also Intel's driver updater but that didn't solve my issue. I tried to use 3rd party dirver updaters and they didn't fix my Bluetooth and I tried to also clean my registry with CCleaner. - Also I tires tried to fully drain my battery and restart my laptop but even that didn't fix my issue.Is there any other things to try or could the error be hardware related?I apologise for any grammar errors, English isn't my native language. Best regards,Elias","solutions":["Hi Elias My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.I see some important updates available for your make and model. BIOS Update June 2019 https:\/\/dlcdnets.asus.com\/pub\/ASUS\/nb\/UX330CAK\/...I would also try upgrading to Windows 10 1903 if you have not already; Go to the following page then click 'Update Now' https:\/\/www.microsoft.com\/software-download\/win...Information in the above link is sourced from a trusted Microsoft MVP blog.","Hi Elias My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.I see some important updates available for your make and model. BIOS Update June 2019 https:\/\/dlcdnets.asus.com\/pub\/ASUS\/nb\/UX330CAK\/...I would also try upgrading to Windows 10 1903 if you have not already; Go to the following page then click 'Update Now' https:\/\/www.microsoft.com\/software-download\/win...Information in the above link is sourced from a trusted Microsoft MVP blog. I have Windows version 1903 already installed and I just updated BIOS and it went successfully, but sadly it didn't fix my Bluetooth issue. Is there anything else I could do?","Hi Elias My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.Download the following Bluetooth driver then install it: https:\/\/dlcdnets.asus.com\/pub\/ASUS\/nb\/DriversFo...Press Windows key + X Click Device Manager Expand Universal Serial Bus controllers at the bottom Right click each entry then click uninstall Exit then restart Windows 10 will then redetect them. Check if they then work.. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thank you for the response, but I followed those steps and I still can't find Bluetooth on device manager, Bluetooth switch on settings and  the \"Unknown USB Device (Device Descriptor Request Failed)\" error is still there. Any other methods?","This is likely a compatibility issue with Windows 10 1903 and your configuration.I recommend you downgrade to Windows 10 1803 and stick with that release. Step 1: Go to another working computer with Internet access, download Windows 10 1803 from the following link:https:\/\/tb.rg-adguard.net\/index.php?sid=74a7cf5...Choose the following: - Windows Final - Windows 10, version 1803 - Windows 10 Pro + Home - English - x64 (64 bit) x32 (32 bit) Step 2: create a bootable copy https:\/\/answers.microsoft.com\/en-us\/windows\/wik...Step 3: perform a custom install http:\/\/answers.microsoft.com\/en-us\/insider\/wiki...Step 4: how to recover your files from Windows.old: https:\/\/answers.microsoft.com\/en-us\/windows\/for...Windows Update might attempt to upgrade to Windows 10 1903 again. See instructions how to block it:https:\/\/www.groovypost.com\/howto\/block-windows-...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thanks again! I will try that when I get home from work and update to you later today if this works or not.","Looking forward to your update Elias.","Hi!I got back home and started to work on downgrading to version 1803. I downloaded the correct .iso file and put it into USB-drive with help of \"Rufus\". Installation went smoothly and just like the tutorial and finally checking my Windows version, it was correctly downgraded to 1803. However this didn't effect the Bluetooth and the error \"Unknown USB Device (Device Descriptor Request Failed)\" is still in device manager.I tried troubleshooters for bluetooth and hardware and devices but they didn't solve any issues, bluetooth said that my Computer has not bluetooth and hardware and devices found the \"unknown USB device\" -error, but didn't solve it. I also updated Windows from settings if there could be any bluetooth drivers (my version is still 1803 after the updates), but none of that seemed to work. So, my Windows version was downgraded successfully, but it didn't resolve my issue. Is there any other thing I could try, or is this issue just hardware related? My bluetooth worked just fine almost everyday before this.Best regards,Elias","I am begining to think this is likely a hardware defect. You will likely want to call ASUS technical support and describe the problem. They will likely want to the computer in for servicing.Call Us | Official Support | ASUS Global https:\/\/www.asus.com\/support\/callusNote: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Andre's reply is a bit disappointing as he thanked somebody last year for providing a solution to this issue that worked for the requester and has also just worked for me:https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/bluetooth-not-working-usb-device-descriptor\/2af8f09f-ce33-47f8-a42a-1b55e8cf60fdThe problem is that your system is not recognising the Bluetooth chip and thinks it is unplugged and it is seeing an unknown device that is not communicating correctly.A simplified version is as follows (I found that it was not necessary to drain the laptop battery completely):1) Perform a hard shut-down by holding the shift key is held down whilst selecting Windows Shut Down2) Ensure your computer is unplugged3) Hold down the power key for 93 seconds. That's 90, which is the maximum recommended elsewhere plus 3 to make sure it is over 90!4) Press the power key briefly to start your computer5) Allow it to start fully. If you open Device Manager (e.g. right click Windows Key -> Device Manager or from the Control Panel), you should now see that the Bluetooth section has reappeared and there are no Unknown USB devices in the USB section. This means that your Bluetooth is now working again.This apparently works by disconnecting the power (even residual power) from relevant chips which mean that they re-establish communications from scratch when you restart."]},{"symptom":"Network Spped Test        To download network speed test, is Microsoft store only Option. I am using Windows 10 build 1903, and Microsoft store is disable in my enterprise laptop.  Is there any other option to get Network speed test app. Please suggest.TIA","solutions":["Hi RuchitaSomani, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.There are many online network (Internet) speed tests that are accessible through a web browser such as Microsoft Edge.For example, please see www.speedtest.net (you can choose different servers around the world) and www.fast.com (Netflix test)Note: These are non-Microsoft websites. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":".png Links don't open in Chrome. (I have Windows 10) - I get a black screen        I have links to images that won't open. I get a black screen.I tried changing the Set Associations which I saw someone mentioned but that didn't work for me.","solutions":["Hi Araddy, Can you please provide a screenshot of this? The PNG link that you are trying to access and after you click it. This will give us an idea on how we can assist you further. Thanks and regards,","One example:http:\/\/images.salsify.com\/image\/upload\/s--jsJlvmRA--\/lc733aaybl4frxh2n4nr.png","Hi araddy, You may try following these steps. 1. Update Google Chrome. 2. Reset browser settings. 3. Create a new user in the browser. 4. Re-install browser. I hope this helps. Feel free to ask back any questions and let me know how it goes.Thanks!"]},{"symptom":"Disable bluetooth auto connect        My computer always automatically connects to my Bluetooth audio device. Is there a way to keep Bluetooth on (so I can still use my Bluetooth mouse) but manually connect to the audio device, only when I want? I can't use the audio device with my phone when my computer is on :-( I noticed that this was also a problem in windows 8: https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_8-hardware\/win-8-dont-want-bluetooth-to-autoconnect\/5b17b980-54ea-4831-a21e-4a8d532ddc5e","solutions":["Hi Brekkie, Bluetooth works by pairing devices. Once pairing is confirmed, it automatically connects to one another when both devices are on. To manually connect your devices, follow these steps to remove the pairing on your computer by deleting the audio device pairing: Select Start > Settings > Devices >Bluetooth & other devices.Select the paired Bluetooth device that you want to remove > Remove device >Yes. You can always connect your audio device to your computer if you want to use them again. You can post your suggestion in ourFeedback Hub. We appreciate your idea about manual Bluetooth connectivity. We're just here if you need further help."]},{"symptom":"re-installing printer        I un-installed my printer to see if it would help with it not printing- it will not download the exe file and I really need my printer- it will not download for me","solutions":["Hi Helen. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.If you can't download the printer's full software package from the printer maker, try another browser. I would have several browsers on your task bar so there's always one that's best for the task. I use Firefox, Edge and Chrome in that order of preference. It's easy to share bookmarks between all of them in their settings under Import Favorites from another Browser, and Firefox and Chrome let you sign in to save and\/or sync your Favorites on any other device you sign into. Set the preferred browser as Default in Settings > Apps > Default Apps. Rather than spending too much more time fiddling I'd simply Clean Install the printer which always works, lasts longer and actually saves time:1) Power up the printer, if wired unplug it's USB cable from PC. 2) Go to Settings>Apps>Apps and Features to find and Uninstall any printer software.3) Use one of these methods to remove all of the old printer drivers: https:\/\/www.tenforums.com\/tutorials\/101274-unin...https:\/\/helpdeskgeek.com\/how-to\/remove-uninstal...4) Now type Control Panel in Start Search, open CP, choose Icon View. In Control Panel open Devices and Printers, right click printer to delete Printer and any scanner or fax of the same name. Restart PC.5) Go to the printer model’s Support Downloads webpage to download and install the latest full software package. Now is also the time to check for any newer printer firmware to install which matters a lot.6) Extract Printer software, right click Setup file to Run as Administrator. Follow the setup screens closely as you install the software. For USB it should prompt when to plug in the printer.Older software may need to be installed in Compatibility Mode to run correctly: https:\/\/www.groovypost.com\/howto\/run-old-softwa... If you have further problems reply back with results of each step. Once it's installed and you've run a test print, then scanned it to see that it opens on the desktop, open the Printer software and go into its Settings to set the scan-to file location you prefer, also the email app you want opened for Scan to Email, if applicable.I hope this helps. Feel free to ask back any questions and let us know how it goes. If you will wait to rate my post until we are done, I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Bluescreen 9c several        I was watching you tube and a blues screen acurredProblem Event Name: BlueScreenCode: 9cParameter 1: 0Parameter 2: fffff80578e84b10Parameter 3: 0Parameter 4: 0OS version: 10_0_18363Service Pack: 0_0Product: 768_1OS Version: 10.0.18363.2.0.0.768.101Locale ID: 1033Extra information about the problemBucket ID: 0x9C_GenuineIntel","solutions":["a link to my dmp filehttps:\/\/1drv.ms\/u\/s!Au6L_rJ8Y9QHiACAWH1NFJqfQo-N?e=r7d9Sb","Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.Please perform the following steps.Press Windows+R to start Run.Type services.msc and press Enter.Locate Windows Update.Right click on it and select Restart.Then observe if the BSOD error is occurring again or not.","Is there anything else it might be??","BSOD occurs due to certain driver malfunction. Restarting the Windows Update service generally fixes this.Did it happen again?","I reinstalled the os and unistalled sonic studio","Alright.","I think I need new ram!!!","You may run a test on your Ram. Please perform these: Press Windows Key + R, type “mdsched.exe” (Without quotes) into the Run dialog that appears, and press Enter.Follow on-screen instructions.","windows did not detect any problems so I guess its some sort of driver issue like you said","Please refer to this HP website and perform the steps. Then observe if this happens again.https:\/\/support.hp.com\/in-en\/document\/c03413399"]},{"symptom":"Download a ged.com file problem computer automatically opens it as a pdf        So I'm trying to download a ged.com file. A ged.com file if you are not familiar is a file used by genealogists, people working on their family trees that they can upload and share in various databases.My problem is that I need to be able to open a particular ged.com file but my computer is automatically formatting it or trying to open\/save it\/convert? it as a pdf rather than keeping it as a ged.com file.Once I can download it as a ged.com I will be able to open in a database.What to do?","solutions":["Hi tahoe4me, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this. Thank you for the explanation on the file type!The file has likely downloaded properly, however your system appears to want to open those types of files in a certain program.if you right click on the file, see if you can go to Open With > Choose another app. It should open a window that says \"How do you want to open this file?\" and hopefully you can choose the ged.com program or other database program to open it.You can select the checkbox \"Always use this app to open .ged files\" if you would like this to become the default.Another way to do this is through Start > Settings > Apps > Default apps. Scroll down and select Choose default apps by file type. And then you might be able to find .ged in that file listing.Source: https:\/\/support.microsoft.com\/en-ca\/help\/402816... I hope this has helped you. If this has not helped, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"RTL\\LTR inverted since 1803 update. Arabic & English languages.        Hi, since I updated to 1803, all menus are inverted (LTR) -as photo shown below-I think it's Arabic RTL problem only, but today I tried to Use English language, and them menus inverted again (RTL)!In Arabic:And In English:---Also, in arabic language, start menu background (full screen mode) is inverted! (which is desktop wallpaper)","solutions":["Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.Do you have WinRAR installed on your PC? On some, WinRAR reverses the layout in Arabic versions. You can check this link to troubleshoot the problem.https:\/\/www.winhelponline.com\/blog\/file-explore...(Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.)I hope this helps with your concern! Please let me know if you have further questions.","Thank you, I deleted mentioned files, and then delete Winrar completely, but the problem still same!Winrar was installed before I update to 1803, this problem happen after update.I google it many times, but found nothing.","Hi, If layout turns to right in English, then the display has no problem as the layout in Windows 10 is supposed to be LTR except in Arabic. It was intended that the layout would be RTL when set in Arabic language.You can check more info on right-to-left language in this link: https:\/\/support.office.com\/en-us\/article\/using-...I hope this answers your concern.","It's also not LTR in English (turns to Left)!If I change language to English, layout comes RTL (which should be in Arabic)!and in Arabic, It comes LTR (which should be in English).I see my friends windows, at least it's LTR in English!Display and typing ...etc. all settings is Arabic. but layout still LTR.","Hi, Have you tried restarting the computer after the fix on WinRAR? If it is not acting right, I suggest you to run System File Checker and DISM restorehealth:https:\/\/support.microsoft.com\/en-ph\/help\/929833...","Yes, I restart many times ):I apply command, the result is:Windows Resource Protection found corrupt files and successfully repaired them.them restart, but nothing happen, LTR still (:"]},{"symptom":"Computer keyboard not working.        I haven’t installed any updates lately and my device manager shows no keyboard category. I tried the keyboard on another computer and it was fine. I used two separate apps to find any missing drivers and it didn’t show any keyboard related ones. When i restart it flashes keyboard failure for a boot and then moves on. I clicked diagnostics. It finished saying it didnt find anything. It reccomended doing a four hour diagnostic checking memory but i didnt think it would do very much. I’m quite stuck, please help.","solutions":["Hi Sebastian, is this keyboard wired or wireless? Please try to connect it to another USB port.Run sfc \/scannow command - will it find any problem files?","The keyboard is wired. USB port is fine. It says i must be administrator running a console session to use the sfc utility.","For a moment the keyboard worked while i was logging in until i logged in and it went back to not working. This hasn’t happened before. ","Right-click Start and select Windows PowerShell (administrator) - that will be the required session.Sometimes problem may be resolved by using another USB port so try to reconnect please.","The command responded:'WindowsResource Protection did not find any integrity violations.'I already tested the USB ports. ","I’m very sorry I could not help you and you’ve marked my messages as non-helpful. Sorry again, I will impede you to search for a solution no more.","Sorry, the messages simply didn't solve my problem. The program only asked if they solved the problem, so that's all I answered. The answers were helpful but they didn't solve my problem. That is all.","I have now found out some new things. First of all, my keyboard is slightly broken. I found it was unable to type on other devices until I found a little dent in the cord. After bending it, it was able to type, and I thought the problem was solved. But when I tried again on my computer it stopped working. I later discovered that non-keys(buttons like volume up that were not in the form of a key) worked completely fine."]},{"symptom":"Automatic repair couldn’t repair your PC        My computer wouldn't start and entered into an Automatic Repair. The automatic repair \"couldnt repair [my]PC\". It specifies the following Log file: E:\\Recovery\\WindowsRE\\Winre.wim\\System32\\Logfiles\\Srt\\SrtTrail.txt*Modified title for accuracy**Original title: Automatic Repair Error SrtTrail.txt*","solutions":["Hi Steven,This error occurs due to a possible corrupted startup file. For us to troubleshoot this issue, we suggest that you follow these steps:Restart your computer for 3 times to see Windows 10 Boot Options menu.Choose Troubleshoot.Click on Advanced Options.Select Command Prompt.When Command Prompt appears, enter the following command lines and pressEnter after each:bootrec.exe \/rebuildbcdbootrec.exe \/fixmbrbootrec.exe \/fixbootRestart your computer and check if the issue is resolved.Let us know how it goes."]},{"symptom":"Windows 10 OS - face recognition setup not working        Hey all, I bought a new Surface Laptop 3 over Christmas (Intel i7 processor), and for the first week the face ID worked perfectly. A few days ago on startup it began showing an error message 'Couldn't open the camera' and skipping straight to entering my PIN to log in. I have checked that all drivers are up to date and tried a lot of solutions online including factory resetting the laptop after which the biometrics still were not working.Any help would be massively appreciated! Thanks, -Cal","solutions":["Hi Callum. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See fixes for Face Recognition on Surface: https:\/\/support.microsoft.com\/en-us\/help\/402351...https:\/\/www.itprotoday.com\/windows-10\/how-confi...https:\/\/windows10skill.com\/windows-hello-not-wo...https:\/\/www.surfaceforums.net\/threads\/surface-g...https:\/\/www.reddit.com\/r\/Surface\/comments\/8lnku...https:\/\/www.cocosenor.com\/articles\/surface\/set-...1) Turn off Fast Startup: Go to Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change settings that are unavailable > uncheck Fast Startup.2) Reset Facial Recognition and\/or Fingerprint Options https:\/\/blog.goptg.com\/how-to-reset-windows-hel...3) Modify Group Policy Settings (for Pro version only) Updates might have modified some of the crucial settings of Group Policy. Therefore, we would recommend to launch the Group Policy Editor and check\/edit the settings related to Windows Hello functionality.Pres Windows key, type gpedit, and press Enter. Click on Computer Configuration and open Administrative Templates. Select Windows Components and open Biometrics. Click on Facial Features and right-click on Configure enhanced anti-spoofing option.Select Edit and disable the Configure enhanced anti-spoofing feature. Reboot your PC. 4) Update drivers If some of the system drivers, most probably webcam and fingerprint reader drivers, were corrupted during the version upgrade process, Windows Hello may fail to perform. To fix that, try to update the corresponding drivers:Right-click on Windows key and select Device Manager. Locate the Hello, webcam, and fingerprint drivers individually and right-click on each of them.Select Remove driver software and wait for the removal to be finished. Repeat the removal with all Windows Hello related drivers and then reboot your PC.Once done, open Device Manager, click Action -> Scan for hardware changes. The system should automatically detect and reinstall the drivers. 5) If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool as shown here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... 6) If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....7) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 8) Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.9) If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... ________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi,Press Windows +R Tyep Regedit and press Enter to go to Regedit.Go to HKEY_CURRENT_USERà Softwareà Microsoftà Windowsà CurrentVersionà DeviceAccessà S-****461222à{E5323777-F976-4f5b-9B55-B94699C46E44}, there you change Value Data to Allow.The last step:Open Settings and choose Accounts to Set up the face.Regards,"]},{"symptom":"Cannot find boot drive after being forced to update Windows        I got a message that an update was required as support for my version of Windows 10 was not support as it was a version before April of 2018. However, after the update completed and the PC attempted a restart, I get an error that a boot drive is required and it will not load Windows at all. I had a very similar issue when it forced me to update a few months ago which not was a pain to fix but my computer has not been the same since, so this is very frustrating for me.In my BIOS, it just lists my only drive which is a Crucial P1 1TB. It does not list any other boot options and it is set for that drive, but I get the error mentioned above. Last time this happened it listed my drive twice, one as MBR drive. I have since tried another drive in the system with a previously working version of Windows 10 (that was my old drive for that PC) which is also encountering the same issue (It is a Crucial 250GB MX500 2.5 inch SSD).My PC has the following hardware:Gigabyte X470 Auroras motherboardRyzen 7 2700X32GB of Ballistic Tactical DDR4 RAM rated at 3000MT\/s (4 modules with 8GB each, same exact model)1TB Crucial P1 NVMe SSDXFX 8GB RX580When this first happened, it took a lot of time and effort to get it working again, but at first it would only run the memory at 2400MT\/s which previously it worked at the rated 3000MT\/s without any issue. It would also often restart before even getting to the BIOS several times without any noticeable pattern; sometimes it did within a few seconds, sometimes within a few minutes, but always would not get to the BIOS the first few (or more) times.I replaced the PSU with a better one at that time, but the issue persisted. I also used Memtest 86 which did not find any problems with the memory (I though that the system only running the memory at 2400MT\/s despite the profile having it at 3000MT\/s may show signs that the issue stemmed from the RAM, but I was wrong).After clocking my memory down to 2933 I was able to boot into Windows, but it would often BSOD and ran the memory at 2400 instead of 2933. So I reverted Windows back to a previous version and it partially fixed the issue. It would still restart a few times before getting to the BIOS, but would be able to boot to Windows 10 and run the memory at 2933 without BSOD.I did not turn off or had any loss in power during the update; I allowed the update to be uninterrupted and it took about an hour for this last one.I really need help with this one as this has become a very frustrating issue for me.","solutions":["Hi CD. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Here are steps to recover from failed Updates or Version Update install which causes Windows to fail to start or function. If any steps won't work then report back and move on to the next. At least one step will always work, leading up to if necessary doing an automated Reset or a gold standard Clean Install: 1) Try whichever method works in this tutorial link to get into Advanced Startup Options to run System Restore or Uninstall Updates button, or if this is a version update Go Back to Old Version:https:\/\/www.tenforums.com\/tutorials\/2294-advanc.... Easiest is to restart or force shutdown the PC 3 times to force it into Repair Mode.If you are able to access System Restore or Go Back and it fails, skip to step 3.2) If necessary borrow another PC and follow the steps in the middle of this download page to create bootable installation media to access the repair options if not accessible by any other method:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... The bootable media is also the only method that doesn't require the password if you're stuck on that.Boot media by powering up the PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... You may need to enter BIOS\/UEFI Setup to turn off Fast Boot if it won't allow the Boot Menu key to interrupt starting Windows:https:\/\/www.mydigitallife.net\/comprehensive-lis... Choose UEFI version of media if offered, browse to second screen to Repair Your Computer link.3) Choose Advanced Troubleshoot options to run System Restore, or if this was a version Update choose More Options to Go Back to Old Version.If it rolls back then you can hide the Windows Updates and Version Upgrade responsible until they mature by installing and running immediately the Hide Updates tool:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... There is a new option after Version 1809 to roll back Windows Updates from the Repair Mode in Option Four here:https:\/\/www.tenforums.com\/tutorials\/5486-uninst... If this fails try a Startup Repair, or go back to Troubleshoot Options on the previous screen to Reset your PC which will save your files while reinstalling Windows.4) If that fails you can use the booted media created in Step 2 to Clean Install the latest version which should get you past all difficulties as it has hundreds of thousands of others who have followed the steps in this link and never come back to report another problem: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... The link compiles the best possible install of Windows 10 that will stay that way as long as you stick with the tools and methods given.There is a step to rescue files from the same bootable media: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Make sure during the booted install to follow the illustrated steps to delete all partitions down to Unallocated Space to get it cleanest, then click Next to let it auto-create the needed partitions, format them and begin install - this makes it foolproof.The media provided for the Clean Install is latest and normally the problems go away with the Clean Install, however if they don't you can find earlier version media to use here:https:\/\/tb.rg-adguard.net\/public.phpBurn to DVD or create bootable 8+gb flash stick installer using this tool installed to Windows:https:\/\/www.microsoft.com\/en-us\/download\/detail... Then once you're back in Windows 10, you can block the problem Update using one of these methods:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...For Version Updates the most stable method to install is using the media as shown in these steps for overcoming Version Upgrade problems:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Good news, Microsoft is giving back to users more control over Updates as announced recently here:https:\/\/blogs.windows.com\/windowsexperience\/201... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","After beginning the troubleshooting you suggested, after creating and setting up a recovery drive, it gave me duplicate options to choose from for booting. Two were the USB drive I created (both identical) two were the Crucial 1TB P1 (also identical) and another the was completely empty, as in it was a selectable option, but that option had no letters numbers or characters to speak of. Those only seem to come up when there is a USB drive connected to the PC.For curiosity, I clicked on the option with nothing in it and now the update is continuing from 30%. I find this strange, but this sort of happened last time. I am not considering this resolved until I can boot normally into Windows, not experience any BSOD and be able to run my memory at the speed it is rated for.From what it seems like to me is that Windows required a restart in the middle of the update and then did something to my BIOS where it no longer able to boot correctly, let alone to continue the update.I will respond when more happens.","Shortly after my last response, my display is left showing a black screen with nothing but a single blinking underscore at the top left corner. There is no text or anything else but the blinking underscore. How long should I leave it before forcing a shutdown?","I would shutdown and then follow the steps I gave to boot into the media to do the repairs suggested.Were you referring earlier to the Boot Menu that was triggered when you tried to boot into the installation media you created? It sounds like you might have chosen the System partition which tried to start Windows and was continuiing the Update installation.I'm not sure what the double listings are about but I'd reset the BIOS to default. Is it Legacy or UEFI? Do you happen to know if the 1tb has a UEFI install? If not and it's a UEFI install you may need to enable CSM or Legacy BIOS as this can sometimes change with the install of a newer AHCI SATA driver. To reset BIOS: https:\/\/www.groovypost.com\/howto\/reset-pc-bios-...https:\/\/www.maketecheasier.com\/how-to-reset-cmo...","I was indeed referring to the boot menu. Storage Boot Option Control is in Legacy and Other PCI Device ROM Priority is in UEFI Only. I am not sure if my 1TB has a UEFI install.I performed a CMOS reset the last time this happened, but it did not resolve the issue. I will give it another go and should that not work, I will proceed with the steps to recover from a failed update.","It would be Storage Boot Option control (i.e. Storage = Hard drive\/SSD) so try setting it to UEFI to see if it boots. If not you may have a Legacy install on a UEFI system which is like disabling all of the safety features in a brand new car. So if it won't start in UEFI, Legacy or CSM\/Compatibility (either) then I'd wipe the drive and reinstall in UEFI mode, booting the media as a UEFI Device.Follow the gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If you have files that aren't backed up you can use the same bootable media to try to rescue your files using these methods:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Keep me posted on your progress as I will be here to help until the case is resolved.","I appreciate you sticking with me. Before I switch from Legacy to UEFI, I performed a CMOS reset, which gave me some interesting results afterward when attempting to boot to the drive. I have attached a picture because I cannot find words to describe what it displayed:https:\/\/postimg.cc\/9zjXSLx2Every subsequent boot has different results, but in a similar fashion. I am thankfully able to boot to the BIOS still, which was a concern of mine after seeing this.","Switching to UEFI Only yields the same result. Attempting clean install as suggested.","Yeah that's weird. Make sure to set UEFI, Secure and Fast boot enabled (the last two can wait until after install if they interfere).Windows Boot Manager will invoke itself after you wipe the partitions off the drive during Custom Install by deleting them down to Unallocated Space, then click Next to let it auto-create the necessary partitions and auto-format them GPT - this makes it foolproof.WBM must remain set first to boot at all times thereafter.","Should I be concerned about recovering my Windows key for installation? The rest of my data is already backed up."]},{"symptom":"add my phone to this computer        how to add my phone to this computer?","solutions":["Hi Glacier, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.With the new releases of Windows 10, connecting your phone to your PC can sync messages, photos, notifications to your computer. (Only Android yet)Calling feature is coming in a future release. To set up the same please follow the article below: https:\/\/support.microsoft.com\/en-in\/help\/4531293"]},{"symptom":"Valid copy and product key owned.  Unable to use the USB for an upgrade.  Can I just download it here and activate it with my product key?        Hi all.  I got a copy of Windows 10 for Xmas, bought directly from Microsoft.  (The sent me the bootable USB; I didn't create the installation media.)  I'd like to upgrade from 7, but the USB isn't recognized by my PC.  It'll boot straight to the USB from the BIOS no problem, but that only gives me the option of doing a clean install.  It doesn't allow an upgrade when I boot into it.  I went round and round about why I can't get to the setup file on Windows 7 with a tech support guy and we couldn't figure it out.  I'm not trying to get an answer as to why my installation media isn't recognized by my PC.  I'm looking for a simple workaround rather than wasting my day off trying to figure out why I can't get to the setup file from the USB stick.  I'm wondering if I can just download it here, then use the product key that I own to activate it.  Will that work?  Again, the product was purchased directly from Microsoft.  I have a valid product key.  No pirating or sketchy ebay stuff going on here.  It has never been installed on another computer.  Everything is 100% legit.   (Just want to stress that because I don't want this post flagged and deleted.)Thank you for reading.     ","solutions":["Hi SlackingAtWork, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.There is a slight chance of Windows USB not working correctly - we have seen many cases of the same.The simplest workaround - Use the Media Creation tool to directly upgrade to Windows 10 and change the product key with what you boughtlater. (At first, Windows 10 would activate using your existing Windows 7 license but it isn't reliable and your PC can deactivate anytime later) The fastest way to get the upgrade is through Media creation tool or ISO file. Please download Media Creation Tool from the link below and select Upgrade this PC at the first screen.https:\/\/go.microsoft.com\/fwlink\/?LinkId=691209Then, When you have completed the Installation change the product key: How to Change Product Key in Windows 10 https:\/\/www.tenforums.com\/tutorials\/7209-change...Let us know if you have any questions and how it goes. Content on tenforums.com is written by a Microsoft MVP so it is safe. However, do watch out for the ads."]},{"symptom":"Windowa update\/device encryption        I have just did the latest update of W10 on my PC and I need to turn on device encryption or BitLocker, of which neither is available because I have the home edition. What can I do? Do I need to somehow get another version, or can I at least get rid of the prompts telling me to do so? I would really like some encryption though...","solutions":["Hi Eric. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.If you want Bitlocker you can upgrade to Pro version via the Store as shown here:https:\/\/support.microsoft.com\/en-us\/help\/12384\/...Then follow this guide to Bitlocker: https:\/\/www.windowscentral.com\/how-use-bitlocke...Make sure not to lose your Bitlocker Key which should register in your MS account if you have one. If you set up a password or PIN for Bitlocker don't forget it either.We see enough problems with Bitlocker here I would have another backup to the cloud and\/or external drive. Google Drive Backup is excellent and will let you sync your User folders up to 15gb free. OneDrive offers 5gb free, or if you subscribe to Office 365 1-2 tb. I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Is Cortana able to switch Audio Playback device?        Hi!So I am running with Cortana for a half a year or so and it's an amazing experience, she is super helpful. But I ran into one little detail devs could fix (add new Feature if there is not such a feature implemented already. I may be running old build).Imagine that you are sitting on the bed, your PC is in another corner of room and you want to listen to some music. So you'll ask Cortana if she plays some music for me on Spotify. She find me music and start playing it. But I hear nothing. So I ask if she can set the volume higher and she does, but I still don't hear anything. \"Oh wait, of course, I was using headphones before so the Audio Playback Device is set to Headphones, not Speakers.\" So I'll ask Cortana if she changes Audio Playback Device to Speakers but she doesn't know how to do it.Well, she opens a Bing search for me. On the other hand, I think it's as hard as changing Volume.Or is there any specific Command on how to ask her to change my Playback device, or maybe downloadable kit? Thank you!","solutions":["I have exactly the same concern."]},{"symptom":"Windows 10 1903 Blurry Screen at Logon and no option to Logon        Is there any way around an issue where a Windows 10 screen goes blurry at fresh boot logon when there is no logon option showing? I have not been able to get it into safe boot with all standard methods.","solutions":["It sounds like you are describing a similar issue to the one discussed on the thread titled \"PC stuck at a blurry login screen.\" In that thread, the original poster says, “I recently updated my PC and now it is stuck at the login screen. It boots up normally to the lock screen, after pressing any button or using the mouse it goes to the next screen for the login but does not load the password box and the screen remains blurry.” Several people have found the answer from ForjoAtinxan in that same thread helpful."]},{"symptom":"can i download a clean iso instead of using the media creation tool?        if i follow the instructions the installer that the media creation tool makes it tries to install the version of windows that is installed on the workstation i am using instead of a plain windows 10 pro version i have a license for.  can i download a clean iso instead of using the media creation tool?","solutions":["Hello BigMFg_detroi, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemThere are some other workarounds to download the ISO for offline usage as an example.Please check the description in this link: https:\/\/www.bleepingcomputer.com\/news\/microsoft...Please note that this is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Cheers! Farah","Yes, during the installation you can select the version"]},{"symptom":"Frequent BSODs        I just switched back to a Windows computer after 10+ years (Surfacebook 2).I only have a limited set of programs installed (mostly Adobe creative suite). I've been experiencing regular BSODs. I grabbed some minidump files:https:\/\/storage.googleapis.com\/bd-minidumps\/010520-16093-01.dmp - this is from a natural BSOD (SYSTEM_SERVICE_EXCEPTION)https:\/\/storage.googleapis.com\/bd-minidumps\/010520-25968-01.dmp - this is from shortly after running the driver verifier app (IRQL_NOT_LESS_OR_EQUAL).I downloaded a program called BlueScreenView, but both seem to indicate the failure is in ntoskrnl.exeI'm not really sure how to debug this further, can anyone help?","solutions":["Hi LackingScarf560 I'll try to help you out on this issue. At first, we'll check the integrity of your system files : - open the command line (type \"cmd\" in the start menu, then right click and select \"run in administrator mode\")- type \"dism \/online \/cleanup-image \/restorehealth\" then hit enter Let it work Then do this command : - \"sfc \/scannow\" then hit enter and again, let it work The first command will check the \"health\" of the windows image located on your drive.The second command will check your system files for any corruption. The process can take a bit of time (should be less than 1 hour). more info here : https:\/\/support.microsoft.com\/en-us\/help\/929833...I'll wait for your news Regards","Thanks, things look clean to me:C:\\WINDOWS\\system32>dism \/online \/cleanup-image \/restorehealthDeployment Image Servicing and Management toolVersion: 10.0.18362.1Image Version: 10.0.18363.535[==========================100.0%==========================] The restore operation completed successfully.The operation completed successfully.C:\\WINDOWS\\system32>sfc \/scannowBeginning system scan.  This process will take some time.Beginning verification phase of system scan.Verification 100% complete.Windows Resource Protection did not find any integrity violations.","Hi,The dump file points to a Google drive integration driver:*** WARNING: Unable to verify timestamp for googledrivefs2789.sysYou should check the updates on the same available and if not try reinstalling the same. Let us know how that goes.","Ok, great. So now, if the issue is still there : - check for any update => Windows Update => Drivers => BIOS update If the issue then persist, we'll have to go through a reinstallation of Windows, but we'll see later.","Thank you for the suggestion. I'll try removing Google Drive File Stream and see if that eliminates the BSODs.","Great, let us know how that goes."]}]}