{"windows":[{"symptom":"How do i reinstall the ms store? how do i play sea of thieves?        I've been trying everything to get sea of thieves to run on my pc, everything i've ever tried to download  on my pc has been fine but for some reason sea of thieves wont let me download it, it will always error out whether in ms store or xbox appI recently reinstalled it to try to get it to work again and low and behold error again, so i try to restart the pc because the store recommended me to, when i got back to the desktop i would click the ms app and it wouldnt open up, so i got on the forums here and found someone with the same issue as the store not openning, some guy recommended he windows key+I and find ms store and reset itafter i reset it, it sounded like it  it just deleted it, and the guy in the post tells you to reinstall it and talks about something with powershell, I try the powershell thing and it tells me it cant do whatever i'm doing to due to a positional parameter that cant be found that accepts argument \"*\"I have no clue what to do, I think i need MS store to be downloaded again, and after that i need to get past the error for sea of thievesI dont know how to reinstall ms store","solutions":["Hi, NickolasDawson My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"LOST FILES        Files were lost during windows updating.How can I get them back?Please assist.","solutions":["Hello WillieLewis1, I'm Didi, an independent advisor. For the issue of lost files after a Windows update please refer to this great answer provided by Greg Carmack, scroll down to see his answer marked in green :https:\/\/answers.microsoft.com\/en-us\/windows\/for... Regards, Didi"]},{"symptom":"Getting share link address for bunch of files in Onedrive folder.        Hi to all,I'm not sure that I should ask a question regarding Onedrive here or not, but I hope that I get the answer from you guys,I have a folder in Ondrive and inside of that I have many MS Word files that I want to share with different people with different software, The current scenario is very tough and I would like to make it easier, You can read about the current steps as below:1. Going to a specific folder in Onedrive2. Selecting each file one by one and then right-click and say share3. Then click on copy Link4. And finally, use the link to share it with anyone as expected, What I would like to do:1. Going to a specific folder in Onedrive2. Selecting all files at once and then right-click and say share3. Then be able to get separate share address per each fileOr2. Selecting all folders and saying share, and getting separate share link for each file in different folders,4. And finally, use the link to share it with anyone as expected, Please guide me if you know any solution about it,Behzad","solutions":["Hi Behzad, Thank you for writing to Microsoft Community Forums. I understand that you want to get a separate link address when you select multiple files\/folders to share through OneDrive. I would like to inform that currently, the feature is not available. We can get a share link for one file\/folder at a time. However, this seems to be a valid suggestion as it will save time and hassle of clicking each file\/folder. We always appreciate our customer’s feedback. Your feedback and suggestions are very important to us. Hence, I suggest you to provide your valuable feedback and ideas in our Feedback Hub, where our developers can look into the requests and constantly improve the features of Windows. For additional information, see Share OneDrive files and folders.  Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Associating a file type with a default program        How can I change the association for a file type to an alternative application already installed? Using \"control panel\/default programs\/assciate a file type or protocol with a program\" dialogue always ends up showing the current default app plus the option of finding an application in the MS Store.  I recall previously it was possible to choose any locally installed application, which now seems to have disappeared. (Windows 10 Pro, Version 1909, Build 18363.535.)  ","solutions":["Hi Dav Right click a file with that extension, choose 'Open With' - Choose Another App Important: check the box marked 'Always use this app to open xxx . . .' If the app you want to use is not in the list, scroll to the bottom and click 'More Apps'Again if the app is not in the list, at the bottom, click 'Look for another app on this PC', then navigate to find the application executable you want to use to open that type of file . . ."]},{"symptom":"why is a secondary HDD always being read\/write when my windows is installed on my SSD?        Okay I suddenly had a massive loss in performance but I am not exactly sure when it happened.  What I do know is that when I do basic functions I have started hearing and seeing in Task Manager Performance large portions of activity on my secondary HDD.My setup is a little unorthodox:I have (2) 250GB Solid State Drives in RAID0 managed by my mother board (don't ask, it was from a while ago when I needed extreme read\/write).  This Drive is C: and I have Windows and most programs installed on it.Then I have a RAID5 array functioning as D: which has larger programs that I don't mind not running perfectly.  Also, I have my OneDrive installed into this drive (which may be some issue?).Then I also have a final large storage Drive M: which is just a 1TB HDD drive.Here is the problem:  most anything I do with programs installed on C: accesses D: Drive as well.  Even when I click on the Start Menu it seems to access D:....  Why?  Is my OneDrive saving some kind of index or something on D:?It's really annoying because there is a noticeable performance loss now.  It's as if C: is being mirror or something.  I don't feel like I am accessing D: in any way currently, but it's constantly running.Any ideas?","solutions":["Hi BH. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.In ten years daily in forums I've never seen a good outcome with RAID, endless problems often leading to total data loss even when it's in a mirror so it doesn't even live up to the first letter of its name Redundant. I would unRAID and use modern SSD's and drive imaging to avoid the problems. There is no question in my mind that is the likely cause of your problems.There is simply no reason to use dated RAID technology now that there are SSD's and huge drives with drive imaging. Even when they tried to adapt it to WIndows 10 with Storage Spaces all we see is problems including frequent data loss with it.So I would unRaid and install to your fastest SSD following the gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... To create bootable Windows 10 Installation Media (on another PC if necessary) install Media Creation Tool and follow the directions in the middle of the download page here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key for your PC maker given in this chart:https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, then on second screen choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, select the Unallocated Space, click Next to let it create and format the needed partitions and start install - this makes it foolproof.There is a step to rescue your files first using the booted media if you don't have them backed up:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC because you will learn everything that works best and how to apply it with your own hands.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","When you access any drive in Raid you access all of them.","They are two entirely seperate arrays, one is a striped 0 array using SSDs the other is a Raid5 on HDDs.The computer did not previously access the HDD under normal operation (as the system drive is the Raid0 on the SSDs), but suddenly has started even though I seem to not be using the hard disk drives for any reason at that moment."]},{"symptom":"Windows Updates is breaking Printers        I have had 4 printers including my own that have been broken by apparently a MS update. I can find no one to help with this situation. The printer is no longer recognized on the USB port - NOT any USB port. NO sound no indication or response at all.I am trying to find a way to reset the USB ports so they see the printer. I f you reinstall the software it fails because it says - No Printer Found.Any one have a fix for this?????????I tried their Chat support and they should fire that bunch of people.Kerry","solutions":["What is the printer, you may need to install the latest Windows 10 drivers for the printer from the manufacturers website.","Hi Did you read my message?????????????????????????","This looks fake and someone should look into this submission.      the 1s print out **** Is when I copy and paste like you are trying to hide the number????????????","Hello KerryGish ! My name is Marco, I am an Independent Advisor. I will do my best to help you.It seems that it is a frequent problem since the last updates. Here there is a tutorial to explain well to remove 2 updates which could harm your printer. You can try that.https:\/\/www.windowscentral.com\/how-fix-printing..._________________________________________________ Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","You're right about the spam support number, it will get removed. An update can often need printer drivers reinstalling. It can mean the printer is not detected.What make and model is the printer and what update are you referring to. Check settings>update and security select view update history."]},{"symptom":"Switch Windows 10 Home to Pro        Hi!If I upgrade from Windows 10 Home to Professional - will I lose all of my saved passwords in Chrome? I am upgrading in order to get Outlook. Do I even have to upgrade? Every time I try to use Outlook, it's an hour lost and I'm back where I've started and I've been told it's because my system is the Home version. Can someone tell me if that's correct?Thanks, M","solutions":["If you are working from a different computer, You need to install outlook on your PC as well, then you should create those rules and filters again to simulate the work on your co-worker.Unfortunately those steps can not be explained here as it would get a bit complicated,But at first, get an outlook, either buy the full version or get the office 365, which is a subscription, can be set monthly or on annuallyimportant links: office 365 vs outlook https:\/\/products.office.com\/de-de\/compare-all-m...import gmail into outlook: https:\/\/support.office.com\/en-us\/article\/import...Cheers! Farah"]},{"symptom":"Why does using a bluetooth headset still mute desktop audio while the mic is in use?        I have been a part time PC technician for over 20 years, part of that was full time. I have a client who requires the use of a wireless bluetooth headset as his PC is too far for wired. While other wireless headphone options exist using Bluetooth enables him to also use the headset with his phone and is less expensive. He uses Team Speak 3 (TS3) while gaming to talk with gaming friends (OK, yes I am one of those friends too) so having the audio cut out while TS3 is running is a serious problem. However, this is not a TS3 problem as the audio cuts out when any app in Windows 10 activates the microphone. Like for example opening the sound control panel and switching to the recording tab will mute audio as the microphone is activated to show level inputs. I found that out because I went to the sound control panel to access the Communications tab and make sure the option there was set to \"Do nothing\".As far as I can see this has been an issue for a long time but I have been unable to find a fix in my online searches for the issue.In my attempts to figure out this problem I have used a few different headsets to rule out the headset. They work perfectly fine linked to a phone, you can hear audio while the mic is active, just not in Windows 10! While the microphone is inactive (no apps using it) the headsets can play audio from multiple apps no problem.I have tried using a Bluetooth 4.0 and 5.0 dongle, same issue for both so I do not think the Bluetooth version is the cause.It seems as though the \"Mute all other sounds\" option from the sound control panel cummunications tab is hard coded for Bluetooth!Has anyone managed to fix this issue, if so; how?","solutions":["rrSo why is it when I switch to recording tab, my music\/ audio mutes?  When I set my headset to be both default and communications device, it does not mute.  ","If you look you can see it shows a live level bar of the inputs from all enabled devices, so it is accessing the device even though you do not have it selected. It is muting because of the Bluetooth device being used just to update that bar!"]},{"symptom":"What is ScriptedSandbox64        Problem Event Name: BEX64Fault Module Name: d3d11.dllFault Module Version: 10.0.18362.387Fault Module Timestamp: 7e72d1cbException Offset: 00000000000a6eb1Exception Code: c0000409Exception Data: 0000000000000007OS Version: 10.0.18363.2.0.0.256.48Locale ID: 1033Can anyone help me decipher this Information? ","solutions":["Hi, The DirectX driver crashed. Have you tried to reinstall the DirectX?","jhestech A+ ,No, I have not tried to reinstall the DirectX.I did not see a relationship in my Error Code I will have to take a Look. At this Point, I am not sure what is using DirectX on my machine to find a baseline for ScriptedSandbox64.exe Faulting Application Path: C:\\Program Files (x86)\\Microsoft Visual Studio\\2019\\Community\\Common7\\IDE\\PrivateAssemblies\\ScriptedSandbox64.exeI will need much more information to find the Link for DirectX  + While running and testing Local Visual Studio Solutions, Projects, and Test Builds. Do You know the Visual Studio Setting for DirectX?OR -> Is this Related to My Graphics Driver, and Updates Required there? Thank you for your time,I surely appreciate your help","Hi, The \"d3d11.dll\" is a Direct3D Driver. The Exception Code: c0000409 means STATUS_STACK_BUFFER_OVERRUN. This issue is currently being investigated by the MSFT Engineering team. https:\/\/developercommunity.visualstudio.com\/con...Try to install the latest updates for windows 10. Update your Graphics driver."]},{"symptom":"Win 10 Search failure after 1903 update        The first problem I had with the Win10 1903 update was deemed by Microsoft support to be a problem with an incomplete update.  Microsoft fixed that by reinstalling the update.  Since then my search on file names fails. Search on file CONTENTS does not fail.  Rebuilding the index does not help (did this a couple of times).  Various forum threads talk about reinstalling Cortana or disabling Cortana or some other Cortana-related fiddling.  Nothing seems to help.  All else seems to be ok in Win10.  Again:    Search on file names fails.    Search on file contents works.    ","solutions":["Hi Shore features, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.To confirm, did you install 1903 or 1909? In 1909, search is a known issue. If it is 1903, you may try the steps here: Fix problems in Windows Search https:\/\/support.microsoft.com\/en-in\/help\/452014...If you have 1909, file feedback in Feedback hub and wait for Microsoft to fix it. I have escalated this as per my capacity.","I have update 1903.  The Search and Indexing troubleshooter finds no issues.I ran the search for updates and it mentioned 1909.  Since the search problem is a known issue for 1909 I won't want to upgrade to that.What's next?  Any hope?   I am a retired I.T. professional and rely heavily on finding stuff by filename.  Often searching on contents just muddies the water.  That ability is handy when wanted - hindrance when not."]},{"symptom":"Email pgm installation        How do I install yahoo email pgm to be able to send attachments with it? My document is unable to send as attachment.","solutions":["Hello MicheleLaPointe, I'm Didi, an independent advisor. By \"yahoo email pgm\" do you mean the Yahoo mail program for Windows 10 ? If that's the case, please note that the program has been discontinued and Yahoo advise their users to use the browser version accessible here :https:\/\/mail.yahoo.com\/ Source : https:\/\/help.yahoo.com\/kb\/SLN9127.htmlSo try to send attachments using the browser version. Regards, Didi ------------- Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"directional keys        Directional keys not working on keyboard.","solutions":["Hi Caleb The usual cause o this is either the Scroll Lock or Num Lock key is turned on, if those are available on your keyboard, check to see if this is the case . ..If those key(s) are not available on your physical keyboard, bring up the on-screen keyboard and check there to see if one of those is on . . .","Thank you so much, but that did not work.Screen jumps constantly in addition to directional keys not working. Can't seem to find a solution.","Hi Caleb, Can you please check if you can access your BIOS and see if the directional key is working in that mode?I'll be waiting for your response. Thanks and regards,"]},{"symptom":"Windows Stop Code Critical_Structure_Corruption after upgrading to Windows 10        I have been using a windows 7 pc for many years without major issue. I recently upgraded it to windows 10 through the Microsoft upgrade tool and things seemed to go fine (I kept my files and folders), but now I keep getting the BSOD with a stop code of Critical_Structure_Corruption. I tried uninstalling and reinstalling the video driver (nvidia 980 card, the old video driver was for windows 7, but the new one is for windows 10). I tried checking the ram, I tried limiting the number of startup programs. None of this has stopped the BSOD, which is always the same message. Any help would be most appreciated. ","solutions":["Hi, Please upload the Dump file, So we can Analyze the error. Go to C:\\Windows\\Minidump\\ Then upload the dump file to https:\/\/onedrive.live.com\/","Thank you for the reply. I just created a \"minidump\" folder in my OneDrive files and put the minidumps there (there were several, and a few were 0 k and would not transfer to OneDrive). Do I need to share the folder for you to access it?","While waiting for your reply I walked away from the system, when I came back into the room the system was off (I did not turn it off). Now when I boot I'm stuck in a repair loop and cannot get to the desktop even if safe mode. I did try running chkdsk from the command prompt in the recovery advanced options, but that did not help.","Hi, We need the dump file, Give me the link.","https:\/\/1drv.ms\/f\/s!Ahv8TkJm825ihAkT4pH0Psdrz8m_","Hi, Please upload the Dump file, So we can Analyze the error. Go to C:\\Windows\\Minidump\\ Then upload the dump file to https:\/\/onedrive.live.com\/","Hi, the link I posted right before your post should link to the mini dump, does it not work for you? (I hope so, I don't usually use onedrive)","There was a Bug Check 0x109: CRITICAL_STRUCTURE_CORRUPTION. There's a data corruption.Check your memory and try to run a hardware diagnostics supplied by the PC manufacturer.I also saw a OVERLAPPED_MODULE: \"sftfslh\", a driver for Microsoft Application Virtualization (App-V).","I tried both a memory check and chkdsk and neither turned up a problem. I'm not sure what to do about the microsoft application virtualization."]},{"symptom":"Pc windows update        When i turned on my pc, i had a windows update, which is expected, but for about an hour now the update keeps finishing and i keep recieving a ‘:(‘ error message, then my pc restarts and be whole thing happens again. Im concerned as i cant find anyone else that has this same issue. Any help would be gladly appreciated. Thanks","solutions":["Hi, ConorBerry My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.If you have problems updating Windows, follow these steps: If you have a third-party antivirus, you must disable or uninstall it. Try reset Windows update components: Right click on the start button and select Powershell (admin) or Command Prompt (admin)Write the next hit enter after each line. net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Restart and try again. You can also download the Windows Error Solver: https:\/\/support.microsoft.com\/en-us\/help\/10164\/...https:\/\/aka.ms\/wudiag You can do it manually by downloading the Windows ISO. When updating with the ISO, disconnect the Internet. https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/answers.microsoft.com\/en-us\/windows\/for...","My pc never goes to a start menu as it just keeps restarting and never actually is on a menu. Is there anyway i can uninstall an antivirus without being on the windows desktop. Thanks","Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I am now reseting my pc at the moment thanks for the help","Glad to Help!"]},{"symptom":"I would like to insert lines in Wordpad. Is it possible?        I would like to insert lines in Wordpad. Is it possible?* Original title: Insert","solutions":["Hi Willy I am sorry, Wordpad to a very basic word processor and there is no way to insert a line in Wordpad . . .The only workaround I can think of, if you want to insert a horizontal line, would be to repeatedly Press Shift and type a hyphen . . ."]},{"symptom":"Fix ntoskrnl high cpu usage for Windows 10 Pro?        In mid - late December 2019 I noticed a lag in starting applications after booting (or powering up) my Windows 10 desktop. Outlook, Word, Excel, and others has a noticeable delay in starting. Once I noticed this behavior I started task manager and noticed a process named 'System' running consistently at a CPU rate of 15 - 17%. No matter how long the system was running, even with no active applications started or idle, the CPU rate never changed for this 'System' process. I've watched task manager before and have never had a process 'System' running at this rate. Normally when present this 'System' process runs at around 0.2 - 0.4% CPU.I selected 'System' looked at properties and it is the 'ntoskrnl' process. Next, I went to Micorosoft technet and forums looking for information related to this issue. And, of course, I found a plethora of questions, discussions, etc., all involving ntoskrnl and high cpu utilization, some dating back to 2016. I followed the ones posting in 2019 and tried all the suggestions for fixing this issue. Uninstall this, remove that, kill items in startup, perform a clean boot, check registry and change this, etc., etc., etc.. Non of these worked. I returned the system to the current configuration I've been running for 3 years. Here is what I noticed: If I rebooted  (selected 'Restart'), the system rebooted and the 'System' process aka 'ntoskrnl' process was running at 0.2 - 0.4 CPU rate, after about 20 -30 seconds. If I 'shut down' the system to a power off state and then start the system up there is always the 'ntoskrnl' running at the high CPU rate - forever. Perform a reboot (even an immediate reboot) then 'ntoskrnl' is running at the normal 0.2 - 0.4% CPU rate. And there is no lag in starting Outlook or Word or Excel, or etc. The system is back to running normal performance only after a reboot.So why is ntoskrnl having the aberrant behavior? Please help by looking into this. This issue with ntoskrnl keeps resurfacing and Microsoft has not fixed this.Here is my system information- Windows 10 Pro 64 bit, 16GB RAM, Intel i7-6700T CPU, 512GB SSD, all updates current as of Jan 3 2020Two suspicious updates:1)  December 10, 2019-KB4533002 Cumulative Update for .NET Framework 3.5 and 4.8 for Windows 10 Version 1903 and Windows Server 1903 RTM and Windows 10, version 1909 and Windows Server, version 19092) December 10, 2019—KB4530684 (OS Builds 18362.535 and 18363.535)The ntoskrnl properties lists the following: Created Wednesday Dec 11, 2019, Location C:\\Windows\\System32 - this incredibly suspicious because this is the same time frame that I noticed the system behaving differently. AND it certainly suggests that one of these updates has corrupted the WIndows 10 Pro performance in the ntoskrnl service.","solutions":["Hi, Have you tried to Scan your PC using Anti-Malware?","Of course. Anti-malware is always engaged. This behavior oh ntoskrnl is not indicative of a compromised system. This is a behavior introduced by a Windows update.","Hi StPeteFL, Based on your concern, there's a lot of people experiencing this kind of issue as well.What I can suggest is to rollback the updates: https:\/\/lifehacker.com\/how-to-undo-and-prevent-...And disable your windows update for the mean time, please follow this link for detailed guide:https:\/\/www.cleverfiles.com\/howto\/disable-updat...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"Win 10 activation - no product key        Trying to activate win10 after M'board change but it won't work as it cannot find product key; I took the free upgrade from Win7 to Win10 so don't have a key - how can I Activate Windows? Thanks!","solutions":["Hi BobHayne, We're glad that everything's good. You can now close this thread. If there's anything that you need in the future, please let us know. You have a good day and take care!","One feature that was introduced in the early version releases of Windows 10 was to allow the use of the previous licence key for users that upgraded from a previous qualifying version of windows.As long as the previous version was a retail product activation is allowed for a change of device. (motherboard)"]},{"symptom":"XBOX One Controller only works with one USB Cable        I play a few games on my Windows 10 machine with an XBOX one controller. I usually have the same cable plugged into the controller, and unplug it from the machine occasionally when I need to free up a port.Well the other day I wanted to charge my tablet so I grabbed the USB Cable that I use for my controller since it was the closest one, plugged it into the power only usb port of a hub I have connected to my computer, and charged the tablet. Apparently that is not allowed because now when I connect the controller with that cable it gives me a message that says \"The last USB device you connected to this computer malfunctioned, and Windows does not recognize it.\"I tried lots of other cables, they all either display this error or simply don't read at all, except for one that works fine. The problem is that this cable is short and has a weak connection, so I play with it for now but sometimes I will tap it lightly mid game and it will become temporarily disconnected, and the game only works with controllers that are connected before it's launched, so then I immediately lose that game because I no longer have a controller. It's insanely frustrating.What can I do to make my original Micro USB cable connect my XBOX one to my PC, or one of the dozens of other Micro USB cables I have that don't work?","solutions":["Hi JPP6, There's a lot of things to consider in regards to your issue. However, you might want to check this article for suggested troubleshooting steps:https:\/\/www.partitionwizard.com\/disk-recovery\/t...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"What if I have a laptop and a desktop and want windows for student and home?        It says for 1 device only.How much are they going to hit me fir the 2nd device?Sometimes I'm at my desk and setimes out with my laptop.","solutions":["Hi Bob It depends, did either of your devices come with Windows 10? Do either of your devices have a previous version of Windows like Windows 7 or 8 Does your education institute provide Windows 10 Education as a free resource?"]},{"symptom":"Why external hard drive becomes write protected        My Asus zenbook (Windows 8) has recently encountered the famous ‘Kernel data inpage error’ (blue screen). After automatic reboot of the laptop, my external hard drive WD MyBook (exFAT) became not writable and a new drive letter was assigned to it (G instead of E). I can read any files on the drive but can’t write anything.Everytime I plug the MyBook to the zenbook, Windows now detects a hard disk problem.I thought about permissions issues. But in the MyBook hard drive properties, there’s no Security tab. So no way to modify the permissions.I used Disk management tool to assign a new drive letter to the MyBook (E). But it’s still write protected.I used DiskPart command to check the disk attributes: both ‘current read-only state’ and ‘read-only’ display ‘No’. So the MyBook drive is obviously not read-only.Does anyone know how to enable to write to this external hard drive? Thanks for your help","solutions":["Hi Colas,So you can write to the disk from the Macbook, right?","Hi Sumit,That's the exact opposite: I can't write to the external hard drive anymore since the Kernel data inpage error (blue screen) happened. But I can read the files from it. As if the external hard drive is now write-protected or locked.","Let us first check the disk.Download and run HDTune .http:\/\/www.hdtune.com\/Make screenshots of the followingthe healththe error scanthe benchmarkPost back the screenshots.","My external HDD issue is actually solved. I've connected the WD MyBook external hard drive to another PC (windows 10). I can read and write to it normally. But this PC detected disk errors. I ran chkdsk to analyze and repair errors. I connected the hard drive back to my zenbook laptop (windows 8) and it works properly (read and write). But there's still the recurrent blue screen error (BSdD\/STOP error) I need to fix. I found the minidump files but I don't know how to analyse it to understand the cause of the crash.","Hi Colas,Thank you for posting back - We can run the BSOD analysis for you. The instructions for sharing logs are here","Thanks Sumit.Here's the link on OneDrive to the crash dumps (DMP files + MSinfo32):https:\/\/1drv.ms\/u\/s!AsFDawzPaLpwdxcvNLqAbzkoM4k?e=e9A6g1","Thanks Colas. Some dump files blamed Avast UI for the crash. Can you check if there are any updates available for the same?If not, I recommend a reinstall of the same. Let us know if there are any other questions.PROCESS_NAME:  aswidsagent.ex","Thanks a lot Sumit for your answer and the analysis. Sorry for the late answer.I followed your advice, I updated Avast. BSOD again.I tried to reinstall it. It failed. I uninstalled Avast, installed AVG instead.But BSOD again!Did some dump files blame other software\/hardware?"]}]}