{"windows":[{"symptom":"OneDrive        So I tried to change my user folder name one day and I did figure out how to do so, but it came with a price of me losing my shortcuts and taskbar pins. Whenever I open \"File Explorer\" it pops up a message saying \"Location is not available C:\\Users\\myusername\\OneDrive\\Desktop is unavailable.\" I figure this is because my username is different now since I changed it and now OneDrive still thinks I'm using that username. At the moment I can't open most of the things on my computer because of this issue.Any help would be amazing.","solutions":["Hi Christian, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Try changing the location of the folder to the path indicated in the message you see. The steps I use the first time to rename the folder, now do not work? This is an article from a Windows MVP.https:\/\/www.groovypost.com\/howto\/change-onedriv...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Homegroup???        Is it called something else in Win 10?  I just upgraded from Win 7 Ult to Win 10 Pro, using that media creation tool, I can't figure out how to get to my home network settings and set that up in Windows 10, so that my machines can see each other, maybe transfer files between them (they all share my internet connection, that is not what I'm talking about).  Before I upgraded to Win 10 I had a problem with this, between my Windows machine and my two Macs there was no longer any connection (my Macs stopped showing up on my Windows PC and vice versa).  I didn't bother trying to deal with that in Win 7 because I was planning to get Win 10 soon, now that I have it I cannot see how to get the Homegroup (or what used to be called Homegroup, up to Win 7 anyway).  I came across an article online where it is suggested to type \"Homegroup\" into the search box in the taskbar, this brings two results, \"Sync your passwords on this PC\" or the ability to search this on the web;  I am not seeing anything like Homegroup inside of settings (\"Network & Internet\" is the only thing remotely similar in Settings and there is nothing in there related to setting up a home network).  I did buy a new router a few months back, that might have been about the same time I started having this problem (back when I still had Win 7 Ult), maybe I have o do something with the home network there, but where are the settings in Win 10 Pro related to setting up a home network, so devices on that network can see each other and transfer files between them?","solutions":["Hi,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Home groups was removed in Windows 10 last year. Because you have network sharing, you can use it to share files and printers.https:\/\/support.microsoft.com\/en-us\/help\/409136...See the following on how to share files. https:\/\/support.microsoft.com\/en-us\/help\/4027674Let us know if there are any other questions.","Thanks for that reply, there is lot of good stuff about networking with Win10 in those links, but my problem was with the actual network.  I purchased extenders recently, I guess in some ways the extender is part of the same (pre-existing) network but for some purposes they are treated as a separate network, or whatever.  I connected my Windows to the same extender as my Macs and so far, from my PC, I can see the one Mac that isn't dormant.  I do still have the same problem as I did with Win7, though, I can see my iMac but in order to access it Windows asks me for some \"network credentials\".   This is in a window that pops up called \"Windows security\", in there are two boxes that I need to type information into, a user name and a password;  I enter what I call that computer for the name, and the password I use to log in when I go to use that machine, but \"Windows security\" doesn't like those credentials...any idea what Windows is asking me for here?  As I recall, I was able to get into my Macs from my Windows machine once in a while (no idea why it worked those times), but it was typically easier to access my PC from either Mac.","Hi, Are you sure you are entering the correct name and password? The username is case sensitive. It is definitely asking for Mac credentials.https:\/\/support.apple.com\/en-in\/guide\/mac-help\/...Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"Error code 0x80004005 , Had this issue after re-formatting my PC did all steps i could find online to no prevail        Recently started getting this message after re-formatting my PC Had normal windows 10 version previously beforing reformatting and now stuck on a Windows Enterprise key that i cannot activate and a bunch of problems. I tried all the steps i could find online to solve this but to no prevail, would really appreciate some help. ","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.It’s unusual to have an enterprise key without a business volume license agreement. It may be a cause that you do do have a valid product key and this is what is causing the activation to fail.Regards, Ross","I was using a HWID spoofer which de-activates windows but could not get it back working. Do you think this could have something to do with it. And how do i go about fixing it.","It will almost certainly be the issue, that type of utility is also not supported under the license agreement. So unfortunately I wouldn’t be able to assist.Regards, Ross","I understand that but do you have any general guidance in what i could do. Is there a way to completly reset windows to its original state or is my key just lost? I tried re-entering my key but that did not work either.","If it’s a valid key you have, I’d suggest resetting windows and attempting to re-activate this should reverse anything you’ve done with the HWID spoofer.","Okay could you please link me to a guide where i could reset windows with my key. Since now every time i re-format i dont need to put in my windows key.","The best way for your scenario is a reinstall with installation media, see this guide for details:https:\/\/support.microsoft.com\/en-us\/help\/400073..."]},{"symptom":"Can't access Transform Text option        I can find this option on the screen but it doesn’t allow me to use it. Can you help?","solutions":["Hi Alexander, my name is Max and I'm an independent advisor. You can use the Transform Text option only in WordArt. Let’s follow the steps here, please 1. Select WordArt to find the Drawing Tools > Format tab. 2. Expand the Text Effects dropdown 3. Find an ABC Transform item at the bottom"]},{"symptom":"Sign in One Drive account        I've decided here because YOUR DAMN ONEDRIVE support doesn't work!!!!","solutions":["Hi Aleksander, my name is Max and I'm an independent advisor. First of all I'd like to say that I'm sorry that you're experiencing this problem contacting the support team!Could you please elaborate on your question? Thank you","Ok. When I open my documents in my work account, e.g. Powerpoint, Word from OneDrive, I get an error message with Sign-In-Required. We can't save, or check for changes. Then I try to enter my credentials and receive this -You'll need internet for this. 0xCAA30190","Let’s follow the steps here, please 1. Press Windows + I on your keyboard to open Settings 2. Tap on Accounts and then on Access Work or School 3. Disconnect from your work account, and then connect to this account again."]},{"symptom":"fsx steam edition, toga button        I've set up the buttons on my flight simulator (HOTAS) so that button 5 is the TOGA button, but selecting that during a go-around doesn't cycle the approach mode back to LNAV as it should (767).  Is this option not supported?Thanks,","solutions":["If you didn't map TOGA to HOTAS and just used the switch behind the throttle, would the desired outcome be different?  That is, the aircraft would accelerate to take off thrust and also automatically switch to LNAV?   If so, it seems that mapping the button to your stick may not work in the same manner.But if you know that mapping that action to HOTAS does work, then you may be able to find an answer from someone using that configuration at the FSX-SE Forums.Chris","Chris,Thanks for the reply.  I'm not sure which 'switch behind the throttle' you mean.The TOGA function didn't have a mapped button when I originally went into the setting menu in FSX, so I chose button 5 as what would work for me.  I'm unfamilar with the forums, I'll search that, but if you have a link that would be great.  The HOTAS stick I have is the Thrustmaster brand.Cheers,Dave","Hi Dave,TOGA switches are usually behind the throttle levers.   Now, whether they are operating\/clickable on your 767(?) is unknown.   Some have the view that the real 767 does not have TOGA switches, only a GA switch, but you'll have to check that on your aircraft's modeller docs. So, if those switches are not there\/inoperable, and FSX certainly does not have a mapped control for it, then I couldn't be sure that mapping that action (with the changeover from APP to LNAV) on button 5 on your stick would work either.Then there is FSUIPC:  https:\/\/flyawaysimulation.com\/downloads\/files\/1689\/fsx-fsuipc\/For the FSUIPC User Guide:  http:\/\/static1.1.sqspcdn.com\/static\/f\/1003521\/25685034\/1416357684727\/FSUIPC4+User+Guide.pdfAs you may know, it is a module for communication by FSX with external add ons.  It is both free and payware;  the paid version allowing for mapping of keys, sticks, etc.   However, though very useful and many use it, I'm unsure whether even this will do what you require of FSX. Here's the link to the FSX-SE Forums:  https:\/\/steamcommunity.com\/app\/314160\/discussions\/And one to the Avsim forum that points to the TOGA\/GA switches:  https:\/\/www.avsim.com\/forums\/topic\/127717-ga-and-toga-buttons\/Hope something helps you.Chris","ChrisThank you again. The 767 does have a GA switch on the throttle, and the sim works with the cntrl+shift+G combination, so I'm not sure why I can't map the function to the throttle button on my HOTAS. Not the end of the world, but a little frustrating. Dave","You're right Dave:  there is a key control for TOGA (under Autothrottle Engage (TOGA)) - didn't think to look at Autothrottle.   And yes, there is the option to map it onto a joystick.   So if it doesn't work on the joystick, or maybe in a limited way, then either the full mapping (i.e. use of auto throttle and switching to LNAV) is not being realized or it's not possible to do.  Or you need FSUIPC (registered) for the job.   But I would make enquiries about this before purchasing.The above may not have helped you at all, so can only suggest that you try putting your query to the fora and see if you get a useful hit.  Otherwise, I found these.   Some comments may not be useful, but worth reading to note other people's problems:https:\/\/steamcommunity.com\/app\/396750\/discussions\/0\/1620600279679223631\/https:\/\/www.avsim.com\/forums\/topic\/266516-mapping-togo-to-joystick-button-fsx\/https:\/\/www.avsim.com\/forums\/topic\/390642-assign-a-joystick-button-to-toga-ngx\/https:\/\/forums.x-plane.org\/index.php?\/forums\/topic\/146244-program-joystick-keys-in-the-757-v2\/Chris","It looks like, from the links you sent me, that someone had success by mapping the button through the PMDG menu?  I'm not sure what or where that is located in the FSX menus.  The only control settings I have are the ones already described.  Dave","PMDG stands for Precision Manuals Development Group and they produce some very realistic aircraft.   You'd need to be using their products for that Menu to show up.   FSUIPC seems the only other option for you, but being a payware product (for your purposes) the chance of it not fixing your problem may not make it feasible to buy.  Maybe you could make enquiries at their forum after you check through their FAQs:   https:\/\/forum.simflight.com\/forum\/30-fsuipc-support-pete-dowson-modules\/   (You would probably need to register with them or Simflight to present your problem).Pete Dowson regularly checks the site, so maybe an informed answer may be gained if your problem is explained in full.Chris","That all makes sense.  I put a question into the Thrustmaster support site as well, I'm hoping they have an easy fix.  Thanks again for your help, I'm a bit of a newbieDave"]},{"symptom":"How can I  use Mail Merge?        I am using Word 2013. Help me mail merge document.","solutions":["Hi Eivind, my name is Max and I'm an independent advisor. I suggest you refer to this article posted by Graham Mayor’s and check if that helps with the issuehttp:\/\/www.gmayor.com\/merge_labels_with_word_20...⚑ Disclaimer ⚑ One of my URL links can lead you to a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Little bit sharing a Knowledge of Quantum Computer.        Hi this bhanu i want share about Quantum Computer. Thanks","solutions":[]},{"symptom":"Which office can I download and use for free?        Which office can I download and use for free?","solutions":["Hi, My name is Will i'm an independent adviser, i'd like to help with your question. There are no versions of Microsoft Office that are completely free to download. Office 2019 is a one time fee, and Office 365 is either a monthly or yearly subscription that offers a one month free trial. For more information on these versions please visit:https:\/\/products.office.com\/compare-all-microso... This is a more feature-limited free version of office however it is online only and can only be accessed from a browser. For more information about this version please visit:https:\/\/products.office.com\/free-office-online-... I hope this helps with your question, WIll"]},{"symptom":"Small set of games causing a system lock up and crash.        I have been talking with Sega support for about 3 weeks now about a problem I have been having with a few of my games causing my screen to flash a color and lock up my system forcing me to do a hard reset each time. I have tried reinstalling the Steam launcher and the games I've tried rolling back the video drivers and talked to NVIDA as well about the issue. I've sent each my ms32 files and dxdiag files, along with any error reports from Event Viewer. The most recent one I have found has been a dwm.exe crash, I am also missing the Microsoft Driver Framework and when I have downloaded the WUDFSVC.dll it does not remedy the issue either. Just trying to play Dawn of War 3 but it just constantly crashes my computer with no error message from the game or Steam and no clear answer in Event Viewer. I have also run system checks through tweakbit along with their repair service with no effect on the situation. All of my scans and checks have come back with nothing missing and nothing wrong. Have even done Command Prompt scans as well. List of the games I have tried with this issue are: Dawn of War 3, Dawn of War 2 retribution, Cuisine Royale, and Warface. I also regularly play: Call of Duty Black Ops II, Call of Duty Modern Warfare, Tom Clancy's Rainbow Six Siege, and Escape From Tarkov with no issues and no crashes to my whole system. Any assistance would be greatly appreciated. ","solutions":["Hi Special1Guy, Can you remember if you had this issue after an update from Windows as well? If yes, what I can suggest is to rollback the updates: https:\/\/lifehacker.com\/how-to-undo-and-prevent-...And disable your windows update for the mean time, please follow this link for detailed guide:https:\/\/www.cleverfiles.com\/howto\/disable-updat...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","- Have you updated Win10 to v1909 ?  Also trawled multiple www and Steam forums for the troublesome titles ?\"I also regularly play: Call of Duty Black Ops II, Call of Duty Modern Warfare, Tom Clancy's Rainbow Six Siege, and Escape From Tarkov with no issues and no crashes to my whole system\"- Then it would seem there is something wrong with the other games, not Windows or hardware faults. Interesting the troubled gamessystem specs are different. Particularly Warface using only DX9.- Are the games flashing on the setup screens or only when loading the game play ?- Have the games been modded ?- Do you have Nvidia's DSR  option enabled ? I have a couple of games that have issues with DSR enabled, but I don'trecall if they caused flashing before the game locked up. - Have you reinstalled the current Nvidia driver since 'rolling back' to an older driver ? If not it would be best to reinstall the current driver(when 'rolling back' avoid doing so via Device Manager. If not using the driver updater in the 'Experience' it's better to uninstallvia Programs and Features, reboot and install an older driver from  Nvidia's download site  ).- Are you using any graphics or system 'optimising' software such as MSI Afterburner ? Recording game play ?[EDIT: Ah! Tweakbit. Honestly, these 'optimisers' are not necessary, and very often cause problems. Particularly if theyhave a Registry 'cleaner'. I have nothing against AusLogics though. I still use their defrag tool. ]You could try doing a Clean Boot to help isolate conflicts fromServices or Start Up programs (note this does not isolate programsyou may launch manually after booting into Windows which may also cause conflicts, so keep them in mind as well).How to troubleshoot a problem by performing a clean boot\"when I have downloaded the WUDFSVC.dll \"This is a Windows system file, so I would have thought System File Checker would repair it if it were corrupted.However, I also expect the error is misleading. If the file were corrupt or missing and related to a flashing screen lock upI reckon all games would be affected.Using System File Checker in Windows 10- Did you register the downloaded .dll file ?  https:\/\/support.microsoft.com\/en-us\/help\/844592\/how-to-register-a-dll-filebtw - Disabling driver updates from Windows Updates is a good idea, but unless using an old machine that is onlymarginally compatible with Win10, I'm not a fan of rolling back to earlier versions of Win10.  It just leads to new issues in future,and the process of rolling back is not without risks. I reckon it's best to try and sort out the issues at hand..","Appreciate the response. To answer the first it is never consistent on where it crashes with Dawn of War 2 Retribution it crashes after you open the game and get past the opening cinematic, with Dawn of War 3 it will crash either as soon as it loads the level or will let you play for several minutes, Cuisine Royale let me play a full game and when I came back to the main lobby screen I collected a few rewards and then it crashed, with Warface it will allow me to search for a game and mess around in the shooting range pre lobby warm up but then crashes when I assume it finds a game(I don't get a notification or anything for finding a game it just crashes after sitting in queue for a bit). The crashes aren't consistent which makes this whole diagnosing that much harder. I have also done a clean boot a few different times with no change either. The Windows Driver Foundation does not appear on my system at all which concerns and confuses me as well, and when downloading the file it also had no effect on the issue. I talked with Nvidia support and they had given me a link to go and download a previous driver and I did reinstall the current driver as well but still have the same issues. All of my Windows updates and drivers are all up to date I have also tried uninstalling the Graphics Card driver in Device manager and restarting to allow it to reinstall itself. I can post the Event Viewer errors I have encountered if that would give any more helpful info. Also I did register the dll when I initially tried to register it I got an error saying it did not exist in the binary which led me to find that I did in fact not have that dll or WDF present on my system. I do not have any other optimizing software other than what Nvidia Geforce experience offers. I have even tried dropping the graphic settings of the games but it does not help either. There is also no overclocking or overheating going on either. I apologize for the one long paragraph also not the best at formatting my writing but I do appreciate your assistance."]},{"symptom":"Windows Hello compatible camera can't be found anymore        Hey,a couple of days ago my Windows Hello compatible camera stopped working all of a sudden. On the Windows lock screen I see a message\"Sorry, something went wrong. Please login with your PIN\" and in the Sign-in options in settings I see \"We couldn't find a camera compatible with Windows Hello\". I didn't install any Windows Update right before that happened and I also didn't install any tools or updated drivers or anything. It really happened all of a sudden. It worked on one log-in attempt and did no longer after another log-in attempt.The camera itself is okay. I re-installed the SSD that came with my PC with a (nearly) straight from the factory Windows and the camera works perfectly fine there, so I'm pretty sure it's not a hardware problem here. My computer is an ASUS Zenbook Pro 14.I'm running Windows 10 with the 1903 Update, Build 18362.267 and as I mentioned, it just stopped working all of a sudden. I'm pretty sure I haven't installed any software or drivers or updates right before it stopped working (I might be wrong though).I cannot even remove the Windows Hello Face Recognition because the button is disabled (see screenshot below).Long story short: my Windows Hello compatible webcam is no longer recognized as such and I have no idea why. Appreciate any tips!\/\/ edit: I already uninstalled the camera driver in the device manager and I also tried to install newer drivers using Driver Easy, both without success.\/\/ edit 2: I also tried “Sfc \/scannow” and \"dism \/online \/cleanup-image \/restorehealth\" now. Everything seems to be fine. Except ... it's not.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you get an error when using Windows Hello Face, we will look into this for you. However, in order to help you with the appropriate troubleshooting steps, please reply with the following details: Are you able to use the Camera through Camera application?When you say, “I re-installed the SSD that came with my PC with a (nearly) straight from the factory Windows and the camera works perfectly fine” were you able to use Windows Hello Face after installing the old SSD? I see that there are multiple models for Asus ZenBook Pro 14, I suggest you to help us with the exact model of the laptop that you are using. To find the details typemsinfo32 in the search bar on the Taskbar and hitEnter. Share the System Model along with System SKU.  However, you can try resetting the Windows Hello Biometric Database and check if that helps. Please follow the steps mentioned below: Press Windows key + R, to open Run dialog box.Type services.msc and click on OK.Look for Windows Biometric Service, double click on it and click onStop.Now, go to C:\\Windows\\System32\\WinBioDatabase, take a backup of all the files inside theWinBioDatabase folder.After taking a backup of the files, delete all the files.Now, open Services by following step 1 and 2, and restart theWindows Biometric Service.Go to Start >> Settings >> Accounts >> Sign-in options and register the Face data again. Please reply with the status of the issue, we will be glad to help you further. Regards, Nikhar KhareMicrosoft Community - Moderator","Hi Nikhar,sorry for my late reply, I haven't been notified about your answer.So to answer your questions:> Are you able to use the Camera through Camera application?Yes. The camera app that comes with Windows itself (and basically all other apps using the camera I tested like e.g. Skype) works perfectly fine! Only the infrared functionality seems to not be recognized\/working.> were you able to use Windows Hello Face after installing the old SSD?Yes! Once I installed the old SSD Windows Hello Face worked like a charm again! So I guess it can be excluded that it's a hardware issue. The Windows on the old SSD was an older version though (not exactly sure but I think it was 1803 compared to now 1903). I installed 1903 already like 2 months ago or so and Windows Hello Face still worked fine in the beginning so I am also quite sure that it has not directly anything to do with the upgrade to 1903.The relevant info from msinfo32:Betriebsystemname                 Microsoft Windows 10 Pro Version 10.0.18362 Build 18362Weitere Betriebsystembeschreibung Nicht verfügbarBetriebsystemhersteller           Microsoft CorporationSystemname                        ZBP-14Systemhersteller                  ASUSTeK COMPUTER INC.Systemmodell                      ZenBook Pro 14 UX450FDX_UX480FDSystemtyp                         x64-basierter PCSystem-SKU Prozessor                         Intel(R) Core(TM) i7-8565U CPU @ 1.80GHz, 1992 MHz, 4 Kern(e), 8 logische(r) Prozessor(en)BIOS-Version\/-Datum               American Megatrends Inc. UX450FDX.300, 28.09.2018For some reason, System-SKU is just empty.What confuses me a little bit is that the \"Infrared Devices\" section in msinfo32 is completely empty …When I delete the files in C:\\Windows\\System32\\WinBioDatabase and then open Sign-in options I still see the same error message as in the screenshot of my initial post: \"This option is currently unavailable\".I just googled and found out about the Windows Camera FrameServer service which as not running and the start mode was set to \"Manual\". I started it now but nothing changed.","Hi,So I have the same problem. Same as displayed in the screenshot from the OP.Mine is a Surface Book. Win 10 version 10.0.18362.295.Today I received a Surface Camera Windows Hello driver update, although having shutdown\/restarted a few times, the error is the same when trying to re-enable face sign-in.Have read through the details around Group Policy - I believe my machines policy is correct and my machine is stand-alone, not in a Domain.Have deleted the biometric database files while the Windows Biometric Service was stopped, still same problem.A frustrating issue but given the quality of the OP and also the first reply from Microsoft, I'm encouraged that we can together get it solved.So, Microsoft, what do you need from me to assist?Thanks in advance,Scott","An update to my last reply.Following a few more shutdown\/restarts (with no other tasks in-between), all seems to be back to normal thankfully.To recap, this seems to have been solved by the Surface Camera Windows Hello driver update, received earlier today.Will feedback here again should this change.Regards,Scott","Hope you're also back up & running chap.","I have the same problem with a HP Spectre x360 Convertible 15-bl1XX.Hello Face stopped working after the update to Windows 10 1903. (Microsoft Windows [Version 10.0.18362.267])Tried to install the latest camera driver again several times but no result. Keeps saying something went wrong. If I look at the options it says no compatible camera is found.","I got it working again, yes! I don't know if this was how I fixed it, but I'm almost sure. I had two files HelloFace.inf and HelloFaceMigration.inf inC:\\Windows\\System32\\WinBioPlugIns\\FaceDriver. I right clicked them, selected \"Install\", restarted and now it's working again!","Yes!!!This also worked for me!Thanks ManuelBieh","I got it working again, yes! I don't know if this was how I fixed it, but I'm almost sure. I had two files HelloFace.inf and HelloFaceMigration.inf inC:\\Windows\\System32\\WinBioPlugIns\\FaceDriver. I right clicked them, selected \"Install\", restarted and now it's working again!THIS GUY IS THE TRUE GENIUS! Thank you!","I got it working again, yes! I don't know if this was how I fixed it, but I'm almost sure. I had two files HelloFace.inf and HelloFaceMigration.inf inC:\\Windows\\System32\\WinBioPlugIns\\FaceDriver. I right clicked them, selected \"Install\", restarted and now it's working again!This worked! Thank  you very much!"]},{"symptom":"Windows 10 - doesn't recognize my user, even if I log into my account        When I start up my computer and I log into my account it somehow throws me into a a guest or a temporary user.  All of my documents are \"gone\", programs are \"missing\"  They are there though in my user name.  My internet history is missing.  I can open a chrome window and all of my recently viewed icons under the search area are missing.  Then I can open a new browser and it's there again.  It kind of flip flops from me being in my user to me not being in my user account.  Anyone have any idea how to fix this issue?","solutions":["Chanie, this is happening much too often at the moment, you are logged into a temporary account . . .Before you do anything or move any files around Restart (not shut down) your PC 4 times, each time let your PC get to the Desktop before the next restart, this will fix this issue a lot of the time . ..Otherwise: Please open Windows File Explorer Navigate to C:\\Users Do you see two user folders that look like yours? Open those folders and check inside Pictures, Documents . . . etc. and see if your files are thereIf your files are there: Create a new user profile with Admin privileges Log into the new user profile Copy all your data from the old profile to the new profile (Documents Library, Pictures Library . . . etc.)If you still have not found your files, look for a Windows.old folder on your C Drive, expand that to open the users folder contained inside - check there for your files, icons . . .etc.If you do find your files . . . etc. there, copy them out as soon as possible as Windows will remove the Windows.old folder in timeNOTE VERY IMPORTANT: Do Not copy your files into the Temporary profile you are currently in, when the situation is corrected, your files will be deleted with the Temporary Profile and will not be recoverable !!"]},{"symptom":"update problem for KB4533002 and KB4530684        HiIm trying to update my pc and whenever it trys to install the two following updates:2019-12 Cumulative Update for .NET Framework 3.5 and 4.8 for Windows 10 Version 1903 for x64 (KB4533002)and2019-12 Cumulative Update for Windows 10 Version 1903 for x64-based Systems (KB4530684)the updates download and the computer reboots.It installs the updates on the blue screen and once it gets to 100% installed it says it cant install and uninstalls the whole thing and wants to start again a very time consuming processpc has i7-4790 and 16gb ram windows 10 pro version 1903any ides what I can do?thanksG","solutions":["Hi, GEE My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.If you have problems updating Windows, follow these steps: If you have a third-party antivirus, you must disable or uninstall it. Try reset Windows update components: Right click on the start button and select Powershell (admin) or Command Prompt (admin)Write the next hit enter after each line. net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Restart and try again. You can also download the Windows Error Solver: https:\/\/support.microsoft.com\/en-us\/help\/10164\/...https:\/\/aka.ms\/wudiag You can do it manually by downloading the Windows ISO. When updating with the ISO, disconnect the Internet. https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"OneDrive syncing        I actually have a couple issues. My PC has 5 Users and files are stored all over the place.  Most will not be on OD, but some will.  Should I\/Can I consolidate the files into one central location first?Yesterday while setting up OD on my laptop I accidently included my Music folder with 54gb.  My estimate is that it will take 3-5 days to upload everything.  Can I stop the upload process for just the music?  It looks like the upload is not in any logical order because I see a document being uploaded, then a song, then maybe a picture.","solutions":["Files should not be stored 'all over the place.' Microsoft originally designed Windows with the idea that each user stores their files in their own user account, which is also known as their user profile. For example, userA would store their files like this:C:\\Users\\userA\\DocumentsC:\\Users\\userA\\MusicC:\\Users\\userA\\PicturesC:\\Users\\userA\\VideosIt's very important to follow this model, because these are the folders where Windowsexpects us to store our personal files. For this reason, these folders are never touched when Microsoft updates Windows 10. If we store our personal files anywhere else, where Windows doesn't expect them to be, our files may very well get erased when Windows is updated. This is particularly true for the semi-annual feature updates, which can and do make wholesale changes to Windows.More recently, Microsoft has (finally) joined the rest of the computing industry, which increasingly stores users' personal files online (aka, 'the cloud'.) There are very good reasons for doing this, but that's a different topic.Unfortunately, Microsoft is implementing this change in its usual, confusing, ham-fisted way, which sends users running to this forum asking 'what the ...' So here's how it works:Google (who came first) and Microsoft both have apps (applications, programs) that make it easy for us to store our personal files in 'the cloud,' which - for Google - is called Google Drive and - for Microsoft - is called OneDrive. You can think of the app as a tunnel, because that's really what it is. You drop files into one end of the tunnel - located on your computer - and they slide through the tunnel and come out the other end - the cloud.The part of the tunnel that opens into your computer is represented by a folder. For Windows 10, the folder is called - wait for it - One Drive. Thus, once you put a file into the OneDrive folder, it falls into the tunnel and comes out in OneDrive. Google Drive works similarly, as do Apple and Amazon.Now here's where it gets unnecessarily complicated: When you put a file or a folder into the OneDrive folder, the file or folder continues to appear in the OneDrive folder, which gives you the impression that it's still on your computer, except it's not - it only looks that way. In reality, it's on OneDrive. So when you make changes to that file or to that folder, you are actually making changes to the file or folder on OneDrive.This is why I personally don't bother with the OneDrive app or the Google Drive app. Instead, I upload files directly to OneDrive and Google Drive, by opening them with my web browser and dragging files onto the web page. Similarly, I work with those files and folders directly in OneDrive and Google Drive. Now there is no confusion about where my files are located.With all this as background, I will (at last!) get to your questions:1- You very definitely should consolidate your users' personal files into as few places as possible. For files that your users want to keep on the computer, store those files only in each user's personal profile. Not only does that make it easy to find them, they won't ever get erased by an update. (Which doesn't mean that you don't have to back them up anyway.)For files that your users want to keep in the cloud, store them directly in OneDrive and work with them directly in OneDrive. Microsoft makes that easy to do.If, instead, your users want to store their personal files in the OneDrive folder, it's not my place to say 'no, don't do that.' But because I don't work that way myself, I don't feel qualified to provide advice.2- There are two reasons why it's not a good idea to upload many gigabytes of data to cloud storage at one time: 1) ISPs typically provide severe caps on upload speed (for their own reasons) and cloud storage websites also apply a cap. Both OneDrive and Google Drive have buttons you can click on to cancel uploads in progress.","Thanks so much for the reply. This nightmare started at least 8-10 years ago with a hard drive with a bunch of bad sectors.  The shop I took it to decided first to partition, then because my husband couldn't find the files he wanted, the guy made both of us as users (gldn and JaciS). Then my husband took a bunch of my files (like pictures)  and copied them to his space. From there the monster just grew.  When I finally replaced that computer the shop set up another user Jaci5 ( I think it was a typo for JaciS) and copied everything from both users files into that group.  Now I have a lot of things triplicated on the computer. I just got the new laptop a couple days ago and wanted to sync the pc and laptop.  Now we are up to yesterday. Today I moved everything to SIEHLS and in doing so reorganized and consolidated.  I ended up removing over 60,000 files (including music, photos, and files in there as many as 4 times).  Now everything is neat and clean. I would now like to remove the extra users.  Also yesterday a Micosoft support person set up OneDrive, but it was wrong.  I don't want everything on the cloud.....just files I am working on so I can do stuff at lunch and not haul my computer around.  I was supposed to have a folder on my desktop called SYNC TO OD to drag and drop files in.  But when I opened it this morning my file wasn't there.  And I was over the max for the free account.  I was told to just remove files from there I didn't want on the cloud.  But every time I moved a bunch out it automatically filled the open space because it had my pictures folder select to sync.  I had to pay for extra space just so I could get caught up.I fixed my syncing folder EXCEPT with a heavy finger I grabbed the music folder instead of 3 songs.  I think right now I just need to let it do its thing and when it is done in a few days I can fix it.  Your opinion?","I fixed my syncing folder EXCEPT with a heavy finger I grabbed the music folder instead of 3 songs.  I think right now I just need to let it do its thing and when it is done in a few days I can fix it.  Your opinion?Whether you cancel the upload now or let it go on to completion is really up to you. If you want to have all those files in OneDrive, let it go on. But realize that the upload to OneDrive is using the upload bandwidth from your ISP, so there's less upload bandwidth available for other uploading that you may wish to do.I didn't get into this earlier because that post was long enough (!) but the way Microsoft has over-complicated the OneDrive app (in my view) is by making it more than just the tunnel I spoke of earlier. Instead, the OneDrive folder is supposed to be a combination of what's in OneDrive and what's on your computer. That's very confusing and causes lots of problems for people who post here.Again, this is only my opinion, but what's in OneDrive is one thing and what's on your hard drive is a separate thing. This is how Google handles Google Drive. I see no point in mixing files from separate places together.Your computer should have 3 or possibly 4 user accounts:A computer should have one (and only one) user account with Administrators permissions, for tasks that require elevated permissions. In practice, you'll rarely need to sign in to that user account.All other user accounts should be Users accounts, also known as Standard accounts or Limited accounts or whatever Microsoft decides to call them next week. So, one Users account for you and one Users account for your husband, and possibly a third users account for use by guests in your house.","You are person after my own heart!  All I want is a computer to do my work and a place to backup filez and an easy way to take my work with me when I need to.  I think I'll go back to dumping OneDrive and use a flash drive for portable files and an externak hard drive and sync me laptop and pc as backups.  It worked like that for the past 10 years.  I lost everything in a fire a year ago, but I grabbed my pc & laptop and never missed a file.","Glad that I could help."]},{"symptom":"Windows can't be repaired        I have a Lenovo IdeaPad 520. I installed some Windows updates yesterday, though I am not sure the installation was completed. I don't exactly remember, but I might have turned off the laptop before the updates had time to install. When I turned on the laptop next the screen froze at \"Undoing changes made to your computer\". I tried booting using a USB stick which works fine on another laptop (I made sure that it is the first option in BIOS). After the Lenovo logo another error appears: \"Windows can't be repaired\" (alternately errors 0xc0000221 or 0xc0000098) and there is an option to press F8 and select an action. When I try to select any of them (safe mode or Command Prompt, for example) it gets back to the \"Windows can't be repaired\" or \"Your PC ran into a problem and needs to restart\" (0xc000021a). I really don't know what else I can do. Would it solve by itself if I let the \"Undoing changes\" on for a while? I would try to install Windows again but I can't do that either because of the errors. ","solutions":["Hi, LucianaCraciun My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"WiFi stopped working        After Windows 10 update, WiFi stopped working on my laptop. Can you help me fix it?","solutions":["Hi Øyvind, my name is Max and I'm an independent advisor. Can you see wi-fi network icon on the tray system? I suggest you follow the stepsStep 1. 1. Press Windows + I on your keyboard to open Settings. 2. Tap on Update and Security 3. Tap on Troubleshooting - Internet Connections. 4. Tap on Run the troubleshooting tool and follow the instructions. Step 2. 1. Press Windows + I on your keyboard to open Settings. 2. Tap on Update and Security 3. Tap on Troubleshooting - Find and solve other problems. 4. Tap on network card - Run the troubleshooting tool. 5. Select the network card that you are using or all 6. Click on Next. Step 3 1. Press Windows + I on your keyboard to open Settings. 2. Tap on Network and Internet - Status. 3. Click on Network Reset on the right pane and follow the instructions. More info about fixing wi-fi problems https:\/\/support.microsoft.com\/help\/4000432\/wind..."]},{"symptom":"Pictures        what does it mean when pictures have an image of blue mountains with an x on bottom left corner?","solutions":["Hi Judith Is the X on a red circle, or is that just a gray X? Where do you store your pictures are o your PC or are those stored on OneDrive . . .The image pf blue mountains means your PC is showing icons rather than thumbnails, try this to see if you can see the thumbnails rather than icons . . .Open File Explorer Navigate to a folder with jpg files On the View Ribbon (tab), cheese large, medium or small icons Then click the Options button at the end of the View Ribbon On the View Tab on the resulting dialog, uncheck 'Always show icons, never Thumbnails'Then click 'Apply to folders' and confirm that Click Apply and OK That should fix this problem . . ."]},{"symptom":"im using internet sometimes automatically my wifi is disconnecting and after few minutes automatically connecting .....how to solve        im using internet sometimes automatically my wifi is disconnecting and after few minutes automatically connecting ..... how to solve issue","solutions":["Hi, manoharperla My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps to repair your Internet connections: Enter the Start menu or by pressing the Win + I key combination, open the Settings and click on the Network and Internet option. Once there, we select the Status option from the menu on the left side and, within the configurations and options that are loaded in the right panel, we have to look for the restoration of the network. When you click on this option, it will show us a new window from where we can restore the network in Windows 10. In this way, all network adapters will be removed and reinstalled, and the original configuration of other network components will be restored. net. This implies that if we were using some software, such as a VPN client or virtual switches, we will have to reinstall them.A process that the system performs automatically by clicking on the Reset button that is now displayed in Network Reset in Windows 10 settings. It is normal for the process to not take long, although we must wait until the end completely and restart the computer to continue with the network configuration in Windows 10 as we have done so far.https:\/\/www.kapilarya.com\/how-to-reset-network-...https:\/\/support.microsoft.com\/en-us\/help\/10741\/...You can also check that your drivers are updated. https:\/\/support.microsoft.com\/en-us\/help\/402844...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Activate Windows 10        I had a Dell computer for many years and it went through many upgrades.  The last upgrade was the free Windows 10 update.  Recently, the hard disk crashed and I have no way of accessing any information from it.  I created a recovery disk boot disk and downloaded Windows 10.  The problem is that I can't Activate Windows.  Any help will be appreciated.","solutions":["Hi Rick Reinstalling Windows 10, whether on a new drive or not should not affect your Windows 10 activation or licencingGenerally activation problems after re-installing Windows 10 are caused by installing an Edition (Home, Pro . . etc) that does not match the previously installed editionOpen the Settings App (gear icon on your Start Menu) Go to System - About Does the edition reported there match the previously installed edition? If it does, what is the exact Activation error reported in Settings - Update and Security - Activation?","I don't know what the previously installed edition was?  My original versions of the Windows OS was Windows 7, followed by Windows 8 and then the free upgrade from Microsoft to Windows 10.","Hi Rick If you originally started with Windows 7, is there a Windows 7 sticker on the base of your PC or laptop, if that is a laptop, that may be in the battery bayThat sticker should report what edition of Windows should be installed on your PC . . .","Thanks Dave... there was a tag on my dead computer.  I used the code and activation was successful.Thanks and have a great New Year!","Hi Rick, I am glad this is resolved . . ."]},{"symptom":"PC has started crashing when using programs that are very demanding of it        Around two weeks ago, my PC started crashing when I use programs (so far it's only been games) that are very demanding of it. Even ones that have been working without issues for years have been a cause of this. I don't know this for sure, but I think the issue has something to do with my hard drive and Windows Update.The whole thing may have started back in September when my PC crashed. Back then I got a blue screen and after that it wouldn't boot up properly anymore. I can't remember how I fixed it back then anymore, but no further crashes occured after that, so I didn't investigate any further. What was noticeable, however, was that my PC was somewhat slower after that and disc usage was often at 100%. Also, Windows updates didn't install themselves anymore. I assume some system files were damaged back then.Anyway, as I mentioned, my PC started crashing constantly two weeks ago, but only when I was trying to play games that were very demanding of it. I ran a bunch of the repair programs Windows provides (eventually, all of them said that they managed to fix the problems), did a bunch of research on the internet but still wasn't able to fix the problem properly. What I managed to do, however, was to get Windows Update to install updates again, except for two (Windows 8.1 KB3063843-x64 and Windows 8.1 KB2990967-x64). I installed them manually just now, yet they still show up when I search for updates, which seems weird to me.Also, the Windows Reliability monitor shows that almost every time when a crash occured the Origin Web Helper crashed (marked with a red X), making it seem like this is somehow related to this as well. I disabled it just now, so I'm not sure if this was any impact on the whole thing or not. I also disabled Windows Problem Reporting because it often caused high disc usage.Here is my PC info:  OS: Windows 8.1 (64 bit system) Processor: Intel Core i5-4460 CPU @ 3.20GHz RAM: 8GB Graphic card: NVIDIA GeForce GTX 960 HDD: Toshiba DT01ACA100I also ran the sfc \/scannow command and it told me that there were some issues with files that it wasn't able to fix.Here are some of the parts from the CBS.log that stick out:2020-01-05 12:00:19, Info                  CBS    Loaded Servicing Stack v6.3.9600.19459 with Core: C:\\Windows\\winsxs\\amd64_microsoft-windows-servicingstack_31bf3856ad364e35_6.3.9600.19459_none_fa42f0179b24f5c2\\cbscore.dll2020-01-05 12:00:20, Info                  CSI    00000001@2020\/1\/5:11:00:20.012 WcpInitialize (wcp.dll version 0.0.0.6) called (stack @0x7ffffd277fc9 @0x7ffffd554914 @0x7ffffd55414b @0x7ff7c252d69a @0x7ff7c252e55b @0x7ff830ef2113)2020-01-05 12:00:20, Info                  CBS    SQM: Initializing online with Windows opt-in: False2020-01-05 12:00:20, Info                  CBS    SQM: Cleaning up report files older than 10 days.2020-01-05 12:00:20, Info                  CBS    SQM: Requesting upload of all unsent reports.2020-01-05 12:00:20, Info                  CBS    SQM: Failed to start upload with file pattern: C:\\Windows\\servicing\\sqm\\*_std.sqm, flags: 0x2 [HRESULT = 0x80004005 - E_FAIL]2020-01-05 12:00:20, Info                  CBS    SQM: Failed to start standard sample upload. [HRESULT = 0x80004005 - E_FAIL]2020-01-05 12:00:20, Info                  CBS    SQM: Queued 0 file(s) for upload with pattern: C:\\Windows\\servicing\\sqm\\*_all.sqm, flags: 0x62020-01-05 12:00:20, Info                  CBS    SQM: Warning: Failed to upload all unsent reports. [HRESULT = 0x80004005 - E_FAIL]2020-01-05 12:00:20, Info                  CBS    Startup: BlockTime: 10800000ms, BlockTimeIncrement: 900000ms2020-01-05 12:00:20, Info                  CBS    SetProgressMessage: progressMessageStage: 0, ExecuteState: ExecuteStateNone, SubStage: 02020-01-05 12:00:21, Info                  CBS    Session: 30785477_3388353173 initialized by client WindowsUpdateAgent.2020-01-05 12:00:21, Info                  CBS    Startup: Mark session as corrupt since it is neither complete nor pended, Session: 30785477_33883531732020-01-05 12:00:21, Info                  CBS    Session: 30785477_3409752320 initialized by client WindowsUpdateAgent.2020-01-05 12:00:21, Info                  CBS    Startup: Mark session as corrupt since it is neither complete nor pended, Session: 30785477_34097523202020-01-05 12:00:21, Info                  CBS    Session: 30785477_3422133890 initialized by client WindowsUpdateAgent.2020-01-05 12:00:21, Info                  CBS    Startup: Mark session as corrupt since it is neither complete nor pended, Session: 30785477_34221338902020-01-05 12:00:21, Info                  CBS    Session: 30785477_3437815015 initialized by client WindowsUpdateAgent.2020-01-05 12:00:21, Info                  CBS    Startup: Mark session as corrupt since it is neither complete nor pended, Session: 30785477_34378150152020-01-05 12:00:21, Info                  CBS    Session: 30785477_3489231187 initialized by client WindowsUpdateAgent.2020-01-05 12:00:21, Info                  CBS    Startup: Mark session as corrupt since it is neither complete nor pended, Session: 30785477_34892311872020-01-05 12:00:22, Info                  CBS    Session: 30785477_3531331487 initialized by client WindowsUpdateAgent.2020-01-05 12:00:22, Info                  CBS    Startup: Mark session as corrupt since it is neither complete nor pended, Session: 30785477_35313314872020-01-05 12:00:22, Info                  CBS    Session: 30785477_3535414845 initialized by client WindowsUpdateAgent.2020-01-05 12:00:22, Info                  CBS    Startup: Mark session as corrupt since it is neither complete nor pended, Session: 30785477_35354148452020-01-05 12:00:22, Info                  CBS    Session: 30785477_3594857324 initialized by client WindowsUpdateAgent.2020-01-05 12:00:22, Info                  CBS    Startup: Mark session as corrupt since it is neither complete nor pended, Session: 30785477_35948573242020-01-05 12:00:22, Info                  CBS    Session: 30785478_1388668456 initialized by client WindowsUpdateAgent.2020-01-05 12:00:22, Info                  CBS    Startup: Mark session as corrupt since it is neither complete nor pended, Session: 30785478_13886684562020-01-05 12:00:22, Info                  CBS    Session: 30785478_1400426855 initialized by client WindowsUpdateAgent.2020-01-05 12:00:22, Info                  CBS    Startup: Mark session as corrupt since it is neither complete nor pended, Session: 30785478_14004268552020-01-05 12:00:22, Info                  CBS    Session: 30785478_1404192360 initialized by client WindowsUpdateAgent.2020-01-05 12:00:22, Info                  CBS    Startup: Mark session as corrupt since it is neither complete nor pended, Session: 30785478_14041923602020-01-05 12:00:22, Info                  CBS    Session: 30785478_1563311686 initialized by client WindowsUpdateAgent.2020-01-05 12:00:22, Info                  CBS    Startup: Mark session as corrupt since it is neither complete nor pended, Session: 30785478_15633116862020-01-05 12:00:22, Info                  CBS    Session: 30785478_1566986405 initialized by client WindowsUpdateAgent.2020-01-05 12:00:22, Info                  CBS    Startup: Mark session as corrupt since it is neither complete nor pended, Session: 30785478_15669864052020-01-05 12:00:23, Info                  CBS    Session: 30785478_1650601447 initialized by client WindowsUpdateAgent.2020-01-05 12:00:23, Info                  CBS    Startup: Mark session as corrupt since it is neither complete nor pended, Session: 30785478_16506014472020-01-05 12:00:23, Info                  CBS    Session: 30785478_1654950433 initialized by client WindowsUpdateAgent.2020-01-05 12:00:23, Info                  CBS    Startup: Mark session as corrupt since it is neither complete nor pended, Session: 30785478_16549504332020-01-05 12:00:23, Info                  CBS    Session: 30785478_1776045339 initialized by client WindowsUpdateAgent.2020-01-05 12:00:23, Info                  CBS    Startup: Mark session as corrupt since it is neither complete nor pended, Session: 30785478_17760453392020-01-05 12:00:23, Info                  CBS    Session: 30785478_1785082174 initialized by client WindowsUpdateAgent.2020-01-05 12:00:23, Info                  CBS    Startup: Mark session as corrupt since it is neither complete nor pended, Session: 30785478_17850821742020-01-05 12:00:23, Info                  CBS    Session: 30785687_825657436 initialized by client WindowsUpdateAgent.2020-01-05 12:00:23, Info                  CBS    Startup: Mark session as corrupt since it is neither complete nor pended, Session: 30785687_8256574362020-01-05 12:00:23, Info                  CBS    Retrieved original failure status: 0x00000000, last forward execute state: CbsExecuteStateStageDrivers2020-01-05 12:00:23, Info                  CBS    SetProgressMessage: progressMessageStage: 0, ExecuteState: ExecuteStateNone, SubStage: 02020-01-05 12:00:23, Info                  CBS    Setting ExecuteState key to: CbsExecuteStateStageDrivers2020-01-05 12:00:23, Info                  CBS    Setting RollbackFailed flag to 02020-01-05 12:00:23, Info                  CBS    Clearing HangDetect value2020-01-05 12:00:23, Info                  CBS    Saved last global progress. Current: 0, Limit: 1, ExecuteState: ExecuteStateNone2020-01-05 12:00:23, Info                  CBS    Execute state was not set.  Assuming ExecuteStateStart.2020-01-05 12:00:23, Info                  CBS    Startup: current ExecuteState is CbsExecuteStateStageDrivers2020-01-05 12:00:23, Info                  CBS    SetProgressMessage: progressMessageStage: 0, ExecuteState: CbsExecuteStateStageDrivers, SubStage: 02020-01-05 12:00:23, Info                  CBS    Disabling LKG boot option2020-01-05 12:00:23, Info                  CBS    Startup: Initializing driver operations queue.2020-01-05 12:00:23, Info                  CBS    Startup: Initializing advanced operation queue.2020-01-05 12:00:39, Info                  CSI    00000002 CSI Store 574563034352 (0x00000085c6a024f0) initialized2020-01-05 12:00:39, Info                  CBS    Startup: Waiting for SC autostart event2020-01-05 12:00:39, Info                  CBS    Startup: SC autostart event signaled2020-01-05 12:00:39, Info                  CBS    Failed reading PoqexecCmdline registry key [HRESULT = 0x80070002 - ERROR_FILE_NOT_FOUND]2020-01-05 12:00:39, Info                  CBS    Failed to get poqexec cmdline from Components\\Configuration. [HRESULT = 0x80070002 - ERROR_FILE_NOT_FOUND]2020-01-05 12:00:39, Info                  CBS    Setting ExecuteState key to: CbsExecuteStateResolvePending2020-01-05 12:00:39, Info                  CBS    SetProgressMessage: progressMessageStage: -1, ExecuteState: CbsExecuteStateResolvePending, SubStage: 02020-01-05 12:00:39, Info                  CBS    Startup: Processing advanced operation queue, startupPhase: 02020-01-05 12:00:39, Info                  CSI    00000003 IAdvancedInstallerAwareStore_ResolvePendingTransactions (call 1) (flags = 0000000a, progress = NULL, phase = 0, pdwDisposition = @0x85c6eedf502020-01-05 12:00:39, Info                  CSI    00000004 Creating NT transaction (seq 1), objectname [6]\"(null)\"2020-01-05 12:00:39, Info                  CSI    00000005 Created NT transaction (seq 1) result 0x00000000, handle @0x2482020-01-05 12:00:39, Error                 CSI    00000006 (F) STATUS_RM_NOT_ACTIVE #152# from Windows::Rtl::SystemImplementation::DirectRegistryProvider::SysOpenKey(flg = (AllowAccessDenied), key = {provider=NULL, handle=0, name= (\"null\")}, da = (KEY_SET_VALUE|KEY_WOW64_64KEY), oa = @0x85c6eed240->OBJECT_ATTRIBUTES {s:48; rd:NULL; on:[28]\"\\Registry\\Machine\\COMPONENTS\"; a:(OBJ_CASE_INSENSITIVE)}, disp = Unmapped disposition: 3337539632 (0xc6eed030))[gle=0xd0190005]2020-01-05 12:00:39, Error                 CSI    00000007@2020\/1\/5:11:00:39.197 (F) base\\wcp\\sil\\merged\\ntu\\ntsystem.cpp(3813): Error STATUS_RM_NOT_ACTIVE originated in function Windows::Rtl::SystemImplementation::DirectRegistryProvider::SysOpenKey expression: (null)[gle=0x80004005]2020-01-05 12:00:39, Info                  CBS    Added C:\\Windows\\Logs\\CBS\\CBS.log to WER report.2020-01-05 12:00:39, Info                  CBS    Added C:\\Windows\\Logs\\CBS\\CbsPersist_20200101112829.log to WER report.2020-01-05 12:00:39, Info                  CBS    Added C:\\Windows\\Logs\\CBS\\CbsPersist_20200101112142.log to WER report.2020-01-05 12:00:39, Info                  CBS    Added C:\\Windows\\Logs\\CBS\\CbsPersist_20191231095816.log to WER report.2020-01-05 12:00:39, Info                  CBS    Added C:\\Windows\\Logs\\CBS\\CbsPersist_20191230143453.log to WER report.2020-01-05 12:00:39, Info                  CBS    Added C:\\Windows\\Logs\\CBS\\CbsPersist_20191230140708.log to WER report.2020-01-05 12:00:39, Info                  CBS    Could not get active session for current session file logging [HRESULT = 0x80004003 - E_POINTER]2020-01-05 12:00:39, Info                  CBS    Not able to add pending.xml to Windows Error Report. [HRESULT = 0x80070002 - ERROR_FILE_NOT_FOUND]2020-01-05 12:00:39, Info                  CBS    Not able to add pending.xml.bad to Windows Error Report. [HRESULT = 0x80070002 - ERROR_FILE_NOT_FOUND]2020-01-05 12:00:39, Info                  CBS    Not able to add SCM.EVM to Windows Error Report. [HRESULT = 0x80070002 - ERROR_FILE_NOT_FOUND]2020-01-05 12:00:39, Info                  CBS    Succesfully flushed NtfsLog.etl2020-01-05 12:00:39, Error                 CSI    00000008 (F) STATUS_RM_NOT_ACTIVE #151# from Windows::Rtl::SystemImplementation::DirectRegistryProvider::SysOpenKey(flg = 0, key = {provider=NULL, handle=0, name= (\"null\")}, da = (KEY_SET_VALUE|KEY_WOW64_64KEY), oa = @0x85c6eed240->OBJECT_ATTRIBUTES {s:48; rd:NULL; on:[28]\"\\Registry\\Machine\\COMPONENTS\"; a:(OBJ_CASE_INSENSITIVE)}, disp = Unmapped disposition: 3337540544 (0xc6eed3c0))[gle=0xd0190005]2020-01-05 12:00:39, Error                 CSI    00000009@2020\/1\/5:11:00:39.342 (F) base\\wcp\\sil\\merged\\ntu\\ntsystem.cpp(3813): Error STATUS_RM_NOT_ACTIVE originated in function Windows::Rtl::SystemImplementation::DirectRegistryProvider::SysOpenKey expression: (null)[gle=0x80004005]2020-01-05 12:00:39, Info                  CBS    Added C:\\Windows\\Logs\\CBS\\CBS.log to WER report.2020-01-05 12:00:39, Info                  CBS    Added C:\\Windows\\Logs\\CBS\\CbsPersist_20200101112829.log to WER report.2020-01-05 12:00:39, Info                  CBS    Added C:\\Windows\\Logs\\CBS\\CbsPersist_20200101112142.log to WER report.2020-01-05 12:00:39, Info                  CBS    Added C:\\Windows\\Logs\\CBS\\CbsPersist_20191231095816.log to WER report.2020-01-05 12:00:39, Info                  CBS    Added C:\\Windows\\Logs\\CBS\\CbsPersist_20191230143453.log to WER report.2020-01-05 12:00:39, Info                  CBS    Added C:\\Windows\\Logs\\CBS\\CbsPersist_20191230140708.log to WER report.2020-01-05 12:00:39, Info                  CBS    Could not get active session for current session file logging [HRESULT = 0x80004003 - E_POINTER]2020-01-05 12:00:39, Info                  CBS    Not able to add pending.xml to Windows Error Report. [HRESULT = 0x80070002 - ERROR_FILE_NOT_FOUND]2020-01-05 12:00:39, Info                  CBS    Not able to add pending.xml.bad to Windows Error Report. [HRESULT = 0x80070002 - ERROR_FILE_NOT_FOUND]2020-01-05 12:00:39, Info                  CBS    Not able to add SCM.EVM to Windows Error Report. [HRESULT = 0x80070002 - ERROR_FILE_NOT_FOUND]2020-01-05 12:00:39, Info                  CBS    Succesfully flushed NtfsLog.etl2020-01-05 12:00:39, Error                 CSI    0000000a (F) STATUS_RM_NOT_ACTIVE #150# from Windows::Rtl::SystemImplementation::CSystemIsolationLayer_IRtlSystemIsolationLayerTearoff::OpenRegistryKey(flags = (OpenForBackupIntent), da = (KEY_SET_VALUE), kn = [ml:58{29},l:56{28}]\"\\Registry\\Machine\\COMPONENTS\", key = NULL, disp = (null))[gle=0xd0190005]2020-01-05 12:00:39, Info                  CSI    0000000b Warning: Failed to delete pending transaction content. Error code: STATUS_RM_NOT_ACTIVE2020-01-05 12:00:39, Info                  CBS    Setting ExecuteState key to: CbsExecuteStateComplete2020-01-05 12:00:39, Info                  CBS    SetProgressMessage: progressMessageStage: -1, ExecuteState: CbsExecuteStateComplete, SubStage: 02020-01-05 12:00:39, Info                  CBS    Clearing HangDetect value2020-01-05 12:00:39, Info                  CBS    Saved last global progress. Current: 1, Limit: 1, ExecuteState: CbsExecuteStateComplete2020-01-05 12:00:39, Info                  CBS    No pending packages, why was store asked to process pending packages?2020-01-05 12:00:39, Info                  CBS    Clearing original failure status: 0x000000002020-01-05 12:00:39, Info                  CBS    Setting ExecuteState key to: ExecuteStateNone2020-01-05 12:00:39, Info                  CBS    Setting RollbackFailed flag to 02020-01-05 12:00:39, Info                  CBS    Clearing HangDetect value2020-01-05 12:00:39, Info                  CBS    Saved last global progress. Current: 0, Limit: 1, ExecuteState: ExecuteStateNone2020-01-05 12:00:39, Info                  CBS    Startup: Retrying failed packages.2020-01-05 12:00:39, Info                  CBS    Startup: Processing complete. [HRESULT = 0x00000000 - S_OK]2020-01-05 12:00:39, Info                  CBS    Enabling LKG boot option2020-01-05 12:00:39, Info                  CBS    Startup processing completed. [HRESULT = 0x00000000]2020-01-05 12:00:39, Info                  CBS    Winlogon: Checking to see if CreateSessionNotify has been called at least once.2020-01-05 12:01:39, Info                  CBS    Winlogon: CreateSessionNotify has not been called after 60000 milliseconds2020-01-05 12:01:39, Info                  CBS    Winlogon: Deregistering for CreateSession notifications2020-01-05 12:01:39, Info                  CBS    Winlogon: Stopping notify server2020-01-05 12:01:39, Info                  CBS    Winlogon: Unloading SysNotify DLL2020-01-05 12:01:39, Info                  CBS    Startup processing complete, Trusted Installer will now wait around for a little while to see if any clients show up.2020-01-05 12:01:39, Info                  CBS    Startup processing thread terminated normally2020-01-05 12:01:39, Info                  CBS    TiWorker signaled for shutdown, going to exit.2020-01-05 12:01:39, Info                  CBS    Ending the TiWorker main loop.2020-01-05 12:01:39, Info                  CBS    Starting TiWorker finalization.2020-01-05 12:01:39, Info                  CBS    Starting TiWorker initialization.2020-01-05 12:01:39, Info                  CBS    Ending TiWorker initialization.2020-01-05 12:01:39, Info                  CBS    Starting the TiWorker main loop.2020-01-05 12:01:39, Info                  CBS    TiWorker starts successfully.2020-01-05 12:01:39, Info                  CBS    TiWorker: Client requests SFP repair object.2020-01-05 12:01:39, Info                  CBS    Universal Time is: 2020-01-05 11:01:39.4272020-01-05 12:01:39, Info                  CBS    Loaded Servicing Stack v6.3.9600.19459 with Core: C:\\Windows\\winsxs\\amd64_microsoft-windows-servicingstack_31bf3856ad364e35_6.3.9600.19459_none_fa42f0179b24f5c2\\cbscore.dll2020-01-05 12:01:39, Info                  CSI    00000001@2020\/1\/5:11:01:39.442 WcpInitialize (wcp.dll version 0.0.0.6) called (stack @0x7ffffd277fc9 @0x7ffffd554914 @0x7ffffd55414b @0x7ff7c252d69a @0x7ff7c252e275 @0x7ff830ef2113)2020-01-05 12:01:39, Info                  CBS    SQM: Initializing online with Windows opt-in: False2020-01-05 12:01:39, Info                  CBS    SQM: Cleaning up report files older than 10 days.2020-01-05 12:01:39, Info                  CBS    SQM: Requesting upload of all unsent reports.2020-01-05 12:01:39, Info                  CBS    SQM: Failed to start upload with file pattern: C:\\Windows\\servicing\\sqm\\*_std.sqm, flags: 0x2 [HRESULT = 0x80004005 - E_FAIL]2020-01-05 12:01:39, Info                  CBS    SQM: Failed to start standard sample upload. [HRESULT = 0x80004005 - E_FAIL]2020-01-05 12:01:39, Info                  CBS    SQM: Queued 0 file(s) for upload with pattern: C:\\Windows\\servicing\\sqm\\*_all.sqm, flags: 0x62020-01-05 12:01:39, Info                  CBS    SQM: Warning: Failed to upload all unsent reports. [HRESULT = 0x80004005 - E_FAIL]2020-01-05 12:01:39, Info                  CSI    00000002@2020\/1\/5:11:01:39.665 WcpInitialize (wcp.dll version 0.0.0.6) called (stack @0x7ffffd277fc9 @0x7ff81ccb8a65 @0x7ff81ccb8bb2 @0x7ff7c252cd89 @0x7ff7c252e28c @0x7ff830ef2113)2020-01-05 12:01:39, Info                  CBS    Ending TiWorker finalization.2020-01-05 12:01:40, Info                  CBS    Failed loading COMPONENTS hive with ERROR_SHARING_VIOLATION, retry #1","solutions":["Also:2020-01-05 12:19:33, Info                  CSI    00000680 [SR] Beginning Verify and Repair transaction2020-01-05 12:19:38, Info                  CSI    00000681 Hashes for file member \\SystemRoot\\WinSxS\\amd64_prncacla.inf_31bf3856ad364e35_6.3.9600.17415_none_95dd5540d57f8c01\\Amd64\\CNBJ2530.DPB do not match actual file [l:36{18}]\"Amd64\\CNBJ2530.DPB\" :  Found: {l:32 b:vAUK9y854eDQJvXUID7KTYRwM5+I2FrbQfUp96vCP3w=} Expected: {l:32 b:n520k714Uu3utHa5JGQ6HQYbZphKhlMWq5pEmfnCDuw=}2020-01-05 12:19:38, Info                  CSI    00000682 [SR] Cannot repair member file [l:36{18}]\"Amd64\\CNBJ2530.DPB\" of prncacla.inf, Version = 6.3.9600.17415, pA = PROCESSOR_ARCHITECTURE_AMD64 (9), Culture neutral, VersionScope = 1 nonSxS, PublicKeyToken = {l:8 b:31bf3856ad364e35}, Type = [l:24{12}]\"driverUpdate\", TypeName neutral, PublicKey neutral in the store, hash mismatch2020-01-05 12:19:40, Info                  CSI    00000683 Hashes for file member \\SystemRoot\\WinSxS\\amd64_prncacla.inf_31bf3856ad364e35_6.3.9600.17415_none_95dd5540d57f8c01\\Amd64\\CNBJ2530.DPB do not match actual file [l:36{18}]\"Amd64\\CNBJ2530.DPB\" :  Found: {l:32 b:vAUK9y854eDQJvXUID7KTYRwM5+I2FrbQfUp96vCP3w=} Expected: {l:32 b:n520k714Uu3utHa5JGQ6HQYbZphKhlMWq5pEmfnCDuw=}2020-01-05 12:19:40, Info                  CSI    00000684 [SR] Cannot repair member file [l:36{18}]\"Amd64\\CNBJ2530.DPB\" of prncacla.inf, Version = 6.3.9600.17415, pA = PROCESSOR_ARCHITECTURE_AMD64 (9), Culture neutral, VersionScope = 1 nonSxS, PublicKeyToken = {l:8 b:31bf3856ad364e35}, Type = [l:24{12}]\"driverUpdate\", TypeName neutral, PublicKey neutral in the store, hash mismatch2020-01-05 12:19:40, Info                  CSI    00000685 [SR] This component was referenced by [l:166{83}]\"Package_2709_for_KB3000850~31bf3856ad364e35~amd64~~6.3.1.8.3000850-6825_neutral_GDR\"2020-01-05 12:19:42, Info                  CSI    00000686 [DIRSD OWNER WARNING] Directory [ml:520{260},l:138{69}]\"\\??\\C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\Modules\\NetSecurity\\de\" is not owned but specifies SDDL in component Networking-MPSSVC-WMI.Resources, pA = PROCESSOR_ARCHITECTURE_AMD64 (9), Culture = [l:10{5}]\"de-DE\", VersionScope = 1 nonSxS, PublicKeyToken = {l:8 b:31bf3856ad364e35}, Type neutral, TypeName neutral, PublicKey neutral2020-01-05 12:19:42, Info                  CSI    00000687 [DIRSD OWNER WARNING] Directory [ml:520{260},l:132{66}]\"\\??\\C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\Modules\\NetSecurity\" is not owned but specifies SDDL in component Networking-MPSSVC-WMI, pA = PROCESSOR_ARCHITECTURE_AMD64 (9), Culture neutral, VersionScope = 1 nonSxS, PublicKeyToken = {l:8 b:31bf3856ad364e35}, Type neutral, TypeName neutral, PublicKey neutralAnd: 2020-01-05 12:27:00, Info                  CSI    000009f0 [SR] Repairing 1 components2020-01-05 12:27:00, Info                  CSI    000009f1 [SR] Beginning Verify and Repair transaction2020-01-05 12:27:01, Info                  CSI    000009f2 Hashes for file member \\SystemRoot\\WinSxS\\amd64_prncacla.inf_31bf3856ad364e35_6.3.9600.17415_none_95dd5540d57f8c01\\Amd64\\CNBJ2530.DPB do not match actual file [l:36{18}]\"Amd64\\CNBJ2530.DPB\" :  Found: {l:32 b:vAUK9y854eDQJvXUID7KTYRwM5+I2FrbQfUp96vCP3w=} Expected: {l:32 b:n520k714Uu3utHa5JGQ6HQYbZphKhlMWq5pEmfnCDuw=}2020-01-05 12:27:01, Info                  CSI    000009f3 [SR] Cannot repair member file [l:36{18}]\"Amd64\\CNBJ2530.DPB\" of prncacla.inf, Version = 6.3.9600.17415, pA = PROCESSOR_ARCHITECTURE_AMD64 (9), Culture neutral, VersionScope = 1 nonSxS, PublicKeyToken = {l:8 b:31bf3856ad364e35}, Type = [l:24{12}]\"driverUpdate\", TypeName neutral, PublicKey neutral in the store, hash mismatch2020-01-05 12:27:01, Info                  CSI    000009f4 Hashes for file member \\SystemRoot\\WinSxS\\amd64_prncacla.inf_31bf3856ad364e35_6.3.9600.17415_none_95dd5540d57f8c01\\Amd64\\CNBJ2530.DPB do not match actual file [l:36{18}]\"Amd64\\CNBJ2530.DPB\" :  Found: {l:32 b:vAUK9y854eDQJvXUID7KTYRwM5+I2FrbQfUp96vCP3w=} Expected: {l:32 b:n520k714Uu3utHa5JGQ6HQYbZphKhlMWq5pEmfnCDuw=}2020-01-05 12:27:01, Info                  CSI    000009f5 [SR] Cannot repair member file [l:36{18}]\"Amd64\\CNBJ2530.DPB\" of prncacla.inf, Version = 6.3.9600.17415, pA = PROCESSOR_ARCHITECTURE_AMD64 (9), Culture neutral, VersionScope = 1 nonSxS, PublicKeyToken = {l:8 b:31bf3856ad364e35}, Type = [l:24{12}]\"driverUpdate\", TypeName neutral, PublicKey neutral in the store, hash mismatch2020-01-05 12:27:01, Info                  CSI    000009f6 [SR] This component was referenced by [l:166{83}]\"Package_2709_for_KB3000850~31bf3856ad364e35~amd64~~6.3.1.8.3000850-6825_neutral_GDR\"2020-01-05 12:27:01, Info                  CSI    000009f7 [SR] Repair complete2020-01-05 12:27:01, Info                  CSI    000009f8 [SR] Committing transaction2020-01-05 12:27:01, Info                  CSI    000009f9 Creating NT transaction (seq 1), objectname [6]\"(null)\"2020-01-05 12:27:01, Info                  CSI    000009fa Created NT transaction (seq 1) result 0x00000000, handle @0x3142020-01-05 12:27:01, Info                  CSI    000009fb@2020\/1\/5:11:27:01.433 Beginning NT transaction commit...2020-01-05 12:27:01, Info                  CSI    000009fc@2020\/1\/5:11:27:01.775 CSI perf trace:CSIPERF:TXCOMMIT;3548412020-01-05 12:27:01, Info                  CSI    000009fd [SR] Verify and Repair Transaction completed. All files and registry keys listed in this transaction  have been successfully repaired","I also ran the sfc \/scannow command and it told me that there were some issues with files that it wasn't able to fix.Each Method\/step below progresses to the next if the first does not fix any corrupted files that are found, etc.Have you read this Microsoft information about repairing corrupt system files and errors?\"Use the System File Checker tool to repair missing or corrupted system files\"https:\/\/support.microsoft.com\/en-us\/kb\/929833_________________________________________________And these eightforums.com Tutorials are very detailed for problems resulting from SFC Scan:\"How to Run \"SFC \/SCANNOW\" Command at Boot or in Windows 8 and 8.1\"http:\/\/www.eightforums.com\/tutorials\/3047-sfc-scannow-command-run-windows-8-a.htmlRead this Section there in conjunction with the rest of the information they give in above link.   NoteIf SFC could not fix something, then run the command again to see if it may be able to the next time. Sometimes it may take running thesfc \/scannow command 3 times restarting the PC after each time to completely fix everything that it's able to.If not, then run the Dism \/Online \/Cleanup-Image \/RestoreHealth command to repair any component store corruption, Repair-WindowsImage -Online -CheckHealthRepair-WindowsImage -Online -ScanHealthRepair-WindowsImage -Online -RestoreHealthRestart the PC afterwards, and try the sfc \/scannow command again.If still not, then try using OPTION ONE above to run the sfc \/scannow command at bootIf still not, then you could do a refresh of Windows 8, or run aSystem Restore using a restore point dated before the bad file occured to fix it. You may need to repeat doing a System Restore until you find a older restore point that may work.If still not, then you can use the steps in the TIP box in the OPTION THREE section to manually replace the files that SFC could not fix.","Another thing to look at is system temp.  You say the problem happens when you have heavy loads.  Could it be that your system is overheating?  There are various utilities you can download for free that will help you monitor your system temps..Open your computer case and check to see that air flow isn't blocked by dust bunnies."]}]}