{"windows":[{"symptom":"need to fre up disk space for download        I downloaded the link that greg recommended but I still need 8 gb of space free on my (c:) disk. my lap top has 29.1 gb disk space and roughly a little over 4 gb left free. what do I do now? I don't know how to free up space and I don't want to ruin my computer.","solutions":["Hi Laura. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I will give you steps to free up space on smaller drives and when necessary perform version Updates on them manually by the most stable method that requires much less space than Windows Update.First here are tips for managing smaller drives including the 32-gb SSD which they should have never allowed Windows 10 be installed upon:https:\/\/www.theguardian.com\/technology\/askjack\/...https:\/\/www.pcworld.com\/article\/3040404\/windows...https:\/\/www.groovypost.com\/howto\/maximize-stora...As more space becomes needed, you can move your User folders to another internal hard drive you have or install, or Desktop, Documents and Pictures folders into OneDrive and then set them to On Demand so they reside in the cloud and only have download links on the PC: https:\/\/www.tenforums.com\/tutorials\/116029-turn...https:\/\/www.pcworld.com\/article\/3233488\/windows...You can also offload User folders (Documents, Music, Pictures, etc) to another drive you can install on the same PC (even in the DVD drive bay) as shown in this tutorial, which will not affect speed if C is on an SSD and the other drive is not:https:\/\/www.tenforums.com\/tutorials\/1964-move-u.... I would not move program files or speed will be affected. You could also install a larger SSD\/HDD.This should make enough space to install Windows Updates. But I'd focus on the latest Version update since successfully installing it will bring along all Windows Updates and also resolves almost all other problems since it reinstalls Windows keeping your files and programs in place. Install the Media Creation Tool on another PC to create bootable media or download the ISO to stick or disk, transfer it back to the target PC to open the media or click to mount the ISO, right click Setup file to Run as Administrator. This avoids needing the space to download the Upgrade and it's staging files. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... Another option is to do the the best possible Clean Install in this link which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... This will give you back all but 15gb of the drive. There is also an automated Fresh Start that reinstalls WIndows while shedding corrupting factory bloatware, saves your files, but doesn't clear the drive to get it cleanest:https:\/\/www.howtogeek.com\/265054\/how-to-easily-... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows 10 Home upgrade to Windows 10 Pro        I have a laptop  with Windows 10 Home installed.  I bought  Windows 10 Pro and got a link to download the software.  On running the setup the installation says it will be installing Win Home?  How do I correct it to Win Pro?","solutions":["Hi Ansiepretorius We need just a bit more detail so we can provide a solution for you . . . Where did you purchase WIndows 10 Pro, was that form Microsoft or form some 3rd party retailer?Did you purchase a WIndows 10 Pro upgrade licence or a full WIndows 10 Pro licence and were you provided with a licence key or just a download link and if that was a link, please provide that . . .","I have a similar prob.  January 24, 2019Order number 2003433805 Total $99.00Paid OneStoreWindows 10 Pro$99.00 CompletedOrder detail I need to reinstall my digital win pro upgrade on my repaired notebook that is reset to win home.  Upgrade purchased from Microsoft store.   Order number 2003433805","I have a laptop  with Windows 10 Home installed.  I bought  Windows 10 Pro and got a link to download the software.  On running the setup the installation says it will be installing Win Home?  How do I correct it to Win Pro?Hello, Try to upgrade using Pro edition generic key: https:\/\/www.kapilarya.com\/how-to-upgrade-windows-10-home-to-proLet us know if this helps! Note: Included link in this reply refers to blog post by a trusted Microsoft MVP."]},{"symptom":"wont finish downloading  windows 10 stuck at 76%on my  dell lap top        ive tried to clean up  to make space I don't know what to do to download for the update work, help!","solutions":["Hi Laura. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I would manually upgrade to the latest version 1909 by opening the Media Creation Tool from this link:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m..., choose Download Tool Now, then open the tool and choose Upgrade This PC Now. This saves your files, apps and most settings in place, is the most stable method to change versions, brings your Updates current, resolves most problems. If any problems report back the verbatim error and number, then continue with these steps for overcoming Version Upgrade problems:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If the Version has problems I will work with you to try to resolve them. If the problems are unfixable for now, you have ten days to roll it back in Recovery settings. You can then hide it so it doesn't try to reinstall following this same method:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... Most problems are resolved by doing this gold standard Clean Install which should get you past all difficulties as it has millions of others who have followed the steps in this link and never come back to report another problem:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... . So read it over and see if its something you want to learn to do.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to rate my post, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"f1~f12 keys don't work on windows 10        f1~f12 keys don't work on windows 10, i have a logitech g213 keyboard and it does not have the fn key. i recently just reseted my pc and now my f1~f12 keys dont work please help","solutions":["Hi f1~f12 Have you downloaded and installed the G Hub software for your keyboard, there should be a setting on that software named 'FN key inversion' try toggling that on\/offhttps:\/\/support.logi.com\/hc\/en-us\/articles\/3600...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]},{"symptom":"Startup screen image        HOW do I get the Shanghai Financial Center photo off my start screen? The photos used to change regularly, and that one has been on for months. I am so sick of it, I hate to log in to my computer.","solutions":["Hi Kathleen You can either set that lockscreen to a picture of your own choice, or try to fix the Spotlight functionality . . .1 Open the Settings App (gear icon on your Start Menu) Go to Personalization - Lock Screen Set the background to Picture and then click Browse to set your preferred startup image2 Try to fix Spotlight: Go into the Settings App - Personalisation - LockScreen Set Background to picture and choose one Then open Windows File Explorer and paste each of these into the Address Bar one at a time and hit EnterDelete everything in each folder %USERPROFILE%\/AppData\\Local\\Packages\\Microsoft.Windows.ContentDeliveryManager_cw5n1h2txyewy\\LocalState\\Assets%USERPROFILE%\/AppData\\Local\\Packages\\Microsoft.Windows.ContentDeliveryManager_cw5n1h2txyewy\\SettingsThen right click your Start Button, choose Powershell (admin) Run (copy and Paste) this command and hit Enter Get-AppxPackage -allusers *ContentDeliveryManager* | foreach {Add-AppxPackage \"$($_.InstallLocation)\\appxmanifest.xml\" -DisableDevelopmentMode -register }Restart your PC Go into the Settings App - Personalisation - LockScreen Set Background to Windows Spotlight"]},{"symptom":"'Reboot and Select proper Boot device' error.        My computer now boots to a screen that says\"Boot and Select Proper Boot deviceor Insert Boot Media in selected Boot device and press a key\"Right before this happened, I enabled IOMMU in my BIOS settings for virtualization. After booting after saving my bios, it booted up to this screen. My keyboard and mouse(both wired) don't light up, and my computer doesn't recognize anything I type. I had a spare Windows 10 install USB lying around, so I tried booting from that, and that didn't work either. The screen where it says my mobo's manufacturer is completely gone, and I can't enter the bios. Mobo: Gigabyte GA-1320M-S2HPSU: EVGA 600W SSD: Kingston 1400 M.2 120 GB CPU: AMD Athlon 240GEGPU: Integrated Graphics","solutions":["Hi jkim0206 Turn off your PC Remove the CMOS battery from your motherboard and disconnect the PC from the mainsPress and hold the Power button on your PC Casing for 60 seconds Reconnect the power cable and try booting into BIOS See if you can disable IOMMU if it is still enabled Then see if your system boots normally . . .","Hi DaveM121I reset the CMOS and I was able to get in BIOS. I was able to boot to my windows 10 install USB, but my boot drive still is showing the reboot and select proper boot device. I tried startup repair, and that didn't work.","Hi jkim0206 Sorry, I was offline . . . Great, so now you can access that boot drive, are you able to get into the Recovery environment form that, by clicking 'Repair this Computer?","No. When I try to boot to the C: Drive, even when using boot override in the bios, it still takes me to the 'Reboot and Select proper Boot device'. Using a Windows 10 install USB to use Startup Repair does nothing.","Never mind. I fixed it. Thank you so much for your help!","H jkim0206, I am really glad you resolved this!"]},{"symptom":"Windows 10        I have a number of devices operating Windows 10 that cannot go online.  Am I able to download Windows update onto a EXT HDD using a different device, then using the EXT HDD to update the devices that are unable to go online","solutions":["Hi there, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.Yes, you can download Windows Updates from the Microsoft Update Catalog here: http:\/\/www.catalog.update.microsoft.com\/Home.aspx They can be saved to an external HDD and then you can run the files on the computers that are unable to go online.I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"Updates on laptop not downloading        So my laptop isn't letting me sign in with fingerprint and pin ID anymore. I had to sign in with my microsoft account password. The when I tried to set it up again it wouldn't let me, with a little pop-up saying\"we couldn't sign you in\" and \"your request was not supported.\" And since they couldn't sign me in, I went to \"Your Info\" to verify my account but the same pop-up came up and read\"we couldn't sign you in\" and \"your request was not supported.\" :( THEN! I went to update my laptop thinking that would help everything. W R O N G. Now my head hurts :( It won't let me update but it says \"STATUS: DOWNLOADING: 0%\" and it stays being 0% with no progress i'm confused why it isn't going. Because of this, I can't verify my account to fix my login preferences.Someone please help me!!","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command promptDISM \/Online \/Cleanup-Image \/RestoreHealthRun these commands on the command prompt to restart windows update servicesnet stop bitsnet stop cryptsvcnet stop wuauservnet stop msiserverRen C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.old net start bitsnet start cryptsvcnet start wuauservnet start msiserverAfter successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartThis should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command promptDISM \/Online \/Cleanup-Image \/RestoreHealthRun these commands on the command prompt to restart windows update servicesnet stop bitsnet stop cryptsvcnet stop wuauservnet stop msiserverRen C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.old net start bitsnet start cryptsvcnet start wuauservnet start msiserverAfter successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartThis should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :) Do I have to try these in that exact order? Or can I try to start with the in-place upgrade at first?","Yes. You may start with the in-place upgrade first. Fingers crossed! :)","So im getting a \"You need to restart your PC to finish installing a firmware update. Plug in your PC, make sure the battery is fully charged, restart, and then try installing again\" But i've seen this before and have kept restarting my computer but im not exactly sure how to actually find where to update the firmware (this was after step 4....?)","also gary- your positivity, its keepin me goin man thx for that ","My pleasure! Also, just to inform you that firmware updates are normally pushed through by the manufacturer. Therefore, if the same behavior occurs, It'd be best to manually update the firmware through the manufacturer's official driver software."]},{"symptom":"Windows 10 update, System32\\LogiLDA.dll missing        Well i finally did the windows 10 free upgrade and now getting a error message when i boot up that im missing C: Windows\\System32\\LogiLDA.dllonly started when i did the upgrade from windows 7how do i fix it?Also could this be the reason my computer is laggy and desktop icons flash every now and then?never had these problems til windows 10thank you","solutions":["Hi,Thank you for posting in Microsoft Community.Did you make any hardware and software changes in your computer prior tot this issue?What is the make and model of your computer?This error occurs due to the incompatible version Logitech software, more specificallyLogitech Download Assistant. This belongs to the Logitech mouse. Follow the steps below.Method 1: Uninstall and Reinstall the Logitech Drivers from the manufacturer’s website.Steps to uninstall the Logitech Drivers.1.     Press “Windows Logo” + “X” keys on the keyboard.2.     Click on “Device Manager” from that list.3.     Search for the Mice and other pointing devices from the device list, right click on it and then select “Uninstall”. On the un-installation window, if you have an option: “Delete the driver software for this device” you may select that and then remove the corrupted drivers from the computer.4.     Follow the on-screen instructions to complete it and then restart the computer if prompted.5.   Download the latest Graphics adapter driver setup file from themanufacturer’s website and install it.If above Method doesn't fix the issue follow next Method.Method 2: Disable LogiDA from Task Manager.Open Task Manager by right click on the Taskbar.Go to the Startup tab and find LogiDARight click on LogiDA and click on Disable Now we have temporarily disabled the  Logitech Download Assistant from starting with the computer. Now we have to delete the entry so we won’t be bothered with it again. To do soPress Win + R and type in REGEDIT.Go to HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Runkey.Find Logitech Download Assistant and delete the entryNow reboot the system for changes to take effect. Registry disclaimerNote: This section, method, or task contains steps that tell you how to modify the registry. However, serious problems might occur if you modify the registry incorrectly. Therefore, make sure that you follow these steps carefully. For added protection, back up the registry before you modify it. Then, you can restore the registry if a problem occurs. For more information about how to back up and restore the registry, click the following article number to view the article in the Microsoft Knowledge Base: 322756 (http:\/\/support.microsoft.com\/kb\/322756\/)Hope this information is helpful. Please do let us know if you need further assistance, we’ll be glad to assist you.Thanks"]},{"symptom":"Reply and Forward ICON and Message not working with IMAP GMAIL account and Outlook for Office 365        My GMAIL account is setup with IMAP on a new computer with Windows 10 and Outlook for Office 365.  After replying to a message or forwarding an email, the ICON field and the small status message do not reflect that the e-mail was replied to or forwarded.  The small text status message indicating the message has been sent is present until the e-mail popup window is closed.  If closed and the e-mail re-opened in the inbox, the small text status is not available to notify that the message had been replied to.  The only way to know that an e-mail has been sent from the reply or forward function is to look in the sent mail folder at outbound e-mails which is very inefficient.  My phone has access to this same gmail account.  When I reply to an e-mail on my phone, the Reply Symbol appears in the ICON field of Outlook Inbox properly.  So it is only when I reply or forward within Outlook that the error occurs (no symbol displayed in the ICON column\/field).My other e-mail accounts established with POP3 show the ICON indicator and small status message accurately at all times.  How can I fix this or submit a priority bug to get it repaired?","solutions":["Gmail account and outlook for office 365 is now here for you. I have some demands for you where you must have to follow all for help me to write an essay which were define all for email where all for the gmail is define everything for you."]},{"symptom":"Windows Loading Error 0x8007139f in Bitlock Recovery in Dual Boot Laptop        After dual booting my laptop with Windows 10 and Ubuntu, Windows asking for recovery key every time on start. To get rid of this, I searched solution for this and found the link: https:\/\/www.dell.com\/community\/XPS\/XPS-9570-BitLocker-asks-for-recovery-key-after-dual-boot\/td-p\/6240947 I followed and deleted TPM protector. On adding, it give an error, two protectors of same type can't be added. After that when I restart windows, it is showing Entering Bitlock recovery and then display 0x8007139f error code. Please help.","solutions":[]},{"symptom":"GPU usage drops with mouse movement in games        I've been having this issue since the installation of Windows 10 64 bits. Whenever I move my mouse in-game the GPU usage drops leading to a very annoying and severe FPS drop. I've been researching this for weeks, tried every fix imaginable and I can't fix it. I cannot play my favorite game mode because I never have enough FPS thanks to this problem. I don't know what to do anymore so I hope someone can help me with this because I have projects to work on but I can't work and test what I do because of this problem. Tried reinstalling drivers, uninstalling them and installing again, installing an old driver, different mouse, different polling rate, changing priority, disabling HPET, changing monitor, playing without the mouse drivers, updating mouse software, disabling second monitor, crank up the graphics settings in the control panel... I just... can't fix this thing.My specs:CPU AMD FX8320 @3.5 GHZ Black Edition water cooled by an H100i v2.GPU Zotac GTX760 2GB with also good temperatures.MOBO Gigabyte 970a-d3pRAM is some Kingston 1333 HZ DDR3PSU Corsair CX750w 80+ BronzeKeyboard Corsair Strafe RGB MX RedMouse Logitech G403Headset Razer Kraken 7.1 ChromaOS installed in a Kingston A400 120GB SSDHDD 1TB Seagate Barracuda","solutions":["HI Thundersnow. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) Update the Display driver from the PC or Display adapter maker's Support Downloads web page for your exact model number, HP Serial Number or Dell Service Tag - from the sticker on the PC.While there check also for newer chipset, BIOS\/UEFI firmware (very important), network, sound, USB3 and other drivers, comparing to the ones presently installed in Device Manager reached by right clicking the Start Menu.If this doesn't give you the latest or ideal driver for what you need, compare it to the driver offered by the Intel driver update Utility here:http:\/\/www.intel.com\/content\/www\/us\/en\/support\/... or the Nvidia Update utility here: http:\/\/www.nvidia.com\/Download\/Scan.aspx?lang=e... or the AMD autodect utility here: http:\/\/support.amd.com\/us\/gpudownload\/windows\/P... For Display issues one fix that is working is to Roll back or Uninstall the Driver on the Display Device > Driver tab, restart PC to reinstall driver.You can also try older drivers in Device Manager > Display device > Driver tab > Update Driver > Browse > Let Me Pick.Then you will know you've tried everything in addition to Windows Update drivers.Adjust the screen resolution until it fits and looks best at Settings > System > Display.2) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 3) If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... -------------------------------------------- But remember that in Windows 10 everything depends upon the quality of the install, and Factory or Upgrade installs are inferior installs which most enthusiasts won't even run because they'd expect endless issues. Consider now or later doing the Clean Install in this link which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... There is also an automated Fresh Start that reinstalls WIndows while shedding corrupting factory bloatware, saves your files, but doesn't clear the drive to get it cleanest:https:\/\/www.howtogeek.com\/265054\/how-to-easily-... I hope this helps. Feel free to ask back any questions and let us know how it goes. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Already did these steps and the problem still persists. No damaged files or anything was found. Everything is fine except for the problem I mention. I guess it's just time to give up already and stop playing the game. I'm done with this."]},{"symptom":"PASSWORD        I WANT CHANGE MY PASSWORD BUT PC SAY THAT YOUR PASSWORD TEMPORARLY LOCKED ,PLEASE HELP ME TO CHANGE THE PASSWORD ","solutions":["\"How do I change my password?\"How to Change Your Password in Windows 8: 10 Steps (with Pictures)_________________________________________________We don't work for Microsoft and due to privacy restrictions\/protection we have no access to your personal details to be able to assist you.Have you read this information?When you can't sign in to your Microsoft accounthttps:\/\/support.microsoft.com\/en-au\/help\/12429\/microsoft-account-sign-in-cant______________________________________________How to reset your Microsoft account passwordGo to the Reset your password page._____________________________________________The account recovery form is meant to be the last option to get you back into your account. If you haven’t tried resetting your password yet, first go toWhen you can't sign in to your Microsoft account for troubleshooting suggestions. If, however, you can’t reset your password or an attacker changed your account settings, the recovery form gives you a chance to prove that you own your account. Recover your Microsoft account____________________________________________Microsoft Account FAQs:https:\/\/account.microsoft.com\/account\/faq_____________________________________________Microsoft Account: Services & subscriptions:https:\/\/account.microsoft.com\/services\/____________________________________________Get account help by email.https:\/\/support.microsoft.com\/en-au\/help\/12401\/microsoft-account-get-help-by-email_____________________________________________Account temporarily suspended1. Unblock your account.2. Problems with the security code_____________________________________________"]},{"symptom":"The hidden Adminstrator for my windows home 64 bit gets activated remotely. Appears to be all MS applications.        Can anyone tell me how to remove the remote entity that activates my hidden PC ADMINISTRATOR account in my windows 10 home 64bit and takes over control of me as if THEY are my computers ADMINISTRATOR. The change settings. Delete programs, install programs, delete and install drivers. I have been dealing with this from purchase 08\/02\/2018. Over 50 contacts with Microsoft and over 40 contacts to HP including being sent to their shop for 11 days. They are remote and they disappear when a remote tech comes aboard. Folks this is something very serious. My life since owning this computer is like a real living hell. I am a career  electronic technician to the microprocessor. I retired as a systems analyst. This issue is been ignored for a long time. William Scott Austin928-710-4964*** Email address is removed for privacy ***","solutions":[]},{"symptom":"multiple monitors        I unplugged my computer and monitors. When I plugged them back in I cannot get my other two monitors to work. Everything was working fine before","solutions":["Hello JoeLancia! My name is Marco, I am an Independent Advisor. I will do my best to help you.Connect only one, open your PC then connect the other. Then reboot the PC. Marco","Did not work!","Ok, can you try to disconnect the cable from both ends, wait a few seconds, and reconnect it again.or using the built-in controls on your monitor, make sure the correct input is selected."]},{"symptom":"Mouse sensitivity messed up if display scale is not 100%        I'm using a 3840x2160 monitor, with display scale set to 200%.My mouse sensitivity become twice faster as before compare to 100% scaling. I simply check some settings, and I found that if I set display scale to 100%, my mouse speed was normal as before.I found that when under 200% scale, my cursor move at least 2 pixel per move. Which is not right. By not right I mean this is not the intention of me. I want to have the ability to move my pointer with accuracy.Is there a way to disable this feature? I want pixel accuracy for my mouse under 200% scaling.","solutions":["Hi Steve When going from 100% to 200%, that would mean everything on your screen is basically double the size, the only way to counteract the mouse movement issue would be to set the speed of your cursor to 1\/2 its current speed, you can do that from the old Control Panel - Mouse - Pointer Options","The problem of this method is that the adjustment scaling not accurate enough. I need 100% accuracy from my mouse DPI to the pixels on the monitor. The relationship between the mouse sensor data and monitor pixels is physically one-to-one. However using the method you mentioned, there are only 13 default settings. The most similar option is roughly 90% or 130% of original sensitivity. It feels terrible using this setting.","Hi Stevex May I ask ,you refer to one-to-one relationship between mouse and screen pixels, what operation(s) are you performing that needs that type of exactness?Are you using scripting to find controls on the screen, using their X,Y locations or something like that?"]},{"symptom":"\"Hardware and Devices\" missing from Troubleshooter!        Hello guys,Last week I updated my Windows 10 Home to version 1809. After that, when I checked the Troubleshooter, Hardware and Devices (which was an option in previous Windows versions) seem to be missing!Is this a bug? Or is there a new option?","solutions":["Hi Joseph My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.Thats because it has been split out among several option instead of encompassing just one troubleshooter. Remember these are all hardware and the most common ones that require a troubleshooter:- Keyboard - Bluetooth - Video playback - Audio - Printer - Internet connection - Battery Etc.","For keyboard issue - Let's first rule out whether the keyboard hardware is an issue or not. Can you use Keyboard tester and press keys to see if the keys are working correctly or not? If keys work as intended, then problem is not the hardware of Keyboard.https:\/\/keyboardtester.co\/keyboard-tester.htmlIf no hardware issue - Uninstall & reinstall Keyboard Driver Windows Key+X (Or right click on Start) > Click Device Manager > Expand Keyboards > Right click on Standard PS\/2 Keyboard > Uninstall > Reboot the computer to reinstallDo let me know if you require any further help on this. Will be glad to help you."]},{"symptom":"Num0 and Num2 keys won't type        Only those two. Every other button on Numpad works perfectly.The strange part is that these buttons work perfectly when Numlock is turned off. Num0 turns on insert mode and Num2 works as \"Down\", exactly as it should be.I used a program that displays keystrokes and Num0\/Num2 register just fine.So clearly, it's not a mechanical issue.Google didn't help much.The keyboard is Microsoft Wired Keyboard 600.I'm sure I didn't remap any keys. These buttons just stopped working one day.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please download this driver for Microsoft Wired Keyboard 600 and install the same. Then Restart the PC and check if it works.https:\/\/download.microsoft.com\/download\/1\/0\/3\/1...","I did. No changes whatsoever.","Okay, please press the Function (Fn) key once and try these twp keys. Press and hold Fn key and try these two keys . Let me know the status."]},{"symptom":"Windows 10 Mail (UWP) App - Focused Inbox problems, dark theme option gone        I just had two problems crop up yesterday with the windows mail client that I'm hoping somebody can help with.1. Focused Inbox option disappeared. - Focused inbox stopped working, and when I go to settings to re-enable it I'm met with \"This setting can't be applied to any of your accounts\".   After a history of reset \/ reinstall of the app this still persists even though my only current account is my outlook.com account.2. Dark theme option disappeared - Also, strangely at the same time my ability to have my reading view dark along with the overall dark theme disappeared.  No more moon\/sun icon while I'm reading the email.I'm forced to use the web until i figure this out since I'm very comfortable with both those features, and I've already invested a couple of hours trying to resolve this issue.Writing up this shot in the dark in hopes somebody has some good advice.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please try resetting the app and check: Go to Settings Click on Apps Click on Apps and Features Select Mail app Select Advanced Options Click on Reset.","Hello Arif, thank you for your advice.After multiple app resets, along with full uninstalls and re-installs, I made it through yesterday with the functionality fully restored, and this morning it's still working :-)I will re-post in the next few days if the problem comes back, but for now I'm enjoying my focused inbox again on both my outlook.com and corporate O365 accounts.J ","That's very good to know Jamie. :)"]},{"symptom":"reset my password        Is there anyway of resetting my laptop without needing the original password.i have tried a method where you hold shift and press reset however when i press troubleshoot there is no reset pc button.If there is any other method please reply back as i need to use my laptop ASAP","solutions":["* Merged * When i put in my password reset disk and enter the new password i want to change it to, i press next and it says “An error occurred while the wizard was attempting to set the password for this user account”. What can i do so that it will change my password p.s please help me my laptop has been locked for over 2 years and i am starting to need a laptop for school","HI David. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Yes, you can use the bootable media which doesn't require it. You may need to create bootable media to access Repair Mode, Reset or do the gold standard Clean install. The bootable media has it's own drivers, repair and installation files which often work when Windows or the other Repair Mode doesn't.To create Windows 10 Installation Media on another PC install Media Creation Tool and follow the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, on second screen choose Repair Your Computer, then Advanced Troubleshoot Options, then System Restore and Uninstall Updates to see if those correct the problems with sign in. If that fails go back to Troubleshoot Options to try a Reset. If that fails choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, click Next to let it create needed partitions and start install - this makes it foolproof.Everything needed to get the best possible Clean Install is here: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... It is a better install than any amount of money can buy and a great learning experience that will make you the master of your PC because you will learn what works best and how to apply it with your own hands. If you have files that aren't backed up you can use the same bootable media to try to rescue your files using these methods:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi David. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.The password disk is not going to work. Once you get into Windows use a MS Account which password you can change online if necessary, or for a Local Account create test questions to change the password from the Log-in Screen:https:\/\/www.windowscentral.com\/how-reset-passwo...I will give you everything possible to fix sign in failure so that at least something will work, based on helping with this issue several times a day for years. I'll also be standing by to guide you as needed:Try restarting the PC to see if anything changes. Then see the various troubleshooting steps here: https:\/\/www.groovypost.com\/howto\/reset-windows-...https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/www.groovypost.com\/howto\/recover-lost-w...This could also be due to account corruption so see the fixes here: https:\/\/www.techbout.com\/fix-corrupt-user-profi...If you cannot sign in then it will save time to create a new Admin account to replace the old one.Follow this tutorial to enable the hidden Built-in Administrator from the Sign In screen:https:\/\/www.isumsoft.com\/it\/enable-hidden-admin..., sign into it, create a new Local or Microsoft Admin account in Settings > Accounts > Family & Other People, sign into it, move your files over, test all programs run correctly, then when ready delete the old account and hide the built-in Admin again. You can then change to your MS Account.You can also run the Repair Install from the Admin account to see if it fixes the old account first, by install the Media Creation Tool from this linkhttp:\/\/windows.microsoft.com\/en-us\/windows-10\/m... choosing Download Tool Now, install the tool, open it and choose Upgrade this PC Now. This will save your files and apps while bringing you up to the latest version by the most stable method. It will also bring all of your Updates current and solve most problems since it reinstalls Windows.If none of the above work you may need to create bootable media to access Repair Mode or do the Clean install:To create Windows 10 Installation Media on another PC install Media Creation Tool and follow the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, on second screen choose Repair Your Computer, then Advanced Troubleshoot Options, then Command Prompt to try the steps here to enable Built-in Admin to do the above steps to create a new account and move into it: https:\/\/www.tenforums.com\/tutorials\/2969-enable...If that fails go back to Troubleshoot Options to try a Reset. If that fails choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, click Next to let it create needed partitions and start install - this makes it foolproof. Everything needed to get the best possible Clean Install is here: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... It is a better install than any amount of money can buy and a great learning experience that will make you the master of your PC because you will learn what works best and how to apply it with your own hands. If you have files that aren't backed up you can use the same bootable media to try to rescue your files using this method:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]}]}