{"windows":[{"symptom":"PHP > Programming Guide        Hi Everyone! Does anyone know how I could get a practical book on SQL Server Tutorials and examples?","solutions":["Hi Chieki I am sorry, Community is just a consumer forum, due to the scope of your question (SQL Server) can you please post this question to our sister forum on MSDN (the Developer Network) in the SQL Server section (linked below)Over there you will have access to a host of SQL Server Developers and will get a knowledgeable and quick answer to this question . ..https:\/\/social.msdn.microsoft.com\/Forums\/sqlser...Also, below are two links to coded examples of how to connect to SQL Server using PHP . . .https:\/\/www.php.net\/manual\/en\/function.sqlsrv-c...https:\/\/docs.microsoft.com\/en-us\/sql\/connect\/ph...________________________________________________________Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]},{"symptom":"Color palette on Paint 3D app is full cannot add more colors        I am using paint 3D on my surface pro 6 and I've maxed out the colors on the color palette. I've tried changing the custom colors by tapping on the color and when the editor opens up I double tap on the new color I want and it doesn't save to the palette as suggested in other forums. please advise***Original title: Paint 3D surface pro 6- color palette full. Unable to add new colors.***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand query related to palette colors on Paint 3D app on your PC. We tried reproducing your query on our lab machines and found that Paint 3D allows you to add only 6 extra colors and once the palette is full we can replace the old colors with new ones. However, once you replace the old colors Paint 3D should automatically save it. Since it is not saving on your PC, I would suggest you to refer the articleFix problems with apps from Microsoft Store and see if that helps. In case the issue persists, you can provide a feedback using the Feedback Hub app on Windows 10, so that our engineering team can look into this for you. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Windows Defender Firewall not saving changes made to app exceptions        I go into the allow app or feature section. Then I scroll down and tick multiple boxes on the left, then change some to private instead of public. I click on ok. When I go back into the allow app or feature section, my changes weren't saved. Help?***Original title: Windows Defender Firewall Problem***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues while setting up rules for Windows Defender Firewall. For further clarity on the issue, please respond to the questions below: Which build version of Windows 10 are you using currently?Are you aware of any changes made to the PC prior to which you weren’t facing this issue?Are you using any VPN software?Do you have any third party antivirus program installed on the PC?Does this happen with all the apps or only with one specific app? Refer the article Which version of Windows operating system am I running? Meanwhile, I would suggest you to try running the troubleshooter for Windows Defender Firewall and see if that helps. Refer the articleAutomatically diagnose and fix problems with Windows Firewall In addition, if you have any third party antivirus installed, please disable it and check if you are able to provide the exception to the app. Note: If you disable the security software or firewall, the system might be temporarily exposed to security threats and risks. Please make sure to turn install it back once the issue is fixed In case you have any VPN program installed, try uninstalling it and check if that helps. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Suddenly got blue screen of death        Hello Everyone,Today I just got blue screen of death while I was surfing websites. I believe I didn't open any heavy tasks or anything. The only thing I opened at that time was just Chrome.I am worried now because as far as I know the blue screen of death is a major issue.The code of blue screen of death I could read when Windows was trying to restart was SYSTEM_SERVICE_EXCEPTIONHere is the minidump file I have just got from my PC: https:\/\/drive.google.com\/open?id=1Dr8uodsFnfIhoXCHTcNbcqy-8K8H4Z5YSomeone please have a look at it and tell me exactly what happened and what I should do next.Thank you so much.","solutions":["Hi, There was a Bug Check 0x3B: SYSTEM_SERVICE_EXCEPTION. Try to update all of your Drivers. You can also try this. Go to CMD and run it as Administrator then type, dism \/online \/cleanup-image \/restorehealth"]},{"symptom":"File Explorer Search no more instant results for files on Windows Server since Windows 10 version 1909        With the latest Windows 10 fall update (version 1909 \/ 19H2), instant search results no longer work for files that are on our small business Windows server. To reproduce: navigate to a document folder on Windows server (we have 2012) in Windows Explorer. Write something in the search box. No search is performed in that directory or subdirectories, until you press enter.We do not want to sync all our business documents to each client. That would be a great waste of disk space, and creates unnecessary sync issues. We do not want to move all our documents to Onedrive. But we do want to stay productive and get search results without pressing enter. It's a task that is performed hundreds of times every day. Why make things less productive and more time intensive for businesses? In windows 7, you could search files indexed on the server from the start menu. That fantastic feature was removed in Windows 8 and never came back. And now, this penalty for all businesses using windows server.Is there a way to return to the old file explorer search, or to enable instant results also for documents on the server (ie. that are indexed locally on the server)?","solutions":["Hi Fredrik,  Thank you for writing to Microsoft Community Forums. I understand your query related to instant search results in Windows 10. Let me help in pointing you in the right direction regarding this query. I would suggest you to post your query in ourTechNet Forums, where you will be able to reach professionals with expertise on Windows Servers. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Microsoft Money Sunset no longer produces sound        I've been using Money Sunset for many years without any problems. A couple of weeks ago the usual sounds stopped altogether (eg sound on starting up app and sounds upon various actions). Apart from sound, Money is still working fine. My speaker is working fine for sounds on all other apps - It's only Money which has gone silent. How can I get the sounds back onto Money?","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query regarding Microsoft Money Sunset version. Upon checking I found that Microsoft Money is an old software initially designed to work on Windows XP and Windows 7. However, do not worry, we do have a dedicated forum for issues related to Microsoft Money, let me point you in the right direction. I would suggest you to post your query inhttps:\/\/social.microsoft.com\/Forums\/en-US\/home?forum=money, where we have support professionals who will be able to provide you the insights on this issue. I hope your query will be resolved at the earliest.  Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Windows Activation        How to Confirm Windows License Key Has Not Been Used Before?","solutions":["Hello! I am an Independent Advisor, I would love to help you out! Unfortunately there is no way to check a consumer license to see if it has been activated other than using it. If it lets you activate then you should be good to go, otherwise it should tell you that it is already in use or no longer valid.","How to Confirm Windows License Key Has Not Been Used Before? Hello,There is no official method for this. You may just insert the product key to Windows, and it will just tell if you can use the key or not. Previous records for the key will not be presented.Regards.","The only way to tell is to attempt to activate using the product key, as there is no public list kept of the status of Product Keys."]},{"symptom":"Keyboard functions        Can someone please help me. I want to disable the \"handy\" feature that makes an á when i type ' and a. I don't like it, nor do i need it because i already know the alt codes for all of those types of characters that i'm ever going to need. So if someone could please help me disable that feature i'd appreciate it :)","solutions":["Hi brother64, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.In Windows, can you open Control Panel, then under \"Clock, Language, and Region\" click on \"Change Input Methods\"Then click on \"Change your language preferences\" There should be \"Options on the right\". Scroll down until you see the Input section.Can you let us know what you have here? If it is United States - International, you may want to try to add just the standard English (United States).I hope this has helped you. If this did not work, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"Opening Notepad turns the screen yellow        When I use Notepad, the screen has a yellow tint to it. When I close Notepad, it goes away. This only happens when I open Notepad, no other programs are affected by this yellow tint. It's really annoying as I use Notepad alot.I tried to take a screenshot but the screenshot is normal with no yellow tint. What could be causing this?Windows 10 Version 1903**UPDATE**So I found by turning off the XBOOST App in the MSI App manager fixes the problem. Not only does the XBOOST App cause the yellow tint, using the Gaming App in the MSI App manager does as well. ","solutions":[]},{"symptom":"Can't update windows 10        Trying to update windows 10 but everytime i try it goes to Black screen saying undoing changes then goes back to home screenTried installing from iso didn't workTried windows troubleshooting","solutions":["What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK OK","I believe 1803","Hi M, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.If you have tried recently using an ISO, Let us check the Installation log to find why the update failed. Please share the logs as mentioned in this article. You should use a File sharing service like Onedrive or Media Fire to upload files and share the link in the next reply.https:\/\/answers.microsoft.com\/en-us\/windows\/for...The Panther logs. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\PantherThe Rollback logs: These usually are created if Windows Update rolls back. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\Rollback[Only if the error code is 0xC1900101-0x30018] The Device Install Log from C:\/$Windows.~bt\\Sources\\Rollback\\setupapi\\setupapi.dev.logAs the log size might be large consider zipping before uploading.","Follow the instructions and get like this;","Trying to update windows 10 but everytime i try it goes to Black screen saying undoing changes then goes back to home screenTried installing from iso didn't workTried windows troubleshootingHello,As you already run Windows Update troubleshooter, what issues it reported?Regards.","It is 1803","It says check for pending updates","Just did a basic reset (kept files and download) and now i have 7 updates pending including the new windows version (1903)Waiting for everything to finish and see if it works"]},{"symptom":"So many apps CRASH after update to windows 1909        I don't know why, but so many apps like Camera, Microsoft Store, Photos, Notes, and many more crash after i update my windows to 1909.Any solution for this problem?Because i try everything on the internet and all of them is didn't work at all.Please, help me guys","solutions":["Have you gone to the Store and clicked on the 3 dots to the right of you picture and clicked on Downloads and updates?Also have you gone Settings, Apps, scrolled down to the app, clicked on it, Advanced options, Reset?","yes, i've done everything and it doesn't work at all","Hi, Have you tried to run the Dism command? Go to CMD and run it as Administrator, Then type dism \/online \/cleanup-image \/restorehealth You can also rollback an update."]},{"symptom":"Formal complaint body        Is there a formal complaint body I can contact against Microsoft?Microsoft support has been utterly garbage. I have contacted them over 5 times and this has not been resolved. I had a refund processed against a closed bank account. I have contacted the bank and they cannot look up anything without Microsoft contacting them directly (or Microsoft's bank).Despite mentioning this several times, Microsoft can't do anything but say 'please contact the bank' and sending me in circles. I do note that this has been going on since July\/August 2019. I honestly don't think its that hard for agencies to talk to each other.  ","solutions":["<Link Removed as per TOU\/COC>","I will be contacting ACC. "]},{"symptom":"CNEventWindowsClass        I have recently been seeing this popup in my notifications bar saying that to improve battery life i should switch to balanced power setting. It doesn't just appear once but two or three times. My power plan is set to balanced so i have no idea how this can be happening. No recent updates have been added to my PC since the last forced update. It is rather random and quite annoying as it pops up only some days and not others and always two or three at a time.","solutions":["This CNEventWindowClass is constantly appearing in my notifications.  Please inform us to how to elevate this annoying problem.  When clearing the notifications, then three to seven have appeared.  Again, please inform us as consumers as to how to rid ourselves of this issue.","Still having this issue"]},{"symptom":"Audio and Video out of sync        Hi.I know this has been reported several times and I scoured the web to find possible solutions.My issue is that sound and video are out of sync when streaming - so Netflix, iPlayer, YouTube etc. The video starts out OK but gradually ( over a few mins ) gets to be about 3-4 seconds out - the audio leads the video.Playing a DVD is fine.I have tried Firefox, Edge and Chrome and its the same with all of them.I have tried the following as recommended in various forums:1) Changed Audio Quality to DVD and also CD - no change.2) Update all drivers ( Mobo, Realtek, Nvidia ) no change3) Swapped  Realtek driver for generic Windows version, no change4) Unchecked 'Allow applications to take exclusive control of this device'5) Ran Troubleshooter which found that I had changed the default sound quality down to CD or DVD and changed it back. 6) Checked all cables, reseated graphics card7) Tried second set of speakers - No change.The PC is home built ( 2 years ago ) and was fine until a few months ago.The Spec is: Asus Rampage VI Extreme, 64GB Corsair Ram, Samsung M.2 500GB SSD with Opsys and apps loaded, NVIDIA GEforce GTX 1070, Intel i9-7900X, Windows 10pro version 10.0.17763. No sound card - I use the on board ASUS sound. Microsoft High Definition Speaker Driver 10.0.17763.1.I have a pair of Dell UP3216Q 4K Monitors and there are a couple of NVIDIA High Definition Audio Drivers there as well. I disabled these and there was no change.One other issue is that the sound has started to crackle now and then.Any help\/advice gratefully received.Thanks","solutions":["Hi everyone who replied. This was a wierd one! I noticed that after using one of the two BlueRay drives in the PC ( i was ripping some new CDs to my music library) that i was getting  some errors using  one of the drives - i decided it was faulty and removed it - once i did this, the sound sync issue was gone! So i ordered a new drive and installed it - the problem came back and the so did the drive errors! i carefully checked the sata cable and found it was damaged. Bingo I thought! I replaced it and ...duh still the same. This drive was connected via a PCie SATA expansion card....that card had gone bad. Replaced that last night and that fixed the issue. Who would have thought it?? I now have a spare Bluray drive but great sound again - in synch and no crackles or pops.Thanks to everyone who took the trouble to reply and helped and i hope this might assist others in some way."]},{"symptom":"The Microsoft Store wont let me log in        when i go to enter my password it says \"error try again later\"","solutions":["Hi chloereganito and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.Unable to Login with my Microsoft Account in Windows 10 [FIX] https:\/\/windowsreport.com\/unable-to-login-with-...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hello, Try re-registering Store app. Perform these steps: 1. Search for Windows PowerShell using Cortana or Windows Search. 2. From results, right click on Windows PowerShell and select Run as administrator. 3. Then type following command and press Enter key: Get-AppXPackage *WindowsStore* -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"} Let the command complete. 4. Close Windows PowerShell. Let me know if issue still persists!"]},{"symptom":"UI Host not responding        Hi,I'm currently trying to apply for a job and every time I go to upload my resume I get the loading symbol eventually I have to close the file browser and I get UI Host not responding error. Than my web browser freezers and I have to ALT-CTRL-Delete and close program. I have tried both Microsoft Edge and Google Chrome. This has seem to happen since my last Windows 10 update last night.  I lost my job in November so I'm desperate need a job and I need to finish this application before the deadline. TIA","solutions":["Run System File Checker from Step 10 in this checklist: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...Are you on the latest version 1909? Check at Settings > System > About. If not install the Media Creation Tool from this link http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... choosing Download Tool Now, install the tool, open it and choose Upgrade this PC Now. This will save your files and apps while bringing you up to the latest version by the most stable method. It will also bring all of your Updates current and solve most problems since it reinstalls Windows."]},{"symptom":"Is this is genuine windows?         Is this is genuine windows?","solutions":["Hi Chayes,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.This is a Windows 10 Pro retail license so hence it is genuine.Hope that helps."," Is this is genuine windows? Hello,From screenshot, as it is seen, you've retail license, so it looks genuine.Regards."]},{"symptom":"window upgrade        how do I know that my computer is operating on window 7 or window 10","solutions":["Which Windows operating system am I running? - Windows HelpWhat Version of Windows Do I Have? [Windows 10, 8, 7...] - LifewireHow to determine the version of Windows on a computerHow to Find Out Which Build and Version of Windows 10 You HaveList of Microsoft Windows versions - Wikipedia@@@@@@@@@@@@@@@@@@@@@@@@@@Also look for the COA Sticker if Windows came preinstalled if the operating system is prior to Windows 8 as that will tell you what version of Windows was preinstalled:The COA sticker, is either on the underside of the Laptop or in the Battery Compartment.With a Desktop it is either on the side, rear or top of the Computer Case.","HiYou can go to the right answer under this thread for help.https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/windows-10\/7a848f7b-06bf-41b3-b3ae-f8821d91543cRegards,","how do I know that my computer is operating on window 7 or window 10 Hello,Press Windows + R, type winver and click OK. The About Windows dialog should mention your current operating system details. Regards."]},{"symptom":"Migrating to new PC        Hello, I bought a new PC and wanted to know if the stored credentials and themes on the old PC can be transferred to the new PC. I've already transferred apps and and my documents over to the new PC. It seems the migration tool I used missed the credentials and themes.Can these be transferred to the new PC?","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.If you use a Microsoft account and you have chosen to sync you personalised setting then once you login using the same account on the new PC then these will all transfer.Here is an article which explains this in more detail: https:\/\/support.microsoft.com\/en-gb\/help\/402610...Regards, Ross","Hello, No the account used on both PCs are local accounts. My preference is to use local account although I see advantages to using Microsoft account.ThanksHi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.If you use a Microsoft account and you have chosen to sync you personalised setting then once you login using the same account on the new PC then these will all transfer.Here is an article which explains this in more detail: https:\/\/support.microsoft.com\/en-gb\/help\/402610...Regards, Ross","If you are considering using a Microsoft account anyway you can associated the local accounts you already have with a Microsoft account and this will perform the sync for you.I would recommend this as being the easiest method to achieve what you are looking to do.Here is a guide which details the steps: https:\/\/www.windowscentral.com\/how-switch-local...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hello Ross,No I was not considering using a Microsoft account which I understand would solve my problem. Is there any other way to get the display themes and webcredentials as well as local credentials  transferred?If not I may have reconsider switching to Microsoft account.Thanks in advanceIf you are considering using a Microsoft account anyway you can associated the local accounts you already have with a Microsoft account and this will perform the sync for you.I would recommend this as being the easiest method to achieve what you are looking to do.Here is a guide which details the steps: https:\/\/www.windowscentral.com\/how-switch-local...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","HI, There are a few options but Microsoft are very strong pointing you to using a Microsoft account at the moment.Please see this article which discusses the pros\/cons of the other options: https:\/\/www.howtogeek.com\/413193\/how-to-migrate...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Audio not working        My friend accidentally deleted Realtek audio from device manager. Now the sound won't come out of my headphones or the laptop.","solutions":["Hi Obunga_69, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.When you open Device Manager, is the audio device displayed under \"Other devices\" with a yellow exclamation mark icon by it?If not, try to right click and select \"Scan for hardware changes\" If it is listed still, right click on it, and Select \"Search automatically for updated driver software\".Or, Select \"Update Driver\". If Windows doesn't find a new driver, you can try looking for the driver on the device manufacturer's website and follow their instructions.Source: https:\/\/support.microsoft.com\/en-ca\/help\/402844... If you can provide us with the make and model of your laptop, we can help provide you the correct download link for the audio driver for your computer.I hope this has helped you. Please reply and let us know the model number, and we would be happy to look into providing some different suggestions!Regards, -Ashton","When I opened device manager I couldn't find my audio device and when I scanned for hardware changes nothing happened.I have an Acer Aspire R5-51T7 for my laptop.","Thanks for this information! Did you mean R5-571T? (Just want to confirm as I could not find R5-51T7 on Acer's website)If so, here is the link for the Acer Aspire R5-571T driver support page: https:\/\/www.acer.com\/ac\/en\/US\/content\/support-p...Here I would suggest to download the Audio Driver from Realtek (screenshot attached, and direct link below)https:\/\/global-download.acer.com\/GDFiles\/Driver...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know how this goes for you! -Ashton","My friend accidentally deleted Realtek audio from device manager. Now the sound won't come out of my headphones or the laptop.Hello,You need to go to Acer's website and download latest audio drivers for your system model.Or refer this fix:https:\/\/www.kapilarya.com\/fix-no-audio-output-device-is-installed-windows-10Hope this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP."]}]}