{"windows":[{"symptom":"My Hard Disk Crashed !        My Hard Disk has Crashed so if i replace hard disk, would i be able to use the same keys of windows 10 & office which i was using earliear ?","solutions":["For Windows 10;If the computer was activated there is no longer a need for a key.If asked for a key just go to the bottom of the page and click on Skip, Do this later, or I do not have one.This is as long as you install the same version, Home or Pro."]},{"symptom":"Gaming Mouse\/Laptop extra keys.        Hello folks, i have had these Trust brand gaming mouse and keyboard duo for a while. they come with a total of 17 extra keys between them, 5 on the keyboard, and 12 on the mouse. Is there any way i can get Windows to use them for extra functions? i.e. have windows reconize them when pressed while assigned for for instance in-game functions?Kind regards Jos.","solutions":["Hi there, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.Typically these keys can be programmed using the software that comes with the devices.For example, the product page for this particular mouse states \"Advanced software for programming buttons & macro’s\"http:\/\/trust.com\/en\/product\/20411-gxt-155-caldo...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Have you installed the Trust programming software on your computer? If you can provide the model numbers we can look into the correct software and manuals on how to perform this.I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"Cannot see popup that would normally be visible when I use F keys to disable\/enable touchpad, airplane mode.        When I press a F key on the keyboard, a popup would be visible on the screen telling the activity that happened. Pressing F6 for example would enable\/disable touchpad and it would show the popup I'm telling about. All the keys work fine but they don't trigger any sort of visual indicator. What do I need to do?","solutions":["Hi Samet. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.That's controlled by a hot keys driver on the PC maker's Support Downloads web page. You'll have to go through all the available drivers to find the one for F keys, Hot Keys, or some other variation on its purpose. It can also be in the chipset so I'd update that and any other drivers including BIOS that are newer. The most basic thing we need to learn to maintain a PC is how to keep the latest manufacturer's drivers current. Windows Update drivers are never enough.If you know when this stopped working, you can also System Restore to a point before the problem began following this guide:https:\/\/www.windowscentral.com\/how-use-system-r... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows 10 Activation on different computer (old computer scrapped)        I purchased a new computer in Thailand (still live in Thailand) and Windows 10 Enterprise requires activation.We can't activate Windows on this device as we can't connect to your organization's activation server. Etc and has an error code 0xC004F074.I then tried to change the product key (I had for my scrapped computer) but it will not accept the numbers, only letters. The Product Key I have is not for Enterprise. Where to from here?","solutions":["Hi pjw5630, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.The version of Windows 10 installed (for example, Home and Pro) needs to match the product key you have.Enterprise versions are typically used by businesses and so your old computer's key likely was not an Enterprise version.Do you know what version of Windows your previous scrapped computer had? If you are moving from Enterprise to Home edition, for example, you would need to perform a clean installation of Windows. In this process you would lose existing programs, files, and settings, so please ensure you have a backup of all important files before proceeding. I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"Windows 10 Reset PC Delete all files        Hello I just wanted to know if its normal for a pc to take over 12 hours to reset. I chose the option to delete all files but not the option to make sure that everything is completely wiped for security reasons. Started it at noon and now its 12 am. I have 3 TB of storage but only about 70% is full.","solutions":["Is all this 70% on the C:\\drive?","Hi Carlos. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Reset can fail if it chokes to death on a bad install or corrupted account. Let it go as long as you can, then hold in the power button to cut the power, wait 10 minutes to cool down, then power on to see what happens.You may need to create bootable media to access Repair Mode, Reset or do the gold standard Clean install. The bootable media has it's own drivers, repair and installation files which often work when Windows or the other Repair Mode doesn't.To create Windows 10 Installation Media on another PC install Media Creation Tool and follow the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, on second screen choose Repair Your Computer, then Troubleshoot Options to try a Reset.If that fails choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, click Next to let it create needed partitions and start install - this makes it foolproof.Everything needed to get the best possible Clean Install is here: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... It is a better install than any amount of money can buy and a great learning experience that will make you the master of your PC because you will learn what works best and how to apply it with your own hands. If you have files that aren't backed up you can use the same bootable media to try to rescue your files using these methods:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Add bluetooth device wizard keeps crashing        HelloI am currently using Windows version: Windows 10Ver1903 (64-bit) build 18362.535I have had an issue of late, every since I updated to windows 1903, where the bluetooth wizard (using Windows Shell Experience Host) Keeps crashing after displaying the device list for about 0.2 seconds.I am visually impaired, so had to get some sighted help to verify this, but it has been doing this for a while. I've tried everything out there, adjusting the windows nt service settings, services, messed with the drivers a bit. My driver is up to date, its just the wizard that keeps crashing.Any help is apreciated.Tylah","solutions":["Hi Tylah. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give all possible steps for troubleshooting Bluetooth in order of priority, so even if you've tried them please do it over in sequence. Many problems right now are being solved by updating to the latest version so if you want to skip to that step see the Repair Install at bottom: Try Updating the Bluetooth driver from the PC maker's Support Downloads webpage for your exact model. Install it even if it's the same or newer than the one in Device Manager reached by right clicking the Start button.Right click Start button to access Device Manager, locate Bluetooth device (if necessary from View tab Show Hidden Devices), on Driver tab see if Roll Back is available, if not try Update Driver, first automatically, then Browse, then Let Me Pick to try all previously installed Drivers. If these fail Uninstall the Driver, restart PC to reinstall. If the BT driver is not there, access the View tab in Device Manager to \"Show Hidden Devices.\"Make sure you're pairing correctly as shown here: https:\/\/support.microsoft.com\/en-us\/help\/15290\/... See Fixes here which are all working: https:\/\/support.microsoft.com\/en-us\/help\/14169\/...https:\/\/superuser.com\/questions\/1017867\/make-wi...https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/www.lifewire.com\/fix-windows-10-bluetoo...Try the Bluetooth troubleshooter at Settings > Update & Security > Troubleshoot. Try turning off Fast Startup at Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change settings that are unavailable > uncheck Fast Startup.If this is a mic or headset right click Volume icon in System Tray to Open Sound Settings, make sure the correct device is selected for input or output in the dropdown menu.Then try pairing again, if necessary run the Bluetooth Troubleshooter again. If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....If you think the BT adapter has failed, you can replace it easily with a USB nano adapter like this one:https:\/\/www.amazon.com\/ZEXMTE-Bluetooth-Receive... Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1909 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"HP laptop windows rear facing camera will not work        HI I am not sure why but my camera to see the outside world quit working.  Here is my dx info and I already made sure everything is update.if you can help, please respond.Thank youLori SeversonVideo Capture DevicesNumber of Devices: 1---------------------           FriendlyName: HP TrueVision HD Camera               Category: Camera           SymbolicLink: \\\\?\\usb#vid_05c8&pid_03ba&mi_00#6&73fe50&0&0000#{e5323777-f976-4f5b-9b55-b94699c46e44}\\global               Location: Front               Rotation: 0           Manufacturer: Microsoft             HardwareID: USB\\VID_05C8&PID_03BA&REV_0003&MI_00,USB\\VID_05C8&PID_03BA&MI_00             DriverDesc: USB Video Device         DriverProvider: Microsoft          DriverVersion: 10.0.18362.1      DriverDateEnglish: 6\/21\/2006 00:00:00    DriverDateLocalized: 6\/21\/2006 12:00:00 AM                Service: usbvideo                  Class: Camera          DevNodeStatus: 180200A[DN_DRIVER_LOADED|DN_STARTED|DN_DISABLEABLE|DN_NT_ENUMERATOR|DN_NT_DRIVER]            ContainerId: {00000000-0000-0000-FFFF-FFFFFFFFFFFF}            ProblemCode: No Problem  BusReportedDeviceDesc: HP TrueVision HD Camera                 Parent: USB\\VID_05C8&PID_03BA\\0001      DriverProblemDesc: n\/a           UpperFilters: n\/a           LowerFilters: WdmCompanionFilter                  Stack: \\Driver\\ksthunk,\\Driver\\usbvideo,\\Driver\\ACPI,\\Driver\\usbccgp      ContainerCategory: n\/a          SensorGroupID: n\/a                   MFT0: n\/a                   DMFT: n\/a    CustomCaptureSource: n\/a  DependentStillCapture: n\/a     EnablePlatformDMFT: n\/a              DMFTChain: n\/a EnableDshowRedirection: n\/a     FrameServerEnabled: n\/a        AnalogProviders: n\/a             ProfileIDs: n\/a","solutions":["Hi Lori. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you all possible fixes that are working for others for webcam problems. If you need help performing any steps I am standing by to help.1) Try resetting the Camera app at Settings > Apps > Apps & Features > Camera > Advanced Options.2) Did you enable the Privacy setting to allow apps to use your webcam? https:\/\/privacy.microsoft.com\/windows-10-camera...https:\/\/www.lifewire.com\/fix-windows-10-webcam-...3) Try also these steps for when webcam isn't working: https:\/\/support.microsoft.com\/en-us\/help\/13753\/...https:\/\/www.lifewire.com\/fix-windows-10-webcam-...https:\/\/www.kapilarya.com\/something-went-wrong-...https:\/\/support.microsoft.com\/en-us\/help\/13753\/...4) Try Updating the webcam driver from the PC or webcam maker's Support Downloads web page for your full model number, Serial Number, or Dell Service Tag number from sticker on PC.Also compare all other drivers including Chipset, display, sound, etc to make sure you have the latest on the PC maker's Support Downloads web page.Additionally on Webcam Driver tab see if Roll Back is available, if not try Update Driver, first Automatically, then Browse, then Let Me Pick to try all previously installed Drivers.If these fail try to Uninstall the Driver, restart PC to reinstall. 5) If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool explained here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... 6) If this was caused by a Version Update then you can roll it in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool explained here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... 7) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. 8) If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... If there are any hurdles during install then these steps can overcome them: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","In Camera app if you open it in the upper right there is an icon of a camera with arrows around it.Click on it and it will change cameras."]},{"symptom":"how to remove duplicate photos in windows 7        how to remove duplicate photos","solutions":["how to remove duplicate photos Are these photos that you have downloaded from a camera or other device and stored in the My Pictures Folder. ???You could right click on them one at a time to highlight and then and select delete from the drop down that appears.Or hold down the \" ctrl \" and \" alt \" key and left click on the individual photos which you want to delete ( which highlights them ).After they are highlighted right click on one of them and select delete from the drop down that appears and all the highlighted ones will go to the recycle bin.Or hold down the \" ctrl \" key and hold down the right mouse bottom and drag the cursor around the ones you want to delete and select delete from drop down that opens.There is probably a batch file script for doing this as well which i am not versed in.I myself don`t trust duplicate finders."]},{"symptom":"how do I get outlook to show my emails on a new asus computer?        how do I get outlook to show my emails on my new asus computer?","solutions":["When you say \"Outlook\", do you mean the web-based Outlook.com service, desktop Outlook that's part of the Office 365 suite, or Windows 10 Mail? Who is your mail provider? What have you tried so far?","windows 10 mail I think - it says outlook - but I do not have office. I have mymts as my provider. I linked my old computer with my new one and got outlook on it and my contacts come up and I can send new mail, but my new emails do not come into my inbox. I can access emails by going to webmail, but they just don't show up in outlook. Info I have found is I have to go to file and do something there, but I cant even find file!!","When you created the account, what type of account (POP or IMAP) did Windows 10 Mail create?"]},{"symptom":"Windows Server 2019 installer folder occupied 368GB !!        Hi ,   I hope to get answer here,   thanks in advance , recently I noticed that my windows server 2019 hard disk out of space suddenly , upon checking it is because the installer folder occupied 368GB. Have tried disk cleanup but nothing help.   please tell me what should i do???  ","solutions":["Hi Danny. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Here's what you need to know about Windows installer folder clean up: https:\/\/docs.microsoft.com\/en-us\/archive\/blogs\/...https:\/\/gallery.technet.microsoft.com\/scriptcen...http:\/\/www.theovernightadmin.com\/2013\/10\/cleanu...If those do not help much then I'd install Treesize to analyze the folder to isolate the outsized file(s) so we can investigate removing it. See how here:https:\/\/www.groovypost.com\/howto\/map-hardrive-u...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"BSOD's becoming more frequent on new PC, looking for fix        I've recently upgraded my PC and have been consistently encountering BSOD's over the past week.The main issues I've been having are:SYSTEM_SERVICE_EXCEPTIONIQRL_NOT_LESS_OR_EQUALAPC_INDEX_MISMATCHI've had to re-install windows twice now and would ideally not have to do so again. My pc's consistently crashing several times a day and I'm looking for any solution to the problem.I'm fairly sure it's a driver issue, but the problem is that I'm not sure how to identify the faulty driver.I'm also in the process of trying to upload the crash dump files however I'm having issues opening the files\/uploading them to dropbox.I'd greatly appreciate any help in this matter. ","solutions":["Hi Ozy_X, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved. Troubleshoot blue screen errors <-- read this link http:\/\/windows.microsoft.com\/en-us\/windows-10\/t...Since you re-installed Windows the issue has to be hardware. Try reducing the system down to as simple as possible to see if that helps stabilize it.Also, the system is still new so under full warranty so you definitely need to check with the seller and system maker's support. As OEM, the system maker is responsible for the proper operation of both the hardware and Windows. So regardless of the cause it is theirs to resolve. Remember the more you do the more they will say it is something you have done, Added that even if you are somehow able to resolve the issues you would still want it fully documented just in case of further related problems down the road.Troubleshoot blue screen errors <-- read this link http:\/\/windows.microsoft.com\/en-us\/windows-10\/t...======= Though I do not recommend you trying to troubleshoot without the system maker's support, if you really want to try to determine the likely hardware cause you can try running stress tests.https:\/\/www.thewindowsclub.com\/pc-stress-test-f...PC Stress Test free software for Windows 10\/8\/7 Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all.","Hi Rob, thanks for the quick reply.The system in question is a custom built pc so there wouldn’t be a single manufacturer to contact. The only components that transferred over from my previous build was a 240gb boot ssd, the ram, and a wireless networking card. I’ll also mention that failures were nowhere near as common with the old pc as they are with the new one.Additionally I used Blue Screen View to read the dump files and it indicated that Ntoskrnl.exe was the common problem across the various failures.I’ll try stress testing the system later today, Hopefully it will help narrow down the problem.If there’s any thing I can do on my end to make the diagnostic process easier let me know.","Be sure the SSD has the latest firmware. Also, ensure to check the BIOS and chipset drivers with the motherboard maker's site.Ntoskrnl.exe is a Windows component which means something else drove it into Fault. BSV is a good program though not nearly as detailed or accurate as what I use, such as WinDBG.Since it is a home build please note that new parts almost always need to be reseat - so remove ALL power then reseat all the cards, memory, and cables )on both ends when possible) - actually remove and replace - do not just snug.Multiple different BSOD often do indicate hardware problems. And you have re-installed Windows which also indicates hardware.Have your run memtest86 to check the memory? Let it run for 4+ hours and overnight is best.Here to help, Rob","System specs in case it's relevant:AMD Ryzen 5 3600XGigabyte X570 Aorus Elite motherboardEVGA Nvidia RTX 2070 Super XC GamingCorsair Vengance LPX DDR4 16gb 3200mhz (CMK16GX4MB3200C16W) - From previous buildCorsair Force LE 240gb (Boot Drive) - From previous buildWestern Digital Black 1tb SN750Dlink Wireless networking card (not sure of name, can get if needed) - From previous buildLink for Minidump files, I managed to WinDBG running however I am not a developer and wasn't able to use it to it's fullest potential.https:\/\/www.dropbox.com\/s\/6r6lo8sckxi9q9w\/minidump.zip?dl=0Let me know if you have any trouble access the Minidump files.I ran Memtest86 today while I was at work and the results (or lack of results) were not great..I managed to get Memtest running fine. before I left I turned my monitor off which was a mistake unfortunately. For whatever reason the PC would not recognize the monitor after turning it back on no matter what I tried:Unplugging and plugging back in the DP cableSwapping the DP cable for a HDMI cableplugging the HDMI cable into the motherboard display port instead of the GPU portDoing the above with a spare monitorAs a result I had to reset the system and lost the results of the Memtest run. As far as I'm aware there's no way to recover the results unless you save them after the test is finished. The entire experience was incredibly frustrating.I'll be running Memtest again overnight to try to gather a usable result and post a update tomorrow with how it goes. I also reseated the various components as well.Also: I looked into updating the firmware for the 240gb drive but the drive type apparently isnt supported by Corsair's drive utility (Corsair SSD Toolbox) however when open the drive is recognized and the firmware is indicated as up to date. I'll have to dig around a bit more to see if the drive is indeed up to date.","Sounds like Memtest had a failure. So you do need to run it again. Are you over-clocking anything? If so STOP! (Makes it very difficult to impossible to troubleshoot a BSOD and it can cause them.)For the latest minidump the process running was PROCESS_NAME: iCUE.exe which is Corsair's Utility.BugCheck 1, {7ffd458d8694, 0, 1, fffff90642e30b80} Probably caused by : ntkrnlmp.exe ( nt!KiSystemServiceExitPico+1fe ) ntkrnlmp.exe in a Windows component which means something else drove it into Fault.Further detailed analysis implicated the Nvidia video driver though other issues, such as memory, could be the root cause here as well.fffff906`42e2f7d8 fffff801`7bfd236aUnable to load image \\SystemRoot\\System32\\DriverStore\\FileRepository\\nv_dispi.inf_amd64_a3efb8aa9e9e249a\\nvlddmkm.sys, Win32 error 0n2*** WARNING: Unable to verify timestamp for nvlddmkm.sys *** ERROR: Module load completed but symbols could not be loaded for nvlddmkm.sys nvlddmkm+0x73236anvlddmkm.sys dated 12\/6\/2019 Nvidia video driver. 1, Check with Nvidia Support and Forums about any known issues with that driver. Update if possible though the driver may not be the real issue.2. Uninstall all versions of CPU_Z which seem to have a role (though maybe not really involved anyway).3. None of the other 4 minidump showed any real likely cause which often indicates hardware. Turn off the RCG while troubleshooting.4. Check the memory again as you indicated. 5. Did you reseat everything? A very common problem with home builds is loose cards, memory, and\/or cable connections. Remove ALL power then reseat all (cables on both ends) - actually remove and replace - do not just snug. <--- Please do this as it very often resolves the problem. Troubleshoot blue screen errors <-- read this link http:\/\/windows.microsoft.com\/en-us\/windows-10\/t...6. Be sure to check with AMD and Gigabyte (as well as Corsair) Supports for known issues. And latest BIOS and chipset drivers.Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all.","I ran Memtest overnight and while I was at work, it detected 0 errors with the memory.On the topic of overclocking I previously had XMP enabled with a different set of ram. This was prior to reinstalling windows. The system was very unstable and after running the windows memory diagnostic it was determined that there was a physical problem with the ram. I've swapped the ram with my old set which passed the Windows memory diagnostic. I've been running stock ram settings since.I've since completely rebuilt the sytem including re-seating the cpu. The ram was removed, Both drives, the gpu, the wireless card, and all cables from the PSU (both ends). I psychically took the motherboard out of the case to inspect for damage however was not able to find any. I was able to find two things from dismantling\/rebuilding the system.First, I'm not sure I installed the CPU cooler correctly. I noted after taking the cooler off the cpu it looked like that only about 25% - 30% of the paste had came in contact with the cpu. Furthermore, when I reattached the cpu cooler I made sure to follow AMD's instructions and noted that it took a LOT more pressure to apply than the first time.Secondly, I'm not sure if my Corsair SSD is firmly locking my SATA cable in place. In my experience the cable would make a snapping sound when secured which was absent from my build. Additionally I found while reconstructing my system that the cable looked quite loose even while leaving it alone. If the SSD is the issue I wouldn't have a problem ditching it and only using the 1tb m.2 drive as the boot drive. I've taken pictures of both of these issues https:\/\/imgur.com\/a\/XSwHtrYCPUZ was uninstalled and I'm looking into nvlddmkm.sys issues, Mobo Bios and Chipset drivers are up to date.","Pictures do indicate \"possible\" problems. Both the CPU cooler and SATA cable issues can cause the problems you are having. And it is even possible there is more than one problem. Best to refer to AMD's support and that of the motherboard (gigabyte).That Corsair utility would still worry me.... Check with Corsair about that. Here to help, Rob","Any luck yet? Here to help, Rob","As of now I haven't gotten a BSOD since the 7th. While I don't want to sound overly optimistic at this point it seems re-applying the Cpu cooler and ensuring the SSD Sata cable is firmly attached may have solved a* problem with the system.The issue now is that my drives are running extremely slow and I'm not sure what caused it. Both my SSD's are running noticeably slow with Crystal Disk Mark indicating write speeds anywhere from 100-200MB\/s. I ran CDM when I first built the system and both drives were running at their advertised speeds fine. I'll also mention that the speeds were fine after rebuilding the system. It was only later in the evening that the speeds dipped.I haven't gotten anywhere with determining the Corsair drive's firmware but Western Digital's drive utility has indicated that it's drive's firmware is up to date. Before you ask, A Windows Defender full scan came back with no virus issues.In terms of nvlddmkm.sys, I have found a few potential solutions that I have yet to try. I'll check back in when I know more.As for ICue, I updated it's firmware. If issue keep happening I'll completely uninstall it. Another thing to keep in mind is that the deadline to return parts that have a manufacturing defect is approaching. I bought all the parts from Canada Computers which offers a 30-day exchange warranty service. I bought the parts on the 21st of December so the warranty will be in effect until the 20th of January. In the event that we can't nail down the issue before then I'll hand the parts off to them and let them find the faulty component.Thanks again for you help.","This is Rob with my other persona :Be sure the SSD has the latest firmware.Double check BIOS and chipset drivers. Ask their supports and forums about any known issues.-------You might want to try running stress tests to see if that helps to identify an issue.PC Stress Test free software for Windows 10https:\/\/www.thewindowsclub.com\/pc-stress-test-free-software------If you don't have any additional questions, feel free to mark as Answer and choose a rating which helps others find the right info.Glad to have helped, and have a great day!Rob"]},{"symptom":"ie 8 in XP        Greetings, have a Levono laptop use in case of others having issues but when trying to load ie8 with a local news site it's coming back with a connection issues message. If I go to MSN it's fine? Appreciate some help please as 82 years young but can't figure out what to do. Spent 2 days on it!!!","solutions":["IE8 is a security risk to use on the Net and a lot of websites no longer support its use.That's why you are having problems.You need to use a different browser than IE8.It is hard to find a browser that still works with XP.I have not tried this one myself, but others report that it works for them.But use it at your own risk.https:\/\/www.snapfiles.com\/get\/vivaldi.html","IE8 is a security risk to use on the Net and a lot of websites no longer support its use.That's why you are having problems.You need to use a different browser than IE8.It is hard to find a browser that still works with XP.I have not tried this one myself, but others report that it works for them.But use it at your own risk.https:\/\/www.snapfiles.com\/get\/vivaldi.htmlThanks Bill, will give it a try! Cheers, Alan","Greetings, have a Levono laptop use in case of others having issues but when trying to load ie8 with a local news site it's coming back with a connection issues message. If I go to MSN it's fine? Appreciate some help please as 82 years young but can't figure out what to do. Spent 2 days on it!!! -Try these procedures: 1. Clear the Cache.     Internet Options> General tab> Browsing History> Delete> uncheck \"Preserve Favorites website data\" then delete Temporary Internet Files. No reason to delete cookies, history,  passwords, etc. but you can if you want to.2. Clear the DNS Cache.   From Start> All programs> Accessories, right-click Command Prompt and choose \"Run as administrator\". At the flashing cursor type inipconfig \/flushdns (note the space between config and \/ ) hit [Enter] then Restart.Don","Unable to get Vivaldi Bill, it defaulted to ie8 and same issues arose. Kept stating connection issues yet network fine and easily manage to get mail.What's more annoying is when I try to log in to the Lenovo Think Advantage it keeps telling me the windows password is wrong!! That's crazy as I use it when starting up!?Below the sign in area is a Forgotten your Windows password feature but it's inactive so totally useless.Maybe it's time to dump it!","The problem is IE8 in XP in most cases won't let you download anything because it is not supported on the websites you are going to.You would have to use a different computer with a supported browser to download and save a new browser > then copy it to a flash drive > transfer it to the XP machine > then install it there.But XP is a security risk with or without a new working browser.@@@@@@@@@@@@@@@@@@@@@@So it is also telling you that the log in password is wrong, but it lets you in anyway?","Sorry,  I meant the Think Advantage login area. Windows is fine.I'll try your suggestion Bill and see what results I get. If nothing it's off to the recycling centre!!!Cheers, Alan from New Zealand","Cheers. Bill from across the ditch :)","Wow!!...  Kia ora!Hopefully you're safe from the disastrous fire situation 🙏"]},{"symptom":"Problem with display when playing video games.        Hello,I have a gaming laptop and I have an annoying problem with the display for some time. Whenever my laptop is plugged in (charger) and running any game (assassin's creed for example) my screen goes dim. However when it's not plugged in, the brightness of my screen stays the same. I tried reinstalling the display drivers and also doing a factory reset but unfortunately the problem persists.Specs : gpu : gtx 1060 3gb max q designintegrated gpu :  Intel(R) UHD Graphics 630cpu : Intel(R) Core(TM) i5-8300H CPU @2.30 ghz  2.30ghzOS : windows 10 Home vesion 1903laptop model : HP pavilion 15t-cx0023nf","solutions":["Hey MC, Evan here an Independent adviser here to help you...if I can. Are you currently on a high performance power plan? Is your GPU set to adaptive\/full power mode (integrated that is).Have you turned off adaptive contrast\/brightness?","Hi Evan,Thank you for the quick response. Yes, I am using the high performance power plan but the problem continues. I also tried putting maximum performance for the power management (in nvidia control panel) however the problem did not get fixed.  I am unable to turn off adaptive brightness because I do not find it in the advanced Power settings.","I tried to run a game and just leave it (even with the dimming), it froze and crashed. It showed this :","I am going to attach a picture to this message. Does your power option currently have this function? (arrow in screenshot)","No it does not have this option."]},{"symptom":"I upgraded to a new Surface Pro and now I don't have permission to open files on my MicroSD card.        I recently upgraded to a new Microsoft Surface Pro. I migrated from an older Microsoft Surface Pro. I used the MicroSD card slot with a 125GB card which was my drive D:While I was on the old system I created a personal folder on the MicroSD for my med files. When I upgraded I simply moved the Micro SD card from the old to the new computer.  Everything seemed fine on my new PC so I reset my old computer and gave it away.All my files were visible on my Micro SD card in the new PC, and I could go through my subfolders to see all my files were listed. Just recently I needed to open one of my personal files and it said \"It looks like you don't have permission to view this file. Check the permissions and try again.\"It appears that the files in my personal folder have the Attribute set as \"AE\".  Somehow my personal files are either encrypted or I don't have permission on my new PC.Is there a way to tell if this is permission related or encryption?  And if encrypted which encryption, BitLocker or other?And if it is encrypted how do I login\/give password\/or somehow identify myself as the owner.Rightclicking Properties-SecurityTab doesn't exist.  I even tried to find the Security Tab by rebooting in Safe Mode (it wasn't there).I even tried \"cipher \/d\" to decrypt the file within the command window on command line.  The \"cipher \/d\" gave \"...[ERR]...The specified file could not be decrypted.\"I can't tell how to decrypt with BitLoocker.  I think I still have my recovery key for the old PC, but don't know how to use it or where to enter it to regain access to my personal files.I looked at my MicroSD card on my real old Vista PC.  All the files showed a hidden extension of *.PFILE (for example my Windows 10 file: vacinations.jpg file was listed as vacinations.jpg.PFILE on the Vista PC) .This is very frustrating.  Any help would be greatly appreciated.Thanks","solutions":["Have you gone to Disk Management (win key + x) and seen if the SD card is there and has a letter for File Explorer?","Yes, it shows up as D:  exFAT  Healthy.I can view all the folders, subfolders, and filenames.  I just cannot open the files.I normally view files with \"Details\".When I doubleclick the filename it comes back as \"You don't have permission to view the file...\"When I change the folder view from \"Details\" to \"Icons\" the filename icons shows a closed yellow lock on the upper left corner of the icon.","If this is not the right venue for this type of question, where should I look for answers?"]},{"symptom":"Windowed tab freezing.        Most of the games, when i'm on full screen, they run normaly, but when i put then on windowed screen or small screen, the screen just freezes until its back on full screen, when its frozen, i can put inputs in the game but i wont see what i'm doing.","solutions":["Hi VB. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) Update the Display driver from the PC or Display adapter maker's Support Downloads web page for your exact model number, HP Serial Number or Dell Service Tag - from the sticker on the PC.While there check also for newer chipset, BIOS\/UEFI firmware (very important), network, sound, USB3 and other drivers, comparing to the ones presently installed in Device Manager reached by right clicking the Start Menu.If this doesn't give you the latest or ideal driver for what you need, compare it to the driver offered by the Intel driver update Utility here:http:\/\/www.intel.com\/content\/www\/us\/en\/support\/... or the Nvidia Update utility here: http:\/\/www.nvidia.com\/Download\/Scan.aspx?lang=e... or the AMD autodect utility here: http:\/\/support.amd.com\/us\/gpudownload\/windows\/P... For Display issues one fix that is working is to Roll back or Uninstall the Driver on the Display Device > Driver tab, restart PC to reinstall driver.You can also try older drivers in Device Manager > Display device > Driver tab > Update Driver > Browse > Let Me Pick.Then you will know you've tried everything in addition to Windows Update drivers.Adjust the screen resolution until it fits and looks best at Settings > System > Display.2) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 3) If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... -------------------------------------------- But remember that in Windows 10 everything depends upon the quality of the install, and Factory or Upgrade installs are inferior installs which most enthusiasts won't even run because they'd expect endless issues. Consider now or later doing the Clean Install in this link which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... There is also an automated Fresh Start that reinstalls WIndows while shedding corrupting factory bloatware, saves your files, but doesn't clear the drive to get it cleanest:https:\/\/www.howtogeek.com\/265054\/how-to-easily-... I hope this helps. Feel free to ask back any questions and let us know how it goes. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Microsoft Sculp Ergonomic Desktop mouse button click is not working properly        I bought Microsoft Sculp Ergonomic Desktop keyboard and mouse from Amazon two years ago.Now the mouse buttons, both left and right, do not respond on every click every time.I have to click twice on most of the time. It's very annoying.I found many people had the same issue for years.I am wondering what the warranty is? Is it possible to have it replaced or fixed?Thanks","solutions":["Go Settings, Devices, Mouse and check the settings.","Hi Arthur. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Go here to download and install the Mouse and Keyboard Center software for the Microsoft Ergonomic Desktop Keyboard and Mouse:https:\/\/www.microsoft.com\/accessories\/en-us\/pro...The Warranty and Product Guide are also there on the Downloads page. There's an easy way to troubleshoot if this is a hardware or software problem here:https:\/\/www.howtogeek.com\/428533\/mouse-left-cli...Also go into Device Manager reached by right clicking the Start button, find Mouse and right click to Uninstall, Restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver. See other troubleshooting for that mouse here: https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/answers.microsoft.com\/en-us\/windows\/for...When did mouse last work correctly? What has changed since then? Is there a System Restore point to roll back to before then?http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... Change the batteries if wireless, try another USB port, reset mouse from button on bottom if available - or search Google for specific steps how to reset your mouse.Try the mouse in another PC to isolate if it's the mouse or Windows causing this.Try another mouse in this PC to confirm if Windows is the problem. For mouse lagging or freezing issues see https:\/\/www.thewindowsclub.com\/mouse-pointer-la... Access the Device Manager reached by right clicking the Start button, choose the Mouse, then Driver tab. First try Update this Driver > Automatically, then Roll Back if available. If not choose Uninstall button, restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver.Is there mouse software installed in Settings > Apps > Apps & Features? Uninstall it to see if the problem stops. This is unneeded bloatware.Adjust the mouse settings in Settings > Devices > Mouse, checking all settings including the Additonal Mouse Options box - check Settings on all tabs.Report back all results for possible other things to try. ________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Greg,Thanks for your reply.I don't think it is a software problem.I use Ubuntu most of the time. The mouse works fine at the beginning, however, the sensitivity of the button dropped.I've changed batteries and it didn't improve. When I changed to another mouse, the problem was gone.I've checked the warranty, my mouse is still on the warranty.I like the keyboard and don't want to plug another wireless mouser receiver to my computer. Wondering if I can send it back to fix or have another replacement?Thanks","Hi again Arthur - Really glad to hear it's still under warranty. So you'd go here for warranty support:https:\/\/support.microsoft.com\/en-us\/help\/449392...I notice they've forwarded their Contact Support to the Virtual Agent, which can work if you describe your problem a bit and then keep saying you want an agent.But there are also phone numbers for Customer Service here: https:\/\/support.microsoft.com\/en-us\/help\/405170... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved."]},{"symptom":"Turbotax Premier 2019 Will Not Load        I have Windows 8.1 on my Dell XPS 2720 computer. I used a CD to load Turbotax Premier 2019, and it appeared to load correctly. However, when I click on the desktop icon to activate the program, nothing happens. I have successfully used Turbotax in past years on the same computer without any problems. Any suggestions?","solutions":["Right click on the desktop icon > run as Admin.","That did not solve the problem. The Turbotax program has installed successfully, but when I click on the desktop icon the program fails to activate. When I look at the Task Manager, it shows \"not responding\" after the icon is clicked. I tried troubleshooting this with a Turbotax tech support technician, but to no avail. What can I try to get the program to activate? ","That did not solve the problem. The Turbotax program has installed successfully, but when I click on the desktop icon the program fails to activate. When I look at the Task Manager, it shows \"not responding\" after the icon is clicked. I tried troubleshooting this with a Turbotax tech support technician, but to no avail.What can I try to get the program to activate?  That's a Turbotax problem; not a Microsoft Windows problem.I suggest that you get back onto their Tech.","I installed Premier 2019 in my Windows 10 Desktop successfully.  When I run it, it goes through the update process fine.  When I begin a new tax return, Task Manager shows the program not responding, and the process times out.  Tried contacting Tech Support to no avail.  Did the same thing on my other desktop, but got the same results.  I got my software from Amazon.  Thinking it may be a bad CD, I deleted it and installed a downloaded version ... got the same results.  I believe this is a Turbotax problem.  My W10 software is up to date.  I returned my CD to Amazon and will be looking for another tax solution.  Does anyone know a good one?"]},{"symptom":"System clock fails and runs late or ahead        Hello! A problem I never had beforeWin 10 x64 System clock fails and runs late or ahead between syncs. After a sync with time.windows.com everything is correct for some time. In day or two clock runs ahead or late again.I tweaked all I could. Turned on and off time sync, turned on and off time zone detect. System clock still failsI changed motherboard battery, re-flashed bios and finally exchanged motherboard for new one. (MSI MEG Z390 ACE)Still clock fails. Any thiughts?","solutions":["Hi AM. I'll try to help you out. As you exchanged the motherboard, it should be software related. Here is some ideas to test out : - change your time zone, save and reboot. then re-set to your correct time zone. - check for updates in windows update Also, how many hours \/ minutes is the clock ahead\/late ? Is it constant, or variable \/ increasing with time ? I'll wait for your news Regards","Hi AM. I'll try to help you out. As you exchanged the motherboard, it should be software related. Here is some ideas to test out : - change your time zone, save and reboot. then re-set to your correct time zone. - check for updates in windows update Also, how many hours \/ minutes is the clock ahead\/late ? Is it constant, or variable \/ increasing with time ? I'll wait for your news Regards Can't figure out exactly how many hours\/monutes clock ahead or late. It can for few days go 1-2 seconds\/day ahead - then jump to 20 minutes late. TWICE 20-25 minutes it was alte in last 4 months i'm using this harware and windows install.Update is always in time. Cahging time zone will check in 1-2 days.","Ok, so the change is variable. I'll keep thinking about it, if I can find something else. Regards","Ok, so the change is variable. I'll keep thinking about it, if I can find something else. Regards Nope. Solution didn't help. Above all else a tried to change time server to time.euro.apple.comDidn't help.Clock still runs ahead 2-3 seconds\/day."]},{"symptom":"Cant upgrade to Windows 10 V1909        I'm trying to upgrade to Windows 10V 1909 but keep getting an error message _P0_VMware Workstation Pro (No-Op) is not compatible with Windows 10 and needs to be removed.I've removed all copies of VMWare on the PC and tried searching for this particular file but can't find it. Any advice as to what to try next please.ThanksDr Phil","solutions":["Hi Dr Phil, I'm an independent advisor and hope this will help in your issue. You might have an installation of VMWare Workstation Pro that's not removed completely. Will you be able to try \"Manually cleaning a Windows system\" from the following article?https:\/\/kb.vmware.com\/s\/article\/1308Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let me know if I can help you further!","How can I upgrade from windows 8.1 to 10","Hi Dr Phil, I'm an independent advisor and hope this will help in your issue. You might have an installation of VMWare Workstation Pro that's not removed completely. Will you be able to try \"Manually cleaning a Windows system\" from the following article?https:\/\/kb.vmware.com\/s\/article\/1308Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let me know if I can help you further! Hi,Thank you for your assistance. I went through all the settings as per the article but unfortunately have exactly the same issue when I try and update.  Any other suggestions would be appreciated.RegardsPhil...","I am having the same issue.  I don't even use VMWare Workstation Pro, Player, or any other VMWare product.  I might have played with it years ago, but certainly not recently and I havent had any Windows 10 update problems until recently.I do not have any VMWare products in my Add\/Remove Programs, and I've even tried searching regedit for any references to vmware and manually removing them, but I still get this error.  I have not been able to update Windows since about mid December.  Does anyone have any suggestions?-Mike","same problem plagued my win10 system (it had originally been upgrded from win7 years ago), i had no instances of VMWare player in my add\/remove programs, it failed for months and i just kept putting it off since i couldnt find the stupid \"__PO__ VMWare blahblahblah\" app anywhere, but finally bit the bulle,what i tried was:find the vmware app by browsing to the executable, it may be in eitherC:\\Program Files\\VMware\\C:\\Program Files (x86)\\VMware\\launch it and it will ask to upgrade (or just go to vmware site and download an installer), so i did that thinking it will fix whatever incompatibility is and ill have both, but after installing the latest version it still gave same exact error, so i went to uninstall it, and at least now it had an entry in the add\/remove programs widget. i happened to use an app i had \"IOBIT uninstaller' since it cleans up extra junk, but that is probably not necessary just use the original windows uninstaller, i think its just a problem due to the VMware registry entries were mangled or overwritten by some earlier system update so windows couldnt uninstall it (and who knows what other quirks like this are lurking deep in the system now this may be the tip of an iceberg), since even though windows found it and couldnt tell you where it was, but hey thats windows for ya","https:\/\/www.microsoft.com\/en-us\/software-download\/windows10","Hi atomoid,Thanks for the suggestion.  I had tried installing a fresh copy and removing in the past but it did not fix the issue.Do you remember which version of the installer you used please?ThanksDr Phil"]},{"symptom":"Multiple BSOD Errors on Windows 10 Version 1909        Hi everyone, I recently bought and built a new custom PC and ever since I installed windows 10 (v. 1909 as the base installation) I keep getting different blue screen errors such as \"memory management\", \"System Service Exception\", \"IRQL Not Less Or Equal\", \"Page Fault In Nonpaged Area\". I have updated windows and gone through all of my drivers and updated them. I ran memory diagnostics, system file checker, anti-virus scans. I've switch out RAM sticks and changed from using a wifi card to ethernet. It will generally crash 3 times in one day then for a couple of days it wont crash, repeating the process. I have also check temperatures of the CPU and GPU and they are well below 60 degrees at any given time. I play games on the computer but the GPU isn't being overloaded and neither is the CPU. If anyone has any solutions\/suggestions please let me know. Thanks.My Specs:CPU: Intel i5 - 9400f (2.9Ghz, running it at 3.5 still had the same issue regardless the frequency)GPU: Gigabyte gtx 1650 4gb RAM: Hyper X 2 x 8gb PSU: 600W Thermaltake Power SupplyHDD: WD Blue 1TBSSD: 120GB SanDiskMotherboard: Gigabyte Gaming X","solutions":["Hi,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.We need log files(called dump files) that tell us what lead to crash.Please share them with us for a better analysis of the problem. Instructions can be found here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Please let us know if you need any assistance about posting dump files.","Hi,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.We need log files(called dump files) that tell us what lead to crash.Please share them with us for a better analysis of the problem. Instructions can be found here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Please let us know if you need any assistance about posting dump files. Here are the log files.https:\/\/1drv.ms\/u\/s!AjLnenSaUF_Nhg2KJ31v0Hi9JcID?e=P5A3Fp","Hi Patrick, I saw multiple causes of the crashes ranging from Battleye Service to memory corruption.Looks like a Memory test is required. I suggest you to Run memory test for at least 8 passes, preferably Overnight. https:\/\/www.tenforums.com\/tutorials\/14201-memte...When the test completes post back the Image(You can use your phone's camera). Disclaimer: There are links to non-Microsoft websites which would provide accurate and safe information. Watch out for ads on the sites which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","Thanks Sumit. I've ran the test as adviced, the results are shown below.","Thank you, indeed memory is okay. The next step, Let us try finding any misbehaving driver Enable Driver Verifier: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...(Must create a Restore point before) Upload the newer dumps when you get Driver_Verifier_detected_voilation. Please note that the system might crash before you reach the desktop-if it does please let us know so that we can guide you to disable Verifier.","Hi Sumit, I ran driver verifier as requested but the system wouldn't crash. However, the system crash today roughly 5 minutes ago and the windows BSOD blue screen said that \"nvlddmkm.sys\" failed with the stop code being \"PAGE FAULT IN NONPAGED AREA\". I am currently running driver verifier incase it crashes again and it is infact a driver issue.","Yes, I look forward to a crash dump by the verifier. You should also update Nvidia driver in the meantime if any update is available.","Hi Sumit, I got the PC to crash whilst driver verifier was running, however, I didn't see \"Driver_Verifier_detected_violation\" or a system file that could have caused the crash.The newest dump files are located here: https:\/\/1drv.ms\/u\/s!AjLnenSaUF_NhhSi46Vm6wFVVSb6?e=DuV1MCMy apologies for the delay and I thank you for your patience."]}]}