{"windows":[{"symptom":"How to update from W10 1803 to something more current, but less than 1909?        My system runs W10 1803. Windows Update has been trying to install 1909 very 3-5 days for months. Fails every time.Is there a way that I can try to install W10 1809 or 1903 to see if that works. I cannot find an option on Update Assistant.Thank you.","solutions":["Hi JJ The Microsoft website will only give you the option to go to the latest version (1909)Click the safe link below, from that page you can download any version (1809, 1903 . . etc.) of the Windows 10 ISO's and those come straight from the Microsoft Servershttps:\/\/tb.rg-adguard.net\/public.phpWhen the ISO file completes downloading Disconnect from the Internet Temporarily disable any 3rd party Anti-virus you may have installed Then, in Windows File Explorer, double click the ISO and then run Setup.exe to begin the upgrade . . .________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]},{"symptom":"out of focusphoto's        Can anyone help I'm  trying to take a photo of a receipt of a bill on my surface but it keeps coming out of focus. My camera settings are2.1mp 16.9  (1920x1080) I would be very grateful for any advice.many thanks,Paddy H","solutions":["Hi Paddy Ideally this should be done with a scanner . .. If you do not have a scanner, it is hard to get a document in focus with just a photo . ..Open the Camera App (click your Start Button, then just type camera and hit Enter)Switch from Photo to video Have that receipt ready Hit Enter to begin recording Then hold the receipt so it is centered on the video a bit further away so it is out of focusSlowly move the receipt towards the camera Then stop the recording Play back the recording and when the receipt is in focus, pause the video Then press the Windows Key + Prn Scr to take a screenshot That photo will end up in the screenshots folder in your Pictures folder . . .","thank you daveM121I will try this out tomorrow and let you know how I get on."]},{"symptom":"Service Host applications EATING up Memory        Hey,I have exactly the same problem with this person *, only his solution does not work for me. I tried a lot of other things and it just seems to get worse. It has now been 4-5 days since it has started. It seemed to start when I was connecting xbox with my computes to be able to play minecraft with friends (crossplay) after playing I got a black screen and many of my open app and my screen fell out. since then I have been very careful before my computer crashed.* https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/service-host-applications-eating-up-memory\/1182c7e9-64ff-41ca-bd2b-ecfdfe1d2b7b","solutions":["Hi Zippy, You might want to improve the performance of your PC. Try to disconnect your Xbox first and make sure these steps are done: https:\/\/www.windowscentral.com\/15-tips-increase...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Hey Richard,The steps are done but i didn't work. Servicehost is still taking over my RAMVideo what is going on:https:\/\/www.youtube.com\/watch?v=QL0ciwRz0dI&feature=youtu.beWhat you can see is that the Servicehost is only going up.Edit:just few minutes later: Servicehost Eating so much RAM","Hi Zippy, I noticed you have 9 tabs of Chrome on your end. That answers the question. Chrome uses different services per tab and that actually one of the cons of using this browser.Try to lessen Chrome Tabs that you are using and see the difference. Other users also experience this issue especially with Google Chrome that it eats a lot of RAM leaving you nothing for other services.Hope this clarifies your concern. Thanks and regards,","Hey RichardWhen everything is closes. Will it go up to 50% of my RAM (7,9gb\/15,9gb)Also if i play a game longer than 2 hours is my game crascing for being out of memory. (Only my big games: GTA 5, TERA, csgo,...)","Hi Zippy, What I can suggest is to do cleanboot and do not run Chrome while you're on gaming.I guess your RAM isn't enough for this processes. Please specify your specs as well. Thanks and regards,","Hey Richard,This are the specs. my pc is now 4 mounths old.","Hi ZippyBox1019 2 things you should consider doing . . . 1 You should run a scan with the free version of MalwareBytes to see if malware has been attaches to SvcHosthttps:\/\/www.malwarebytes.com\/2 Update all your device drivers from the support page for you PC on the manufacturers website, those will be more compatible than the versions installed by Windows 10 updates________________________________________________________ Standard Disclaimer This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Time stamp on video's in pictures folder        Can anyone tell me how to change the date on a video in pictures?  When I downloaded some videos and pictures it downloaded the wrong date.  I know how to change the date on the pictures, but not on the video.  I am using windows 7.  HELP.","solutions":[]},{"symptom":"Can't unlock personal vault        I have two PC, one desktop and one laptop both logged in with the same Microsoft account. I've installed Personal Vault on one of the machines (the laptop) but not without difficulty as the install package, that stated it was installing OneDrive for the first time (when it's been in use for some time) and failed though it hadn't. The Desktop is a different matter. This consistently brings up a dialog box stating \"We couldn't unlock you Personal Vault. Something went wrong. Please try again.\" and the error code 0x80070015. It then leaves a shortcut in Onedrive that, if clicked, just goes through the above loop. The installation sends me an Approve sign-in request to Authenticator, but it's always the same ID number I've run SFC \/scannow and DISM checkhealth and restorehealth neither of which makes any difference.Any suggestions as to how to get this working? R","solutions":["I don't know if anything here will helphttps:\/\/www.microsoft.com\/en-us\/microsoft-365\/blog\/2019\/06\/25\/onedrive-personal-vault-added-security-onedrive-additional-storage\/looking at the editors note I wonder if that may be affecting you.Post has been updated to reflect that Personal Vault started rolling out in all regions worldwide on September 6, 2019, and is expected to be available to everyone in October 2019.","Personal vault is working for me on my iPhone app, and online.  However, i cant unlock the vault on my desktop.  it get to the point where it says OneDrive is not responding and stays stuck there.  Which, renders this app useless because if i have items in the vault and desktop is NOT unlocked i cant access those files from my phone, which is usually where I'm in need.So, how to fix?","It works fine on my Surface Pro, but not on my Desktop. ","Hello Rob Philips - Legge,Unlock your Personal Vaulthttps:\/\/support.office.com\/en-us\/article\/Protect-your-OneDrive-files-in-Personal-Vault-6540ef37-e9bf-4121-a773-56f98dce78c4For security, your Personal Vault automatically locks when you're not actively using it.On the web, Personal Vault locks after 20 minutes when you're not actively using it.In the mobile app, it locks after 3 minutes. Here's how to unlock it.In your OneDrive, select the Personal Vault folder.Verify your identity by choosing a verification method. For example, select Text and follow the instructions to send yourself a text message on your phone.If you're using text or email, you'll need to find the text or email message that you were sentand type in the code that you were sent.You can unlock Personal Vault with the Microsoft Authenticator app. Click the link on the website for the app.The app doesn't need Internet access to generate an access code.Best regards,Jacquito.","Unfortunately that doesn't help one bit. As I explained, it's not about unlocking the vault, it's about setting it up in the first place. I've had failures with two different error codes, both of claim to be fixable by running SFC and DISM. Unfortunately that doesn't happen. ","Hello Rob,In your problem tekst you stated very clearly : Cant Unlock Personal VaultOn the website the article is explaing how to set it up.you also do the following things.1) Open administrative command prompt and type or copy and paste:2) sfc \/scannow3) dism \/online \/cleanup-image \/restorehealth4) chkdsk \/scan5) systeminfo.exe6) When these have completed > right click on the top bar or title bar of the administrative command prompt box > left click onedit then select all > right click on the top bar again > left click on edit then copy > paste into the thread7) List the antivirus software products currently installed (always on and manual)and list the antivirus software products used in that past 6 months.Best regards,Jacquito.","I have same problem.  The Vault is opening perfectly on two desktops and iPhone but not on another desktop.  It gets to UNLOCK PERSONAL VAULT.  I verify (by any and all offered means of Text, e-mail and MS Authentication App) and the screen just sits there for hours  and does nothing to set it up.  Ran sfc and chkdsk and no errors.","Same issue here guys, wondering if anyone has made any progress on this?","I sort of gave up on this as I was having enough trouble trying to get an Ubuntu server up and running with LAMP and Laravel. I eventually got that running on a copy of VMware on my desktop, which meant I had to remove Hyper-V along with Windows Defender Device Guard and Windows Defender Credentials Guard. Once I was happy with that there I moved the instance to my Mac Mini under VMWare Fusion. Then I removed VMware, reinstalled the two Guards mentioned above, but left Hyper-V off because it plays merry hell with my PCs networking.Then I tried to use the Vault once more. Again I got failure messages but when I clicked the link that's always created there was a bit of a delay but then a message came up asking me to authenticate the attempt. Well that's happened before as well so I wasn't holding my breath. Then I got a surprise. The Vault actually opened, despite all the error messages and dire warnings of failure, it had actually worked!I've no idea if the Guards mentioned had any effect, but seriously what I did above was all that had occurred","Hello Wooferinc,https:\/\/www.groovypost.com\/howto\/protect-files-in-onedrive-using-2fa-with-personal-vault\/Maybe this can give you an idea.Best Regards,Jacquito."]},{"symptom":"File Explorer not working        Selecting 'File Explorer' gives message 'working on it', then blank screen and reversion to desktop. I have followed Greg Carmack's advice, but after selecting 'Task Manager', again there is a blank screen and back to desktop. I have just updated Windows but with no effect.","solutions":["Hi Marsh Try these steps: 1. Press Windows key + E 2. if not open press windows R and at the run box type explorer.exe 3. if still not open Press Windows R and type below and clear the files. %appdata%\\microsoft\\windows\\Recent\\AutomaticDestinations 4. Hold down the Left shift key, right-click on the File Explorer Icon, and select PropertiesSelect the Shortcut Tab at the top Change the contents of the Run drop-down from \"Normal Window\" to \"Maximized\"","Jegan - Thank you very much for your reply. Your suggestions do bring up the explorer box, but I can do that with the explorer icon or from the windows menu. The problem is that after selecting any file or folder from it, there is a message saying 'working on it', then the screen reverts to the desktop. Where should I enter the wording at your item 3, please?","Can stop indexing and try? Go to this PC - right click c drive - properties- under general section uncheck allow files on this drive to have indexedAlso Under the customise section under What kind of folder do you want?, click on the drop down to Optimize this folder for, and select General Items.","Jegan - Thank you for your reply. When I have found out how to  'go to this PC',  I will try to follow your advice.John","In File Explorer, assuming you have the Navigation Pane displayed, you will findThis PC in the folder list:","Suzanne and Jegan - Thank you both for your replies, which I have been able to action. However, the problem is not getting to File Explorer. Having opened it, any file or folder selected comes up with 'Working on it....', and after about a minute, there is a blank screen and we go back to the desktop. So finding any required file on the PC then becomes hard work!John","Is the computer connected to a network (for example, a corporate network)?","Stefan - Thank you very much for your reply. No, there is no network. It is a simple HP desk-top computer, of 2016, running on Windows 10, up-to-date, and using Office 365 Home.  Microsoft takes its annual fee from me for this.John","Thanks for the follow-up.Hopefully the Windows experts here will be able to sort it out.","Hello,Suggest you to run System File Checker scan:1. Search for 'command prompt' using Cortana or Windows Search.2. From results, right click on Command Prompt and select Run as administrator.3. Type sfc \/scannow command and press Enter key.4. Let the command complete and then reboot the machine.If issue still persists, perform clean boot:https:\/\/support.microsoft.com\/en-in\/help\/929135\/how-to-perform-a-clean-boot-in-windowsLet us know if this helps!"]},{"symptom":"new computer        I bought a 3rd computer. My Microsoft account manager will not let me use the email address and phone number that I use for my other computers. I want them all to be the same.Can someone assist?Thanks","solutions":["Hi. I'm sorry to hear that you're having trouble. I'm an Independent Adviser and I'm here to help!Could you tell me what happens when you try to use the email and phone number?","It tells me the email address and phone are already being used. Which, that is correct because they are being used for my other 2 computers. I was hoping I could have all 3 computers under one account, however, that appear to be the case.Finally, I was able to change the phone number so messages and notifications will come into the correct phone.Thank you so much for your response."]},{"symptom":"Locked Out of my Profile        So, ever since updating my computer to Windows 10, it has locked my profile. Every time I restart it, it says that a temporary profile has been set up for me and automatically logs me in. I have tried editing the registry, I have tried different things under Account settings and all to no avail. It won’t let me log in. Can anyone help?","solutions":["Hello Mike,You might see if the method in the tutorial below may be able to help fix your temp profile if it's not the same as you have already tried.https:\/\/www.tenforums.com\/tutorials\/48012-fix-youve-been-signed-temporary-profile-windows-10-a.htmlIf it is and\/or still doesn't help, then you could use option 2 in the tutorial below to have a new profile created for the account, and copy over any files you wanted from the old profile folder to the new afterwards.https:\/\/www.tenforums.com\/tutorials\/145678-fix-user-profile-service-failed-sign-error-windows-10-a.html#option2","Hi S Before you do anything else Restart (not shut down) your PC 4 times, each time let your PC get to the Desktop of that Temporary profile, before the next restart, this will fix this issue a lot of the time . .."]},{"symptom":"Both my Rode NT-USB and Podcaster are not recognised by Windows 10        Nothing wrong with the hardware. I can use them in other operating systems without any issues.All my usb ports are 3.0Windows 10 Pro, version 1909, OS build 18363.535I'll appreciate any help with this.","solutions":[]},{"symptom":"Windows 10 and Microsoft 365        I had someone upgrade from Windows 8 to Windows 10.  This was after I paid for the subscription for Microsoft 365 and installed it.  Now, there seems to be no Microsoft 365.   What do I do?","solutions":["Hi El Click your Start Button, then just type word Does Microsoft Word appear in the resulting list? If so, right click that and choose 'Pin to Start' that will put a new Tile on your Start Menu for easy access to WordDo that for each of the other Office applications (Excel, PowerPoint . . .etc.) If Word does not appear in that list, go to http:\/\/www.office.com and if you're not already signed in, select Sign in On that page, locate your Office 365 subscription and then click 'Install' to re-install Office on your PC . . ."]},{"symptom":"Task View screen        I have items on my Task View screen which I can't remove.  I can remove current but these items are from December.Please help","solutions":["Hello JoJo_727, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemYou can access Setting from start menu, then go to Privacy > Activity history, scroll down to the end you'll see clear activity history, which will clear all.Let me know if it's help. and feel free to ask any questions :) Cheers! Farah","No, this did not help.  I did try it earlier.  When I clicked on clear activity, nothing happensJoJo","Hello Jojo, have you tried deleting the activity cache? - Open task manager and go to services. - Search for a service called CPDUserSvc_7059ce and stop it - Go to this path C:\\Users\\%profile name%\\AppData\\Local\\ConnectedDevicesPlatform\\Replace profile name with your username - You will find a folder with a generic name, something like bdegjfghdf11840d delete all content and then restart your Windows, this should clear the task view list for you.Please let me know how it goes","this did not work.  I have 3 CPDusersSVC listed nothing with the 7059ce.  I have turned the timeline off.Thanks for your help","no worries"]},{"symptom":"Create pop-up when computer hasn't connected to domain recently        I'm looking for a way to create a pop-up message on Windows 10 that will appear when a remote users' computer hasn't connected back to the domain in X number of days.  I'm not wanting to force the connection, just remind the user to VPN back to home base so the computer can pull GP updates and such.I didn't see anything in GP or in Task Scheduler.  Is there an effective way to accomplish this?Thank you","solutions":["I would check the Event Viewer (eventvwr.msc) for logon events pertaining to a given user.","This question seems out of scope for these consumer level forums. I think you'll get better responses by asking other IT pros on Technet. Start here:https:\/\/social.technet.microsoft.com\/forums\/en-...","Okay, thank you so much!","Okay, thank you so much! Did you consider my suggestion?","Yes, but the logs only appear to notate that the computer was connected to a network and I would need the trigger to be attached to a specific network.Thank you for the suggestion."]},{"symptom":"Rename virtual desktop        Hello I can't rename my virtual desktops. I am using:Windows 10 Home Version 1903OS build 18362.175Any help will be appreciated.Thank you","solutions":["Hi BND_ this feature is coming, unfortunately it wont be available in 1909 (i think) but looks likely to be included with the spring 2020.","Thank you for your reply. Do you know any workaround? Funny thing, I was using virtual-desktop-enhancer in the previous windows version to rename desktops and everything was working very well. Now with this new update, it doesn't work anymore and the tool development seems to have stopped. The plus now is that I can paste using keyboard shortcut in wsl.","I am afraid, i don't know of a workaround, other than the tool you have said doesn't work anymore.the only other option i have found is virtuawin https:\/\/sourceforge.net\/projects\/virtuawin\/a portable program so doesn't need installing. i don't have any personal experience of it so cannot say that it will do the job as desired.Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thank you though. A partial solution I have found is to put a small notepad file saved with a name to remember which desktop. So there is simple notepad document for each desktop.The notepad document is then displayed always on top: https:\/\/www.groovypost.com\/howto\/howto\/windows-programs-always-on-top\/","This is a really lame problem.  Lots of google results tell you that you can rename virtual desktops and tell you how to.  My guess is that they saw this info in the previews and copy-pasted the information before confirming that the feature went live.","I was wondering about this as well and I got this from a searchsince 18963 is was availablehttps:\/\/www.tenforums.com\/tutorials\/138723-rename-virtual-desktops-windows-10-a.htmlI have the same problem I am running 1903 and it does not work. "]},{"symptom":"Let Windows Manage my Default Printer not working        We have several Surface Laptop 2's with Win 10 Enterprise installed. On all of them, the \"Let Windows Manage my Default Printer\" option in Settings does not work. You can check the box but Windows will not change the default printer as it should. Same image is on all of our desktop computers but problem only exist on the Surface Laptops.","solutions":["In general, I \"let Windows manage\" as little as possible, and I recommend the same to you. I prefer to manage my computer to the fullest extent possible.","Unfortunately This setting is required in our environment.","Unfortunately This setting is required in our environment. In that case, I can't help you. Sorry about that. In most managed environments, printers are controlled by the IT team\/department\/function.","Hi srbarth, My name is Riccardo and I will be happy to assist... Is this may be disabled in the GPO? https:\/\/www.nextofwindows.com\/windows-10-tip-ho...See above and go to the GPO and see if this is possibly causing the issue. DISCLAIMER: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Riccardo,I have checked out the GPO setting and that is not the cause. Do you know of any registry settings that might be involved?Steve"]},{"symptom":"Has there been a fix\/patch for Windows 10 Location Services since 2017?        I having a major problem with my geolocation services. I noticed a ton of forums on here of people with SIMILAR but not quite the same issues, and most of them are from 2017 or earlier without a solution ever figured out, at least on a publicly viewable one. The basics: When I log onto my Wifi at home, after a period of time (sometimes minutes, sometimes days) my device starts reading my location at a very particular spot in Colorado Springs, CO. I live in Pennsylvania, maybe an hour east of Pittsburgh PA. I'd rather not mention my exact address for security reasons, but I'm on the other side of the country from Colorado. I've had Geek Squad look at this, several IT guys I know, and they are all stumped. It has been going on for several months now, and I've done literally dozens of hours of my own research with no resolution. I'm not a computer whiz by any measure, but here are the details of what I've discovered: I have a Lenovo Yoga 910. OS is Windows 10 version 1903, fully updated. Intel 7th gen processor. My network adaptor is Qualcomm Atheros. My ISP at home is Xfinity by Comcast. I also hotspot of my phone often. It is a Samsung Galaxy 10, Android, ATT&T service. So I log onto my Wifi, and like I said, at first all is fine, but over a varying period of time the clock moves to Mountain Time, Weather is wrong, Maps is wrong, News is wrong, Cortana is wrong. My location moves from PA to the exact same spot off Sunset Creek Apartments in Colorado Springs, CO. Microsoft apps are the first to go, but eventually Google Maps and things like that will also show the same. Sometimes after a while, it will correct itself for a time, and I'll be back where I should be, sometimes it sticks for days, sometimes it will \"flicker\" back and forth.  I log onto my Wifi at work, location is fine, Wifi at parents house, all is fine, friends house Wifi, all is fine. Now here's where it gets weird. It almost acts like a virus (although it isn't and I'll explain how I know later). It will \"infect\" my phone so to speak. Before this occurs (and once it happens, it sticks) if I use my hotspot while I'm out and about it will either give me a reasonably good location, pending other Wifi signals around, or it will at least default to my Default Location. Once this \"infection\" takes place, I'll also be stuck in Colorado Springs over my hotspot.  Yet, if I connect to a friend's hotspot on their phone, the location is fine, or at least defaulted correctly. Also, the location on my phone is correct if I open Google Maps, or a Samsung weather app or something. (I do realize my phone is using GPS and my computer is using IP addresses, just mentioning it) To save time with the basic, canned, troubleshooting stuff: I know ALL about Location Settings>Default Location. I've cleared every cache imaginable, cleared locations, both on the device and on my Microsoft account, clear Google caches of every kind including locations. Not only have I factory reset the modem, the computer, and the phone, but I've have Geek Squad completely remove the pre-installed Windows OS and pull a completely different copy off the self to install. They called it giving my computer a \"lobotomy\" haha. I also had Xfinity install an entirely NEW modem\/router. All these resets have been done at least 7-8 while conducting various \"experiments\" and always the same result. Sooner or later (always within about 10 days) my computer puts me back on the other side of the country in the exact same spot. Sunset Creek Apartments, Colorado Springs. Not far from Pikes Peak Academy, there's a Trader Joes down the road, lol. Doesn't look like a bad place to live, but unfortunately over a thousand miles from my house. And even if it stops doing that on my home Wifi (for a brief period) if I'm 20 miles away on my hotspot it'll still take me to that spot in Colorado. This occurs even if I've been on a different Wifi with the correct location in between those two events. Like it's a \"bug\" that locks me there over my home Wifi and my phone hotspot, despite default location. I read that the large September Windows update was causing errors in network adaptors. I uninstalled all updates, and changed a registry key to prevent reinstallation of the updates (or in some cases, factory reset ALL mentioned devices and applied that registry hack BEFORE they even installed). No dice, back in Colorado after awhile. In command prompt, we've tried ip\/config ip\/renew, a bunch of stuff like that. Pretty much, if you search it on the internet, myself or a paid technician has tried it. Venturing into the more bizarre, while pouring through these forums and videos, I found THIS video: https:\/\/www.youtube.com\/watch?v=pydSrUFs2Sk. This is basically a video showing some features and stuff of Windows Maps, but the location you see on his screen is almost EXACTLY where this thing is putting me. He looks to be just a hair farther north. The particular location it locks me is just a little south of what is shown on his screen, just below the \"Pulpits Rock\" area. Now that can't be a coincidence, of all the places in the USA. Up until recently, this issue only appeared on the Lenovo device I described above, but again getting even weirder, it recently started doing in on my work computer was well. It is an HP, also with same specs of Windows 10, and all other symptomns are the same. The \"bug\" comes and goes on my Wifi and locks in over my phone hotspot, but just MY phone. Also, my work computer is totally different Microsoft account. Again, when I'm using this hotspot, I'm MILES from my Wifi. Also, I've shut off my modem at times once this \"bug\" takes hold, and in the vicinity of my home, just picking up my neighbor's Wifi it'll still throw me in Colorado. Like I said, acts almost like a virus, but these devices are WIPED, as if they were straight out of the box when this is occuring, my modem included. Sorry to write a novel in here, but I figured I'd save everyone the time of the \"have you tried shutting it off and turning it back on?\" type of responses. Yeah, we tried that, haha. It there a MASTER location default or something like that buried deep in Windows and for some reason it's going to that instead of the Default Location I set? It there an upgrade for the Wifi hardware? Surely TWO separate computers wouldn't BOTH need it? I understand the limitations of geolocation based on signal, and I don't need turn by turn directions over my tablet, but  the right time zone is a fairly reasonable request. I use Cortana for a ton of stuff, so aside from basic internet surfing, it makes portions of my computer useless. I also recently tried a little third party app someone had mentioned in one of these forums called \"FixMyLocation\". No dice. If anyone has a clue what is going on I would be GREATLY GREATLY appreciated. I've getting desparate. I'm even mulling around just buying a new computer, but I re-thought that when it started happening on my work laptop. All signs point to a brand new computer just doing the same thing. I would look into a different internet company, but if I shut off my Wifi once the problem seats, it happens just off the faint signal of neighbor's. I can't make them change internet providers, plus why does it stick on my phone?. Very desparate. Any help is appreciated. Thank you.","solutions":["Unless your PC has a GPS radio in it, your location will be whatever the ISP wants it to be, including another city or even state. Your phone's correct because it has GPS in it.","Unless your PC has a GPS radio in it, your location will be whatever the ISP wants it to be, including another city or even state. Your phone's correct because it has GPS in it.Any other computer that connects to my Wifi though has a perfectly fine location. I've have computers with Windows 8, Windows 7, Windows XP hooked up to it with no problem. And MY two computers are fine on any other Wifi. Surely there's not a vortex around my house putting only Windows 10 machines two time zones over. I know it goes off IP address, and at times they aren't the most reliable, but the Comcast tech was kindly out several times, installed an entire new modem just to be safe and any device we connected to it was reasonably close. I even spent a lot of time going to websites like whatsmyipaddress.com and similar. On other devices, the absolute WORST coordinates I'll receive are Pittsburgh, which makes sense because that is the \"hub\" for Xfinity in our area, so everything is going there first and then off to the world wide web. Most of the time, the coordinates were within a few miles or spot on (there are several other Wifi signals in the neighborhood to help geolocate) But those two machines, after this bug hits, will show coordinates in Colorado. "]},{"symptom":"Problem: I can't direct debit my 200 GB of extra OneDrive storage for $1.99 per month from my most-used checking account (January 7th, 2020)        I went back to having 1,254 GB of OneDrive yesterday, which I really missed until Microsoft finally brought it back for all Office 365 subscribers on June 25th, 2019, I think. I can use any one of my credit or debit cards to pay $1.99 per month for the extra 200 GB just fine, but I'd prefer to direct debit that out of my most-used checking account since all credit and debit cards have expiration dates. Also, why can't I manage this subscription under \"Services and Subscriptions\" on the top of the webpage on account.microsoft.com like I can my Xbox Game Pass Ultimate and Office 365 Personal subscriptions?","solutions":[]},{"symptom":"I've bought a Windows 10 Pro key, I dont know if its fake.        I've bought a Windows 10 Pro key, I don't know if its fake. the seller told me that it was retail but As it turns out that the key is \"MAK VOLUME\" channel type. I don't know if this key is legit or not.Is there any way that I can be assured that this is safe?I can't call Microsoft as the customer care number is saying \"not existed\".What should I do???? Please Help!!","solutions":["Hi Arindam That is in relation to how many times your current activation on that PC will rearm . . .All volume licences have a re-arm count, don't worry, that will not run out, since Windows rill rearm the licence once a month, so 1001 months is a long time . . .The only difficulty comes when re-installing Windows 10, if you paid the full price for a Windows 10 Pro licence key, then you should get on to the seller and demand a full retail licence, so you may install that on another PC in the future . . ."]},{"symptom":"Automatically Logs Me in as Administrator        So 2 years ago I upgraded to Windows 10, and it immediately would not allow me to log into my account. It said my account is securely locked and a temporary profile has been set up for you.Fast forward 2 years (stopped using computer and just used my table) and I am trying to use my computer again, however this time it just logs me in as Administrator automatically. It doesn’t give me the option to select my local profile.how do I unlock my profile and sign in and stop it from automatically signing in to Administrator?Thanks,Mike","solutions":["Hi Mike. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Guardian Moderator here to help you.If it logged you into a Temporary profile that means your User account was too corrupted to start, so it created a Temporary one. You cannot use this Temp account permanently but only to try to repair or rescue your files and then do a Reset, or I can help you create a new account to move into. Often times restarting the PC a few times will also start into the User account.Is it still starting into the Temporary account, if so we can proceed with one of the above?You said it's logging into an Admin account. But if you're the owner of the PC then you should already be the Administrator of your own PC.Go to C:\\Users to see if you see your old account there, immediately copy out your files if you have not yet. Then restart the PC a few times to see if it can start. Does it tell you its starting into a Temporary Account instead?Based on your responses to the above questions and procedure, I will know how to guide you best. I handle thousands of these cases because unfortunately Account Corruption is epidemic in Windows 10. The only thing that seems to help is having a better install. This is the reason no tech enthusiast will even run a factory or Upgrade install because they'd expect endless issues like this. I can help you with that too.Standing by here for your reply.","Thank you so much for your quick reply!It does not tell me its creating a temporary profile anymore. It is simply automatically logging me into a the “Administrator Account” My profile still shows there ,but it does not give me the option to select the account to log into when restarting the compouter - and to be honest, at this point, I am unsure if I remember the exact password to my account.Thank you for the help! ","Well I somehow fanagled it and it allowed me to actually choose an account to sign in at the screen. I signed in, and it gives me this error message. It keeps giving me this error message saying I have signed in with a temporary account, can’t access files, created documents will be deleted, etcAny suggestions?"]},{"symptom":"After Windows 10 rebooted my system, it removed all my applications. Now, Office 2010 won't reinstall.        On December 30, 2019, a blue screen announced that Windows 10 was fixing problems. It deleted all my programs, all my email, all my address books, and all my links.. I tried to reinstall Microsoft Office Home and Students 2010 but I was told my key was invalid. I purchased the software from Amazon Japan on April 21,  2012 and have the CDs, product keys, and the receipt from Amazon. The product key worked perfectly in 2012. I am using exactly the same computer, with exactly the same hardware, exactly the same OS, from exactly the same location in Japan. But the product key which worked flawlessly eight years ago is now said to be invalid. Do you really think Amazon should give me a refund? Or should Microsoft provide me with a product key that works?","solutions":["HI Steve. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See fixes for Office 2010 invalid Product Key: https:\/\/answers.microsoft.com\/en-us\/msoffice\/fo...https:\/\/answers.microsoft.com\/en-us\/msoffice\/fo...https:\/\/support.microsoft.com\/en-us\/help\/10051\/...https:\/\/support.office.com\/en-us\/article\/get-he...https:\/\/answers.microsoft.com\/en-us\/office\/foru...One of those should do it. I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","In an earlier exchange with a Microsoft Support agent, “Himangi” he checked my Product key and concluded that:\"I can see an error which is occurring because the country from which the key has been purchased is different from the country the key has been redeemed.\"However, I purchased Office Home and Student 2010 on April 21, 2012 from Amazon, Japan for 10,500 Japanese yen. I have a receipt from Amazon Japan (in Japanese), and I installed the software successfully using that product key on my computer in Japan nearly eight years ago.Do you think Amazon Japan was scamming me and owes me a refund?","Are you still in Japan? Amazon is pretty good with making things right. But eight years is too long. I would contact Microsoft Support by one of these phone numbers: https:\/\/support.microsoft.com\/en-us\/help\/405170...You can also go here: https:\/\/partner.support.services.microsoft.com\/... choose the link for Browser help, interact briefly about your exact problem, keep replying agent until it connects with an agent.This time ask for a manager and explain that you have the receipt, are only trying to reinstall your paid Office license. Let them know you are being helped by an MVP in Microsoft Community Forums where we are waiting to hear that you are able to use your paid and valid license. It is not your fault that there is some anomally with how it detects your purchase and redemption in different countries, but you can prove these are both one and the same.","Perhaps eight years ago there weren't rules about a store buying software in one country and selling it in another.For future reference, does this mean I shouldn't buy English language software in the US and expect it to work in Japan?","I would ask Customer Service this question. You can contact them directly via phone in your country here:https:\/\/support.microsoft.com\/en-us\/help\/405170..."]},{"symptom":"Folder not showing in file explorer but can be located by manually entering address??        I have a folder (Bioware) that is missing from file explorer view in My Documents folder, but it is still there if you manually enter the full address to the folder. I located it by doing a document search on one of the sub folders using the file explorer document search, but the main folder will not show in file explorer, nor can it be located using the file explorer document search. The only way I can access the folder, is to manually type in the folder address, or run a file explorer document search for one of it's sub folders.This is a new computer I just built 4 weeks ago, with a fresh windows installation on a new hard drive. All windows updates are present, and all drivers are updated.Any ideas?Windows 10 Home build 18363.535Gigabyte Aorus Ultra X570AMD Ryzen 3800X (stock clocks)Corsair H100i 280mm AIO32gb G-skill PC3600 DDR4 (2x16gb)1tb Samsung 970 Evo M.2 OS Drive1tb Samsung 860 Evo SSD My Documents folder drive (F:)2x3tb Seagate HDD in RAID 1Nvidia GeForce GTX 1080Ti","solutions":["Hi Ghostryderflyby_ID. I'm Reinald, an Independent advisor and a Windows user like you. Thank you for providing information on your issue, we are are happy to assist you.You can try the following solutions in fixing your file explorer search issue: 1. Restart your windows search service: a. Open run command by pressing Windows Key + R > Type services.msc and press enterb. Look for \"Windows Search\" > Right click on it and select properties. c. Check \"Start up type\" and make sure it's in automatic d. Stop then Start the service again > Click apply and OK e. Restart the computer 2. Run Search and Indexing Troubleshooter: a. Go to start > Search for \"Control Panel\" > and Select it b. In Control Panel Search (upper right) > Type \"troubleshooter\" > Select \"Troubleshooting\"c. In the left pane, select \"View All\" d. Look for \"Search and Indexing\" > Click it > Hit \"Next\" and just follow the screen prompt.e. Put a check mark in \"Files don't appear in search results\" I hope this helps. Let us know how it goes and don't hesitate to ask if you have further questions. I will do my best to to assist you until your issue is resolved.","I found the issue. On a hunch I went into File Explorer options, and turned on \"show hidden files\". Turns out my Bioware folder, along with about 50% of my documents folders, were all set as hidden. I have no idea why Windows deemed to hide them (because I did not), but I'm folder by folder, getting them unhidden and accessible again.","Probably has hidden and\/or sytem attributes set.Verify that Explorer view optons are set to both Show hidden items andnot Hide protected OS files:Then, in your Docuemts folder, add the Attributes column to yourDetail view to see what attributes are set for the folder:"]}]}