{"windows":[{"symptom":"IF I uninstall Internet Explorer, can I still use Windows 7?        I have a laptop that runs Windows 7.  I use it for photos and for watching dvds.  I know that in a few days, Windows 7 will not be supported. Is it possible to uninstall Internet Explorer so I can still use my Windows 7 laptop to view pictures and watch dvds?  I don't want to use it to access the Internet.Hope someone can answer me soon...THANKS!","solutions":["IE is integral to Windows 7.  You should not attempt to remove it.  Simply do not use it.  Chrome is by far the market leader in browsers with nearly 70% of computers on the web using it.  It is under active development and near state of the art.  IE has not been touched for years and holds way less than 10% of the market.You are not at risk by simply having IE installed.  Only when you actually use it.","So what you're saying is that I can leave Windows 7 alone and not be vulnerable?  I can still use my Windows 7 laptop without any issues?If that is true, then why has there been all this hubbub about hackers being able to access Windows 7 and do all kinds of nasty things to computers that use that operating system? Supposedly, on January 14th, all Windows 7 computers\/laptops will be vulnerable to hackers. I don't understand how having Google Chrome will change the fact that my laptops both run the Windows 7 operating system. Please explain further.  I'm confused! ","I am not surprised you are confused.  First, let me start by telling you that I am not a follower of the mainstream.  I was for decades, but have since changed.  Most of the other advisers in this forum and most of my colleagues will disagree with me, some vehemently.I would appreciate your reading my Profile which you can find by clicking on the CT icon.  I am a very knowledgeable expert with over 50 years of experience in the field.  I have been a contributor to thousands of questions in this forum for 10 years now.I look after 120 windows 7 client machines and have for many years.  I was one of those people who believed the sky would fall if I did not apply updates regularly.  About 5 years ago, Microsoft started using WU (Windows Update) for much more than what it had been for a few decades -- a security system.  At that same time (which coincides with the end of Windows 7 development), Microsoft fired its entire Quality Control staff that looked after WU's.  Ever since then WU has become almost a comedy of errors.  Actually bricking millions of machines.  A related fact is that Windows 10 by design allows no choice on WU.  It just does it when it dam well feels like it.At the beginning of 2015, Microsoft started using WU to push \"updates\" that would force its customers computers to become more useful to Microsoft.  Many, including me, resisted that because Windows 7's design allows you to decide what updates to use and when.  Then about 4 years ago, Microsoft changed the structure of WU's such that you in effect had little choice but take them all or none.  They called those WU's \"roll-ups\" That is when I started thinking, do I really need this and is it worth it.  I am not alone, Woody Leonhard is a world famous Windows Update expert and has a very popular blog.  He wrote about this.  He called the patchacopolipse.  You can read his blog at https:\/\/www.askwoody.com\/In October, 2016, I started using \"security only\" updates that were available on Microsoft servers to those who knew how to use them.  Then in June, 2017, they made a very unfortunate change.  The corrected an error in a Security only patch that was only correctable by using their \"roll-up\" updates.  That is when I stopped all Microsoft updates.I concluded that the risk of Microsoft turning my smoothly running Windows 7 machine into something that I would not ever consider purchasing was greater than the risk I would be taking by not applying updates.At this point, my 120 client Win7 machines have not had an update in 31 months.  That well over 3000 machine months.  There has not been a single instance of a problem.  Not one.  In fact they run beautifully day in day out.  I used to average about 6 client calls a day.  Today, my phone seldom rings at all.My client machines use Chrome exclusively and a top-end ANTI-Virus product.  Note well, that this product is not a so-called security product.  It is an Anti-virus only product.  I am not allowed in this forum to name a product.I also must point out that none of my clients are enterprises and I would never suggest my strategy for such an environment.  Chrome does not need Java, Adobe Reader, or Adobe Flash Player -- three of the most security problem prone applications on most computers.  i have uninstalled them.I have a very detailed process I follow to do this work.  You can read my posting on Woody's blog at:https:\/\/www.askwoody.com\/2019\/canadian-tech-how-to-rebuild-a-win7-system-with-minimal-snooping\/","Thanks for all the additional information and, especially, for your support in using Windows 7 which, I feel, is the best Windows system out there at this time.  (I LOVED Windows XP too as I'm not a computer expert and need things to be user-friendly.)I found a post online somewhere that explained how to disable the items that allow my Windows 7 laptops to connect to the Internet.  So, I've already followed those steps on one of the laptops and will do the same to the other one tomorrow.  At least that way, I can still use them to work with my pictures and to type letters and watch dvds.  I bought a laptop with Windows 10 and I absolutely HATE the system!  Too much garbage, as far as I'm concerned!  Apps for this and apps for that.  Icons all over the place and things that used to be easily found are now hidden deeply and it takes many steps to get to them.  STUPID!  Took me a whole day to get the thing set up the way I'm used to.  Had to find a free media program.  And, since my laptop doesn't have a cd\/dvd drive, I had to dig out my external drive so that I could install programs that I want\/need.  GRRRRR!Why can't the people at Microsoft just leave well enough alone?  Why do the computer \"experts\" always have to muck things up so that the average user needs 22 manuals to figure things out?  "]},{"symptom":"Windows update issues        I don`t know why,but windows up dates are not installing correctly..I have my settings to where it should be updating during the schedule I set when I am not using my computer and also have it set where it will notify me when the computer needs to restart during an update. It is updating during the times I am on my computer instead and also it will shut down during the update without warning me it is doing so. Does anyone know of a possible solution to this?Thank you.","solutions":["Hi Peg. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything possible for fixing failed Windows Updates, so that at least something will work before you work through them all. Even if you've tried a step, please do it over in sequence:Some Updates will sort themselves out in a few days so I'd wait to see. If not or they are bothering you then here are steps you can take:1) Run the Windows Update Troubleshooter from Windows Settings > Update & Security > Troubleshoot.2) There is a new guided walk-through from Microsoft for repairing Windows Update that leads up to resetting components if necessary:https:\/\/support.microsoft.com\/en-us\/help\/10164\/.... Try running that first. 3) If that fails try manually resetting Windows Update Service: Open administrative Command Prompt and type following commands one-by-one followed by Enter key.net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Close Command Prompt and see if Windows Updates works then 4) You can also install the Updates manually that fail to install, which are logged at Settings > Update & Security > Windows Update > Installed Update History, and then search for those to download and install from this Catalog:http:\/\/test.catalog.update.microsoft.com\/v7\/sit... 5) If they continue to fail and interfere, then you can block them using one of these methods:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... 6) If problems with Updates have become chronic and especially if you have other performance problems, go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 7) If nothing else works then do a Repair Install, by installing Media Creation Tool, open installed Tool and choose to Upgrade the PC Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version 1909. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... _____________________ Good news! There are major changes in Version 1903 giving back control over Updates to the consumer. Microsoft has heard us at the highest level who announced this here:https:\/\/blogs.windows.com\/windowsexperience\/201..._____________________ I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","   Hi Greg,                                                                                                                                                                      I hope this finds you doing well. I want to thank you for your help. I was trying the steps that you gave me and while doing so, my screen went blank for some unknown reason. I have not been able to get back in it since.I am not sure what to do next. Do you have any suggestions as to what I can do with this?  Thank you in advance for your help. It is greatly appreciated. ","Hi Peg - Do you see anything at all now on the screen? Power off by pressing teh power button down firmly and holding it until it cuts all power to the PC.Now wait 5-10 minutes for it to cool down, then power on to see what happens. Observe closely because if it goes blank again I need you to tell me everything you see. One thing to look for if it shows the BIOS splash screen with the maker's logo on it, is to see if you can spot what key it says to press for Boot menu. You will need this to boot media. Also see if you can spot the key to press for BIOS\/UEFI Setup. You may need to go into those settings to Reset the BIOS to defaults to get it to work properly.Now power off again twice more and on the third time you start it should go into Repair Mode with these choices:https:\/\/www.tenforums.com\/tutorials\/2294-advanc...If so go into Advanced Troubleshoot options to try to System Restore to before this started, try the new Uninstall Updates button, try Startup Repair. If none of these work then go back to Troubleshoot Options to try the Reset.It may be necessary to create bootable media to access Advanced Startup Options or do the Clean install:To create Windows 10 Installation Media on another PC install Media Creation Tool and follow the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, on second screen choose Repair Your Computer, then Advanced Troubleshoot Options, then System Restore, or the new Uninstall Updates button. If that fails go back to Troubleshoot Options to try a Reset.If that fails choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, click Next to let it create needed partitions and start install - this makes it foolproof. Everything needed to get the best possible Clean Install is here: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... It is a better install than any amount of money can buy and a great learning experience that will make you the master of your PC because you will learn what works best and how to apply it with your own hands. If you have files that aren't backed up you can use the same bootable media to try to rescue your files first using these methods:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Greg,                                                                                                                                                                      I will let you know tomorrow on trying to get the info you want.","Peg, keep me posted on your progress as I will be here to help until the case is resolved."]},{"symptom":"How to get rid of help menus on older programs banishing me to the realm of some unhelpful Microsoft page being opened in my browser        Whenever i opened the help menus in old games i was sent to some useless microsoft page. Turns out they replaced winhelp32 with some garbage redirect. So i replaced it with one that actually works. Now i want to view the help menus in Microsoft Inkball, but it still sends me to that garbage page. Anyone know how to get help menus based on helpctr.exe to work like i did with winhelp32.exe? I don't care if that help format is insecure or whatever. Just let me see the darn help menus!","solutions":["Hi SC. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.It shows how to convert the old Help format files to latest for Windows 10 in this handy thread:https:\/\/www.tenforums.com\/general-support\/10856...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I've already installed winHelp32. I'm not looking for how to open HLP files, i already can. I'm looking to open the help topics baked inside the MUI file of a Vista game.","Yes, that's exactly what they're trying to do in the thread I gave you. It shows how to replace the old Help file in the Windows folder with the new one. Please read the steps carefully.","No. You're not listening to me. I'm not asking anything about HLP files. The help menu i need viewing in the game is not a HLP file. It is not related to winHelp32. I have already replaced my help program and can access those files and help menus in games that use HLP and winHelp32. I'm asking about a different help menu system, managed by a different removed program (helpctr.exe) which redirects me to the page even if i already replaced winHelp32.","Did you try the steps here that appear to apply: https:\/\/support.microsoft.com\/en-us\/help\/917607... ?","The help menu hasn't magically turned into a HLP file since you last clicked on the thread. HLP Files work. winHelp32 works. This specific help menu doesn't. It is not based on the original help format. Reinstalling winHelp32 500 will not make it any less not a HLP file.","I'm sorry I'm not usually confounded by confusing explanations without being able to sort them out. But this is one of those threads.My understanding is you want to restore the old association with Help Menus based on helpctr.exe. Is this correct?Does this get you any closer: https:\/\/www.winhelponline.com\/xp\/startmenuhelp.htm ?","Ok so, first i realized that helpctr.exe doesn't even exist and neither does its parent folders, so i copied them from XP.But gah!Of course, that service doesn't exist in the Service program anymore. So even if i did hook up the registry to open this app, the app wouldn't even work.","I was hoping that there was some type of redirect to the old games help pages without the need for the old service itself.Anyway I gave it my best try and we learned something. Now I have to go work off the bad rating given.","No worries. Thanks for trying. I guess I'll have to get the program running in some VM."]},{"symptom":"2019-12 Cumulative Update for Windows 10 Version 1909 for x64-based Systems (KB4530684) - Error 0x800f081f        Hi all,I got a update error 0x800f081f when i try to install KB4530684.I'v tried all solutions i can search in the web, include and not limit to:Troubleshoot windows update -> Nothing found.stop update service, clean update folder, update again -> No helpsdism \/restorehealth from a iso -> No erroe found, no helpsdownload update package, install manually -> install fail, No helpsand so on...Anyone helps me? Thanks a lot.Here is my CBS.LOG in onedrive. https:\/\/1drv.ms\/u\/s!Av5I5W_l4CiG2HUeEMSSfjqZFM9D?e=1Dy899","solutions":["HI 曹阳. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything possible for fixing failed Windows Updates, so that at least something will work before you work through them all. Even if you've tried a step, please do it over in sequence:Some Updates will sort themselves out in a few days so I'd wait to see. If not or they are bothering you then here are steps you can take:1) Run the Windows Update Troubleshooter from Windows Settings > Update & Security > Troubleshoot.2) There is a new guided walk-through from Microsoft for repairing Windows Update that leads up to resetting components if necessary:https:\/\/support.microsoft.com\/en-us\/help\/10164\/.... Try running that first. 3) If that fails try manually resetting Windows Update Service: Open administrative Command Prompt and type following commands one-by-one followed by Enter key.net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Close Command Prompt and see if Windows Updates works then 4) You can also install the Updates manually that fail to install, which are logged at Settings > Update & Security > Windows Update > Installed Update History, and then search for those to download and install from this Catalog:http:\/\/test.catalog.update.microsoft.com\/v7\/sit... 5) If they continue to fail and interfere, then you can block them using one of these methods:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... 6) If problems with Updates have become chronic and especially if you have other performance problems, go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 7) If nothing else works then do a Repair Install, by installing Media Creation Tool, open installed Tool and choose to Upgrade the PC Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version 1909. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... _____________________ Good news! There are major changes in Version 1903 giving back control over Updates to the consumer. Microsoft has heard us at the highest level who announced this here:https:\/\/blogs.windows.com\/windowsexperience\/201..._____________________ I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"What is; (operating system tools)  Windows 7 CPU storage capacity? C and D?        Hi, I got a question asking; (operating system tools) For Windows 7 what is the CPU, Storage capacity, C and D.I am doing a Customer Service Course and we have to know computer stuff,I think I am to find out by using the computer or laptop that I am on.What does C: D: mean?Thanks.","solutions":["https:\/\/docs.microsoft.com\/en-us\/previous-versions\/technet-magazine\/ff642468(v=msdn.10)?redirectedfrom=MSDNhttps:\/\/docs.microsoft.com\/en-us\/previous-versions\/technet-magazine\/ee851557(v=msdn.10)https:\/\/docs.microsoft.com\/en-us\/welcome-to-docsAll above are Microsoft\/TechNet resources for Win 7 OS.Storage capacity mostly has no limit,win 7 uses Intel Matrix Storage mgr if you run Intel based hardware.Also,USB flash drives can be set as user storage & Virtual Memory,once its set in diskmgmt.msc  Actions\/All\/Make Active.C: is always the default for the OS,D: is cdrom\/DVD player,other letters can be reset in diskmgmt.mscThe CPU only has limited CACHE storage,its speed is another,but the CPU socket type is the key..https:\/\/www.intel.com\/content\/www\/us\/en\/support\/topics\/utility-tools.html read intel docs.","Hi, I got a question asking; (operating system tools) For Windows 7 what is the CPU, Storage capacity, C and D.I am doing a Customer Service Course and we have to know computer stuff,I think I am to find out by using the computer or laptop that I am on.What does C: D: mean?Thanks.1. What is the CPUhttps:\/\/en.wikipedia.org\/wiki\/Central_processing_unit2. Storage capacity: https:\/\/en.wikipedia.org\/wiki\/Computer_data_storage3. C: and D: would be partitions on a hard drive or hard drive letters for the Hard drive or CD\/DVD drive.D: or E: is normally the CD\/DVD Optical drive: https:\/\/www.computerhope.com\/jargon\/p\/partition.htm"]},{"symptom":"Can't access libraries My Pictures; My Music and My Videos        Today I went to open up a picture and realized I couldn't get into C:\\users\\xxxxxxx\\documents\\My PicturesGet a message:Location not availableC;\\Users\\xxxxxx\\Documents\\My Pictures is not accessible.Access is deniedif I right click on properties and click on the Security tabI have permissions as both a user and the administratorI thought I would change the permission of Everyone and click the Edit buttonAnd it when I try to Allow everyone it lets me ...but when I go to click on it again I get the same error messages.The only thing I can guess is I got a Microsoft Account message about a week ago and signed in on another name. So I have two Microsoft Accounts with two different email addresses that both seem to work - so I am wondering if the \"User\" is somehow messed up. That being said I can get into every other folder in the documents except the \"My Music, My Pictures and My Videos.\"Anyway to see if the files are still there or somehow got moved?Thanks","solutions":["Do you not have C:\\Users\\xxxxx\\Pictures and C:\\Users\\xxxxx\\Music?","Hi mwolfsonWX and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.1. Open \"File Explorer\". 2. On the left pane, right-click \"My Pictures\" then select properties. 3. Click \"location\" tab. 4. Click \"Restore Default\" and click \"OK\" I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"How do I remove a member account in Windows 7        How do I remove a member account in Windows 7, MSN Explorer.","solutions":[]},{"symptom":"cortana        I'm new to retirement and the more technical issues of home computers. I I recently activated Cortana.Unfortunately Cortana has been nothing but trouble. It constantly looks up everything on the Internet with it does not help me look anything up it seems to know nothing. There's been changes to File Explorer Diane. Microsoft Edge I tried to connect all my devices. I was hoping Cortana could guide me.it is nothing but a headache. does cortana work right for anyone? i followed the prompts, i've read all i can find. any advice would be great.","solutions":["Hi Frank. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.First be aware of big changes being made recently in Cortana: https:\/\/www.theverge.com\/2019\/7\/25\/20727129\/mic...https:\/\/insider.windows.com\/en-us\/articles\/cort...Next make sure Cortana is set up correctly as shown here for the latest May 2019 version:https:\/\/support.microsoft.com\/en-us\/help\/17214\/...https:\/\/www.computerworld.com\/article\/3043552\/w...Troubleshoot new Cortana: https:\/\/www.lifewire.com\/fix-cortana-4151935https:\/\/www.thewindowsclub.com\/mail-and-calenda...Usually one of those will do it. If not then there may be problems with your WIndows install. Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. Update your drivers from the PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1903 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... If you want to turn off Cortana after Version 1909 see here: https:\/\/www.windowstechit.com\/16020\/turn-off-co...I hope this helps. Feel free to ask back any questions and let us know how it goes. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I have Geek Squad and I had them do a system check and everything last night my computer is all working fine. They said I have the latest update. They told me I should go buy something better and forget about Cortana. I had too much time invested in it I didn't wanna give up, I was really hoping for something that could help me. I was just trying to hook another Samsung account to it. And it kept popping up and interrupted me and it ended up locking me out of my account. So I've been on the phone with Samsung for an hour to get my account open. I had to shut everything off I could to get it to stop interrupting me I'm popping up while I had them on the phone it kept searching for stuff in Bing when I had Google open using it. I think I have to give up on this thing. Edge doesn't work right my phone isn't right now. This thing does absolutely nothing but cause trouble in less you guys are able to actively help me fix it I'm gonna have to switch back to my old accounts and just go back to what I had before. I have been trying to get ahold of somebody from Microsoft for the last 3 days. Can't get them  on the phone, get them on the computer, you are the only person response back .  thank you by the way. At this point I'm gonna have to make any appointment over at Geek Squad and go to Best Buy and I'm if I can get this fixed I'm gonna  have to switch me over to their products and get this out of my computer again. i know i am not good with tech. but this is beyond my MS PhD i used many programs set up at pherm. or others i guess i never had to figure out why they didn't work. always a comms. person, thus the result my typing skills. any help would be accepted, i hate to give up. in concept cornata is a great idea. i spent to   ","May I ask where the results are for all of the resources I gave you? You replied back without mentioning a single thing I'd given you, which work for everyone else.This is an interactive process. Nobody in a tech forums helps more people online successfully than I have for ten years. But the guides need to be read and tried, all results reported back so I know what you've tried and what to suggest next.If not then if you have a Geek Squad contract I'd use it to get this fixed for you. Normally our help here will save a $150 minimum repair bill and they will end up reinstalling Windows with half as good of an install as I can help do. But if you have a contract then I'd use that. Otherwise please report back results of all of the steps I gave. Please do not skip any steps. We often find out later that the fix was the skipped step. If you need help performing any step I will help."]},{"symptom":"Rainbow Six Siege Crashes when launch        Please help me despite my absurd situation. I have an Macbook Pro with EGPU set up running on Windows.the GPU is the Amd Radeon vega 56(pretty powerful for most games on 1080p) My other games run fine like GTA5, Battlefront2, Minecraft and Rocket League. However, when I set my display to only be my external display which is running on the EGPU and run r6, I get a BSOD with kernal security check failure, or sometimes DPS watchdog violation. I've done everything on this article. https:\/\/support.ubisoft.com\/en-GB\/faqs\/000025947\/Basic-PC-Troubleshooting\/. Literally everything please do not refer me back here. Anyways sometimes when I followed a specific step on this article the game actually runs and it runs amazing and I get really high frame rates as well just like my other game. But again it's not consistent and it would sometimes just crash again. I then read that r6 sometimes crashes because of multiple monitors, I already had windows set to run only on my external monitor, but I thought why not set it to only run on my internal display and then see what happened. And surprise it actually works and works great and is very consistent. So what I would do is after it runs successfully I would set windows to extended display and then launch again and sometimes it works. Or other times I would first set it to duplicate display, then set it to show only on my external display and it would also work. But that only worked if i set R6 to windows mode. But, I tried the process again to see if I got any consistency and then boom it crashed. By the way, if the game crashes, if i set it to only run on my external display I would actually get the BSOD, but if it is extended or in duplicate on my internal display it would not show BSOD but instead just like this weird glitch effect thing. Please help me despite my current situation. Thank you very much for taking the time to read this.","solutions":["Hi MichaelQue I need the dump file, Please upload the Dump file, So we can Analyze the error. Go to C:\\Windows\\Minidump\\ Then upload the dump file to https:\/\/onedrive.live.com\/","Thank you so much for taking the time to help! Just saying from my minidumps I've tried a lot of different ways to launch the game without crashing so there might be several different crash factors, if you will so please report them all to me when you analyze them that would be so great. Again thank you so much for even replying. Here is the link,https:\/\/1drv.ms\/u\/s!AqWNIDsCGoFAjDNjaSugsl_alpMj?e=91zbEQ"]},{"symptom":"Peripheral Input Lag        I recently upgraded to an SSD and moved my OS to that drive. I also reformatted both my HDD and SSD and reinstalled all application onto my SSD. (I am currently using Windows 10)After doing so, I noticed that both, my keyboard and mouse have significant input lag.I have updated all of my drivers, and have made sure that none of the hardware is failing. Before I upgraded, everything was working fine.I have tried connecting the mouse to a different USB and it is still laggingNo problems have shown up in the device manager.Hardware:Mouse: Razer Deathadder ChromaKeyboard: Wired Apple KeyboardSpecs:OS: Windows 10 Pro (x64)(Version 1909)Display Adapters: Intel(R) Core(TM) i7-8700k CPUS @ 3.7GHz                             Radeon RX 580 seriesMotherboard: ROG Maximus X Hero (Wi-Fi AC)Disk drives: Hitachi HUA72302ALA641                   Samsung SSD 860 EVO 1TBI also use an XBOX 360 Controller and would greatly appreciate any help regarding improving performance","solutions":["Hi Goodla. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Please post a screenshot of Disk Management, which I read like a doctor reads X-rays. Follow the steps here so I can see everything needed to advise you:http:\/\/answers.microsoft.com\/en-us\/windows\/foru... What happens if you try another mouse and keyboard. If the same then the issue with the install, if not it's with the mouse & keyboard and I will give you more advanced steps for those.Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.If the mouse & keyboard still lag, go into Device Manager reached by right clicking the Start button, open Mouse, right click to Uninstall, Restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver. l. Then do the same for keyboard, and if that isn't enough all of the USB controller drivers. To restart PC program the power button first to Shut down the PC at Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons doGo over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Greg,Thanks for the advice on this issue. But it seems that I have discovered that rather than the peripherals lagging, the video getting displayed on the monitor is lagging by about 0.3 seconds. I currently use a TV as a monitor and any help on this updated issue would be greatly appreciated.","Did you complete all the troubleshooting steps I already gave you? Please do not skip any steps. We often find out later that the fix was the skipped step. If you need help performing any step I will help.1) Next Update the Display driver from the PC or Display adapter maker's Support Downloads web page for your exact model number, HP Serial Number or Dell Service Tag - from the sticker on the PC.While there check also for newer chipset, BIOS\/UEFI firmware (very important), network, sound, USB3 and other drivers, comparing to the ones presently installed in Device Manager reached by right clicking the Start Menu.If this doesn't give you the latest or ideal driver for what you need, compare it to the driver offered by the Intel driver update Utility here:http:\/\/www.intel.com\/content\/www\/us\/en\/support\/... or the Nvidia Update utility here: http:\/\/www.nvidia.com\/Download\/Scan.aspx?lang=e... or the AMD autodect utility here: http:\/\/support.amd.com\/us\/gpudownload\/windows\/P... For Display issues one fix that is working is to Roll back or Uninstall the Driver on the Display Device > Driver tab, restart PC to reinstall driver.You can also try older drivers in Device Manager > Display device > Driver tab > Update Driver > Browse > Let Me Pick.Then you will know you've tried everything in addition to Windows Update drivers.Adjust the screen resolution until it fits and looks best at Settings > System > Display.2) See troubleshooting here for PC to TV connections: https:\/\/jtechdigital.com\/articles\/how-to-troubl...https:\/\/electronics.howstuffworks.com\/how-to-te...https:\/\/www.gearbest.com\/blog\/how-to\/windows-78...https:\/\/windowsreport.com\/hdmi-output-problems-... (avoid ad links, just read the editorial copy)3) In addition I'd find the Manual and Support pages for the TV you're using online by googling the exact model + Support, study what known issues there are for connecting it to PC. If it's within a year of purchase and a Smart TV use the included Support to help with this. I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows Feature Update 1903 failure. Tried various times        Will not install update. Always fails at 27% and then comes up undoing changes.Running dell Studio 1749 with SSD and 8gb Ram, obviously running windows 10 64bit version 1809Tried Various thingsUsing admin accountFully uninstalled anti virus.Windows update fails every time.Tried Windows assisatant tools fails everytimeTried Media creation tool fails everytime, from usb (with or without wifi) or just running.Carried could the usual, software distrubution folder delete ect.sfc scannowAll drivers up to daterunning media creation tools up with fault :-0x80070005 - 0x2000AThe installation failed in the SAFE_OS phase with an error during PREPARE_FIRST_BOOT operationHeard its a issue with ssd ??","solutions":["Got the same problem trying to install the 1909 update. After trying several things it appeared to be an issue with the PC card interface drivers. I disabled the PC card interface in the BIOS setup settings. After disabling the PC card interface, the 1903 and 1909 updates installed without problems.","You are a godsend.  This has been failing for over two months and I was ready to throw it through the window.  Disabled the pc card interface loaded the update.  Rebooted.  Enabled the pc interface.  Rebooted.  All is well.Thanks."]},{"symptom":"Bluetooth doesn't generate passcode windows 10        I have an older computer a Dell XPS 420.  It has a Teac CAB-200 media card reader with integrated Bluetooth.  The Bluetooth adapter is a Dell Wireless 355C Bluetooth + EDR (or Broadcom 2045).  I have found updated drivers for it and it installs without error.  The problem occurs when I try to pair devices.  I am not receiving the prompt to enter the passcode so it fails to pair because no passcode was entered.  I do not believe it to be a driver problem as I am able to send and receive files with the Bluetooth.  I am also able to both see devices in pairing mode and other devices can see it.  I am running the most current version of windows at the time 1909.  Is there a setting possibly in the registry that would affect the behavior of the passcode generation?","solutions":["Hi Henry. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See fixes for Bluetooth not generating pass code in Windows 10: https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/www.goldtouch.com\/windows-10-no-passcod...https:\/\/answers.microsoft.com\/en-us\/windows\/for...http:\/\/www.surfacetablethelp.com\/2017\/05\/fix-wi...I'll give all possible steps for troubleshooting Bluetooth in order of priority, so even if you've tried them please do it over in sequence. Many problems right now are being solved by updating to the latest version so if you want to skip to that step see the Repair Install at bottom: Try Updating the Bluetooth driver from the PC maker's Support Downloads webpage for your exact model. Install it even if it's the same or newer than the one in Device Manager reached by right clicking the Start button.Right click Start button to access Device Manager, locate Bluetooth device (if necessary from View tab Show Hidden Devices), on Driver tab see if Roll Back is available, if not try Update Driver, first automatically, then Browse, then Let Me Pick to try all previously installed Drivers. If these fail Uninstall the Driver, restart PC to reinstall. If the BT driver is not there, access the View tab in Device Manager to \"Show Hidden Devices.\"Make sure you're pairing correctly as shown here: https:\/\/support.microsoft.com\/en-us\/help\/15290\/... See Fixes here which are all working: https:\/\/support.microsoft.com\/en-us\/help\/14169\/...https:\/\/superuser.com\/questions\/1017867\/make-wi...https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/www.lifewire.com\/fix-windows-10-bluetoo...Try the Bluetooth troubleshooter at Settings > Update & Security > Troubleshoot. Try turning off Fast Startup at Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change settings that are unavailable > uncheck Fast Startup.If this is a mic or headset right click Volume icon in System Tray to Open Sound Settings, make sure the correct device is selected for input or output in the dropdown menu.Then try pairing again, if necessary run the Bluetooth Troubleshooter again. If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....If you think the BT adapter has failed, you can replace it easily with a USB nano adapter like this one:https:\/\/www.amazon.com\/ZEXMTE-Bluetooth-Receive... Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1909 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Unfortunately none of these methods corrected my issue.  I have uninstalled, and reinstalled drivers and upon pairing I do not receive a window in which I can even enter the passcode.  I have considered replacing the Bluetooth device but I would like a new device that doesn't lose the functionality of the old device. It has been hard to find devices that allow both for HCI mode and HID proxy mode, such that it works before windows boots and within windows.  If someone has any other suggestions in terms of making my current device work or on a new device, I would be glad to hear it."]},{"symptom":"desktop with windows 10 says no internet connection          the desktop computer downstairs that all the equipment (router modem ectc) is connected to which is on windows 10 says there is no internet connection but all the equipment is working properly I am on a laptop upstairs on windows 8.1 that works perfectly so the problem is just in the desktop software somewhere this problem just started out of nowhere one day its working fine the next it is not nothing happened to the equipment no windows updates the computer was not even turned off             ","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.This desktop computer it connected to your computer with a network cable by the sounds of it?As you say it hasn't even been turned off it could actually just be that it requires a restart to sort out... I often find this can resolve this type of problem.Click START, click the power symbol, and look for the option that says \"Restart\". It's important to use the Restart option.Once you've done that see whether it's connecting again? Regards, David","I have already done a restart I have been through all the steps of making sure the equipment is working I have also been through all the troubleshooting steps including restarting the computer the message I keep getting when I troubleshoot is windows can't communicate with the device or resource ( primary DNS server) if this helps","If you right-click START button, choose \"Command Prompt\" (or it might say Powershell), and then enter the command IPCONFIG \/ALLCan you copy\/paste or screen-grab the output which is produced please? This will show us what network settings the computer is trying to use.","It said something about not recognizing this but there were 2 powershell options perhaps I should have used the other one do you mind if I ask you do you know anything about trying a Network Reset option under the Status in Network and Internet I don't think I have tried this yet I am a little nervous about doing something that will cause my laptop or the whole system to stop working","The reset option is worth a try - it only resets the setting within your computer - nothing to do with the router or laptop, etc.The command I suggested you try is the word \"ipconfig\", then a space, then the \"\/all\". It should produce output that looks like this:","ok thank you I am sure the problem is isolated to the desktop computer only because the router is working properly so I will try the reset and then also use the above info I have to go drop off my cat at the vet for a medical procedure tomorrow morning so I will get back to this in just a bit again thank you for your help","Hope the kitty is ok, let me know how you get on with things when you have time."," I solved this problem the next night it was in the properties on the Ethernet I think it was the fourth selection and properties again there were two circles that needed to be checked for the ip address to be automatic one of them had been changed from this option after I fixed it there was a message to send a report to Microsoft about system maintenance failure  it took me a few days to post there was a slight complication with the cats procedure she had a reaction to medication and had to have a tracheotomy until the swelling went down scared me and the vet but she is home and recovering very well I have an amazing vet thank goodness"]},{"symptom":"Windows 10 does not boot at all        Dear Microsoft community,I have 6 months old HP AIO which was working perfectly fine with Kaspersky internet security with parental control. As Kaspersky removed the 'parental control' option and forced me to use their 'Kids protection' software, I was forced to install it couple of days ago. Then, I was connecting to internet using Kaspersky internet security and 'Kids protection software'. But, my computer started behaving weird like taking longer time to boot, showing black screen during boot, disappearance of 'Wifi' option in the 'Network settings' screen. So, I restored my computer back to a week and shut it down properly. Then, it was not booting at all, saying it was not shut down properly. It automatically tied to diagnose the problem and repair while booting, but it could not resolve. It showed me various advanced options including 'booting with safe mode' and 'PC Reset'. I tried booting with 'safe mode' first and it did not work. Then, I tried 'PC Reset' and computer cannot do it saying there is a problem. I am totally stuck and not able to boot my computer at all. Today, my Asus laptop also started taking longer time to boot and started showing black screen while booting. By keep trying ctrl+alt+Del many times during the black screen, somehow I logged in and typing this question. Now, I am really worried about this laptop as well. I am really not sure what is causing the issue. Is it Kaspersky's 'Kids protection' software or recent update of windows or something else. I need your help on booting my HP AIO computer back. Also, it would be appreciated if you could tell what is causing the issue and how it can be avoided in the future. Thanks in advance.","solutions":["Parental Controls with youre add-on 3rd party software probably works the same as Windows 10 Parental software,it limits all Administrator controls..To try a fix,on pc start,tap the F8 key,safe-mode,it is a default.Once at screen,select normal safe-mode,then open add\/remove,locate the software,uninstall.W\/O a pc restart,use  search in my computer,enter its name,delete all,,exit.Then in cmd or run,type:  regeditin regedit,expand:  HKEY_LOCAL_MACHINE\/Software\/locate the unwanted,R.click delete,close out,locate & expand:  HKEY_LOCAL_USER\/Software,do same deletion,exit regedit.Next open run,type: %Temp%organize,select all,right click on data,delete all,exit.Run Diskclean up utility,chk all\/then more options tab,click restore & shadow copy button.Once thru,restart pc.One can\/could after diskclean,open cmd,type: CHKDSK C: \/F  agree to restart,type: EXIT  restart pc.For what its worth,to disable Parental Software thru windows defaults,open user account,uncheck the box,exit & open cmd,type: services.msc  locate Parental,double click,set to Disable exit msc.Windows doesn't always follow this in normal running,safe-mode will work always.","You need to remove Kaspersky totally using their removal software.You need only Windows Defender and Malwarebytes installed on you computers...The best security sits between the chair and the keyboard.  Watch what and where you click.  If you do not know what is there do not click on \"Click here\".  If you get an email that sates it is from your provider look at the address of the sender.  If it has a couple of letters at the end they are probably the foreign country and that is not where your provider is located.  When downloading programs do it from the maker not anyone else and do not allow any extra items to be included."]},{"symptom":"Printer not working        I upgraded to W10 from 7. Now my HP Photosmart4400 printer is not working. What to do?","solutions":["Hi William. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Rather than spending too much more time fiddling I'd simply Clean Install the printer which always works, lasts longer and actually saves time:1) Power up the printer, if wired unplug it's USB cable from PC. 2) Go to Settings>Apps>Apps and Features to find and Uninstall any printer software.3) Use one of these methods to remove all of the old printer drivers: https:\/\/www.tenforums.com\/tutorials\/101274-unin...https:\/\/helpdeskgeek.com\/how-to\/remove-uninstal...4) Now type Control Panel in Start Search, open CP, choose Icon View. In Control Panel open Devices and Printers, right click printer to delete Printer and any scanner or fax of the same name. Restart PC.5) Go to the printer model’s Support Downloads webpage to download and install the latest full software package. Now is also the time to check for any newer printer firmware to install which matters a lot.6) Extract Printer software, right click Setup file to Run as Administrator. Follow the setup screens closely as you install the software. For USB it should prompt when to plug in the printer.Older software may need to be installed in Compatibility Mode to run correctly: https:\/\/www.groovypost.com\/howto\/run-old-softwa... If you have further problems reply back with results of each step. Once it's installed and you've run a test print, then scanned it to see that it opens on the desktop, open the Printer software and go into its Settings to set the scan-to file location you prefer, also the email app you want opened for Scan to Email, if applicable.I hope this helps. Feel free to ask back any questions and let us know how it goes. If you will wait to rate my post until we are done, I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"VPN not working on Windows 10 1903        I am an IT technician at an IT company. One of our clients has asked us to install a fresh version of Windows onto 6 of their PCs.These PC's are old PC's that they do not use - meaning that they have had a fresh version of Windows installed onto them. This has been upgraded to 1903. I have attempted to setup a VPN connection in order to connect the PC's to the company's domain. When doing so, the VPN connection just hangs on 'Connecting to vpn'I know 1903 is still very new into the world, but wondering if anyone knows how this issue can be resolved?","solutions":["Hi Ryan. I'm Greg, an installation specialist and 9 year Windows MVP here to help you.Others are reporting this in v.1903; https:\/\/www.reddit.com\/r\/sysadmin\/comments\/bs0m...Can't connect Windows 10 version 1903 to VPN: https:\/\/www.techrrival.com\/fix-vpn-not-working-...https:\/\/thebestvpn.com\/troubleshoot-vpn-connect...https:\/\/www.thewindowsclub.com\/vpn-not-working-...If the above doesn't help then I suggest you contact our sister forums for IT Pro's Technet:https:\/\/social.technet.microsoft.com\/Forums\/en-...I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thank you for your reply.Unfortunately the links in your post have been no help :(I have already tried the steps that those sites suggest but still no luck.I have created a post on that forum and hopefully I will get some sort of resolution.I am still open to any possible solutions if anyone has anything in mind!","This issue has been resolved. I had created a thread on TechNet and the user Travis Huang was able to provide a solution.Simply by connecting to the VPN via the settings menu instead of using the tasktray!","This isn't a solution. It's a workaround. User's shouldn't be expected to do this. This has been a long outstanding problem:https:\/\/social.technet.microsoft.com\/Forums\/en-US\/821b5675-743b-4d52-87a4-3f5491c122f3\/vpn-connection-from-system-tray-does-not-work-but-works-from-network-settings?forum=win10itpronetworkingI found my way on to this post while searching to see if 1903 fixes this issue but alas it hasn't. Unbelievable that this is still not resolved.","The issue appears to be the login dialog box which gets prompted for credentialing the user to enter a username and password for the VPN CONNECTION.Based on my testing, I figured out that if the username and password is saved in the VPN SETTINGS, then the VPN object from the System Tray works just fine.  The problem only happens when the VPN initiates the login and the Login Dialog Box fails to open for prompting the username and password. I am not a programmer but it is safe to say the problem seems to stem from the Login Dialog Box not getting the proper permissions and\/or parameters  necessary to pop up securely in order to  authenticate the user. I reported the issue to CISCO MERAKI as well since their online instruction now is partially broken!  Based on their documents, if one double clicks the Network VPN Adapter Object that gets created with the setup of the VPN, it will launches the Network Object in the System Tray which is in turn is used to start the VPN CONNECTION and then fails to open the login dialog box.This should be an easy fix if Microsoft actually reads it's own forums for reported issues.Mike Khatibi ","That doesn't make a bit of sense. I have over 100 VPNs, all with saved credentials, and all start perfectly if connected via the Settings panel without asking for a credential once as the login\/pass are saved during creation. Not a single one connects from the menu. ","Interesting. I also have 100+ VPN tunnels with SAVED credentials and they all work perfectly fine from the System Tray across multiple laptops\/desktops with version 1903.Are your 1903 use a fresh install of Windows or they were upgraded from previous Versions 1803\/1809?All mines are upgrades and the credentials were initially saved in 1803 or 1809 prior to upgrade.","Both fresh installs from ISO and upgraded exhibit the issue. All the upgraded were from 1809 or 1709. Funny part is that I got one of the 1709 upgrades to work with the VPN from tray...but only some will connect there. Even worse is that every one has the ridiculous ICC profile flashing\/resetting issue on USB activity. Add these two bugs together and 1809 is pretty much annoyingly becoming useless!","Maybe it has to do with the type of VPN created?  I only have MERAKI Security Appliances at all my client locations which uses L2TP\/IPSEC with pre shared key and PAP. If you do not mind me asking what do you use? ","Nope, type doesn't matter. I have L2TP, IKE, PPTP ones and they all do the same. Since everything works from Settings but not the tray, it's more likely that MS screwed up (again) with one of the libraries. They are probably calling an API from the tray that has changed or is missing some component. Typical, though, as they seem to care more about being sure that Xbox **** works, but not a bit about the corporate components."]},{"symptom":"Autostart programs such as Outlook which do not appear in the Taskmanager        Dear Microsoft community,is it possible to Autostart programs such as Outlook and Google Chrome which do not appear in the Taskmanager Autostart tab?Thank you for your help!","solutions":["Hi exceluser_123 . I'm Reinald, an Independent advisor and a Windows user like you. Thank you for providing information on your issue, we are are happy to assist you.You can follow these instructions from office support website if you want your office applications to start automatically when you turn on your computer:Autostart an Office program you use every day by adding a shortcut to the Windows Startup folder.For Windows 10 or 8: 1. Open the Windows Run dialog (Windows Key + R). 2. Copy the following path to the Run dialog, and then press Enter. %AppData%\\Microsoft\\Windows\\Start Menu\\Programs\\Startup 3. Look for the program you want to automatically start. Option A. Go to start > Search for the program > Right click and select \"More\" > Open File Location > Right click again on the app and select \"Open File Location\" one more time.Option B. If you have a shortcut of the application in your desktop just right click on it and select open file location4. Drag and drop the application shortcut to the folder: %AppData%\\Microsoft\\Windows\\Start Menu\\Programs\\Startup 5. Your program will automatically start the next time you start your computer. If you ever want to remove a program from autostart, delete the shortcut from the Startup folder (Steps 1 and 2).You can double-check if the program will automatically start by going to the task manager > StartUp tab. The program should be listed and the status should be \"Enabled\". You can simply right click on the status and select \"Disabled\" if you don't want the application to automatically start. NOTE: This step also works with other applications. You just have to look for the application short cut (Step 3) and copy\/ the shortcut to %AppData%\\Microsoft\\Windows\\Start Menu\\Programs\\StartupSource: https:\/\/support.office.com\/en-us\/article\/automa... I hope this helps. Let us know how it goes and don't hesitate to ask if you have further questions. I will do my best to to assist you until your issue is resolved."]},{"symptom":"Shift + number keys not giving expected symbols        At first, I thought my new keyboard was messed up. So I switched from the brand new one back to my old one. And I still have the same problem. Whwn I hold down the SHIFT and 2 key on my keyboard, it suppossed to make the @ sign rightIt doesnt.. instead it makes this \" (a paranthesis). Same with Shift and 3 keyboard, it makes a slash instead of the usual number sign.Still, if I wanna make the at sign, I gotta hold down ALT and then key 2... see... @As for a question mark key... I cant even get that to work. Something is messed up here, and its really annoying. I need my old ways of typing back. Can anyone help me thanks in advance.Dan*original title - Just bought a brand new HP computer.. came with Windows 7. My Shift Key wont work...*","solutions":["Sounds as if you have selected an input language other than English. Control Panel, Region and Language; also check to see if your new keyboard has a language selection available that may need to be changed.<Nintendan> wrote in message news:*** Email address is removed for privacy ***...At first, I thought my new keyboard was messed up. So I switched from the brand new one back to my old one. And I still have the same problem. Whwn I hold down the SHIFT and 2 key on my keyboard, it suppossed to make the @ sign rightIt doesnt.. instead it makes this \" (a paranthesis). Same with Shift and 3 keyboard, it makes a slash instead of the usual number sign.Still, if I wanna make the at sign, I gotta hold down ALT and then key 2... see... @As for a question mark key... I cant even get that to work. Something is messed up here, and its really annoying. I need my old ways of typing back. Can anyone help me thanks in advance.Dan"]},{"symptom":"Manual reorder pictures in folder        Good eveningI am in the process of creating a photobook and need to manually reorder my pictures in my folder as none of the sort options are suitable.  Is there a way to drag and drop, or cut and paste to do this.  ThanksDiane","solutions":["Not drag and drop but have you thought of putting a number as the first part of the title of the photo.","Hi DIaneJebson I'll try to answer your question. There is no such option as \"drag and drop\" to rearrange files. You can do the following : - rename each file with a number or - create a folder for each \"page\" of your photobook I hope this answers your question Regards"]},{"symptom":"CPU at 100% that goes away when opening Task Manager        Hi,So I have had this issue for a while but I was curious if there was a reason for this and if it is possible to stop it. This is Windows 10 on my Lenovo Yoga 910. Occassionally, my CPU will be working very hard and is generally at 100% usage. I can tell because my fan will be working hard for some time. Once I open Task Manager to see what is causing the problem, I will see a dramatic drop in my CPU usage. Below is a screenshot. This seems very odd to me that opening the Task Manager would decrease CPU usage. For a short bit I noticed that \"System Interrupts\" was at the top of the Processes organized by CPU usage in this instance. This isn't a terrible issue but it would be nice to not have these random CPU spikes.","solutions":["Hi Warpstar22 I'll try to answer your question. When idling, your computer is still doing a lot of things. For example preparing files for a further update, or rearanging files, or scanning for virus, etc.When you open the task manager, Windows stops the work that he was doing on hiw own because you're asking him to do something else.Also, system interrupts is a container that gets a lot of instructions from software \/ hardware. it handles a lot of interactions.I hope this answers your question Regards"]}]}