{"windows":[{"symptom":"Unable to access external HDD        I have Windows 10 Pro Version 1903 and use Macrium Reflect for my scheduled backupsto an external HDD housed in a caddy.  Recently the backups have failed four timesdue to an error \"the semaphore timeout period has expired\".  Despite trying varioussuggestions to fix from Google - no luck!  Now I have no access to my external HDDas the drive cannot be seen in ‎File Explorer.  Your help for a fix will be greatlyappreciated.  Regards Peternosmas","solutions":["Hi Peter, Open Disk Management (accessible by right clicking your Start Button) Expand that window, so all drives are visible in the bottom right pane Please provide a screenshot of that Disk Management window . . .","Hi DaveM121Hope the above is what you are asking for.  The missing HDD was originally given the drive letter 'F'","Hi Peter I am sorry, your screenshot is not coming through, please try that again . .. Click your Start Button, type snip and hit Enter - this will open the Snipping Tool or Snip and Sketch (depending on your version of Windows 10)Set Mode to Full Screen, then click New to take a screenshot Save that file to your Desktop and close the Snipping Tool Then in your next Post, click the second last button on the toolbar above your post to select that image and upload it to your post . . ...","Hi DaveHope this image stays and that you can provide a solution. As I said before, the missing HDD was assigned letter FRegardsPeternosmas"]},{"symptom":"Windows 1803 update\/version manual install        Hello,Is there any place to get the complete 1803 update so that you can install it manually?I have a laptop (Lenovo T480s > Windows 10) that is compatible with v. 1803I've gone into Windows update settings and was able to install all the v. 1709 related updates, butafter rebooting, regardless of whether I click on the \"check for updates\" button, or the \"checkonline for update from MS update\" link, it's saying that it's up to date, and I'm unable to updateto v. 1803.I've had no issue with updating other computers - this is the first time I've experienced this.I've rebooted a few times and tried again; updated the BIOS and other Lenovo updates; checkedin our AD to make sure the computer was in the proper container...  Not sure what else to try.I've gone here:  https:\/\/www.microsoft.com\/en-us\/software-download\/windows10  but this appears thatit will update the laptop to v. 1909, which I can't do as the image we use isn't quite compatible withthe November update - I need to update to v. 1803 and leave it at that.Thanks much in advance,Jim","solutions":["Hi Jim Windows 10 ISO's are free, Microsoft only offer the latest version of Windows 10 in ISO format, click the safe link below, on that page you can download any Windows 10 ISO version you need and can use that to upgrade a PC or create bootable installation media to clean install a version of Windows 10. The ISO's are downloaded directly form the Microsoft Servers and are totally safe . . .https:\/\/tb.rg-adguard.net\/public.php________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","Hi Dave,Thanks very much for that link.By change, any idea as to \"why\" the laptop can't get any updates past v. 1709?","Hi Jim Honestly, from your hardware, there should be no reason why you could not update to 1909 and beyond . .. but with Windows 10 updates, you never know, an update may fail for a week, and then install with no problem the next day . . .","Older builds of Windows 10 sometimes have issues obtaining feature updates. This can happen if it was declined in the past or a version was pulled or restricted for install on that hardware. Sometimes resetting the Windows Update catalog\/cache on the machine will allow it to be offered again. The latest versions better control feature updates.To properly update your Windows 10 machine, you should simply visit the following link. You can perform the update by using the update now link on the page or through the media creation tool, if you have issues. The media creation tool is also the official method to create ISOs and bootable media of the latest release build of Windows 10 (currently 1909).Windows 10 November 2019 UpdateIf you need to specifically update to a prior release like 1809, the link provided earlier would work. You could also try the1809 Media Creation Tool  to see if it will still download\/update to the 1809 version rather than the latest.","This is why I hate computers :-)Thanks again!","Thanks much for the reply\/link.The Lenovo laptop I'm having the issues with is used as a spare, so I'm just going to update it to 1909 andleave it at that.We use an image for all our computers. The image is built at the corp office (NY) and then sent out to all the various offices\/techs (I'm in SF).  It's way outdated, and we've been trying to either get them to update it, or allow us to. Why I've been trying to update it to 1809 is that we've had issues with laptops after they've been updated to 1909 - which our Corp office has been trying to address.I found an MS tech blog article that said v. 1809 was End of Life, and no longer supported. From my experience in running these updates on our computers, they seem to work in sequence. First you'll get a round of 17****809 being at EOL, you're not able to install them any longer, so that then prevents you from getting to the 1909 update(s)?I just imaged a new HP desktop. Same image, so its v. 1709. I'm running updates on it  now, so we'll see what happens.Thanks again!","some weird formatting occurred there:\"First you'll get a round of 1709 updates, then maybe 1 or 2 more. Once all 1709 updates have been installed, then you can move on to the 1809 updates. You have to install all the 18xx related updates, and then you've able to move on to 1909. With 1809 being at EOL, maybe you're not able to install them any longer, so that then prevents you from getting to the 1909 update(s)?","On the HP, I was able to install all the 1709 updates that were pending, but like with the Lenovo laptop, I cannotupdate any further via Windows Update Settings. Says I am up to date, though when I run winver, it shows I'm on 1709.Tried that 1809 Media creation tool - when I opt for \"upgrade now\", I get an error that \"the language or edition of the version of Windows currently installed on your PC isn't supported by this tool\"I don't have a flash drive available to try that option - but is it even worth giving a try, or will I get the same error?","The tool only works on consumer editions of Windows 10 Home\/Pro. You likely have an Enterprise\/Education or other edtion. If so, the option to upgrade without changing editions, may not be possible. Usually companies have an MSDN subscription in which to download the approriate ISOs.","Ahh... well there you go.  Thanks much for that updateDo you know if the download available at the link that Dave posted would work on an Enterprise edition?Save me the trouble of pursuing that angle if it's not going to work either."]},{"symptom":"pointer        My pointer is the left one and it is pixeled and i don't know why and it's only the first day of using this pc ","solutions":["Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.Please try changing the mouse pointer scheme in Control Panel > Hardware and Sound > Mouse (under Devices and Printers) if you are navigating in Category View, otherwise it will be Control Panel > Mouse. I would suggest selecting Windows Default (system scheme).Please let me know if I can help you further!","I did so but nothing changed the pointer I got is different and more pixeled than that in the preview box","If you navigate to C:\\Windows\\Cursors, View > Extra Large Icons, does the aero_arrow cursors look pixeled?","I don't know why but I restarted the computer and it was solved sorry for disturbing Thank you a lot","No worries, good that it is resolved."]},{"symptom":"When will Windows 11 be released?        Hi,i know there will be no Windows 11 (as far as i know), It'll come as updates for windows 10, what i want to know is \"Is there a specific release Date for this update, will it be MAJOR UPDATE changing everything, or just minor updates like step by step ?!\" some websites say that It'll be in 2018, but nothing is confirmed.*Modified title for accuracy**Original title: WINDOWS 11 Release Date ?!*","solutions":["Hello,If there be any updates on Windows 11, they will be posted on official Windows Blog.Atm, there is no confirm information on Windows 11 that can be provided. Microsoft is currently focusing on Windows 10 and improving it in successive versions. Windows 10 Semi-Annual Channel is governed by the Modern Lifecycle Policy. Feature updates will be released twice a year for Windows 10 via the Semi-Annual Channel, targeting March and September annually. Read more in this support article: https:\/\/support.microsoft.com\/en-in\/help\/13853\/windows-lifecycle-fact-sheetIMO, these feature updates released will ensure customers continue to receive support for their Windows 10 versions. And that would eventually reduce chances of having Windows 11. Good luck!"]},{"symptom":"Windows 10 - YouTube HDR ?        Hi, Yesterday I was watching HDR content on Youtube. Youtube Video displayed [HDR] logo.Today the sameHDR content does not dislpay HDR logo at the bottom right but justHD ? Could I be mistaken? --------My settings:--------","solutions":["Problem ResolvedThanks to the Info here : https:\/\/www.engadget.com\/2019\/01\/27\/hdr-setup-explainer\/--------------------Note: Chrome, Firefox, Opera browsers did not display HDR for meOnly Microsoft Edge works  --------------------Info on YouTube:---------------------------------HDR through Microsoft Edge:---"]},{"symptom":"BSOD - Please assist        Hello,I hope I am posting this in the right place.I get BSOD errors on my device almost once a day. I followed this article https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-update\/bsod-finding-and-fixing-them\/1939df35-283f-4830-a4dd-e95ee5d8669d to collect all the memory dumps and sysinfo. Do I post the memory dumps here to get someone to assist me? Thank you in advance. Shaun","solutions":["Hi Shaun, As your organization has strict security rules I think it is best to ask the chiefs if they are ok before.If the chiefs of your organization agree that you send the dump files here then rest assured that it is secured.Regards, Didi"]},{"symptom":"Forza Horizon 4 not launching - Windows 10 version 1909        For the last 6 (!) months I haven't been able to launch FH4, I see the launchscreen of the Senna \/ Defender for a couple of seconds and it just closes itself.I have:- Updated everything I possibly can (Windows 10 version 1909, latest Nvidia drivers, Windows Store,...)- Tried getting it to work by uninstalling and reinstalling, 5 times by now, on different hard drives- Uninstalled and reinstalled the Windows store with powershell commands- Followed everything posted here- Done a full clean install of my operating system--> Nothing works!This is the error I'm getting in Event Viewer:The program ForzaHorizon4.exe version 0.0.0.0 stopped interacting with Windows and was closed. To see if more information about the problem is available, check the problem history in the Security and Maintenance control panel. Process ID: 3410 Start Time: 01d5b2b7fe7cd63d Termination Time: 4294967295 Application Path: C:\\Program Files\\WindowsApps\\Microsoft.SunriseBaseGame_1.377.172.2_x64__8wekyb3d8bbwe\\ForzaHorizon4.exe Report Id: 5234d0e6-88e6-4d6b-aa8b-19b97f47d88f Faulting package full name: Microsoft.SunriseBaseGame_1.377.172.2_x64__8wekyb3d8bbwe Faulting package-relative application ID: SunriseReleaseFinal Hang type: ActivationFor the fun of it, I installed the Forza Horizon 4 demo, found in the Windows Store. That just works, launches just fine?!Does anyone have any idea what's wrong? I've been wondering if it has something to do with my account, that for some reason the Forza Horizon 4 license has been detached from it?","solutions":["Hello Nyshray... Evan here an Independent Advisor....Hopefully I can assist you on this one. Sounds like an annoying issue. Try typing \"Microsoft Store\" into your Cortana search engine...then right click and enter the app settings. Please attempt to reset.After doing so...at the very bottom of that same page Forza should be listed as an installed app. Do the same for Forza reset the app as well. After that, reset and try to launch the game. Should it still not work you could also attempt to run the app in compatibility mode for Windows 7.","Hello Nyshray... Evan here an Independent Advisor....Hopefully I can assist you on this one. Sounds like an annoying issue. Try typing \"Microsoft Store\" into your Cortana search engine...then right click and enter the app settings. Please attempt to reset.After doing so...at the very bottom of that same page Forza should be listed as an installed app. Do the same for Forza reset the app as well. After that, reset and try to launch the game. Should it still not work you could also attempt to run the app in compatibility mode for Windows 7. Not to sound rude or anything, but did you actually read my post? It's the second \"solution\" in the link I posted in my original post. I have tried that \"solution\" about a million times now...","Have you got it working yet?","İ reinstalled it and it works"]},{"symptom":"I am stuck in \"Diagnosing your PC\" at start up. How can I enter a safe mode to reset Windows 10?        I have been using Windows 10 for about two weeks. Tonight, it entered \"Diagnosing PC\" mode and won't get out. I tried restarting it several times, but it goes to a dark screen, windows logo, and beads circling in a loop. How do I escape it? How do I enter a screen that lets me reset Windows? This is ridiculous!","solutions":["Hi Milton, Thank you for posting in Microsoft Community.I regret the inconvenience caused to you. Let me help you resolve the issue. Please share the details.What is the make and model of your computer?Can you see any error message or error code on the screen?Have you made any changes in the settings prior to the issue?I suggest you to follow the below method to enter into safe modePress the ‘Windows + C’ key on the keyboard.Click on settings, change pc settings and thengeneral.Scroll down to advanced startup, clickrestart now.Click on troubleshoot, advanced options,Startup Settings.Click restart, select safe modeand then press enter.Note: Restart the computer to start in normal mode.I hope the information helps. Please reply with the details and updated status of the issue. We will be happy to assist you accordingly. Thank you. "]},{"symptom":"Error 0x8007005-0x2000A Failed in the SAFE_OS phase when trying to upgrade to Windows 7 to Windows 10        I accidently downloaded and tried to install the 32 bit version. My system is 64 bit.The download\/install goes through the steps until it gets to 27%. I've tried three timesIt stops the install and resets the system back to win7.The error code is \"0x8007005-0x2000A Failed in the SAFE_OS phase with error DuringPREPARE_FIRST_BOOT operation.I have been unable to get the 64 bit option again. It skips past that step.Any help will be appreciated.Tim***Original title: Retrying win10 upgrade from win7***","solutions":["Hi Tim, Thank you for writing to Microsoft Community Forums. I understand your query related to upgrading from Windows 7 to Windows 10. For further clarity on the issue, please respond to the questions below: How are you trying to upgrade the PC?What is the make and model of the PC?Where did you download the ISO from?Did you purchase Windows 10 license? Usually, upgrading from the 32-bit version to the 64-bit version of Windows requires that you reformat your hard disk, install the 64-bit version of Windows, and then reinstall everything else that you had on your device. Refer the article32-bit and 64-bit Windows: Frequently asked questions If you are trying to re-install Windows 10 on the PC and facing issues then I would suggest you to remove all the external devices connected to the PC apart from mouse and keyboard, and then proceed with the installation. You can also try creating a new bootable media and then proceed with the installation of Windows 10. Refer the articleHow to create Windows 10 installation DVD\/USB flash drive Step-by-Step Guide However, if you are trying to upgrade from Windows 7 to Windows 10 and you have a valid license for Windows 10 then you can download the 64-bit ISO file of Windows 10 and then initiate the upgrade to Windows 10. Also, please ensure that Windows 7 service pack one is installed.  I will share the article to perform the upgrade using the ISO file. Refer the articleHow to perform an In-place Upgrade with Windows 10 Step-by-Step Guide Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator","When you use the Media Creation, if you choose the option to download for another system, it should give you the x64 options.  You will have to either let it create a flash drive or download the .iso and do that yourself.  "]},{"symptom":"VGA to USB C hub;        I purchased a Seiko USB 3.0 HUB AND VGA DIESPLAY AND MONITOR ISN'T SHOWING GOOD RESOLUTIONS.","solutions":["What is the model and manufacturer of your PC?Have you tried updating your Graphic Card driver?","Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.You would need to check if your device support display over usb c, not all drives do. I would suggest contacting the manufacturer for details.Regards, Ross"]},{"symptom":"Windows 10 Mail App Need complete Header Information        Hi Everyone,Currently I am using Windows 10 Mail app as my email client. My needs have changed and now I need to see complete Header information. The Windows 10 Mail App does not allow the user the ability to see any Header information. As I see it; if I can respond back to an email using this email client. Then the Sender's IP Address is in there somewhere. Is there a way for me to download another email client like Thunderbird and have it clone my Windows 10 Mail app?This way I can retrieve complete email header data.Thanks,","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.You are correct in saying that you cannot view headers in mail, if you wish to transfer to Thunderbird please see this article for details:https:\/\/support.mozilla.org\/en-US\/kb\/switching-...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Downloading window 7 updates        I receive an error message when I attempt to download new updates. WindowsUpdate_80092004\" is the error message.","solutions":[]},{"symptom":"Feature update to Windows 10, version 1909, \"The Group Policy Client service failed to sign-in. Access Denied\"        Hi, Since the update was installed, my wife's standard account has not been able to successfully log in to my pc. I have also attempted to create a brand new profile, but logging in just returns the user to the login screen. My Admin account works fine.","solutions":["Hi! ChrisSchutte I'm Marvin an Independent Advisor, and I will help you with your issue. Take a look at these pages with helpful information about how to fix your problem, I think this will help you.https:\/\/www.thewindowsclub.com\/fix-group-policy...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. https:\/\/blogs.msdn.microsoft.com\/moiqubal\/2012\/...If you still having problems with this, I will be around to help you. Regards.","Hi Marvin,I get stuck on  step four in your first link. \"4. Now create a multi-string value in the right pane of this location and name it as GPSvcGroup and associate the Value data GPSvc with it. Moving on create a new subkey to the Svchost key (HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Svchost) and name it as GPSvcGroup\"When I rename the key the GPSVCGroup, an error appears saying \"The Registry Editor cannot rename Svchost. Error while renaming key.\"Regarding your second link, I got stuck on step 2.\"2. Move the machine to a workgroup from domain.\"I have no idea how to do this. Perhaps a more detailed explanation might help.Kind regardsChris","It looks like probably you don't have full access in the registry, Take a look at this page about how to gain full permissions to the Registry, I hope this will help you.https:\/\/www.howtogeek.com\/262464\/how-to-gain-fu...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. In the second part, Try to join a domain https:\/\/support.microsoft.com\/en-us\/help\/295017...","Hi Marvin, For some reason, I didn't need to go through the authorization steps when I reattempted the fix.All steps in the first link to create\/update registry keys were completed, however, I get exactly the same error again.I have also performed a windows update on the 3 new patches which were released this week.Please help!","Hi Marvin,Its been over a week since the above post. Can you please reply.","Three weeks have passed and no reply to a query initially raised over a month ago...Nice support Microsoft."]},{"symptom":"need help        I keep receiving this message every time I login into my computer.","solutions":["You will have to find what program is missing, but also what program has left a startup entry behind:How to manage Startup Programs\/applications in 8.1:How to Manage Startup Applications in Windows 8 or 10\"How To Use the System Configuration Tool in Windows 8\/8.1\"http:\/\/www.7tutorials.com\/how-use-system-configuration-tool-all-its-awesomeness\"Using System Configuration (msconfig)\"http:\/\/windows.microsoft.com\/en-us\/windows\/using-system-configuration#1TC=windows-8You can also use this free Program to do that, too:\"Autoruns for Windows\"http:\/\/technet.microsoft.com\/en-us\/sysinternals\/bb963902.aspxCheers.","HI Thanks for your response. My Pc is using windows 10 and I am not sure what I need to do. Please help"]},{"symptom":"Wifi disconnects when internet connection drops        HiI have a Samsung Note 9 which I use as a mobile hotspot When I connect my Surface Pro 6 to the wifi it works absolutely fine. I mostly use it on the train.When the train goes through a long tunnel or area with no signal, the internet connection is lost. Windows senses this and then disconnects from the wifi. How do I stop it doing this?Thanks.","solutions":["Hi ChazaB218 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.1. Press the Windows key type in \"ncpa.cpl\" without quote and press enter. 2. Right-click \"Wi-Fi\" adapter and click properties. 3. Click \"Configure\". 4. Click the \"Power Management\" tab. 5. Uncheck \"Allow the computer to turn off this device to save power\". Make sure you have set \"Connect automatically\" when connecting to your Samsung Note 9.I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Hi ChazaB218 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.1. Press the Windows key type in \"ncpa.cpl\" without quote and press enter. 2. Right-click \"Wi-Fi\" adapter and click properties. 3. Click \"Configure\". 4. Click the \"Power Management\" tab. 5. Uncheck \"Allow the computer to turn off this device to save power\". Make sure you have set \"Connect automatically\" when connecting to your Samsung Note 9.I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! This did not work. There is no \"Power Management\" tab after you click configue, even if you go to it via Device managerThe connect automatically option is already enabled","Hi ChazaB218, 1. Go to \"Regedit\" navigate to HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Power 2. Search for the DWORD \"CsEnabled\". 3. If it's not created yet, you have to create a new DWORD key named CsEnabled and set the value to 0.4. Restart the PC. Once you re-open the device properties you should see the Power Management if that device supports it.Thanks!"]},{"symptom":"What is this folder previously reported by Windows Defender? Should I leave it there or delete it?        Hello,Some weeks ago, Windows Defender on my Windows 10 PC reported a threat as shown in the below screenshot.Now, on my PC, there remains the folder: C:\\Program Files (x86)\\ASK, in which there is a file named \"480707101.exe.config\".  I googled but couldn't find anything about either the \"ASK\" (not ASK.com) folder or the only file inside it.  What could this folder be used for? Should I leave it or delete it?Thanks in advance for any help.","solutions":["Hi Kenneth, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.The executable file i.e. malware was removed by Windows. In actual the config file won't do anything so keeping it or removing it doesn't pose a difference.I believe you won't be able to remove \\ASK folder but the file inside would be deleted.Folders in the program files directory are protected by the system to prevent bricking.I hope that helps.","Thanks Sumit for the prompt help.Was the folder created by the threat\/malware itself? Or, did it exist previously and was simply used by the malware when it landed on my PC?If the folder was actually created by the malware, there is no point to keep it.  Is it because it is located in the Program Files (x86) folder that I won't be able to delete it? Is there a way to do it?Also, after I did a full scan, I now cannot find the record anymore in the protection history in \"Virus & Threat Protection\".  Has it been removed completely from my PC without leaving anything in quarantine?",">>Was the folder created by the threat\/malware itself? Or, did it exist previously and was simply used by the malware when it landed on my PC?I honestly cannot say because I did not develop the malware :) But it is extremely likely. >> Is it because it is located in the Program Files (x86) folder that I won't be able to delete it? Is there a way to do it?Yes. If you want to delete it you would probably need to take ownership of the folder.https:\/\/www.tenforums.com\/tutorials\/3587-change...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads."]},{"symptom":"Windows 7 install on new laptop hard drive        I am having to replace hard drive on older dell laptop. I do not have a recovery disk or product activation key. How can I transfer Windows 7 onto the new hard drive?","solutions":["Look in the battery compartment for the product key.You don't say why you are replacing the hard drive; but if it is  problematic, there is not much point cloning the OS to a new hard drive.@@@@@@@@@@@@@@@@@@@@@@@@Save all your data and reinstall programs.You can borrow the exact same edition of Windows 7 Retail DVD and use your Product Key on the COA sticker to reinstall the operating system.@@@@@@@@@@@@@@@@@@@@@@@@@Or you can use this for preinstalled OEM or Retail Licenses. This is on a first come, first served monthly basis.Download the correct ISO file and make your own disk and use the Product Key that is on the COA Sticker. This is on a first come, first served weekly basis.https:\/\/www.heidoc.net\/joomla\/technology-science\/microsoft\/67-microsoft-windows-and-office-iso-download-toolDownload: Windows ISO Downloader.exeAnd here are instructions on how to burn ISO images to disk:http:\/\/www.snapfiles.com\/get\/ISORecorder.htmlYou change the Boot Order in the BIOS to be able to boot from your installation media:How to Boot Your Computer From a Disc or USB DriveHow to access Boot Menu:https:\/\/neosmart.net\/wiki\/boot-usb-drive\/Then do a clean install:http:\/\/www.sevenforums.com\/tutorials\/1649-clean-install-windows-7-a.htmlThe COA sticker is either on the underside of the Laptop or in the Battery Compartment.With a Desktop it is either on the side, rear or top of the Computer Case.Using the downloaded ISO file Method may require phone Activation.It may require that you use phone Activation.\"How to Activate Windows 7 by Phone\"http:\/\/www.sevenforums.com\/tutorials\/18715-activate-windows-7-phone.htmlThe above method also will require you to go to your Computer Manufacturer's website > Support and Downloads Section > locate your Model Number and Operating System > then download and install the latest Drivers for it. ________________________________________________Using the USB method in conjunction with the above Windows 7 download:http:\/\/www.sevenforums.com\/tutorials\/2432-usb-windows-7-installation-key-drive-create.html\"How to Get and Use the Windows 7 USB\/DVD Download Tool\"http:\/\/www.sevenforums.com\/tutorials\/31541-windows-7-usb-dvd-download-tool.html________________________________________________And this is very good and easy to use:Rufus - Create bootable USB drives the easy wayCheers.","Good news.  I have been doing this on Dell computers for years.  Have done hundreds.  As long as you use an install disk for the same edition of Windows 7 (home, pro, etc) and bitness (32 or 64) as the original install, you will NOT be asked to activate.  It will automatically activate all by itself.  Put another way, you do not need to know the Microsoft Product Key.You cannot \"transfer\" Windows 7.  You will need to do a complete \"custom\" install.  I have a posting of a detailed procedure that you can follow.  If you have further question, just ask.https:\/\/www.askwoody.com\/2019\/canadian-tech-how-to-rebuild-a-win7-system-with-minimal-snooping\/The hard drive itself is easy to replace.  Cost should be under $100.  Go to https:\/\/www.dell.com\/support\/home\/ca\/en\/cadhs1\/ to find the manual.  Put in your Dell Service Tag and you will find a very detailed manual with pictures.  Find the section on hard drive replacement."]},{"symptom":"product key        I have windows 10 pro and myproduct key won't verify , help me please. ","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,What error message are you receiving when inserting your product key? Is this the first time you will be using the product key on your system? Is there any software or hardware changes on the device? First, I'd recommend checking the current state of the license of the device 1. Open start menu and open command prompt with admin permission 2. Execute this command slmgr \/dlv 3. Take a screenshot of the window and attach it on your next reply.","hey Mr. Gary thank you for helping meyes its my first time using my product key and no I did not make any changes my laptop is new I bought it 7 months ago .when I insert my product key it gives error and that I'm in the wrong category.can you please explain what should I do  when the command prompt page appears. please excuse my English it's not my first language.","Once you open command prompt with admin permission type in slmgr \/dlv then hit enter. This will open a window regarding the current license on your computer. Please take a screenshot of it then show it to us so that we can provide the information of your system's current license.You may refer to this post https:\/\/answers.microsoft.com\/en-us\/windows\/for...Also, is your product key compatible with the current system's edition? For example, windows 10 pro requires a windows 10 pro product key.","yes on the sticker it says windows 10 pro ","Thank you for the attachment Rawa. Normally, new computers are issued with digital licenses by the manufacturers unless retailers themselves issues a unique product key for the device.As per checking the attachment it seems that what you have here is a volume license key. These product keys are mainly used by large companies or organization that is being used by hundreds and thousands of computer on a network. Therefore, it would seem that your system is trying to look for the organization's network which the product key has been issued with.Unlike a full retail version product key, these are unique product keys that has transfer rights. I'd recommend to considerobtaining a full retail license as these are secured keys for whenever you plan on upgrading your device or plan to transfer your licenseon a different hardware.","Thank you for the explanation I did get what you are talking about but can you please tell me what should I do like should I connect the guy who uploaded the apps on my pc or the company or what? ","Hi Rawa, Yes. It is most advisable to reach the retailer who has issued you the license that has connection with a company or an organization.","thank you so much for your time sir.","My pleasure Rawa! I'm very happy to have helped you today. :)"]},{"symptom":"upgrade from WIN 7 to WIN 10 failure        getting the error \"failed in SECOND BOOT, MIGRATING DATA step\" when trying to upgrade from WIN 7 to WIN 10.  any idesa on how to fix.","solutions":["getting the error \"failed in SECOND BOOT, MIGRATING DATA step\" when trying to upgrade from WIN 7 to WIN 10.  any idesa on how to fix.Officially the Free Upgrade from Windows 7 to Windows 10 ended July 31, 2016. However there are many Computer Tech Sites on the web that tell you how to still get it for free. As this forum is monitored & supported by Microsoft I will not mention those sites. Google or Bing search is your friend. You might also try updating your Drivers.","Do you have a copy of the latest Windows 10 install media that you are using, or are you attempting to do this online without first downloading Windows 10? Here is a link to where you can download the current ISO file using the Media Creation Tool, or you can have the Tool install it to an empty 8-32GB size USB stick.https:\/\/www.microsoft.com\/en-us\/software-download\/windows10ISO\/You could try running Disk Management and post an image here of what your hard drive partitions look like.If you don't have a utility that lets you mount a downloaded ISO file, so that you can just run setup.exe to upgrade, you can use something like 7-Zip to copy the contents of the official install media to a folder and then run setup.exe from there (from within your running Windows 7).Also, doing a clean boot before you attempt the upgrade again might help:run msconfig and disable all non-Microsoft Servicesyou can check a box to hide the Microsoft Services, to make it easier to disable all the restrun Task Manager and disable all items shown on the Startup tabrestart Windows","While getting this without real booted OS. Really while migration data as the message tells you!Look at the path C:\\$Windows.~WS\\Sources\\Panther and open the setuperr.log file and may get logs as as I have from a 1809 to 190x migration:2020-01-02 12:19:55, Error                 SP     CFinalizeCriticalBoundary::DoExecute: Cannot create hardlink betweeen C:\\$WINDOWS.~BT\\Sources\\SetupPlatform.exe and C:\\WINDOWS\\System32\\OOBE\\SetupPlatform\\SetupPlatform.exe. Error: 0x000000b7[gle=0x000000b7]2020-01-02 12:19:55, Error                 SP     CFinalizeCriticalBoundary::DoExecute: Rollback in system context will not be registered.[gle=0x000000b7]And post the main culprit lines here... May test with an earlier OS build than 1903 :DHp","Hi Richard,The Windows Insider Program forum is just for discussing preview builds of Windows 10, so I am moving your post to the public forum.","You might start with the link below.  Download and run the setupdiag.exe utility and copy and paste the results.  Other logs may be helpful if we don't get an answer from the setupdiag utility.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/setupdiagYou can also check the page for a link to possible log files available and their locations.","@JohnthePilotHe likes to migrate from Win 7 to Win 10 (Version not given, hopefully a preview) so it's a Win 10issue.Hp","@SaltgrassDid the SetupDiag (latest Version) and tells only that Error: Found system boot failure.Last Phase: FirstBoot,End.BootLogErrorCount: 11LastErrorEvent: 80LastErrorCode: 1076887574Last Setup Phase:Phase Name: Post First Boot Phase Started: 1\/2\/2020 1:21:21 PM Phase Ended: 1\/2\/2020 1:24:19 PM Phase Time Delta: 00:02:58 Completed Successfully? TrueLast Setup Operation:Operation Name: Ensure suspended services are stopped Operation Started: 1\/2\/2020 1:24:19 PM Operation Ended: 1\/1\/0001 12:00:00 AM Operation Time Delta: 0:00:00:00.0000000 Completed Successfully? FalseThe details-error log (as give) shows other picture :DHp ","Yes, it's a Windows 10 problem, but it is not a Windows Insider problem. The Insider forum only discusses preview builds of Windows 10. It is not a general Help forum.","@JohnthePilotWell, as my first message: Rings me a bell... about second boot at 61% unknown terminationWhile suggested to original first question in mind, to look at the specific log file!This means, I had this issue too installing an Insider Build after 1809, and remains for 1903 & 1909.Also means for me, this issue is still in latest insider\/preview build(s) and not\/never has been fixed! Also cannot install any insider (is blocked by the GUI), while have to upgrade to a newer build as 1903\/1909 at first.Currently we are waiting for the log details (as I pointed out) of the Win7 to xxxx insider migration!","Hi,Let us check the Installation log to find why the update failed. Please share the logs as mentioned in this article. You should use a File sharing service like Onedrive or Media Fire to upload files and share the link in the next reply.https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/troubleshoot-feature-update-install-failures\/eaf4ff24-64d6-4c72-824c-3ba3df716fc3The Panther logs. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\Panther"]},{"symptom":"Microsoft Print to PDF File Date        Since the start of the new year, any time that I utilize the Microsoft Print to PDF printer option that can be located on my Windows 10 desktop, the time that the PDF is produced shows 1\/1\/2000 with whatever time after 00:00 AM (based upon the first time the process is used on the computer). I'd assume this is some sort of glitch in the hardware that was caused when we went from 2019 to 2020, but this is simply an assumption as I don't know enough about how computers work on a technical level to confirm this to be so. Regardless, how do I fix it so that the printer will accurately show the date and time that a file has been produced when using the Microsoft Print to PDF function? To give a little more information: The date and time on the computer is correct, and all other file creation processes (such saving docs via office, or downloading pdfs from an email or website) produce the accurate date and time when saved. I have only noticed this with the \"Microsoft Print to PDF\" printer function via Windows 10.Also to add to it, there are other computers on the same network (that share files with one another via a shared network) that are also dealing with the same issue when using the function.Any ideas on how to correct this would be helpful. Thanks in Advance! ","solutions":[]}]}