{"windows":[{"symptom":"Windows Hello Face        Hi,I have a PC running on windows10 home and i have an integrated webcam. I have set up hello pin, the webcam is working perfectly but i am not able to setup windows hello face. Pls help me","solutions":["Hi Dhyan. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See possible fixes here: https:\/\/answers.microsoft.com\/en-us\/surface\/for...https:\/\/www.tenforums.com\/tutorials\/102313-turn...https:\/\/windows10skill.com\/windows-hello-not-wo...1) Turn off Fast Startup: Go to Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change settings that are unavailable > uncheck Fast Startup.2) Reset Facial Recognition and\/or Fingerprint Options https:\/\/blog.goptg.com\/how-to-reset-windows-hel...3) Modify Group Policy Settings (for Pro version only) Updates might have modified some of the crucial settings of Group Policy. Therefore, we would recommend to launch the Group Policy Editor and check\/edit the settings related to Windows Hello functionality.Pres Windows key, type gpedit, and press Enter. Click on Computer Configuration and open Administrative Templates. Select Windows Components and open Biometrics. Click on Facial Features and right-click on Configure enhanced anti-spoofing option.Select Edit and disable the Configure enhanced anti-spoofing feature. Reboot your PC. 4) Update drivers If some of the system drivers, most probably webcam and fingerprint reader drivers, were corrupted during the version upgrade process, Windows Hello may fail to perform. To fix that, try to update the corresponding drivers:Right-click on Windows key and select Device Manager. Locate the Hello, webcam, and fingerprint drivers individually and right-click on each of them.Select Remove driver software and wait for the removal to be finished. Repeat the removal with all Windows Hello related drivers and then reboot your PC.Once done, open Device Manager, click Action -> Scan for hardware changes. The system should automatically detect and reinstall the drivers. 5) If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool as shown here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... 6) If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....7) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 8) Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.9) If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... ________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"System  unable to start a new porocess after \"inactivity\" time        Hello,I run a program I designed myself. The program is written in java and originally designed for linux. It works by listening to the internal microphone and depending on some sound conditions, it starts an external exe. The program worked perfectly on linux. It works as well on windows, with a little difference. In fact, it can work for a long time and the only interactions with the user come from the microphone. So when the program is started, everything works well, but after some time, obviously because no user is using the keyboard or the touchpad, windows starts executing background tasks. Theses tasks create a very heavy disk load so that starting the external exe (this lasts normally less than one second) can take up to one minute, making the program unusable. The main process using the disk is named System. I found two workarounds. The first one is to move the cursor with the touchpad from time to time. In this case, the windows background processes do not start and everything works. I changed as well my program in order to simulate an user activity. I simulated pressing and depressing the shift key  (by using the Robot class of Java). This seems to be efficient too.Is there a way to control these background windows activity or workload of the system, in order to let application programs start with decent performances, even when the user does not use the keyboard or the touchpad ?Thanks for your help.Marc.","solutions":[]},{"symptom":"Windows Media Player 12 on Windows 10 Home        Have an irksome little issue that I'm wondering about concerning Media Player.  I was doing some housekeeping of music files in my Media Player library, downloaded songs and some tracks that I'd slapped together myself, entering song details etc., and in the middle of doing this, MP stopped allowing me to add pictures to the \"album art\" thumbnail in the songs' entry in the MP library.  Usually, you can right-click on the thumb for the track\/album (which is blank if it's a custom track) and will have the option to \"paste album art\" listed among others.  Well, that option just disappeared, even if I'd already copied a pic I wanted to use and had it waiting on deck in the clipboard, no joy.  As I said, I was in the middle of updating tracks' info and had already done this very thing for a couple of songs.  I didn't change any settings for MP - I don't know what happened.  Any theories?","solutions":["Hi Pan. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything that works to fix Windows Media Player. Please try all steps that apply. I'll be standing by to help you if needed.Download and run WMP Library troubleshooter from Microsoft: http:\/\/aka.ms\/diag_wmpl10You may need to install WMP from Settings > Apps > Apps & Features > Optional Feature > Add a Feature, add WMP here.Other WMP troubleshooting fixes for adding album art issues: https:\/\/windowsreport.com\/windows-media-player-... (avoid ad links)https:\/\/www.lifewire.com\/manually-add-music-alb...https:\/\/www.lifewire.com\/add-album-art-in-windo...https:\/\/www.lifewire.com\/repair-a-corrupt-wmp-d...https:\/\/superuser.com\/questions\/579519\/windows-...https:\/\/www.thewindowsclub.com\/windows-media-pl...https:\/\/www.lifewire.com\/troubleshooting-tips-f...https:\/\/www.kapilarya.com\/fix-problems-with-win...https:\/\/www.howtogeek.com\/howto\/26107\/how-to-re...http:\/\/m.majorgeeks.com\/content\/page\/how_to_tro...Try reinstalling Windows Media Player: Type Features in Start Search, open Turn Windows Features On or Off, under Media Features, uncheck Windows Media Player, click OK. Restart PC, then reverse the process to check WMP, OK, restart again to reinstall it.If it's not present then type Features in search box, choose Manage Optional Features, then if not in list to those to add choose Add a Feature to add it.Try VLC Media Player from here: http:\/\/www.videolan.org\/vlc\/index.html Try Movies & TV app which comes built-in Windows 10. I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Security Intelligence Update for Windows Defender Antivirus - KB2267602 (Version 1.307.2208.0) - Error 0x80248007        Windows update on Server 2016 is not working for many  weeks now!The reason for it is - it fails with error on the KB2267602 and I found no way to bypass it.I tried applying the procedure suggested in \"https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/security-intelligence-update-for-windows-defender\/deb9f8cb-2159-4674-b5ed-0d25be93b5be\" which didn't work out.","solutions":["Hi Isaac I am sorry, Community is just a consumer forum, due to the scope of your question (Server 2016) can you please post this question to our sister forum on TechNet in the Server 2016 section (linked below)Over there you will have access to a host of Server 2016 experts and will get a knowledgeable and quick answer to this question . ..https:\/\/social.technet.microsoft.com\/Forums\/en-..."]},{"symptom":"Is high performance a safe , smooth or will it harm pc slowly        I have bought recently a mid core new gaming pc of i3 9100f , ram 2x 16gb ddr4 crossair , GTX 1050ti  OC edition,, 240 or 250 somewhat SSD windows10 home,, it's my side notes only about my specifications but my main question is does it kills pc slowly over time I mean it gives constant max performance,, huge stress over the cpu ,, will it still be safe to operate in high performance mode or should I jump back to Balanced performance mode plz plz reply _\/\\_ I want to know ","solutions":["Hello SomadityaSohini, Running your pc in high performance mode will not harm it. You cpu will not be running at full speed constantly it will still perform as intended. This just allows your computer to be used to its max capacity whenever it needs to be."]},{"symptom":"Bluetooth Driver Dissapears and Reapears        My bluetooth driver keeps disconecting and reconnecting. My computer says its failing to start and giving me a error code of 411, then it stopped giving me the code and it keeps disconecting itself after 1 seconed and coming back the next.","solutions":["Hey Red. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give all possible steps for troubleshooting Bluetooth in order of priority, so even if you've tried them please do it over in sequence. Many problems right now are being solved by updating to the latest version so if you want to skip to that step see the Repair Install at bottom: Try Updating the Bluetooth driver from the PC maker's Support Downloads webpage for your exact model. Install it even if it's the same or newer than the one in Device Manager reached by right clicking the Start button.Right click Start button to access Device Manager, locate Bluetooth device (if necessary from View tab Show Hidden Devices), on Driver tab see if Roll Back is available, if not try Update Driver, first automatically, then Browse, then Let Me Pick to try all previously installed Drivers. If these fail Uninstall the Driver, restart PC to reinstall. If the BT driver is not there, access the View tab in Device Manager to \"Show Hidden Devices.\"Make sure you're pairing correctly as shown here: https:\/\/support.microsoft.com\/en-us\/help\/15290\/... See Fixes here which are all working: https:\/\/support.microsoft.com\/en-us\/help\/14169\/...https:\/\/superuser.com\/questions\/1017867\/make-wi...https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/www.lifewire.com\/fix-windows-10-bluetoo...Try the Bluetooth troubleshooter at Settings > Update & Security > Troubleshoot. Try turning off Fast Startup at Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change settings that are unavailable > uncheck Fast Startup.If this is a mic or headset right click Volume icon in System Tray to Open Sound Settings, make sure the correct device is selected for input or output in the dropdown menu.Then try pairing again, if necessary run the Bluetooth Troubleshooter again. If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....If you think the BT adapter has failed, you can replace it easily with a USB nano adapter like this one:https:\/\/www.amazon.com\/ZEXMTE-Bluetooth-Receive... Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1909 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"No devices nor touchscreen work after uninstalling that microsoft extensible driver thing        so I've been having problems putting my computer to sleep for the past few days, so today i tried using powercfg -lastwake in the command console and it said the device that was causing it to wake up was something along the lines of \"intel 3.0 extensible driver host microsoft\". i looked it up, and it seemed safe to uninstall. so i uninstall it and my keyboard,  mouse, and somehow even the touchscreen stopped working. is there a way to fix this? ","solutions":["nevermind, the problem fixed itself when it automatically went to sleep and i turned it back on. ","Hi Attacker3000Person That device is the USB Port device driver on your PC . . . Intel no longer provide a driver for that device, it has been discontinued, the best option is to go to the support page for your PC on the manufacturers website, then from there, download and install the Intel 3.0 extensible Host driver they recommend . . . If you have any difficulty locating that support page, what is the Make and exact Model No. of your PC - that will be printed on a sticker on the bottom casing . . ."]},{"symptom":"Latest Windows Update has made my brightness slider\/function disappear. (Literally can't change brightness from 100%)        I just got home to my computer laptop having been updated. I went to adjust the brightness, but I do not have any form of brightness control.The add-on to the ease of access bar is non-existent. When I go to \"edit ease of access bar\" there is NO option to add the brightness slider or otherwise, it's gone. There is no brightness slider on the ease of access bar either, or in settings. My night light function does not work either. I can toggle the night light function, but the screen stays very blue-light at a very 100% brightness level. Help.Edit: I feel it necessary to mention I have double-checked my update went through properly by checking for updates of any kind, but I'm all good to go. I can't seem to find anyone else with this problem either. ","solutions":["Hi RUN. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Guardian Moderator here to help you.There are changes in Brightness settings as of Version 1903, with sliders now only in Settings > System > Display and in the Action Center via Windows (flag) key + A.See fixes for brightness controls not working: https:\/\/fossbytes.com\/how-to-fix-windows-10-bri...https:\/\/www.kapilarya.com\/fix-cant-change-scree...https:\/\/www.tenforums.com\/tutorials\/44213-adjus...https:\/\/www.trickyways.com\/2019\/06\/fix-screen-b...https:\/\/windows101tricks.com\/windows-10-brightn...If nothing else works then do a Repair Install, by installing Media Creation Tool and then choosing to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... If you want you can wait a few more days for the new version to be released into Media Creation Tool then you can use it to do the Repair Install also bringing you up to the latest version by the most stable method. Watch for the MCT to change the version listed at top here: http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... UPDATE: You can download and run the 1909 ISO from https:\/\/tb.rg-adguard.net\/public.php. Double click to Mount ISO, right click to Run Setup.Many appreciated previously having Sliders also in the Power Plan settings which could be set separately for Plugged In and on Battery. If you're wanting this feature back you can express your opinion on this to Microsoft via the Feedback Hub app in Start Menu, where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems.If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to rate my post, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi! Bad news for my((My surface 3 pro work on Win 10 pro 1909, and i have same issue whith britness and, alsa, power button (not working when i press once, but shud turn of the screen).Any idea?","I have same problem all brightness control gone","me too, updated my laptop i can still change the brightness and then when about 36 hours passed my shortcut keys to adjust the brightness didn't work anymore. I even search every possible war to change it, but it still didn't work","fixture, but not sollution (Surface 3 Pro, whith DockStation(!) and external Monitor(!!)):TLDR:   You need reinstall windows and don't reboot it :-)Long:1. I reinstall Windows 10 to \"Factory Default\" state. Use this instruction and links in video: https:\/\/youtu.be\/w4Z2Kof82E0 (not my video);  1.1 Install All soft (Office, Telegram, etc.)\"Factory Default\" windows very old (1505 build mayby), and don't update through WindowsUpdate automatic system.2. Upgrude Windows to build 1909 from https:\/\/www.microsoft.com\/software-download\/windows10  2.1 When updating, i have issue whith Realtek USB 3.0 CardDriver - uncompiteble device. I solve this by uninstall driver and delete this device.  2.2 After update -  brightness work fine.   2.3 Updeting work fine.  2.4 Realtek USB 3.0 CardDriver installed and work fine   But.....After one day after thet brightnees again disabling. =(Deleting Updates (only two can be deleted) nothing results.I Repeat all actions(reinstall) and finde, that the brightness disabling after rebooting Surface, when they connected to DockStation.P.S. Now I testing this variant: Reinstall Windows, Disable all updates, Reboting Surface on dock station. After 3-4 days - i update this post"]},{"symptom":"WIndows 10 Blue screen error, ive tried all possible options, nothings worked,        At this point, im going to be forced to sell my laptop, ive done everything possible to stop blue screening. Did clean installs of windows, wiped the drives, replaced the motherboard, updated all drivers, ran memory tests, scanned for viruses, checked all hardware by tech shops, and nothing has fixed it. Reinstalling windows does nothing as the blue screen comes back within 3 days. I only get blue screen on boot, not while gaming or browsing the internet. I have seen the errors. It's always MEMORY_MANAGEMENT_ERROR, CRITICAL PROCESS DIED, SYSTEM THREAD EXCEPTION NOT HANDLED, pretty much all of them. Recently had it get to the point where it said to send in my computer to be repaired because it would no longer get past the blue screen. I like windows 10, I really do, but when I sink in over $2000 for a laptop that starts having issues right after warranty expires, is total bs, I even spent an extra $1000 to replace the motherboard, it didn't help at all. So what am I supposed to do at this point? ive done all system scans and everything, nothing pops up. Like I said in the intro, ive had both hard drives checked and stress tested, no issues come back. I'm at a loss now, I've done everything possible to save this computer, and I refuse to sink more money into it, for it clearly being a windows issue.","solutions":["Hi Eminent. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Did you run the bootable Memtest86 which is the only fully reliable test? Test the RAM overnight to stress it with the best bootable test memtest86, following this guide to test both sticks and slots:https:\/\/www.wikihow.com\/Test-PC-RAM-with-MemTest86Run Crucial System Scanner to check the RAM is properly spec'd and configured: https:\/\/www.crucial.com\/usa\/en\/systemscanner?cm... If that doesn't explain it then Prepare and submit the BSOD crash report back here for a BSOD expert's analysis following these steps:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","here is the bsodhttps:\/\/drive.google.com\/open?id=1qKjohG5SP7j37F7agF48hJIga5KnWrLg","post here right?","Yes, I've asked the best analysts to read your crash file here. Stand by.","Hi Eminent Analysis of your minidump file just indicates Memory (RAM) corruption cause by the Edge browser, it does not specifically indicate a specific device driver, which is what we would expect to see . . .Do you have any more minidump files that we could take a look at and try to narrow this down for you?.","Hi Eminent Analysis of your minidump file just indicates Memory (RAM) corruption cause by the Edge browser, it does not specifically indicate a specific device driver, which is what we would expect to see . . .Do you have any more minidump files that we could take a look at and try to narrow this down for you?.Sorry I dont have any right now besides this mini dump, this happened 3 days after I installed windows on a boot up","Hi Eminent If\/when your system crashes again, please upload any newly created minidump files and I will be here to analyze those for you, until we find the underlying problem . . .","Hi Eminent If\/when your system crashes again, please upload any newly created minidump files and I will be here to analyze those for you, until we find the underlying problem . . .Here you go, yet another bsod, just happened today at 12:50pmhttps:\/\/drive.google.com\/open?id=1SisVoAn1YTurShvH2fdD_Jx5n1JunUH_","Hope you guys can find the issue","My computer keeps telling me that I have a bad system and it keeps crashing how do i fix this"]},{"symptom":"Receiving Blue Screen error due to an application        Mọi người ơi máy của e bị màn hình xanh do cài đặt phần mềm đóng băng có tên là Time Feeze,khi bật máy lên màn hình cứ đứng im như vậy khởi động lại bao nhiêu lần cũng vậy ạ.Ai có biết cách sửa thì giúp e với!{Translation into English:Everybody's got a blue screen due to the installation of the freezing software called Time Feeze, when you turn on the computer on the screen keep it rebooted so many times so ạ.Ai know how to fix then help E!}***Modified title from: got a blue screen due to the installation of the freezing software called Time Feeze***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I see that you are looking for Vietnamese language support. I would like to inform that you have reached the English support forum. For better clarity, we would appreciate if you could post your query in English. However, upon translating your query, I see that you are receiving a Blue Screen error after installing a software. Since you are unable to boot the computer, I would suggest you to refer the steps mentioned below: I would suggest you to boot the computer into safe mode and check if the PC is crashing. Safe Mode will boot the computer with minimum set of drivers and services that requires the computer to boot. If the PC boots into Safe Mode, we can perform a clean boot on the computer and then uninstall the software.  Performing a clean boot will start the computer with minimal set of drivers and programs, to determine whether a background program is causing the issue. Some of the Startup programs will not load after performing a clean boot on the computer. However, that functionality will return when you reset the computer to start normally after finishing the troubleshooting. To perform a clean boot on the computer refer to the article How to perform a clean boot in Windows.  If the PC doesn’t crash is Clean boot, refer the steps to uninstall the program: Press Windows Logo key + R, to openRun dialog box.Type appwiz.cpl and click on OK.Look for the program that was installed, right click on it and selectUninstall. Once the program is uninstalled, refer the steps in the section Reset the computer to start normally after clean boot troubleshooting, and monitor the computer. If the PC still crashes after uninstalling the program, I would suggest you to share the dump files so that we can analyze them and get to the root cause of the issue. To share the files Navigate toC:\\Windows\\Minidump, upload the files to OneDrive and share the OneDrive link. For more information, see Troubleshoot blue screen errors.  You may also want to get in touch with our Live Technical Support team by calling them. Please refer the articleGlobal Customer Service phone numbers to get the Customer support number as per your country. Let us know how it goes. Regards,Nikhar KhareMicrosoft Community - Moderator","I downloaded the software that freezes the hard drive called Time Freeze and then I used this software to freeze the C drive, after freezing the C drive I rebooted the computer and got a blue screen, I didn't  I cannot access the Windows Safe Boot and I also use USB to reinstall Windows, but due to the Free Freeze Freezing software that has lost hard drive C, it is impossible to reinstall Windows nor access the Drive.  disk C to delete Time Freeze software data and now I do not know what to do","Hi, Thank you for replying. As per the error message in the screenshot, the “Bad_System_Config_Info” error means that something is wrong with the registry on your PC and you'll need to return to a previous configuration. I would suggest you to refer the steps mentioned in the article Error 0x74: Bad_system_config_info and see if that helps. Note: The last step in the above article talks about performing a reset on the computer. Resetting the computer will delete all the files and applications from the computer. Do not perform reset on your computer. Let us know how it goes. Regards,Nikhar KhareMicrosoft Community - Moderator","Mọi người ơi máy của e bị màn hình xanh do cài đặt phần mềm đóng băng có tên là Time Feeze,khi bật máy lên màn hình cứ đứng im như vậy khởi động lại bao nhiêu lần cũng vậy ạ.Ai có biết cách sửa thì giúp e với!{Translation into English:Everybody's got a blue screen due to the installation of the freezing software called Time Feeze, when you turn on the computer on the screen keep it rebooted so many times so ạ.Ai know how to fix then help E!}***Modified title from: got a blue screen due to the installation of the freezing software called Time Feeze***"]},{"symptom":"Activate windows 8.1 Pro        Hello, recently my old laptop broke and won't work, it had a legit Windows 8 license on it, yesterday I was fixing my sister's laptop and noticed she was using an unactivated Windows 8.1 Pro, I wanted to ask if it was possible if I were to find my old product key, can I use it to activate windows on her laptop since I am not using that license anymore (bought a new laptop with a Windows 10 license), or is it impossible?","solutions":["You do not tell us what type of License you have.If the Laptop\/Computer came with the Windows Operating System preinstalled (Dell, HP, Acer, etc) , that Product Key that came with the Laptop\/Computer is for the preinstalled OEM Licenseand is non-transferable.The OEM License\/Product Key (preinstalled Operating Systems on Dell, HP, etc machines) is tied to the first machine it is installed on and dies when that machine dies.The above rule also applies to OEM System Builders Licenses.Retail Operating System License, that you buy and install yourself, are allowed to be transferred to another machine.But Retail Licenses can also only be installed on one machine at any particular time."]},{"symptom":"IPV4 Checksum Disabled        Hi,My organization has an issue with the \"No internet\" notification but able to surf the internet smoothly. But there's one problem, whenever im trying to open outlook, it won't detect our MFA and it will say, \"you're not connected to a network\". that includes our Teams, Skype and any other application that requires MFA. i fixed this issue by turning off the IPV4 Checksum.My question is1. How does the IPV4 checksum relates to the \"no internet\" notification issue?2. How does the Windows 10 OS detects whether there's internet or not?3. Does it have anything to do with our organization GPO? Is there such GPO that might conflict with the IPV4 Checksum?Regards,IzzatDesktop Support Engineer","solutions":["Hi Izzat, I am an independent advisor and a Microsoft user like you, and I would be happy to assist.These forums are geared mostly toward consumer questions - we would recommend posting on Microsoft TechNet for these types of questions:https:\/\/social.technet.microsoft.com\/Forums\/en-...You will likely find people more familiar with these more technical questions over at TechNet :)I hope this has helped you. Regards, and have a great day! -Ashton"]},{"symptom":"Can't connect to the Minecraft world of my friend on PS4        So basically, since it is now possible to crossplay with PS4 and all other Bedrock platforms, my friend on PS4 got really excited, and wanted to try it out with me (I am on Windows 10 Edition). So he did what he was suppost to, created a microsoft account, linked it, added me as a friend, I accepted. All that went really well. After he created a world that had multiplayer on, I could see him in the \"Friends\" tab, 1\/8 players on the server. I tried to click it and join. It was loading for a bit. It said \"Connecting to Multiplayer\" or something like that, and after a while, \"Can't connect to world\".Any help?","solutions":["I've been having the same problem, except it's ps4 trying to connect to ps4. My friend and I have a world but with the update, it won't work. We can only play if we convert out world to before the server. I think it's just a problem with the update and ps4? ","I am currently having the same issue right now, me and my friend both on ps4 but unable to connect with each other. Have you found a  fix for this yet?","I am having the same on ps4 trying to connect to other ps4 worlds. All my other friends can join each other with the new update but i have been unable to join. Me and my friend went to the old version and i joined right away. Must be something with the update? If there is a fix please let me know! ","Me too its so annoying all my friends can play and they all think its my fault. I bought playstation plus just to play and now i cant even play with anyone","Microsoft legit needs to fix this","Same problem, its saying unable to connect.","Has anyone found a solution to this PS4-Xbox cross platform issue yet? I read somewhere that it is related to the NAT Type, but I can't expect all my Xbox friends to change their router settings just for this purpose... So frustrating.","Its still not working for me. I can join other psn friends but my other friend on playstation cant join me ","My friend and I are both on ps4, with the same version of minecraft, and both have Microsoft accounts and everything, and we still cant join each other's worlds, I'm so frustrated ","Go into your storage, delete the saved data for minecraft and try log in again, worked for me man."]},{"symptom":"Old Wifi Router: NetGear WNR2000-100NAS        Is there a way to make this work with Windows 10? Changing settings, perhaps? If not, please recommend a small router for an apartment. Barely 500 sq ft.","solutions":["Hi DeborahNYC, there should be no reason you can't continue to use that router. it should be simply a matter of selecting the network (click the wireless icon by the clock) and entering the network keyis windows not able to see the network? or are you having problems connecting to it? are other devices able to connect to the network? if you can give me a bit of detail about the problem you experience when trying to use this router, i will help you sort it.","I would not use that router. It's last firmware update was in 2011. It's no longer safe,You should be able to use a router from any of the major brands. Here's what to look for:802.11acAC750 or AC1200The first specification is the current wireless technology, which you'll find in virtually every router today.The second specification tells you how fast the router is. In truth, that specification has little meaning, but manufacturers use it to categorize routers. A router that is between AC750 and AC1200 is all you need for an apartment that size.This is not a good place to learn how to buy a router. There's a lot to know.Two to consider - both from ASUS: RT-AC51U and RT-AC56U.You'll also need a wireless adapter for your computer.","I don't know about that router but if you decide to get a new one make sure it will do the job you need it to do. How many devices do you have that would connect to the router? The new wi-fi is wi-fi 6 or 802.11ax. Do you have anything with that on it? Do you stream movies, music, TV shows etc.?Since I have several (18) devices that use my router I have a Linksys with MU-MIMO, Multi user-Multi Input Multi Output. The router you need depends on what you want to use it for and how many devices you will have connected.https:\/\/www.netgear.com\/landings\/best-wifi\/?cid=us-best-wifi6-srch-cpc&utm_source=search&utm_medium=cpc&utm_campaign=us-best-wifi6-srch-cpc&gclid=CjwKCAiApOvwBRBUEiwAcZGdGG7RI08DoQI31aghfkGROSbKJxxkTF8p6ajXG9GFMoAULycto-oPkBoCSkMQAvD_BwE","Thank you so much for your response. The issue is that the Wi-Fi seems to drop almost every time computer sleeps or shuts down. It has to reconnected. Windows is able to see the router. I have run the troubleshooter many times. And I kept seeing \"default gateway not available\". And then after that it would say fixed. Use the computer a little bit. Take a break. And Wi-Fi connection would disappear.","Thank you so much for your response and recommendations. I do realize there's a lot to learn. And I see no reason to buy something powerful enough to provide wifi to my entire apartment building. But safety is definitely a concern.","Thank you for your response. I don't need very powerful Wi-Fi router. I do stream movies on occasion. But I only have 2 devices. And as I stated, my apartment is not that large."]},{"symptom":"Updating Windows 7 to Windows 10: Error0x8007001F - 0x20006: the installation failed in the SAFE_OS phase with error during REPLICATE_OC operation.        Hello all,Another one with issues updating Windows 7 (Pro 64-bit) to Windows 10 on a Lenovo Thinkpad X230. I'veremoved anti-virus software, including Microsoft Security Essentials,tried with and without and internet connection and with the ISO and normally, making changes to the Windows Modules Installer, etc.  I've followed the instructions offered in these similar questionshereand here: including disabling devices via Device Manager, doing aclean boot, and deleting previous installation files. Sadly I don't have my old Windows 7 installation software to start from there.Thanks for your help in advance!","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are receiving an error, ‘Error0x8007001F - 0x20006: the installation failed in the SAFE_OS phase with error during REPLICATE_OC operation.’ when upgrading to Windows 10. I certainly appreciate your efforts in trying to resolve the issue by following several troubleshooting steps. However, to identify the root cause of the issue, let’s try running Setup Diagnostic tool which will look for the exact reason of the error. Refer the articleSetupDiag and share the log files after running the tool. We await your response. Regards,Nikhar KhareMicrosoft Community - Moderator","Hello Nikhar,Unfortunately I became frustrated having tried the earlier steps and given my need to update quickly, I went ahead and updated with the options to not include programs from Windows 7, which caused another headache, but at least I have Windows 10 now. I do regardless appreciate your prompt response!Regards","Hi,Thank you for let us know that you were able to update the PC to Windows 10. Please feel free to contact us any Windows related concerns\/query, we will be glad to help you further.Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"\"Hidden\" data in Win 10 Calendar        Can anyone put me \"in the know\" concerning an aspect of \"Calendar\" (in Windows 10) which has been irritating me since I first started using it?!If you move ahead a few months (from the current date), the program then throws up a banner across the top of the screen that says: \"We aren't able to show you some of the events in this time range. But they're still there - they're available via your account provider\".How the heck do I access this \"invisible\" data?! ","solutions":["Hi, Thank you for posting in Microsoft Community.The date range of events displayed in the Calendar app is determined by your account type and the device you're using. While older events or events far in the future aren't displayed in the Calendar app, they haven't been deleted. You can view the events from the web or in another app. Based on the account type you may want to refer the chart in Where are my email messages or calendar events in Mail and Calendar for Windows 10? For emails, you may want to check settings for number of emails downloaded to the Mail App.Go to Start and open Mail.At the bottom of the left navigation pane, select the Gear icon.Select Manage Accounts and select your email account.Select Change mailbox sync settings.To see older messages, under Download email from, choose any time. Meanwhile, you may also make use of the Feedback Hub, where you can tell Microsoft about any problems you run in to while using Windows 10 and send suggestions to help us improve your Windows experience. Regards,Vivian S  "]},{"symptom":"WMI Provider Host - Windows 10        The problem of WMI Provider Host consuming 30+% of CPU usage is as I have found well known and documented - why hasn't Microsoft patched this issue in Windows 10?","solutions":[]},{"symptom":"Error: OxC1900101 - 0x4000D while upgrading to Windows 10        HiWe ordered a UBS for Windows 10 Home upgrade.We have tried to install numerous times.  Firstly when we plug in UBS it states \"Do you want to scan and fix Windows 10 (J:)?\"  If we click on Scan and Fix it states this disc is write protected.It does then let us start upgrade but once it gets to about 80% complete it goes to a black screen and just sits there.  On turning off computer and back on it gets to 89% and then just freezes.  By turning computer off and on again we get the following message:\"OxC1900101 - 0x4000D.  The installation failed in the Second_Boot phase with an error during Migrate_Data operation\".Is this a problem with the UBS we have been provided with?  If so how can we fix?We are also not being asked to enter the Product Key at any point during the installation.RegardsPaul Davis***Modified title from: Upgrading to Windows 10 from USB***","solutions":["Hi Paul, Thank you for writing to Microsoft Community Forums. I understand that you receive an error when trying to upgrade to Windows 10 Home. I’ll certainly help you with this issue. However, please let us know: Are you trying to perform a custom installation on the computer or running the setup directly from the USB?From where did you purchase the USB for Windows 10?Which version of Windows is installed on the computer?What is the make and model of the computer? An error that begins with 0xC1900101 is usually a driver error. You may want to refer the steps mentioned in the articleGet help with Windows 10 upgrade and installation errors. There are chances that the bootable USB is not created properly. You may want to try using the Media Creation tool to upgrade to Windows 10. You can go to the websitehttps:\/\/www.microsoft.com\/en-in\/software-download\/windows10 and click on Download tool now. Once the tool is downloaded, refer the steps mentioned in the articleHow to perform an In-place Upgrade with Windows 10 Step-by-Step Guide byPaulSey… If you still receive an error, refer the steps mentioned below: Hardware clean boot: I suggest you to follow the steps mentioned below and disable the devices is Device Manager: Press Windows key + R. This will openRun. Alternatively, you can go to Start and search for Run.In Run dialog box, type devmgmt.msc and hit enter.Now, expand Display adapters, Printers, Sound, video and game controllers one by one.Right click on the devices inside the section and click onDisable device.If asked for restart click on restart later and disable all the devices.Close the device manager window. Once all the devices are disabled, you can perform clean boot. Performing a clean boot will start the computer with minimal set of drivers and programs, to determine whether a background program is causing the issue. Some of the Startup programs will not load after performing a clean boot on the computer. However, that functionality will return when you reset the computer to start normally after finishing the troubleshooting. To perform a clean boot on the computer refer to the article How to perform a clean boot in Windows.  After performing clean boot, proceed with the installation.  Note: Please refer the section Reset the computer to start normally after clean boot troubleshootingto boot the computer in to normal mode after troubleshooting. If you have any third party security software installed on the computer, disable it temporarily. Note: If you disable the security software or firewall, the system might be temporarily exposed to security threats and risks. Please make sure to turn it on after performing the steps. You can also refer the steps mentioned in the article Get help with Windows 10 upgrade and installation errors. You may also want to look at the troubleshooting steps for the error code in the articleResolution procedures. Note: Modifying BIOS\/ complementary metal oxide semiconductor (CMOS) settings incorrectly can cause serious problems that may prevent your computer from booting properly. Microsoft cannot guarantee that any problems resulting from the configuring of BIOS\/CMOS settings can be solved. Modifications of the settings are at your own risk. Let us know the results. Regards,Nikhar KhareMicrosoft Community - Moderator","HiTrying to set up directly from USBPurchased from Microsoft websiteWindows 7 Premium Home installedASUS Model CM 6870Regards","Hi, Thank you for sharing the details. I apologize for the delayed response.  I would like to know were you able to perform the troubleshooting steps suggested by me. However, to identify the root cause of the issue, let’s try running Setup Diagnostic tool which will look for the exact reason of the error. Refer the articleSetupDiag and share the log files after running the tool. To share the log files, upload the files in OneDrive and share the OneDrive link. However, upon researching further on the computer model, I found that there are drivers available only up to Windows 8.1 in the manufacturer’s website. For more information, seeAsus CM6870.  We await your response. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Error: there was a problem running preinstall.cmd scripts, while upgrading to Windows 10        HiI am using the media creation tool to upgrade Windows 7 to 10. I have the licence for both.Getting \"there was a problem running preinstall.cmd scripts\" errorAny help greatly appreciated***Modified title from: Upgrading Windows 7 using media creation tool***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you receive an error, ‘there was a problem running preinstall.cmd scripts’ when trying to upgrade to Windows 10. I’ll certainly help you with this issue. However, please let us know: From where did you download the Media creation tool?When exactly are you getting the error message?What is the make and model of the computer? It could be possible that the download tool is corrupt, you may want to try downloading the tool again and check. To download the tool, navigate tohttps:\/\/www.microsoft.com\/en-in\/software-download\/windows10 If you still receive an error, you can try bootable USB and try to perform an upgrade. We will need an empty USB flash drive with at least 8 GB of space. Refer the steps mentioned below: Connect the USB flash drive to the computer.Go to the website: https:\/\/www.microsoft.com\/en-in\/software-download\/windows10, and click on Download tool now.Once the tool is downloaded run it and Accept the license.Select Create installation media for another PC, and click onNext.Make sure that correct Language, Edition and Architecture are selected and click on Next.Select USB flash drive, click on Next and select the USB drive.The file will take time depending on the internet speed. Once complete, selectFinish.Now, open the USB flash drive, double click on theSetup.Follow the on-screen instructions to start the installation. Upon researching further, I found that few Dell services are causing this issue. If you are using a Dell computer, you may want to uninstall Dell Encryption Management service and Dell Digital Library service. Let us know how it goes. Regards,Nikhar KhareMicrosoft Community - Moderator","Hi NikharThanks for responding. The tool was downloaded from https:\/\/www.microsoft.com\/en-gb\/software-download\/windows10 so is legit. I tried both direct upgrade from this tool and by downloading to and running it from USBGoogle suggested the issue was caused by Dell encryption software DDPE which had been disabled but not deleted. After uninstalling DDPE via Control Panel the process managed to get past these scripts and appeared to be running up to a point where it was even downloading the latest Windows 10 updates. But it has now failed with the following:0x8007001F - 0x2000DThe installation failed in the SAFE_OS phase with an error during MIGRATE_DATA operationDDPE was replaced with Symantec encryption and I wonder if this is an issue. I am now in the process of Googling this latest error but if you can assist please do.Many thanks","Hi, Thank you for replying. I apologize for the delayed response.  I certainly appreciate your efforts in trying to resolve the issue by following the troubleshooting steps. However, to identify the root cause of the issue, let’s try running Setup Diagnostic tool which will look for the exact reason of the error. Refer the articleSetupDiag and share the log files after running the tool. To share the log files, upload the files in OneDrive and share the OneDrive link. We await your response. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Windows 10 taking too long to ask admin permission to install software        Everytime I click to install a new app on my PC, the system takes 5-10 minutes just to ask my permission to run the installer. The apps are not from Microsoft Store.Below are my specifications:4 GB RAM DDR41TB HDDCore i3 6006UWindows 10 Home v1903","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as you are facing a delay in permission prompt for installing the apps on the PC. Is this issue occurs for any specific app or for all the app? In this scenario we would like you to put the PC in Clean boot, then try installing the app and check if there is any delay for the permission prompt. Please follow the steps mentioned in thisclean boot article. A ‘clean boot’ starts Windows with a minimal set of drivers and startup programs, if the issue doesn’t persist in safe mode, then try clean boot in normal mode, so that you can determine whether a background program is interfering and causing this issue. Clean Boot Disclaimer: A “clean boot” starts Windows with a minimal set of drivers and startup programs, so that you can determine whether a background program is interfering with your game or program. Your computer may temporarily lose some functionality while in a clean boot environment, however that functionality will return when youreset the computer to start normally after you have finished your troubleshooting. Let us know how it goes. Aditya RoyMicrosoft Community – Moderator"]}]}