{"windows":[{"symptom":"Window 8 settings need for page brightness eye problems beed to adjust brightness        In past was settings for amount of brightness on page back then could adjust.I have medical condition with my eyes bright light creates problems spasms with eyes get where cannot use computer if not changed just give instructions where to look for settings and how to adjust it thanks ","solutions":["I Windows 8.1 open the Charms Bar on the right hand side > click Settings > at the bottom should be Brightness Settings.Cheers."]},{"symptom":"Surface Pro After Join domain Start Menu & Task bar don't Work        I have upgraded to windows 10 pro so i can join my Company domain but after that i cant show start menu and the cant click any thing on the task bar also when i press any Text box like search or other the Tablet Keyboard will not fire. This Problem just for the user domain if i use the windows from user not on domain every thing is okay.","solutions":[]},{"symptom":"One Drive when start up pc some times says i am not signed in message appears        One Drive when start up pc some times says i am not signed in message appearson a windows 10 pc why has this started to happen and how to fix it as it should keep me signed in the program tray area all the time like it has done before any help on a fix would be goodalso why is there no one drive option on ur tab area as in the help list and the drop down options","solutions":["Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.I suggest you to kindly back up the files inside OneDrive folder and Reinstall the OneDrive program.","Hi i will see how it goes as has not yet again done it.but nice to know what to do"]},{"symptom":"How do I remove a keyboard layout?        As you can see from the screenshots. I have only 1 language installed (English) and only 1 keyboard added (US) but there is another keyboard English (UK) there when I press Windows key + space. How is the UK keyboard there when it is not even installed or added in the setting and how do I remove it?","solutions":["Hello zhangdiey, You can do this by following the steps outlined here: https:\/\/winaero.com\/blog\/add-remove-keyboard-la... Disclaimer: Please be aware that the link provided is not a microsoft link, it is advised to not download anything from this site as it is not verified by Microsoft.","Hello Knaramadil,Thanks for the quick reply. But I don't think the weblink you provide is related to my question. As I stated in the original description. The second keyboard layout, namely English UK, is not in the settings at all. Thus I cannot remove it by click 'Remove' in the setting - it's not there.","Hello zhangdiey,Double check to see if you may be able to remove the keyboard layout using option 2 in the tutorial below.https:\/\/www.tenforums.com\/tutorials\/102916-add-remove-keyboard-layouts-windows-10-a.html#option2","Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.In the \"language\" menu click on your language \"english united states\", go to \"option\" and under \"regional format\" click on \"settings\" and if this is the case, reset the Current format to \"english united states\"","Hello Shawn,Thanks for the reply. Option 2 you mentioned in the link does not work simply because there is only one keyboard in the 'Keyboards' section, English (US), as I have posted in the screenshot. So I am not able to remove English (UK) from there - it's not there.","Hello K0MB,Thanks for the reply. I have tried your method and reboot the machine. Unfortunately it does not work and it changes the payment of Microsoft Store to US dollars which I have to change it back to GBP.","Just to verify, did you already try to add the language you want to remove using Option 1, and then see if you may be able to remove it using Option 2?https:\/\/www.tenforums.com\/tutorials\/102916-add-remove-keyboard-layouts-windows-10-a.html","Yes I have tried that. Using option 1 just added yet another UK keyboard (so totally of 2 UK keyboard at that moment). And then using option 2 removed 1 of them. And I am back to the point where I started.","If one of your goals is to remove the input indicator icon on the taskbar, then you could use an option in the tutorial below to do so for now at least until you can remove the keyboard input language.https:\/\/www.tenforums.com\/tutorials\/103041-turn-off-language-bar-input-indicator-windows-10-a.html","Thanks again for your replies. My main and only goal is to remove UK input as you know the layout of some keys are so different. I notice that there are other people having the same issue and it's been like this for over half a year. Should I expect Microsoft pay attention to such bug and solve it soon?"]},{"symptom":"Encrypting File System (EFS) and Windows Hello        Does anyone know how EFS certificates are secured when using Windows Hello with an account? I was under the impression that the EFS private key was secured by encrypting it with the password. However on an account with Windows Hello enabled, logging in using Windows Hello (using biometrics instead of the password) still allows you to access EFS encrypted files. I was expecting that the first time I logged in, I would have needed the password and only then onward I should have been able to unlock the session using Windows Hello.","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.It’s designed to work seamlessly with windows hello, so once authenticated you don’t need to re-authenticate to decrypt your EFS files.I’ve linked to an article which gives some further background information on EFS:https:\/\/www.thewindowsclub.com\/encrypting-file-...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi Ross! That didn't really answer my question. My question was *how* is the private key kept secure. Please refer to the diagram https:\/\/en.wikipedia.org\/wiki\/Encrypting_File_System#\/media\/File:EFSOperation.svg. My question is how is the \"user private key\" shown in the diagram stored and decrypted by Windows when using Windows Hello. Previously I assumed this was encrypted using the user password. However, if the user's private key is available just with a finger scan, how is it secured?","It’s stored in the Windows certificate store, which is secured on a per user basis. I.e. it is only available once a user has been authenticated.In this scenario it makes no difference whether a user has logged in with a password of Windows hello. As at the point of login the keys are now available to the user.","Okay, in that case, what is it secured with? What is the private key encrypted with in the certificate store? Or is it kept in plain text, but just not accessible till the user authenticates?It’s stored in the Windows certificate store, which is secured on a per user basis.","I’m not sure if the exact mechanism but I can point you in the direction of the API’s which are used by the certificate store and the many (many ...) pages of documentation and certifications it supports:https:\/\/docs.microsoft.com\/en-us\/windows\/win32\/...Regards,Ross"]},{"symptom":"Can't login to my Windows 10 computer - incorrect password is correct.        As of today I cannot login to my laptop. It says 'incorrect password\"My login is my Microsoft account and that is correct (using it on 2 windows phones and a laptop and logged in here today with it).The laptop was set to boot up without password\/login screen.  But as of today it stops at the login screen and demands a password and rejects both blanks and my Microsoft password.There was an automatic system update today - maybe this has caused it?I have read other threads but all solutions require login and do not work.I would be very grateful for any help.Thanks.Paul.","solutions":["Hi Abuhirra,Thank you for posting on Microsoft Community. We appreciate your interest in Windows 10.We are sorry for the inconvenience caused to you.Use the onscreen keyboard and enter your password to login into the Windows. Before pressingEnter, click on reveal password symbol which is present right next to the password you entered and check if the characters entered are correct.If the characters entered are correct and you are not able to login into the PC, change your password from the following link and check if you are able to login into your PC.https:\/\/account.live.com\/ResetPassword.aspxHope this helps! Get back to us if you have queries regarding Windows, we will be happy to help you.Thank you."]},{"symptom":"Windows Malicious Software Removal Tool x64 - December 2019 (KB890830) - Error 0x800711c7        New laptop.  First activity - update windows 10 v1903 Dec update.  This seems to be a reused MMC (Microsoft Mystery Code) for other problems and issues?  Any idea what is causing this error?","solutions":["In case your new laptop is in S mode:- \"Win10-S mode is not supported, there is no added value of running MSRT on this platform. Any install failures of attempting to install the package can be safely ignored.\"Source: https:\/\/support.microsoft.com\/en-us\/help\/890830\/remove-specific-prevalent-malware-with-windows-malicious-software-remo","Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.In case you're on Windows 10S mode: \"Win10-S mode is not supported, there is no added value of running MSRT on this platform. Any install failures of attempting to install the package can be safely ignored.\"https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this answers your concern."]},{"symptom":"Frequent Crashes while Gaming        Hello, I've been having problems with either my game or computer crashing while playing the game League of Legends (and it's various game modes) quite a bit recently and I'm at my wits end. Everything points to some kind of driver being broken but I don't have a clue which.Here is a folder with all the mini crash dumps. I have a full crash dump available as well if needed.https:\/\/drive.google.com\/open?id=1Xmrs3ImrrVmtF0_LaLbfH0kxWtuCSUI5","solutions":["Hello Keiuran, I am Andrew an independent advisor. I've looked through your dump files, thank you so much for that. I've seen a lot of IRQL errors, buffer overrun errors and straight memory corruption errors. I'm going to ask you to test your RAM first.On the search bar search for mdsched.exe Run this and come back with the results. It may take a while to test. After results come in you can also test and repair the system files for the IRQL errors I noticed.In the search bar, type cmd. Right-click on cmd.exe and select Run as Administrator. Type SFC \/scannow and press the Enter key. Re-enter Command Prompt as Administrator and run these: dism.exe \/online \/cleanup-image \/scanhealth dism.exe \/online \/cleanup-image \/restorehealth dism.exe \/online \/cleanup-image \/startcomponentcleanup Take Care Keiuran, we'll fix this. Andrew","Memory scan completed two passes without any issue.C:\\WINDOWS\\system32>SFC \/scannowBeginning system scan.  This process will take some time.Beginning verification phase of system scan.Verification 100% complete.Windows Resource Protection did not find any integrity violations.C:\\WINDOWS\\system32>dism.exe \/online \/cleanup-image \/scanhealthDeployment Image Servicing and Management toolVersion: 10.0.18362.1Image Version: 10.0.18362.418[==========================100.0%==========================] No component store corruption detected.The operation completed successfully.C:\\WINDOWS\\system32>dism.exe \/online \/cleanup-image \/restorehealthDeployment Image Servicing and Management toolVersion: 10.0.18362.1Image Version: 10.0.18362.418[==========================100.0%==========================] The restore operation completed successfully.The operation completed successfully.C:\\WINDOWS\\system32>dism.exe \/online \/cleanup-image \/startcomponentcleanupDeployment Image Servicing and Management toolVersion: 10.0.18362.1Image Version: 10.0.18362.418[=====                      10.0%                          ][==========================100.0%==========================]The operation completed successfully.I have previously run these besides the startcomponentcleanup less than a week ago.dism.log has been put in folder.","I had another crash recently that I just uploaded, and the game is still crashing quite frequently as well even if it's not bluescreening my computer.","Had another crash today, this one pointing to btfilter.sys (though I keep bluetooth off). I uninstalled and deleted the drivers then scanned for hardware changes to reinstall. Gonna see what happens. Would still really appreciate if someone could look through the crash dumps and give me something more conclusive to work with.","Did you see my replies? I followed all instructions and still have the same issue popping up periodically."]},{"symptom":"Blue screen error        I have a persistent blue screen error and all efforts to login to windows 10 have failed. I have tried the safe mode, resetting, restarting etc nome has worked, i don’t know what to do.","solutions":["Hi Nicholas Since none of the options in the Recovery Environment are working for you, your best option is to create bootable Windows 10 installation media on another PC and then use that to try to repair your PC, by booting form that drive . . .Click this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), you can create a bootable USB flash drive (min 8GB) using that toolThen, Boot your PC from the Installation Media you just created (change Boot Order in your BIOS) then choose 'Repair this Computer'"]},{"symptom":"WiFi turns off when I wake my computer from sleep        Hi! So a few months ago I got a new Windows 10 computer, but this issue started a while after. When I wake my computer from sleep, the WiFi for the entire house shuts off for up to 30 minutes. I’m using an ethernet cable. I’m not 100% sure, but I believe this problem started happening when my brother also connected an ethernet cable from his Windows 10 pc to our router. I’ve tried changing various internet settings, but I still can’t solve this problem. If you have a solution, let me know! Thanks! ","solutions":["Hi EP. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Are you using a router or at least a switch which is required to connect more than one ethernet cable most modems?Turn off both Modem and router\/switch, wait 10 minutes then restart the modem, wait 5 minutes then restart the router or switch.Try resetting the router if applicable: https:\/\/www.lifewire.com\/resetting-a-home-netwo...I can give you steps to troubleshoot ethernet in Windows 10 but from what you say it's almost certainly caused by the way the second ethernet cable was attached.Let me know what you find, and any more information you have to add about how it's set up and what has been done.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi EmeraldParrot,you must try to isolate the problem: temporarily disconnect the network cable of your brother's PC and any other device from the router, stay connected only with your PC, then restart the router and try to connect both wirelessly and via LAN.Does your pc's wi-fi work well even when you wake up from sleep?"]},{"symptom":"Windows 10 CPU Usage 100%        Hi!I have been having problems with my CPU usage. It's always 100%, but nothing is running in the background. When I open Task Manager, the percentages jump up and down really weirdly. Once there is Task Manager using 70% of CPU, one second later it goes back down... Then comes like Discord on the top with again 50% CPU usage and again sec later it jumps back down... like It's constantly doing this with different programs like: System, System Interrupts, Chrome, Desktop Windows Manager...  ","solutions":["Hi Vintpüss, I'm Roshan V S, Windows expert and a Windows user like you. I appreciate you for providing details about the issue and we are happy to help you.Try the following methods : Method 1: Disable Superfetch 1. Open Taskmanager, click “More details,” then click “CPU” to order processes by how much CPU they’re using.2. Press Win+R, type \"services\" 3. then in the Services window scroll down to Superfetch. 4. Right-click Superfetch, click Properties, then in its Properties window click the drop-down next to “Startup type,” click “Disabled,, and OK.Method 2: Reset Your Power Plan 1. Type \"power plan\" into the Start search bar. 2. Then click “Choose a power plan.” 3. If you’re on “High performance” or “Power Saver,” then switch to “Balanced.” 4. For extra certainty, click “Change plan settings,” then on the new screen click “Restore default settings for this plan.”Method 3: Disable Third-Party Antivirus Software Our view here is that if you’re using antivirus software on Windows 10, then you’re probably putting unnecessary strain on your CPU (particularly if its older). It doesn’t usually hurt to have the extra security, but you probably don’t need it.So don’t be afraid to disable your third-party antivirus software to see if it helps your CPU usage. If it does, then uninstall it, because Windows Defender should really have you covered.Do get back to us with the result. We will be glad to help if you need further assistance.Regards Roshan V S Independent Advisor"]},{"symptom":"Bluetooth Issues on Windows 8.1        The main issues here is that my Dell Desktop is not discovering any of my Bluetooth devices, i've made sure they're visible. (Samsung s7 , and an Apple Airpod, both which worked fine on earlier dates)The available Bluetooth drivers (or adapter?) on my PC are: 1. Generic Bluetooth Adapter & 2. Microsoft Bluetooth EnumeratorThere are no yellow triangle on themI have performed the ''update driver'' ''fix''I have enabled the two Bluetooth services in services.msc to automaticPlease help, thanks!","solutions":["Do a System Restore to a date before you had this problem:\"How to Do a System Restore in Windows 8 and 8.1\"http:\/\/www.eightforums.com\/tutorials\/4692-system-restore-how-do-windows-8-a.htmlOr:See if this assists you.You obtain your Bluetooth software\/drivers, IF your machine is designed to use Bluetooth, from your manufacturer's website if not installed by default.And in the Charms Bar > Settings > Change PC Settings > PC and Devices > Bluetooth > turn it on.Connect a Bluetooth devicehttp:\/\/windows.microsoft.com\/en-AU\/windows-8\/why-isnt-windows-finding-deviceCheers."]},{"symptom":"NVIDIA Display 26.21.14.3200 for AMD RX card ?        I don`t understand, but can anybody explain why is windows update downloading and installing this Nvidia update whereas no component in my PC requires Nvidia drivers. The GPU I am using is RX 470. I mean like, not everyone has unlimited internet why is Windows wasting our data?","solutions":["I came looking for an answer to the same question. I have a Radeon ATI and Windows is pulling down the same NVIDIA driver AND an AMD Radeon HD 5450 driver.","Good question. The only thing I can think of is if you had an Nvidia gpu previously and the drivers were notfully uninstalled. To do this it's good practice to use DDU to uninstall graphics drivers as it will delete Registry keysthat uninstalling via Windows tends to leave behind, and these could trigger WU to do an update.Display Driver Uninstaller Download version 14.1.0.0Or.... use Driver Fusion...Treexy | Download free driver and device software- Best option is to disable driver updates from WU altogether. Nvidia and AMD both recommend downloading the driver,uninstalling and installing the new driver manually for best results.radeon-rx-400-series\/radeon-rx-470- With an HD5450 the last WHQL update was 2015, but I doubt any 'update' WU does would benefit a gpu of this vintage.AMD Graphics Drivers HD5450Block driver updates....Enable or Disable Driver Updates in Windows Update in Windows 10 | Tutorials- I used this method when first upgrading to Win10, but don't know if it still works(It wasn't temporary, or I've forgotten I used the Registry hack along the way).How to temporarily prevent a Windows or driver update from reinstalling in Windows 10.","I don`t understand, but can anybody explain why is windows update downloading and installing this Nvidia update whereas no component in my PC requires Nvidia drivers. The GPU I am using is RX 470. I mean like, not everyone has unlimited internet why is Windows wasting our data?"]},{"symptom":"Dual Windows 10 boot        I have one PC with two SSD disks. On one is Windows 10 with UEFI connected to our company network and it is fully secured and closed for any changes due to strict security policies of the company and connected to their wired LAN.I would like to have another Windows 10 installed on the second SSD and connected to the same motherboard and use the different network - public WiFi in this case.Please tell me is that possible to do and is this new Windows 10 able to somehow corrupt the original company Window 10 - which I would like to avoid of course.I just want to have two complete separate Windows 10 installations and able to safety chose from which one to boot. ","solutions":["Hi DraganPopovic1 Yes, you can do this, basically you just want to create a Windows 10 dual boot PC with separate versions of Windows 10 on each SSD . ..So you need to download and create bootable Windows 10 installation media on a USB drive, then just install Windows 10 on the second SSDThat will create a bootloader that will give you the option of booting to either OS when you start up your PCThere is no fear of one operating system corrupting the other, by dual booting Windows 10 . . ."]},{"symptom":"windows server 2016 cannot run  microsoft.windows.camera: from windows 10 client        hello.i have Terminal Server 2016, i have also client pc with windows 10.i am trying to run   microsoft.windows.camera: on server getting error  \"You'll neer a new app to open this microsoft,windows.camera\"","solutions":["Hi,Server and IT Pro questions are best handled on our sister Site Technet as this is only a Windows consumer only forum:https:\/\/social.technet.microsoft.com\/ForumsPlease choose the most appropriate category on Technet forums from the left."]},{"symptom":"Search not working since windows 10 update 1903        Since the May update, my search is intermittently blank. Unresponsive. I found one article that said to delete my antivirus and then reinstall. That worked for about a day. Not sure what is happening with these update.Tried trouble shooting and nothing.Help.","solutions":["Hi, markburton1 My name is Smith and I am an Independent Advisor. I would be happy to help you today.I recommend you check these methods to repair any Windows problem. Press the Start key and type the word CMD, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanup-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/947821...Hope this helps. Keep us posted on the status for further assistance.","Hi markburton1 I am Vijay, an Independent Advisor. I am here to work with you on this problem. Please try these steps and check after each step. If these don't work, let me know. I will provide further troubleshooting steps.1. Reregister Cortana Windows Key+X > Click Powershell (Admin) > Copy the below and paste into Powershell > Enter > Reboot your computerGet-AppXPackage -Name Microsoft.Windows.Cortana | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}2. Restart Windows Explorer Windows Key+X Click Task Manager Head to Processes tab and select Windows Explorer Right click > Click Restart Do let me know if you require any further help on this. Will be glad to help you.","Did everything you all suggested. Went to where I bought the computer and they said to reset windows, it then worked...let see for how long. Microsoft needs to address these things.","my start button and cortana search has been unresponsive since my last update","This ended up fixing my issue! Thank you so much! I have no clue how this happened but update 1903 has been extremely bug heavy and I'm a little upset that it's the case. Hopefully it gets fixed soon!","Hi,I had the same issue after a fresh install of 1809 and after updating to 1903.Installing the latest KB, KB4515384, fixed the problem for me.","I had the same problem. Restarting Windows Explorer did the trick and everything is working fine.","How do you restart windows explorer?","Restarting windows is only a temp solution.  Did you get it to fix fully. ","None of all methods works. It's a stubborn bug."]},{"symptom":"Battery icon not showing in task bar        Hey everyone. Feeling a little unco with windows atm after swapping from 10 year use of Apple. Ive read a couple of articles mentioning the battery icon in the task bar. This is not displayed on mine. The toggle in the settings is switch on to display, so im never sure my battery %. Also how do we take a screen shot? Are we able to take a selected screen shot of something in particular on the screen?Any other favourite tips or shortcuts would be much appreciated!!","solutions":["Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.If you don’t see the battery icon in the panel of hidden icons, right-click your taskbar and select “Taskbar Settings.”Scroll down in the Settings window that appears and click “Turn system icons on or off” under Notification area.Locate the “Power” icon in the list here and toggle it to “On” by clicking it. It will reappear on your taskbar.To take screenshots, click on the Windows start button, and type \"snipping tool\". It is a Windows 10 program for making screen captions by selecting.Here you can find several useful shortcuts. ( or just tape \" windows 10 shortcut \" in google :)https:\/\/support.microsoft.com\/en-us\/help\/12445\/...","Hi MarcoThanks so much for your help. Ive done the instructions for the battery icon, in the systems icon menu, my Power toggle is actually grey, so im unable to turn on or off?"]},{"symptom":"Getting error while Windows 10 feature update        I m having Windows 10 on (Inspiron 11 - 3148) While updating it for a Feature update I get below error :• Feature update to Windows 10, version 1903 - Error 0x80070002There were some problems installing updates, but we'll try again later. If you keep seeing this and want to search the web or contact support for information, this may help: (0x80070057)Please advise","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command promptDISM \/Online \/Cleanup-Image \/RestoreHealthRun these commands on the command prompt to restart windows update servicesnet stop bitsnet stop cryptsvcnet stop wuauservnet stop msiserverRen C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.old net start bitsnet start cryptsvcnet start wuauservnet start msiserverAfter successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartThis should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","Thanks so much for the response.  I got an error while running the tool ==> DISM \/Online \/Cleanup-Image \/RestoreHealth.Deployment Image Servicing and Management toolVersion: 10.0.16299.15Image Version: 10.0.16299.967[==========================100.0%==========================]Error: 0x800f081fThe source files could not be found.Use the \"Source\" option to specify the location of the files that are required to restore the feature. For more information on specifying a source location, see http:\/\/go.microsoft.com\/fwlink\/?LinkId=243077.The DISM log file can be found at C:\\WINDOWS\\Logs\\DISM\\dism.log","Thank you for that information. Please proceed with the next step."]},{"symptom":"Cannot connect to any-cast        The wireless display gets disconnected after obtaining an IP address. I have checked it using dxdiag and it shows that it is supported. I have tried turning on nearby sharing and turning off the firewall but nothing worked.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please reset the Wireless driver from Device Manager and check. Go to Device Manager Locate and expand Network Adapter Right click on the Wireless driver and select Uninstall. (Do not click on any Check Box)Restart the PC","which one of these adapters do I reset?","Intel Dial band wireless","I was having some other issues with windows so I had a clean installation. I will let you know if it works now","Sure. No problem."]},{"symptom":"Voice\/Musical Instrument Recording with backing track        Hi,I am an amateur musician. I want to record music played on Harmonica along with a backing track played in the background. Probably this is called overdubbing. So can I do this with Voice Recorder. The final recorded music should play both ..the harmonica music and the backing track in sync.Is this possible in Voice Recorder or any other app in Windows 10? If so please give the steps to be followed.Thanks & RegardsJay Sen","solutions":["Hi Jay The best way to do this is with a totally free application called Audacity . . . That is like a mini sound Studio and can be used to merge tracks . . .etc. https:\/\/www.audacityteam.org\/download\/windows\/________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]}]}