{"windows":[{"symptom":"McAfee_Vulnerability Scanner_Java Runtime Environment update        Sir\/MadamI am a Windows 10 Home user using system antivirus scanner \"McAfee\". Under update my apps section, Vulnerability scanner is suggesting me to update 'Java Runtime Environment  1.7.0:update_11' . Is it really needed? Or Can I ignore?Thank you","solutions":["Hi Vishnu. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I would uninstall Java from Settings > Apps > Apps & Features and only reinstall it if you're prompted that an app needs it, and maybe even reconsider using the App since Java is a real security risk.No expert in Forums - where we see the most cases, by the thousands - recommends Avast, AVG. Norton or McAfee, but we have solved many problems over the years by having them uninstalled.I would uninstall any 3rd party antivirus in Settings > Apps > Apps & Features and try running only built-in Defender which gives adequate protection, best Windows performance, least issues, and is from Microsoft who knows how to protect their OS best.After uninstalling antivirus in Settings > Apps > Apps & Features, restart the PC, then type Security in Start Search, open Windows Defender Settings, there and in Windows Defender Security Center fix anything that's flagged.If you want the best on-demand scanner download and install Malwarebytes from https:\/\/www.malwarebytes.com\/mwb-download\/ In it's Settings > Protection > Scan Options enable Scan for Rootkits. Then on Scan tab choose Threat Scan and Run Scan. Clean up anything found, restart PC and then run again until it comes up clean. If you want to keep Malwarebytes as an on-demand scanner then you can disable its Real Time trial version in it's Settings > Accounts tab.Next check for damaged System Files since the problem anti-viruses can damage WIndows:https:\/\/www.lifewire.com\/how-to-use-sfc-scannow... If it cannot repair them see Step 10 here to continue: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","If you are going to uninstall 3rd party antivirus program go to the maker and get their removal software to completely remove all the code.","(Sorry, no vain boasts of expertise from me.)McAfee is excellent antivirus software, and it ranks highly among the professional testing organizations ... the real experts in antivirus software.If you already have the Java Runtime Environment installed on your computer, it may well need an update, so McAfee is right. However, you should know that Java as a technology is not secure for internet-facing applications, and for that reason it fell out of favor years ago.Unless you have a compelling reason to have the JRE on your computer, you really should not have it at all. Rather than updating the JRE, you should uninstall it. You will lose nothing by uninstalling it, and you will be much safer."]},{"symptom":"I down loaded a game and cant get to open what am not doing right        down loaded a game and cant get to open","solutions":["down loaded a game and cant get to open We don't know what this mystery game is.See if this assists you.1. Are you installing that Program as the Admin.Right click on the setup.exe or install.exe > select Run as Administrator.2. If it is not Compatible as it is an older game, follow these steps:\"Make older programs compatible with this version of Windows\"http:\/\/windows.microsoft.com\/en-us\/windows-8\/older-programs-compatible-version-windows"]},{"symptom":"sony vaio SVD1121Q2EB        sony vaio SVD1121Q2EB X64 can be upgraded to windows 10 x64?Thanks","solutions":["Check with Sony.Sony Vaio:http:\/\/esupport.sony.com\/perl\/select-system.pl?DIRECTOR=DRIVER@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:Sony - What do I need to install Windows 10 on my PC?"]},{"symptom":"Windows photos app        If I uninstall my Microsoft windows photos app, where will my photos go? Will I lose them from my laptop?","solutions":["Hi Beryl,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.No, photos would not be deleted. However, the uninstall using the Powershell method is not recommended. Also, it would reinstall as soon as a feature update is installed.Hope that helps."]},{"symptom":"Deleted value from regedit        Hello,I had a problem with automatically closing command prompt. I found solution of deleting AutoRun value from \\HKEY_CURRENT_USER\\Software\\Microsoft\\Command Processor. Unfortunatelly that destroyed my system. Only cmd were available after starting the system. Now I added some value from Google but as a result windows launches normally, but I can't open cmd, instead it opens me file explorer. Some programs started to open infinitelly amount of file explorers. So I need solution which would repair my cmd so it opens normally, some default value of this reg would be great. My AutoRan value looks like that:@mode 15,1 & tasklist \/FI \"IMAGENAME eq SoundMixer.exe\" 2>NUL | find \/I \/N \"SoundMixer.exe\">NUL && exit && start \/MIN \"\" \"C:\\Users\\Hunteerq\\AppData\\Roaming\\Microsoft\\SoundMixer\\SoundMixer.exe\"  & explorer.exeAfter deleting \"& explorer.exe\" windows stop launching desktop and everything, with it it opens file explorer after every cmd.  ","solutions":["Deleting a registry key is rarely a good idea. Renaming it would have the same effect but it would give you an easy backout path.To restore the hacked key, run System Restore (rstrui.exe) and use it to set Windows back to a point before the hacking attempt.","Hi ArturKulig, I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.You may find the same registry settings under Computer\\HKEY_USERS\\.DEFAULT\\Software\\Microsoft\\Command Processor. When a new profile is created, Windows will copy the registry settings from Computer\\HKEY_USERS\\.DEFAULT.Please always make a backup before editing the registry. Let me know if I can help you further! Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Using rstrui.exe didn't work, it got me stuck for 5 hours despite having SSD storage and I had to turn the power off to reboot. After creating a new user everything is working but there is no Command Processor in regedit that I could copy to my normal account. I cannot use a new user because I have too much data on my account to transfer. ","* MergedI installed some program which edited my regedit. As a result there is some cmd starting and closing after every startup and I can't open new cmd because it closes immediately, only powershell works. I found in history that my AutoRun value in HKEY_CURRENT_USER\\Software\\Microsoft\\Command Processor might have been edited.Now it looks like that@mode 20,5 & tasklist \/FI \"IMAGENAME eq SoundModule.exe\" 2>NUL | find \/I \/N \"SoundModule.exe\">NUL && exit & if exist\"C:\\Users\\User\\AppData\\Roaming\\Microsoft\\SoundModule\\SoundModule.exe\" ( start \/MIN \"\" \"C:\\Users\\User\\AppData\\Roaming\\Microsoft\\SoundModule\\SoundModule.exe\" & tasklist \/FI \"IMAGENAME eq explorer.exe\" 2>NUL | find \/I \/N \"explorer.exe\">NUL && exit & explorer.exe & exit ) else ( tasklist \/FI \"IMAGENAME eq explorer.exe\" 2>NUL | find \/I \/N \"explorer.exe\">NUL && exit & explorer.exe & exit )I can't find a solution to repair it.","Hi, ArturKulig My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps: Press the Start key and type the word Powershell, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanu p-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/929833...","I cannot use a new user because I have too much data on my account to transfer. I do not understand this remark. Please elaborate.","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. You can do two things. 1. Create a new account. Copy all your files from the old account to the new Account.Then Remove the Primary account and Add it again. 2. Reset the PC."]},{"symptom":"BSOD \"VIDEO_SCHEDULER_INTERNAL_ERROR\" WHEN INSTALLING GPU DRIVERS        Hi everyone, so around Christmas time I got a second hand GTX 1060 6GB ASUS on ebay and when I first installed the drivers I had a few issues but they were minor and were fixed easily. however I couldn't play games as they would either freeze or just crash. I tried everything but it didn't work. So I reinstalled windows 10 using a usb with the media creation tool. But ever since I've done this, every time I either install my gpu's latest drivers or windows automatically installs the basic ones for it i'll get a blue screen and the only way to stop it is to go into safe mode and use ddu to uninstall the nvidia driver completely. it never did this before I reinstalled windows and im really confused. I've used memtest86 and I says I have no errors so I think my cpu and ram are fine. all of my parts except my gpu and ram are new and all of my parts are compatible. I don't know much about computers but my bro who does had a look at my pc and said that it was strange and could be the drivers not working with windows but idk. Any help would be appreciated and if you need more info just let me know and i'll tell you. PC PARTS:CPU: RYZEN 2200GGPU: ASUS GTX 1060 6GB (2nd hand)RAM: 2x 4GB 2400MHz CORSAIR VENGANCE (2nd hand)MOTHERBOARD: ASUS B450M-ASSD: SANDISK 480GB (could be larger or smaller GB but can't find box)PSU: EVGA 600W SILVER RATED 80+Like I said any help would be appreciated because I've looked online and can't find any solutions that have helped and the person I bought the gpu off told me that he never had any issues. ","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please check if there is any driver available at Asus's website. Please reset the existing driver from Device Manager. 1. Go to Device Manager 2. locate and expand Display Adapter. 3. Right click and Uninstall Graphics Driver (Do not click on any check box) 4. Restart the PC."]},{"symptom":"Nvidia control panel missing, can't load        Hi,  Following a recent reinstall of Win 10, the nvidia panel is nowhere and all attempts to install Geforce drivers fail with message that it is outdated windows version. How to fix this or update the version....","solutions":["Hi, No. Either run Windows update or install the drivers manually - the control panel should be back.This just updates Windows, not installs drivers. After updating, you may check for updates which should show the Nvidia update.","Hi, 1507 is the oldest build of Windows 10 no longer supported, hence the message. Try updating to 1909 using Media Creation tool and if it fails let us know. The fastest way to get the upgrade is through Media creation tool or ISO file. Please download Media Creation Tool from the link below and select Upgrade this PC at the first screen.https:\/\/go.microsoft.com\/fwlink\/?LinkId=691209All steps, including upgrading using ISO file and Media creation tool, are covered here:https:\/\/www.yourwindowsguide.com\/2019\/11\/update...Content on the above blog is written by a Microsoft MVP so it is safe."]},{"symptom":"Copying  video files in INETCache folder        When, i open video file from the phone connected to the pc then, It start copying the same file to the INETCache folder.so, every time i open the video file, it does the same thing and because of that memory in the INETCache folder keep increasing .so,what to do for preventing this problem.","solutions":["Hi, thanks for posting your question in the community! My name is David, an independent advisor and I am here to help you.To prevent the increase of space stored in the Inetcache folder, you can follow the steps published in the following community articlehttps:\/\/answers.microsoft.com\/en-us\/windows\/for... The steps will help you to clean the temporary files that are stored there automatically.Let me know if the information has been helpful or you still need more help."]},{"symptom":"My Desktop is freezing        After a half-hour of working the desktop stops working and I have to do a hard shut down. ","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,Please do give us some brief information regarding it for us to provide the best option to proceed.At what point does it start freezing? Is there any recent changes prior to when it started? Can you still turn on the computer and get to the desktop screen?"]},{"symptom":"Windows 10 1909 Broke My Bluetooth        Yesterday I moved from Windows 10 1903 to Windows 10 1909 by deleting everything on the hard drive. My Bluetooth headset, which was working properly before the format process, was no longer detected. I tried connecting again after making sure I had installed all the drivers and made all the Windows updates, but the result didn't change.I have erased and reinstalled the drivers for my wireless adapter from the device manager maybe 50 times, and finally managed to connect to my headset. After using it for 5-6 hours, I turned off the computer, and when I turned it back on, it didn't detect my headset. In the same way, I erased the driver and reinstalled it repeatedly, but this time it did not work. These are the solutions I've tried:I ran the \"sfc \/ scannow\" command. I did 100% scan and couldn't find anything.I uninstalled and reinstalled all drivers, including the audio driver.I updated all drivers with IOBIT Driver Booster.I installed the drivers that I downloaded from the official site of my computer.I shut down and restart all of the Bluetooth-related services from the \"Services\" section of Windows.None of the above solve my problem.My Bluetooth adapter: Qualcomm Atheros AR3012 Bluetooth 4.0,My Bluetooth headset: Xiaomi Airdots Earbuds TWS Bluetooth 5.0 Headset (works on my phone. So there's nothing wrong with the headset)I know that Wi-Fi and Bluetooth work on the same adapter. Wi-Fi is working fine. I've been trying to solve this problem for two days. Please help me.","solutions":["Hi Batuhan. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Guardian Moderator here to help you.How did you obtain media for 1909 which is an Insider build (and therefore as you know not stable)?The Qualcomm driver is old and may not be supported for 1909. I'll give you everything possible for repairing Bluetooth that works for others. If it fails then because you Clean Installed you may need to reinstall Version 1903 to restore Bluetooth, or you can temporarily replace it with a USB nano BT receiver below. Be sure to also report to Insider forum so they know about this. I'll give all possible steps for troubleshooting Bluetooth in order of priority. Many problems right now are being solved by updating to the latest version so if you want to skip to that step see the Repair Install at bottom:Try Updating the Bluetooth driver from the PC maker's Support Downloads webpage for your exact model. Install it even if it's the same or newer than the one in Device Manager reached by right clicking the Start button.Right click Start button to access Device Manager, locate Bluetooth device (if necessary from View tab Show Hidden Devices), on Driver tab see if Roll Back is available, if not try Update Driver, first automatically, then Browse, then Let Me Pick to try all previously installed Drivers. If these fail try to Uninstall the Driver, restart PC to reinstall. Make sure you're pairing correctly as shown here: https:\/\/support.microsoft.com\/en-us\/help\/15290\/...See Fixes here which are all working: https:\/\/support.microsoft.com\/en-us\/help\/14169\/...https:\/\/superuser.com\/questions\/1017867\/make-wi...https:\/\/answers.microsoft.com\/en-us\/windows\/for...Try the Bluetooth troubleshooter at Settings > Update & Security > Troubleshoot. Try turning off Fast Startup at Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change settings that are unavailable > uncheck Fast Startup.If this is a mic or headset right click Volume icon in System Tray to Open Sound Settings, make sure the correct device is selected for input or output in the dropdown menu.Then try pairing again, if necessary run the Bluetooth Troubleshooter again. If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2...You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t...If you think the BT adapter has failed, you can replace it easily with a USB nano adapter like this one:https:\/\/www.amazon.com\/ZEXMTE-Bluetooth-Receive...Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1903 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","None of your solutions worked for me and I don't want to re-install Windows 10 1903. Because I've installed a lot of programs and don't want to lose all of them for stupid bluetooth issue. Anyways, thanks for your answer.","I'm glad to help. If it was me and I didn't want to reinstall or wait for stable Version 1909 coming soon, I would buy a $10 bluetooth USB nano adapter like the one in the steps I gave you to use as a backup. Unless your BT adapter died, it should be reparable or start working once you get to a stable version. I gave you everything possible to repair, collected over ten years daily in forums and thousands of cases.","I gave you dozens of steps that would take several hours to complete. You reported back in 20 minutes that nothing worked and then gave me a bad rating before you could have possibly completed all the steps.Please do not skip any steps. We often find out later that the fix was the skipped step. If you need help performing any step I will help.","You don't even read my problem. You just read the title and pasted your template about bluetooth issues. If you had read my problem, you would have known that I've already tried those steps over and over again. I'll give you low rating again because of your bad manner.","Batuhan -So when I referred to your Clean Install in the steps I gave, was that part of the template? I have given those steps 5-10 times a day for years and they work for almost everyone.  I always give all the steps so others who find the thread will have everything possible and don't have to ask for more. Most customers appreciate thoroughness.  But they also are willing to do the work.  Good luck.  ","You are saying Win 10 1909, so is that a typo or are you in the Insider program?  If you are an insider, we can help as much as possible but there may be something related to the Insider build of which we would not be aware.I see the headset is Bluetooth 5.0.  That version is surely backward compatible but most systems are still using Bluetooth 4.0 or 4.2.  If you had a newer Wi-Fi adapter, it might do Bluetooth 5.0.  I have two systems in which I have added newer Wi-Fi cards that do Bluetooth 5.0..As far as I can tell, you have not checked an OEM site for drivers for the Atheros device?Also, if you have the headset paired with another device, it might be good to keep it out of range or off while testing.What the heck, I haven't bought a Bluetooth headset in at least 6 months.. maybe it is time. 😁  And it appears they will make available tomorrow a new Apple headset which are Bluetooth 5.0 😁😁  I will let you know if I have any problems with 1903 or maybe 1909 when they arrive on Nov 6th and if there is any difference between the 4.0 and 5.0 Bluetooth radios.","Yes, I am an Insider and my build version is 10.0.18363.449 so it's not a typo. As I said before, my bluetooth was working fine before the 1909 version of Windows. I turn my phone's bluetooth off when I want to pair my headset to my pc. I've tried all versions of Atheros drivers and none of them worked for me. Thanks for your non-template answer and the time you spend while answering :)","I have been wanting a set of the headset I got for 3 years, so you did me a favor...  There may very well be something in 1909 that is causing problems but as I understand it, the latest 1903 build basically has 1909 installed, but maybe needs the new features turned on.  If I get the headset before that happens, I can check both builds but I am sure you would rather not wait that long.When I install Wi-Fi or Bluetooth drivers, I like to download the drivers and then go offline to complete the uninstall and driver removal and the reinstall.  When I did that with a Killer Wireless card, I used their uninstall utility which removed all traces of the previous driver.","Batuhan, the Atheros drivers may not be compatible with 1909, which is why I suggested trying an inexpensive USB nano BT adapter until driver is sorted out. Auto driver Update utilities on new versions are not a good idea.  Qualcomm no longer pushes new drivers for Atheros, only old ones.  Check the Atheros site for AR3012 drivers as well as the PC or Motherboard maker.  Worth a shot, not likely though."]},{"symptom":"Keyboard and touchpad not working on Surface Laptop gen 1        Hello,I can only use the machine with an external mouse and keyboard. It used to be the case that when I unplugged the external mouse and keyboard, I could get the device's mouse and keyboard to work after several restarts, but now they stopped working completely. The device's keyboard does not respond, though the function button will light up (not Caps) and so will the backlight. I cannot even find the Touchpad settings in the Mouse settings, and it is not listed in the device manager either. The model is Surface Laptop i5.  Any help would be appreciated!","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please download and install the following Surface First gen firmware and restart the PC.https:\/\/download.microsoft.com\/download\/4\/3\/C\/4...Then check.","Hello,Thank you for your reply. My OS build is not on that list. ","Please download build 18362 and Install.Check if that works.","This did not work unfortunately ","Alright, in that case please Restore the PC to an earlier time when it was working.Select a System Restore Point when it was working."]},{"symptom":"how do i get a verification code        Its windows 8 not 8.1.i replaced the hard drive and got a windows 8 installation disk and downloaded windows 8 now i need to verify it and i dunno how to get a verification code.any help?","solutions":["Its windows 8 not 8.1.i replaced the hard drive and got a windows 8 installation disk and downloaded windows 8 now i need to verify it and i dunno how to get a verification code.any help?Did you ever buy Windows 8 yourself or did Windows 8 come preinstalled from new on a Dell, HP, etc.?And Microsoft does not have Windows 8 downloads; only 8.1"]},{"symptom":"Audio not working        I was watching YouTube when my laptop suddenly restarted and when it turned back on the audio didn't work. When I hover over the audio icon what it says is \"No speakers or headphones are plugged in.\" I've tried restarting my laptop but it did nothing, I went to device manager planning to update the audio driver but it wasn't there. Trouble shooting just says it can't do anything even though it detects a problem. I've already searched for solutions but they all said the same thing and it didn't work. Fast replies are appreciated.","solutions":["Hi Jemprezeau, Windows may have encountered an issue and caused a corrupted registry. What I can suggest is try running system file checker tool to fix possible corrupted registry.You can follow steps below and see if it will help. 1. Open an elevated command prompt. To do this, right click the Windows button, and then select Command Prompt (Admin). If you are prompted for an administrator password or for a confirmation, type the password, or click Allow or Yes.2. Type the following command, and then press Enter. DISM.exe \/Online \/Cleanup-image \/Restorehealth - Note It might take several minutes for the command operation to be completed. 3. Type the following command and press Enter. sfc \/scannow - Note It might take several minutes for the command operation to be completed.","I did this and it just said \"Windows Resource Protection did not find any integrity violations.\" and didn't fix the problem.","Hi Jemprezeau, Thanks for giving it a try. have you tried installing the audio drivers?","Can you tell my how please. Thank you.","HI Jemprezeau, You can follow the instructions on the website below on how to uninstall and reinstall your audio driver.https:\/\/www.thewindowsclub.com\/download-reinsta...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","When it came to downloading the audio driver what it said was \"Search for the one you want and download it.\" I do not know which one I am supposed to download both options say \"Gaming Family Controller\" and when I tried to see the other categories under \"Downloads\" it was all just numbers and letters put together to me, I am confused further help is very much appreciated. Thank you.","I searched up which one I should download and downloaded it but it still didn't work.","Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.I suggest you to download the Audio Driver from the Manufacturer's website and install the same.Restart the PC after installing the driver ajd check audio.","What website?","Okay I fixed it by installing \"Realtek PCIe FE \/ GbE \/ 2.5GbE \/ Gaming Family Controller Software Quick Download Link\" from the official Realtek website ( https:\/\/www.realtek.com\/en\/downloads ) Thank you Rex A. and ArifAhmed2 for the help."]},{"symptom":"Cant update to windows 8.1        I just recently reset my pc by copying an image of a drive when i first got my pc in 2012. So now i'm stuck in windows 8 and I cant install any updates. I've tried going through the microsoft store and I get the error code 0xc19001a, my hard drive is not encrypted and can't find any solutions to my problem. The windows update manager in the control panel says there are no available updates, which I know is wrong since this OS is a dinosaur now.","solutions":["Update to Windows 8.1 from Windows 8If the above Microsoft method does not work:Read this information: Windows 8.1 - Update to from Windows 8Or save your Data and do a clean install of the exact same edition of 8.1 as 8 is.Windows 8 > 8.1 is a free upgrade released by Microsoft and this is a workaround if you are unable to get it via the Store, etc.@@@@@@@@@@@@@@@@@@@@@@@@@@You can download and create your own Windows 8.1 Installation Media to reinstall the Operating System with..\"Create installation media for Windows 8.1\"http:\/\/windows.microsoft.com\/en-us\/windows-8\/create-reset-refresh-media\"Download Windows 8.1\"https:\/\/www.microsoft.com\/en-us\/software-download\/windows8A similar Tutorial which may also assist you\"Create Installation Media for Windows 8.1\"http:\/\/winsupersite.com\/windows-8\/create-installation-media-windows-81In the first screen of this very simple wizard, you need to choose the following:Language. English – en-us if you're in the United States.Edition. Windows 8.1 (Core), Windows 8.1 N, Windows 8.1 Pro, Windows 8.1 Pro N, or Windows 8.1 Single Language.Architecture. 64-bit (x64 ) or 32-bit (x86)._______________________________________\"How to Create a Bootable USB or DVD with a Windows 8 or 8.1 ISO\"http:\/\/www.eightforums.com\/tutorials\/2227-create-bootable-usb-dvd-windows-8-iso.html   WarningThis will not work to install Windows 8 or 8.1 for UEFI. For that, see this tutorial below instead.UEFI Bootable USB Flash Drive - Create in Windows_____________________________________How to clean install:\"How to Do a Clean Install of Windows 8 or Windows 8.1\"http:\/\/www.eightforums.com\/tutorials\/2299-clean-install-windows-8-a.htmlMake sure that you read Section 4 about using generic keysIf you have a retailWindows 8 product key and want to clean install Windows 8.1or Windows 8.1 Update, then you would need to enter a generic key below to install unactivated with, and change the product key later on instep 22 below to activate with your Windows 8 key.If you have a retailWindows 8.1 product key and want to clean install Windows 8.1or Windows 8.1 Update, then you are good.If you have an OEM Windows 8product key and want to clean install Windows8.1 or Windows 8.1 Update, then you would need to enter a generic key below to install unactivated with, and change the product key later on instep 22 below to activate with your OEM Windows 8 COA product key.If you want to clean installWindows 8 Enterprise,Windows 8.1 Enterprise, or Windows 8.1 Update Enterprise, then you would need to change the product key later on instep 22 below to activate since Enterprise editions do not ask to enter a key at this step._____________________________________With Windows 8\/8.1 The Product Key on preinstalled Operating Systems (HP, Acer, etc) is embedded in the BIOS in the Motherboard, so that the lost and\/or worn C.O.A. Sticker problem is no more.When you reinstall it will pick up the Product Key and activate the system automatically.If it does not, follow these steps:\"How to Activate Windows 8 and 8.1 by Phone\"http:\/\/www.eightforums.com\/tutorials\/24636-activate-windows-8-phone.html\"Get help with activation errors\"http:\/\/windows.microsoft.com\/en-us\/windows-8\/activation-errors\"How to activate a Microsoft product by using Microsoft Product Activation Center\"http:\/\/support.microsoft.com\/kb\/950929\/en-us_______________________________________________If you do wish to\/need to keep a record of it:\"Windows 10 Embedded Product Key Tool\"https:\/\/neosmart.net\/blog\/2014\/windows-10-embedded-product-key-tool\/\"We’re proud to introduce the immediate release of our newest utility for Windows users: the NeoSmart Technologies Embedded Product Key Tool. Designed for users of Windows 7, Windows 8, and Windows 10, our embedded product key tool will retrieve and display the Windows setup product key embedded in the BIOS or EFI, allowing you to store it for safe-keeping or use it to reinstall Windows with an official Windows setup image.\"You can also use:\"Belarc Advisor - Free Personal PC Audit (Version 8.5c)\"http:\/\/www.belarc.com\/free_download.htmlOr:\"Product KeyFinder\"https:\/\/www.magicaljellybean.com\/keyfinder\/Cheers."]},{"symptom":"reset my computer        hi. im not computer savvy and i even have an older model but i want to delete everytrhing of my desktop but dont know how can someone guide me through","solutions":["You say Reset your computer in the title and delete everything on your desktop in the message you posted.Two completely different things.If you want to Reset your computer to new condition:There are many ways to do it:Here are the Key\/s to press at Boot to start the Recovery Process back to Factory Settings (new condition). Under each Manufacturer in the list below are the instructions in the respective links for you to follow on how to use their Recovery PartitionAcer – Press Left Alt + F10 Keys.\"Use Acer eRecovery application to restore your system or create recovery media\"http:\/\/acer.custhelp.com\/app\/answers\/detail\/a_id\/29934\/~\/use-acer-erecovery-application-to-restore-your-system-or-create-recovery-mediaAsus – Press F9This is how to use the Asus Recovery process.http:\/\/www.asus.com\/support\/FAQ\/1006133\/Dell – Press F8 which will bring up Advanced Boot Options \"Restore Windows 8 using the Factory image restore method in Dell Backup and Recovery\"http:\/\/www.dell.com\/support\/article\/us\/en\/19\/SLN155115\/ENDell Alienware:What is and How to use AlienRespawneMachines: Press Left Alt Key + F10eMachines Support - Answers, E-Mail, Chat - Restore Windows with a ...Fujitsu – Press F8restore to factory setting. - Fujitsu Support ForumGateway: Press Alt + F10 Keys - As Acer owns them: press Left Alt + F10 Keys as per Acer eRecoveryUsing Gateway Recovery Management to Restore Windows 8HP – Press F11 repeatedly at Boot.Follow these HP steps to do a Recovery to Factory Settings (new condition).HP PCs - Performing an HP System Recovery (Windows 8) | HP ...HP PCs - Resetting Your PC to Resolve Problems (Windows 8) | HP ...Lenovo – Press F11https:\/\/support.lenovo.com\/us\/en\/documents\/ht077084#restoreLG – Press F11 at BootPackard Bell: Press and hold the ALT key while pressing repeatedly the F10 key. Release the keys when a message displays that Windows is loading files.““Using Packard Bell Recovery Management to Restore Windows 8”http:\/\/packard-bell-scandic.custhelp.com\/app\/answers\/detail\/a_id\/26280\/~\/using-packard-bell-recovery-management-to-restore-windows-8Samsung – Press F4 at Boothttps:\/\/www.youtube.com\/watch?v=X0CiBXuMVGoSony Vaio – Tap F10 until the Edit Boot Options screen is displayedhttps:\/\/us.en.kb.sony.com\/app\/answers\/detail\/a_id\/36806\/c\/65,66\/kw\/windows 8 assist\/Toshiba – Press 12http:\/\/www.mytoshiba.com.au\/support\/items\/faq\/776@@@@@@@@@@@@@@@@@@@@@@@@Or:Windows 8.1: Reset To Factory Settings and Remove Personal Data@@@@@@@@@@@@@@@@@@@@@@@You can contact the Laptop\/Computer Manufacturer and order Recovery Media from them for a small cost.You can download and create your own Windows 8.1 Installation Media to reinstall the Operating System with..\"Create installation media for Windows 8.1\"http:\/\/windows.microsoft.com\/en-us\/windows-8\/create-reset-refresh-media\"Download Windows 8.1\"https:\/\/www.microsoft.com\/en-us\/software-download\/windows8A similar Tutorial which may also assist you\"Create Installation Media for Windows 8.1\"http:\/\/winsupersite.com\/windows-8\/create-installation-media-windows-81In the first screen of this very simple wizard, you need to choose the following:Language. English – en-us if you're in the United States.Edition. Windows 8.1 (Core), Windows 8.1 N, Windows 8.1 Pro, Windows 8.1 Pro N, or Windows 8.1 Single Language.Architecture. 64-bit (x64 ) or 32-bit (x86)._______________________________________\"How to Create a Bootable USB or DVD with a Windows 8 or 8.1 ISO\"http:\/\/www.eightforums.com\/tutorials\/2227-create-bootable-usb-dvd-windows-8-iso.html   WarningThis will not work to install Windows 8 or 8.1 for UEFI. For that, see this tutorial below instead.UEFI Bootable USB Flash Drive - Create in Windows_____________________________________To access BIOS\/UEFI - UEFI\/EFI configuration:https:\/\/neosmart.net\/wiki\/boot-usb-drive\/_____________________________________How to clean install:\"How to Do a Clean Install of Windows 8 or Windows 8.1\"http:\/\/www.eightforums.com\/tutorials\/2299-clean-install-windows-8-a.html_____________________________________With Windows 8\/8.1 The Product Key on preinstalled Operating Systems (HP, Acer, etc) is embedded in the BIOS in the Motherboard, so that the lost and\/or worn C.O.A. Sticker problem is no more.When you reinstall it will pick up the Product Key and activate the system automatically.If it does not, follow these steps:\"How to Activate Windows 8 and 8.1 by Phone\"http:\/\/www.eightforums.com\/tutorials\/24636-activate-windows-8-phone.html\"Get help with activation errors\"http:\/\/windows.microsoft.com\/en-us\/windows-8\/activation-errors\"How to activate a Microsoft product by using Microsoft Product Activation Center\"http:\/\/support.microsoft.com\/kb\/950929\/en-us_______________________________________________If you do wish to\/need to keep a record of it:\"Windows 10 Embedded Product Key Tool\"https:\/\/neosmart.net\/blog\/2014\/windows-10-embedded-product-key-tool\/\"We’re proud to introduce the immediate release of our newest utility for Windows users: the NeoSmart Technologies Embedded Product Key Tool. Designed for users of Windows 7, Windows 8, and Windows 10, our embedded product key tool will retrieve and display the Windows setup product key embedded in the BIOS or EFI, allowing you to store it for safe-keeping or use it to reinstall Windows with an official Windows setup image.\"You can also use:\"Belarc Advisor - Free Personal PC Audit (Version 8.5c)\"http:\/\/www.belarc.com\/free_download.htmlOr:\"Product KeyFinder\"https:\/\/www.magicaljellybean.com\/keyfinder\/Cheers."]},{"symptom":"I need to re-install my audio. can someone guide me in the process?        I had meant to delete a bluetooth device for an obsolete headset and somehow deleted the audio for my computer system entirely.  I've tried videos on YouTube with no success. Is there a step that would relead this and repair ? ","solutions":["See if this assists you.Do a System Restore to a date before you had this problem:\"How to Do a System Restore in Windows 8 and 8.1\"http:\/\/www.eightforums.com\/tutorials\/4692-system-restore-how-do-windows-8-a.html__________________________________________And\/or go to your Laptop\/Computer or Sound Card Manufacturer's website > look for the Drivers and Downloads Section > put in your Laptop Model Number > look for your Operating System > download and install the Audio, etc Drivers you find there.Cheers."]},{"symptom":"windows 10 - windows search is not working - allows only one character        In Windows 10 PRO, I'm not able use windows search option. I have indexed all my PC drives. I have mapped many external servers, there also not able to do the windows search option. I'm able to enter only one character in the cell. ","solutions":["Hi Ponnu,I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.A fix for search problems is coming in the next cumulative update.You may execute the steps here and check if it helps. https:\/\/support.microsoft.com\/en-in\/help\/452014...","A workaround;Right click the taskbar, go up to Search and make it Hidden.Now to search click on the Windows icon or hit the windows key and type your search.Let me know if this works for you."]},{"symptom":"Clean Install Windows 10        Technical Level : Intermediate SummaryIn Windows 10 the quality of the install is more important than ever before.  This compiles the very best install of Windows possible and is a game-changing learning experience that will make you permanently the master of your PC, because you will learn what works best while crafting a great install with your own hands.  Several million consumers have completed my installation tutorials without a single complaint and have a better install than any amount of money could buy.  Just be sure to follow the steps, which cover everything so that nothing important or irreplaceable is left behind.  I'll answer any questions in real time from the Comments section below and will not let you fail.DetailsTo save space some steps are illustrated by the blue links in the text.  Many steps may not apply to you, but if left out might affect someone else.  So proceed with patience and take your time.  To stretch the new install's setup out over days or weeks you'll learn better how each change affects performance or even make it a diagnostic install.Backup and PrepareDownload Media Creation Tool to create bootable installation media for your matching version and bit-rate.  Choose \"Create Media for another PC\" to automate creating a 8gb+ flash stick installer or download an ISO which can be burned to DVD.  Only if MCT won't work for you on any browser or PC, there's an alternate Microsoft Windows and Office ISO Download Tool. For best performance I would use 64-bit for 4gb or more RAM, 32-bit (x86) for 3gb or less RAM. You are entitled to use either bit version with each Windows license.  The new modern UEFI BIOS replacement requires 64 bit media - you can check BIOS mode in System Information or by presence of EFI System partition in Disk Management.  (To find a location type it into the Search box on Task Bar).If your files are not organized now is a good time to sort them into the User folders (Documents, Desktop, Pictures, Music, Downloads, etc. )for yournamed User account using one of The many ways to copy, move, or delete multiple files.  I find  the easiest way to do this is to browse on the left-hand Explorer bar to C:\\Users\\[Your User Account] to expand User folders, then in right hand pane browse to all locations with unsorted files and drag or copy them separately or in groups to the desired User folder on Explorer bar.  Finally, delete unwanted files from each User folder.For all browsers other than Internet Explorer which stores Favorites in the User folder of that name, exportyour bookmarks to Documents now.  Most browsers will also let you set up a sync to store your browser settings, Favorites and history in a Google account, Firefox Sync, or similar:Import or export bookmarks - Chrome HelpSync Chrome data across devicesExport Firefox bookmarks to an HTML file to back up or transfer bookmarksHow do I set up Sync on my computer? | FirefoxIn Edge export Favorites as an HTML file to your backup at Settings > Import from another Brower > Export to file.  Another method even if Edge won't open is to installManage Edge Favorites to export as .html to Documents on the Data tab.  This little app also gives fuller Favorites management like IE's.If your email is stored on your computer, Google how to back up specific mail and account settingsto get solutions like Backup and Restore all Outlook data and How do I import and export email, contacts, and calendars with Windows Live Mail? - Microsoft Windows Help. Back up stored log-in passwords in Credentials Manager following this[GUIDE] How To Backup And Restore Credentials In Windows 10 .Check to see where Quicken, printer scan-to folders, or any other user installed software is saving your data to include it in backup.  Don't forget toDe-authorize I-Tunes. Copy any Sticky Notes into Notepad and save file to desktop.Then back up your files externally by dragging or copying your named User account or activeUser folders to another hard drive, external hard drive, flash stick, disk, orOneDrive app.  Once copied to backup double-check all files made it intact.  After backing up to OneDrive confirm all files\/folders within have a green check mark, right click it's icon to Exit for the reinstall. You can also use the built-in app to Backup Windows 7User and System Files  (added back into Windows 10 Control Panel) orProtect your data files with Windows 10's enhanced File History tool which also applies to Windows 8\/8.1. The difference is that Backup does a scheduled backup of files and System Image, while File History additionally keeps past versions of files.  But there can be problems with automated backup during Windows 10 Setup so do yourself a favor and also drag your User folders and any other files you want saved to external or another hard drive, USB flash stick, OneDrive, DVD or CD before reinstalling.  Most importantly don't accidentally set up File History on the new install (wiping out your files) before recovering your files as shown here:How to correctly use File History to transfer data files to a new Windows 10 installation - TechRepublicYou can Rescue Files when Windows Won't Startfrom booted Windows installation media, System Repair Diskor Recovery drive to another hard drive or USB device. If you have a Factory Recovery partition it may not run after Clean Install.  You may want to makeyour Recovery Disks so you have a path back to factory condition, following the steps given inyour PC's setup literature or in the Manual located on the Support Downloads webpage foryour model computer. As an alternative to Recovery Disks you can save a WindowsSystem Image Backup or more flexible freeMacrium Reflect imageof your old install.  Windows imaging requires restoring to the exact same offset (partition position) while Macrium allows restoring it anywhere. A Factory install may have the Product Key embedded in BIOS as with Windows 8\/8.1 and will reactivate itself after install.  An embedded key should not need to be provided during install, but can beconfirmed by ProduKey which will list it under BIOS-OEM key.  You can also retrieve a Retail Product key with this toolprior to reinstall if you've misplaced it's documentation.Check if there is a newer BIOS\/UEFI firmware Update on the PC or Motherboard Support Downloads webpage, then follow install steps in the instructions or download's ReadMe file closely.  If in doubt ask for help from your manufacturer's Support, or in a thread here with make\/model in title to attract those who know.  Most important is to guard against any power cut during the update which reimages the BIOS\/UEFI chip on motherboard. Gather your program installers.For those lacking reinstall media for programs, you may find them on the program'sSupport Downloads webpage.  Favorite pre-installed apps may be found on the Downloadswebpage for your model computer or manufacturer-provided Apps Disk. Others may be found by googling or asking back here.  Some pre-installed apps may not be available for clean reinstall, but this is a good thing because factory bloatware diminishes performance so re-importing too much of it defeats the purpose of a Clean Install. I would only ever install the programs you need and use, preserve their installation media and Product Keys.  A good start to audit your present install's software, hardware and Product Keys is to runBelarc Advisor. If needed Office reinstallation media can be obtained viaManage, Download, Backup, & Restore Microsoft Office Products and activated with the Product Key you originally bought with it or audited usingBelarc Advisor orProduKey.  A good free compatible alternative to Office isLibreOffice Free Office Suite or OpenOffice.  You can also Try Office 365 for free to trial the new subscription Office suite fully integrated into the cloud.Many of the favorite apps needed and desired for reinstall are available in the free appNinite - Install or Update Multiple Apps at Once. This makes a custom installer you can savewhich keeps all app installers updated within.Just in case, save in advance your Wireless or Ethernet(wired) LAN driver in your backup so ifit isn't provided during install you can install it to get online quickly to install allWindows Updates - which will also provide and update drivers. Your network LAN driver canbe found on the Support Downloads webpage for your model PC or device. The exact make\/model willbe listed in your Device Manager under Network Adapters.Installing the ISOUnplug all other HD's and peripherals except ethernet cable to increase chances of startingup connected after install.  If not prompted for a wireless key during install it's likely you'll needto install the wireless driver immediately after getting to the desktop, or if ethernet LAN isworking you can wait for wireless driver to come in via Windows Update or import from PC or adapter maker's Support Downloads webpage.Boot the WIndows 10 installation media by powering up PC while pressing the PC's one-timeBIOS Boot Menu Key.   If you see a UEFI version of the bootable flash stick or DVD then choose that, as you have the modern UEFI BIOS which is more secure and stable and offers mouse support. An example of the difference is shown here:Legend: Each Boot Menu is slightly different. Above shows Windows Boot Manager which should appear as first boot device after a UEFI install.  P5 can be intuited as the DVD drive, while P1 is a Seagate Hard Drive - which can be determined by googling serial. The Kingston flash sticks are available to choose for UEFI install\/repair (preferred) or Legacy if one has set BIOS to Compatibility (CSM) mode and seeks older Legacy Install without the newer features.  The last listing is to Enter the UEFI firmware or BIOS setup to check over settings if needed, which may have a separate Key to Press to Access BIOS or be entered via Settings>Update and Security>Recovery>Advanced Startup.A UEFI install requires booting the installation media as a UEFI device, deleting all partitions to clear formatting. You may need to turn off Fast Boot in UEFI Firmware to boot UEFI installation media viaBIOS Boot Menu Key lest it bypass key.  A UEFI install should configure Windows Boot Manager as permanent first device in Boot Priority. For Legacy BIOS keep the hard drive set as first boot device, and use only theBIOS Boot Menu Key to boot media or another drive.  This avoids flash media restarting install when PC is rebooted during installation.   If Windows 8 or 10 will still boot you may alternatively need to access UEFI media or firmware from within Windows Recovery Settings as explained inWhat You Need to Know About Using UEFI Instead of the BIOS.Next insert the Product Key from retail packaging if you have one.  For reinstalling Upgrade or Factory install skip the Product Key by clicking link similar to the one shown below.   If this option does not appear it means an older or wrong version media is being used so make the latest from Media Creation Tool.  It will reactivate once you connect to the internet.Choose Custom Install, thento get it cleanest at the \"Where do you want to install Windows?\" screen(shown below) highlight each partition to select Delete.  None of these partitions will be needed in a fresh install and may interfere or build up a disk junkyard if left undeleted. (Note:  If you did not rescue files stranded in C using the bootable media step earlier, you can save them here.  Instead of deleting partitions, just click on C and choose Next withoutdeleting or formatting.  This will archive your files in C:\\windows.old.  But it is not as clean of an install.)After deleting all partitions it should look like this:Then either select the New button to create and format your partitions as you please, or just click Next to let the installer auto-create\/format only the necessary partitions and begin install - which makes it foolproof. If you create new partition(s) to format yourself, after selecting the size (in MB) you want for C, it will create small System partitions in addition to the actual Windows install partition C.  Leave these alone and choose the first large partition for the install.  In the first partitioning screenshot above you'll see a typical UEFI partition structure created for Windows 10 install.  The Recovery partition contains the bootable Repair console that in previous Windows was located on C, the EFI System partition contains the boot files, while the (hidden) MSR partition reserves 128mb for possible System use going forward.  The fourth partition will be C: and is where Windows should be installed.  If you want you can select a size for C: (a popular size is 100gb) that will leave Unallocated Space after it for Data or other partition(s} for your use - you can format both now or this can also be done later in Disk Management followingCreate and format a hard disk partition - Windows Help.  Legacy BIOS' MBR installs only create a 100mb System Reserved in addition to C partition. Whether to create additional partitions depends largely if you want your data in the Cpartition with Windows and programs, or have it linked from another partition to make the C partition backup image smaller for easier storage. This way if Windows 10 becomes irreparable you can re-image the OS\/Programs to C and thedata will be current and waiting safely in its own partitionas long as it remains untouched.  Programs however should optimally remain on C as most become integrated into Windows until individually uninstalled. Edit 10\/2019 During install you can create no longer create a Local Account, but must create or use a Microsoft Account.  Make sure this is an account you can receive a Security code from, but after install if you really don't want a MS account you can change it to a Local Account in Windows Settings > Accounts > Your Info > Sign in with a Local Account instead. After using Windows 10 for several years I do recommend signing in with a Microsoft Account for fullest functionality, later in Account settings replacing the password with a short PIN for convenience.  I also have no privacy concerns or see any performance problems with choosing Express Settings for fullest functionality.  Here is a fuller discussion Should you use a local or a Microsoft account in Windows 10? and Customizing Privacy Settings.  Later in Account Settings you can add Family members and other people.Expedite Updates and DriversImmediately after install check bottom right System Tray Network icon,  connect to your network if necessary. If no network connection or networks exist, right click the icon to Troubleshoot Problems. You may need to install your network driver saved earlier in backup to get online. Why can't I connect to a network? - Windows HelpTurn On System Restore in Windows 10:  Make sure System Restore is always turned on for C drive and has plenty of disk space apportioned, as this will be your first line of defense and allow you to roll back any undesired changes that affect performance. If Windows won't start you can System Restore or do other Repairs from Advanced Startup Options including the booted media or Recovery Drive. Once online type \"Update\" in Start Search box, choose Check for Updates, expedite the install (including Restart ASAP if necessary) of all Updates including Recommended -which may lag for several days if not expedited. This is how Windows 10 also delivers newer drivers. After restart go back to Check for Updates again until no more are offered. Next right click the Start button to choose from Power User menu the Device Manager.:Any drivers still missing or in error (with a !) in Device Manager after all Updates are installed can be found on theSupport Downloads webpage for the model PC or device, along with other OEM software whichyou can wait to see if you really need.Over time I'd compare drivers in Device Manager with those available on the PC or Device's Support Downloads webpage to install any newer drivers found. If you installa driver and it performs badly you can Roll Back on its Driver tab in Device Manager.Microsoft Display driver is a placeholder driver which only should be used when no otherpossible driver will install as it will not allow Sleep or Hibernate. So if Updates don't provide abetter driver, import it from the PC model's Support Downloads webpage – starting with Windows 10, 8.1, 7 driver, if necessary installed inCompatibility Mode. If this fails check the PC or device maker's Support Downloads webpage to let it scan for the needed download to install. Unknown Devices are often card reader drivers posted on the PC model's Support Downloadswebpage along with other drivers which may be revealed by a function still missing on the PCsuch as laptop function keys or keyboard lighting, or can be traced usingDevice Manager - Finding Unknown Devices.Co-processor, SM Bus controller, USB and Storage controllers are often elements of thechipset.  If no chipset is posted on your PC or motherboard model's Downloads page, useIntel Driver Update Utility,Automatically Detect NVIDIA Products or  AMD Auto-Detect  to find your chipset and\/or Display driver, or ask in our Installation forum.You can also trace any missing driver using Hardware Identification. It's often faster to googlethe Driver's Details tab Hardware ID (from dropdown menu) than to look it up - seeUpdating a driverwhich covers this thoroughly.  In the results be careful to screen out tricky driver finder ads in favor of actual driver downloads. If you need help finding a driver, you can ask back here or start a thread here with descriptive title for broader attention.I would not re-import any Factory OEM software until you run for awhile to know for sure youneed it. There may be patches on the PC's Support Downloads webpage needed to improveperformance so browse them to be aware what's available as you test performance to decide ifthey're needed. But keep in mind re-installing OEM bloatware besides that which is absolutelyneeded for good performance or a specific function you want and need defeats the purpose of a CleanReinstall.  In general factory utilities duplicate and interfere with better versions built into Windows.  Exceptions include any battery management or drive locking software for laptops if these provide safety or monitoring functions beyond what Windows offers.  I always ask Google about each bloatware to see what it does but it really has to sell me to allow it.  Another good resource isShould I Remove It? Reinstall programsInstall programs slowly over time to gauge performance changes after each. You can roll backbad effects of a Program install or Update(s) by uninstalling it or usingSystem Restore.  Often these will not repeat but if so check you have the latest Net Framework from Microsoft or report it back here.  The new Microsoft Edge browser is still a work in progress yet I find it faster than most others, although I still need a smallManage Edge Favoritesapp to get full IE-like Favorites management.  Edge also opens .pdf's so you no longer need to install a Reader unless you want another.  Install your preferredReader,Browsers, and Flash Player, declining the Optional offers.  I no longerrecommend installing Java unless you know you need it or are prompted to install it to run atrusted program or web page, as it is an infection path.One of the best things you can do to improve performance is to right click Start Button, choose Task Manager, on Startup tab Disable everything except Flash updater, Sync program,on-demand scanner, or a messenger you need running at all times.  None others are needed and only write themselves there to spy on you. Then type msconfig in Start Search, open System Config, on Services tab tick the box to Hide all MS Services, disable everything else there too.  Check back periodically to keep these lists as clean as possible.  If you have any questions about a listing, Google it to learn what it does or ask us.  For example, no wireless manager or extra software except Windows' needs to be in between your PC and router. There is no need to install any other anti-virus protection than built-in Defender which assures best OS performance and is perfectly adequate for those with safe browsing habits.  If you get infected then add the inexpensive Real Time protection from the best-in-class scanner Malwarebytes as no one who I've advised to do this has ever gotten infected again. To add a USB  printer plug it in and monitor it's installation progress in Settings > Devices.  For a wireless printer and to scan from printer top to PC install the full software package from the printer\/scanner's Support Downloads webpage, otherwise just the simple driver installed by Windows or Windows Update is often enough. To set up a Home Network see these methods :  How to set up network file sharing on Windows 10 • Pureinfotech.  Note that Homegroup is removed in Version 1803.Take some time to get to know the Apps in the Start Menu.  You can right click any of the Live Tiles to remove them, right click any in the Apps list to Pin them, left click and hold to drag them wherever you want, delete headers and drag Tile up onto the Tile above to fill the header space, then right click to resize them to display more information. 10 Ways to Customize the Windows 10 Start Menu For example, I use Windows 10 Mail to collect all of my webmail accounts in one linked Inbox with a large ad-free reading pane.Windows 10's Built-In Mail App: Everything You Need to Know | PCMag.com.  On the Start Menu when enlarged it's tile displays new mail, Weather tile displays 3 day forecast, People App displays social media updates, News and Finance apps display customized news briefs throughout the day (and can also be set to pop up news alerts), Calendar displays my events, Pictures app displays latest pics.  I enlarge these tiles to show as much as they will.  The Start menu will expand or contract to accommodate what you want up to full screen.  You can include more of your User folders on Start Menu (like Windows 7) at Start > Settings > Personalization > Start > Choose Which Folders Appear.Allowing Notifications in Settings for your favorite apps gets real time alert sounds or pop-ins for new mail, etc. above the System Tray and stored in Action Center there.  It is all very useful and I'm adding a new app every few months as I get to know them.  Or you can turn off any Notifications you don't want and even Uninstall Apps you don't want.Recover your user filesBefore copying your files into the new install, now would be a good time to download, installand run a scan on them with Malwarebytes to make sure no infectionis being reimported.  You can turn off the trial version in Settings to use MBAM as an on-demand scanner which is best. If you used the automated file backup from Windows 7 then you can reimport your files by typing Backup in Start Search to open the Backup Center. Restore files from a backup - Windows HelpIf you have a smaller drive you can now store your files in OneDrive on demand to only access them on the PC when you need them:  https:\/\/www.pcworld.com\/article\/3233488\/windows\/onedrive-files-on-demand-how-to-enable-it-in-windows-10-fall-creators-update.htmlOther methods to manage smaller drives here:  https:\/\/www.groovypost.com\/howto\/maximize-storage-Space-low-capacity-windows-10-devices\/https:\/\/www.pcworld.com\/article\/3040404\/windows\/more-space-how-windows-10s-storage-analysis-helps-you-free-up-your-hard-drive.htmlTo restore files from a Windows 8, 8.1 or 10 backup type File History in Start Search, choose Restore Your Files with File History.  Restoring files from Windows 10's File History - TechRepublic To manually copy your files into the new install open the storage folder, open each User folder(Documents, Pictures, etc.).   From the Organize tab choose Select All, drag the group tothe corresponding folder under This PC\\C:\\Users\\YourUserName on Explorer bar at left.Wait until the bar stops unfolding and hypertext confirms the precise copy location before releasing the left click.If this method makes you nervous, right click on the file group to Copy, then openthe corresponding target user folder, in an empty space right click to Paste.Do not copy hidden AppData folders from User Accounts as these are a corruption path - another reason not to use file transfer apps, which can also lose files.If you're using a separate data partition copy your User folders to it, then you can  movethe new install's active User folders location to there followingHow to Change the Location of User Folders in Windows 10.  If you move the User folders use another Backup Imaging app likeMacrium Reflectas Windows built-in System Image Backupwill want to include the data drive which now holds System files.I use two methods now to back-up and sync files:  I keep my Active User folders (Documents, Pictures, Downloads, Music, Desktop) across all my devices rooted in my OneDrive folder followingSync, Backup and Store your Files to the Cloud with OneDrive.  I also like Google's New Backup and Sync app which now can designate User folders to keep backed up to the cloud in real time.The User Favorites folder will populate IE Bookmarks.. Import another browser's Bookmarksfrom HTML file backed up previously. Edge can import Favorites from other browsers in Favorites settings. Copy Quickbooks and other Program data into it's defaultfolder location. Activate the OS If the free Upgrade was activated previously then it should reactivate soon after connecting to the web.  If not use the new Activation Troubleshooter in Activation settings or open the Contact Support or Get Help app to ask for help.   Activation in Windows 10 If the PC has an embedded Windows 8 Home Product key from factory, note that latest media now available inMedia Creation Tool may force reinstall of Home version without a menu choice for Pro. If you already have Digital Entitlement for Windows 10 Pro on the PC then after install in Activation settings insert the default Product key for Pro VK7JG-NPHTM-C97JM-9MPGT-3V66T to change version to Pro, which should soon thereafter reactivate with the Pro version Entitlement. If you have a Windows 8\/8.1 Pro Pack Upgrade you can insert it's key in Activation Settings to reactivate. As of Sept 2017 the Activation Settings link to Change Product Key is still accepting Windows 7, 8 and 8.1 Product Keys to freshly activate Clean Installs.  Please notify us in Comments section below if this changes. See also How to get Windows 10 cheap (or even for free) | PCWorldHousekeepingType Disk Cleanup in Start Search to clean up what it finds, then typeOptimize to open Drive Optimization app which will defrag hard drives, and check trim on SSD's which shouldn't be defragged.  TypeMaintenance to make sure automated Maintenance is Enabled and functioning. Periodically run a full scan with freeMalwarebytes on-demand scanners, declining the Malwarebtyes trial in its Account Settings unless you're prone to infection - in which casepurchasing MBAM Real Time protection almost always resolves this when safely run intandem with Defender.   Avoid spyware tracking cookies placing annoying interest ads by periodicallyOpting Out of Network Advertising.  This will greatly relieve the banner ads which track your shopping habitsand web searches.The most important thing you can do to avoid spyware creeping in is to watch your programinstalls like a hawk at every step, because freeware authors have found ingenious ways tosneak in sponsoring adware with tricky check box choices - even in the License Agreement.  Always do aCustom install and only allow the features you know you want, check later to remove anythingextra in Control Panel>Programs and by running a full Malwarebytesscan which roots them out as deep as they can go. Keep an eye also on your Browser Add-Ons or Extensions to only allow the ones you know youwant or are required to make a page display correctly, including Flash, Shockwave, WMP orQuicktime plug-in, a reader.  Also under Add-Ons monitor Search services toremove any but Google or Bing in the stable browser search box, tick the box to disallow any others from sneaking in.Strange search services are often spyware. I only allow Google or Bing in the stable browser search box which on most browsers blocks spying.  What are browser Add-Ins (Add-Ons), Extensions and Plug-Ins and why do I care? You can customize Power Options by right clicking the Start Button to choose it. Most users only need the Balanced Plan at default settings.  Many users prefer selectingHibernate instead of Shut Down for \"Choose What Power Button (or Closing the Lid) Does,\" fromHibernate button in Start menu, or a Hibernate Shortcut or Hotkey,as it keeps in place your open work whilestill powering down completely and starts up much faster. Just remember to restart every few days to refresh things. Sleep and hibernation: frequently asked questions.  On smaller drives if Hibernate doesn't show up in Advanced Power Options (under Sleep) you may need to Free up space on your disk drive by compressing the Windows hibernation file.Solve any Sleep problems e.g. timeout failure following these reliable steps forHow to Fix Windows 10 Sleep Mode IssuesFor a nice introduction to new features in Windows 10 type Tips in Search and open the app.Microsoft has collected spectacular Themes collections to download and set as a slideshow.  These will install in a Menu to choose between at Settings>Personalization>Themes.  After changing Theme set Screensaver (at Settings>Personalization>Lock Screen>Screensaver Settings) to None to avoid unnecessary screen timeout.    After Version 1903 turned the Light Theme dull grey, here isHow to get back the colored Taskbar and Start Menu after May 2019 - Microsoft CommunityI no longer recommend using Windows built-in backup features as I've seen them lose too many files - better to manually drag your User folders to external periodically and save a System Image backup in case Windows ever becomes irreparable.  Then add one real-time free fire- and theft-proof cloud backup like built-in OneDrive which automates sync of Desktop, Documents and Pictures folder usingFolder Protection, or all User folders following Sync, Backup and Store your Files to the Cloud with OneDrive;  also Google's New Backup and Sync app which lets you designate any folders to keep backed up to the cloud in real time with 15gb free.  I use both.File History backupis worth considering for it's Previous Versions feature it adds to File Explorer, but a risk is in restoring files when some users mistakenly proceed to set it up on the new install again and wipe out their files.  See How to correctly use File History to transfer data files to a new Windows 10 installation.Also create your first imagewhich can be used in place of reinstall in 20 minutes. Note that built-in backup imaging limits where you can restore the image so if you want a better and more flexible app which can restore anywhere I recommend free and fully automatedMacrium Reflect. Windows 10 is remarkably adaptive so you can even move it to new hardware without adaptive software, although it needs reactivation after any motherboard change. Reactivating Windows 10 after a hardware change I try to respond to the Comments section below the same or next day at latest.","solutions":["Good one Greg must of taken a weekie to make it into a wiki :)Look forward to more ;) I guess I should add there have been a couple torrent downloads popping up for win-71 from Germany and another mirror of digital river downloads from a TechNet member ;)Not sure if I should post a link though what do you think ?Cheers. ","Nothing less than official, Mike.My others I've moved or written here so far:  Windows 10 Install Integrity ChecklistOvercoming Windows 10 Upgrade FailuresTroubleshooting Windows 8 and 10 Failure to Start - Microsoft CommunityTroubleshooting Windows 7 Failure to Start - Microsoft CommunityClean Reinstall Windows 7Post a screenshot of Disk Mgmt - Microsoft CommunitySync, Backup and Store your Files to the Cloud with OneDrive  After MVP Summit I should have a bunch more.","Nothing less than official, Mike.My others so far:  Windows 10 Performance Troubleshooting - Microsoft CommunityClean Reinstall Windows 7Post a screenshot of Disk Mgmt - Microsoft CommunityAfter MVP Summit I should have a bunch more. Sweet ;)","over my head","Did you have any specific questions Rodger?  Anything in particular that is hard to understand?","I have a new ssd and was planning on clean installing to this , disconnecting my old drives, currently I run a free upgraded 32bit version of Windows 10 , can I clean install a 64bit version and activate without problems?","Yes, should be no problem at all if you stick with the steps here.  Let us know how it goes.","Greg, excellent tutorial but I'm a little unsure about doing a clean install on a multi partition drive.My system has Win 10 (free upgrade from Win 7) installed on a 5 partition drive (C thru G).  Windows is on C along with installed programs.  \"My Documents\" & program installation files are on D.  The other partitions are for various other data files.Can I successfully 'clean install' on C without wiping out D thru G? My C partition is 130 MB and I'm okay with wiping it out diring installation.  I just want to be able to keep the other partitions intact.Thanks.","Hi Dan -If you'll Post a screenshot of Disk Mgmt - Microsoft Communityback here I'll look it over for possible problems.  Absent any, you can always protect a data partition during reinstall by making doubly sure not to touch it at any time during install.  What I do when I have data partition(s) is delete all of the other partitions to Unallocated Space, then create and format the partitions needed for install in that space.  Again, as long as you don't touch the data partitions then I've never seen it affected.  In addition always unplug all other hard drives\/SSD's during install to avoid interference.However,  data should always be backed up externally or to the cloud because a hard drive or SSD can die at any time.  An easy free way to do this and also consider synching your files to your other devices is atSync, Backup and Store your Files to the Cloud with OneDrive - Microsoft Community","Thanks Greg. Your second sentence answered my question.I've been running Windows 10 since the middle of August when I ran the free upgrade over windows 7. Then, two days ago it somehow got really messed up.  It takes 45 minutes to boot and the C drive is continuously active.  I can't get IE to run.  Many problems! In the old days when something like this happened I would just put the Windows CD in the drive and just rerun the the OS installation. That would usually solve problems like this. So I plan to create the windows 10 installation media and just reinstall to the C Drive following your instructions. What do you think of my plan?"]},{"symptom":"autolt error is occuring after the start of laptop (windows original).         please explain the problem .","solutions":["Hi G. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.https:\/\/www.computerhope.com\/cgi-bin\/process.pl...Download, install and run a full scan with the most powerful on-demand free scanner Malwarebytes:https:\/\/www.malwarebytes.com\/mwb-download\/.In the Scan Settings first set it to include scanning for Rootkits. If necessary run it in Safe Mode with Networking, or Safe Mode accessed by one of these methods:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... Clean up anything found, restart PC and then run again until it comes up clean. Check for any remainders in Settings > Apps > Apps & Features, and also in each of your browser's Extensions, Home Page settings, Search service or Add-On's as shown here:https:\/\/community.box.com\/t5\/How-to-Guides-for-... Then check for damaged System Files: https:\/\/www.lifewire.com\/how-to-use-sfc-scannow... If it cannot repair them see Step 10 here to continue: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If you want to keep Malwarebytes as an on-demand scanner then you can turn off its Real Time trial version in it's Settings > Account Details tab.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"bad system config info        How do I fix this?* Moved from education","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query related to the error that you are receiving on your PC. For further clarity on the issue, please respond to the questions below: Which build version of Windows 10 are you using currently?Are you aware of any changes made to the PC prior to which you weren’t facing this issue?When do you receive this error?What is the complete error message you receive?Are you able to boot the PC to desktop? Refer the article Which version of Windows operating system am I running? Usually, we receive this error when there is an error in registry of the system. For more information you may want to refer the articleBug Check 0x74: BAD_SYSTEM_CONFIG_INFO I would suggest you to refer the article Error 0x74: Bad_system_config_info and see if that helps. Note: Before performing Reset of the PC, please make sure you have a backup of user data. Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator"]}]}