{"windows":[{"symptom":"How to manually reinstall bluetooth drivers?        My bluetooth service on my laptop was acting up, so I uninstalled the drivers to get windows to reinstall them. I had already done this once before, so I was sure it would work again. Of course, it did not. Now, I just have no bluetooth drivers and can't use bluetooth period. Is there any way to reinstall those drivers manually? I've already reset my computer probably 6~7 times since then, so I doubt that would work. Thanks in advance.","solutions":["Hi Jordan,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Yes you can manually install the driver package from the manufacturer. What is the make and model of the computer?Also did you check for Windows updates? Often it downloads the same for you.","It's a Dell Inspiron 15 3000, and I think the model is an Inspiron 3583, but I'm not sure if that's the model or some other number. I have done a windows update since then and it did not reinstall the drivers. I also went on the Dell website and it told me that I had some drivers that needed to be updated. After I updated them, still not there.","Press Win+S then type System information then hit enter.From the System Information window you can get the model name of your laptop.Then go to dell support website and install drivers for that desired model.","Thank you. Here is the link for the Bluetooth drivers - one of these should work.Intel https:\/\/dl.dell.com\/FOLDER05867607M\/2\/Intel-AX2...Qualcomm https:\/\/dl.dell.com\/FOLDER05859543M\/2\/Dell-Wire...Qualconn 9377 https:\/\/dl.dell.com\/FOLDER05821208M\/1\/Qualcomm-...Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","I installed all 3 of them and my drivers still aren't showing up in the device manager. I reset the laptop as well to make sure it wasn't an issue of just needing to restart. I have no idea why nothing is working.","Because a reset hasn't helped, it might be hardware problem. I suggest contacting Dell's support for further steps as they know better of hardware."]},{"symptom":"why is my wallpaper always blurry and how do i fix it???        no matter what i set to be my wallpaper\/screensaver is comes out blurry on my screen.","solutions":["This can happen if the picture file does not match the size of your screen.  For example, many home computer monitors are set at a size of 1280x1024 pixels (the number of dots that make up the image).  If you use a picture file smaller than this, it will be blurry when it is stretched out to fit the screen.You can right-click your wallpaper and choose Personalize, then go to the Desktop Background section to choose another method, such as repeating the image in tiles, or only showing it centered with a color border.","i have a small laptop and a new baby niece and every picture i try to make my wallpaper comes out blurry.","what if the resulation of desktop low and wallpaper ressulation is high like desktop resulation is 1366 x 768 and wallpaper resulation is 2880 x 1800 and after that it will display pixlate or blurrythen what to do plz help?","Even if I do that, it won't work. Every size I try, even the one that fits my screen, I am 1366x768, nothing works!","Hey there,There's another method I'd suggest.  PNG files will not get blurry when transcoded for wallpaper use.Go to where your picture is stored. Right-click the picture file, choose \"Open with\" and pick Paint.Choose File, point to \"Save as\" and pick the PNG option on the right side.Save your file as this PNG option using any name you like.Close PaintRight-click the new PNG version, and choose \"Set as desktop background\"","I had this problem till I accidentally found when I swiped the screen up after it was unlocked a slider bar appeared that let me adjust the blurriness from none to totally blurry.  Fixed instantly, can't imagine why anyone would want it blurry.","There's no \"blurriness slider\" to choose your level of blur in Windows.  Whatever you found is something extra installed, maybe by someone else or even pre-bundled with the computer you bought. ","If the above didn't work, try this:https:\/\/www.youtube.com\/watch?v=0FgThAyv1hgCredits go to the creator of this video and I do not take any credit for it.","I logged in,just to say THANK YOU!! really man,you saved me. I tried everything,and nothing worked,but then I stumbled on this post,and BUM! its works perfectly :) Thanks man","Now, I do have this very same issue. I use a perfectly fine image of 1920x1080 pixels (just like my monitor).As of what I say is... It ought to be very so much beautiful indeed, however - unfortunaly I am afraid it is not.I have tried a few ways to reach prettyness - sadly in vain.I realised that .JPEG extension makes it slightly sharper than what the .PNG extension does.Very well then, it would be most appreciated if someone here would like to solve this disastrous matter of mine.Thank you in advance!"]},{"symptom":"Trying disable Hyper-V cause blue screen when windows restart        I'm trying to disable Hiper-v in order to uninstall VMware, which cannot be uninstalled if I have Hyper-V enabled.After I've unchecked Hiper-V (all) and Windows Hypervisor Platform from Windows features, restart is required, I click restart and windows crashes with the blue screen,on.You can find the minidumb and MSinfo32 files in this location: https:\/\/1drv.ms\/u\/s!AkKyp0HqtGvAqTR22-JAUQQT5BPv?e=Cg6LOmWhat can I do to avoid the crash and disable Hiper-V?Thank you in advance.Best regards,Claudiu","solutions":["Hi ClaudiuCh Greetings! I am Vijay, an Independent Advisor. I am here to work with you on this problem.A. Analysis Results File Name: 100819-8765-01.dmp SYSTEM_THREAD_EXCEPTION_NOT_HANDLED_M (1000007e) IMAGE_NAME: winhvr.sys *** WARNING: Unable to verify timestamp for gzflt.sys B. Third Party Drivers gzflt.sys - Bitdefender Driver date - Wed Oct 24 21:06:44 2018 C. Recommendations a. Create a system restore point first so that if something wrong happens you can revert.Type restore point in Cortana Search > Create a Restore point > Check whether against your drive, Protection is ON or not. If not ON, click Configure button below to Make it ON > Now press Create to create a restore point2. Update Bitdefender to latest. If BSOD doesn't stop, uninstall it and use Windows Defender in its place.","Hello Vijay_Verma,First of all thanks for your answer.I've updated Bitdefender to the latest version, I've disabled Hyper-v, BSOD appeared.I've uninstalled Bitdefender, I've disabled Hyper-v, BSOD appeared (new minidumb can be found here https:\/\/1drv.ms\/u\/s!AkKyp0HqtGvAqVWw_ncGYguS1whO?e=w4cNnc), BUT, after this BSOD, Hyper-v is disabled because the system wasn't restored anymore.After I will uninstall Vmware, I will try to enable back Hyper-v. I will come back with new minidumb if any.Thanks a lot for your effort on helping me fix the problem.Best regards,Claudiu","I also have this exact problem, but do not have bitdefender installed.Disabling Hyper V crashes on reboot to blue screen, cannot run virtual machines.If we cannot find answer, will have to have company remove windows installations and put linux in their place.  Then run windows in a VM","The same into my PC.. Disabling Hyper-V, doing the reboot will result into a simple \"Windows Update\" screen, after this, will result into the BSOD =\\","I have exact same problem. Not sure if someone was able to find the answer. I don't have a bitdefender install but have bitlocker enabled on disk. does it make any difference? This is annoying problem as I cannot create VMs on Oracle VirtualBox otherwise.RegardsAnand","I have exact same problem. Not sure if someone was able to find the answer. I don't have a bitdefender install but have bitlocker enabled on disk. does it make any difference? This is annoying problem as I cannot create VMs on Oracle VirtualBox otherwise.RegardsAnandHi Anand,I think that the best thing to do, is, to reproduce the error, get the minidumb, and create a new ticket similar to my, and someone will help you with your problem, based on your root cause.Best regards,Claudiu","You might try in Safe Mode or when using a clean boot.Are you using the Sandbox and the virtual desktop?Have you checked Disk Management to see if any space has been reserved for the Virtual utilities?  Would something need to be dismounted?","I have the exact same problem. Only got my system back because it \"auto repaired\" which in the process returned Hyper-V and \"Windows Hypervisor Platform\" back to it's installed state. I don't have bitdefender at all.After the repair it successfully booted into windows. I opened the features panel thing, removed both of those and restarted and won't boot again. Did the repair again and everything is back to \"normal\", given that I can't remove those two things which is preventing VMware software from working.","I am having the exact same issue, has anyone been able to resolve this?RB","I had the same problem and followed this link then I resolved it:LinkUncheck Hyper-V then click restartWhile windows is booting, press a key to enter BIOS (in my PC, it is Delete)Disable Secure BootSave changes and continueHope it helps."]},{"symptom":"Video issues        We have a second display and we are having issues with audio sync issues. The computer is showing high disk usage. Was wandering if that is the issue or if there might be other issues.please and Thank you.","solutions":["Hi Brandon. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) See fixes here for 100% disk usage: http:\/\/www.thewindowsclub.com\/fix-100-disk-usag...https:\/\/www.kapilarya.com\/fix-windows-10-100-pe...2) Update your drivers from the PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.3) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 4) If this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Update History, then uninstall them from the link there, and immediately check for these again and hide with the Hide Updates tool explained here: https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... You can also use System Restore from within Windows to get back before the problem began, then check for Updates with the Hide Update tool and hide them:https:\/\/www.windowscentral.com\/how-use-system-r... 5) If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....If that doesn't work you can also Go Back in Repair Mode as shown here: https:\/\/www.tenforums.com\/tutorials\/2294-advanc...6) If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1809 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... -------------------------------------------- But remember that in Windows 10 everything depends upon the quality of the install, and Factory or Upgrade installs are inferior installs which most enthusiasts won't even run because they'd expect endless issues. Consider now or later doing the Clean Install in this link which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... There is also an automated Fresh Start that reinstalls WIndows while shedding corrupting factory bloatware, saves your files, but doesn't clear the drive to get it cleanest:https:\/\/www.howtogeek.com\/265054\/how-to-easily-... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"unable to installing games        I can't install play 7 wonders ll cd games on windows 10","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,As per checking the system requirements of the game, the game was set to run under lower versions of windows. I would recommend running the compatibility troubleshooter on its installation file or its executable file for it to properly work for windows 10.Under this link are information and steps on how to run the compatibility troubleshooterhttps:\/\/support.microsoft.com\/en-ph\/help\/15078\/..."]},{"symptom":"Windows 10 now requiring password instead of PIN        Windows 10 Professional Version 1903, OS build 18362.295 – Intel Core i5-6500T, 16GB DDR4PIN has been established, recognized and saved. Up until a short while ago I had been able to sign on after a startup, reboot or waking from sleep. I don’t mind this benign extra security step and much prefer it to password.Dynamic Lock Sign-in option is disabled.Existing PIN was re-submitted and saved in Settings > Accounts > Sign-in options. Current Windows Hello PIN status is: PIN is all set up to sign in to Windows, apps, and services.In Settings > Accounts > Sign-in options > Privacy, both ‘Show account details’ and ‘Use my sign-in info’ have always been turned Off.Windows Hello identification data in Settings > Accounts > Sign-in options has not been removed.There have not been and are no existing bio-metric devices, Picture Passwords or Security Keys.What I’m uncertain of is what, if any, other Windows Setting I might try to revert back to PIN. Any constructive assistance would be greatly appreciated.","solutions":["In 1909, I have a \"Sign-in Options\" button under \"Forgot my password\" on theSign-in screen.  I can change from one to the other, & it will stick. I vaguely recall that might have gone missing in 1903.Why are you still Version 1903, OS build 18362.295? That is 9 OS Builds too old...https:\/\/support.microsoft.com\/en-us\/help\/4524570November 12, 2019—KB4524570 (OS Builds 18362.476 and 18363.476)What is going on at \"START, Settings, Update & Security, Windows Update\"? If stuck on something, clickTroubleshoot in the left pane, & try the Windows Update troubleshooter. Then go back & check for updates. After you take in ...476, you will be 1909.Good luck.","I appreciate the suggestions. However, I've tried Troubleshooting too many times to count, all with no luck. Zilch. A joke.As for my 1903 choice, I seriously doubt a more recent build would make much of a difference; but for now, let's just call it what it is: a choice.thanks again","It isn't just that your computer is 1903. It's that it appears to be frozen at OS Build 18362.295. Is that what you see at \"START, Settings, System, About\"...?...Yours is nine (9) OS Builds too few. And each one is a quality update that fixes a bundle of flaws each. Better go for it. I'm almost positive at some point in 1903 I could not switch back\/forth between PIN & Password. There was no \"Sign-in Options\" button.Actually, that last OS Build (18362.476), which KB4524570 brings in, will not install automatically, if it happens the way it happened to me. Instead, you are informed at Windows Update that it is available to lift the computer to 1909. Then, you must click it separately to allow it. It actually just turns on switches to turn 1903 into 1909. The reboot to complete its \"installation\" took less than 3 minutes.So - I think you can take in vital quality updates & not go the last step to 1909. Until you take in the vital ones, it really is fruitless to mess with settings in hopes of getting your pin back.Edit: I might be wrong that it is KB4524570 that does that little trick. It might be something else that will come in to offer 1909. Either way, you should get a choice - it will be optional - though I'm unsure it remains so forever.","So - I think you can take in vital quality updates & not go the last step to 1909. Until you take in the vital ones, it really is fruitless to mess with settings in hopes of getting your pin back.Edit: I might be wrong that it is KB4524570 that does that little trick. It might be something else that will come in to offer 1909. Either way, you should get a choice - it will be optional - though I'm unsure it remains so forever.I will take your recommendations under advisement. Thanks again.","You are welcome. Glad to be in your cabinet. If the demoncrats try to impeach you, I hope I will be able to say you upgraded. Good luck, & keep us informed.","Well I'm on 1909 Build 18363.535 on 2 machines,HOME on Desktop, PRO on Laptop. Laptop is fine with PIN... but Desktop is a veritable nightmare & the only solution left for me on Desktop is to delete all files in the \"Ngc\" folder which for which ownership is needed since it's \"SECURE\" & then reboot.Already tried about 7 methods with \"NO JOY\".Even from \"COLD BOOT\", Sign-in options does not work in \"PIN\" mode since no input  to the box is allowed unless changed to \"PASSWORD\" mode.With that done, I need the 1st character to be numeric... but when input, the character shows as a top-character, e.g. a \"!\"where the number \"1\" should have been.Of course all input is \"black balled\" so I look down & see that the \"CAPS Lock\" notification is \"ON\" but it really is not (no green LED showing).Next a simple return to the \"PIN\" mode \"s-o-m-e-t-I-m-e-s\" lets me type with numeric lock \"ON\" the 4 umbers I need & so I get to see my desktop... if I'm lucky. P.S. The keyboard is perfect in all \"Office 2016 Pro\" files like WORD or EXCEL.Perplexing to say the least since it was \"fixed\" by MS Tech Supp, & checked when fixed. Startup next day showed malady had returned.I've read that next update should repair with ability for no sign-on... Ho^! ","(1) In 1903\/1909, the \"C:\\Windows\\ServiceProfiles\\LocalService\\AppData\\Local\\Microsoft\\NGC\" folder is super-protected. You have to click your way to it folder by folder in File Explorer. Then you can see the folder, but can't open it or rename it...I had to cancel the operation. And I couldn't do it at a Command Prompt in Windows, either...C:\\WINDOWS\\system32>REN C:\\Windows\\ServiceProfiles\\LocalService\\AppData\\Local\\Microsoft\\Ngc  NGC-XXAccess is denied.Maybe it can be done at a Command Prompt in the Recovery Environment (Shift+Restart), but I don't think that's the problem. It would then allow you to set a new PIN code - but yours is good as eventually it does work. Also, it can be changed in the Settings screens, if it needs to be changed.(2) It sounds like you've got numeric keys on the keyboard & a separate numeric keypad as I do. Under normal circumstances, input into a PIN box must benumeric. Anything else is \"black balled\" as you say, i.e., it won't even show up. In a Password box, you do see it is the top-character getting typed. That should only happen when the SHIFT key is held - Caps Lock won't do it. Also, the shift key only affects the keyboard - not the numeric keypad. The numeric keypad only needs Caps Lock to be on. Somehow, when you switch back to the PIN, the number will be typed instead & will work.I find that...(a) Caps Lock & Num Lock both work in a Password box, & neither works in a PIN box.     (They won't beep, but the light on Caps Lock works & there is a message saying it's on.)(b) Caps Lock doesn't affect the number keys on the keyboard,      though it does reverse the effect of Shift on the letters.(c) If I turn Num Lock off, the numeric keypad is black balled in the Password box.(d) The PIN box still works, if I switched Num Lock off in the Password box & left it that way.I'm not sure what to make of it or what to suggest. I hope you are right a new update will fix it, but I don't see the issue is known...https:\/\/docs.microsoft.com\/en-us\/windows\/release-information\/status-windows-10-19091909 Known IssuesEdit: What about theEase of Access icon, the middle one at the bottom right of the Sign-on screen - does it show that Sticky Keys or Filter Keys are on? Try turning those off, then.","This does not answer the OP's initial question - and I have the same problem...PIN is fully set up, but it's is requiring me to enter password when I log on, reboot, start-up, etc. Sign-in Options gives me a whole host of methods to choose, with  PIN \"Recommended\". Clicking that only gives me a \"Change\" option (\"remove\" is greyed out). NoAdd, or Choose as Default, or Set, None of Face, Fingerprint, Picture (etc) are set up, only PIN and Password. If I remove requirement for passwordthrough NETplwiz, it also removes the requirement for PIN, so there is no security at all.My Windows 10 pro is up to date: 1909 build 18365.535This is a brand new machine (HP ProOne 440), and was OK with PIN only for the first 24 hours or so, before it switched to requiring password. Any advice how to return to the PIN option?","I wasn't responding to the OP's original question. My counsel to him was to become current in OS Build, then to upgrade to 1909. But you already are fully upgraded. So...My own Home edition is...And the PIN works well & can even be removed, at \"START, Settings, Accounts, Sign-in Options\"... Well, you've got Pro which has...https:\/\/www.tenforums.com\/tutorials\/79976-open-local-group-policy-editor-windows-10-a.htmlHow to Open the Local Group Policy Editor in Windows 10Have you looked in there to see whether there is a setting amiss? It likely has many settings not otherwise accessible.","Thanks. Unfortunately, as I mentioned, the option to Remove the PIN is greyed out and unavaible.The machine is brand new and I've never set up any Group policies as I don't have or work in any groups. It's just me. I set a PIN when first setting up and booting the PC, and that worked fine for a day or so, until it updated windows (it was originally on version 1809 I think). Then all options to use the PIN seem to have gone, although it's still there inSign-In Options saying it's ready to go. Any other thoughts?  Do you think I need to start playing with the Group Policy Editor when I have no idea what it's about or what it does? That makes me a bit nervous..."]},{"symptom":"Windows 8.1 - Can't read restored files        I have Windows 8.1 - I had to restore my passport backup onto my laptop when it crashed.  Now it says I do not have permission to access the files that I downloaded.  How can I fix this?","solutions":[]},{"symptom":"Can't See My TIF Files in Windows 10 Fax and Scan Utility        I just installed the Windows 10 Fax and Scan utility and it's otherwise working perfectly, answering the phone after the 2nd ring and placing all the FAX TIF files into the following folder:C:\\ProgramData\\Microsoft\\WindowsNT\\MSFax\\InboxI can see the files in there:But this is what I see in the Fax and Scan utility (supposedly pointing to this folder by default):I've been working on this all night and can't figure it out. Could it be that the Fax and Scan utility can't see TIF files? I'm perplexed.Regards,Al","solutions":["That is strange, Al. If you want to report this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems.If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it. If you are an Insider I can also vote it up with my MVP badge and track the issue for you.Keep in mind that you can also root your Documents, Pictures and Desktop folders in OneDrive now so they sync in real time, by using Folder Protection here:https:\/\/www.tenforums.com\/tutorials\/116029-turn...To avoid having two Documents and Pictures folders move them into OneDrive from the Location tab on their Properties box, using the existing OneDrive Pictures & Desktop folders as the ones you move them into. This has no downside as I've had my User folders rooted in OneDrive for ten years without problem following this method: http:\/\/www.dummies.com\/computers\/operating-syst..."]},{"symptom":"How  do a reinstall of windows 10 with usb        Trying to update win.10. Have done it 2 times and at the end it removes update and restarts. I can sign in with password. I get a screen with nothing on it but the task bar. But nothing works. Windows button  inop. I can go into command prompt but always says can't find it. I can't get into bios to get it too boot from USB.","solutions":["Hi, If you can't access your BIOS settings because of \"Password.\" Then Contact the device manufacturer for help and support. If you do contact the manufacturer online, make sure that you visit the manufacturer website and not the website of some third party.","Hi, If you can't access your BIOS settings because of \"Password.\" Then Contact the device manufacturer for help and support. If you do contact the manufacturer online, make sure that you visit the manufacturer website and not the website of some third party.Lenovo would not help with the password. They said i needed to get a new motherboard. :( ","Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.You might be able to access the recovery options by holding down SHIFT and choosing Restart if you can get the broken Windows to go that far.Make sure your recovery USB drive is plugged in first. When you get to the screen with only the taskbar try pressing CTRL-ALT-DEL - if that works you'll see a screen which includes the power symbol in the bottom right. Press and hold down the SHIFT key - while keeping it held down click the power button and then choose Restart... keep SHIFT pressed until your see recovery options.The recovery options have a \"Use a device\" option where you can then choose to boot from your USB install drive which would give you the option to reinstall Windows without needing to access the BIOS settings.Regards, David","Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.You might be able to access the recovery options by holding down SHIFT and choosing Restart if you can get the broken Windows to go that far.Make sure your recovery USB drive is plugged in first. When you get to the screen with only the taskbar try pressing CTRL-ALT-DEL - if that works you'll see a screen which includes the power symbol in the bottom right. Press and hold down the SHIFT key - while keeping it held down click the power button and then choose Restart... keep SHIFT pressed until your see recovery options.The recovery options have a \"Use a device\" option where you can then choose to boot from your USB install drive which would give you the option to reinstall Windows without needing to access the BIOS settings.Regards, David It said that it did not have a usb boot option. Thank you for trying."]},{"symptom":"DisplayPort connected to Intel Integrated Graphics        Recently I bought a DisplayPort cable to replace my HDMI cable. In NVIDIA control panel, it would say that the hdmi is connected to my gtx 1660 ti max q. Now that I connected my DisplayPort cable, it is now using the Intel UHD Graphics 630. I cannot find a way to change it to my NVIDIA gpu.","solutions":["Hi Eureka,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.The resources of Nvidia GPU would be used whenever there is a need for the same. So everything is alright and I believe no action is required from your end. If you want to disable inboard graphics you need to disable it from BIOS Settings if an option is there."]},{"symptom":"xbox companion app and xbox game bar party chat not working        I have been using the xbox companion app on pc to play modern warfare with friends who play on xbox (love the crossplay).  However recently whenever i try to join a party or invite people to a party we can't connect.  My NAT is open and network is good.  It literally just stopped working.  I have messed with firewalls and every other tip i can find online but nothing is working.the xbox game bar has the same issue as wellAlso my xbox works just fine and i have no issues getting into a party.  This just seems to be a pc issue.Any help would be great, thank you.","solutions":["Hey King Todd. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Try resetting the Xbox apps in involved in Settings > Apps > Apps & Features > App name > Advanced Options > Reset or Repair.If that's not enough re-register the apps from Option 2 here: http:\/\/www.tenforums.com\/tutorials\/3175-apps-re... Next try uninstalling each app in App Settings above, restart PC, reinstall from Store Settings > My Library.If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","ive done the repair and uninstall and installs. That has not worked.  Im not comfortable with doing the last step.  Thank you though","See how others have corrected Xbox party connection problems: https:\/\/beta.support.xbox.com\/help\/xbox-360\/xbo...https:\/\/www.reddit.com\/r\/xboxone\/comments\/3wcr0...https:\/\/windowsreport.com\/network-settings-are-...https:\/\/www.seaofthieves.com\/forum\/topic\/51818\/...Keep me posted on your progress as I will be here to help until the case is resolved.","its so retarded how Microsoft can solve a simple problem knowing everyone is having problems. And they still charge $100 for a windows key... pathetic","get your probs together. This is so sad how simple **** doesn't work","xbox companion app does not support voice chat any more it has been replaced with xbox game bar overlay but the new program isnt working for me"]},{"symptom":"Image size in Paint 3D        Is there a way to see the image size in Paint 3D? Not dimensions, but overall size (e.g. 2MB, 800 kb and so on). In Paint, I can see the size on the bottom edge, but I can't find it in Paint 3D. Sometimes I have to resize an image so it's not over a certain size, but I can't do it unless the size is displayed somewhere","solutions":["Hi EH. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See if this tutorial on resizing images in Paint3D gives you what you need to know:https:\/\/supergeekreview.com\/how-to-resize-image...If you want to express your opinion on this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems. If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hello, Greg.No, the tutorial didn't give me what I need to know, namely how to see the image size in Paint 3D. Not dimensions in pixels (those are perfectly visible), but the size in kilobytes or megabytes.","According to this guide, it displays the size in the Remix 3D pane shown below:https:\/\/www.howtogeek.com\/303492\/how-to-use-mic...","There is no Remix button or Remix panel in my Paint 3D. Probably because Microsoft is retiring the Remix site.","Well then I'm sorry. But I did give you a way to bring this directly to the developer's attention via Feedback Hub, and if you post back a share link to the Feedback I will endorse it with my MVP badge and track it.Hopefully someone else will know for sure, as I cannot find where it reports size on disk at all."]},{"symptom":"Windows continuously restart while doing system restore        Hi fellas, I'm doin system restore for about 5 hours, but it's not finish yet. It's keep restarting. What can i do to fix this? Please help me. It look like this or https:\/\/youtu.be\/oJJAHifM1mc","solutions":["Hi Darwin. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Power off the PC by pressing in and holding the power button until it cuts off. Wait 10 minutes to cool off then power on to see what happens, if it rolls back, continues of fails to start. If so power off two more times so that the third time starting will throw it into Repair Mode. Other methods here:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... Enter Advanced Troubleshooting Options to try to System Restore to before this, if that fails go back to Troubleshoot Options to try a Reset.It may be necessary to create bootable media to access Advanced Startup Options or do the Clean install:To create Windows 10 Installation Media on another PC install Media Creation Tool and follow the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, on second screen choose Repair Your Computer, then Advanced Troubleshoot Options, then System Restore, or the new Uninstall Updates button. If that fails go back to Troubleshoot Options to try a Reset.If that fails choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, click Next to let it create needed partitions and start install - this makes it foolproof. Everything needed to get the best possible Clean Install is here: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... It is a better install than any amount of money can buy and a great learning experience that will make you the master of your PC because you will learn what works best and how to apply it with your own hands. If you have files that aren't backed up you can use the same bootable media to try to rescue your files using these methods:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"my mouse wont work on my toshiba laptop        my mouse wont work on my toshiba laptop","solutions":[]},{"symptom":"groove music windows volume        Groove music always defaults to max volume on my windows 10 volume mixer(not the volume in the application) and I have to change it every single time. Why doesn't it remember the previous level it was at?","solutions":["Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.I saw some possible solutions to your problem. First, maybe you have a windows theme? and that your sound settings could be changed.To verify this, do this. Click on the start windows button and type \"control panel\" Then click on \"hardware and sound\" Click \"sound\"and \"Sound\" tab. -Change the Sound Scheme: to Windows Default and click Apply and OK. -Now open Volume Mixer and lower System Sounds again and now test your software. others methods is * Go to system tray, right click on Speaker Icon and select Sounds. * Now go to Communication tab, * There select Do Nothing radio button and click Apply and OK. Or Update driver through Device Manager and see if it fix the issue. a) Open run command by pressing Windows key + R and type “devmgmt.msc” (without quotes) and hit Enter.b) Spot and expand the “Audio inputs and outputs”. c) Right click on the High Definition Audio Device driver and select “Disable”. When it prompts to choose an option, click OK. Close the Window, come back and try to re-enable it. Now check if the issue still appears.d). If it does, then right click on the High Definition Audio Device driver and select “Update Driver Software”. When it prompts to choose an option How do you want to search driver, then go with Search automatically for updated driver software. If you have a driver available on your PC, then select Browse my computer for driver software, then select the appropriate location, where the driver located on your PC for updating it. (Ensure that PC is connected to Internet while performing this step)e). Once this is done, restart the computer to check the problem fixed. If it doesn't fix the issue, then Right click on the same driver and select “Uninstall” then restart the system and let the system install the driver automatically on Start. Check and see if it resolve the issue. (Recommended step) I took the information here https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"Installing Driver Doesn't Work        I have an Epson Perfection V300 Photo Scanner. It used to be installed on a computer running Windows 7.I just hooked up the scanner. When I tried to download the driver using Windows automatic search for the drivers function, it told me that no drivers are available.I went to the Epson website. I found the correct driver and downloaded it. When I click the file, it starts off saying its an Epson scanner file, but then it says it is installing Family Tree Legends (FTL). FTL is a genealogy program I installed that does not work with Windows 10. I uninstalled the program. I ran CCleaner. I restarted the computer. I downloaded the file again. Every time I go to extract the files, it does it as an FTL file. I then ran a different registry cleaner (Wise), and that did not help.I called Epson and explained the situation. They told me to talk to Dell or Windows.I am really up a tree! I need to get this scanner functioning. I don't know how else to troubleshoot this. Thank you.","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Odd that the install seems to be involving the FTP program! I have a look at the Epson website and the location to download the file seems to be here:https:\/\/epson.com\/Support\/Scanners\/Perfection-S... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. The file it will send you is \"epson13534.exe\" - does that match up with what you've seen happening so far?Once the file has downloaded, rather than using Open\/Run in your browser, go to your Downloads folder - find the file and double-click on it in there.If it still doesn't work can you provide any screenshots of what you're seeing please?Regards, David","Did you look in Device Manager and find the scanner?"]},{"symptom":"Open with context menu – remove Visual Studio items        I want to remove Visual Studio options of open with context menu for .xml and.html file types but under registry keysHKEY_CLASSES_ROOT\\.html\\OpenWithProgidsHKEY_CLASSES_ROOT\\.xml\\OpenWithProgidsHKEY_CLASSES_ROOT\\htmlfileHKEY_CLASSES_ROOT\\xmlfileare no relevant information.I suppose it is associated via ApplicationAssociationToasts key or right on some Visual Studio entry.Any advices?","solutions":[]},{"symptom":"USB Gamepad not working in Windows 10        HiI am using Redgear Smartline Gamepad for more than a year now and it has been working great with my Windows 10 laptop until recently. One day after plugging in the device, I received a notification that the USB device connected has not been recognized and may have malfunctioned. I tried a few times by connecting and disconnecting the gamepad but in vain. I reinstalled the driver that came along with the gamepad and after installation I didn't receive that notification and the gamepad's Analog light lit up and it showed up in my list of devices connected. However, I couldn't use the gamepad for any of the games I earlier used to play with the same gamepad. I decided to calibrate it. I went into my list of devices, went into the properties of the gamepad, but while calibrating, it showed that the device is not connected and asked me to retry. I disconnected and connected it again, and this time was able to start the calibration process but again the same notification popped up. But after disconnecting and connecting once more, the very fast notification that the USB device has not been recognized showed up once again. I would appreciate it anyone helps me with this problem, as I can't diagnose whether it's a problem with Windows or the gamepad. Unfortunately, I wasn't able to test it out on another machine but I will immediately update here once I do so. I am running Windows 10 1903.Regards","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I appreciate the efforts taken by you in resolving the issue. I understand that you receive an error, ‘USB device has not been recognized’ when you connect the Redgear Smartline Gamepad to your computer. I’ll help you with the issue. However, please let us know: Are you able to connect any other USB device to the computer?Are you aware of any changes made to the computer recently? I would suggest you to refer the troubleshooting steps mentioned in the articleError: “USB Device not recognized\" except for Method 1 & 2.  Alternatively, you can try connecting any other controller to the computer and check. Let us know how it goes. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Surface Pro X printing in negative to my Brother DCP-L2540DW printer        My brother printer is printing images in negative for example a paper with white text and black background from my Surface Pro X running Windows 10.  I found that in setting up the printer through the control panel it had set up Microsoft IPP class driver as the default for this printer and have read that this driver is the problem.   I have read that downloading the brother driver from brother directly should fix this issue, but for some reason (I think maybe the new chip which makes it that some software like photoshop and others will not run) the driver from Brother cannot fully install without error messages and exiting out.  I found something of a workaround here https:\/\/help.brother-usa.com\/app\/answers\/detail\/a_id\/167000\/~\/inverted-text-or-white-text-on-a-black-background-when-printing---windows-10  and I installed the Microsoft PS class driver which seems to work, but goes very slowly.   Is there a solution or a better driver that will work?  Thanks for your help","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I appreciate the efforts taken by you in resolving this issue. I understand that when you use the Brother printer you are getting a negative print out. I’ll certainly help you with the issue. However, please let us know: Are you aware of any changes made to the computer prior to this issue?Were you able to print documents properly earlier? As you have tried the suggestions mentioned in the Brother article, I would suggest you to refer the suggestions byAditya_Roy Replied on September 17, 2019 from the thread Printer keeps printing documents in an inverted color scheme and see if that helps. If the issue persists, I would suggest you to use the Uninstall Tool to uninstall the driver and reinstall it. You can find the Uninstall Tool in the Utilities section from:https:\/\/support.brother.com\/g\/b\/downloadlist.aspx?c=us&lang=en&prod=dcpl2540dw_us_as&os=10013 Let us know how it goes. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Offline Files and Drive Mapping        So I have kinda ran into a dilemma that I am very perplexed with the cause. I know it has something to do with Offline Files... As a side not we use direct access for our VPN. I had a user who was in Offline Files GPO, and when she would work from home her 'Home Drive' would map consistently upon login. However all her other network shares would not load consistently. Sometimes all of them would map, sometimes half of them would map, and other times none of them except for her home drive would map. Also when she was in the office everything worked fine. I did confirm when she was at home that Direct Access was working just fine, and was able to ping our servers. After having her troubleshoot her home network, we then re-imaged her computer she ended up having the same issue at home after her computer was re-imaged. Before her computer was re-imaged she was running 1903, I then re-imaged her to our latest 1909 image. She still had the issue at home after being re-imaged. The network drives that were not mapping consistently are all on different servers. I then had her bring her computer in and tested it out on a mobile hotspot and I was able to reproduce the problem. I then tested her account on my computer on the hotspot and everything worked fine. The only difference with her computer and my computer is that my computer is not in the Allow Offline Files GPO, while her computer is in the Allow Offline Files GPO. So we took her computer out of the Allow Offline Files GPO and then disabled it locally on the computer and after a reboot everything worked fine on a mobile hotspot. I am wondering what would be the potential cause for Offline Files causing other network drives to map properly while on a home network or hotspot? We are using Windows 10 Enterprise. ","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I appreciate the efforts taken by you in resolving the issue. I understand that Offline Files and mapped drivers doesn’t work on home network or mobile hotspot. As you have mentioned that when you remove the Allow Offline Files GPO the drives and Offline files work properly, it could be because of a Group Policy setting. Since the computer is running on Windows 10 Enterprise, we do have a dedicated forum for issues concerning to GPO and Windows 10 Enterprise, let me point you in the right direction. I would suggest you to post your query inTechNet forums, where we have support professionals with expertise on GPO and mapped drives to help you with the appropriate insights. I hope your query will be resolved at the earliest.  Regards,Nikhar KhareMicrosoft Community - Moderator"]}]}