{"windows":[{"symptom":"Transfer albums and photos to new computer?        If I organize all my photos and videos in the Microsoft Photos app on my pc, then get a new pc...what happens to all my files?Do I then have to reorganize all my photos and videos again? Or is there a way to transfer all the albums and such as they are to the new pc?","solutions":["Hi ,WitchyApril my name is Dennis, I'm an independent advisor and I'll do my best to help today. Unfortunately you will have to organize everything again, Windows does not have the transfer of the photos so that they all remain as they were on the previous PC.Regards, Dennis.","Hi ,WitchyApril my name is Dennis, I'm an independent advisor and I'll do my best to help today. Unfortunately you will have to organize everything again, Windows does not have the transfer of the photos so that they all remain as they were on the previous PC.Regards, Dennis. Thanks for your response.  That really sucks.  I wish Microsoft would come up with a way to do that.  I have over 20,000 photos...that will be a HUGE pain. ","Here I leave you how to send a suggestion to Microsoft so that in future updates they can add the option to transfer photos.https:\/\/www.windowscentral.com\/how-send-feedbac...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"MEMORY MAP NAVIGATOR PROGRAM ERROR MESSAGE        WHY IS MY PREVIOUSLY ( WHICH I HAVE USED SUCCESSFULLY FOR YEARS)   \"MEMORY MAP NAVIGATOR PROGRAM\"  SUDDENLY TELLING ME            \"A PROBLEM CAUSED THE PROGRAM TO STOP WORKING CORRECTLY,  WINDOWS WILL CLOSE THE PROGRAM AND NOTIFY IF A SOLUTION IS AVAILABLE\" I AM GETTING ABSOLUTELY  NO HELP FROM MICROSOFT OR MEMORY MAP  SO CALLED SUPPORT!!!  CAN ANYONE PLEASE PLEASE HELP!!!!! ???????                                                                                                                                                                                                                               ","solutions":["WHY IS MY PREVIOUSLY ( WHICH I HAVE USED SUCCESSFULLY FOR YEARS)   \"MEMORY MAP NAVIGATOR PROGRAM\"  SUDDENLY TELLING ME            \"A PROBLEM CAUSED THE PROGRAM TO STOP WORKING CORRECTLY,  WINDOWS WILL CLOSE THE PROGRAM AND NOTIFY IF A SOLUTION IS AVAILABLE\" I AM GETTING ABSOLUTELY  NO HELP FROM MICROSOFT OR MEMORY MAP  SO CALLED SUPPORT!!!  CAN ANYONE PLEASE PLEASE HELP!!!!! ???????                                                                                                                                                                                                                                1. Get your keyboard fixed as it is posting IN ALL CAPITALS.2. The App manufacturer are the ones to ask about problems with their App.3. We do not work for Microsoft.","THANK YOU FOR YOUR REPLY.....I AM WELL AWARE OF THE CAPITALS!!!! ITS MY CHOICE!!!!I NEVER SAID YOU WORKED FOR MICROSOFT!!!!!I WAS JUST HOPING SOMEONE COULD HELP ME WITH A FRUSTRATING PROBLEM!!!!BUT BLESS YOU ANY WAY!!!!","Posting in all capitals is considered SHOUTING on the net and also makes it very hard to read.Good luck with it.","MANY THANKS WISHING YOU AND YOURS A BLESSED NEW YEAR."]},{"symptom":"RFID reader via USB-C        I have ChinaReader rfid reader which detects the card and bleeps when it does but does not pass the information through to the website (have tried various browsers) that needs the info. I have tried connecting via the hub supplied with the Huawei laptop and with a converter; no luck! Reader works fine on older USB equipped machine.Any help gratefully received.Reader Model CR508DUWindows 10Huawei Matebook 13","solutions":[]},{"symptom":"SSD jams all Windows 10 after I plugged in HDD        HiSo I got a new disc for Christmas, so I plugged it into the computer I added a disk in disk management there, and it all looked fine. But after I wanted to shut down the computer, it didn't turn off, and I had to turn it off manually through the case. Next day I turn on the computer, all looks fine, but about 2 minutes after I wanted to play some games, I wanted to play Forza Horizon 4, It was loading and then when the picture disappeared, it instantly crashed. So I thought It was just some bug and I let it go. And after I wanted to looked some movie, so I turn on Windows Explorer, and then it lagged all my computer, and all I could do was restart it in the task manager. So i go to disk management and it was loading, so i was waiting a while but nothing, so i restarted my computer (of course manually again), then i instantly go to disk management and it worked, I don't know what to do there, so i did something but it didn't worked. After when nothing worked, I unplugged my new HDD, and I was sure it would be all fixed. After I turned on the computer it were same, after 1 minute nothing worked, some games were worked on microsoft store, but not all. So I went to the bios but I don't know how to use bios, so I was just looking. I found one thing, it was secure erase and it said on my SSD that is in frozen state. But after a couple a restarts it were again in ready state. But again after a couple restarts it were again in frozen state, so i really don't know what to do. So then I went to the disk management fast and shrink volume about 1,5 GB on my SSD. It worked! But then when I turn off the computer and plugged HDD, it were the same, so I restarted computer and fast went to the disk management, but now it didn't even load, So I again unplugged my HDD and tried to go disk management, but nothing happened, it didn't load... I watched many videos, pictures and pages but nothing helped me and nothing worked, so this is maybe my last hope and i really hope someone can help me with this.Thank you in advance!","solutions":["It's possible the drivers for the SSD might need updating as older on board drivers can be out of date with bugs. If you go to the manufacturers website and look under the support section for the hard drive, you might see the tools there. Use that and flash the drive. If there is any data on there and backup first. It is probably worth doing a full format on thee SSD, not a quick erase."]},{"symptom":"windows restoration        i just a new acer laptop with built windows 10 and after using about a month i installed linux and windows was removed. and after some time linux wasnt appropriate for day to day activities. i went to a cyber for help. They said they can put windows of 5 dollar . i wasnt satisfied so i asked them isnt there any way of restoring it but they didnt knew about that. so i just visited microsoft website and it recommended me of windows 10 and i downloaded it an my laptop was alike whem i bought it. but it has a 113 windows expiry .cant i remove that and make geniune windows?","solutions":["Hi Aaryan you can reinstall windows 10 anytime you wish, but it must be the same edition. check in settings -> system -> about, windows specifications to make sure you have the same edition (home, pro, etc) that you had originally.To get the best install, with fewest issues, use the media creation tool to create bootable media and clean install windows 10.make sure to get the same edition windows 10 (home, pro, etc) that you had before.during install, skip the pages that ask for a key, it will activate automatically when you go online.Greg Carmack's article can help in guiding you through a clean install https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"Microsoft one drive        One drive will not let me sign in, it has a message about scripts not letting you in. I uninstalled and reinstalled and it still has a Script error. Can someone please help me?","solutions":[" https:\/\/aadcdn.msauth.net\/ests\/2.1\/content\/cdnbundles\/ux.old.converged.login.pcore.min_ygi3z4hzs9earsjqesnbjg2.jsThis is the error message!!","It did not help.","Okay. Let's try this: Step 1 : Type Internet Options into your desktop's search bar (Cortana) Click Internet Options Click Security tab Click Default Level Click Ok Then go to Advanced and click Restore Advanced Settings Step 2: Then return to the Security tab and click \"Custom levels\" Scroll down the list and make sure \"Active Scripting\" is enabled. Hit apply then restart your computer. Please advise if this solves your issue.","I am using Firefox and don't see default level and I don't see active scripting I found default level but custom is marked and I can't get to custom levels","Please still follow the steps above it solves the issue for all browsers not just internet Explorer....For Firefox: Click the Tools drop-down menu and select Options. Select the Content section from the options at the top of the. ... Check the boxes next to Block pop-up windows, Load images automatically, and Enable JavaScript.Click OK.","found the tools menu and options and contents section. but not pop-up boxes","Oh it's under the Firefox Menu page. Alternatively, you can press ALT+T while in Firefox. That should bring up the file menu where you can access Tools :)","Just to confirm....are you trying to access Onedrive via your dekstop or your browser?","desk top. found tools, no pop up windows ","If I am wearing you out we can try again tomorrow. Let me know. I am using a pop up blocker, could that be part of the problem?"]},{"symptom":"Epson workforce 645 won't print: \"Currently, this hardware device is not connected to the computer. (Code 45)\"        As of 12\/30\/19, my wireless Epson Workforce 645 printer will not print from any device except the desktop to which it is connected via cable.  The printer's display shows the WI-FI at full strength, the power is on, and the router is working. I have looked at the device manager, where I found the above error message on the General tab.  Under the Events tab, there is this message (dated 10\/8\/19):Device SWD\\DAFWSDProvider\\urn:uuid:cfe92100-67c4-11d4-a45f-0026ab63d305\/uri:urn:uuid:cfe92100-67c4-11d4-a45f-0026ab63d305\/01 requires further installation.There is no option on the Driver tab to update drivers.I have gone to Epson's website and looked for any new\/updated drivers and found none.I have uninstalled and reinstalled the printer.I have restarted my Dell Inspiron 15 multiple times.I have run the Epson Diagnostic check.None of the above have had any effect.I am at the end of my limited abilities.  Can someone please advise?","solutions":[]},{"symptom":"color cast correction        Happy New Year 2020 to the Microsoft Community Tribe!Recently I began using Windows 10 Pro on my new home pc.  As a hobby I scan old family photograph negatives into digital files.  Some of these scans include a color cast, usually a shade of green. In the past I successfully used Adobe Photoshop Elements 11 to remove the cast from the digital file.  I think it would be easier to use the Photos application that came with W10 to do this sort of editing-is this possible?  Which Photos editing tools (Filters or Adjustments) and settings would be used for this?thank you","solutions":["Hi, there is a great guide on how to use the app on the link bellow:https:\/\/support.microsoft.com\/en-gb\/help\/27916\/...If that doesn't work, you can download an Adobe app from the Windows store"]},{"symptom":"wordpad        When I write 2 pages of script I want the first page indent as just for instance 1 and the second page as 3 how do I have different indents    as when  I go to 2nd page and change edges the first page changes as well?Carol","solutions":["Hi, unfortunately that's not supported in Wordpad, oh full feature programs such as MS Word or I think Libre Office as well."]},{"symptom":"Window 10 Update        ok Here is thing Yesterday i played Game and Everything was fine now today i start the laptop and it asked for restart for update then first Lap Fan starting making noise then it stopped after few hours my laptop start showing battery warning for replacement i got laptop 9 month ago and yesterday battery timing was 6 to 7 hours now it won't long for 30 minutes what am i supposed to do...? i have hp pavilion 15-cs0066txWindow 10 Pro 1909","solutions":["Hi Tasneem_Khan, I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.I would recommend to test your laptop's battery using HP's recommended tools. https:\/\/support.hp.com\/us-en\/document\/c04700771...Alternatively, you can generate a battery health report with powercfg. https:\/\/sea.pcmag.com\/gallery\/33124\/how-to-chec...Once you have determined the health of your battery, you may want to contact HP for hardware assistance.Let me know if I can help you further! Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Windows 10 from Windows 7        I have a laptop running Windows 10 Pro which is the only device currently listed on my Microsoft account. My old desktop is still running Windows 7. Can I update the desktop computer to Windows 10 without having to buy a whole new Windows 10? If so HOW?I have just run a full backup to my portable hard drive so I'm all set to give it a go.......I think :(Thanks ","solutions":["You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700Cheers.","Thanks Bill","You are welcome.Cheers."]},{"symptom":"restoring missing color box for pointer        I originally had color box for changing pointer but it disappeared when I executed recovery. Tried recovery again but it didn't retrieve original program.Possibly setting manual date might retrieve original Program?","solutions":["Hi retiree225 is this a program that is missing? which program? have you tried reinstalling the program? or is it the pointer colour option in settings -> ease of access -> cursor & pointer?you have performed a recovery, has that recovered an earlier version of windows 10?which version of windows 10 is installed? settings -> system -> about, look under windows specifications"]},{"symptom":"Outlook        Am considering leaving my BT email and moving to Outlook....I have the Microsoft email which I access from my Start Menu which always shows just my BT email messages,I seem to have an outlook account...at least I think so...an email page comes up when I go to Microsoft Outlook.The heading is 'Mail- ( then my name) it shows a great long mush of letters and numerals...and ends...@outlook.comIf I click on My Account...It goes to my Microsoft account where my email address is the BT one.How do I set up an Outlook email address that will replace my BT one should I change?Your advice will be appreciated.( please show 'chapter and verse' for any instructions.)FMR","solutions":["That's no problem and I'm pleased to hear all went well with setting up your Outlook.com address.You should be OK to delete (c) as your BT address is still listed under (a) as an account alias. I would recommend just to make sure that your new Outlook address still has \"primary alias\" against it, as if that's set to your BT address it can cause issues sending\/receiving emails to your new Outlook address. Steve","Hi Francis! I'm Steve, an Independent Advisor and a Microsoft user like you. I'm happy to help with your query.It sounds like you do already have a Microsoft Account but it's using your BT email address as your primary username. In order to create a Microsoft email address (@outlook.com) to use with your account, go tohttps:\/\/account.live.com\/names\/Manage and sign in with your current username\/password. Then under Account aliases click 'Add email address', n the next page choose your new @outlook.com address and click Add alias. Once this is created click 'Make primary' next to the new address.You will now have a BT and an Outlook.com email address, you can continue to login to your Microsoft account with either address. To set up your new Outlook.com address in the Windows Mail app please follow these steps:https:\/\/support.office.com\/en-gb\/article\/set-up... As to whether you should switch to Outlook.com email from BT, that's really down to personal choice. I would recommend to set up the Outlook.com account in the Mail app and use both together for a while to see which you prefer.Please let me know if I can be of any further assistance!"]},{"symptom":"Free Drivers        Free Drivers for my Computer? I have been paying $9.99 a month from some Driver Support company.I understand it should be Free?????","solutions":["Hi Wanda,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Yes these are absolutely free, there is no need to pay for drivers. Cancel the subscription and uninstall the program right away - driver updaters often install wrong or corrupted drivers.Though Windows update can take care of the drivers the best way is to get from the hardware manufacturer, which is also free of cost.Hope that helps.","Yes, they should be free, and they are free.Even more important, you should *not* get drivers from a such a company, not even if they supplied them for free. You have no idea how good those drivers are, whether they are infected with malware, etc. You should get drivers only only from the manufacturers of the hardware.You should cancel your subscription immediately.One other point: I don't recommend getting a new driver just because a new one is available.Although a driver upgrade normally goes well, it is not without danger. There is always a potential for there being a problem with the new one..Do a driver upgrade if you need to--because it provides new features that you want or because you are having a problem that the new version is known to fix--not just because one is available."]},{"symptom":"Windows 10 won't activate after pc reset.        My computer came with windows 10 on it. Recently it would not reboot after an auto update so I had to reset it. Now windows will not activate despite doing a fresh install and waiting over a week. I need help replacing the digital license.","solutions":["If it came pre-installed by the manufacturer then the Windows 10 licence key should be in the bios.Open a PowerShell (Admin) and enter wmic path SoftwareLicensingService get OA3xOriginalProductKey press return. Does it display a licence key?If not where did you buy the computer, was it brand new or refurbished. Is it known brand Asus, HP Acer etc.","Hi, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Get help with Windows 10 Activation errors: https:\/\/support.microsoft.com\/en-in\/help\/10738\/...https:\/\/support.microsoft.com\/en-in\/help\/12440\/...To better diagnose the issue, Please send us the results of both steps. 1. Right click Start>Command Prompt-Admin and type in the following command: slmgr.vbs \/dlv You will get a window, take a screenshot using snipping tool and paste it it next reply.2. Run the activation troubleshooter and send us the snip too. Using the Activation troubleshooter-Windows 10 https:\/\/support.microsoft.com\/en-in\/help\/20527\/...How to get a screenshot and post back: https:\/\/answers.microsoft.com\/en-us\/windows\/wik...Please let us know if you need any assistance in posting.","I copied and pasted your powershell commands and no key is displayed.  I used magic jelly tool to find key and entered it. I then received error code:Xc0000022. I purchased this HP new from Costco 6 months ago.","It doesn't sound like it originally had Windows 10 installed to me. In the PowerShell enter slmgr \/dlv press return to check the licence. Please post a screenshot of the resulting window.What is the full model name or do you have a link to the ad from Costco. Did you have anyone re-install windows since you purchased it."]},{"symptom":"Update history greyed out, HELP!        Why my update driver list in windows update history greyed out?","solutions":["Hi Adhiguna, I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.It is normal for Driver Updates in Windows Update history to be greyed out as there isn't a link to a support article.Let me know if I can help you further!"]},{"symptom":"Sorting files and folders numerically        Hi, I want to sort the files and folders numerically on my Windows 10 OS. If i give the name '01.Abc'  to a .doc and '02.Edf' to a folder then the folder is showing first and the doc as second in order. Please refer the screenshot. I want '01.Abc' shown first and '02.Edf' shown as second in order. Please help.","solutions":["Hi Surya, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.What you want to achieve isn't possible by default in Windows, because it is a somewhat unpopular opinion.I searched a bit and found two workarounds: 1. Use FreeCommander: http:\/\/www.freecommander.com\/2. https:\/\/answers.microsoft.com\/en-us\/windows\/for... You need to press enter if you have 1909 to make #2 work. I hope that helps. Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"Windows 10 Clean install - A Media driver your computer needs is missing        Hello there.I've run into an odd problem when trying to clean install Windows 10 64-Bit on my ASUS G73JH-A1 using a USB 2.0 Flash Drive and hopefully someone can point me in the right direction.I can boot the G73JH-A1 from my USB 2.0 Flash Drive that was created by the Media Creation tool located at:https:\/\/www.microsoft.com\/en-us\/soft...load\/windows10When setup starts I can get past where you select your language and keyboard type but then I run into an error that says: A media driver your computer needs is missing. This could be a DVD, USB or Hard Disk driver. If you have a CD, DVD or USB flash drive with the driver on it Please insert it now. Note: if the installation media is in the windows DVD drive or on a USB drive, you can safely remove it from this step.Any idea how to get around this?I was reading some other posts about this issue that other people are having on other computers and one solution was to use the 32-Bit version instead but I want to use the 64-Bit version. I've also read other posts saying that my download may be corrupted. So I've recreated my USB Flash Drive several times now to include both 32-Bit and 64-Bit even on a different computer. Same issue so a corrupt download is not the issue. I've tried using the 32-Bit selection and it works and does not report any missing drivers however the 64-Bit one behaves the same reporting missing drivers every time. What driver is missing in the 64-Bit that is present in the 32-Bit? Any ideas?Just for some background info, I was running Windows 8.1 on my G73JH-A1 and upgraded to Windows 10. It upgraded just fine and activated. I am not having any problems per say however I would feel a whole lot better running a clean install over and above an upgrade.When I clean installed Windows 8.1 x64 on my G73JH-A1 using my USB Flash Drive, I never ran into any issues.Any help for this issue clean installing Windows 10 using my USB Flash Drive would be greatly appreciated.Thanks.","solutions":["I had this problem too, and tried many times without luck. Finally, I found this answer from 2011:http:\/\/superuser.com\/questions\/279359\/windows-7-fresh-install-missing-cd-dvd-media-driversIf you are installing with USB drive, when it asks for driver, click Cancel. Once you are at the welcome screen, insert the USB drive to a different USB port. Then click Install Now to install.- worked perfect for me."]},{"symptom":"Google Drive Folder Disappears from Quick Access        Upon installation of Google Backup and Sync, the root Google Drive folder is automatically added to the Quick Access list. However, after a period of a few hours to a few days, the shortcut disappears from Quick Access. It can be manually re-added but always disappears shortly thereafter. I performed a fresh install of Windows on a new machine and encounter the same thing there. I also have Google Drive File Stream installed, which is linked to a separate Google account. The Google Drive File Stream root folder is also pinned to Quick Access but does not disappear as the Google Drive folder (from Backup and Sync) does. I am able to successfully pin folders within Google Drive to Quick Access (for example, the \"Projects\" folder found at Google Drive > Documents > Projects) and these folders do not disappear from Quick Access; it is only the root Google Drive folder that exhibits this problem. I only have one user account on my machines. How can I ensure the root Google Drive folder stays in the Quick Access list? ","solutions":["I've discovered that this is only happening to me when I have both Google Backup and Sync and Google Drive File Stream installed. It seems File Stream is overriding Backup and Sync's place in the Quick Access list. "]},{"symptom":"Attention Required-Email accounts        my email accounts are in need of \" require attention\", I update password to fix it and manage accounts, and still get Attention required, what am I doing wrong?","solutions":["Hi, I'm David an independent advisor and user just like you. I'll try and help you solve this problem.This often means there's a problem with the password you're using for the account or your email account has been blocked for some reason by the provider.I'm assuming you're getting this \"Attention\" message from the Mail app - it's sometimes hard to tell from the information shown there exactly what the problem is.A good way to confirm your email account details are working is to try and login to your email providers webmail directly - if that works you know everything is ok. If you can't login that way your provider will have a \"reset password\" type process you can follow to get back on track. So for example if the email address you are having trouble with ends with @outlook.com I would suggest visitinghttps:\/\/www.outlook.com and attempting to login using your details. Similarly if it ends @gmail.com you would visithttps:\/\/gmail.com, etc. Once you've confirmed, or reset, the password I'd return to the Mail app and attempt to reenter the verified details again.Regards, David","David,I have Windows 10 Pro.  I am constantly, as in two or three times a day, getting the message that my accounts are messed up and I need to fix something.  I click on the link, it takes me to the Email & Accounts and gives me the option to put in my passcode.  I do that and it tells me that everything is fine now.  But then, later on, it goes back through the same process.  I have seen comments about this on other posts...and they lead me to this comment\/question.  One of them talks about if your email address or addresses showing up in the \"Accounts used by other apps\" section, that I should delete them.  Is that correct?    I am currently showing two different Microsoft account email addresses under that heading.  Should I delete one or possibly both of those? Is that where my problem lies?  Thank you for your assistance. MARC"]}]}