{"windows":[{"symptom":"I have created another user on my laptop        Hi I have added my wife as a user on my laptop, however when she tries to log into iTunes the first thing we noticed was when typing an email address the key @ does not produce that symbol, where as on my user account it works fine, in my wifes user account when you press @ a \" comes up instead, I found a way to get the @ symbol and that is to press control and the number 2 key which give you the @ symbol, finally as there is clearly some kind of issue with this second user account she is unable to make purchases when logging in and when funds are clearly available in the iTunes account.Please helpRegardsMick","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.It sounds like your wife's account has the incorrect keyboard layout set, it will likely be set as US where it should be UK or the other way round.Please see this guide for details on how to change it: https:\/\/www.windowscentral.com\/how-change-your-...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"window s ten does not recognise   my toshiba external super multi drive PA3761U-1DV2        I have recently purchased windows 10  laptop and it does not recognise my Toshiba external super multi drive PA3761U-1DV2I don't  want get rid of my external drive which was working quite well  is a way I can get it to workthank you","solutions":["Defective disk? Test it on a different PC.","Not a defective disk works okay on Windows  7 and 8 just not ten","Not a defective disk works okay on Windows  7 and 8 just not ten Any Win10 PC or just yours?","It also does not work on  two of my friends laptops also does not work on a desktop ","It also does not work on  two of my friends laptops also does not work on a desktop What operating system do they use?","Standard  windows .32 bit and .64 bit other than that I don't know they have pc's not a  apple type ","Standard  windows .32 bit and .64 bit When I asked about the operating system I was after Windows 7 or Windows 10. 32\/64 bits are flavours that exist in Win7 and in Win10."]},{"symptom":"Update error code         I have an update error code 0x80070057 (2020-01-07-T-07_04_40P) how do I correct it?, the hamster wheel is going round and round trying to look for updates whilst upgrading from windows 7 to windows 10","solutions":["Do NOT reply to that scammer claiming to be from Microsoft Support.They have been banned."]},{"symptom":"screen broken\/using HDMI TV shows black screen with cursor        I haven't used this Windows 7 HP laptop in years but decided to try getting into it the other day. the screen has been broken so i hooked it to tv with HDMI & tried a few passwords but didn't manage to get into it. yesterday i tried again and started it in safe mode with command prompt but couldn't remember the instructions for bypassing pw so I turned it back off. I then remembered that awhile bk i had installed a program called \"ophcrack\" on usb thumb drive buy never got around to trying it. i found that & plugged it in & started the laptop. I started tapping f8 to try and make sure the boot order was set to USB 1st but the tv screen remained blank. the laptop screen however appeared to have a blue background (at least the top left corner which is all i can see due to it being cracked). i turned the computer back off and tried turning it on again without the thumb drive but it still only showed blk screen on tv. is there any way to get the picture back on external monitor without being able to see what I'm doing+ being locked out sur to forgotten password?!","solutions":["Do NOT reply to that scammer claiming to be from Microsoft Support.They have been banned."]},{"symptom":"cannot add my gmail account to mail app        I bought an asus ROG Strix G531GD_G531GD) two days ago and has been not able to add my gmail account to the mail app. I enters my mail id, and then the password, then the otp received to my linked mobile and then a window pops up which asks to click on \"AGREE'. After clicking on agree a dialogue box opens telling \"something went wrong\"\"Error code: 0x8000000b\"Please note: I tried with several google account id and even tried creating new google id from the  mail app also and the result is same error code.","solutions":["Hi JJ. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See fixes for Gmail not being added to Windows 10 Mail app: https:\/\/www.thewindowsclub.com\/windows-10-mail-...https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/www.groovypost.com\/howto\/add-gmail-emai...https:\/\/support.google.com\/accounts\/answer\/6010...If none of the above help, What often works is to go to Windows 10 Mail Settings (gear icon at bottom of Inbox) then Manage Accounts, then choose the problem account(s), then Delete the Account.Restart PC and retrace that path to add the account back. Make sure the Sync settings are as desired for how far back you want mail Downloaded from, whether to include Calendar and Contacts (People app). See this setup guide to make sure you get everything set as you like: https:\/\/www.windowscentral.com\/how-get-started-... If that's not enough then Reset the Mail app at Settings > Apps and Features > Mail & Calendar > Advanced Options > Reset. Restart PC. Try adding the accounts back to see if it works now.If that fails to fix it then Re-register Mail & Calendar app from Option 2 here: http:\/\/www.tenforums.com\/tutorials\/3175-apps-re... Finally if nothing else works reinstall the Mail and Calendar app from Option Two here:http:\/\/www.tenforums.com\/tutorials\/3175-apps-re... If you have broader performance problems go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"I am not receiving and updating new email since morning.        Hii am not recieving and updating new email since morning. what can be a reason ? i am thinking it been hacked* Original title: emails","solutions":["Hii am not recieving and updating new email since morning. what can be a reason ? i am thinking it been hacked* Original title: emailsI have no idea what email program you are using, or who provides it.","I am using hotmail ","Hotmail is now included in Outlook.com.Email one of your contacts and ask them to email you back to see if it is working OK.We do not work for Microsoft and have no access your email account or contact details.","Do NOT reply to that scammer claiming to be from Microsoft Support."]},{"symptom":"Automatic repair loop        Hello, my HP laptop is in an automatic repair loop.  I tried to go to advanced settings to refresh the computer and upon entering my admin password, it is saying the password is invalid.  I even tried to change my password with my Microsoft account and it is still saying invalid.  Any suggestions on how to get it out of automatic repair or why it will not accept my password?","solutions":["I can't only give you what Microsoft says to do about Passwords.\"What to do if you forget your Windows 8\/8.1 password\"http:\/\/windows.microsoft.com\/en-us\/windows\/what-do-forget-windows-password#1TC=windows-8If you've forgotten your Windows password, there are several ways to retrieve or reset it:If your PC is on a domain, your system administrator must reset your password.If you're using a Microsoft account, you can reset your password online. For more info, go to theReset your password webpage. If you're using a local account, use your password hint as a reminder.If you've tried these suggestions and still can't sign in:If you have Windows 8.1, you'll need to reinstall Windows. If you have Windows RT 8.1, you'll need to contact your PC manufacturer.@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Microsoft forbids any assistance being given in these Forums to help you bypass or \"crack\" lost or forgotten Passwords.Here is the Microsoft Information outlining that Policy:http:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_7-security\/keeping-passwords-secure-microsoft-policy-on\/39f56ef0-5d68-41ad-9daa-6e6019c25d37Cheers."]},{"symptom":"0xc000007b        when will this kind of issues be resolved by Microsoft. its 2020 and still we have to manually do these things. i m considering switching to some other OS, almost read all forums and about tried everything even the shady solutions but nothing changed.  Any suggestions ????? for alternative OS ?","solutions":["Hi Asad. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Were you going to tell us what the exact issue is that you're upset hasn't been fixed yet? Just giving the error code (which could be about 50 different issues) is not even a start.Please explain the full problem and I'll do my best to help you."]},{"symptom":"Problem with log in page        When i put in my password it says its not connected to internet but wifi button is on andit asks for an older password, doesnt take yhat either","solutions":["What password are you referring to?Is it Wi-Fi password or password in any specific website?"]},{"symptom":"Windows product key rubbed off        I  want to do a clean install with windows 8.1, but the product key rubbed off on my laptop.please Give me a solution.","solutions":["With Windows 8\/8.1 The Product Key on preinstalled Operating Systems (HP, Acer, etc) is embedded in the BIOS in the Motherboard,so that the lost and\/or worn C.O.A. Sticker problem is no more.To find it:\"Windows 10 Embedded Product Key Tool\"https:\/\/neosmart.net\/blog\/2014\/windows-10-embedded-product-key-tool\/\"We’re proud to introduce the immediate release of our newest utility for Windows users: the NeoSmart Technologies Embedded Product Key Tool. Designed for users of Windows 7, Windows 8, and Windows 10, our embedded product key tool will retrieve and display the Windows setup product key embedded in the BIOS or EFI, allowing you to store it for safe-keeping or use it to reinstall Windows with an official Windows setup image.\"You can also use:\"Belarc Advisor - Free Personal PC Audit (Version 8.5c)\"http:\/\/www.belarc.com\/free_download.htmlOr:\"Product KeyFinder\"https:\/\/www.magicaljellybean.com\/keyfinder\/Cheers."]},{"symptom":"Settings managed by administrator        Hello! I got a new work laptop last week with Windows 10 (I work for a university). It has been frustrating how limited it is because so many of the settings are managed by my administrator and so many features are disabled. I do not want to contact my IT because there stock answer is NO because my institution is part of a redneck state where free speech is prohibited. There are three things I am trying to do.1. At home, I would like to access my WD MyCloud NAS. Anonymous logins are not allowed from my computer. I tried some hacks I found online to allow for anonymous logins, but they didn't work. I set a username and password on the NAS and added them to the Windows Credential Manager. I still cannot access the NAS because windows puts my university's domain in front of the username (i.e., domain\\username). Is there any way I can access my NAS while at home?2. I would like to enable some of the cool features that my laptop has like Hello Fingerprint. Is there any way I can bypass the restrictions when Windows says \"This setting is managed by your administrator.\"3. I often work with SVG files, and on previous computers I used an extension so that I can preview them in Windows Explorer. Defender won't let me run that extension and I am unable to temporarily disable it in the Security Center because \"This setting is managed by your administrator.\" Is there any way around this?Thanks in advance!","solutions":["their not there (oops)","Hi Dissonance. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.About the most a Microsoft forum can help here is to suggest you plug your NAS directly into the PC to access it like a normal external drive. Most are able to do this.The rest are likely controlled by your IT Admin for various security reasons and only resolved by getting your own PC.You could probably get more helpful replies allowed by a site like Reddit, or one of the developer's forums where they are challenged by such questions and not limited by policies against enabling hacks that workaround IT admin policy. Examples:https:\/\/www.reddit.com\/r\/buildapc\/comments\/6fdg...https:\/\/www.quora.com\/What-are-the-top-10-websi...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Network Settings Alternate DNS Windows 10 1903        While troubleshooting network problems, I tried setting the IPV4 address manually and noticed the forth octet of an IPV4 Alternate DNS setting had been truncated from two digits to one digit. On my network the 4th octet of an IPV4 address should have been a two digit number, but only a 1 digit was displayed. I tried again to manually configure the network adapter settings, and on the Alternate DNS text box I entered the correct IPV4 address in the form of xxx.xxx.x.xx, but received an error message, \"Can't save IP settings, Check one or more settings and try again\". The dialog window for setting IPV4 Alternate DNS will not allow entering a value in the forth octet that has more than 1 digit, i.e. your can enter digits 0-9, but not digits 10-255. When switching back to Automatic DHCP it picks up the correct Alternate DNS value in the forth octet. Minor problem, but one that needs to be fixed.","solutions":["I've had issues too - wrote the correct IPs but Windows wouldn't save them for no obvious or clear reason.","I have the same issue (although there is no truncation). Tried with values:IP: 192.168.1.2Subnet Prefix: 255.255.255.0Gateway: 192.1.68.1.1DNS: 8.8.8.8I get no details other than \"Can't save IP settings. Check one or more settings and try again.\"","I'm getting the same thing, tried many times, it was working not long ago, i could change it to my hearts content. Any sort of explanation would be good, i keep checking the settings and trying again but that's useless info..","Currently running Windows 10 Pro 1909; I had this same issue, but realized it very specifically does not say \"subnet mask\". Apparently the \"subnet prefix length\" is looking for the bit number instead of the full subnet mask. So it will not accept \"255.255.255.0\", but instead requires the bit number equivalent: \"24\". I just tested your same values, but with the subnet mask replaced, and was able to save successfully:IP address:    192.168.1.2Subnet prefix length:    24Gateway:    192.168.1.1Preferred DNS:    8.8.8.8"]},{"symptom":"\"Unspecified\" printer        I cannot move my \"unspecified\" printer to the actual printer section.","solutions":["Hi Karen. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Have you installed the full software package from the printer maker's Support Downloads web page for the exact model. This is essential to having the full features work like scanning from Desktop on standby at all times, ink levels, etc.Rather than spending too much more time fiddling I'd simply Clean Install the printer which always works, lasts longer and actually saves time:1) Power up the printer, if wired unplug it's USB cable from PC. 2) Go to Settings>Apps>Apps and Features to find and Uninstall any printer software.3) Use one of these methods to remove all of the old printer drivers: https:\/\/www.tenforums.com\/tutorials\/101274-unin...https:\/\/helpdeskgeek.com\/how-to\/remove-uninstal...4) Now type Control Panel in Start Search, open CP, choose Icon View. In Control Panel open Devices and Printers, right click printer to delete Printer and any scanner or fax of the same name. Restart PC.5) Go to the printer model’s Support Downloads webpage to download and install the latest full software package. Now is also the time to check for any newer printer firmware to install which matters a lot.6) Extract Printer software, right click Setup file to Run as Administrator. Follow the setup screens closely as you install the software. For USB it should prompt when to plug in the printer.Older software may need to be installed in Compatibility Mode to run correctly: https:\/\/www.groovypost.com\/howto\/run-old-softwa... If you have further problems reply back with results of each step. Once it's installed and you've run a test print, then scanned it to see that it opens on the desktop, open the Printer software and go into its Settings to set the scan-to file location you prefer, also the email app you want opened for Scan to Email, if applicable.I hope this helps. Feel free to ask back any questions and let us know how it goes. If you will wait to rate my post until we are done, I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Desktop icons        This morning all was fine. This evening when I started my PC the desktop icons are huge. I have tried to resize them but they remain large. How can I restore them to their usual size?","solutions":["Hi Judith Open Device Manager (accessible by right clicking your Start Button) Expand the Display Adapter section What device(s) are listed there and do any of those have an exclamation mark beside them?Right click your Desktop, choose Display Settings Is your Resolution set to the one marked (recommended) and what resolution is that?Is Scale set to the one marked (recommended) and what scale factor is that?","Hi Judith. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Is the only distortion with the Desktop icons? If not please specify. Click on the desktop to get its attention, Hold the Ctrl key and slowly roll your mouse wheel forward or back to resize the icons to where you want them (or tap + or - key). This is the way to size items on the desktop as you want, and also to frame Windows like browsers so they have the size objects and type you want and are framed squarely within in the Window.If that doesn't help check in Settings > System > Display that the Scaling is set to 100%, also that the Screen Resolution is set where you want it to balance sharpness with object size.Your Display adapter is also key here. Make sure you have the latest from the PC maker's Support Downloads webpage for your exact model. While there check for the latest Chipset, BIOS, Sound, Network, USB3, Bluetooth and all other drivers to compare with the version\/date installled for that device in Device Manager reached by right clicking the Start Menu..The most basic thing we need to learn to maintain a PC is how to keep the latest manufacturer's drivers current. Windows Update drivers are never enough.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"how can I retrieve music files lost from wmp having deleted from library only as against from library an computer?        How can I retrieve music files lost from windows media player having deleted \"from library only\" as against \" from library and computer\" ?HELP ANYONE!","solutions":["Hi LiamHutchinson:If you still require assistance, please let us known your Windows operating system and Windows Media Player (WMP) version.  If you have a Windows 10 operating system include the version and build (see the How-To Geek articleHow to Find Out Which Build and Version of Windows 10 You Have to find this information).  You've posted your question in the Windows Vista board of this forum, we'll ask the Forum Mods to move your question to the correct board if you have a different OS.When you said that your music files were deleted \"from library only\", does that mean that the original music files (.MP3, .WAV, etc.) are still stored in C:\\Users\\<yoursusername>\\Music\\... or some other folder on your hard drive?  If so, you should be able to add those folders (or individual music files) back into your WMP library (e.g., File | Add to Library | Add).-----------32-bit Vista Home Premium SP2 * Firefox ESR v52.9.0 * Norton Security Deluxe v22.15.2.22 * 32-bit iTunes v12.1.3.6","i need help with my windows media player i want to put some music on my playlist i dont know how to do it ","Hi LiamHutchinson:If you still require assistance, please let us known your Windows operating system and Windows Media Player (WMP) version.  If you have a Windows 10 operating system include the version and build (see the How-To Geek articleHow to Find Out Which Build and Version of Windows 10 You Have to find this information).  You've posted your question in the Windows Vista board of this forum, we'll ask the Forum Mods to move your question to the correct board if you have a different OS.When you said that your music files were deleted \"from library only\", does that mean that the original music files (.MP3, .WAV, etc.) are still stored in C:\\Users\\<yoursusername>\\Music\\... or some other folder on your hard drive?  If so, you should be able to add those folders (or individual music files) back into your WMP library (e.g., File | Add to Library | Add).-----------32-bit Vista Home Premium SP2 * Firefox ESR v52.9.0 * Norton Security Deluxe v22.15.2.22 * 32-bit iTunes v12.1.3.6hi there just want help with my windows media player i want music on my playlist i have  tried everything ","i need help with my windows media player i want to put some music on my playlist i dont know how to do it Hi staceyclemmett:As requested, please tell us your operating system and Windows Media Player (WMP) version.  You've posted your question in the Windows Vista board (in a topic that has nothing to do with creating playlists) and any instructions we provide for Vista \/ WMP v11 might not be optimal for the latest WMP v12 included with newer operating systems.In the mean time please read the How-To Geek tutorial Create Custom Playlists in Windows Media Player 12.  Alternate methods to add songs to a playlist (e.g., dragging and dropping songs from your music library vs. right-clicking the song and selecting Add To | Playlist) and then saving and naming your new playlist are described in that article.-----------32-bit Vista Home Premium SP2 * Firefox ESR v52.9.0 * Norton Security Deluxe v22.15.2.22 * 32-bit iTunes v12.1.3.6","How can I retrieve my playlist music  that was in itune media","How can I retrieve my playlist music  that was in itune media Hi GurnettaTaylor:See Method 3 (\"Restore iTunes Playlists from Old iTunes Music Library.xml\") in the iMyFone article3 Ways to Restore Lost or Accidentally Deleted iTunes Playlists.If none of the suggested methods in that article work you might want to post your question in Apple'siTunes for Windows forum at https:\/\/discussions.apple.com\/community\/itunes\/itunes_for_windows.  Be sure you provide your Windows OS (if Windows 10 include the version and build - see the How-To Geek articleHow to Find Out Which Build and Version of Windows 10 You Have) as well as your current version of iTunes.Please note that you've posted your question in a thread about Windows Media Player in theWindows Vista board.-----------32-bit Vista Home Premium SP2 * Firefox ESR v52.9.0 * Norton Security Deluxe v22.15.2.22 * 32-bit iTunes v12.1.3.6"]},{"symptom":"On startup I get Messages: fufaxldb.dll, fufaxcfg.dll, fifaxcsr.dll, fusvc.clt missing        On startup I get Messages: fufaxldb.dll, fufaxcfg.dll, fifaxcsr.dll, fusvc.clt missing. It doesn't appear to effect the computer operation. I have Epson WF-2760 installed, but have not installed the FAX option, and don't wish to. Have used the same setup for 2+ years.","solutions":["Hi Robert You are correct, those dll files are part of the Epson Driver and associated software for your Epson WF-2760Windows updates have more than likely corrupted that innstallation and the best option is to completely uninstall the software and drivers and re-install the latest version from the support page for your printer . . .https:\/\/epson.com\/Support\/Printers\/All-In-Ones\/...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","I appreciate your help, and followed your instructions, but I still have the problem.Last message says Fax Utility should be reinstalled. When I reinstalled Epson, I didn't install the Fax utility and I NEVER have installed it because I don't have a Fax line.I don't know if they're talking about my Epson Printer or Windows 10 Fax Utility."]},{"symptom":"Windows 10 installation interrupted        My laptop's battery died during the windows 10 installation from the USB drive (as the OS cannot be booted up). I try going into recovery settings but I'm greeted to a black screen with a cursor. I think I completely broke the computer...","solutions":["Error code: 0xc000000f","Hi Mario You have not broken your laptop, it is just that installation did not complete correctly, your only real option is to re-install Windows 10 again, this time, making sure it is connected to the mains, because of the amount of time a Windows 10 installation can take . . .","Thanks for the help. I installed it correctly this time, but had some trouble figuring out how to get past the installation stage. Apparently, I had to unplug the USB after it had installed. All is good for now.","All is good for now. I can now confirm that everything is now good.","Glad to Help!"]},{"symptom":"Bandicam        I recently updated my HP Laptop to Windows. Ever since i dd that, my Bandicam Recorder has not been working. Whenever i try to record, my videos start with a blank screen and then video but other times it remains blank. And whenever i pause my video to start a new part, my video skips over to the last part i recorded and doesnt match the audio. Other times, it does the same but my video freezes while the audio keeps going. I tried everything from changing video format, video quality, FPS rate and nothing is working. How do i fix this? Can i update bandicam somehow? What do i do?","solutions":["Hi Alex. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.There are similar cases here answered in the BandiCam forums to see how they resolved it:https:\/\/forum.bandicam.com\/viewtopic.php?t=5704https:\/\/forum.bandicam.com\/viewtopic.php?t=5876There are Bandicam troubleshooting FAQ's here: https:\/\/www.bandicam.com\/faqs\/I would download and install for the latest version 4.5.4 from BandiCam website here:https:\/\/www.bandicam.com\/downloads\/If problems post in forums or contact Bandicam Support email here: https:\/\/www.bandicam.com\/faqs\/I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Beeping noise slowing down my computer        So one day I'm using my computer and I lend it to my dad. Then I get it back and now when I type on it there's a weird continuous beeping sound that slows my computer when I type anything. I can't find anything on the internet about this.","solutions":["Hi fogiestooth21 Open the old Control Panel (click your Start Button, then just type control) At the top right of Control Panel, make sure View is set to icons Click Ease of Access Center, then choose 'Make the Keyboard easier to use' Is Filter Keys turned on, if so turn off that and all other settings in 'Setup Filter Keys'Then click 'Apply' and OK . . . .","Hi fogiestooth21 Please DO NOT call that phone No. above, that is a Tech Support Scammer, they will be removed shortly . . .","thank you. The solution you gave me, however, did not work."]},{"symptom":"Windows Explorer hangs when accessing Office files        Hi, I have a strange issue with Windows Explorer. If I try to access an Office file (only tried Word and Excel files) then Explorer hangs and requires a restart via Task Manager. I have tried a number of other file types and they are OK. A reboot of the PC did not stop the problem.Even simply right-clicking on the files in Explorer will make Explorer hang.Similar files on other PCs are affected when attempting to access them via a network drive.I can open the files if I start Word or Excel first and access them via Recent files or even using the Explorer-like Browse option.I am using Windows 10 version 1903.Any help or advice gratefully received.ThanksJohn","solutions":["Hi John This is generally caused by the Microsoft Office application file associations becoming corrupted ...Follow these steps to perform a full repair of your Office installation . . . Open Control Panel - Programs and Features Click Microsoft Office in the list of installed applications At the top, click 'Change' On the resulting dialog, click 'Repair' - choose the Quick Repair, then if that does not resolve this, go for the Online Repair, it is a comprehensive fixThat should fix any issues with your Office Installation . . ."]}]}