{"windows":[{"symptom":"locked out        tried two different computers and I'm locked out of one website which is express scripts","solutions":["Hello BrunoBottona, I'm Didi, an independent advisor. Can you detail what you mean by being locked out of the website ? Do you have any error message when you try to access it ? What do you see on your screen ? Regards, Didi","can't connect securely to this pagethis might be because the site uses outdated or unsafe TLS security settings.IF this keeps happening,try contacting the website's owner","Hi BrunoBottona, Try the procedures listed in this page : https:\/\/www.kapilarya.com\/fix-cant-connect-secu... Regards, Didi","Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Dual boot windows 10        Hello,Recently I've bought a new pc, installed windows on the ssd that was already in there. afterwards I also added the ssd I had in my old pc, that had winsows 10 installed too, so now I have 2 drives with both windows 10 on it but I can't figure out how to enable dual boot to choose between them, changing the boot order in the bios isn't what I want to do all the time.Does anyone know how to enable dual boot for already installed operating systems?Thanks for your help.Gibba","solutions":["Hi ,Gibba- my name is Dennis, I'm an independent advisor and I'll do my best to help today. Dual boot is used when there are 2 different Windows \/ Linux operating systems, for example,is the previous motherboard exactly the same as your new PC? For windows on a different SSD to start on another PC, the motherboards must be exactly the same.If the motherboards are different in your case, the SSD of your previous PC will work as backup and more storage space.Regards, Dennis.","Well I upgraded from a 6th gen i5 to a 9th gen i7, so the motherboard is totally different, but I can still boot my old windows if I change boot order in the bios. I'm having some graphics driver issues though, install fails. Also the resolution is on 1024x768 and i can't change that.","Hi Gibba, You may want to check this article for dual boot of two different versions of Windows.https:\/\/www.howtogeek.com\/214477\/how-to-dual-bo...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Thanks for the suggestion, I had already been on that website, this is not really the solution, this requires to install a new windows, guess I'll just reinstall my old windows, hope it's working then.Regards,Gibba","Hi Gibba, I see, if that would be the last resort then we'll have to take it. Please let me know if everything will be great after the rei-nstallation. Thanks and regards,"]},{"symptom":"MS-Money - Windows 10        HelloI have been using Ms-Money for many, many years.  And have been using it on Windows 10 on my PC for now just over 2 years.Yet someone on Facebook says it should not work on Windows 10, but yet it does and fine.I know the product is no longer supported but I don't want to buy any other product as this one really fits my needs.Any suggestions \/ advice.","solutions":["I also use MS Money on Windows 10, yes it works. Don't worry about what people of Facebook say but you should consider that it isn't designed to work in Windows 10 so at some point in the future it may stop.I don't believe there is a direct replacement for Money (certainly not from Microsoft) and I don't know if there are other programs that will read the money file.","Hello Gerry, I'm Didi, an independent advisor. As long as the program runs as you need it without any problem you shouldn't be concerned about people saying that it shouldn't work.Is the program running without any problem on your computer ? Regards, Didi","To both of you who replied.The program has been running fine for over 2 years.   But could it cause problems when Windows Update applies it's regular patches, ie Security Updates, Cumulative Updates, etc???   ","I have been running Insider Previews for a while and money still works well. So it's okay at least until the 2004 version release. (April 2020)","Hi Gerry, In the case of softwares that no longer have support you can't really tell if it will still work in the future and how much longer it will work.However someone on this thread has said that running the Insider Preview version MS Money still work, so if it's true until April 2020 you probably don't have worry about the software not working.Regards, Didi"]},{"symptom":"game doens't show up in the libary of microsoft store app .        Hello,today i bought Forza horizon 4 in the microsoft store browser. in the browser it says i bought the game and i am owner of forza horizon 4. but when i want to install the game, it want's me to redirect me to the microsoft store app. but when i am redirected, the game doesn't show up. when i click in the libary it also doesn't show up. SO! i bought the game and can't install it. is there an explanation for this and an sulution??","solutions":["Hi, Schildermand My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Update Network Path To Documents Folder        We had our network path changed for documents folder on the file server as the old one was decommissioned. For example:Documents folder was pointing to \\\\michigan1 and was changed to \\\\michigan2 however in the registry it has the old pathIs there a way i can create a registry patch to override anywhere in the registry that has \\\\michigan1 and replace it with \\\\michigan2?i can manually do this in the registry one by one to update \\\\michigan1 to \\\\michigan2 but its time consuming as i have to do this for documents, videos, music, and pictures.Any help would be appreciated.","solutions":["Hi Zaheer, Yes, most likely it's possible. Please check this article: https:\/\/support.microsoft.com\/en-ph\/help\/310746...Please let me know if this will help you solve your issue. Thanks and regards,","Hi Richard - We do have a GPO that updated the network path, however, we have over a dozen machines that didn’t update the paths.  Some commonality are that they are remote users that the gpo didn’t apply correctly.  We had one user come onsite and forced the GPO, and it stated that it ran successfully, however, the old path was still in the properties.  Also, noticed that they had Sync Center enabled. ","Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.It somtimes takes much longer for Group Policy updates to reach remote users. I'd expect the policy to update remotely provided there's a VPN link by executing the GPUPDATE \/FORCE command in an Administrator command prompt. The computer might also need a full restart (as compared to a Shut Down\/Power on) before the changed policy applies?Are the remote users excluded from the GPO item which is applying to your other users perhaps?Regards, David","Hi David - We had one remote user bring in his laptop and we did do the gpo force update at least 7 times with restarts, but to no avail.  We just ended up going into the registry and replacing \\\\michigan1 to \\\\michigan2 and all was well.  Some remote users did get the gpo, so yes it is setup for remote users as well.I just want to know if there is a way to create a regpatch to do this where we can replace all instances of the network path from michigan1 to 2?"]},{"symptom":"settings are out of date?        Dear All,Following a recent MS update, I am being bombarded with messages from Microsoft telling me that they 'need to fix my account’ – most likely because ‘my password has changed' (it hasn’t) or that my settings are ‘out of date' (they aren’t).How can I get MS to stop sending me pointless messages and fix their problem?Kind regardsSteve","solutions":["Hi, You will get these messages when a Microsoft Service on your PC hasn't been able to authenticate your account. So one or more services won't work correctly. This could be anything from Syncing Settings, Office, OneDrive, Skype etc.The only way to fix this issue is to sign in again when prompted really. If you have changed your password previously it way be that the service hasn't checked what the latest password is until this update. But that's speculative.I hope that helps.","Hi,Thank you for your reply.I have signed in about 40 times and each time I am told that everything is up to date, yet MS still bombard me with endless messages that show no sign of stopping.Really not sure what else I can do?ThanksSteve","Hi SA07816 This is a common issue unfortunately. My advice would be to switch from \"microsoft account\" to \"local account\" Restart the computer Switch back from \"local\" to \"microsoft account\" It should improve the situation. Regards Jay","Hi JayThank you for your reply.May I ask. How does one switch from \"microsoft account\" to a  \"local account\".Not quite sure what you mean?RegardsSteve"]},{"symptom":"Videos folder stuck inside of the Pictures folder        My Videos folder is stuck inside of my Pictures folder. I have tried to move the location using the properties tab but it keeps saying the folder is inside of the Pictures folder. I have also tried to create a new folder and name it videos and then try to move the location to the new folder and it keeps telling me about merging the folders into pictures folder. But I wish to keep the folders separate. ","solutions":["Here are some screenshots","Hi RJCP7117 Click your Start Button, type regedit and hit Enter to open the Registry Editor Click View and make sure 'Address Bar' is turned on Paste this into the Address Bar at the top and hit Enter HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell FoldersPlease provide a screenshot of the resulting Registry Editor window . . .","Here is the screenshot ","Hi RJCP7117 Sorry, I was offline . . . Open the Registry Editor again, it will still be on the same page . . . 1 Double click My Pictures, then set its value data to this and click OK %USERPROFILE%\\Pictures 2 Double click {0DDD015D-B06C-45D5-8C4C-F59713854639}, then set its value data to this and click OK%USERPROFILE%\\Pictures 3 Close the Registry Editor and restart (not shut down your PC That will have resolved the folders being merged, you may need to manually move files from the videos folder back into the Pictures folder . . .","The folders are still merged, should I try editing the MY Video one?"]},{"symptom":"keyboard        how to change keyboard back to uk","solutions":["Hi Brian Open the Settings App (gear icon on your Start Menu) Go to Time and Language - Region and Language On that page you should be able to set your Keyboard Input language If that does not succeed: Right click your Start Button, choose Powershell (admin) Paste this commend into Powershell and hit Enter: $1 = New-WinUserLanguageList en-GB Then, Paste this commend into Powershell and hit Enter: Set-WinUserLanguageList $1 Close Powershell and restart your PC That's It!","Thank youYour second suggestion has worked - not sure quite how I got there, but seems ok. Just hope it holds as I keep getting the us keyboard and solutions seems to vary!"]},{"symptom":"Reload removed apps        I have reset my window pro.10 laptop.After words some of the apps are not reload.Pl. let me know how can I reinstall \"REMOVED APPS WHILE RESETTING P C \"From;*** Email address is removed for privacy ***","solutions":[" I have reset my window pro.10 laptop.After words some of the apps are not reload.Pl. let me know how can I reinstall \"REMOVED APPS WHILE RESETTING P C \"From;*** Email address is removed for privacy ***"]},{"symptom":"Desktop is a black screen with just recycle bin, can't get to recovery, can't do anything        Hi, so to give you some background, I have a Lenovo IdeaPad 320 running on Windows 10 Home.I have been having some problems with my keyboard for a while. First my shift keys would randomly stop working and I tried everything and nothing would fix them. Yesterday, my whole keyboard stopped working. I tried to uninstall the driver and when I restarted my lap top, it just wouldn't boot. It went into a loop of turning off and then on again. I shut it off by pressing the power button for a few seconds. After that when it started, it was slow and it would freeze after I try to perform a few simple actions. Also it would get super loud all of a sudden. Finally, after struggling with this for a while, I managed to change some setting using the onscreen keyboard. I managed to get into Recovery and tried Repair. It said it was unable to fix the problem.Eventually, I tried Reset this PC (choosing to Keep my Files). It went well for a while and then, when it got to reinstalling Windows, it got stuck to 2% for hours and then it rebooted on its own with no changes. I tried the whole thing again, it again got stuck and I had to again press the power button and shut it down. It took forever to boot up and now I have a black desktop with just recycle bin. I can't do anything, keyboard is still not working, I can't get to recovery again no matter how many times I try to force shut it down. I tried to not make this an essay, so I may have skipped some steps. I don't know what to do anymore, if you have any ideas, please let me know. If you need more details, I can try to give you more information.Thanks in advance!","solutions":["Hi, Iv.Tr My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thanks for your reply!The problem is, I got the usb, but my computer doesn't automatically boot the usb when I power it and I can't get to a boot menu no matter what I do.Any ideas?","Try to enter the BIOS and change boot occlusions by USB, usually to enter the BIOS is with F2"]},{"symptom":"Trying to recover my password        I cant seem to recovery  my password","solutions":["Is there a phone number","Hello LavonneMiller1 Thanks for posting Microsoft Community. I'm Marcos Independent Advisor. What is the error that you're getting when you are trying to recover the password?Please check the procedure in the below link: https:\/\/support.microsoft.com\/en-us\/help\/402845...Let me know how it goes or if you need further assistance. Regards."]},{"symptom":"Setting ONLY the Current Folder and Its Subdirectories to Column Configurations, Not Entire Drive        When I research how to set a folder's configuration, I wish to automatically set all subfolders to the same, BUT  not all Windows folders entirely.Everywhere I've looked, it seems it says the same thing: set ALL folders to this (current) confiduration.How does one do this?  IS there VBA for this?I did find:https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_7-files\/any-way-to-apply-folder-view-settings-specifically\/e1c9763e-ad96-4962-976c-c52ad8e874abbut nthis didn't solve my issue.  the subfolders still remained in the original confifuration.","solutions":["Unfortunately you can only set a certain type of configuration on a specific \"folder type\". The choice is Documents, Music, Pictures, Videos and General.All folders that have that folder type will get the same configuration. I really wish we could create our own folder types, but for now this is not possible :(","No easy, in-built way. Are these folders static or constantlly being created? If static, you should be able to set their custom view while maintaining a different default template for that folder type.Keith","It seems that this only applies to child folders and not their subfolders.  The grandchild folders were not configured.","To change the folder view for all folders of the same type: - in Explorer navigate to the folder for which you want to change the view. Right click, choose properties, click on Customize. Under Optimize this folder for, in the drop down list choose a folder type. Tick the box for \"Also apply this template to all subfolders\". Click Apply and OK. - still in Explorer set the view for the folder as you wish. In the ribbon, at the far right under Options click on the arrow to select \"change folder and search options\". Click on the view tab and click on Apply to all folders, then yes then apply then OK.Please note that folder view choices are not maintained when you view the folder via a Library.If the above has not propagated to all subfolders including grand children, check the properties on a subfolder where this doesn't work. Has the type of folder been set correctly?-If yes post back. with details-If not: do the subfolders where the properties were not applied have different type of contents? (say you chose a Music type in the very first step and some folders have pictures in them). In this case you might need to disable automatic detection of folder type. This requires a registry edit. Is your system an upgrade from 7 to 10?"]},{"symptom":"Can I run two Windows Server operating systems inside Hyper-V?        I have Windows 10 Pro, 10Gb Ram, and 1TB Hard drive.Will I be able to run two Windows Server Operating Systems at the same time inside Hyper-V of Windows 10 Pro?","solutions":["Will I be able to run two Windows Server Operating Systems at the same time inside Hyper-V of Windows 10 Pro?As long as you run each server in a separate virtual machine, you can run as many servers at the same time as you like ... 2 ... 3 ... 4 ... 10. You are limited only by how much RAM and hard drive space is available.","Hi Nessenboro, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.Hyper-V is available on 64-bit versions of Windows 10 Pro. Your hardware also needs to support virtualization (may need to be enabled in BIOS\/UEFI).Provided that you have proper licensing to run the Server operating systems, you should be able to run them both. Be aware all 3 instances are sharing the same hardware. There are some features that work differently in Hyper-V on Windows than they do in Hyper-V running on Windows Server. I would suggest if you haven't already to review this Microsoft documentation in regards to Hyper-V:https:\/\/docs.microsoft.com\/en-us\/virtualization...Windows Server operating systems supported as guests include 2012, 2012 R2, 2016, and 2019. For more information:https:\/\/docs.microsoft.com\/en-us\/virtualization... I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"Windows 1909 installation error        I am having an issue upgrading to windows 10 version 1909, we're halfway through the update (about 48%) I get an error saying \"0xC1900101 - 0x30018 The installation failed in the FIRST_BOOT phase with an error during SYSPREP_SPECIALIZE operation\". I was told this had something to do with my drivers not being upgraded but the only way I can upgrade my graphics card driver is if I have the new version of windows. How do I fix this?","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command promptDISM \/Online \/Cleanup-Image \/RestoreHealthRun these commands on the command prompt to restart windows update servicesnet stop bitsnet stop cryptsvcnet stop wuauservnet stop msiserverRen C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.old net start bitsnet start cryptsvcnet start wuauservnet start msiserverAfter successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartThis should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","Hi i am the one who have similar error when updating my Windows 10 1809 to 1909...I have doing all your instructions above, but sorry it is not working 🙁My laptop always restart at 30%, and shutdown at 48%, make the update progress fail... when I turn it on, notif \"Undoing changes made to your computer\" appear... after the process is done, in my desktop still appear error \"0xC1900101 - 0x30018 The installation failed in the FIRST_BOOT phase with an error during SYSPREP_SPECIALIZE operation\" like before...I am from Indonesia, sorry for my English 🙂","I have gone through all those steps in addition to the steps recommended at https:\/\/thegeekpage.com\/fix-the-installation-failed-in-first-boot-phase-error\/...all to no avail.It is an endless loop of restarting at 30% and shutting down at 48%, which causes the update to fail. It is always the\"0xC1900101 - 0x30018 The installation failed in the FIRST_BOOT phase with an error during SYSPREP_SPECIALIZE operation\" error."]},{"symptom":"About connections  wifi                   ABOUT CONNECTION PROBLEM I got  some trouble about my wifi connection, can you help me solve this ?               THE problem is wifi off, when ever i try to connect on wifi , i click on the wifi buttonit still stay wifi off ,how can  Microsoft help me solve this problem? ","solutions":["Hi LorensoChery,specify which is your operating system.Can other devices in the house connect to your Wi-Fi network?","           ABOUT CONNECTION PROBLEM I got  some trouble about my wifi connection, can you help me solve this ?               THE problem is wifi off, when ever i try to connect on wifi , i click on the wifi buttonit still stay wifi off ,how can  Microsoft help me solve this problem?  can't get to my microsoft windows PC desktop taskbar and starup on screen"]},{"symptom":"mouse cursor stucking        added a wireless mouse thinking it's my touchpad, but either way the arrow cursor seems stuck in the middle surrounded by a halo of two crop circles I have checked and updated drivers... is it a coincidence that this issue started after the win 10 upgrade?","solutions":["Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.What version of windows are you using? Press the \"windows + r\" key and write \"winver\" And can you send us a screenshot of your mouse problem?","WIN 10 VER 1903 BUILD 18362.535will post a screen shot when i can","Start by updating windows too :)","windows is auto updated; no current updates are pending  here's a screen shot... halo circles are in right corner of screen shot","Problem that I never saw finally ... I'll let others who may know the answer help you .... I'm sorry with the picture I understand better. Good luck.","Hi russellferrer, Is this a touch screen computer? I am wondering if you can open Device Manager, then see if there is anything under Human Interface DevicesA screenshot of the Device Manager item we want to open: https:\/\/support.microsoft.com\/en-us\/help\/402614...Please reply and let us know and we would be happy to look into providing some suggestions!Regards, -Ashton","yes, it is a touch screen...here's the dev man printout","Thank you for confirming that. You can disable the touch screen feedback circles by going to: Settings > Ease of Access > Cursor & Pointer Then, under \"Change Touch Feedback\" section, turn off the setting for \"Show visual feedback around the touch points when I touch the screen\".Source and a guide with screenshots: https:\/\/www.howtogeek.com\/427293\/how-to-disable... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Note that this may not prevent the \"sticking\" of the cursor - you could right click on \"HID-compliant touch screen\" and disable it, to see if this will help that. Note that this disables the touch screen entirely. You can re-enable it again by right clicking it and enabling it. It sounds like there may be some pressure points there on the touch screen, causing it to \"click\" where the circles are. You may be able to recalibrate the touch screen. This can be done throughControl Panel > Hardware and Sound > under Tablet PC Settings, there is a link for \"Calibrate the screen for pen or touch input\"I hope this helps! Let us know how it goes. -Ashton","so, after getting this info, I've diabled the touchscreen.  as of yet, the problem has not shown itself.  Thanks for that advice.  this won't affect me since I rarely used the touchscreen anyways."]},{"symptom":"windows 10 install        hello,i just brought a new Samsung SSD, i want this device to hold windows as my current 500gb hard drive is slow.i do not own a USB drive or bootable windows disk.can i boot to windows using the old drive, and download windows from the internet onto my new SSD that is also installed into my PC?it seems like such a simple thing to do but apparently i need a bootable device, but i have one, the old hard drive.please can anyone help?thanks","solutions":["Hi reecehoskins You will need a flash drive (minimum 8GB) to install Windows 10 on your new SSD You will need to boot from the old drive, so you can create the bootable media . . .You can reinstall Windows 10 at any time and it will not cost you anything ! Click this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), you can create a bootable USB flash drive (min 8GB) using that toolThen, Boot your PC from the Installation Media you just created (change Boot Order in your BIOS) to begin installing Windows 10Since you previously had Windows 10 installed and activated on that PC during the installation process skip the steps which ask for a product key and select the option 'I am Reinstalling Windows 10 on this PC', and activation will not be an issue, your PC will have a digital entitlement stored on the Microsoft Activation Servers Make sure you install the same Edition of Windows 10 (Home, Pro . . . etc.) you previously had installed to avoid Activation issues"]},{"symptom":"Can't access microsoft store through a vpn        I have to turn off my VPN to access microsoft store. What gives? this should not be required as I have a common provider and most websites allow access.Is there a way to make it work? If not, I'd like Microsoft devs to have the feedback and I'd also like a brief explanation as to the reasoning and rationalization. Don't know why it should be required to turn off and on my vpn just to get to the store, for the inconvenience if not for the security. Vielen Dank!","solutions":["Hi Vielen Please see the solution proposed on this discussion, hopefully that will resolve this for you . . .https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"changing user name in drive c        Can and how do I change my user name in drive C on my new computer to match my old computer so that my files from my photo book will link correctly? ","solutions":["Hi Ruthann Do you need to change that drive name or the name on your user folder inside C:\\Users?If that is your user folder name, Microsoft advise against changing that, however, if you do wish to change that, trusted MVP Shawn Brink provides a method on this page:https:\/\/www.tenforums.com\/tutorials\/89060-chang...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]},{"symptom":"lic key for Microsoft 365, is there one available.        I've upgraded my machines to Microsoft 365 and I do not have a copy of my lic key, is there one available.","solutions":["Hi Barry Office 365, once installed uses a digital licence associated with your Microsoft Account and your licence and installations are then managed online . . .Go to http:\/\/www.office.com and if you're not already signed in, select Sign inOn that page do you see your Office 365 subscription listed, if so, you can install or manage your Office installation(s) from there . ."]}]}