{"windows":[{"symptom":"Sync        How do you Sync your E-mail to this HP computer device from your personal cell phone?","solutions":["HI Vicky. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Your cell phone uses a sync app just like Windows 10 Mail, where you add your Mail accounts from their online source (Yahoo, AOL, Gmail, Outlook, etc) and they are all managed and accessible. But these are just sync services and while they will also sync your folders as far back as you tell it, the mail actually resides in the online (or Office) accounts.So I'dset up Windows 10 Mail app which is an easier way to access your mail from all your various accounts in one huge inbox that lets you merge all of your Office and Web Mail account, with an even larger ad-free reading pane. See here how to get started:https:\/\/www.windowscentral.com\/how-get-started-... Once you read over the tutorial if you have any questions or get stuck, just ask back. If it ever has problems the easiest fix is to just delete and add back the Mail account, nothing is lost. Again, the mail lives in its actual online account but this is a much easier way to access it than through a browser cluttered with ads. I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"How to limit Sync so that it doesn't include my work computer?        So it's been over a year since I tried syncing my devices due to a terrible experience.  In attempting to sync my phone and my home computer, for some unknown reason it also synced to the computer I use at work which is NOT GOOD, since it is a shared computer that anyone else can use.  I do sign in to my Google and Microsoft accounts while using it, which is probably how it knew I used that device, but at no time in the initial syncing process did it ask me if I wanted to include the work computer.  This temporarily allowed others access to a lot of personal stuff\/links and I immediately unsynced all my devices as soon as I found out (and fortunately no damage was done). Since then I have been loathe to even attempt to use sync again, although I would like to if I have absolute control over what devices are included.  Maybe I did something wrong the first time, but I'd appreciate it if someone could let me know where I screwed up or point me to a proper tutorial.  Thanks in advance for any help ;?)Russell","solutions":["On the work computer have you turned off the Sync?","Hi Russell On the Work PC: Go to Settings - Accounts - Sync Your Settings Turn off all options on that page If OneDrive\/DropBox is installed on the Work PC, you would need to go to the cloud Settings and choose to unlink from your Account, that would stop file syncing to your personal account . . .It really would be much better to have 2 Microsoft Accounts, one for work and one for your personal devices, to make sure those are kept separate . . .","I'm fairly certain that I didn't (again it has been almost a year), but since it's a shared work station it could be that someone else had. Strange part was that after I signed off the computer, others could still see all my shortcuts in Google Chrome (which may be a separate issue, but these didn't appear until I had this sync problem ;?).But even if it did have Sync turned on, when I first synced my phone and computer, this should give me control over which devices are synced to my home computer, shouldn't it?","Hi Russell On the Work PC: Go to Settings - Accounts - Sync Your Settings Turn off all options on that page If OneDrive\/DropBox is installed on the Work PC, you would need to go to the cloud Settings and choose to unlink from your Account, that would stop file syncing to your personal account . . .It really would be much better to have 2 Microsoft Accounts, one for work and one for your personal devices, to make sure those are kept separate . . .Hmm, okay I'll have to check that, although I don't think I'm signed on to the same Microsoft account since my work account is a separate.  I do sign into the same Google Chrome account and do check my personal Outlook account (maybe that's the issue).  I'll check that tomorrow when I'm at work and make sure my personal account is unlinked, thanks ;?)Russell"]},{"symptom":"Internet via mobile hotspot on bluetooth        I am trying to connect my HP Pavilion Windows 10 computer to internet using the mobile hotspot on my phone via Bluetooth.  I have activated mobile hotspot on my phone and connected the computer to the phone via Bluetooth.  However, I cannot find where to tell the computer to use the Bluetooth for internet connection via the phone's hotspot.  Can anyone help?","solutions":["Hi RoyalRain Are you using Bluetooth Tethering or have you turned on the Mobil Hotspot on your Phone?The best and most reliable method is to use the Mobile Hotspot on your phone, then on your PC, you will just see that as another WiFi connection that you can connect to, by clicking the Network icon on your Taskbar . ..If you do want to use the Bluetooth functionality Open the settings App (gear icon on your Start Menu) Go to Devices Make sure Bluetooth is turned on and click dd Bluetooth or other deviceChoose Bluetooth and click Connect if required on that connection Right-click the Bluetooth icon in the system tray (Taskbar), then select 'Join a Personal Area Network'In the pop-up window, right-click your phone, then click Connect using - Access Point"]},{"symptom":"W10 with 1909 release. 3 PC's and cannot see each other on Network.        When we had HOMEGROUP all was fine with my 3 house hold PC's. 2 laptops and 1 desktop. Since I now again have need to hook up a new NAS I find that the pc's no longer see each other under rel. 1909 and may before but worked fine with HOMEGROUP.All three PC's have File sharing turned on for PRivate, Public, and ALL. All 2 are on Ethernet and one is Wireless. There is also a ZyXEL NSA attacked via ethernet. All of the adapters have been checked to make sure File sharing is checked. The following is what each on see's on the NETWORK.PC 1: Under Computers sees: PC 1,  2, 3 and NSA         Under MediaDevices   : PC 1,  2, 3 and NSAPC 2: Under Computers sees   : itself (PC2)      Under MediaDevices sees : NonePC 3: Under Computers sees  :  Nothing      Under MediaDevices sees : itself(PC3) and NAS and PC1","solutions":["Hi bass_gas My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Step 1. Turn On the Network Discovery. First of all, ensure that the Network Discovery is enabled. To do that: 1. Right click on the (active) Network connection icon in Taskbar (or navigate to Control Panel) and open Network and Sharing center.2. Click Change advanced sharing settings. 3. Expand the 'current profile' (Private or Guest\/Public), select Turn on network discovery and click Save changes.4. Proceed to next step. Step 2. Set the \"Function Discovery\" services to Automatic. From Services panel, set the following two (2) services to auto start. Function Discovery Provider Host (fdPHost) Function Discovery Resource Publication (FDResPub) To perform that task: 1. Simultaneously press the Windows image + R keys to open run command box. 2. In run command box, type: services.msc and press Enter. 3. Right click on Function Discovery Provider Host service and click Properties. 4. Change the Startup type to Automatic and click OK. 5. Then perform the same steps and change the Startup type of the Function Discovery Resource Publication service to Automatic Delayed Start.6. Reboot the computer. 7. After restart open File Explorer and click on 'Network' to find out if you can see all the computers on your network.Hope this helps.","Hi bass_gas My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Step 1. Turn On the Network Discovery. First of all, ensure that the Network Discovery is enabled. To do that: 1. Right click on the (active) Network connection icon in Taskbar (or navigate to Control Panel) and open Network and Sharing center.2. Click Change advanced sharing settings. 3. Expand the 'current profile' (Private or Guest\/Public), select Turn on network discovery and click Save changes.4. Proceed to next step. Step 2. Set the \"Function Discovery\" services to Automatic. From Services panel, set the following two (2) services to auto start. Function Discovery Provider Host (fdPHost) Function Discovery Resource Publication (FDResPub) To perform that task: 1. Simultaneously press the Windows image + R keys to open run command box. 2. In run command box, type: services.msc and press Enter. 3. Right click on Function Discovery Provider Host service and click Properties. 4. Change the Startup type to Automatic and click OK. 5. Then perform the same steps and change the Startup type of the Function Discovery Resource Publication service to Automatic Delayed Start.6. Reboot the computer. 7. After restart open File Explorer and click on 'Network' to find out if you can see all the computers on your network.Hope this helps. Func Disc Pro was 'manual' changed to 'automatic'Func Disc Resource was 'manual(trigger) changed to 'automatic(delayed)Made these changes to all three pc's... rebooted them and checked File Explorer\/Network.Nothing changed from my original post."]},{"symptom":"\"Error loading ASIO driver\"        I haven't had problems with recording on my Lenovo desktop using n-Track Studio until now. I believe the most recent Windows update (I have 8.1 on this machine) may have corrupted the ASIO driver, or somehow changed the settings. I tried going through the Windows driver update, but it said the latest version is installed. Argghhhh... I can't record until this is fixed and I am wading through online forums, etc. trying to find a solution.","solutions":["You don't use Windows Update to update drivers for non-Microsoft Hardware.You should obtain your Driver Software from your Computer or Hardware Manufacturer, not through Windows Update (except for Microsoft Hardware Updates), as Microsoft normally does nor have those latest Drivers available as Microsoft relies on the 3rd Party Hardware Manufacturer to supply them.Go to your Computer or Hardware Manufacture's website > Driver and Software Support Section > look up your Computer or Hardware Model number > then your Operating System > locate the correct Drivers > download and install them.Driver Downloads:Lenovo:http:\/\/support.lenovo.com\/en_US\/downloads\/default.page#"]},{"symptom":"File explorer not opening at all        Hello microsoft pls help me i can not open file explorer at all from any way possible i have tried ur tricks but still nothing i cannot access it when i click on it nothing happens and i cant even click on it from the search box or start menu because it does not open and when i click on my pc it still does not work could u please help me ","solutions":["Hi Plshelplol, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.See if the indications of these links that belong to Windows MVP can help you solve the problem you are presenting.File Explorer will not open in Windows 10 https:\/\/www.thewindowsclub.com\/file-explorer-wi...Windows 10 File Explorer Not Responding? Here are 4 Ways to Restart It https:\/\/www.groovypost.com\/howto\/windows-10-fil...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"i have payed for my office subscription but when i try to access it i get a message that it is expired.        I HAVE HAD MICROSOFT OFFICE FOR YEARS. AFTER I PAID FOR IT THIS YEAR I TRIED TO USEIT IT SAYS MY ACCOUNT HAS EXPIRED. I CANT SEEM TO GET IT BACK, EVERY TIME I TRY  TOM UPDATEIT, I GET CHARGE AGAIN??","solutions":["I HAVE SENT YOU A MESSAGE WHAT DO YOU NEED NOW?","Hi Beverly. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Make sure you're signed into the correct MS account where the subscription is paid.Then go here to check it's status: https:\/\/support.office.com\/en-us\/article\/find-o...To change payment methods: https:\/\/docs.microsoft.com\/en-us\/office365\/admi...If it's still in effect then make sure that is the same account you're signed into Office 365 with. This is easiest handled by signing into Windows 10 using a Microsoft Account as shown here:https:\/\/www.tenforums.com\/tutorials\/5375-switch...https:\/\/www.digitalcitizen.life\/should-you-use-...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","All caps is considered yelling.  Please do not yell at the other users that make up this forum."]},{"symptom":"VBA Basic        VBA basic app has a macro Excel macro that will not edit, run, delete or anything else.  An error message is constantly posted.\"Invalid Outside Procedure\"The app is closing each time I try to view macros from the task ribbon.Upon opening, the app displays the VBA Basic with the error.The module (macro)  does not accept editing (to be saved), will not be removed (to be saved) and does not run without stopping and displaying the message.Excel is virtually unusable as a result.I have received a message that the personal workbook that stores the macros for Excel is corrupted , damaged not repairable.  A repair utility used on the folder has zero effect.Is there a way out of this mess besides utilizing a different spreadsheet rather than Excel?Thanks.","solutions":[]},{"symptom":"BSOD Memory Management After Windows 10 Update        Hi,I've been running into memory management errors after updating to version 1903 of Windows 10 yesterday (10th-Jan). I've actually had this same error before, immediately after an update a few months ago, but back then I was able to revert to a previous version of Windows 10. I now don't seem to have the option to do so because I did a fresh install of Windows 10 to try and solve the issue.Things I've done so far today:Ran the various built-in diagnostic tools.Ran the driver verifier utility. After restarting I got stuck in an infinite loop of crashes until I booted into safe mode and disabled the driver verifier. The only error message I came across while running this utility was DRIVER_VERIFIER_DETECTED_VIOLATION. Here is a OneDrive link to some of the DMP files from today which I've read are useful and might be related to the driver issue.Things I did a few months ago when I had a similar issue:Ran the various built-in diagnostic tools.Ran the chkdsk utility.Checked for drivers that needed to be updated of which there were none.Based on the above, I'd say that updating Windows 10 seems to have caused an issue with one or more of my drivers. If anyone can provide more insight then I'd appreciate it a lot because right now I'm unsure when the next crash is going to come. Hopefully someone can make sense of the DMP files. Also let me know if there's any more info I can provide because I'm not sure what's useful.Thanks in advance.","solutions":["Hi, There appears to be an older version of McAfee installed. Can you uninstall McAfee and use Windows built-in antivirus and firewall and see it makes a difference.","I've uninstalled McAfee but it didn't help things. I've also deleted my graphics driver and installed the latest one from Intel to replace my old one. I've now seen two new exceptions today called SYSTEM_SERVICE_EXCEPTION and DRIVER_OVERRAN_STACK_BUFFER. Do you have any other suggestions of things to try?Thanks for your response so far.","Can you provide the latest minidump files?","Hi auggy, here is the link to the latest DMP files. There should be 3 in total.","The last two were SYSTEM_SERVICE_EXCEPTION (3b) stop errors that seemed to be related to the file system.Can you provide the following information which may help determine any issue(s): Windows Key + R > type msinfo32 in the \"Open\" box > OK > File > Save > then save as an .nfo fileThen make the resulting .nfo file available via OneDrive. Also, can you do the following: Windows Key + R > type eventvwr in the \"Open\" box > OK > expand \"Custom Views\" and then right-click \"Administrative Events\" > select \"Save all events in Custom View As\" and save as an .evtx fileThen make the resulting .evtx file available via OneDrive.","Thanks for your help so far auggy. You can find the msinfo32 file here and the eventvwr file here.","You're welcome for the help. The Event System Log shows the following repetitive warning: WHEA-Logger: A corrected hardware error has occurred. Component: PCI Express Root Port Error Source: Advanced Error Reporting (PCI Express) Primary Bus:Device:Function: 0x0:0x1C:0x0 Secondary Bus:Device:Function: 0x0:0x0:0x0 Primary Device Name:PCI\\VEN_8086&DEV_9D14&SUBSYS_07671028&REV_F1 Secondary Device Name: That warning may be related to the Intel wireless adapter driver so try updating the Intel wireless adapter driver:https:\/\/downloadcenter.intel.com\/download\/29258...Also, the Event Logs showed errors related to various Dell services in particular TruColorALS, Dell Data Vault Wizard service, Dell Client Management Service service and DellSupportAssistRemedationService.exe.In one of the older BSODs the error was a CRITICAL_PROCESS_DIED (ef) error and the process that crashed was the DFSSvc.exe.The DFSSvc.exe is the Dell Foundation service. Make sure all related Dell software is up to date but if problems persist uninstall the relevant Dell software or disable the relevant Dell services.Note: The above is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"trying to set up desktop to receive gmail messages in pop and failing        Have tried following google instructions to set up my desktop to access my gmail account using pop. and windows live mail. The protocol and server keep coming up as imap and, of course it won't work. Any suggestions?","solutions":["This is how to do it with the Windows 8.1 Mail App.See if this assists you.https:\/\/support.microsoft.com\/en-au\/help\/2994411\/how-to-set-up-email-account-in-the-mail-app-in-windows-8-1To add an account to the Mail appIf the email address for your Microsoft account ends in outlook.com, live.com, hotmail.com or msn.com, just sign in to your PC. Go to the Start screen, and open the Mail app—your email is waiting for you.If your email address ends in a different domain, like gmail.com, yahoo.com, or comcast.net, here's how to add it.On the Start screen, tap or click Mail. Swipe in from the right edge of the screen, and then tap Settings.(If you're using a mouse, point to the lower-right corner of the screen, move the mouse pointer up, and then click Settings.)Tap or click Accounts, tap or click Add an account, and then tap or click the type of account you'd like to add.Enter your email address and password for the account, and then tap or click Connect. @@@@@@@@@@@@@@@@@@@@@@@@If you want to do it from within Gmail online in your browser> sign into Gmail > select Compose > in the New Message you will notice the attachment paperclip icon at the bottom > browse your computer to find the file you want to send.Cheers.","Bill. Thanks for your response. Unfortunately when I click open an account it doesn't give me an option of choosing 'type of account'. The first box just asks how the account should be known. ie gmail(watersedge ect. It then asks for the email address and password which I complete. When I click next It will not download files. When I look in properties it shows the protocol as imap and the incoming mail as imap gmail.com in spite of me accessing my gmail account and clicking the 'enable pop for all mail' and 'disable imap' box. It needs to show Pop as the protocol and pop.gmail.com as the incoming mail. Hope this makes sense. Any ideas please?","My advice was not to do with using WLM 2012, which you said you were having the problem with.WLM 2012 is not part of Windows 8.1 and if I used that for Gmail, I'd have to rely on Google's advice too."]},{"symptom":"why so many sign ins        Microsoftwas so many sign ins,accounts,windows 10 passwords,security sign ins, my passwords are 123456 and still i get lock outwhy bother to make all this accounts with log in .passwordsbingstore,explorer,hello microsoft,securityall making me dizzy and shut out of my laptop,microsoft please fix my dizziness and stop this nonsense of so many accounts and log inwhy not 1 sign in for everythingi dont get itneither you guys","solutions":["Hi, My name is Will i'm an independent adviser. Having different accounts and more importantly passwords is in the name of security. Having basic passwords such as \"123456\" or \"password\" are very easy to guess. And require very little effort for someone to guess or brute force your password if they wanted access to your accounts. This is the same reason why a number of services force the inclusion of symbols and\/or capital letters. And some force you to change it after a fixed amount of time.There are a number of steps you can take to make this process easier while keeping your accounts secure. Such as using password managers like those offered by LastPass, Google and Dashlane amongst others. And on trusted devices with supported software you can have the software remember your password for next time. By the way if you wish to skip the Windows login screen you can do so by opening netplwiz from the start menu or search box on the taskbar. Then toggling \"users must enter a username and password to enter this computer.\" off.I would also suggest you don't share passwords publicly like this no matter how simple or complex they may be. You risk your privacy and data by doing so.I hope that helps."]},{"symptom":"Mobile hotspot does not provide IP address        Hi,I am a huge user of the mobile hotspot functionality, but I recently installed updates KB4530684 and KB4533002 and since I cannot connect any device to the hotspot (but it starts, I can see it from my phone). I already tried to :- check\/uncheck all boxes of Sharing tab of all my network adapters- follow this tutorial : https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-networking\/phone-stuck-on-obtaining-ip-address-when-setting\/694ea2ff-1670-475d-8688-7a86f58159f5 and enter these commands in admin (from suggested answer) :netsh winsock resetnetsh int ip reset c: \\ resetlog.txtnetsh advfirewall resetipconfig \/flushdnsipconfig \/releaseipconfig \/renewBut none of these solutions worked. What am I missing ?P.S (if can help) : when I disable the hotspot, I can see an other hostpot named \"DIRECT-LSLAPTOPmswC\" (\"LAPTOP\" is the name of my computer)","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please reset the Network Adapter drivers and check the status. Go to Device Manager. Locate Network Adapter. Double tap on it. Right click on the Wireless Adapter and select Uninstall. (Do Not select any check box)Restart the PC.","Thanks for your help !Unfortunately, that didn't solved the problem... After rebooting my PC, I turned on the hotspot and tried to connect to it from a Raspberry Pi. But even if the pi says I have an IP (withifconfig), my computer still says I have 0 of 8 connected devices. And of course I can't access Internet from the pi.I tried with both Ethernet or Wi-Fi as source but I had the same result.","When you open the Settings-Network-Mobile Hotspot page, do you show a Network Name and password?  Do not publish the info, just a yes or no..  If you want to share your Internet connection, that needs to be enabled also.Are you aware the Hotspot uses the Virtual Wi-Fi adapters so you are not connecting over your normal Wi-Fi?","Yes, I have a network name, a password, and a frequency (set on 5GHz, but I tried both 2.4 and 5Ghz). I tried to change these settings in case of but nothing has changed. I know the hostpot uses virtual adapters but I never changed any settings on it. And I also know I can create a hotspot from my Wi-Fi connection, I used to do it and it worked very well before I installed the latest Windows updates (see my 1st post).","Okay, please refer to the following page and perform the steps to create a WiFi hotspot using Command Prompt and check if that works.https:\/\/www.windowscentral.com\/how-turn-your-wi...Note: This is a No-Microsoft website. However, I have checked the website to be potentially safe. (User's discretion required)","I am sorry I am not that familiar with the Mobile Hotspots, but it does not use your Wi-Fi, so how are you changing radios?  Am I correct in assuming if your Wi-Firouter was turned off, you should still be able to connect to the Hotspot?If you can't get it worked out, I will set it up on my system.  I already have the Hotspot configured on my primary system but I need to check how another system would be set to connect to that network..  I will assume the Hotspot SSID would show up in a list so you could select it..","This is my hotspot setup screen (in Windows settings) :Of course I the network name and password.If I turn my router off, my PC can't find Internet (normal) and I can't start the hotspot.","Thanks, I just tested it and the first command says \"Hosted network supported : no\"I can still create a network (netsh wlan set...) but I can't start it (netsh wlan start...).Weird, because it worked before today (12\/01\/2020) ~10:00AM, before I installed updates...","Well, you mentioned it worked today. Hence I would suggest you to perform a System Restore before the date 12\/01\/2020.Select a Restore Point older than 12\/01\/2020","I will simply uninstall the updates I installed this morning. I hope the next update(s) will fix this problem."]},{"symptom":"can not download games from app store for Windows 8.1 Pro        I use Windows 8.1 Pro, and have tried several times to download from the apps store Solitaire, I have good speed internet but the message come up connection too slow","solutions":["There are a lot of problems with Windows 8.1 and the Microsoft Store.This is how one poster here solved their problems with the Store>https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows8_1-windows_store\/windows-store\/ca81b81b-8b86-42c1-90b5-ec3e4afa1b4a?tm=1536786596734I contacted Microsoft support, got the virtual agent and asked her to chat with live person. Told the person my problem and it was fixed in an hour.To contact Microsoft Support:What can we help you with?https:\/\/support.microsoft.com\/en-usContact support         http:\/\/windows.microsoft.com\/en-us\/windows\/contact-supportAlso: https:\/\/partner.support.services.microsoft.com\/en-au\/contact\/menu\/software\/windows\/setup\/Cheers."]},{"symptom":"How to recover administrator password for my HP laptop        Is there a way to recover an anmin password for my HP laptop? I need to download something for my daughters vtech innotab3 and cant because I cant for the life of me remember my admin password please help there is no link like there is everywhere to get it thank you.","solutions":["\"What to do if you forget your Windows 8\/8.1 password\"http:\/\/windows.microsoft.com\/en-us\/windows\/what-do-forget-windows-password#1TC=windows-8If you've forgotten your Windows password, there are several ways to retrieve or reset it:If your PC is on a domain, your system administrator must reset your password.If you're using a Microsoft account, you can reset your password online. For more info, go to theReset your password webpage. If you're using a local account, use your password hint as a reminder.If you've tried these suggestions and still can't sign in:If you have Windows 8.1, you'll need to reinstall Windows. If you have Windows RT 8.1, you'll need to contact your PC manufacturer.@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Microsoft forbids any assistance being given in these Forums to help you bypass or \"crack\" lost or forgotten Passwords.Here is the Microsoft Information outlining that Policy:http:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_7-security\/keeping-passwords-secure-microsoft-policy-on\/39f56ef0-5d68-41ad-9daa-6e6019c25d37Cheers."]},{"symptom":"network diagnostic tool        How can I install the MS diagnostic tool ?","solutions":["Windows 7 has a built-in \"network diagnostic tool.\"  You don't need to install it.Perhaps you should explain ...What \"MS diagnostic tool\" you're referring to, including where you found a reference to that toolThe details of the network problem you're trying to diagnoseThe complete text of the error message you get when you try to run the \"MS diagnostic tool\""]},{"symptom":"Shortcut to inside Documents folder contents on taskbar        On Windows 7 I used to have a Documents folder shortcut on my taskbar. I could just click that shortcut and bingo, I was inside my opened Documents folder (where all my work is--not uncommon for users, I bet).On Windows 10 I haven't yet found a shortcut to the Documents folder contents that only requires one click. Instead I end up in Quick Access and then I have to click open the Documents folder. Two-click access to get to my work. Almost always. UGH.I've looked for a Windows keyboard shortcut to do this and haven't found one.How can I get one-click access to INSIDE my Documents folder? On my taskbar preferably to bring my computer back to its user efficiency before Windows 10.","solutions":["Hi DJY100, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.Have you tried a method such as this? https:\/\/winaero.com\/blog\/pin-folder-taskbar-win...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. In the Create Shortcut window, you could type in: explorer.exe C:\\Users\\YOURUSERNAME\\Documents I hope this has helped you. If this does not work or is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","Another expert has also suggested: Right click the Taskbar, choose Toolbars - New Toolbar, then navigate to choose the Documents folder and click OK.This is a different method than an icon that brings up File Explorer, and allows you a different type of access from the toolbar."]},{"symptom":"Returning Purchased Laptop to Store        I need to return a Dell 15 3000 (SSD) to the store where I recently purchased it.  It is running Windows 10 Home.  I have personal data on the system and have used the laptop for work and related activities that need to remain secure.  If I go to settings and reset the PC using the method that erases all files and settings, is that good enough?  Could technicians in the store still recover any of my information if they were motivated to do so?  What else could I do to feel more certain about secure deletion?I ask because two days ago I did a reset with file and settings deletion, but when I reestablished my Microsoft account onto the laptop again, some of the app icons reappeared on the screen.  When I double clicked the icons I received the message that the files associated with the shortcut no longer existed.  But still, this indicates to me that the Windows reset with file and settings deletion is somehow still vulnerable.","solutions":["Hi appollonius Yes, performing a reset is perfectly adequate to ensure you data is safe, the reason why some of your apps came back when you logged into that laptop again, is because of account syncing, that cannot happen at Dell, because they would not know your login details . . . When resetting Windows, you should have the option to remove you files, then on the next window, there should be a 'Clean the Drive' option, that is a more secure option, but can take a long time to process . .."]},{"symptom":"windows 7 updating        Will not install all updates, says I'm missing 'Tray App.msi'.","solutions":["What updates are not being installed, and what is the complete text of the error message?Tray App.msi is related to HP printer software.  Either reinstall your HP software package or uninstall all of HP's software other than the printers themselves.  See, for example, this HP support article: https:\/\/support.hp.com\/us-en\/document\/c00811375"]},{"symptom":"Base System Device        drivers not installed (code 28)","solutions":["Hi Anne. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Often an SD card reader. Check your PC maker's Support Downloads web page to install all of the latest drivers which should find it.If you want to trace the hardware ID to know exactly what it is, see how here: http:\/\/www.sevenforums.com\/tutorials\/73420-hard...I can help you if you get stuck. There is more about this here that's also helpful: https:\/\/www.lifewire.com\/how-to-fix-code-28-err...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Can't get Windows 7 to connect to wired internet        I had a modem\/router combination that went bad.. I have replaced it with a D-Link modem and a NetGear router. I have them both set up and working fine.I multi-boot Linux and Windows 7 and use wired internet access. When my old setup (modem\/router combo) was running, all my OSes had internet access. Now with my new network all the Linux OSes have internet access but I haven't been able to connect with Windows 7 whereas it was connected on the old system. I have tried downloading drivers and installing them but that didn't help. I have even went so far as re-installing Windows 7 but it still doesn't connect. I am far from a network guru. When trying to get Win 7 connected, I have gotten to the point that it was wanting my id and password that my ISP gave me. I input that but it didn't connect. I tried the ID and PW for the modem and that didn't work either.I am wondering if maybe there is a setting in the modem that needs to be enabled  or changed. Maybe someone more knowledgeable about networking would have some suggestions that I could try?Thanks,hwms43","solutions":["Hi hwms43,but what is the error message you receive from Windows when you try to connect with Windows 7?Try running the Troubleshooter.If you prefer, post the screenshot.Have you already tried to connect with your PC directly to the modem bypassing the router?https:\/\/support.microsoft.com\/en-us\/help\/10741\/windows-fix-network-connection-issues","When trying to connect my computer goes to 'Connect Broadband Connection'. There I put in the id and pw given me by my ISP. That returns \"error 651: The modem has reported an error\".The troubleshooter did no good. It couldn't find the problem and suggest that I look online to find a solution. Since I am not connected to the internet in that install, that is impossible. I have not tried to connect with my pc directly to the modem and bypassing the router. I have two or three other OSes on this pc that have no problem connecting to the internet.When I log into the Windows 7 os the resolution is not correct. Everything is huge and the start menu is just about off the desktop to the left. I re-set the resolution to be smaller and the next time I boot it is still huge. But that is another problem","Hi hwms43,run the network reset commands as described in the guide I posted to you previously.","Hi hwms43,run the network reset commands as described in the guide I posted to you previously.I will do this and post back what happens. Thanks","I ran the network reset commands as administrator.netsh winsock reset - oknetsh int ip reset - okipconfig \/release - \"The operation failed as no adapter is in the state permissible for this operation\"ipconfig \/renew - \"The operation failed as no adapter is in the state permissible for this operation\"ipconfg \/flushdns - \"Gigabit network connection adapter is experiencing driver - or hardware - related problems\" Detected","If you use VPN software try to uninstall it temporarily and then try again.Go to Device Management> network adapters, post the screenshot","If you use VPN software try to uninstall it temporarily and then try again.Go to Device Management> network adapters, post the screenshot","Hi hwms43,what is the exact model of your D-Link modem?And what is the version of the driver currently in use of the Intel (R) 82574L Gigabit Network Connection network adapter?","Right-click on the Intel 82574L Gigabit Network Connection in Device Manager and report the \"Device Status.\"Until I see what is reported there, my guess is that you need to install a driver for this device.  If you have a brand-name computer, you should go to the computer manufacturer's support web site, enter your computer's serial number (or Dell Service Tag) and then download the driver appropriate to your edition of Windows.  Otherwise, go here: https:\/\/downloadcenter.intel.com\/download\/18713\/Ethernet-Intel-Network-Adapter-Driver-for-Windows-7-?product=32210While you are in Device Manager, you should also expand the \"Other devices\" section and list what you see there.  This may shed some light on your other issue:  \"When I log into the Windows 7 os the resolution is not correct. Everything is huge and the start menu is just about off the desktop to the left.\"","Device status says: \"Device cannot start (code 10)\"I have previously downloaded and installed \"Prowinx64legacy.exe\"Attached is a picture of 'other devices'."]}]}