{"windows":[{"symptom":"Surface Pro won't print in color        My surface Pro won't print in color. The printer prints fine from other devices so I know it is not the problem. This just started randomly about a week ago, it previously worked fine.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues while trying to print in color while using Surface Pro.​​ As you have mentioned that you are able to print in greyscale, it is possible that printer settings are set to print in greyscale. We will certainly assist you with this issue. However, we would like to know the details requested below: What is the make and model of the printer that you are using?Which application are you are using to print?Are you aware of any changes made to the computer recently? I would suggest you to check the printing preferences and check if the Print in Gray Scale option is enabled. Refer the steps mentioned below: Press Windows Logo key + R, to openRun dialog box.Type control printers and click onOK.Right click on the Printer that you are using, and selectPrinting Preferences.Navigate to the Color tab and select the optionPrint in color. (If you do not see Color tab, you may want to check theAdvanced options and check if Print in Grayscale isoff.)Click on OK and check if you are able to print in color. Let us know how it goes. Regards,Nikhar KhareMicrosoft Community - Moderator","Hi,The model is HP 3820 and the printer works fine when printing from my other computer. All the settings on my surface for the printer have colored enabled so that is not the problem. I am printing from word docs, excel , PDF's and pictures. I have not made any changes to the computer but updates are automatic."]},{"symptom":"Contact list for Windows 10 mail        I have just upgraded from Windows 7 to Windows 10.  I was using Windows Live Mail with my Windows 7 system but I want to use Windows 10 Mail from now on.  I have created an email account under Windows 10 Mail which works.  It is an IMAP account.  However this account does not yet recognize  the contact list I transferred from my Windows 7 system (nor does it seem to store any email addresses for people I have sent or received messages from under the new account). I understand that the People App includes contact information use by Windows 10 Mail.  When I go to the People App to import the contact information from my Windows 7 system, the People App asks me to create a new account, even though the account has already been created under Windows Mail and is recognized in my account list under Settings: i.e., it does not recognized my IMAP email account. Please tell me how I can import my contact list to the People App for my existing IMAP Mail account.Thank you.  ","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query related to importing contacts in People app on Windows 10. Let me help you with the article which provides the information on using the People app. Please refer the articlePeople app help and see if that helps. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"lock screen picture        The lock screen picture of the Lake within the mountains is depressing me as it looks cold and dangerous and i would hate to be near there , evry time i boot my pc this picture comes on and cannot be deleted, it is really depressing me now i should be able to have a blank screen or a picture of my choice . i have been in settings and changed pictures but every time i boot this depressing picture comes on . why cant i delete it it makes me ill. regards steven","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? Under lock screen there should be an option to choose a photo (or Spotlight or slideshow) if you choose your own photo does it remain or return to the default mountain view?You could use this fix from the tenforum to reset & re-register Spotlight: https:\/\/www.tenforums.com\/tutorials\/82156-reset...Please follow the instructions carefully & note than it can take 24 hours for the photo to change.Disclaimer - This post contains reference to non-Microsoft websites and there may be ads on the page for products & services including products frequently classified as a PUP (Potentially Unwanted Product). Please thoroughly research any product \/ service advertised on the page before you decide to use them. Your discretion is very much advised.","If you have a picture that you like and want to use it go Settings, Personalization, Lock screen, under the picture change to Picture, Browse, find your picture, double click on it, Upload.","Thanks for your rely , i will read this very carefully and try it , Thank You ","If you wish more detailed instructions &\/or screen caps let me know.","How are you getting on with the instructions? Do you require any help?","will do Virginia thank you , regards steve","I look forward to hearing good news on your problem."]},{"symptom":"Windows 7 and Living With It After 14 January        I want to keep my Win 7 64-bit office-situated pc. I now can't afford to supplement it with a new,Ethernet-sharing Win 10 laptop. Twice in the past I'veUpgraded existing O\/S [95 to XP and XP to 7] and ended up with disk corruption\/fail. Looking at all options, I'm now usingFIREFOX [have to use it on 10 anyway as the pages keep freezing up (\"not responding\") onIE11] and will switch to PROTON Email [THUNDERBIRDwouldn't create an account]. A lot of web pages won't supportIE11, so that's no loss. I'm going to use a new anti-virus to replace MSE. NB:365 is deleterious to any 64-bit system. Thankful I created aRestore Point before trying it. As to Microsoft Security Updates, there are many users out there who boast that they'venever downloaded them. And I must admit that they did not prevent my pc from beinghacked. There are many freeware solutions out there without paying for MS's 3-year extension plan. Fact is, I and a lot of users don't like much of Win 10. Perhaps when its time for retirement comes something more palatable will emerge.","solutions":["Ok. Thanks","Virtually all of my clients are on the same wave length as you.  Keeping windows 7 working for as long as their hardware continues to work acceptably and other software is available for it.  Key, of course, is top-end antivirus software.  The following link is for a detailed step by step to re-install Win7 now and create a system image that can be restored regardless of Microsoft \"support:.https:\/\/www.askwoody.com\/2019\/canadian-tech-how-to-rebuild-a-win7-system-with-minimal-snooping\/","A lot of what you write doesn't make a lot of sense.  You need to address each issue individually.  Instead you're lopping everything together and kind of giving up.  Not a solution if you want to be on top of your system. No, the world won't end on Jan 14 for Win7 users.  For security read\/write all email in Plain Text, easily done in Thunderbird.  Proton has many restrictions that Thunderbird doesn't have.  Opera Mail is another option though Thunderbird is far better.  Depends on how many email accounts you're managing.  So fix this account problem with Thunderbird by asking on Mozilla's support forum.  Its excellent. For Office try Libre Office.  Seems to work fine.  Free.  For webpage compatibility use both Chrome and Firefox.  Firefox gives the user far more options but is not always compatible with all websites so we need Chrome as a backup.  And if you're talking\/chatting online you need Chrome for Hangouts.Get a SSD drive for C drive if you're using older hardware.  You might want to mention your CPU type\/speed and ram for reference.  SSD's are incredibly cheap.  You can put almost all your programs on a cheap Sata 7200 rpm drive along with all your files\/data.  My 30gb SSD cost me $15 a couple of years ago.  They're cheaper now.  Go with a 60gb for about $20 used.  Just wipe it well before use in case there was some psycho using it before you.  Eraser is good for that.  Also KillDisk.  It can take hours to properly overwrite a hard drive.Meanwhile try OS X (it can run on many types of PC hardware) and Linux as a backup to Windows.  We'll almost always need Windows but it doesn't mean you have to use it all the time.  As SSD's are so cheap now its best to put another OS on a separate drive instead of partitioning a drive.  For Linux just use a 30gb.  Should be about $10 used.  For OS X you may be able to use the same size, not sure. For hardware upgrades look at midrange AMD Ryzen stuff as OS X is now far more compatible with that now that it used to be.  Get a CPU with built on video to save a lot.  Used prices:$50-70 ATX AM4 motherboard for Ryzen CPU's $50-70 Ryzen CPU with built in video$25-50 8-16gb DDR ram$20 Power supply$$10-20 Case$155-230 Total for great midrange performance.  Ebay is your source.  Amazon is a joke comparatively for used equipment.  Obviously get your case locally as shipping will be much higher because of its size.  Maybe the power supply too as they're kind of heavy.  24\" monitors should be $50-80 and 27\" ones about $70-100.  Compare that to the lunacy of an iMac! "]},{"symptom":"Delete File failed; code 5 Access Denied        trying to install a file on my new Dell Alienware PC I have full admin rights on the pc can anyone please point me in the right direction... it's driving me crazy ","solutions":["Hello j_k_nash, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemSorry but this was not clear, are you trying to delete something or install something?can you please provide more info? Cheers! Farah","Trying to install a program... it really should not be this hard I have followed ideas here https:\/\/windowsreport.com\/error-5-access-is-denied-fix\/ but I am admin on the account I tried all of these approaches...  ","Have you followed all the steps mentioned in this link? You should check the folder it needs to be installed on and then apply the following:- open cmd from start menu and run it as an adminisrator - type the following command to take ownership of the folder: takeown \/f \"C:\/folder\/file\" \/r \/d y replace \"C:\\folder\/file\" with your actual folder which you are installing to. - aterwards run this command: icacls \"C:\/folder\/file\" \/grant administrators:F \/T you should be able to install your program in the desired path. Let me know how it goes Farah","Why do I need to do this? I will try it now but I dont understand I. Ever needed to do this for other application ","Do you have a uk support number 0800 0260330 is it... ","My interpretation is: It could be that this application is not digitally signed, and it tries to write new data in Program files or in the Drive C. which only Windows trusted installer service can do,therefore, the installation is not allowed to proceed. I believe that it a program related in this case. and for further investigation you can contact the program manufacture or follow the workaround I posted.Please let me know if I can help more :) Cheers! Farah","Its going to create its own directory in programs so do I run on programs? ","I would not take the ownership from windows in Program files folder..this could lead to some issues with the system.another workaround is to open a CMD window and run it as an administrator, then drag the installation setup to this cmd window and run it from there.btw. can you share this program name?"]},{"symptom":"Windows Hello        Hello, my windows hello has been very weird lately. When I try to update my photo because I got new glasses, the windows hello scans my face in black and white. Can anyone help me?*****Moved to Windows*****","solutions":[]},{"symptom":"Will not allow DVDs to play        This unit will not play any type of DVD ??????","solutions":["Hi Robert, There's a lot of things to consider in regards to this issue. However, where are you playing your DVD's? Are you able to play them before with the same PC\/Laptop that you're using? We need more information in order to determine what would be the cause of this issue.Please provide necessary data that we need to further assist you. Thanks and regards,","Thanks for your response.I have recently purchased a refurbished Dell Optiflex 7010 USFF Desktop PC with Optical DVD Drive.I downloaded\/purchased the Microsoft DVD player but it will not play any sort of DVD.The DVD is accepted by the PC but does not play.Many thanks, Bob Wolstenholme","Since you have Windows 10 have you tried the Movies and TV app?  In Device Manager does it show your drive working properly? Be sure the correctDVD Region is set for your location.","Hi Bob, Most likely the codec of your player doesn't have the correct one to play the ones with the DVD.Since your DVD can be detected, can you confirm if you can open the files inside?Please also provide the file extension of this DVD content. I may suggest you to use VLC media player as it has more codecs that has compatibility with this kind of files in order for you to play.Please let me know if you'll be able to download this. Thanks and regards,","This unit will not play any type of DVD ?????? thank you","where are you playing your DVD's?"]},{"symptom":"I can't download Nvidia Control Panel on Microsoft Store        I recently got a bitcoin mining virus and it was impossible to delete it, my only option was to Reset factory my pc. Usually i will have Nvidia control panel installed automatically when i reset my pc But it was gone this time. So i tought it's because i haven't updated my gpu drivers after when i did that The application said You can download Nvidia Control panel on Microsoft. I couldn't download it.Is it because of the virus or i'm just having issues with my gpu. I've also tried to plug my hdmi cable on and off. it still didn't help.","solutions":["Is there any error message when you try to download? Is Windows fully. Up to date? When I clean installed Windows recently I couldn’t install iCloud due to requiring further updates.Have you tried downloading the drivers direct from nVidia? It may be due to the virus, you can check with these programs: Try running these programs: MBAM free: https:\/\/www.malwarebytes.com\/mwb-download\/Eset online scanner: http:\/\/www.eset.com\/us\/online-scanner\/ Adwcleaner: https:\/\/www.malwarebytes.com\/adwcleaner\/If these find one or more infections but do not fully remove them it will be wise to register with a malware removal site to receive dedicated malware removal instructions, an expert will remain with you throughout the process until confirmation that your PC is 100% clean. Malwarebytes virus\/malware removal forum: https:\/\/forums.malwarebytes.com\/forum\/7-windows...Bleeping computer malware\/virus removal forum: https:\/\/www.bleepingcomputer.com\/forums\/forum22...Disclaimer - This post contains reference to non-Microsoft websites and there may be ads on the page for products & services including products frequently classified as a PUP (Potentially Unwanted Product). Please thoroughly research any product \/ service advertised on the page before you decide to use them. Your discretion is very much advised.","When you download the GPU installation package from Nvidia it will install the Nvidia Control Panel. What graphics do you have and have you downloaded the latest driver from Nvidia.?","Hi Ainda,            Your best bet is to go to there web site and download it there. Link : https:\/\/www.nvidia.comI Hope I've Helped","I got a laptop from Dell, they came with RTX 2060 6gb, my computer was slow because apparently there is another graphic card. I tried to use the 2060 instead of the one that intel came with, so I tried to download the drivers. I thought it worked, it didn't. And when it finished the installation, there was a message popped up said \"Nvidia control panel is missing, click here to download from Microsoft Store\" I tried to download it from the site store. A message popped up \"Open URL:ms-windows-store?\" so I clicked open, but then nothing happened after that. :\/ I'm very frustrated, and I don't know what else should I do lol.","If you go to the Device Manager you can update your GPU Drivers, hopefully that can fix it and if it doesn't you can disable the other display adapter and try that1. Click the Windows Key 2. Type in Device Manager3. Locate Display Adapters and double click it.4.  Right click the Display Adapter.  (It'll probably show up as NVIDIA GeForce RTX 2060.)5. After that click update driver then Search automatically for updated driver software. After that you might see some flashing while it's installing which is normal.If this doesn't work you can try the disabling the secondary display adapter, just go through the same process but instead of updating you would click disable on the other adapter.","I also have this problem with missing control panel according to microsoft store","You need dhc drivers apparently: https:\/\/www.nvidia.co.uk\/Download\/index.aspx?lang=en-ukAnd windows update on automatic, so it can download control panel automatically through windows update. https:\/\/nvidia.custhelp.com\/app\/answers\/detail\/a_id\/4733\/~\/nvidia-control-panel-windows-store-app "]},{"symptom":"Problem CONNECTING to wireless Bluetooth Speakers        I have a Dell Windows 10 Inspiron 3668 (x64).I am unable to connect to wireless speakers (Creative T15) from my desktop.The wireless speakers work fine from my iPhone.The Dell has no problem connecting to an adjacent wireless printer.I have replaced and updated all the drivers, and checked Bluetooth services settings.I am able to PAIR the speakers, but cannot CONNECT.I think this problem recently occurred after installing a Windows update.","solutions":["Hi JAS. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give all possible steps for troubleshooting Bluetooth in order of priority, so even if you've tried them please do it over in sequence. Many problems right now are being solved by updating to the latest version so if you want to skip to that step see the Repair Install at bottom: Try Updating the Bluetooth driver from the Dell Support Downloads webpage here: http:\/\/www.dell.com\/support\/home\/us\/en\/19\/Produ... for your Service Tag on sticker on PC. Install it even if it's the same or newer than the one in Device Manager reached by right clicking the Start button.Right click Start button to access Device Manager, locate Bluetooth device (if necessary from View tab Show Hidden Devices), on Driver tab see if Roll Back is available, if not try Update Driver, first automatically, then Browse, then Let Me Pick to try all previously installed Drivers. If these fail Uninstall the Driver, restart PC to reinstall. If the BT driver is not there, access the View tab in Device Manager to \"Show Hidden Devices.\"Make sure you're pairing correctly as shown here: https:\/\/support.microsoft.com\/en-us\/help\/15290\/... See Fixes here which are all working: https:\/\/support.microsoft.com\/en-us\/help\/14169\/...https:\/\/superuser.com\/questions\/1017867\/make-wi...https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/www.lifewire.com\/fix-windows-10-bluetoo...Try the Bluetooth troubleshooter at Settings > Update & Security > Troubleshoot. Try turning off Fast Startup at Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change settings that are unavailable > uncheck Fast Startup.If this is a mic or headset right click Volume icon in System Tray to Open Sound Settings, make sure the correct device is selected for input or output in the dropdown menu.Then try pairing again, if necessary run the Bluetooth Troubleshooter again. If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....If you think the BT adapter has failed, you can replace it easily with a USB nano adapter like this one:https:\/\/www.amazon.com\/ZEXMTE-Bluetooth-Receive... Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1909 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Greg,Thanks so much for your detailed comments.  Since I had done most of your suggestions multiple times, I decided to reinstall windows which took about three hours.  After it successfully completed, I checked all the drivers with device manager and all were running properly.  I then went to services to verify that bluetooth services were running.  The BT audio gateway, bt driver management service, and bt support service were all running.  They were, but the bt user support service was not and after starting it, I was unable to APPLY the change.  I get a \"The parameter is incorrect\" message as I had previously.Bottom line:  the same problem exists.  The Creative T15 Wireless audio device shows up as paired, but when I attempt to CONNECT, I get \"That didn't work.  Make sure your Bluetooth device is still discoverable, then try again.\"It's pretty clear that the BT device works with my iPhone and my BT printer works from my desktop, so the problem seems unique to BT audio.Not sure where to go next!","If none of the troubleshooting steps I gave help then your BT adapter may be failing. I suggested an inexpensive nano adapter you can replace it with and be back up and running for about $12.","Greg,I'd be happy to do that, but my BT printer works fine.  Do you still recommend that?","Got it. See if any steps here for those speakers work: https:\/\/answers.microsoft.com\/en-us\/windows\/for...I'll give you all possible solutions for Sound problems in order of priority, so please try any you've already tried again in order. If you have any problems performing any steps I'll be standing by here to help you.1) Update the sound driver from the PC or device maker's Support Downloads webpage for your exact model, if it is newer than the one presently installed in Device Manager reached by right clicking the Start button. While there compare to make sure you also have the latest BIOS, Chipset, Display, Network and all other drivers. 2) Restore the Windows Audio Service which may have become disabled: https:\/\/www.tenforums.com\/tutorials\/57567-resto... 3) Next try these checklists: https:\/\/support.microsoft.com\/en-in\/help\/402699... https:\/\/www.howtogeek.com\/443702\/how-to-fix-sou...4) Right click Volume icon in System Tray, choose Sound Settings, from the Output and Input devices dropdown menus, choose then one(s) affected to see if that helps. If not use the Troubleshoot button nearby.5) Run the Playing Sound troubleshooter at Start button > Settings>Update & Security>Troubleshoot.6) Try rolling back the sound drivers in Device Manager reached by right clicking the Start button. Choose Sound controller and other audio devices, then Driver tab, then Roll back if available.7) If no newer sound drivers then uninstall the one presently installed in Device Manager, reached by right clicking the Start Button. Restart PC to reinstall.8) Try other and older drivers for your model Sound controller, too. For example, try the next oldest driver in the model's online Support Downloads list. To try all previous drivers installed on your system, in Device Manager choose Sound controller's Driver tab, then Update Driver, then Browse, then Let Me Pick. Finally, try installing the latest Sound driver in Compatibility Mode as shown here:https:\/\/social.technet.microsoft.com\/Forums\/win...________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Greg,Thanks again for your detailed reply.  After no luck with \"reconfigurations\" I ordered the Zexmte bluetooth USB Adapter.  After figuring out how to disable the internal Dell wireless adapter, I'm now able to access my wireless speaker.This was a weird problem all along.  I'm learning that wireless devices have a relatively short technical life.Thanks again for sharing your knowledge."]},{"symptom":"Your Phone App - Won't Connect        All I'm getting from the app on the Windows side is, \"Please install the app we texted you and sign in with (my email address),\" yet I'm receiving no text. I just have a spinning wheel. The app comes pre-installed in my Note 10+, and so I've no idea how I'm supposed to sign in, as there's no \"app\" in the tray. I can get the App Info under settings, but there's no way to log in or out. I can't even uninstall the app and reinstall it. No idea how I'm supposed to sign in as instructed on the Windows side. On the same network, battery saver not running, notifications are enabled, do not disturb is off in both places (per help guide). It was working fine on my old phone, but not having any luck with this new one. ","solutions":["Are you able to open the same from there? Also, is there your phone icon in the notification area?"]},{"symptom":"How do you remove a corrupt profile from Windows 7 that does not show up in User Accounts in the Control Panel?        I have Windows 7 Home Premium 64-bit, and I have one user profile I just recently attempted to remove.  During the process, it was interrupted in the middle of removing the profile.  The folder is still shown under the Users folder, but under User Accounts in the Control Panel, it is not shown.  How do I completely remove the user profile?  Any help would be appreciated.p.s.  I have three other accounts (two with Administrator privileges).  The one I tried to remove also had Administrator privileges as well.","solutions":["Do NOT reply to that scammer claiming to be from Microsoft Support.They have been banned.","Did someone claiming to be from Microsoft Support respond to my question?  I only see your reply, unless their reply was removed due to being banned?"]},{"symptom":"here is the link         i have noticed a huge increase in CPU usage i didnt have this. a lot of my CPU power is going into the running of DCOM server process launcher which can be upwards of 45% and often sits around 15-20% this is creating issues when im playing games most often but sometimes it becomes a problem with normal use.https:\/\/1drv.ms\/u\/s!AneZ1IQ3lH7TasYD0GEI6I70ESI?e=oBgJEV","solutions":[]},{"symptom":"Saved Documents within File Explorer will not open        Help,I have a Windows 10 operating system on a Lenovo YOGA 730-13 Laptop.  I also have OneDrive (both personal and from Work). Currently, I save several types of documents (Word, Excel, PPT, etc.) within folders that I have created and placed on my Desktop.The Problem:- Regardless of whether I go directly to the Folders on my Desktop or click on the File Explorer (Search, locate the folder on my Desktop, then try to click to open an individual document) … all I get is the spinning wheel of nothing.  Nothing opens.  Then File Explorer freezes and displays a message (Not Responding).What do I need to do?  Please advise.  These files are business critical.Thank you, ","solutions":["Hi BDW3 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"Windows 10 1903 can't manage a printer        I have a few Windows 10 Pro x64 1903 (with 2019-05 or 06 cumulative update) having an issue where when you use the modern Settings app > Devices > Printers & Scanners, when you click on an existing printer, the printer below it does not drop down making space for the the \"Open queue\" and \"Manage\" buttons, instead the buttons overlay the lower printer, but won't allow you to click on the buttons, therefore you can't manage the printer.","solutions":["Hi,Thank you for writing to Microsoft Community Forums.We understand your concern. Could you please let us know if you have noticed any other issue with Settings app?We recommend you to follow the steps mentioned below to re-register Settings app and check.1. Search for PowerShell in the search bar.2. Right click on the same in the list and choose Run as administrator.3. Then copy and paste following command and press Enter.Get-AppXPackage -AllUsers -Name windows.immersivecontrolpanel | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register “$($_.InstallLocation)\\AppXManifest.xml” -Verbose}4. Then close PowerShell session and check for the issue.Regards,","I haven't run the command yet, but wanted to report the additional information I had first.I have had this issue primarily on the Microsoft Print to PDF printer.  Though I have had one Desktop where a Canon printer had the same problem.In trouble shooting the issue, I did the following:User had the issueLogged in as local admin - (didn't check PDF functionality) - remoted the Print to PDF feature - rebootedLogged in as local admin - reinstalled featurelogged in as local admin - checked - it worked as desired - rebootedlogged in as the user - still broken.This morning, another user reported having the same problem, unable to manage the Microsoft Print to PDF printer.","I applied the powershell script, rebooted, and there was no change.I deleted the user's profile, then set it up again, there was no change.","While continuing to work on this -since I could see the Manage box, I decided to try to tab to it, and it worked.  I pressed enter with it highlighted and I was able to manage it.Now my goal was to set it as default, the set as default button was missing.  After some searching around, I realized that the \"Let Windows manage my default printer\" box had become rechecked.  After unchecking it, and once again using the tab trick to get into manage the MS Print to PDF feature, I was able to set it as the default printer.So I've found a work-a-round, but the display issue is still there so I don't consider the issue resolved.","FYI, I uninstalled the 1903 version of the June-2019 cumulative update to see if that would fix the display issue, it did not.","I can tell you this has something to do with administrative settings. This happens for our users but not on my administrative account. And when I give the user administrative rights, they no longer have the issue. I'm going to review the ADMX files for 1903 and see if I can find some kind of group policy setting that needs to be adjusted.","I can tell you this has something to do with administrative settings. This happens for our users but not on my administrative account. And when I give the user administrative rights, they no longer have the issue. I'm going to review the ADMX files for 1903 and see if I can find some kind of group policy setting that needs to be adjusted.I am also seeing the same behavior on my end. Admin accounts work, but standard users don't. So obviously some permissions broke during the upgrade. I've tried checking the folder permissions for C:\\Windows\\System32\\spool\\drivers\\x64 but that is not working either. ","Interesting - I'm fine with the belief that it's a permission issue, but not sure why that folder would affect the display settings. Just a reminder - all functionality is there if you use tab to get to the buttons and then ENTER to activate the button, the issue is completely around display.","Well, what's interesting is the standard user does not have the \"Remove device\" button.Standard User View: Open Queue, ManageAdmin View: Open Queue, Manage, Remove DeviceI'm making an assumption that whatever ties to\/around that permission may correct the display problem?","Have non admin users had remove device in the past?  I use GPO to grant my users the rights to install\/remove printers as non admins.. so I'm not sure what normal people see in a non GPO setup."]},{"symptom":"Address in Long Branch        642 McClellan Street","solutions":["Hello MikeLeVien, You have posted in Microsoft community.. do you have any question or discussion regarding Microsoft products or services?Cheers! Farah"]},{"symptom":"Fix for file history disconnection        Hi, What software can I download to fix my file history?  I keep getting pop-ups that say the file history is disconnected.I Googled the problem but the software that came up my security protection said was on a list of unsafe sites.  Any ideas? Cheers Sue","solutions":["Hello SueFreeman2, I'm Didi, an independent advisor. You don't have to download any third-party software, just reconnect your File History drive using the following guide :https:\/\/support.microsoft.com\/en-gb\/help\/402656... Regards, Didi"]},{"symptom":"Windows Hello Twin Test        Am I the only one with a  twin who can unlock my PC using Windows Hello, I use a Microsoft Surface Pro","solutions":[]},{"symptom":"BSOD bugcheck - help needed        I keep getting BSOD.The computer has rebooted from a bugcheck.  The bugcheck was: 0x000000ef (0xffff8d05caa4b140, 0x0000000000000000, 0x0000000000000000, 0x0000000000000000). A dump was saved in: C:\\WINDOWS\\MEMORY.DMP. Report Id: 9a98571a-ff32-4c7e-bd35-e01ee935e0a9.Any idea what it might be?","solutions":["Hi David, to diagnose the underlying issue, I need to analyse your Mini-dump file(s):Open Windows File Explorer Navigate to C:\\Windows\\Minidump Copy any minidump files onto your Desktop, then zip those up Upload the zip file to the Cloud (OneDrive, DropBox . . . etc.), then choose to share those and get a share linkThen post the link here to the zip file, so we can take a look for you . . .","As requested link to mini dump.https:\/\/drive.google.com\/file\/d\/17z3bAqoQR6S3B6t9SdLJQetm2BYmpswF\/view?usp=sharingThanks.","Hi David I am sorry, that minidump file just indicated a generic Memory Corruption error and did not point to a specific driver or piece of software . . .Please wait for your system to crash again, then upload any further minidump files generated and we can continue to analyze those for you until we find the underlying cause . . .","Another crash.Here is the link to mini dump file.https:\/\/drive.google.com\/open?id=1rxSNGGAZXE9goV_dmKvfvxMr3Cry10HjRegards,David,","Hi, There was a Bug Check 0xEF: CRITICAL_PROCESS_DIED. Try to run the System File Checker Tool to repair missing or corrupted system files.Go to CMD and run it as Administrator. Then type, sfc \/scannow You can also run the DISM command in CMD. Type these commands. DISM \/Online \/Cleanup-Image \/CheckHealth DISM \/Online \/Cleanup-image \/Restorehealth","seems to have found a problem but cannot recover it.Links for sfc cmd window output and also have link to CBS.log for you.https:\/\/drive.google.com\/open?id=1NEYve47IgiB36UED1iStae14esZG0ijbhttps:\/\/drive.google.com\/open?id=1DiGvkd_u7H0vqZWXel8-apiHJlUxoBw4","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. It appears from the log that there are some corrupted files which cannot be recovered.I would request you to kindly perform a System Restore to a certain date and time when this issue wasn't present."]},{"symptom":"Video Editing        When I try to edit a video in Photos (trim), a very fast message appears that says, \"Get full video for editing.\"  The file is all the video I have from the camera.  It has a mov extension.  What does this message mean other than something that I cannot do?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. This might be just an error. Please reset the Photos app and check. Go to Settings. (PC Settings) Click Apps Select Apps and Features Select \"Photos\" app. Select Advanced Options Click on Reset."]},{"symptom":"when i get in gta v thers no sound how can i fix that        when i get in gta v online thers no sound and when i go to settings SFX volume is ll the way up as music volume and when i go to youtube there is sound so my headphones arent a problem","solutions":["Hello nikolamilonjic! My name is Marco, I am an Independent Advisor. I will do my best to help you.While your game is open, press \"alt + tab\" to go to windows and do a right click on the speacker in your taskbar, click \" open volume mixer \" and see if all your volume is turned up.It is quite possible that it is only that :) Give me news. Marco","Hello nikolamilonjic! My name is Marco, I am an Independent Advisor. I will do my best to help you.While your game is open, press \"alt + tab\" to go to windows and do a right click on the speacker in your taskbar, click \" open volume mixer \" and see if all your volume is turned up.It is quite possible that it is only that :) Give me news. Marco How do i get to the tasc bar","How do i get to the tasc bar","The task bar is the bar where your shortcuts are at the bottom of your screen. And the speacker I'm talking about, is located at the bottom right next to the hour.","that whas the isue thanks for your help","It was a pleasure.","It was a pleasure. I think it whasnt im a litle kid that dosnt even know what is a task bar"]}]}