{"windows":[{"symptom":"Windows Media Player doesn't work        I've had problems with Windows Media Player for a while now but just avoided using it, but now I need it to create a playlist to transfer to my FitBit.  Every time I try to save a new playlist, I get the error:  Windows Media Player encountered a problem while creating or saving the playlist.  I've tried turning it off and on.   I've uninstalled it and reinstalled it.  How can I get this working again?","solutions":["Hi CJ. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See fixes for Windows Media Player encountered a problem while creating or saving the playlist here: https:\/\/www.kapilarya.com\/windows-media-player-...https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/www.computerhope.com\/issues\/ch000113.htmhttps:\/\/www.lifewire.com\/repair-a-corrupt-wmp-d...If none of the above help then try downloading and running these WMP troubleshooters:http:\/\/aka.ms\/diag_wmpl10http:\/\/aka.ms\/diag_wmpc10To copy playlists: https:\/\/www.techwalla.com\/articles\/how-to-copy-...https:\/\/www.techwalla.com\/articles\/how-to-trans...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"HP Laser jet p1102w printer        HiI have window 7 in the salon and am having trouble with the printer.It has been fine up to now.It will not print PDF at all.I spoke at length last friday with someone from HP and they tried everything for 1.5 hrs and could not figure out the problem.They suggested I contact you in case it is a  problem from your end?ThanksJackie","solutions":[]},{"symptom":"Computer Crashing Blue Screen        My computer keeps crashing, going to blue screen, and restarting. It says :Problem signatureProblem Event Name:    BlueScreenCode:    1000009fParameter 1:    4Parameter 2:    12cParameter 3:    ffff920f4feb1040Parameter 4:    ffffab0bfc4a78e0OS version:    10_0_18363Service Pack:    0_0Product:    256_1OS Version:    10.0.18363.2.0.0.256.48Locale ID:    1033Extra information about the problemBucket ID:    0x9F_4_IMAGE_amd_sata.sysServer information:    e836c059-65cb-4591-80e6-170855ffba50DMP file : https:\/\/1drv.ms\/u\/s!ApY2FqxYS2sPhCXmlKbQBf2pT3qz?e=4jxtUQ","solutions":["Hi Kelly, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved. Troubleshoot blue screen errors <-- read this link http:\/\/windows.microsoft.com\/en-us\/windows-10\/t...The BugCheck was 9F and is most often a driver\/software issue though it can be hardware.BugCheck 9F, {4, 12c, ffff920f4feb1040, ffffab0bfc4a78e0} Probably caused by : pci.sys pci.sys is a Windows component which means something else drove it into Fault. Further detailed analysis indicated that atikmdag.sys was the possible cause. ffffab0b`fc4a62f8 fffff800`68747124*** ERROR: Module load completed but symbols could not be loaded for atikmdag.sysatikmdag+0x7124 atikmdag.sys dated 8\/26\/2019 AMD\/ATI video drivers. 1. Update the AMD\/ATI video driver and check with their support and forums about any known issues.AMD\/ATI - Support and Driver - Search http:\/\/support.amd.com\/us\/psearch\/Pages\/psearch...Get the Catalyst Drivers here http:\/\/game.amd.com\/us-en\/drivers_catalyst.aspxATI - Forums http:\/\/forums.amd.com\/game\/categories.cfm?catid...ATI - Support and Drivers http:\/\/support.amd.com\/us\/Pages\/AMDSupportHub.aspx2. Check with ASUS Support and Forums about any known issues. Update the BIOS, chipset drivers (this is important), and all the major device drivers (see methods below). <- Especially do this since it is a fairly new build.BiosVersion = 1405 BiosReleaseDate = 11\/19\/2019 BaseBoardManufacturer = ASUSTeK COMPUTER INC. BaseBoardProduct = PRIME X570-PRO BaseBoardVersion = Rev X.0x ASUS - Service <-- includes Live Chat - Chat Icon is on lower right of page https:\/\/www.asus.com\/us\/support\/Download-Center\/ASUStek Support https:\/\/www.asus.com\/support\/ASUStek Forums are ZenTalk orROG (Republic of Gamers) ZenTalk https:\/\/www.asus.com\/zentalk\/portal.php?nocache=1ROG - Republic of Gamers https:\/\/rog.asus.com\/forum\/?_ga=2.79315284.1301...ASUStek Drivers https:\/\/www.asus.com\/us\/support\/Download-Center\/3. Remove ALL power and reseat all the cards, memory, and cables (on both ends when possible) - actually remove and replace - do not just snug. <- Especially do this since it is a fairly new build.4. As needed use ALL the methods in the troubleshooters below. 5. After ALL the above if needed run Driver Verifier to see if it can indicate a CAUSE (see Driver Verifier methods below).===================================================== This \"could\" be a power supply problem though it is not the most common cause. 9f is likely a driver issue. Antivirus\/antispyware\/security programs can also cause these issues.Have you added devices lately or updated drivers - be sure to check in Windows Updates to see if a driver was updated prior to this occurring. This could also be caused by a loose card or cable and even a weak power supply.That error means a driver is not handling the power state properly. Check Right Click Start Button - Device Manager to be sure major drivers are not shut off during sleep - double click Display Adapter - NIC and WIFI - Sound and others - Power Management tab - uncheck Allow computer to turn off power. Maybe only one has an issue. (Use RUN instead of Start - Search as used on Vista or Windows 7) WINKEY + X - RUN - type in MSCONFIG.exe General Tab - check Diagnostic Start - APPLY \/ OK - REBOOT Try it now. If it still blue screens think Video Driver. If not think NIC, Wifi, Sound, or.....(and it still could be video interacting with something else). See troubleshooter link above for my generic driver update methods. BCCode: 9F 0x0000009F <-- read this link http:\/\/www.faultwire.com\/solutions-fatal_error\/...*1167.html?order=date OR click here -->https:\/\/tinyurl.com\/yxzw4yug---------------------------------------------------------- This is my generic how to for proper driver updates : This utility makes it easy to see which versions are loaded : Run DriverView - set VIEW to Hide Microsoft drivers - update those without Dump in their names. (also update the BIOS and low level chipset drivers)DriverView - Free - utility displays the list of all device drivers currently loaded on your system. For each driver in the list, additional useful information is displayed: load address of the driver, description, version, product name, company that created the driver, and more. http:\/\/www.nirsoft.net\/utils\/driverview.htmlFor Drivers check System Maker as fallbacks and Device Maker's which are the most current. Right Click the Start Button- Device Manager - Display Adapter - write down the make and complete model of your video adapter - double click - Driver's tab - write down the version info. Now click Update Driver (this may not do anything as MS is far behind certifying drivers) - then Right Click - Uninstall - REBOOT this will refresh the driver stack.Repeat that for Network - Network Card (NIC), Wifi, Sound, Mouse and Keyboard if 3rd party with their own software and drivers and any other major device drivers you have. Now go to System Maker's site (Dell, HP, Toshiba as examples) (as rollback) and then Device Maker's site (Realtek, Intel, Nvidia, ATI as examples) and get their latest versions. (Look for BIOS, Chipset and software updates at System Maker's site while there.)Download - SAVE - go to where you put them - Right Click - RUN AD ADMIN - REBOOT After each installation.Always check in Device Manager - Drivers tab to be sure the version you are installing actually shows up. This is because some drivers rollback before the latest is installed (sound drivers particularly do this) so install a driver - reboot - check to be sure it is installed and repeat as needed. Repeat at Device Makers - BTW at Device Makers DO NOT RUN THEIR SCANNER - Check manually by model.Manually look at manufacturer's sites for drivers - and Device Maker's sites. http:\/\/pcsupport.about.com\/od\/driverssupport\/ht...___________________________________________ After doing ALL the updates you can, and if the issue continues, then run Driver Verifier. Using Driver Verifier to identify issues with Windows drivers for advanced users http:\/\/support.microsoft.com\/kb\/244617How To Troubleshoot Driver Problems in Windows Vista or 7. (8\/8.1 and 10 are essentially the same). http:\/\/www.winvistaclub.com\/t79.htmlUsing Driver Verifier https:\/\/msdn.microsoft.com\/en-us\/library\/window...WINKEY + X - RUN - type in -> verifier \/reset hit enter to disable If Driver Verifier creates a minidump upload it and post the link here so we can analyze it.Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all."]},{"symptom":"Problem booting up Pc        I shut down my pc one day and the next day, the pc says that the critical process died. I tried every form of troubleshooting but the computer will not let me leave the systems menu. I only have 4 options:to restart, use a device, troubleshoot, and shut down. Ive tried every form including system restore command prompts etc. what do i do","solutions":["Hi Aidan. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See fixes for Critical Process Died: https:\/\/www.thewindowsclub.com\/critical-process...https:\/\/www.makeuseof.com\/tag\/critical-process-...Unplug power and remove battery, press and hold power button for 30 seconds to release all power from circuitry, plug back in and power up to see if any change.I will give you steps to access the Repair Mode to try all repairs to get Windows started, and if not to do the automated Reset or the superior Clean Install after rescuing your files.1) Use whichever method works in this link to access Advanced Startup Options: https:\/\/www.tenforums.com\/tutorials\/2294-advanc.... Easiest may be to force shut down the PC (by holding in the power button) three separate times to trigger the Startup Options. If one of these methods work, then go to Step 3.2) If none of the other methods work it may be necessary to Create Windows 10 Installation Media on another PC following the steps in the middle of the downloads page here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... Make sure to uncheck the box for Recommended Settings to choose only the licensed version.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... Choose the boot device as a UEFI device if offered, then on second screen choose Repair Your Computer. If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first. There is always a way to get the media booted and I will guide you until it does, even if necessary to reset the BIOS to defaults via several methods.3) In the Advanced Troubleshooting options try to System Restore to a point before the problems began, try the new Uninstall Updates button, then Startup Repair, then if necessary from Startup Settings try to get into Safe Mode with Networking, or lastly Safe Mode. If Startup Settings aren't available you can force Safe Mode from the Command Prompt following Step 5 here:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf..., or using the command to unhide F8 Advanced Boot Options here:https:\/\/www.tenforums.com\/tutorials\/22455-enabl... where you can also try the old reliable Last Known Good Configuration.4) From Safe Mode w\/Networking work through the Windows 10 Install Integrity Checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... Update your drivers from the PC's Support Downloads web page. Compare the latest drivers with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.5) If Safe Mode doesn’t work or help stabilize things then return to Advanced Troubleshoot options. Next try Command Prompt to run through Windows 10 Install Integrity Checklist (above link) Step 10 repair commands including sfc \/scannow, DISM, a full Disk Check: https:\/\/www.groovypost.com\/howto\/check-hard-dri..., or return to Troubleshoot options to Reset Your Windows 10 PC.6) Better yet use the same booted media to do the vastly superior Clean Install following the steps in this link to delete all partitions down to Unallocated Space to get it cleanest:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... 7) There is a step to Rescue Files from the booted media or Repair Mode Command Prompt first:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... These steps are excerpted from my tutorial that compiles everything possible for Troubleshooting Windows 10 Failure to Start:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... You can continue with the other steps there.To test hardware, Dell and HP have onboard diagnostics triggered by powering up and pressing the F12 and ESC key respectively.Test the RAM overnight to stress it with the best bootable test memtest86, following these steps which test both the sticks and the slots:https:\/\/www.wikihow.com\/Test-PC-RAM-with-MemTest86Test the hard drive with diagnostics: https:\/\/www.lifewire.com\/free-hard-drive-testin...Best is to use the manufacturer's own if there is one, otherwise use Seatools bootable long test:http:\/\/blog.nowherelan.com\/2013\/04\/04\/boot-seat... Follow this up with a full Disk Check: https:\/\/www.groovypost.com\/howto\/check-hard-dri... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer There are links to a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Change target program in Task Scheduler        It blows my mind to no end that MS has never made an easy to use task scheduler in Windows.I went through the convoluted steps in Task Scheduler to start a program (a sound) at a certain time daily.I would like (REALLY) to change that target program to start another program. I don't see an option to do that, or even to delete a task.Any way to do this?","solutions":["Hi 12Comp. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See here how to create, manage and delete tasks in the Task Scheduler: https:\/\/www.digitalcitizen.life\/how-create-task...https:\/\/www.digitalcitizen.life\/how-manage-exis...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Unable to switch out of S mode button greyed out        When I try to switch out of S mode, I follow all of the normal steps, and when I get to the Microsoft store \"Switch out of S mode\" page,  the normally blue button is grey and I can't press it.  I've tried updating the Microsoft store, but that doesn't help.What do I do?***Original title: Switching out of S mode***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query related to Switching out of S mode on your PC. For further clarity on the issue, please respond to the questions below. Is the PC connected to domain network?Have you signed in with administrator account to the PC? If you are connected to domain network then it could be possible that the IT administrator has restricted your access to switch out of S mode. In this case, you can get in touch with the IT department for further assistance. If you are using a local account that doesn’t have the administrator privileges then you may need to sign in as the administrator to switch out of S mode. Additional information on Windows 10 in S mode, Windows 10 in S mode FAQ and Switching out of S mode in Windows 10 Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Can not open ANY links from Mail App in Windows 10 (even the help link in settings)        Last week, all of a sudden, I could no longer open any embedded links in emails while using the app.  I even tried to go to the help feature in settings, and it will not open that link either.  Sometimes I just get the string (website address I am assuming) and other times I get \"unable to open the link\" with the stream of information).  I am using Version 16005.12228.20356.0What I have tried from my own research:Tested using Outlook.com and the email and links work fine from there.I reset the app from Windows 10 settings.I deleted and reinstalled the appI made sure my default web setting is Microsoft Edge.Nothing I have tried has worked. ","solutions":["Hey memine7, Evan here an independent adviser here to assist you. Quick question as I see you've already tried basic level troubleshooting...can you update Windows at this time? I would first suggest doing this before troubleshooting further...","I have had the same problem for the past week. I have checked for Windows updates and I am up to date."]},{"symptom":"New Laptop Setup Not able to Log In        I just received a new HP Elite Dragonfly Laptop.   I seem to have done something wrong when I was setting it up.  I thought that I followed the prompts properly but I did get distracted by a client call in the middle of the process.  It went to a log on screen for Windows and when I enter my email and password, it says that the logon or password is incorrect.  I have tried every possible option and still am unable to access the laptop.  At this point, I just want to scrap the set up and start over but my tech skills are apparently outdated as I cannot figure out how to make that happen.  Is there a way to hard reset a machine these days and just start over?  I don't have any data on this machine yet so there is nothing to lose.   Any help is appreciated. ","solutions":["Hi Keil, Did you try the solution provided by Microsoft?\"There are three options that allow you to reset your PC. If you’ve tried just about everything else and your PC still isn't running well, resetting it might fix the problem.Option 1: Select Start  > Settings  > Update & Security  > Recovery. Under Reset this PC, select Get started. Open Recovery settings.Option 2: Restart your PC to get to the sign-in screen, then press and hold down the Shift key while you select the Power  icon > Restart in the lower-right corner of the screen. After your computer restarts, select Troubleshoot > Reset this PC.Option 3: Select Start , then press and hold down the Shift key while you select the Power  icon > Restart to restart your computer into Recovery Mode. After your computer restarts, select Troubleshoot > Reset this PC.Any of these three options will get you started, but once you're in the process, follow the steps as they are presented to you. If none of the preceding three options work, you can use installation media to resinstall Windows 10. \"","Hi Keil. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.You'd normally be able to do a Reset by triggering the Repair Mode by one of these methods:https:\/\/www.tenforums.com\/tutorials\/2294-advanc...But those all require a password, so you'll need to create bootable media which does not.To create Windows 10 Installation Media on another PC install Media Creation Tool and follow the directions here to create a bootable 8gb+ flash stick or new DVD:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, on second screen choose Repair Your Computer, then Troubleshoot Options to choose Reset.If that fails choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, click Next to let it create needed partitions and start install - this makes it foolproof.Everything needed to get the best possible Clean Install is here: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... It is a better install than any amount of money can buy and a great learning experience that will make you the master of your PC because you will learn what works best and how to apply it with your own hands. If you have files that aren't backed up you can use the same bootable media to try to rescue your files using these methods:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"PC Admin password lost.  How to reset?        I cannot remember, or have had my PC Admin password changed by mistake in getting my Mucrosoft Account or Office license registered.  Can I reset my PC admin password through my MS Account?","solutions":["Hi Roni, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.All methods to reset password are here: https:\/\/www.tenforums.com\/tutorials\/14699-reset...Beyond that, we cannot help much as it is for your security and forum policy forbids us to do the same.Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads.","Hi,There is a simple way to reset the admin account and passwords.Go to your system disk --->Windows --->System32 -->Config, and then you delete the SAM file.Restart your computer and you will find the Administrator isn't set up with passwords.Alternatively, type in Comment Prompt on the Windows Search Bar. Right-click Comment Prompt and run it as administrator.Then enter the comment below:net user account_name new_passwordFor example, I want my new account: camile and my password is: ab12cdThe comment I should type is : net user camile ab12cdThen press Enter and restart your computer.Regards,"]},{"symptom":"Hand Computer Down to Wife - Transfer Windows 10 License?        At some point, I'll probably be handing my computer down to my wife.  I bought Windows 10 Pro from the Microsoft Store and activated it on this computer.  When I pass the computer on, I'd like to make sure the Windows 10 license passes on to my wife's Microsoft Account.  Do I just go to account.microsoft.com > Devices and remove the device from my account?  Then, I'll either do a clean install or a Fresh Start and set things up with my wife's account.  Will the Windows 10 license transfer over to her account properly?","solutions":["For Windows 10, activation is associated with a computer, not with a person.Windows 10 doesn't care who owns it. The only thing that Windows 10 cares about is that it's still activated on the same computer where it was activated originally. Or in other words: Just like you are married to your wife, Windows 10 is married to the computer.It doesn't matter who owns or operates the computer ... it could be you, your wife, her cousin, the guy down the street ... nothing changes.","Hi O. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.What is the Activation Status and Edition showing at the top of the page at Settings > Update & Security > Activation?If it's a Digital License then de-link it if present in your online MS account along with the PC, so when your wife signs in with her Microsoft Account it will soon thereafter link the Digital License to her account.If it's a retail key only and not a DL then it will not link activation although it will remain on the PC until the license is moved, but the PC should link to the new MS account.The best way to transfer a PC is to do a full deep-clean Reset as shown here: https:\/\/www.zdnet.com\/article\/windows-10-tip-re...If you want to preserve programs for her without having to reinstall them and merely swap accounts then you can change your MS Account to a Local Account in her name, then when ready she can convert the Local Account to her MS account. See how here:http:\/\/www.zdnet.com\/article\/windows-10-tip-swi...https:\/\/www.tenforums.com\/tutorials\/5375-switch...I hope having all options helps you decide. Let me know if you have any questions.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"DVD wont play        After updating to Windows 10 11\/19, my DVD player wont work.  I have an exercise video for seniors, and it will not play except in an app that wants me to pay for a player.  I don't do gaming, streaming movies, music or other entertainment.  How can I get my DVD player to work again?  Do I need to restore previous to the upgrade?  Thank you for any help.","solutions":["Hi Mary, sounds great - please do let us know and we'd be happy to help further.-Ashton"]},{"symptom":"Email not working        Can't receive EMAIL but I can see my mailbox in outlook .com, I think it's linked to another email but I'm not receiving email from there either.","solutions":["Hi BEboss. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Are you accessing your mail in a browser? Try another browser. I would have several browsers on your task bar so there's always one that's best for the task. I use Firefox, Edge and Chrome in that order of preference. It's easy to share bookmarks between all of them in their settings under Import Favorites from another Browser. Set the preferred one as Default in Settings > Apps > Default Apps.If that doesn't help then reset the browser: https:\/\/www.howtogeek.com\/171924\/how-to-reset-y...I would also try receiving your mail through Windows 10 Mail app which is an easier way to access your mail from all your various accounts in one huge inbox that lets you merge all of your Office and Web Mail account, with an even larger ad-free reading pane. See here how to get started: https:\/\/www.windowscentral.com\/how-get-started-... If none of these help or apply then please explain fully what the exact problem is, where it's occuring, and what you've done so far to try to fix it.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows 10        Have an HP laptop which had windows 10 already loaded and available on 2 devices.  Purchased a dell laptop and informed that I need to purchase windows 10.  How do I get my Windows 10 onto this second device without being charged?","solutions":["If Windows comes already installed, it is licensed for exactly that one PC."]},{"symptom":"Chrome problems        After windows forced me to update the system (updates KB4533002 and KB4530684) one or both of the updates is causing some issues while I'm using chrome as slow loading of pages and delay of selecting things before it's fully loaded.When I fist started chrome after the update some pictures and parts of text on the websites were missing or couldn't load.Is one of the updates known to do this? Or could it be something else.Also, is there a way how to stop updates for more than 35 days?Thanks for answers.","solutions":["Hi Martin. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Run this flash tool to make sure it's enabled and current: https:\/\/helpx.adobe.com\/flash-player.htmlIf that's not enough then reset Chrome following this guide: https:\/\/www.lifewire.com\/how-to-reset-google-ch...If that doesn't fix it then Reinstall Chrome: Right click empty area of Task bar to open Task manager​. If necessary show More Details Under \"Processes,\" look for \"Google Chrome\" or \"chrome.exe.\" Click it, then click End process. Next go into WIndows Settings > Apps > Apps & Features > Google Chrome > Uninstall. Restart PC.Then go into C:\\Program Files and C:\\Program Files (86) to find the Google folder and delete the Chrome Folder.You may need to Take Ownership first using this handy tool that will install to your right click mouse button:https:\/\/www.askvg.com\/add-take-ownership-option... On the View tab of File Explorer then tick Hidden Files, open C:\\Program Data to do the same.Restart PC to reinstall Chrome from fresh download here: https:\/\/www.google.com\/chrome\/ You can suspend updates indefinitely by setting a Metered Connection as shown here:https:\/\/www.howtogeek.com\/226722\/how-when-and-w.... I would periodically on your own schedule turn them back on to get important Security and Quality Updates. But there are even good reports from those who've had them shut off for awhile and only install the Version Upgrades twice a year from the Media Creation Tool which is the most stable method anyway, and includes all previous Updates rolled in.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Cannot login to user account on windows 10 after upgrading from build 1803 to 1903        Hi Everyone, After I upgraded from build 1803 of Windows 10 to build 1903 when I try to login into the user account that is connected to my Microsoft Account. It looks like it is logging in I will see the words \"preparing local session manager \" next to the spinning gears and then I will get a black screen and then I am right back at the login screen. I can log in to my Local account on that computer no problem. I have tried signing in using my pin and using my password and the same thing happens. I have tried running chkdsk from my local account and chkdsk did not find any problems. I ran DISM and it did not find any problems either. I ran sfc \/scannow which found some corrupt files and repaired them but it still not the main problem that I have been having. Using my local account I also installed some windows updates and that did not fix the problem. I also tried booting into safe mode and that did not work either. When I try to uninstall the feature update from Windows RE I get an error message like \"The feature could not be found\". I cannot roll back the update because it has been more than 10 days since I did the upgrade. I have an image of the SSD where windows was installed so I could restore from the backup and then try the upgrade again as a last resort. I rather not go through the trouble of doing that though. Thank you, hope you can help me. ","solutions":["Hi Jack. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Sounds like your User account has become corrupted beyond repair. If you can't roll back the Version Update in Recovery Settings or the Repair Mode here:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... then I would replace the User account which has not responded to all of the available repairs.If your Local Account is an Admin you can do this easily by copying your MS Account files over to it, then deleting it one of these ways:https:\/\/www.tenforums.com\/tutorials\/5464-delete...Restart PC, then go into Settings > Accounts > Your Info and choose Sign in with a MS Account Instead to convert the Local Account to your MS Account.If you don't want to use your Local Account to do this then create a new MS Account in Settings > Accounts > Family & Other People > Other User.If your Local account is not Admin, enable the hidden built-in Admin used only for emergencies following this method:https:\/\/www.isumsoft.com\/it\/enable-hidden-admin... and sign into it to create a new Local Account, give it Admin privileges:https:\/\/www.windowscentral.com\/how-change-user-..., sign into it, delete the old MS Account, restart PC and then convert it to the MS account.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Is it possible to move all my settings along with my files to the new user account that I create? ","You would not want to move your Settings because it's a corruption path into a fresh new account. There's a good chance it was these Settings that corrupted it in the first place.Your files can be copied over from the old account, no problem. Make sure it's an Admin Account, browse to the old User account, it will run a progress bar slowly across as it processes issuing permission to your new account o access all the files, then they will be available to copy over into the new User folders."]},{"symptom":"There is no video editor button or function on my \"photos\" program.  what can i do to get the video option?        Hi, I got an article where they show hot to edit videos on the \"photos\" on windows, however when I open the \"photos\" program there is no \"new video\" or edit video option.  I have a brand new surface pro.  What can i do?Thanks","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.It's not obvious how to find it! Have a look at the instructions here: https:\/\/www.howtogeek.com\/355524\/how-to-use-win... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Regards, David","Hello! Can you please share the version number for your Photos app (found under ... > Settings)? It will also be helpful to share your Windows version number (press Windows key, type \"winver\", press Enter). Thanks!","Hello! Can you please share the version number for your Photos app (found under ... > Settings)? It will also be helpful to share your Windows version number (press Windows key, type \"winver\", press Enter). Thanks!hi, I am sorry for not sharing before that i fixed the problem.  I went ahead and update on windows store the app ant the button appeared. Thanks for the help."]},{"symptom":"How to Restore Drive Tools Recording Speed?        This is a new installation of Windows 10 with the latest patches.  I inserted a new blank DVD+R 4.7GB disk into my CD\/DVD\/BlueRay drive and in File Explorer and copied data files to it and selected the Manage Drive Tools from the top menu.  I chose to burn as a mastered data disk.  The only available Recording speed was 16x which matched the specs on my DVD drive and the blank disk.The files were properly burned to disk; however, Drive Tools indicated that there was a problem with the disk.  I double checked the files and they were indeed burned as binary duplicates.  I can live with an error message; however, when I tried to burn another set of files to another new disk within a few minutes of verifying the first set of files the only available Recording speed was 2.4x.  I rebooted my computer thinking that perhaps File Explorer Manage Drive Tools feature had somehow become unstable due to it's stated error condition, but no effect...now the only Recording speed is 2.4x.  I've had this problem before and after a few stated successful burns by the Drive Tools the speed increases.  But, I have to suffer through very slow burning speeds for some of the burn activity.So, File Explorer Manage Drive Tools is storing some data somewhere that is being subsequently read by it and thus forcing the Recording speed to 2.4x regardless of the capability of the DVD burner and inserted media.  And storing what it perceives as successful burning and increases the speed. Where is that data and how do I restore the Recording speed to the original 16x speed?  How do I return the Drive Tools to using the speed obtained from the DVD drive capability and inserted media?","solutions":["Hi Steven, Thank you for writing to Microsoft Community Forums. Ideally, the write speed is automatically determined by the system based on the type of CD\/DVD that is used. However, please let us know: What is the make and model of your computer and DVD drive?Do you have any other CD\/DVD write applications installed on your computer?Are you using the same brand of DVDs that you used before?If you are using any alternate burn application, do you see the same speed limitation? However, if you are using the same brand of DVDs and trying to burn the same type of data and you are seeing variable write speed, you can try a few steps and check. We would suggest you to update the driver, refer this article: Update drivers in Windows 10Please refer the method 4, 5 and 6 from this article: Your CD or DVD drive is not recognized by Windows or other programs Regards, Aditya RoyMicrosoft Community – Moderator","My computer has an Intel DX58SO motherboard with 6GB of RAM and a 2TB hard drive with 1.54TB of free space.  the CPU is an intel i7 980 Extreme running at 3.33Ghz.  The DVD drive is a Pioneer BDR-206 connected to the motherboard via ATA cable.I do not have any other CD\/DVD write applications or DVD drives or burn applications.  I am using the exact same brand and type of disks (I bought a pack of 100 so they are all exactly the same).  My drivers are provided by Microsoft Windows and updated with Windows Update which I have scheduled to run every week.The burning operation works fine...I have had no problems with corrupted data...the only issue is that Windows occasionally reduces the speed sometimes without any indication of a problem."]},{"symptom":"When will the windows update incompetence stop?    \"Feature Update to Windows 10 1903 failed to install on 12\/4\/2019 0x8007001f        Seriously, why don't updates from Microsoft actually work?There's something seriously wrong with the updates, and with Microsoft development and testing.    I've spent so much time this year dealing with this nonsense.It's tried to update about 100 times.  Around try 96 it caused my machine to go into an infinite loop of booting and undoing, until I had to have a new version of Windows installed.  Now I have more failed updates....again.I have 3 occurrences of 0x8007001f, preceded by one occurrence of 0x80070643.      Don't tell me it's the antivirus software.....when you upgrade, you have total permissions to do whatever you need, so that's a terrible excuse, Microsoft.I heard from a MS guy that the error codes overlap between professional and home....this is professional (supposedly).Is Microsoft actually doing anything to resolve these issues?  Clearly not.I guess since updates for my version will no longer come, then I'll just keep running the version Microsoft is incapable of updating.","solutions":["Use the Media Creation Tool and update to the latest which is version 1909 not 1903.Read the instructions.Media Creation Tool;https:\/\/www.microsoft.com\/en-us\/software-download\/windows10","Hi,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Let us check the Installation log to find why the update failed. Please share the logs as mentioned in this article. You should use a File sharing service like Onedrive or Media Fire to upload files and share the link in the next reply.https:\/\/answers.microsoft.com\/en-us\/windows\/for...The Panther logs. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\PantherThe Rollback logs: These usually are created if Windows Update rolls back. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\Rollback[Only if the error code is 0xC1900101-0x30018] The Device Install Log from C:\/$Windows.~bt\\Sources\\Rollback\\setupapi\\setupapi.dev.logAs the log size might be large consider zipping before uploading.","I did that earlier, after try 50 or so.","There are multiple setupact.log files under my Windows directory.   Frankly, this whole thing is stupid.   I'm not going to run around into the OS logs hopelessly hunting for random data to gather for Microsoft.     Why can't the failed update just ask to send stuff to Microsoft?    I would say \"yes\" and wait for an update that fixes it.If there is a \"fixit\" to download from the MS Site that will report stuff, great, then I'll run it.It's your mess....fix it!Here's a choice of \"panther\" logs, pick one....but I have no idea where to upload it.  I'm not going to generically post it to the internet for all....microsoft should (but apparently doesn't) have a way to gather these files.I want to be clear on this....I don't want individual help.  I want microsoft to provide updates that work.  I want microsoft to have a way to see what failed in an update, so that the next update actually works.That isn't too much to ask.--------------------------------------------C:\\windows>dir \/S setupact.log Volume in drive C is SYS Volume Serial Number is 68F2-2B3F Directory of C:\\windows12\/07\/2019  05:11 PM             6,507 setupact.log               1 File(s)          6,507 bytes Directory of C:\\windows\\Logs\\DPX12\/08\/2019  11:02 PM           499,383 setupact.log               1 File(s)        499,383 bytes Directory of C:\\windows\\Panther05\/05\/2019  01:23 AM         4,625,387 setupact.log               1 File(s)      4,625,387 bytes Directory of C:\\windows\\Panther\\NewOs\\Panther12\/07\/2019  05:48 PM       178,401,180 setupact.log               1 File(s)    178,401,180 bytes Directory of C:\\windows\\Panther\\NewOs\\Panther\\UnattendGC12\/07\/2019  05:48 PM             4,276 setupact.log               1 File(s)          4,276 bytes Directory of C:\\windows\\Panther\\NewOs\\Rollback12\/07\/2019  05:50 PM         3,021,911 setupact.log               1 File(s)      3,021,911 bytes Directory of C:\\windows\\Panther\\UnattendGC12\/07\/2019  06:00 PM           273,062 setupact.log               1 File(s)        273,062 bytes","As Sumit pointed out, the one you want is in the C:\\$Windows.~BT\\Sources\\Panther folder.  It is created during an upgrade attempt.We have found reasons for upgrade failures as simple as a corrupted file.  Other situations, can be harder to solve.  I imagine you are frustrated, but we will need you to be ready to help find the problem.ERROR_GEN_FAILURE31 (0x1F)A device attached to the system is not functioning.ERROR_INSTALL_FAILURE1603 (0x643)Fatal error during installation.","I appreciate the attempt to help.  The problem needs to be fixed generically from MIcrosoft.Regarding your advice, There is no \"sources\" directory.C:\\windows>cd sourcesThe system cannot find the path specified.Nor is there anything with BTC:\\>dir \/S Sources Volume in drive C is SYS Volume Serial Number is 68F2-2B3F Directory of C:\\Documents and Settings\\w30400\\Documents\\Windows09\/12\/2019  12:32 PM    <DIR>          sources               0 File(s)              0 bytes Directory of C:\\Documents and Settings\\Xw30400\\AppData\\Local\\lxss\\rootfs\\usr\\lib\\python3\\dist-packages\\cloudinit07\/26\/2019  03:04 PM    <DIR>          sources               0 File(s)              0 bytes Directory of C:\\SYSTEM.SAV\\Logs\\BPDRIVE05\/05\/2019  02:18 AM    <DIR>          sources               0 File(s)              0 bytes     Total Files Listed:               0 File(s)              0 bytes               3 Dir(s)  167,909,163,008 bytes freeMaybe this is useful, I could try to delete this dir.....(sigh....why can't microsoft update do this....):C:\\windows\\Panther\\NewOs\\Rollback>type setuperr.log2019-12-07 17:49:54, Error                 SP     CSetupPlatformOSSwitchCheckpoint::Rollback: Deleting of \"C:\\Windows.old\" directory failed.[gle=0x00000091]And, here's a boatload of internal microsoft errors...C:\\windows\\Panther\\NewOs\\Panther>type setuperr.log∩╗┐2019-12-04 08:42:20, Error                 CONX   Windows::Compat::Appraiser::AppraiserSettings::GetSettingsInternal (294):   Failed to retrieve DeviceTicket: [0x80041f0d][gle=0x80041f0d]2019-12-04 08:42:50, Error                 CONX   Windows::Compat::Appraiser::AppraiserSettings::GetSettingsInternal (294):   Failed to retrieve DeviceTicket: [0x80041f0d][gle=0x80041f0d]2019-12-04 09:38:47, Error                 CONX   Windows::Compat::Appraiser::AppraiserSettings::GetSettingsInternal (294):   Failed to retrieve DeviceTicket: [0x80041f0d][gle=0x80041f0d]2019-12-04 09:39:47, Error                 DU     DU::CDUSession::Search: Failed to set WU internal configuration property for targeted scans. hr = 0x800700572019-12-04 09:41:20, Error                 SP     CDownloadDUUpdates::DoExecuteInternal: Failed to download updates. hr = 0x800040052019-12-04 09:41:20, Error                 SP     CSetupPlatform::DownloadDynamicUpdates: Failed to download updates. Error: 0x800040052019-12-04 09:41:20, Error                 MOUPG  DUImage: Failed to execute driver search and download [0x80004005]2019-12-04 09:41:29, Error                 CONX   Windows::Compat::Appraiser::AppraiserSettings::GetSettingsInternal (294):   Failed to retrieve DeviceTicket: [0x80041f0d][gle=0x80041f0d]2019-12-04 09:42:24, Error                 CONX   0xd0000034 Failed to add user mode driver [%SystemRoot%\\system32\\DRIVERS\\UMDF\\uicciso.dll]2019-12-04 09:48:45, Error                 SP     pSPRemoveUpgradeRegTree: failed to delete reg tree HKLM\\SYSTEM\\Setup\\Upgrade[gle=0x00000005]2019-12-04 09:50:17, Error                 CSI    00000001 (F) 80220008 [Error,Facility=FACILITY_STATE_MANAGEMENT,Code=8] #33704# from CWcmScalarInstanceCore::GetCurrentValue(options = 393216, status = '(null)', value = { type: 40972, bytes ( 32 ): 3f003a005c007000610067006500660069006c0065002e007300790073000000 })[gle=0x80004005]2019-12-04 09:50:28, Error                 CSI    00000002 (F) 80220008 [Error,Facility=FACILITY_STATE_MANAGEMENT,Code=8] #93585# from CWcmScalarInstanceCore::GetCurrentValue(options = 393216, status = '(null)', value = { type: 40972, bytes ( 32 ): 3f003a005c007000610067006500660069006c0065002e007300790073000000 })[gle=0x80004005]2019-12-04 09:50:39, Error                 CSI    00000003 (F) 80220008 [Error,Facility=FACILITY_STATE_MANAGEMENT,Code=8] #153243# from CWcmScalarInstanceCore::GetCurrentValue(options = 393216, status = '(null)', value = { type: 40972, bytes ( 32 ): 3f003a005c007000610067006500660069006c0065002e007300790073000000 })[gle=0x80004005]2019-12-04 09:51:32, Error                 CSI    00000004 (F) 80220008 [Error,Facility=FACILITY_STATE_MANAGEMENT,Code=8] #229025# from CWcmScalarInstanceCore::GetCurrentValue(options = 393216, status = '(null)', value = { type: 40972, bytes ( 32 ): 3f003a005c007000610067006500660069006c0065002e007300790073000000 })[gle=0x80004005]2019-12-04 09:52:00, Error      [0x080831] MIG    CSIAgent: Invalid xml format: FormatException: Component with display name: Plugin\/{C939EC0F-2F56-4CE8-AF56-2336596A5FA7} already loaded __cdecl Mig::CMXEMigrationXml::CMXEMigrationXml(class Mig::CPlatform *,class UnBCL::String *,class UnBCL::XmlDocument *,class UnBCL::String *,class UnBCL::String *)2019-12-04 09:59:59, Error                        CSetupAutomation::Resurrect: File not found: C:\\$WINDOWS.~BT\\Sources\\Panther\\automation.dat[gle=0x00000002]2019-12-04 09:59:59, Error                 SP     CSetupPlatform::ResurrectAutomation: Failed to resurrect automation: 0x80070002[gle=0x00000002]2019-12-05 09:37:47, Error                 SP     COperationQueue::Sort: Could not find an execution phase for 83[gle=0x000000cb]2019-12-05 09:37:47, Error                 SP     ExecuteOperations: Operations cannot be sorted. This is a fatal failure.[gle=0x000000cb]2019-12-05 09:37:47, Error                 SP     CSetupPlatformPrivate::Execute: Execution of operations queue failed, abandoning. Error: 0x8007000D[gle=0x000000cb]2019-12-07 17:11:43, Error                 MOUPG  Finalize: Error obtaining Update and Shutdown Key: [0x80070002][gle=0x000000b7]2019-12-07 17:12:05, Error                 SP     pSPRemoveUpgradeRegTree: failed to delete reg tree HKLM\\SYSTEM\\Setup\\Upgrade[gle=0x00000005]2019-12-07 17:12:49, Error                 CSI    00000001 (F) 80220008 [Error,Facility=FACILITY_STATE_MANAGEMENT,Code=8] #33704# from CWcmScalarInstanceCore::GetCurrentValue(options = 393216, status = '(null)', value = { type: 40972, bytes ( 32 ): 3f003a005c007000610067006500660069006c0065002e007300790073000000 })[gle=0x80004005]2019-12-07 17:12:55, Error                 CSI    00000002 (F) 80220008 [Error,Facility=FACILITY_STATE_MANAGEMENT,Code=8] #93585# from CWcmScalarInstanceCore::GetCurrentValue(options = 393216, status = '(null)', value = { type: 40972, bytes ( 32 ): 3f003a005c007000610067006500660069006c0065002e007300790073000000 })[gle=0x80004005]2019-12-07 17:13:00, Error                 CSI    00000003 (F) 80220008 [Error,Facility=FACILITY_STATE_MANAGEMENT,Code=8] #153243# from CWcmScalarInstanceCore::GetCurrentValue(options = 393216, status = '(null)', value = { type: 40972, bytes ( 32 ): 3f003a005c007000610067006500660069006c0065002e007300790073000000 })[gle=0x80004005]2019-12-07 17:13:24, Error                 CSI    00000004 (F) 80220008 [Error,Facility=FACILITY_STATE_MANAGEMENT,Code=8] #229025# from CWcmScalarInstanceCore::GetCurrentValue(options = 393216, status = '(null)', value = { type: 40972, bytes ( 32 ): 3f003a005c007000610067006500660069006c0065002e007300790073000000 })[gle=0x80004005]2019-12-07 17:13:42, Error      [0x080831] MIG    CSIAgent: Invalid xml format: FormatException: Component with display name: Plugin\/{C939EC0F-2F56-4CE8-AF56-2336596A5FA7} already loaded __cdecl Mig::CMXEMigrationXml::CMXEMigrationXml(class Mig::CPlatform *,class UnBCL::String *,class UnBCL::XmlDocument *,class UnBCL::String *,class UnBCL::String *)2019-12-07 17:17:37, Error                 SP     BFSVC: Error copying boot debugging files from C:\\$WINDOWS.~BT\\Sources\\system32 to \\\\?\\GLOBALROOT\\Device\\HarddiskVolume2\\EFI\\Microsoft\\Boot (kd_*_*.dll). Last Error = 0x6[gle=0x00000006]2019-12-07 17:17:37, Error                 SP     BFSVC: Error copying boot debugging files from C:\\$WINDOWS.~BT\\Sources\\system32 to \\\\?\\GLOBALROOT\\Device\\HarddiskVolume2\\EFI\\Microsoft\\Boot (kdstub.dll). Last Error = 0x6[gle=0x00000006]2019-12-07 17:18:35, Error                 SP     pGetExistingPageFiles: Failed to get PagingFiles value from ControlSet001\\Control\\Session Manager\\Memory Management: 0x8007000d[gle=0x0000000d]2019-12-07 17:31:04, Error      [0x080831] MIG    CSIAgent: Invalid xml format: FormatException: Component with display name: Plugin\/{C939EC0F-2F56-4CE8-AF56-2336596A5FA7} already loaded __cdecl Mig::CMXEMigrationXml::CMXEMigrationXml(class Mig::CPlatform *,class UnBCL::String *,class UnBCL::XmlDocument *,class UnBCL::String *,class UnBCL::String *)2019-12-07 17:32:52, Error      [0x0808fe] MIG    Plugin {0b23c863-4410-4153-8733-a60c9b1990fb}: TableTextServiceMig!RemoveObsoleteCHSHKLMRegkey - fail to open regkey (software\\Microsoft\\CTF\\TIP\\{E429B25A-E5D3-4D1F-9BE3-0C608477E3A1}\\LanguageProfile\\0x00000804) = 22019-12-07 17:32:52, Error      [0x0808fe] MIG    Plugin {0b23c863-4410-4153-8733-a60c9b1990fb}: TableTextServiceMig!ApplySuccess() remove HKLM Registries error2019-12-07 17:32:53, Error      [0x0808fe] MIG    Plugin {ee036dc0-f9b7-4d2d-bb94-3dd3102c5804}: BRIDGEMIG: ParseRegistryIfBridgeExists: offline key (new) = '$OFFLINE_RW_BCE441CA$SYSTEM\\Setup\\Upgrade\\Bridge'2019-12-07 17:32:53, Error      [0x0808fe] MIG    Plugin {ee036dc0-f9b7-4d2d-bb94-3dd3102c5804}: BRIDGEMIG: ParseRegistryIfBridgeExists: query bridge presence key failed 0x139f, bridge present = 02019-12-07 17:32:53, Error      [0x0808fe] MIG    Plugin {526D451C-721A-4b97-AD34-DCE5D8CD22C5}: [shmig] internal\\onecoreuapshell\\private\\inc\\schemacachehelpers.cpp(607)\\shmig.dll!00007FFA07F971BA: (caller: 00007FFA07F95115) ReturnHr(1) tid(5bc) 80070002 The system cannot find the file specified.    Msg:[Migrated key for Path $OFFLINE_RW_BCE441CA$SOFTWARE\\Wow6432Node\\Microsoft\\Windows\\CurrentVersion\\PropertySystem\\PropertySchema.Migrated for 32-bit hive not found ]2019-12-07 17:32:53, Error      [0x0808fe] MIG    Plugin {526D451C-721A-4b97-AD34-DCE5D8CD22C5}: [shmig] internal\\onecoreuapshell\\private\\inc\\schemacachehelpers.cpp(607)\\shmig.dll!00007FFA07F971BA: (caller: 00007FFA07F95148) ReturnHr(2) tid(5bc) 80070002 The system cannot find the file specified.    Msg:[Migrated key for Path $OFFLINE_RW_BCE441CA$SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\PropertySystem\\PropertySchema.Migrated for 64-bit hive not found ]2019-12-07 17:32:53, Error      [0x08038d] MIG    Failure while calling IPostApply->ApplySuccess for Plugin={ServerPath=\"Microsoft-Windows-DirectoryServices-ADAM-Client\\adammigrate.dll\", CLSID={43CCF250-2A74-48c6-9620-FC312EC475D6}, ThreadingModel=Apartment}. Error: 0x800700022019-12-07 17:32:53, Error                 SP     Error READ, 0x00000002 while gathering\/applying object: apply-success, Action,CMXEPlugin,C:\\$WINDOWS.~BT\\Sources\\ReplacementManifests,Microsoft-Windows-DirectoryServices-ADAM-Client\\adammigrate.dll,{43CCF250-2A74-48c6-9620-FC312EC475D6},Apartment. Will return 2[gle=0x000000cb]2019-12-07 17:43:23, Error                 SP     Error WRITE, 0x0000065E while gathering\/applying object: State, Microsoft-Windows-Dot3svc[@version=\"10.0.17134.1\" and @arch=\"amd64\" and @culture=\"neutral\" and @context=\"allUsers\"]\/settings. Will return 22019-12-07 17:43:23, Error                 SP     Error WRITE, 0x0000065E while gathering\/applying object: State, Microsoft-Windows-feclient[@version=\"10.0.17134.1\" and @arch=\"amd64\" and @culture=\"neutral\" and @context=\"allUsers\"]\/settings. Will return 22019-12-07 17:43:23, Error                 SP     Error WRITE, 0x0000065E while gathering\/applying object: State, Microsoft-Windows-feclient[@version=\"10.0.17134.1\" and @arch=\"amd64\" and @culture=\"neutral\" and @context=\"allUsers\"]\/settings [EfsLocalConfig]. Will return 22019-12-07 17:43:23, Error                 SP     Error WRITE, 0x0000065E while gathering\/applying object: State, Microsoft-Windows-WwanSvc-ServerCfg[@version=\"10.0.17134.1\" and @arch=\"amd64\" and @culture=\"neutral\" and @context=\"allUsers\"]\/settings. Will return 22019-12-07 17:43:23, Error                 SP     Error WRITE, 0x0000065E while gathering\/applying object: State, Microsoft.Windows.WinHTTP[@version=\"5.1.17134.590\" and @arch=\"amd64\" and @culture=\"neutral\" and @context=\"allUsers\"]\/settings. Will return 22019-12-07 17:43:23, Error                 SP     Error WRITE, 0x0000065E while gathering\/applying object: State, Microsoft.Windows.WinHTTP[@version=\"5.1.17134.590\" and @arch=\"amd64\" and @culture=\"neutral\" and @context=\"allUsers\"]\/settings [ConfigVersion]. Will return 22019-12-07 17:43:23, Error                 SP     Error WRITE, 0x0000065E while gathering\/applying object: State, Microsoft.Windows.WinHTTP[@version=\"5.1.17134.590\" and @arch=\"amd64\" and @culture=\"neutral\" and @context=\"allUsers\"]\/settings [EventMessageFile]. Will return 22019-12-07 17:43:23, Error                 SP     Error WRITE, 0x0000065E while gathering\/applying object: State, Microsoft.Windows.WinHTTP[@version=\"5.1.17134.590\" and @arch=\"amd64\" and @culture=\"neutral\" and @context=\"allUsers\"]\/settings [ProviderGuid]. Will return 22019-12-07 17:43:23, Error                 SP     Error WRITE, 0x0000065E while gathering\/applying object: State, Microsoft.Windows.WinHTTP[@version=\"5.1.17134.590\" and @arch=\"amd64\" and @culture=\"neutral\" and @context=\"allUsers\"]\/settings [TypesSupported]. Will return 22019-12-07 17:43:23, Error                 SP     Error WRITE, 0x0000065E while gathering\/applying object: State, Microsoft.Windows.WinHTTP[@version=\"5.1.17134.590\" and @arch=\"amd64\" and @culture=\"neutral\" and @context=\"allUsers\"]\/settings [WinHttpSettings]. Will return 22019-12-07 17:43:25, Error                 SP     Error WRITE, 0x0000065E while gathering\/applying object: State, Microsoft-Windows-OfflineFiles-Core[@version=\"10.0.17134.1098\" and @arch=\"amd64\" and @culture=\"neutral\" and @context=\"allUsers\"]\/settings. Will return 22019-12-07 17:43:28, Error      [0x0808fe] MIG    Plugin {0b23c863-4410-4153-8733-a60c9b1990fb}: TableTextServiceMig!RemoveObsoleteCHSHKLMRegkey - fail to open regkey (software\\Microsoft\\CTF\\TIP\\{E429B25A-E5D3-4D1F-9BE3-0C608477E3A1}\\LanguageProfile\\0x00000804) = 22019-12-07 17:43:28, Error      [0x0808fe] MIG    Plugin {0b23c863-4410-4153-8733-a60c9b1990fb}: TableTextServiceMig!ApplySuccess() remove HKLM Registries error2019-12-07 17:43:37, Error                 MIG    CoCreateInstance(CoClassIdentityStore) failed. hr = 0x800401F0[gle=0x00000534]2019-12-07 17:43:37, Error      [0x080a7b] MIG    Failed to build the connected providers mappings[gle=0x00000534]2019-12-07 17:43:39, Error                 MIG    CoCreateInstance(CoClassIdentityStore) failed. hr = 0x800401F0[gle=0x00000534]2019-12-07 17:43:39, Error      [0x080a7b] MIG    Failed to build the connected providers mappings[gle=0x00000534]2019-12-07 17:44:03, Error                        [SetupPlatform.exe] winreHashWimFile: Failed to hash [C:\\WINDOWS\\System32\\Recovery]: 0x52019-12-07 17:47:35, Error      [0x080831] MIG    CSIAgent: Invalid xml format: FormatException: Component with display name: Plugin\/{C939EC0F-2F56-4CE8-AF56-2336596A5FA7} already loaded __cdecl Mig::CMXEMigrationXml::CMXEMigrationXml(class Mig::CPlatform *,class UnBCL::String *,class UnBCL::XmlDocument *,class UnBCL::String *,class UnBCL::String *)2019-12-07 17:48:24, Error                        Mig::CUpgradeTransportPlatform::SetUserContext: Store platform failed to find the user with ID: USER00000002, SID: S-1-0-02019-12-07 17:48:24, Error                 MIG    Mig::CKnowledgeManager::BeginProcessingContext: Source platform failed to set the user context USER000000022019-12-07 17:48:24, Error                        MigApply caught exception: Win32Exception: Can't switch to requested user context: USER00000002.: A device attached to the system is not functioning. [0x0000001F] int __cdecl Mig::CKnowledgeManager::Apply(class Mig::CPlatform *,class Mig::CPlatform *,class Mig::CPlatform *,class Mig::CUserMappingList *,class UnBCL::Hashtable<class UnBCL::String *,class UnBCL::String *> *,class Mig::CAgentManager *,class Mig::CMigrationLogger *,int *,struct IMigExecuteProgress *)2019-12-07 17:48:24, Error                 SP     pSPExecuteApply: Apply operation failed. Error: 0x000000042019-12-07 17:48:24, Error                 SP     Apply: Migration phase failed. Result: 4[gle=0x00000002]2019-12-07 17:48:24, Error                 SP     Operation failed: First boot apply. Error: 0x8007001F[gle=0x000000b7]2019-12-07 17:48:24, Error                 SP     Operation execution failed: 13. hr = 0x8007001F2019-12-07 17:48:24, Error                 SP     ExecuteOperations: Failed execution phase Post First Boot. Error: 0x8007001F2019-12-07 17:48:24, Error                 SP     Operation execution failed.2019-12-07 17:48:24, Error                 SP     CSetupPlatformPrivate::Execute: Failed to deserialize\/execute post-FirstBoot operations. Error: 0x8007001FC:\\windows\\Panther\\NewOs\\Panther>","You've lost your C:\\$Windows.~BT\\Sources\\Pantherfolder that holds the log files we need to see.(1) Run the upgrade (for the 101st time) while doing Quick Fix #1...https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/quick-fixes#remove-external-hardwareRemove External Hardware(2) In addition to the logs already requested, post the full contents ofSetupDiagResults.log...https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/setupdiagSetupDiagEdit: Maybe first ask Search for \"Clean\" to openDisk Cleanup. Then click the \"Clean up system files\" button at bottom. Use it to delete your current log files which might make the new logs easier to look at. Delete the logs & an item called \"Previous Windows installations\" which should remove Windows.old. Then try the upgrade again & post the new logs.But careful not to delete your Downloads folder. That's a permanent delete.","Hi, The other community members have posted good advice. The following step indicates a problem: 2019-12-07 17:48:24, Error                        MigApply caught exception: Win32Exception: Can't switch to requested user context: USER00000002.: A device attached to the system is not functioning. [0x0000001F] int __cdecl Mig::CKnowledgeManager::Apply(class Mig::CPlatform *,class Mig::CPlatform *,class Mig::CPlatform *,class Mig::CUserMappingList *,class UnBCL::Hashtable<class UnBCL::String *,class UnBCL::String *> *,class Mig::CAgentManager *,class Mig::CMigrationLogger *,int *,struct IMigExecuteProgress *)Looking forward to the reply.","What exactly is expected here?  I'm upgrading a laptop with a mouse.  It has two internal drives, one SSD and one non. In case this isn't obvious:  I won't be removing internal drives to update my laptop.Do you want me to remove my mouse to try this upgrade again?Remove external hardware If the computer is portable and it is currently in a docking station,undock the computer.Unplug nonessential external hardware devices from the computer, such as:HeadphonesJoysticksPrintersPlottersProjectorsScannersSpeakersUSB flash drivesPortable hard drivesPortable CD\/DVD\/Blu-ray drivesMicrophonesMedia card readersCameras\/WebcamsSmart phonesSecondary monitors, keyboards, mice    <====== I HAVE ONLY A MOUSE ATTACHEDFor more information about disconnecting external devices, seeSafely remove hardware in Windows 10","I notice this also but it is hard to pick something out when it is taken out of context..like from a setuperr.log.  But you do have the time code if you wanted to check your setupact.log..2019-12-04 09:59:59, Error                 SP     CSetupPlatform::ResurrectAutomation: Failed to resurrect automation: 0x80070002[gle=0x00000002]2019-12-05 09:37:47, Error                 SP     COperationQueue::Sort: Could not find an execution phase for 83[gle=0x000000cb]2019-12-05 09:37:47, Error                 SP     ExecuteOperations: Operations cannot be sorted.This is a fatal failure.[gle=0x000000cb]It is normal that a \"Failed to resurrect automation\" error is included but the long delay might indicate it needs the platform to continue..  Of course, even this wasn't the original cause of the problem.."]},{"symptom":"Activation error 0XC004F050        I have upgraded from Windows 8, since last week its been flashing get your license activated error and that license is about to expire. i have tried disabling via command prompt but it comes back after restarting, I'm at my wits end. Please help","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,For us to properly provide the best answer in regards to your license, we would first need to identify what type of license you have.Open command prompt with admin permission and execute this command slmgr \/dlv, capture a screenshot of it and attach it on your next reply."]},{"symptom":"lost Word document after updating in Windows 10!        Help!  So we did the latest Windows update in Windows 10, and a super-important Word document somehow disappeared, it seems...We searched for the file (of course) in all of C:, and it shows up in \"Recent\" and \"Recent Items,\" but attempting to open it gets the \"shortcut can't be found\" message.\"Also went through Word history.  It's listed there, but when we click on the link in history, it gives the \"couldn't find the file\" message...Help!!","solutions":["Hello alexsol5, I'm Didi, an independent advisor. Check Vijay_Verma on this thread to recover your lost Word file : https:\/\/answers.microsoft.com\/en-us\/windows\/for... Please note that as a last resort solution instead of using Recuva as advised by Vijay use EaseUS Data Recovery tool available here :http:\/\/down.easeus.com\/product\/drw_free_setupRegards, Didi Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi Didi!Thanks for replying!  None of those worked...   There wasn't any other matching user name, and also no WIndows.old folder (this wasn't an upgrade *to Windows 10, it was a normal Windows 10 update).Should we use Recuva even if we didn't delete the file...?  It literally was there before the update, and gone after the update...","Hi alexsol5, instead of using Recuva use EaseUS Data Recovery tool : http:\/\/down.easeus.com\/product\/drw_free_setup Regards, Didi","Hi Didi!Does that work if we ourselves did not physically delete the file?  (or is that just if we did delete it?)Thanks!","Hi alexsol5, Yes, in both cases it might work however the result can't be 100% sure. Regards, Didi","Didn't locate it... (again, we didn't delete it, it just disappeared after the update).Any other options?I must have been a mandatory update, because we can't revert to the last version..."]}]}