{"windows":[{"symptom":"Updated to 1909 on the Windows 10 on my laptop, after the restart I lost everything.        I am back in the stone ages. I went to update my Windows 10 from1903 to the 1909 on my laptop and after the resart all my files, and apps are nowhere. and for some reason my file history was off so there is no restore point apparently. everything is just gone!!! any suggestions as to how and get it back would be great.","solutions":["Hi Robyn. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.First check at C:\\Users that you are not in a temporary account and your files are in your old account.Next check for a C:\\windows.old folder where your old install may be archived if it couldn't be preserved.Check the Recycle Bin on desktop. Check also at onedrive.com that your files are not in your Microsoft Account Onedrive.Do key word searches for your files to see if they were relocated. Search tips: https:\/\/helpdeskgeek.com\/windows-10\/find-specif...BTW there are no System Restore points after a Version Upgrade. Make sure System Restore is turned on C drive with plenty of disk space (5-15%) configured:http:\/\/www.thewindowsclub.com\/system-restore-di... Let me know what you find. I'll be here to help until it's resolved. ______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"How do I switch Users?        How do I switch users?","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Click START - on the left-hand side directly above the START button you'll see some small icons... the first one is a power symbol, if you go 4 up from that and click the top one in that list you should see the various user account options including \"Switch users\". I've circled it in red here. Regards, David","Hello Frank, The tutorial below can help show you different ways to switch user in Windows 10.https:\/\/www.tenforums.com\/tutorials\/7394-switch-user-windows-10-a.html"]},{"symptom":"Clean install win 10 on win 7 running PC        I have intel i5  6th generation PC that has Windows 7 Professional 32bit. If I do windows 10 clean install Can I get windows 10 for free? ","solutions":["Hello SNSuganthan! My name is Marco, I am an Independent Advisor. I will do my best to help you.If you have a legal version of windows 7 you are better to update to windows 10 by following the steps on this page below :-)https:\/\/www.microsoft.com\/en-us\/software-downlo...Marco"]},{"symptom":"Unable to sign in to Microsoft Store        Right now when trying to sign in to the Microsoft Store all I get is this screen that says this then when I click continue it shows my cursor on an hour glass and when I move the mouse it goes away and it never loads anything but when I try to login with a school or business account it works perfectly fine but I can't login that way with a personal account.","solutions":["Hi Seahog. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything possible to repair the store. Even if you've tried a step please do it over in this sequence. If any steps cannot be performed then report it and move on to the next:1) Try updating Store apps: https:\/\/support.microsoft.com\/en-us\/help\/402625... 2) Make sure you have the latest Windows 10 version 1909 in Settings > System > About and if not skip to Step 10 to install it by the most stable method.3) See if the fixes here help: https:\/\/www.pcworld.com\/article\/3053099\/windows... 4) Try running the Windows Store apps Troubleshooter at Settings > Update & Security > Troubleshoot.5) Try resetting the Store cache: http:\/\/www.thewindowsclub.com\/reset-windows-sto... 6) If that fails go to Settings>Apps and highlight Microsoft Store, choose Advanced Settings, then Reset. After it resets, restart PC.7) If that fails then reinstall Store. Type CMD in Start Search, right click Command Prompt result to Run as Administrator, copy the following code and paste it into the box using the Edit tools from Box's top left dropdown menu, press Enter:PowerShell -ExecutionPolicy Unrestricted -Command \"& {$manifest = (Get-AppxPackage *WindowsStore*).InstallLocation + '\\AppxManifest.xml' ; Add-AppxPackage -DisableDevelopmentMode -Register $manifest}\"8) Clear the LocalCache Folder: Open Run by pressing the Windows key + R hotkey. Copy and paste %localappdata% in Run and click OK. Open Packages> Microsoft.WindowsStore_8wekyb3d8bbwe > LocalCache folder. Press the Ctrl + A hotkey to select all content within the LocalCache folder. Press the Delete button. 9) If these all fail then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account because of the serious and persistent problem with corrupted accounts. Then continue with the other steps to go over your install most thoroughly.10) If nothing else works then do a Repair Install, by installing Media Creation Tool and then choosing to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Purchasing Minecraft from the Microsoft Store        Hi Guys, Im normally a Mac user so im in unknown territory at the moment and need some help! I paid and downloaded Minecraft for my son on his new PC this morning and it just wont install! Every time I click install on the app in my purchased tab, the tab with INSTALL on it disappears but nothing starts downloading?? Im so frustrated and don't know how to get it to work....Can someone please advise what I need to do or am I doing something wrong??Thanks!Jacksons Mum","solutions":["Hi Jackson's Mum. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything possible to repair the store. Even if you've tried a step please do it over in this sequence. If any steps cannot be performed then report it and move on to the next:1) Try updating Store apps: https:\/\/support.microsoft.com\/en-us\/help\/402625... 2) Make sure you have the latest Windows 10 version 1909 in Settings > System > About and if not skip to Step 10 to install it by the most stable method.3) See if the fixes here help: https:\/\/www.pcworld.com\/article\/3053099\/windows... 4) Try running the Windows Store apps Troubleshooter at Settings > Update & Security > Troubleshoot.5) Try resetting the Store cache: http:\/\/www.thewindowsclub.com\/reset-windows-sto... 6) If that fails go to Settings>Apps and highlight Microsoft Store, choose Advanced Settings, then Reset. After it resets, restart PC.7) If that fails then reinstall Store. Type CMD in Start Search, right click Command Prompt result to Run as Administrator, copy the following code and paste it into the box using the Edit tools from Box's top left dropdown menu, press Enter:PowerShell -ExecutionPolicy Unrestricted -Command \"& {$manifest = (Get-AppxPackage *WindowsStore*).InstallLocation + '\\AppxManifest.xml' ; Add-AppxPackage -DisableDevelopmentMode -Register $manifest}\"8) Clear the LocalCache Folder: Open Run by pressing the Windows key + R hotkey. Copy and paste %localappdata% in Run and click OK. Open Packages> Microsoft.WindowsStore_8wekyb3d8bbwe > LocalCache folder. Press the Ctrl + A hotkey to select all content within the LocalCache folder. Press the Delete button. 9) If these all fail then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account because of the serious and persistent problem with corrupted accounts. Then continue with the other steps to go over your install most thoroughly.10) If nothing else works then do a Repair Install, by installing Media Creation Tool and then choosing to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Wow thanks for this reply! I will indeed try these step by step and see how I go. I will let you know if I have some questions on the way I really appreciate you taking the time to help us :)Hayley (Jacksons Mum)","I'm glad to help, Hayley. Keep me posted on your progress as I will be here to help until the case is resolved."]},{"symptom":"Windows update        I have a laptop which is running of latest edition of windows and other side I have a desktop machine which run on older edition, Is that  any way that I can update desktop using the latest  running windows laptop without internet?","solutions":["Hi Rahul. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Yes you can use the PC with internet to download the latest version ISO file or create bootable media from the Media Creation Tool here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... Follow the instructions for downloading ISO or creating bootable media in the middle of the download page.Transfer the ISO or media to the offline PC, double click the ISO to mount it, or open the media, right click the Setup file to Run as Administrator, follow prompts to Upgrade to latest version.If any problems report back the verbatim error and number, then continue with these steps for overcoming Version Upgrade problems:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Blue Screen SYSTEM_SERVICE_EXCEPTION        I just got a blue screen which caused by ntoskrnl.exe.Dump: https:\/\/1drv.ms\/u\/s!Aok1tqJhZ5WIhTuVvL6SAWlM1Zvj?e=pP5UUKSomeone help me out please, thanks!","solutions":["Hi 0arkest, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved. BugCheck 3B, {c0000005, fffff8001a10e389, ffff8605caa27ba0, 0} Probably caused by : ntkrnlmp.exe ( nt!PspReturnQuota+49 ) ntkrnlmp.exe is a Windows component which means something else drove it into Fault.Further detailed analysis did not help at all. 1 A. I have a lot of these unexplained 3B so I suspect, just a guess, there could be a problem with the chipset drivers. Check with both the System Maker and AMD's Support for known issues.1B. Of course, update the BIOS, chipset drivers, and all major drivers (see driver update methods below),1C. Especially update the Nvidia drivers, though they are very current, as they could still be involved. And it may be necessary to revert to an older stable versions.Nvidia - Drivers - Use OPTION 1 to manually enter your driver info to get most current drivers.http:\/\/www.nvidia.com\/Download\/index.aspx?lang=...Nvidia Support - check with Support as it could be a known issue http:\/\/www.nvidia.com\/page\/support.htmlNvidia Forums - also check for forums as it could be a known issue and\/or others likely to have ithttp:\/\/forums.nvidia.com\/2. Run the memory tests (see methods below). 3. As needed use ALL the methods in the troubleshooters below. 4. After ALL the above if needed run Driver Verifier to see if it can indicate a CAUSE (see Driver Verifier methods below).----------------------------------------------------------- Troubleshoot blue screen errors <-- read this link http:\/\/windows.microsoft.com\/en-us\/windows-10\/t...BCCode: 3b 0x0000003b 3b is usually a graphic's driver (display adapter\/video driver), other possibilities include but are not limited to antivirus\/antispyware\/security programs and even memory (mapping).Try removing and reseating all cards, memory, and cables (both ends when possible) - actually remove and replace - do not just snug (on a PC) and clean out the dust bunnies and vents. On a laptop about all that can be done is reseat the memory and clean the vents. (Of course remove ALL power prior to opening the case.) BCCode: 3b 0x0000003b <-- read this link http:\/\/www.faultwire.com\/solutions-fatal_error\/...*1074.html orhttps:\/\/tinyurl.com\/8qfo58v================================================== This utility makes it easy to see which versions are loaded : Run DriverView - set VIEW to Hide Microsoft drivers - update those without Dump in their names (and update BIOS and chipset drivers).DriverView - Free - utility displays the list of all device drivers currently loaded on your system. For each driver in the list, additional useful information is displayed: load address of the driver, description, version, product name, company that created the driver, and more. http:\/\/www.nirsoft.net\/utils\/driverview.htmlFor Drivers check System Maker as fallbacks and Device Maker's which are the most current. Right Click the Start Button - Device Manager - Display Adapter - write down the make and complete model of your video adapter - double click - Driver's tab - write down the version info. Now click UPdate Driver (this may not do anything as MS is far behind certifying drivers) - then Right Click - Uninstall - REBOOT this will refresh the driver stack.Repeat that for Network - Network Card (NIC), Wifi, Sound, Mouse and Keyboard if 3rd party with their own software and drivers and any other major device drivers you have.Now go to System Maker's site (Dell, HP, Toshiba as examples) (as rollback) and then Device Maker's site (Realtek, Intel, Nvidia, ATI as examples) and get their latest versions. (Look for BIOS, Chipset, and software updates at System Maker's site while there.)Download - SAVE - go to where you put them - Right Click - RUN AD ADMIN - REBOOT after each installation.Always check in Device Manager - Drivers tab to be sure the version you are installing actually shows up. This is because some drivers rollback before the latest is installed (sound drivers particularly do this) so install a driver - reboot - check to be sure it is installed and repeat as needed. Repeat at Device Makers - BTW at Device Makers DO NOT RUN THEIR SCANNER - check manually by model.Manually look at manufacturer's sites for drivers - and Device Maker's sites. http:\/\/pcsupport.about.com\/od\/driverssupport\/ht...==================================================== Memory tests do not catch all errors such as mismatched memory (possible even for sticks that appear to be identical) and when faster memory is placed in the system behind slower memory. So it is best to also swap sticks in and out to check for those even if all memory tests fail to show a problem. To test RAM check here - let it run 4+ hours or so. <-- best method www.memtest.org MemTestX86 - Test RAM With http:\/\/www.tenforums.com\/tutorials\/14201-memtes...For the Windows Memory Diagnostic Tool. Type in Cortana's search box -> Windows Memory Diagnostics ........find at top of the list - click it. in Windows 8\/8.1\/10 the name is \"Windows Memory Diagnostic\".================================================ After doing ALL the updates you can, and if the issue continues, then run Driver Verifier. Driver Verifier can help find some BSOD issues : Using Driver Verifier to identify issues with Windows drivers for advanced users http:\/\/support.microsoft.com\/kb\/244617How To Troubleshoot Driver Problems in Windows Vista or 7. (8\/8.1 and 10 are essentially the same). http:\/\/www.winvistaclub.com\/t79.htmlUsing Driver Verifier https:\/\/msdn.microsoft.com\/en-us\/library\/window...WINKEY + X - RUN - type in -> verifier \/reset hit enter to disable If Driver Verifier creates a minidump upload it and post the link here so we can analyze it.Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all."]},{"symptom":"transferring windows mail        how to transfer all my email's folders and contacts to a new computer.  Windows mail","solutions":["Go to the Office forum.","Hello eskyjim, My name is Don and I am a Windows 10 Independent Adviser. Let me try and give you suggestions on how you could transfer email folders and contacts to your new computer.To transfer using Microsoft or Windows Live Account please do the following: 1. Open Windows Live Mail on your new computer and then click the \"Home\" tab then click the \"Sign In\" button.2. Now you need to enter your Microsoft or Windows Live ID and password in the fields. Please take note that this must be the same Microsoft or Windows Live ID you used back in Windows Live Mail on your old computer.3. Now press \"Ok\" and this should automatically transfer your mail, contacts and calendars.To transfer your emails manually, you can try the following steps: 1. Create a new folder on your old computer so that this is where Windows Live Mail will place your exported emails.2. Open Windows Live Mail and then click the \"File\" menu. Select \"Export email\" and then click \"Email messages.\"3. Select \"Microsoft Windows Live Mail\" as the file format and then click \"Next\". Now \"Browse\" and select the desktop folder you created earlier.4. Click \"Next\" then select all of the email folders you want to export and click \"Next\" again to initiate the file export process. Click \"Finish\" when the export process is done.5. Now you have the options to use a USB key or external hard drive on your computer to transfer the emails. Open File Explorer again and drag and drop your exported email folder from the desktop onto the USB key or hard drive. Eject the device once the files are copied, and then connect the USB key or hard drive to your new computer. 6. Open up Windows Live Mail on your new computer and click \"File\" and select \"Import messages.\"7. Select \"Windows Live Mail\" on the list of file formats, click \"Next,\" then \"Browse\" and select the folder on your USB key or hard drive containing your exported emails.8. Click \"Next\" and then click \"Finish\". Now to transfer your contacts manually, you can do the following steps: 1. Select \"Contacts\" in Windows Live Mail on your old computer. Click \"Export\" on the ribbon.2. Select \"CSV\". Browse to the location on your computer where you want to save the exported contacts file. Enter a name for the file and then click \"Save.\"3. Click \"Next\" and select which fields you want to export and click \"Finish.\" 4. You may now use a USB drive or external hard drive to transfer your contacts. Drag and drop the CSV file to the device you want to use and connect it to the new computer.5. Launch Windows Live Mail, click Contacts and click Import. 6. Browse the CSV file from the device you connected then click \"Next\" and click \"Finish\".Hope these information helps."]},{"symptom":"Blue Screen error and PC doesn’t restart after reaching 100% in Blue Screen error        Hi, as title stated, my PC doesn't restart automatically after reaching 100% after BSOD. It used to restart but since, I guess, last 2 Windows update it doesn't do it automatically anymore. I've checked that I turned on the automatic restart in System Properties\/System Failure. Attached is my mini dump in .zip format. Thank you in advance.https:\/\/drive.google.com\/file\/d\/1PhERQ5hnOcCDrZ2MTX1ofgFPTfSQ0KKW\/view?usp=sharing***Modified title from: Computer doesn't restart after reaching 100% in BSOD ***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are receiving Blue Screen error and the PC doesn’t restart automatically after reaching 100% in Blue Screen error. I’ll help you with the issue. Thank you for sharing the dump files. I have analyzed the dump files shared by you and found that GenuineIntel.sys driver is causing Blue Screen error with a Bug Check 0x124. The Bug Check 0x124 indicates that a fatal hardware error has occurred. It can be heat related, defective hardware, memory or even a processor that is beginning to fail or has failed. Upon researching, I found that the GenuineIntel.sys driver is a processor driver.  If you have overclocked the processor, I would suggest you to reset it to the base clock and check if the issue persists. Also, make sure that all the cooling systems such as fans are functional. For more information see, Bug Check 0x124: WHEA_UNCORRECTABLE_ERROR. Let us know the results. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Windows 10 \/ 1 minute lock screen problem        Being an Apple user, but my wife asked me!! not keyed up on Windows, l read up on possible causes! by this time my wife was pulling her hair out! trying to set her windows 10 laptop from going into 1 minute lock screen.l went all through the \"regedit\" procedures, taking photos prior to any modifications l tried, but still 1 minute lock screen was happing. Going back to my Microsoft day's, l couldn't locate the \"Screen Saver\" app anywhere, so l entered \"screen saver\" where l've been entering \"regedit\" and \"power options\" etc in the search box; and a small box popped up on the screen headed \"screen saver\" showing the setting for 1 minute, l didn't want to increase the time duration here, which would of only taken a second to do, l choose the option not to set anytimes here ie either tick or untick the box as stated and set and control the time in the lock screen facility in \"Windows settings\".Like most things once you know it literary took a couple of seconds to fix. Obvious to the wiz kids; but not so obvious to some?","solutions":["- THANK YOU!!!!!I'll spare people the similar Apple User rant, although I'm stunned Microsoft would bury such a critical feature. It took me 1 day of messing with RegEdits and various Power settings to eventually find this post.I've been trying to convert a .laz model on a very high end laptop at 60 fps and it dials down performance to 9 fps every time the lock screen comes on. Was getting ready to throw it out the window...Screen saver settings... hiding in insane site.RM"]},{"symptom":"CallNtPowerInformation -> SystemPowerInformation -> TimeRemaining to put system to sleep is decreasing with user activity        Hi,Am using CallNtPowerInformation from powrprof.h in my application.I use it to get SystemPowerInformation, which tells when to put system to low power state as per power plan settings.This returns a value TimeRemaining which is kind of a counter which starts when there is no user activity (idle system) and resets on user activity. I put machine to low power state (sleep mode) when TimeRemaining is zero.My problem is for some new devices, 'Dell 2-in-1 model with a detachable keyboard' this value TimeRemaining is decreasing even on user input (when system is not idle). Coz of this behavior i put machine to low power state even when its in use.Has something changed with this API. Should i use something else for the info i need.CallNtPowerInformation - https:\/\/docs.microsoft.com\/en-us\/windows\/win32\/api\/powerbase\/nf-powerbase-callntpowerinformationSystem Power Information - https:\/\/docs.microsoft.com\/en-us\/windows\/win32\/power\/system-power-information-strThanksNeha","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as you are facing issues with CallNtPowerInformation. Let me point you in the right direction, where you would get the appropriate help for this issue. I would suggest you to post your query inMSDN forums, where we have experts and support professionals who are well equipped with the knowledge onCallNtPowerInformation to assist you with the appropriate troubleshooting steps. We await your response. Aditya RoyMicrosoft Community – Moderator","Thanks Aditya,Have posted one here - https:\/\/social.msdn.microsoft.com\/Forums\/ie\/en-US\/f23a46d2-d9e4-431d-9e6b-03cf02b3484a\/callntpowerinformationsystempowerinformationtimeremaining-to-put-system-to-sleep-is-decreasing?forum=clr"]},{"symptom":"Headset, inputting mic and headset jacks through headphone splitter.  Not working on this pc, but works on another.  (Probably Realtek audio is the issue)  Can someone help me resolve the problem?        Using microphone and headphones from same input through a headphone splitter.  Works on different laptop, but doesn't work on my newer one because of Realtek not having an option to apply both at same time (my other laptop doesn't have Realtek)My device: Strix 17 GL703GE ","solutions":["Hi Rob. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything possible to try for headset problems so at least something will work. If you need help performing any steps I am standing by here to help:First try the steps here: https:\/\/www.maketecheasier.com\/fix-headphones-n...https:\/\/www.windowscentral.com\/setting-your-hea...https:\/\/www.lifewire.com\/fix-headphones-not-wor...https:\/\/www.thewindowsclub.com\/headphones-not-w...https:\/\/merabheja.com\/fix-no-speakers-or-headph...https:\/\/troubleshooter.xyz\/wiki\/fix-headphones-...Go to Settings > Devices > Autoplay to look for the device and change the default behavior in it's Dropdown Menu.Right click Volume icon in System Tray at right end of task bar, Open Sounds Settings, in dropdown menus at top make sure Headphones are selected and Connected for both Playback and Recording Default Devices.If not again right click Volume icon in System Tray to choose Troubleshoot sound problems.See how to re-enable the \"Which device did you plug in\" popup which can solve headset issues:https:\/\/windowsreport.com\/you-just-plugged-unpl... (avoid ad links)https:\/\/h30434.www3.hp.com\/t5\/Notebook-Audio\/En...https:\/\/forums.tomshardware.com\/threads\/how-do-...https:\/\/www.dell.com\/community\/Windows-10\/How-g...https:\/\/answers.microsoft.com\/en-us\/windows\/for...Go to the Device Manager reached by right clicking the Start button, choose Sound controller device, on Driver tab choose Roll back or Uninstall, restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver. Do the same for the headset device and\/or it's microphone. Update the Sound driver from the PC or Device maker's Support downloads web page. While there also check that the Chipset, BIOS, Display, USB, Network and all other drivers are the most current.Sometimes it helps to unpair or disconnect all other Bluetooth devices from the PC in Bluetooth settings, then try again to connect the headset.If this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t...If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....To check over the integrity of your install go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m...If you want to report this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems.If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it. If you are an Insider I can also vote it up with my MVP badge and track the issue for you.I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","This article seems to be close to what I need, but in the last picture in the article, I don't have all those additional settings except Notification and language settings.","Would be the same steps. You need to choose the microphone in Input and Headset in Output. All other troubleshooting steps are the same as for headset with mic.","Problem is, I can't see both of them in the options but I can switch between the two if I plug in Mic. or Headphones individually.Here is a GIF is me being able to switch between the two, but not having an option to use both for some reason.https:\/\/gyazo.com\/f05bf948566e0a223f24d50b7dc63811Apologies if you are trying to tell me something but I'm not understanding.  I hope you don't mind.","Then it may not work, as it's dependent upon the Sound controller as well as the headset and microphone driver. This is why it's important to make sure you have the latest, especially the Sound controller which governs most.","I just went through all the available sound driver related things and searched through the updates and they are all on the latest version.  The reason I am persistent with this is because on my other laptop, it works without a problem.  It may be the Asus version of it maybe..."]},{"symptom":"Forza Horizon 4 keeps crashing on start.        Hi, yesterday I got the xbox gamepass for PC. The main reason for this was to get access to Forza Horizon 4, but when I finally downloaded it and tried to launch it, it didn't work. I've looked around on the forums and I haven't found any fixes yet. I tried uninstalling MSI afterburner, resetting my save data (didn't work cuz I had never played it before). I have a good enough pc: GTX 1050 Ti, Ryzen 5 2600X, 8gb ram, 500GB ssd, etc. I tried uninstalling and reinstalling the game countless times.Nothing worked. I tried using Event Viewer, these are the logs:Faulting application name: ForzaHorizon4.exe, version: 0.0.0.0, time stamp: 0x5d8e8039Faulting module name: ForzaHorizon4.exe, version: 0.0.0.0, time stamp: 0x5d8e8039Exception code: 0xc0000005Fault offset: 0x00000000005b15d4Faulting process id: 0xad7cFaulting application start time: 0x01d57abe98e849f3Faulting application path: C:\\Program Files\\WindowsApps\\Microsoft.SunriseBaseGame_1.351.461.2_x64__8wekyb3d8bbwe\\ForzaHorizon4.exeFaulting module path: C:\\Program Files\\WindowsApps\\Microsoft.SunriseBaseGame_1.351.461.2_x64__8wekyb3d8bbwe\\ForzaHorizon4.exeReport Id: f06b7c2a-5144-4b73-9c86-dde531343cb6Faulting package full name: Microsoft.SunriseBaseGame_1.351.461.2_x64__8wekyb3d8bbweFaulting package-relative application ID: SunriseReleaseFinalI tried disabling development mode in Windows Powershell. I tried going on an administrator account to try it on there, still didn't launch. I tried Installing the game on my laptop that I use for college. Same error codes, none of the fixes worked on there either.Could anyone please help me with this? I'm tired of going through the same Forum posts.","solutions":["Hi zTea Greetings! I am Vijay, an Independent Advisor. Please try these steps and check after each step.1. If you are able to open MS Store, open MS Store > Click on your profile picture on top right and sign-out. Then sign-in again.2. Try to reset the app Windows Key+i > Apps > Scroll down to this App > Click this App > Advanced options > Reset3. Reset Microsoft Store through Command Prompt Type cmd in Windows Search box > Right click on Command Prompt > Run As Administrator > Type WSreset.exe and click Enter > Reboot your computer4. Run Windows Store Apps Troubleshooter Windows Key+X > Click Settings > Click Update & security > Click Troubleshoot > Scroll down to the bottom > Click Windows Store Apps > Click Run the Troubleshooter5. Uninstall & Reinstall Store Windows Key+X > Windows Powershell (Admin) > Copy the following from below and right click in Powershell to paste > EnterGet-AppxPackage -allusers *WindowsStore* | Remove-AppxPackage Copy the following from below and right click in Powershell to paste > Enter > Reboot your computerGet-AppxPackage -allusers *WindowsStore* | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register “$($_.InstallLocation)\\AppXManifest.xml”}Do let me know if you have any more question or require further help.","I have this same exact error, it shuts down the latest AMD drivers and won't load back into forza horizon 4 until i reboot.  RX 590, the game crashes all the time and has graphical errors, no other game i have..and i have plenty, is having this problem.","Having the same issue you described. The game runs fine though for a period of time, but often times it randomly hangs for a few seconds and continues after the hang. other times the hang is completely crashing the game to the point where i (just now) witness a weird glitching crash screen with literally all kinds of graphical glitches and distortion on my entire screen. and game just shuts down back to windows.last night i had these weird over bloomed red lines next to all the roads.. really weird.i have some other games aswell but none of them have this problem.also running the RX590.","I know what you mean about the red lines.  They have been red, yellow, green, where the sideline of the roads are.  Sometimes there's other artifacts also.  I adjusted some settings.  I'm sure you know the 590 with a ryzen 5 can run the game with just about everything on ultra, but with everything turned up it crashed more often.  I switched shadows from ultra to high, reflections from u to h, and a couple other settings down.... it still crashes, just not as often.  ","I have this exact same error message as well, I submitted a ticket to forza support and they have said it might be something to do with my hard drive and told me to defrag it or reinstall it on my ssd, and nothing worked. I really hope microsoft can find the solution for this because I am a huge forza fan and I really wanna be able to play the game again.","I have tried all of these before and none of them have worked, I even ran the troubleshooter and it said it fixed the \"hanging and crashing apps\" but when I launched my forza again, same application hang error occurred.","I am also experiencing the same exact problem... After doing some research, this appears to be a recurring problem that MANY people have experienced recurrently ever since the game was released. However, I am experiencing it for the first time after having played the game with no problems for almost an entire year now, since I bought it from the Windows store in October 2018.This is a RECENT issue (game ran successfully last Nov. 16, 2019 - Now it is Nov. 23, 2019, and the game does not launch).I have tried every suggested troubleshooting option listed in (short of reinstalling Windows itself) to make the game even BOOT properly, and nothing has worked.This is CLEARLY an OLD ERROR that is now RESURFACING for users that never had it before. The game DOES NOT LAUNCH.Everything I've read regarding this issue involves access errors, permissions, and verification - all Windows related issues.My version of Windows 10 is UP TO DATE. According to the Microsoft Store, my version of the GAME IS UP TO DATE. My Nvidia DRIVERS ARE UP TO DATE. I have not installed any new software since the game last ran, or changed any firewall, anti-virus, or Windows settings that would affect the game from launching. This is clearly a developmental problem with either a game update... or, more likely, a WINDOWS update. PATCH IT!!!!!!!!","All, I am also a victim of Forza Not working. It worked fine about 1 week ago. I have tried all steps above but no success. Too many people are observing this problem at the same time for it to be a coincidence. In the Application error log I see this message:Faulting application name: ForzaHorizon4.exe, version: 0.0.0.0, time stamp: 0x5dcc7e88Faulting module name: ForzaHorizon4.exe, version: 0.0.0.0, time stamp: 0x5dcc7e88Exception code: 0xc0000005Fault offset: 0x00000000003baff4Faulting process ID: 0x28e4Faulting application start time: 0x01d5a2b800f8599dFaulting application path: C:\\Program Files\\WindowsApps\\Microsoft.SunriseBaseGame_1.367.746.2_x64__8wekyb3d8bbwe\\ForzaHorizon4.exeFaulting module path: C:\\Program Files\\WindowsApps\\Microsoft.SunriseBaseGame_1.367.746.2_x64__8wekyb3d8bbwe\\ForzaHorizon4.exeReport ID: f74d8d74-7796-417e-8875-bd0af9ae9351Faulting package full name: Microsoft.SunriseBaseGame_1.367.746.2_x64__8wekyb3d8bbweFaulting package-relative application ID: SunriseReleaseFinal","same issue here,was workingon 12november started the game and played it, but no soundon 13november splash screen close itself after 1mnchecked event log and saw the sunrise error.tried I think 99% of solution offered and no solution... yetcontacted forza and got them send me back to microsoft support","Any updates on this?I feel like I'm losing money the longer this goes on..."]},{"symptom":"Duplicate entries in Windows 10 calendar events system tray (systray)        Hi there.  For at least a year I have noticed that when using the Microsoft Calendar app with my company's O365 Outlook account I eventually start to see duplicate entries in the lower right system tray (systray) area like this...  Notice 4 duplicate events here.If I remove all accounts and start over, the problem is resolved BUT only for a few days or so.  Duplicate entries start to show up again.  I have looked all over the net to find a solution for this but the best I could come up with is someone else who is experiencing the same thing, no solution.  I find this systray display of my daily events to be very useful but it's annoying that I have to reconfigure the Calendar app often to avoid seeing all the duplicates.To avoid confusion I want to be clear that I'm using the native Calendar app in Windows 10 to populate my daily events.  This is Calendar app icon from the Start menu...Also the account type I have an issue with is \"Exchange, Office 365\" as follows:I would really appreciate any help with this.  Thank you!","solutions":["Hi Jinkies, To prevent duplicate calendar items when you import calendar items into Outlook, select the Do not import duplicates or Replace duplicates with items imported option in the Import and Export Wizard.Please follow this article on how you can delete duplicate calendar entries: https:\/\/support.office.com\/en-gb\/article\/delete...Please let us know if you need further assistance. Thanks and regards,","To prevent duplicate calendar items when you import calendar items into OutlookHi there.  Sorry but this is not applicable at all to my situation.  I'm not importing items into Outlook.  If you look carefully once again I am simply trying to use the native Calendar app that comes with Windows 10 to connect and sync with my O365 company account, and then I'm using the system tray area to view what events\/meetings I have lined up for the day.","Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.It looks like the issue happens to calendar entries that are in a series. I would suggest logging an issue using Feedback Hub for this. I'm going to do the same as well.https:\/\/support.microsoft.com\/help\/4021566Please let me know if I can help you further! Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"my laptop is showing  issue of aptio setup utility and i don't find launch csm option in my laptop please help me to fix it.        my laptop is facing issue of aptio setup utility","solutions":[]},{"symptom":"My printer won't print. No sounds of any sort. Have new laptop so downloaded driver and added my brother printer.        It'a a brother mfc260c. have unplugged printer and waited. also restarted laptop. Computer say printer is in \"eeror\" state!","solutions":["Did you already look at this?https:\/\/support.brother.com\/g\/b\/downloadlist.aspx?c=au&lang=en&prod=mfc260c_eu_as&os=10013","Did you install the printer using the software that came with the printer.","Hi Merry, Upon checking this comes with a built in driver. For you to install it, please follow this article: https:\/\/support.brother.com\/g\/b\/faqend.aspx?c=a...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"Kingston Flashdisk 32Gb DT50 DataTraveler 50 USB 3.1 DT50 \/ 32Gb cannot be detected        I have a Kingston Flashdisk 32Gb DT50 DataTraveler 50 USB 3.1 DT50 \/ 32Gb, it used to be used and detected on my laptop with Windows 10 OS but why can't it be detected now?","solutions":["Hi Mushaminn. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) For USB drive not detected issue, first try steps here: https:\/\/mspoweruser.com\/solved-usb-device-not-r... 2) Right click Start button to open Disk Management, scroll down to try to find the drive on the map by size and label, right click on it to assign a drive letter so it's detected in File Explorer.3) Go into Device Manager to look for the drive under Disk Drives. It may be listed by it's model or Serial which you can google to determine which is it. Click on the Device, then Driver tab, choose Roll Back if available. If not then choose Uninstall, restart PC to reinstall driver. If that fails choose Update Driver, first Automatically, then if that fails choose Browse > Let Me Pick to try all previous drivers.If no newer or this doesn't help, then go to the USB category in Device Manager, open each Enhanced, Hub and Host controller, from Driver tab select Roll back if available, or if not choose Uninstall.If your keyboard and mouse are USB, first program the power button to effect the needed restart after Rolling back or uninstalling the driver. Go to Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do to choose Shutdown.4) You can check which Updates were installed just before this happened, then uninstall them at Settings > Update & Security > Windows Update > Installed Update History - look first for installed drivers. Then you can hide these Updates using the Hide Updates tool: https:\/\/www.howtogeek.com\/224471\/how-to-prevent... You can also try to System Restore to a point before this happened, then check for Updates using the Hide Updates Tool to block the Updates offered:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... 5) Check if the drive is detected in another PC. If so back up the data to it's desktop.Then plug it back into the PC which cannot detect it, reformat in Disk Management:http:\/\/www.wikihow.com\/Format-an-External-Hard-...http:\/\/www.howtogeek.com\/235824\/how-to-clean-a-...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Default desktop apps icons gone        So for a long time, my default desktop icons have been invisible. Apps like settings, Microsoft Store, Xbox, and Minecraft have no taskbar icons. I have looked everywhere to find a fix, but nothing ever works. Essentially I have no idea what apps I have open if it's like this and I was hoping that someone out there is smarting then me to figure it out or link me to a website to fix it. I'm pretty much willing to try anything. ","solutions":["Hi Royo. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.TaskBar shortcuts being invisible is a known issue with fixes here: https:\/\/www.guidingtech.com\/fix-windows-10-invi...https:\/\/www.blogsdna.com\/27155\/fix-windows-10-t...https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"how to install bluetooth on windows 10        how do I install Bluetooth on windows 10","solutions":["Hi, My name is Angel. I am an Independent Advisor. Thank you for posting in Microsoft Community.What is brand and model of your device? I would recommend that you review the following post: https:\/\/www.windowscentral.com\/how-and-why-use-...Hope the information provided is useful. If the issue persists, reply here and we will be glad to help you.Angel. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","You either require an inbuilt Bluetooth capability - usually comes included in laptops, or purchase a Bluetooth dongle to add the function to a desktop or a laptop which doesn’t have BT adapter.If this is not your question then please post back with further details of what you’re trying to achieve.","Hi. johnmcgonigal My name is Ben Independent Advisor I hope to help. Follow the steps below to activate or deactivate your Bluetooth in Windows 10: 1. Click on the Start Menu and choose Settings. 2. Select Devices. 3. Select Bluetooth. 4. Move the Bluetooth slider to the desired position, On or Off. 5. Click on the X in the upper right corner to save the changes and close the configuration window.","Hi johnmcgonigal , I am Vijay, an Independent Advisor. I am here to work with you on this problem. If your computer has bluetooth capability, then you should install Bluetooth driver from manufacturer's websiteGo to the website of the driver's manufacturer or computer's manufacturer > See if some driver is released for your model and OS > If yes, download that > In previous option, click Uninstall > Install the downloaded driver > Restart your computerIf your computer doesn't have bluetooth capability, then you need to buy a bluetooth attachment. Refer to details here -How to Add Bluetooth to Your Computer - https:\/\/www.howtogeek.com\/201004\/the-htg-guide-... Do let me know if you require any further help on this. Will be glad to help you.Disclaimer - This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi, My name is Angel. I am an Independent Advisor. Thank you for posting in Microsoft Community.What is brand and model of your device? I would recommend that you review the following post: https:\/\/www.windowscentral.com\/how-and-why-use-...Hope the information provided is useful. If the issue persists, reply here and we will be glad to help you.Angel. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","There was Bluetooth in my laptop (Windows 10) but while I was using it I found It is not responding . Bluetooth is not going tbe on and there was no icon in the action centre. I felt at a loss .  Please help restore Bluetooth in me=y Laptop .","I cannot seem to get Bluetooth to install on my Windows 10 PC","how do I install Bluetooth on windows 10","blietooth is not open","how do I install Bluetooth on windows 10"]},{"symptom":"Moving an account to another user        I rebuilt a computer for my girlfriend and I and when I loaded two new copies of windows 10 on each computer I used my account to set them up.  Is there a way I can move the windows key on her computer to her windows account after the fact?","solutions":["Hi AP. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Delete your Windows 10 Microsoft account off of the PC and unlink the PC from within your MS account:https:\/\/support.microsoft.com\/en-us\/help\/402644... Then she only needs to sign into Windows 10 with a Microsoft Account with Admin rights and it should link the Digital License to her MS account.To swap your WIndows 10 account to hers go into Settings > Accounts > Your Info and choose Sign in with a Local Account instead, give it her name, restart PC, go back to same place and now choose Sign in with a MS Account instead, and sign in with her MS Account or create one. Otherwise create a new MS Account for her at Settings > Accounts > Family & Other People > Other User.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]}]}