{"windows":[{"symptom":"use windows live on windows 10 system        I would like to be able to use windows live on the windows 10 system","solutions":["Hi Tony Do you mean Windows Live Essentials? If so, while Microsoft no longer support Live Essentials, it is still downloadable and will run on Windows 10 . . .Windows Essentials latest version 16.4.3528.0331: English (United Kingdom) http:\/\/web.archive.org\/web\/20160423192125\/http:...English (United States) http:\/\/web.archive.org\/web\/20170112124505\/http:...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]},{"symptom":"Quick Access in Windows 10        I have Quick Access in Windows 10.  Every time I open file explorer, I have to wait forever until the Quick Access fnishes.  I have tried going to View, Options, Folders, unchecking and clear but it isn't good enough.  It still takes forever if I have worked with filing numberous things.  I would like to get rid of it!  But I don't want to lose my drag and drop option of moving items into folders.  Help!","solutions":["Hi Gloria To make File Explorer load quicker: Open File Explorer, then on the View Ribbon (tab) click Options On the resulting dialog, set the 'Open File Explorer to' drop-down to 'This PC' rather than Quick Access . . ..","You can always click on the pins in Quick Access and unpin the items.","Not too techy....how do I do this?","Thank  you thank  you thank  you!!!!  Worked!","Hi Gloria, glad to Help!","As I said.  Right click on the pin after the folder title, click on Unpin from Quick Access."]},{"symptom":"Folders opening and closing on desktop properly        I have a new Dell Windows 10 machine. As I open a new folder the previous folders stack up behind the newest window. If I click on a sub folder it swings to the opposite side of the screen. All this going on makes for a very confusing and difficult to keep up with desktop. I am sorting and filing MANY pictures into family folders and have to stop periodically to close all windows that have opened. It slows me down and can be very confusin","solutions":["Hi Karen. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See this tutorial for all methods to stop Windows Explorer from opening a new window for each folder you open:https:\/\/www.tenforums.com\/tutorials\/66634-open-...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.______________________________________________ Note: Linked tutorial is from Shawn Brink who is a trusted Microsoft MVP."]},{"symptom":"Troublshoot Error (0x409) 0x80070422 on Xbox App        IntroductionIf your using the Xbox App on Windows 10, you may get a sign in error like this: (0x409) 0x80070422. This indicates that some of the services the Xbox App uses have not been enabled, or not working properly. Thus results with this error code, and you will also notice your unable to sign into Xbox Live through the App and other services could be effected.This article will walk you though the steps needed to resolve this error - or attempt to at least :) Please make sure you follow the steps accordingly.If your not confident with following these steps, make sure you ask someone who is confident with doing this.DetailsThese steps will be based around using MS Configuration to start the services within Windows 10, that the Xbox App needs to use.1. Search \"ms config\" in Cortana - the search bar on your taskbar,2. Select System Configuration which is shown in the results, 3. In the MS Config window, select Services tab, 4. Scroll down and make sure the following boxes are ticked for the following services: Xbox Live Auth Manager, Xbox Live Game Save & Xbox Live Networking Service,5. Select Apply and then OK,6. and then restart your PC\/Device and try launching the Xbox App again. ___________________________________________I hope this information helps you. If you would like to suggest edits to this article, please comment them below. If you would like help with the Xbox App, please use the ask question button to post to this community.  ","solutions":["Hi,My Xbox app doesn't want to launch, and when I follow your method, I only have 2 Xbox services :-Xbox game monitoring-Xbox accessory management serviceI've also tried to uninstall and reinstall the app, but I'm still unable to connect","Bonjour quand je vais dans mon système de configuration pour résoudre le problème je n'es que deux documents Xbox -Surveillance du jeu Xbox -Gestion des accessoires Xbox Je n'est que c'est deux la je ne peut donc rien faire .... ","i like it 👌👌","The listed ones didn't show up so I went to the services manager and enabled them from there.","ThanksIt's very goodتخلیه چاه"]},{"symptom":"SYSTEM_THREAD_EXCEPTION_NOT_HANDLED (7e) BSOD on Windows 10        Hi there, I have been having multiple BSOD on my computer. I have tried to reinstall windows 10 and have also made sure that all of my drivers are up to date. I have a DMP file that you can look at to see if you can find any fix to this. Any help would be appreciated. SYSTEM_THREAD_EXCEPTION_NOT_HANDLED (7e) This is a very common bugcheck.  Usually the exception address pinpointsthe driver\/function that caused the problem.  Always note this addressas well as the link date of the driver\/image that contains this address.Arguments:Arg1: ffffffffc0000005, The exception code that was not handledArg2: fffff8048217954c, The address that the exception occurred atArg3: ffffa187a9b9d4c8, Exception Record AddressArg4: fffff80476c22930, Context Record AddressDebugging Details:------------------KEY_VALUES_STRING: 1    Key  : AV.Fault    Value: Read    Key  : Analysis.CPU.Sec    Value: 3    Key  : Analysis.DebugAnalysisProvider.CPP    Value: Create: 8007007e on DESKTOP-JQ0N1BQ    Key  : Analysis.DebugData    Value: CreateObject    Key  : Analysis.DebugModel    Value: CreateObject    Key  : Analysis.Elapsed.Sec    Value: 36    Key  : Analysis.Memory.CommitPeak.Mb    Value: 64    Key  : Analysis.System    Value: CreateObjectADDITIONAL_XML: 1BUGCHECK_CODE:  7eBUGCHECK_P1: ffffffffc0000005BUGCHECK_P2: fffff8048217954cBUGCHECK_P3: ffffa187a9b9d4c8BUGCHECK_P4: fffff80476c22930EXCEPTION_RECORD:  ffffa187a9b9d4c8 -- (.exr 0xffffa187a9b9d4c8)ExceptionAddress: fffff8048217954c (e1d68x64+0x000000000001954c)   ExceptionCode: c0000005 (Access violation)  ExceptionFlags: 00000000NumberParameters: 2   Parameter[0]: 0000000000000000   Parameter[1]: ffffb583ff7717b8Attempt to read from address ffffb583ff7717b8CONTEXT:  fffff80476c22930 -- (.cxr 0xfffff80476c22930)rax=ffffa187a9b9d708 rbx=0000000000000001 rcx=ffffb584762f0750rdx=ffffb584765a7000 rsi=ffffb584765a8080 rdi=0000000000000000rip=fffff8048217954c rsp=ffffa187a9b9d708 rbp=ffffb584765a7000 r8=ffffb5847675b030  r9=0000000000000001 r10=ffffb584762f0750r11=ffffb584765a7000 r12=ffffb5847675b030 r13=ffffb5847675b030r14=0000000000000001 r15=0000000000000000iopl=0         nv up ei pl nz na po nccs=0010  ss=0018  ds=002b  es=002b  fs=0053  gs=002b             efl=00050206e1d68x64+0x1954c:fffff804`8217954c 48896810        mov     qword ptr [rax+10h],rbp ds:002b:ffffa187`a9b9d718=ffffb5847675b030Resetting default scopePROCESS_NAME:  SystemREAD_ADDRESS:  ffffb583ff7717b8 Nonpaged poolERROR_CODE: (NTSTATUS) 0xc0000005 - The instruction at 0x%p referenced memory at 0x%p. The memory could not be %s.EXCEPTION_CODE_STR:  c0000005EXCEPTION_PARAMETER1:  0000000000000000EXCEPTION_PARAMETER2:  ffffb583ff7717b8EXCEPTION_STR:  0xc0000005BAD_STACK_POINTER:  fffff80476c220c8STACK_TEXT:  ffffa187`a9b9d708 fffff804`8217a943 : 00000000`00000001 ffffb584`7675b030 ffffb584`765a8080 ffffa187`a9b9d758 : e1d68x64+0x1954cffffa187`a9b9d710 fffff804`82180756 : ffffb584`762f0750 ffff0001`00000000 ffffb584`765a7001 ffff0001`00000000 : e1d68x64+0x1a943ffffa187`a9b9d7a0 fffff804`82182742 : ffff0001`00000000 00000000`00000000 ffffa187`a9b9d8a0 00000000`00000000 : e1d68x64+0x20756ffffa187`a9b9d820 fffff804`82181c58 : ffffb584`762f01b0 ffffa187`a9b9d948 00000000`00000000 00000000`00000000 : e1d68x64+0x22742ffffa187`a9b9d8e0 fffff804`7605ec92 : ffffb584`766f7d98 00000000`00000000 ffffb584`75e06180 ffffb584`6ea6e4c0 : e1d68x64+0x21c58ffffa187`a9b9d920 fffff804`76073b5d : ffffb584`6ea6e4a0 ffffb584`6ea6e4a0 fffff804`76073900 ffffb584`766f7d98 : ndis!ndisQueuedMiniportDpcWorkItem+0x1a2ffffa187`a9b9da40 fffff804`70d2a7a5 : ffffb584`75e06040 ffffb584`75e06040 fffff804`76073980 00000000`00000000 : ndis!ndisReceiveWorkerThread+0x1ddffffa187`a9b9db10 fffff804`70dc8b2a : ffffd480`4ac00180 ffffb584`75e06040 fffff804`70d2a750 00000000`00000000 : nt!PspSystemThreadStartup+0x55ffffa187`a9b9db60 00000000`00000000 : ffffa187`a9b9e000 ffffa187`a9b97000 00000000`00000000 00000000`00000000 : nt!KiStartSystemThread+0x2aSYMBOL_NAME:  e1d68x64+1954cMODULE_NAME: e1d68x64IMAGE_NAME:  e1d68x64.sysSTACK_COMMAND:  .cxr 0xfffff80476c22930 ; kbBUCKET_ID_FUNC_OFFSET:  1954cFAILURE_BUCKET_ID:  AV_STACKPTR_ERROR_e1d68x64!unknown_functionOS_VERSION:  10.0.18362.1BUILDLAB_STR:  19h1_releaseOSPLATFORM_TYPE:  x64OSNAME:  Windows 10FAILURE_ID_HASH:  {c9f5536f-9157-ae0a-4f3a-7e60d0c762ce}Followup:     MachineOwner","solutions":["Hi James Your stack printout shows e1d68x64.sys is the cause of your system crashes . .. e1d68x64.sys is your Intel Network Device Driver, the best option is to go to the support page for your PC on the manufacturers website, then from there, download and install the Intel Network device driver they recommend, that will be an older version than the one Windows updates installed, but should be more compatible with your PC","Thanks for the quick response! I've tried to update the network driver by downloading it from the Asus website. (I have a ASUS ROG Strix z370-F motherboard). After unzipping it, I click onto the application but nothing pops up. I have also tried to manualy update it from device manager but it says it is the current driver. Any tips?Thanks, James ","Hi James Uninstall the current driver, by right clicking that device in Device Manager, then try installing an older version . . ."]},{"symptom":"Windows 10 Xbox App (VIDEO)        Technical Level : Basic SummaryWhether you’re new to Xbox or a hardcore gamer, the Xbox app is the place to play games, meet up with friends, make new ones, and rack up achievements.Detailshttp:\/\/aka.ms\/win10xboxapp","solutions":["Thanks my dearحفر چاه"]},{"symptom":"order of dual monitors in windows 10        how to change the left-right orientation of dual monitors in windows 10","solutions":["Go Settings, System, Display.  There you can switch the numbers","Hi, You can change the display arrangement by going to Settings > System > Display, there should be a diagram of both monitors at the top. From there you can drag the second display to the orientation you prefer.I hope that helps."]},{"symptom":"Unable to Connect the Xbox One in the Xbox App        Technical Level : Basic SummaryThe Xbox App is great for gaming, and connecting to friends. Whether your a hard core gamer or your average gamer. It is still fun to use!There are many things the Xbox App can be used for, even to connect up to your Xbox One to stream the content from the Xbox to the Xbox App. However, there are times when the App does not work as expected to, which in tern can leave you raging. This article will, hopefully, help you with sorting out problems using the App to connect to the Xbox One console and streaming.DetailsNot able to see the Connect option on the Xbox AppFor those of you who are unable to see the connect option when using your Xbox app on Windows 10 (Or not able to connect your Xbox to the app), then you could be running an old version of the Xbox App and it will need to be updated. To check to see if your Xbox App needs to be updated, please look at this article below, for more information:http:\/\/support.xbox.com\/xbox-on-windows\/getting-started\/verify-version-xbox-app-on-windows-10To update your Xbox app on your Windows device, you can follow these instructions:You will need to first launch the Marketplace App on your device.Once you in the app, please search for “Xbox”Click onto the Xbox app, that will be displayed in the search results – This should also be noted as “Installed”.Once you have clicked onto the App, then it should install the update for the App on your device.Once it has updated, you can navigate back to your app and launch it where you should then see the connect option.Not able to connect my Xbox One to the Xbox App You can try a power cycle on the console (holding the power button for 10 seconds), which will turn off your Xbox One. Once the Xbox One is turned off, turn it back on and see if your Xbox One will connect to your Windows 10 device.Please take a look at the following link for troubleshooting steps on how to resolve problems about the Xbox App game streaming.http:\/\/support.xbox.com\/xbox-on-windows\/gaming-on-windows\/troubleshoot-xbox-app-game-streaming________________________________________________I hope this article does help you with connecting to the Xbox App. If you would like to suggest changes, please use the suggest edits option on the bottom of the article. If you would like help with the Xbox App, then please use the Ask the community link on the right hand side of the article.","solutions":["How about not being able to turn on the console with it anymore? As far as I can tell the WOL feature died sometime in 2015. The app will see it, connect to it, but the thing won't turn on. This is reproducible on Xbox One, S, and X with versions of the app on all platforms. \"We can't turn on your console. Make sure this device is on the same network as your console and your console is set to instant on.\"Not only that but it's 2 feet from my wifi router and I'm a foot away from both of them on my Win10 laptop and my iPhone. .","I can't power on the Xbox using the app either. I called into Microsoft support and the person had absolutely no idea Microsoft had an app. After 15 minutes of verifying with her manager that there actually was an app, they just had me reboot my Xbox and try again. That failed. After unplugging the power, plugging it back in and then putting the Xbox to sleep, it worked again. She declared it working. I told her that it always worked the first time after the power was unplugged but after an hour or so of being in sleep mode it would stop working. She gave me an email and ticket number and said if it came back to e-mail and she would follow up. I e-mailed but never got a response. ","Same here. App has always discovered my xbox one (never my roommate's on the same network), but never worked to turn it on or begin any downloads. I have retried every 3-4 days for the last 5 months, with zero luck.","So i have an ethernet cable connected to both my xbox and PC yet i cant connect the xbox to the windows 10 app. I even tried putting in the console IP with no luck. ive tried everything. Just cant seem to connect xbox one to pc with ethernet cables connected to both. Worked before over WiFi","So i have an ethernet cable connected to both my xbox and PC yet i cant connect the xbox to the windows 10 app. I even tried putting in the console IP with no luck. ive tried everything. Just cant seem to connect xbox one to pc with ethernet cables connected to both. Worked before over WiFi to fix this issue you have to go to your Xbox, go to settings, got to network settings, click on go offline, then click go online then you should be able to connect to your pc easy ","So i have an ethernet cable connected to both my xbox and PC yet i cant connect the xbox to the windows 10 app. I even tried putting in the console IP with no luck. ive tried everything. Just cant seem to connect xbox one to pc with ethernet cables connected to both. Worked before over WiFi to fix this issue you have to go to your Xbox, go to settings, got to network settings, click on go offline, then click go online then you should be able to connect to your pc easy Why should someone have to fully restart the xbox or go off + online for the feature to work every time?The PS4 streaming play works flawlessly.On my Xbox One X, I can't use my PC or Laptop to turn the device on - I more often than not have to use an android phone....and even then the phone will take 5-10 attempts to wake the Xbox (if it's successful at all - I'm trying right now and am on my 15th attempt)The Turn on feature is fundamentally broken.","I tried all the troubleshoot and nothing. Won't detect my Xbox One X and I put in my IP address and it doesn't work. It was working. Now I can't stream or connect to my xbox One X. What is the issue with this?","So i have an ethernet cable connected to both my xbox and PC yet i cant connect the xbox to the windows 10 app. I even tried putting in the console IP with no luck. ive tried everything. Just cant seem to connect xbox one to pc with ethernet cables connected to both. Worked before over WiFi to fix this issue you have to go to your Xbox, go to settings, got to network settings, click on go offline, then click go online then you should be able to connect to your pc easy Why should someone have to fully restart the xbox or go off + online for the feature to work every time?The PS4 streaming play works flawlessly.On my Xbox One X, I can't use my PC or Laptop to turn the device on - I more often than not have to use an android phone....and even then the phone will take 5-10 attempts to wake the Xbox (if it's successful at all - I'm trying right now and am on my 15th attempt)The Turn on feature is fundamentally broken.I have an Xbox one S and I normally use an Ethernet cable and before Thanksgiving 2018, smartglass and the Xbox app on my laptop worked perfectly but after that, it hasn't worked at all. I'm trying to play games while I'm at a hotel. I've tried all the steps in this article and nothing has worked. Plz help.","I have my xbox on ethernet and my laptop on wifi.  The connection worked flawlessly after putting in the IP of the xbox for over a month, but a few days ago it didn't connect and won't connect when putting in the IP address.  I've double-checked that the IP hasn't changed.","same here. There are several friends around me who have the same issue. But MS does do nothing!!! Remote play outside does not work since last xbox update happened last week!Onecast, Xoon app does not work for remote play from outside!!!It's not working on static IP circumstances.(no router in the middle.)"]},{"symptom":"I want my file on my computer so that when I unlink onedrive they are still there        My desktop is linked with my onedrive. I also have checked the box on settings so that all files are to be kept on the computer. I kept getting messages that my onedrive was full. I tried to unlink and stop syncing the onedrive. When that happened, the desktop files disappeared even though I made sure the files were supposed to be on the local machine. I want to be able to assign only specific files to save on onedrive and I don't want any of my files to disappear from my computer for any reason, ever. This idea that onedrive is saving me space does not apply to me and is an inconvenience. Please give me instructions so that I can:Keep all files on my computer and not on onedrive. select only certain files to be saved to one drive ","solutions":["Hi [psyking] I think you'll find everything you need on this page here : https:\/\/support.office.com\/en-us\/article\/save-d...Let me know if you need further help Regards"]},{"symptom":"LocalBridge.exe - Bad Image error        I started getting the error labeled above. It says:\"C:\\Windows\\System32\\Windows.Storage.ApplicationData.dll is either not designed to run on windows or it contains an error. Try installing the program again using the original installation media or contact your system administrator of the software vendor for support. Error status 0xc000012f\"All I can notice that I can not do us use the windows button, search bar and some apps directly from Microsoft(store, paint 3d, photos, etc). Thus, I looked online for help. I did the SFC \/scannow and DSIM process (with restart). That changed nothing. I also turned off the startup of all non windows\/Microsoft apps. Also no change. I checked for windows updates, and did them (with restart). Also no change.Is there anything else I should do?Thank you,LiquidShark13","solutions":["Hi, this is Rivgil. An independent advisor. Sorry if this may caused any trouble. I'll be more than willing to help. It seems that there's a file that has been corrupted. Please press Windows key + R simultaneously. Type cleanmgr and hit Enter.Then select OS partition (C:) and press OK.Please mark the Setup log files, Recycle bin, and Temporary files section. Then, select Clean up System Files and wait for the process to finish. Please reboot the pc. Let me know how it goes.Regards,Rivgil"]},{"symptom":"Windows can't detect bluetooth headphones        I can't get Windows to find my new bluetooth headphones, despite Windows being able to find and connect with various bluetooth devices. Same thing with the headphones: they connect fine to everything else but my laptop.Windows simply can't find the device when searching. It creates a list of 15-20 'Unknown' devices and I tried to connect to every single one of them, hoping it was the headphones. No such luck, and other devices (like phones) still detect the headphones by its correct name.So far I've tried the following:- Updated the network drivers- Made sure that the computer can be detected (in the bluetooth settings)- Changed the Bluetooth Support Service to start automatically (instead of manually), then restarted itI made sure to restart the computer after each of these changes, too.I've combed the headphones' manual to see if laptops require a special procedure but it doesn't. There's nothing about installing drivers: it's just supposed to be detected and then connected.Details:OS: Windows 10, 64-bitNetwork adapter: Broadcom 802.11nHeadphones: ATH-S700BT (Audio-Technica)","solutions":["Hi,Thank you for posting in Microsoft Community. I understand your concern and I am glad to assist you.Before we proceed, I need more information to help you better: • Do you receive any error code or error message, while you try to connect the Bluetooth headphone?This issue might occur if there are no Bluetooth drivers installed or if they are corrupted or outdated or incompatible. Windows 10 changed the status text in the Settings app for Bluetooth devices.  Bluetooth devices will only show as “Connected” when the device is actually in use and transferring data.  When the device is not active, the status will show as “Paired”. You may try the below suggestion and check.1. Go to control panel-device and printer-hardware and sound2. double click on the icon on my headset3. switch to \"service\" tab4. turn off \"hands-free telephony\"5. click okLet’s try to refer to the suggestions given by Nachappa C K replied on December 20, 2015, to fix your issue.http:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-hardware\/paired-headphones-will-not-connect-to-bluetooth\/509bb7e2-4a26-4702-bd85-fc2ebe5f8232•If the Bluetooth is turned on, and the driver is up to date, but your device still doesn’t work, try removing the device and re-pairing it. Here's how: Go to Start, enter Devices, select Bluetooth, select the device, select Remove device, and then try pairing again.•Make sure that the Bluetooth-enabled audio device is on and discoverable. How you do this varies with devices, so check the info that came with your device or go to the manufacturer’s website. Also, ensure that these services are active, automatic and enabled. \"Bluetooth handsfree service and Bluetooth support service\".Please feel free to contact us, if you face any issues with Windows. We are happy to help!","Hi JoyI don't receive any error message because the computer can't 'see' the headphones. Therefore I can't pair them to begin with. So far, two phones, a music player and an iPad can detect the headset in their respective bluetooth settings (all by the headphones' name) but Windows fail at this.Concerning the suggestion in Control Panel: there is no 'My headset' option under Hardware and SoundConcerning the two suggestions from another topic:• The device is not paired with Windows so that's not the issue. Bluetooth is on and with newly updated drivers.• That's not possible seeing as it's a headset. As mentioned earlier, it works fine with other devices: I'm pretty sure it's functioning and discoverable. It blinks when waiting for a connection and that's where you need the not-yet-connected device so that you can tell it to pair with the headset. Windows simply doesn't see it: it can see my phone, TV, and an endless list of 'Unknown: Ready to pair' devices but not the headset.Concerning the services: They are both active, running and automatically enabled. The only thing I noticed about them was that they're both 'Automatic (Trigger Start)' in Startup Type. Does this make a difference?Also, my partner just mentioned that he's facing the same problem with Windows 10 (also a bluetooth headset, just a different brand) despite Windows working fine with other bluetooth devices (and likewise, his headset pairs with everything else). There must be something about headsets that Windows 10 can't figure out.","I still haven't got an answer for my last reply, and I haven't been able to figure it out on my own.The issue is still Windows 10 not being able to find the headphones, thus making it impossible to pair them in the first place. Windows detects and pairs with other Bluetooth devices, and the headphones can connect to phones without any problems.","Hello,Thank you for keeping us posted.I really appreciate all your efforts in trying to fix this issue.There might be a possibility that this issue might have occurred due to various reasons. For exampleIncorrect Bluetooth settings.Some third party program or application conflict.The Bluetooth drivers might have gone corrupt.I would suggest you to try the following methods and check if it works.Method 1:To diagnose the problem with the hardware, we need to run the hardware troubleshooter and check.Run inbuilt Hardware & Device troubleshooter and check if it works.Please follow the steps given below.Note: If your computer is having problems with a recently installed device or other hardware, try using the Hardware and Devices troubleshooter to fix the problem. It checks for common issues and makes sure that any new device or hardware attached to your computer was installed correctly.Press Windows + W keys on your keyboard to get the search option.Type Troubleshooting and clickTroubleshooting.Now click on view all option.Click on Hardware and Device and follow the prompts to run the troubleshooter.If the issue persists, follow method 2Method 2:Please refer to the article given below and check if it helps.Why isn’t Windows finding my Bluetooth or other wireless device?http:\/\/windows.microsoft.com\/en-US\/windows-8\/why-isnt-windows-finding-deviceNote: Please ignore the title and follow the troubleshooting steps.Also I would suggest you to update the sound and the chipset drivers on the system and check if that helps.All the above steps holds good for Windows 10 as well.I hope this information is helpful.Please do let us know if you need any further assistance, we will be glad to assist you.Thank you.","Hi JayantI'm afraid neither of the options works.Method 1 (Hardware Troubleshooter) is dysfunctional because it keeps asking me to restart the computer to install updates. I've done this over 10 times, I'm 100% sure nothing needs an update but the troubleshooter claims otherwise and won't let me continue. It doesn't specify which driver is out of date and thus I'm stuck.Method 2 (the link) does not work. I get redirected to the Danish version of Windows and the title doesn't even match (it just goes to a page named 'Connect to a bluetooth device'. I can't access the link by hiding my IP adress and I can't find it on Google either.Can you copy paste the information or screencap them so I am able to follow the troubleshooting steps?","Hello,From the description, I suspect that the problem might be with the device compatibility on Windows 10. Suggest you to try connecting on different computer either running with Windows 10 or any other windows operation system to see if it works fine. This will give us the clue on the root cause of the issue.","Hello,          I usually watch some online-exclusive shows on my ipad, but recently, the site's video player has been changed to one not compatable with IOS.  I loaded the site on my laptop, and went to connect my headset. Same problem as you.  I have looked at so many forums and \"tips\" and when I found your issue,  I found that it was the exact same as mine.  I have no solution nor any idea what one can be, but I wanted you to know that you are not alone.","Hi,SpiritX MS MVP, one of the Community Insider, posted a great solution on this issue today.Go ahead and give it a try. Just click here to see the details of the thread.Let us know how it went.Regards,Joanna","Hey Nathan, thanks for writing! It's always comforting to know that you're not alone about a problem, you always feel kinda crazy when no solution online helps you and you've googled it to infinity","Any word on this issue yet? I am having the same issue. I may just have to call up Microsoft and see if they can work it out."]},{"symptom":"KB3095308 not installing on HyperV Server 2012        We are having a Dynamic memory issue on one of our VM where it's not increasing automatically on HyperV Host version Microsoft HyperV Server 2012 R2 6.3.9600.  I googles and found an hotfix KB3095308 for this issue but whenever I tried to install it on my hyperV host it gives me the following error:\"Windows Update Standalone Installer, The update is not applicable on your computer.\"I downloaded the KB from below link:https:\/\/www.catalog.update.microsoft.com\/Search.aspx?q=3095308Please guide me how to install this update to resolve my dynamic memory issue.","solutions":["Your question is outside the scope of this Community.I suggest that you repost in the TechNet Hyper-V Forum.https:\/\/social.technet.microsoft.com\/Forums\/windowsserver\/en-US\/home?forum=winserverhypervOr in the TechNet Server Forums.http:\/\/social.technet.microsoft.com\/Forums\/windowsserver\/en-US\/home?category=windowsserverTechNet Forums: https:\/\/social.technet.microsoft.com\/Forums\/en-US\/homeOr MSDN Forums:https:\/\/social.msdn.microsoft.com\/Forums\/en-US\/homeCheers.","Hi Mansoor I am sorry, Community is just a consumer forum, due to the scope of your question (Server 2012) can you please post this question to our sister forum on TechNet in the Server 2012 section (linked below)Over there you will have access to a host of Server 2012 experts and will get a knowledgeable and quick answer to this question . ..https:\/\/social.technet.microsoft.com\/Forums\/en-..."]},{"symptom":"Duplicate 'Documents' folder in Windows 10  Pro (1909)        Hi,I have two 'documents' folder under the user name. One has a different folder symbol and has all the files, the other one with a standard folder symbol and blank. when I delete the blank one, both of them are deleted. Is it possible to get rid of one? ","solutions":["Hi timarli_sipahi Click your Start Button, type regedit and hit Enter to open the Registry Editor Click View and make sure 'Address Bar' is turned on Paste this into the Address Bar at the top and hit Enter HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell FoldersPlease provide a screenshot of that Registry Editor window . . .","hi,many thanks for prompt response. please see below screenshot of the regedit","Hi timarli_sipahi and thanks for reaching out. My name is Joseph. I'm an independent adviser. I'll be happy to help you out today.I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/www.tenforums.com\/general-support\/81050...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Why can't I stream videos from FoxNews.com?        Firefox is my default browser.  I am unable to stream videos from the FoxNews.com website.  It will work on Microsoft Edge, but not Firefox?  I want to know why and what I can do to fix it?","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.It is almost certainly due to the video format they are using, firstly make sure Firefox is updated to the latest version, then have a look at this troubling shooting guide for video playback, firefox should be supported according to their documentation:https:\/\/help.foxnews.com\/hc\/en-usRegards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","My Firefox is up to date and is allegedly supported by Fox.  When I try to stream an embedded video, it just circles and circles.....Is there a media player that I should be using?  I can stream on Chrome and Edge, but I don't want those browsers to be my default.  Very frustrating.  I do thank you for your information","Unfortunately if you have the latest version there isn’t really any reason why it shouldn’t work. The only other suggestion I can give is to try clear the browser data from the setting menu in Firefox."]},{"symptom":"All files lost        My laptop said restart after avg update which  no problem done many tines before. Bit when it restated just a blank screen for hours.  I was told set it to recover then all of a sudden it went off and windows 10 had dissapeared  with all my files photos in fact eveything has gone and windows 10 changed to windows 7?i am lost how can windows 10 change to 7 and all my life  files photos emails everything vanished","solutions":["Hi kev975 Did you perform a Windows 10 Reset? Open File Explorer, then navigate to your C Drive Is there a Windows.Old folder on that drive, and if so, inside that should be a users folder, are your files in there?","Hi thanks for your reply it changed from 10 to 7 and everything that was windows 10 has gone all my files email account photos etc.  All that is there now is windows  7 like a basic computer with nothing."]},{"symptom":"Windows 7 to Windows 10        I recently purchased a HP Windows 10 desktop.  I had a Dell Windows 7 desktop for 12 years.  I purchased WD Easystore portable backup hard drive and copied my files from W7.  I'm have great difficulty transferring from my Easystore onto my new W10 desktop.  What am I missing?","solutions":["For files, you could just copy them into the hard disk and paste them into new PC.You couldn't transfer installed programs and you will need to reinstall them.","Programs should be reinstalled from the original media (DVD, download, etc.).You can't copy\/paste installed programs from the programs folder and think that's it, as when a program is installed the files are spread throughout the operating system, in the registry and file association for other programs, etc., etc.You should also check with the program manufacturer to see if programs are compatible with 10.If they aren't:Make older apps or programs compatible with Windows 10https:\/\/support.microsoft.com\/en-au\/help\/15078\/windows-10-make-older-apps-or-programs-compatible_____________________________________For data:The simplest method is to copy\/paste your data files to USB flash drive > then plug flash drive into Windows 10 > copy\/paste files through File Explorer on 10.Or read through this Microsoft information:Move files off a Windows 7 PC using Backup and Restore.Applies to: Windows 7 Windows 10 https:\/\/support.microsoft.com\/en-au\/help\/4469209\/windows-7-move-files-off-pc-using-backup-and-restoreMoving to a Windows 10 PC.Applies to: Windows 10Windows 7Windows 8.1https:\/\/support.microsoft.com\/en-us\/help\/4229823\/moving-to-a-windows-10-pc@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Microsoft has partnered with this company back from the XP > 7 days.Personally I don't use it.It does not come for free: https:\/\/www.microsoft.com\/en-us%2Fwindows%2Ftransfer-your-dataMove your files, folders, and more to your new Windows 10 PC for only $14.95.* Microsoft has partnered with Laplink to provide you with a special offer – for a limited time, save 50% off the regular price of $29.95 for PCmover Express.@@@@@@@@@@@@@@@@@@@@@@@@@@@But that program does go further to move programs for more money with the Professional version $44.95.https:\/\/pcmover-10.laplink.com\/index.html#proCheers."]},{"symptom":"Error 0xc004f050 issue        Hi,I'm attempting to activate a fresh install of Windows 10 Home N by upgrading a HP Mini which has a OEM Windows 7 Starter Licence (Windows 7 SNPC OA). It is my understanding that a Windows 7 Starter machine could be upgraded to Windows 10.The OEM licence sticker is still on the netbook however I'm getting a 0xc004f050 error. Automatic activation also didn't work prior to me entering the key manually. None of the hardware has been changed.It's not a major issue however I was planning to donate the machine to a non-profit as I no longer require it.","solutions":["Hi Kelly, What I can suggest is to do Clean Installation for your machine instead. Please follow this article: https:\/\/www.windowscentral.com\/how-do-clean-ins...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"System revert        Hi, how do I revert system to a previous date please?","solutions":["\"How to Do a System Restore in Windows 8 and 8.1\"http:\/\/www.eightforums.com\/tutorials\/4692-system-restore-how-do-windows-8-a.html","Thank you very much :)","You are welcome.Cheers."]},{"symptom":"Public Sharing        I have three machines on a wired home network, all running Windows 10 1909.  All three are part of the same Workgroup, all three have Public Sharing turned on, yet Istill can't get this to work properly.  Machine's One and Two won't show any other connected machines.  Machine Three will show itself and One, but not Two.  It also allows access to my user account folders, which Idon't want.  Only the Public folders should be shared.Can anyone help?","solutions":["First;  in Windows 10 there is no Workgroup. Second;  go Settings, System, Shares experiences.","Hi Jim, Using this method to share files, you can quickly make available music, documents, pictures, and videos with other users without having to go through complicated setups. However, it’s worth noting that this is meant for home or really small networks, if you’re trying to share content on your organization this is not the correct route to do things.Please refer to this article for complete guide: https:\/\/pureinfotech.com\/public-folder-share-fi...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Thanks guys.What I'm trying to say is that those instructions do not work.  I'm not a coder or network expert, so I haveno idea why the process doesn't work, or how to troubleshoot it.Homegroup just worked.  This new process...doesn't.Can anyone help?"]},{"symptom":"I have a newcomputer and cannot get my WOWWAY email accounts to work. I need to be able to specify the ports for both the pop3 and smtp.        How do I specify the ports for the mail app to use? I need a pop3 port of 110 and smtp port of 587.","solutions":["Hi Arthur, Please follow this article for detailed guide on how to setup your mail app. https:\/\/www.howtogeek.com\/226010\/how-to-configu...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]}]}