{"windows":[{"symptom":"Windows 7 to Windows 10 upgrade fails and rolls back - 0x80070002 - 0x2000D        Hello, I'm trying to troubleshoot a failed Windows 7 to Windows 10 upgrade.  The hardware is a stock Dell Optiplex 9020.  The upgrade install survives its first reboot, but fails in the second phase at 20 some percent, and rolls back to Windows 7.  The error message is:0x80070002 - 0x2000D - The installation failed in the SAFE_OS phase with an error during MIGRATE_DATA operation.  The first time this happened, the log files mentioned Virtual PC 2007, which I re-installed and then uninstalled.  I no longer see that in the log files, but the error remains.  I am struggling to find the root cause and therefore a solution.  Panther logs linkRollback logs linkI appreciate any tips!  Thanks!Dan","solutions":["Hi, PTSDan My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Check this link, I hope it helps https:\/\/www.thewindowsclub.com\/safe_os-phase-du...If you have a third-party antivirus, you must disable or uninstall it. You can also download the Windows Error Solver: https:\/\/support.microsoft.com\/en-us\/help\/10164\/...https:\/\/aka.ms\/wudiag You can do it manually by downloading the Windows ISO. When updating with the ISO, disconnect the Internet. https:\/\/answers.microsoft.com\/en-us\/windows\/for...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thanks Jeffrey, I had done all that.I figured it out... this line in the error log stood out to me:2019-11-11 13:30:54, Error                        Unable to open store at C:\\$WINDOWS.~BT\\Store\\MachineSpecific: Win32Exception:C:\\C:\\Program Files: The system cannot find the path specified. Notice the double C:\\C:\\Program Files.  It didn't make sense to me how that was possible, UNTIL I saw a folder in the root of C:\\ called %programfiles%.  It looks like an application tried to install itself using the variable, but took it literally.  Windows Setup took the literal name and tried to put it back to the variable value... thus, C:\\%programfiles% became C:\\C:\\Program Files!  I delete it and all is right in the world again!Thanks,Dan","Then you could do the update","Yes the update to Windows 10 completed successfully.","I'm glad you could solve the problem"]},{"symptom":"changing system language        about changing system language i can not find english format ,it just has chinese one so is there any data i should download or instal it to issue this ?","solutions":["Hi milad_73 It depends on a few factors . . . Was that device purchased in China? Open the Settings App (gear icon on your Start Menu) Go to System - About What is the exact Edition of Windows 10 reported on that page, is it Home, Home Single Language, Pro . . etc.?"]},{"symptom":"Administrator Rights not Accessible        I am still not able to access administrative rights on windows 10.  My security settings were reset on my MS account but that had no impact.  I tried using the super admin rights under windows 10 pro but it asks me to sign in as an administrator.  In order to establish\/create administrative rights, I have to have administrative rights...catch 22.","solutions":["Do you have any access to any administrator account?How did you lost your administrator account?Is your administrator Microsoft Account or Local Account?","Hello Rick109, I'm Didi, an independent advisor. Try to follow this guide to get your administrator rights back : https:\/\/www.kapilarya.com\/fix-lost-administrati... Regards, Didi ---------------- Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Do you have any access to any administrator account?How did you lost your administrator account?Is your administrator Microsoft Account or Local Account?I do not have any access to any administrative account.Not sure how I lost it....the pc is new and I went through the installation\/configuration as required by LenovoIt's the administrative account on my local machine; I can access my MS account.","Hello Rick109, I'm Didi, an independent advisor. Try to follow this guide to get your administrator rights back : https:\/\/www.kapilarya.com\/fix-lost-administrati... Regards, Didi ---------------- Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Thanks, I'll give it a try.","The system would have at least one administrator account?Do you know its account name?What happens when you attempt to login with that account? It is okay, if it is local account."]},{"symptom":"What can I do when i have been a victim of online abuse?        what can i do when i have been a victim of online I was fired today for going to my boss because I was being harassed* Original title: abuse","solutions":["Hello! My name is Marco... Sorry to hear that ... :( Depending on where you live, you can contact your city police to take steps and \/ or a court lawyer. It would be the best thing to do.","thank you I did fill  out an ic3 form for the FBI internet crimes unit, bit I have had no reply. And it is now too late. my proof lies in social media sites that have given me a hard to to access my  accounts , that's even if I can get in them.and when I do come across something it disappears. So I am looked at as though I am crazy.Microsoft took my laptop and replaced it with a new one but i have a back up","The best thing to do when you are experiencing harassment is to take a screenshot and keep the photo in several places, for example: on your phone or on a cloud drive.To quickly take screenshots with selection, open the windows start menu and type \"snipping tool\"","Thank komb,  In response to your reply I have  Tried   That . Unfortunately I could not find them in my laptop. Thank you keep that Mind. ","Hello! Probably you can no longer access the messages if the person to delete their messages if it is written on the public space, or you have been blocked. If these are private messages and you no longer have access to them on your side, if your complaint is successful, the authorities can go and see the side of the harasser for the messages. Good day and happy new year! :)"]},{"symptom":"Bluetooth appear and then the driver disappear and there is no Bluetooth bottom        hello I have problem with Bluetooth when I start the device sometimes I didn't have problem suddenly the Bluetooth button disappears and I check the driver from device manager others no driver I tried to install the driver from my laptop company official website but the problem not solved I opened blutooth troupelshotit from win 10  it said there is no blutooth driver.  also, I tried to update win 10 to solve the problem but it didn't work when I restart the win10 the blutooth appears and the driver backs it's too weird I don't know whats the problem can anybody help me?","solutions":["Hi moiadotoom and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"Is it legal to install windows from ISO file?        If we have a legal purchased copy of Windows installation CD\/DVD disc. We can create an ISO from that disc for using in future times. Is is legal to install any version of Microsoft Windows through ISO or bootable USB in multiple laptops and computers?Thanks","solutions":["Hi Chris,You may record it. Strike against a video is triggered mostly due to \"alleged stolen content\". As the Installation media is yours uploading a video is Installation is not illegal and probably would not be taken down."]},{"symptom":"How can I turn off sleep mode on my printer ( HP office jet 5252        How can I turn off sleep mode on my printer?  Janice","solutions":["Hi Jans. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.For printers that have Sleep mode, you can't turn it off but can set it to go longer before it sleeps. See here:https:\/\/support.hp.com\/us-en\/document\/c04183583Hope it helps.","Also if it goes to sleep and you want to print it will automatically wake and print.  At least my Epson printers do.","I would like to turn it off,  my pc is in direct like of my bed and that panel really glows during the night.  Janice","I meant line of my bed......"]},{"symptom":"I can't share files between two identical windows 10 setups on a local network        I have two computers in my house on a local network, both of them are running fresh installs of Windows 10 version 1903. Both of them have password protected sharing turned OFF, both of them have network discovery turned ON, both of them have file and printer sharing turned ON, both of them are logged into Windows with the same Microsoft account, both of them are admin, both of the drives I'm trying to share have sharing turned on to all users in drive properties sharing section. On one of the computers I can go into my other drive with no problems and take files off of it, on the other if I try this it asks for a password, my microsoft credentials do not work when I type them in, and nothing happens whatsoever.What could possibly be going wrong?","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query regarding file sharing over the internet. I’ll help you with the issue. I would like to inform that on the first connect, the PC will ask for a password for authentication. One of thing that I can suggest you is to try entering the Device name and password when you receive the prompt. To check for the Device name, go toStart >> Settings >> System >> About. If that doesn’t work, try the steps mentioned below: On the computer for which you are being asked for password, typecommand prompt in the search bar on the Taskbar.Right click on the command prompt icon, and selectRun as administrator.Now, type whoami and hit Enter.You will get the name of the device, try using the name as the username and use the computer password. For additional information, see File sharing over a network in Windows 10. Let us know the results.  Regards,Nikhar KhareMicrosoft Community - Moderator","I tried typing in the device name followed by the pin number I use to login normally, it worked for accessing the computer generally, but for some reason it is telling me that I do not have permission to access the slave drive that I keep all my shared files on. All the sharing options are enabled and in advanced settings on the drive it is shared with full permissions for everyone. I don't understand why I can't access it. "]},{"symptom":"New PC build new window usb not installing        Built my son a new gaming pc, have done a few of these but brand new windows usb install key wont install, will make a new key but hoping issue is fixable as new key not cheap","solutions":["Hi FarStarling6694 Did you create that USB bootable media yourself? What is the exact error you are getting, is your system not booting from that media or does it boot and then produce an error?You can create a new bootable USB key on a blank USB drive at no extra cost, there is no need to purchase another one . . .Click this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), you can create a bootable USB flash drive (min 8GB) using that tool","Thanks for answering,  I did what you said, created a new usb and it worked first time, thanks for taking  the time to answer,  much appreciated ","Glad to Help!"]},{"symptom":"Display adapter problem        I had recently installed amd graphics driver but it caused problem . So I unistalled it . i also have a intel hd 3000 driver . But it's because my display adapter has been microsoft basic display adapter . Now how do I switch to intel hd 3000?pls help!!!! ","solutions":["Hello tusharshahriar, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemDo you have a laptop or a desktop? which model exactly? There's no Win10 driver from Intel directly to this chip. but it should be available in Windows update.You can download Inter detection tool which will scan your PC for suitable drivers and update them in this link:http:\/\/www.intel.com\/content\/www\/us\/en\/support\/...If it didn't work, try this link: https:\/\/www.catalog.update.microsoft.com\/Search...Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolvedCheers! Farah","Mine is ell inspiron n4110 core i5 3rd generation intel hd 3000ram : 4 gbSo i don't  need update . I only need to work intel hd 3000 display driver .display is microsoft basic display adapter . I need to change it to intel hd.","If the Microsoft Basic Display adapter is selected, it means that one of the Graphic adapter is not updated. If you don't want the AMD adapter to work, simply disable it in Device manager.the Intel display adapter should work right after. If not, Can you post a screenshot for Device manager, were both display adapter are shown?","here is the screenshot . Didn'nt work","The basic display adapter is the AMD Radeon, but since it does not have the suitable driver, It gets only the basic display adapter from Microsoft. now since If it's disabled, it meas that you Are running on the Intel HD3000.I'm not sure exactly what do you want now, do you want to reinstall the AMD Radeon driver, or what exactly is the problem?","you can notice that my resolution is low . It's mean intel hd 3000 is not working . you can see another photohere my display driver is microsoft basic display adapter why??!!","You've mentioned in the beginning, that you had problems with your AMD driver,which driver have you tested? This is the latest driver from AMD website, if you haven't already tried it, Please go ahead and download it.The basic adapter is a generic driver that Microsoft assign to adapters which does not have a driver yet. and it remain there until it gets a suitable driver.","You've mentioned in the beginning, that you had problems with your AMD driver,which driver have you tested? This is the latest driver from AMD website, if you haven't already tried it, Please go ahead and download it.The basic adapter is a generic driver that Microsoft assign to adapters which does not have a driver yet. and it remain there until it gets a suitable driver.Went to Fujitsu and requested driver update - seemed to fix it.  Not sure how these driver downloads work, seemed complex at first, but probably a case of choosing the right provider.\/  But how do you know whom is right for your machine?  Do you go to Microsoft, or an independent, or your anti-virus provider, or the machine manufacturer?  I am sure I am not the only person confused over the options.Cheers, Richard. ","I have tried all the website I can find"]},{"symptom":"WINDOWS 10 -- Photos App Why cant I use my arrow keys to scroll through photos in a folder?        Okay, so i have a folder on my desktop with some pictures in it.I open a photo in the Photos app, (default windows 10 photo viewer) and I can't use left\/right on my keyboard. The program makes me use the mouse to hit the left and right buttons manually, when it would be 100 times simpler to just hit left and right on the keyboard.I have another computer at home that runs windows 7  so i am used to the convenience of my computers actually working, LOL!Anyone have any ideas how to unlock the buttons so I can just hit left and right on the keyboard?Been looking at other forums and this looks like a common problem that has NOT been solved by Microsoft.HELP!","solutions":["Hi Ellet,You can still use the arrow keys to navigate your photos by using the arrow keys. To do this, kindly follow these steps:Open the folder.Double click the photo.Press the arrow keys to look through your photos.This should help you in resolving this concern.","Thanks for the advice, but unfortunately, that solution does not work for me, as that is what I initially tried to do.For me, the left and right keyboard keys do nothing when you're viewing the photo.When you're in the folder, left and right arrow keys can move from picture to picture, but it does not when you're looking at photo viewer.The only way to change the photo I'm viewing is to use the mouse to click on the left or right arrows on the screen.I am hoping for a better solution, one that actually fixes the problem.Any one else having this issue? I saw other forums discussing it, but it was never really solved.","It sounds like a device driver problem but I assume you've determined that the arrow keys work correctly in other applications.  Are people reporting the problem in other programs as well?","Maybe it is corrupt files in the folder.  I didn't know how to solve the problem, so I went back to windows 7. Everything is working great on this OS.I'm not sure what the problem was before,  I'm just glad it's working now. Thank you everyone for your help! ","I have been having this identical problem since PHOTO first came out. Sometimes the right and left arrow work and sometimes they do not -- thus it is clearly intermittent.  The right and left arrows displayed by PHOTO show up but are grayed out (see snip example below). Thus his has nothing to do with the Right or Left arrow buttons on people's keyboards not working. The folder with this photo has 11 other JPG files (see snip example below). My only clue to the problem is that the folder is in my DROPBOX folder. However, in other DROPBOX folders, PHOTO works fine. I did copy this same photo folder to a new location outside of DROPBOX and right arrow on my keyboard worked (and the grayed out arrows were no longer grayed out). Thus the problem may relate to DROPBOX but this is no conclusive since (as I mentioned above) sometimes PHOTO works fine with other DROPBOX folders.This problem has been around since I first started using WINDOWS 10 and PHOTO and is incredibility frustrating. Any help would be appreciated. Thanks.GaryGRAYED OUT ARROWS12 FILES IN FOLDERS","This solution might work.  Also you could try selecting all (<ctrl>A), right clicking and selecting Open (you can also just hit <enter> to start at the first photo). Edit: Here's something that addresses DropBox specifically although it should apply to everything.","Has anyone found a solution to this?  I'm getting the same issue with intermittent left\/right arrows on screen working or not working.  On top of this, when I double click two or more photo's, I'm getting multiple copies of the Windows 10 photo viewer opening.  I'm sure this used to work perfectly when I first installed Windows but couldnt tell you at what point in time it change.  The question is, how do I get it back to working as intended?","Hi Matt,To better assist you, we'd like to verify if you've tried the steps created byTomMartinWC above?Looking forward to your response.","Well, first of all Tom's solution link related to an indexing issue to do with Google Drive.  Nothing to do with right-left picture buttons not working.  I tried it anyway on the off chance that it had some effect, but of course it didnt as its not related.  Second, pressing CTRL-A to select all pictures then pressing enter did work to view all of the pictures selected, but this isnt the way its supposed or expected to work, nor is it the way it works all the time either.  Sometimes I can double-click a single picture in a folder of pictures and can use right-left with no issues.  Many other times this doesnt work and I end up with a separate instance of the Photo viewer app for each picture I double click.The expected behavior is that when I open a picture in a folder of pictures, I should be able to right-left select pictures from that point. ","The trouble is that your problem has no clear solution (search for \"arrow\" and \"arrows\" and you'll see what I mean).  You may want to read the dozens of posts to try everything that's been suggested but otherwise we need to experiment with things since I can't reproduce your problem.  It's fine if you don't have time for that.The most successful approach seems to be re-indexing so it was worth a try.  The <ctrl>-A is just a workaround in case you don't want to troubleshoot any further.  You may want to try a reset:    Start Menu\/Settings\/System\/Apps & features\/Photos\/Advanced Options\/ResetIf that fails, try to find a pattern.  Does the same folder malfunction every time, regardless of which picture you choose?  Do you see the same problem with albums?  When you see the problem, write down which picture is displayed and try again each day to see if it's intermittent.Finally, when you say \"double click two or more photos\", exactly what are you doing?  What I do is double click while selecting the last picture via <ctrl> or <shift>."]},{"symptom":"Windows Update        After the last FRORCED Windows 10 update my PC is SUPER SLOW, WHY you force Update on people and destroy there PCs.I DON'T WANT YOUR FK UPDATES which destroy my PC and my WORK.YOU destroyed already work worth 50000 Euro, by updating while my PC is running. AND YOU CHANGE my settings with your fk update so even after invested unpayed work setting you fk update time in the night you reset this **** and your update is destroying work again.If I could sue you I would do it, for destroying so much work.FIX my computer like this I can not work and you destroyed again MY MONEY. MY PC  was fast and now barely responding, don't tell me sht about freeing memory and disk space all was setup perfect!!!!!!!!!!!!!!!!!!!!!YOUR fk update is just destroying my system ALL THE FK TIMESincerely Martin","solutions":[]},{"symptom":"Windows Update        After the last FRORCED Windows 10 update my PC is SUPER SLOW, WHY you force Update on people and destroy there PCs.I DON'T WANT YOUR FK UPDATES which destroy my PC and my WORK.YOU destroyed already work worth 50000 Euro, by updating while my PC is running. AND YOU CHANGE my settings with your fk update so even after invested unpayed work setting you fk update time in the night you reset this **** and your update is destroying work again.If I could sue you I would do it, for destroying so much work.FIX my computer like this I can not work and you destroyed again MY MONEY.Sincerely Martin","solutions":[]},{"symptom":"new installation        hi,I would like to change my HDD on a SSD in my laptop, do you know, if I new install my laptop, does I have to buy a new windows 10 license or not? Thank you for the answers!","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.You do not need to buy a new license. Your current license is linked to your mainboard - changing other things (such as hard disc, ram, etc.) makes no difference.Before you reinstall make sure your activation is shown as a digital licence just to be sure. When you do the reinstall you can skip entering a product key - just be sure to choose the same version of Windows as you currently have (ie. Home or Pro).The instructions here give some more details about how to handle this: https:\/\/support.microsoft.com\/en-us\/help\/20530\/... Regards, David"]},{"symptom":"One Drive        Hi,I cannot access one drive on my PC .... I think it maybe something to do with my email address which is going out of use and I have had to change it on all my accounts (itunes being the worst to change) but one dive will not let me and I don't know why. I pay MS monthly for this account and its annoying not being able to use it, all my ms accounts through my 2 laptops are ok, anyone help please .....","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please check if you can log in to your One Drive account at the OneDrive website https:\/\/www.onedrive.com If you can log in to OneDrive website, please back up your OneDrive folder in your computer and Reinstall the OneDrive App."]},{"symptom":"Empty Windows defender security and error startup messages        Hello,I wanted to enable the periodic scanning feature in Windows defender for double security(since i already McAfee installed)but it's completely empty, like the image belowso I try to enable Windows Defender in \"services\" screen, but showing the error message.What's wrong with the message? i heard the windows defender will be automatically disabled when you got a third party antivirus software installed, but then you will get another option in windows defender, the \"periodic scanning\" as an extra layer of protection, but i don't have that option available on my windows defender panel, plus my windows defender is completely empty, please helpPlus, I also got two error messages from startupshow can i solve these problems? please helpThanks","solutions":["McAfee isn’t doing a good job imo if it allowed a virus through. I recommend keeping Malwarebytes, Eset online scanner & AdwCleaner as on-demand scanners & run them once a month at least.If you don’t have any further questions please feel free to mark one of the replies as the answer &\/or rate my help: 1 star means you are very unsatisfied with my help and 5 stars means you are very satisfied with the help I gave you."]},{"symptom":"Microsoft Treasure Hunt is Broken (since update)        Hi,since the game was updated to a Win 10 version it is severely broken! Even ignoring all the crashes\/freezing that was present in the Win8 version.The main issue is that the game offers no upgrades in the shop for dynamite \/ map \/ picks if you have purchased one of the heart upgrades.I currently have the 4 heart upgrade and after visiting the shop 30+ times (I lost count) all it ever offers is 5 hearts for 125,000 (even in the shop on lvl6) or shields.I only have 4 capacity for map\/dynamite\/pickaxe - so it should have offered me one of these upgrades at least once!!I tried deleting the Local State folder contents to reset my progress but this caused the game to crash repeatedly until I assume it synched with the cloud and I was back to where I was :(is there a way to fix this?!?!?","solutions":["Hi metallicafan459 I'll try to help you on this issue. Have you already tried to uninstall the app, and reinstall it ? Here is a link with various solutions to fix a game store issue : https:\/\/support.microsoft.com\/en-us\/help\/402749...I'll wait for your news Regards","Hey Jay,Thanks for the reply. I luckily stumbled onto these steps which so far have seemed to have worked!it resets all progress but at least the upgrades are now showing in the shop for purchase!1. Quit app.2. Disconnect Internet.3. Go to Windows Settings -> Add or Remove Programs.4. Select MS Treasure Hunt (don't remove it)5. Click on Advance Options.6. Click on Reset (this should delete your local save)7. Play a bit of the game.8. Quit app.9. Reconnect Internet.10. Play the game.Choose to use Local Save.","So, is your problem solved ? I hope so :) Regards","It means i have to start all over again - but at least now the shop sells upgrades!! Ideally this problem needs to be fed back to the developers to fix!","I've noticed the same thing (haven't seen a capacity upgrade in eons, although I'd never put together that it was after I bought a heart upgrade; I've picked up both the hearts) and happened across this post while searching to see if there was a known issue somewhere. Does your solution essentially mean that you can NEVER buy a heart upgrade until you have all the other upgrades? If so... ugh.","Yep - sadly so! Makes the game harder only having the three hearts to try and get all other upgrades first - plus the fact you have to start over! :("]},{"symptom":"Updates yet again        Hi all, just small update problem this time. Not having been able to download updates due to none being found for the last couple of years, (I have just simply reloaded 8.1 and carried on) I have jusy got rid of AVG antivirus, and lo and behold, suddenly I have updates coming out of thr woodwork. Started with 134 which downloaded and installed. Now I have a message when I shut down the laptop saying update and restart as an option.I remember a long time ago having the advice to hide the files that give trouble as they probably do not concern my laptop. I cannot remember how to do this. Can you help Please?Wickiwiz","solutions":["See if this assists you:How to Hide or Restore Hidden Windows Updates in Windows 7 and Windows 8https:\/\/www.sevenforums.com\/tutorials\/24376-windows-update-hide-restore-hidden-updates.htmlCheers."]},{"symptom":"I am trying to update a pc from Windows 7 to Windows 10.        I have purchased the software but the installation keeps getting stuck when it gets to the 'Getting Updates' part.  I don't get an error message just a constantly revolving circle of dots.  This is my fourth attempt.  Any help would be very gratefully received","solutions":["Hi Howard, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.When you try to use an Installation media, you would be presented an option to check for updates. The text would be something like following :Get updates Not right now Select Not right now which should skip the step."]},{"symptom":"External DVD burner non-operative after recent Windows 10 update        After updating my desktop computer with the latest (and last support update...?) my Memorex MRX-550le external DVD burner will not play or format CD's or DVD's... WHY?","solutions":["Do you require any further help?"]}]}