{"windows":[{"symptom":"My PC is overload        Hi there, im Johny DuoI need help to fix my PC, i was download an game but it too heavy so now i can start up myc PC, when I turn on it keep restart and dont let me use. I need someone tell me how to delete all file i have download. It very sad if I cant get access to my PC. Help me!Thank you!Johny Duo","solutions":["Hi Johny Duo Start your PC, just as Windows attempts to load (spinning dots), press and hold Power Button for 5 - 10 seconds to perform a Hard Shut DownDo this twice On the third start Windows will boot into the Recovery Environment and from there you can access System Repair, Safe Mode, Command Prompt . . . etc.Please try each option one at a time, then see of Windows will boot . . . Go to Troubleshoot - Advanced Option - Startup Repair See if Windows startup can repair itself Go to Troubleshoot - Advanced Option - System Restore Check to see if you have a restore point you can go back to If you do not have a Restore Point, go to Troubleshoot - Advanced Option - Startup Settings and click RestartUpon restart, press 4 to enter Safe Mode Once in Safe Mode, try to uninstall that game, and if that is not possible, delete the game files manuallyIf the above fails, go to Troubleshoot - Advanced Options - Reset this PC Choose to keep your files and apps, just your files or to keep nothing Then start the Reset","I can’t uninstall it so can i delete it in program files ? I try to uninstall it by Setting","Hi Johny Yes, find that in Program files and delete the game folder from there . ..","Hello DaveI have removed the game then I restart but I still can’t get access to my PC home screen, it said PC “didnt restart correctly”. Please tell me what do I gonna do next?Thank you!Johny","Hi Johny Please work through each option below . . . Start your PC, just as Windows attempts to load (spinning dots), press and hold Power Button for 5 - 10 seconds to perform a Hard Shut DownDo this twice On the third start Windows will boot into the Recovery Environment and from there you can access System Repair, Safe Mode, Command Prompt . . . etc.Please try each option one at a time, then see of Windows will boot . . . Go to Troubleshoot - Advanced Option - Startup Repair See if Windows startup can repair itself Go to Troubleshoot - Advanced Option - System Restore Check to see if you have a restore point you can go back to If you do not have a Restore Point, go to Troubleshoot - Advanced Option - Startup Settings and click RestartUpon restart, press 4 to enter Safe Mode Once in Safe Mode, backup your data if you do not already have a backup Open Device Manager and check to make sure all your Drivers are up to date Reboot to see if Windows will start Normally If the above fails, go to Troubleshoot - Advanced Options - Reset this PC Choose to keep your files and apps, just your files or to keep nothing Then start the Reset","Hi DaveWatch the picture below and tell me i there any problem in my device manager?Thank you!Johny","Hi Johny Sorry, that picture is not coming through, please try that again . . . You must click the button indicated below to upload a picture on Community .","Hi DaveHere are the picture, sorry for not paste the picJohny","Hi Johny Yes, you are missing a lot of device drivers on your syste, Every device with an exclamation mark beside it has no driver installed and is not performing optimally . . .You need to go to the support page for your PC on the manufacturers website, then form there, download and install a full set of device drivers, until you do that, your PC will not work correctly or optimally . . .","Hi DaveSo that why i can’t reset my PC? It keep say “Undoing change” when i resetting my PC. Please show me the list drivers I lost and tell me how to download them and fix. Ill fix it tomorrow because in my country is night time so im offline. Please read my question if i have!Thank you very much!Johny"]},{"symptom":"I can't redeem my Minecraft Windows 10 that was purchased before        I purchased Minecraft, and got the free Windows 10 Edition redeemable code. I redeemed that on my old PC, however I just purchased a new PC, and when trying to redeem the code, it says it has already been used. If anyone has some answers that would be great!","solutions":["Hi FlufferzTheCat, I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.Please ensure that you are logged on to the same Microsoft Account as your old PC on the new PC. Then check your Microsoft Store's order history to download Minecraft.For more detail on this solution, check out this article from a site that I like to use:https:\/\/support.microsoft.com\/help\/4027310Let me know if I can help you further!"]},{"symptom":"Office 2016 default Authentication window        Hi,We use smart card for user data encryption, mails are configured on different domain and does not use smart card credentials, whenever user changes the email password, the authentication window pops up with smart card as default login option, the user has to click on more choices to view outlook domain login password (username is saved). Is there a way to disable smart card login for outlook or set outlook domain\/username as default authentication. The main problem is user tries the outlook password on smart card and locks the smart card. i have tried disabling \"Turn on certificate propagation from smart card\" under Administrative template\/windows components\/smart card in gpedit.Thanks and RegardsAbdul Kader","solutions":["Hi Abdul. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I would ask this question at our sister forums for IT Professionals, Technet forums, as this is a consumer forum. Go here:https:\/\/social.technet.microsoft.com\/Forums\/en-... I hope it helps."]},{"symptom":"Can't access internet via ethernet        Hi, my desktop pc randomly stopped connecting to the internet, and windows 8.1 had for some reason created at least 9 local area connections. It had been working fine for months and nothing was changed before it quit(hardware or software).  I deleted these extra local area connections and am now left with just my Ethernet card as an option. I have been unable to get it to connect to the modem. Wifi is working on other devices. My pc does not have a wifi option.Things I have tried:- unplugging modem for 10sec+- rebooting pc- unplugging ethernet, checking cable(nothing has been moved or disturbed since working last)- windows troubleshooting connection(Ethernet does not have a valid IP)- ipconfig release\/renew via command prompt as an admin(renew times out)- netsh winsock reset, netsh int ip reset, ipconfig flushdns- rebooted in safe mode with networking(still no)- Ethernet ivp4 all set to auto...I can usually fumble my way through and fix pc issues, but it's been two days now... Would really appreciate some help.Cheers","solutions":["Hi, my desktop pc randomly stopped connecting to the internet, and windows 8.1 had for some reason created at least 9 local area connections. It had been working fine for months and nothing was changed before it quit(hardware or software).  I deleted these extra local area connections and am now left with just my Ethernet card as an option. I have been unable to get it to connect to the modem. Wifi is working on other devices. My pc does not have a wifi option.Things I have tried:- unplugging modem for 10sec+- rebooting pc- unplugging ethernet, checking cable(nothing has been moved or disturbed since working last)- windows troubleshooting connection(Ethernet does not have a valid IP)- ipconfig release\/renew via command prompt as an admin(renew times out)- netsh winsock reset, netsh int ip reset, ipconfig flushdns- rebooted in safe mode with networking(still no)- Ethernet ivp4 all set to auto...I can usually fumble my way through and fix pc issues, but it's been two days now... Would really appreciate some help.CheersYou can Try bellow steps1. Install new updated Ethernet Driver.2. Check Your DHCP server is working or not3. If your DHCP server is not working then assign static ip address in your Ethernet interface.i already made many tutorial in windows issue, just open youtube and search RajTech . or follow those link youtube.com\/rajtechtutorial or newslob.com  "]},{"symptom":"Microsoft store help        I recently got 3 months of Xbox game pass for pc, I downloaded a bunch of games but when they get close to finishing they give the error \"0x80070002\". please help.","solutions":["Hi Emilio. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything possible to repair the store. Even if you've tried a step please do it over in this sequence. If any steps cannot be performed then report it and move on to the next:1) Try updating Store apps: https:\/\/support.microsoft.com\/en-us\/help\/402625... 2) Make sure you have the latest Windows 10 version 1909 in Settings > System > About and if not skip to Step 10 to install it by the most stable method.3) See if the fixes here help: https:\/\/www.pcworld.com\/article\/3053099\/windows... 4) Try running the Windows Store apps Troubleshooter at Settings > Update & Security > Troubleshoot.5) Try resetting the Store cache: http:\/\/www.thewindowsclub.com\/reset-windows-sto... 6) If that fails go to Settings>Apps and highlight Microsoft Store, choose Advanced Settings, then Reset. After it resets, restart PC.7) If that fails then reinstall Store. Type CMD in Start Search, right click Command Prompt result to Run as Administrator, copy the following code and paste it into the box using the Edit tools from Box's top left dropdown menu, press Enter:PowerShell -ExecutionPolicy Unrestricted -Command \"& {$manifest = (Get-AppxPackage *WindowsStore*).InstallLocation + '\\AppxManifest.xml' ; Add-AppxPackage -DisableDevelopmentMode -Register $manifest}\"8) Clear the LocalCache Folder: Open Run by pressing the Windows key + R hotkey. Copy and paste %localappdata% in Run and click OK. Open Packages> Microsoft.WindowsStore_8wekyb3d8bbwe > LocalCache folder. Press the Ctrl + A hotkey to select all content within the LocalCache folder. Press the Delete button. 9) If these all fail then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account because of the serious and persistent problem with corrupted accounts. Then continue with the other steps to go over your install most thoroughly.10) If nothing else works then do a Repair Install, by installing Media Creation Tool and then choosing to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"old to new pc        I have pc with windows 7 and am going to buy a new pc ortower that has windows 10. how do i move everything? is there way to back up first, disconnect old pc and set up new pc to readd everything? yes i know a numb question","solutions":["You can't move \"everything\" including the operating system to a new computer, if you are referring to using a System Image Backup.Programs should be reinstalled from the original media (DVD, download, etc.).You can't copy\/paste installed programs from the programs folder and think that's it, as when a program is installed the files are spread throughout the operating system, in the registry and file association for other programs, etc., etc.You should also check with the program manufacturer to see if programs are compatible with 10.If they aren't:Make older apps or programs compatible with Windows 10https:\/\/support.microsoft.com\/en-au\/help\/15078\/windows-10-make-older-apps-or-programs-compatible_____________________________________For data:The simplest method is to copy\/paste your data files to USB flash drive > then plug flash drive into Windows 10 > copy\/paste files through File Explorer on 10.Or read through this Microsoft information:Move files off a Windows 7 PC using Backup and Restore.Applies to: Windows 7 Windows 10 https:\/\/support.microsoft.com\/en-au\/help\/4469209\/windows-7-move-files-off-pc-using-backup-and-restoreMoving to a Windows 10 PC.Applies to: Windows 10Windows 7Windows 8.1https:\/\/support.microsoft.com\/en-us\/help\/4229823\/moving-to-a-windows-10-pc@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Microsoft has partnered with this company back from the XP > 7 days.Personally I don't use it.It does not come for free: https:\/\/www.microsoft.com\/en-us%2Fwindows%2Ftransfer-your-dataMove your files, folders, and more to your new Windows 10 PC for only $14.95.* Microsoft has partnered with Laplink to provide you with a special offer – for a limited time, save 50% off the regular price of $29.95 for PCmover Express.@@@@@@@@@@@@@@@@@@@@@@@@@@@But that program does go further to move programs for more money with the Professional version $44.95.https:\/\/pcmover-10.laplink.com\/index.html#proCheers.","I just did this using Laplink Professional.  It was happy with it."]},{"symptom":"windows 10 update not working properly        Windows recently updated to version 1909, and now I cannot get any sound\/audio no matter what I try. Additionaly, when I try to open task manager, file manager or SOME other programs, the icons show up but the text is missing. I have tried downloading an earlier version, but I cannot find it to install due to the missing text in file manager...HELP!","solutions":["Hi thewhitt, There may be corrupted registry during the update. You can try running system file checker tool to repair the corrupted registry. You can follow steps below.1. Open an elevated command prompt. To do this, right click the Windows button, and then select Command Prompt (Admin). If you are prompted for an administrator password or for a confirmation, type the password, or click Allow or Yes.2. Type the following command, and then press Enter. DISM.exe \/Online \/Cleanup-image \/Restorehealth - Note It might take several minutes for the command operation to be completed. 3. Type the following command and press Enter. sfc \/scannow - Note It might take several minutes for the command operation to be completed. If you are able to fix OS issues, you can follow instructions from Microsoft website in resolving the audio issue.https:\/\/support.microsoft.com\/en-us\/help\/452028...","Just try to reinstall your sound card driver.."]},{"symptom":"Finding the type of modem being used without looking at the modem itself.        I am new to computers in general.  However, I do know that in Windows 7 a person was able to get all of the information they needed about their pc such as cpu model etc. by clicking in the systems  and properties selections.  Now with Windows 10 all this has changed and I even have a problem finding the control panel icon.  That being said, how do I find out all of my modem specs.  without having to dig through all the wires and file cabinets to look at the modem itself?","solutions":["Hi Math12DM, The way to look at Windows 10 is like a massive search portal...no matter what you are thinking of you can go to Start > ...and start typing what you want...So for instance, go to Start > type in Control Panel and click Control Panel icon...To find your modem specs you can go to Start > type in Device Manager > click Device Manager icon...expand your Modem and right-click the Modem (it may be a Robotics 56K or something) and go to Properties and you can get all your information you desire.Let me know if you need anything else.","Thank you for your help.  But I tried to find the modem Icon in device  manager and all it was was a list of components like bluetooth, computer and all that.  There was no icon for the modem itself and no description of a modem.  Is there another way?","Hi Math12DM, What type of your computer do you have? Is it installed on the motherboard or connected externally to your computer?","Open any web browser and type your modem's IP address into the address bar, then press the Enter key on your keyboard.For example, my modem's IP address is 192.168.100.1Please note: Your modem is completely separate from your computer, so Windows knows nothing about it.","I don't know my modem Ip address.  I have looked in system information for my modem, but compared to information about the laptop itself, which is all the information i could need about the computer, the screen is simply a blank.  The reason why all this is such a big deal to me is because I need to look up the users manual for a modem on the net due to a problem in connecting to the net on another computer in a different location.  ","how do I find out all of my modem specs.  without having to dig through all the wires and file cabinets to look at the modem itself?Does this modem have no labels and nothing else printed on it that will identify the make and the model?"]},{"symptom":"win 10 usb stick        Bought the win 10 usb stick from microsoft to upgrade fro 7 to 10.Inserted usb stick, and computer recognizws it,but when I right click on setup, then run as administrator,I get the spinning busy icon and nothing happens.Can someone be of assistance?Thanks.","solutions":["You can try installing by booting to the USB. To do this insert the USB drive and start your computer. Depending on your BIOS settings it may boot to the USB right away. If not set it will continue to load Windows. Retry booting from the USB again looking for an option that says \"Press key for boot options\" as soon as you power on the system and press the key. You can select USB from here. You can also enter the BIOS and set boot priority as USB first and hard drive 2nd. Typical keys to enter BIOS are F2, DEL, ESC and F12. To keep your files choose to update the system keeping user files, not a clean install unless you do not mind losing user data."]},{"symptom":"Screensaver is not working after Windows update to 1903.        I have tried setting DISPLAY, SCREEN and all the other settings to enable the screensaver to come on at the set time but nothing happens? I have to close the lid when I leave my laptop alone for awhile***Modified Title from: Screensaver doesn’t come on at set time Windows 10 ver 1903***","solutions":["Hi Leo, Thank you for writing to Microsoft Community Forums. We understand how difficult it could be when features do not work the way they should. We would need some more information regarding the issue. May I know the make and model of the computer?May I know what happens when you open the laptop after closing it and leaving it for a while?In order to isolate the root cause of the issue, we recommend to unplug all the unnecessary external devices so that we can isolate and follow the steps mentioned below to restore the power plan settings and check.Go to Settings > Personalization.Click on Lock screen and click onScreen caver settings link.Select your preferred screensaver and Wait time.Check the box behind On resume, display logon screen.Click on Apply > OK.Then open Screen saver settings link again and click onChange power settings.Check the radio button behind Balanced (recommended).Then click on Change plan settings link acrossBalanced (recommend) followed by Change advanced power settings link.Then click on Restore plan defaults and click onYes pop up dialog box.Click on Apply > OK.Then set Turn off display time in the control panel window (Note: Set the turn off display time longer than the Wait time for Screen saver).We also suggest you to referUpdate driver in Windows 10 and try updating display adapter driver.Regards,","I'm on a PC. Microsoft cannot continually offer updates that bork things that were working perfectly fine until their installation.Nothing else was updated...only 1903 installed. Result = no screensaver.Nvidia 1070 with latest drivers, which worked perfectly {as in didn't interfere with the activation of the screensaver} until your change.Stop with the asinine offerings and platitudes. Its bloody obvious that hardware polling isn't being handled to differentiate between \"I'm still here\" and \"look, I've moved\" which results in the screen saver not triggering.If Microsoft has got a better possibility then lets hear it?","I had the same problem too (screen saver worked until updating Win10 to Win10 1903).For me, Step #4 (Check 'On resume, display logon screen') helped \"kickstart\" the screen saver to work again. I unchecked it after it worked and the screen saver is still working as intended.Previously I temporarily changed screen savers and the wait period, but that didn't help. But maybe doing that in combination with checking'On resume, display logon screen' will help others get their screen saver to work again.","This worked for me too.  Apparently since 1903 the screen saver only functions(for me) if the \"On resume, Display Logon Screen\" option is checked.  If I uncheck it, screen saver won't kick in.  It's getting really annoying having to enter my password\/pin every time, but still better than no screen saver or sleep mode at all.","This worked for me too.  Apparently since 1903 the screen saver only functions(for me) if the \"On resume, Display Logon Screen\" option is checked.  If I uncheck it, screen saver won't kick in.  It's getting really annoying having to enter my password\/pin every time, but still better than no screen saver or sleep mode at all. Nope. Every major update, and some KB updates my Screensaver goes South!FACT: Screen saver works normally.MS Update applied: Screen saver no longer works!Why does MS offer no solution, no tool to ascertain WHY the screen saver won't trigger?I'm using an NVidia Graphic Card so its not some esoteric weird piece of hardware with obscure drivers.","Followed these steps, didn't resolve the failing screensaver activation issue.","I have same issue. The reply from Manjunath did not help.","Same here. Screensaver works fine; update to 1903 on 11 October 2019, screensaver fails to kick in. The only change was MS's update.  MS broke the screensaver.  QED.","Same problem. Also Nvidia graphic card, up to date. Checking the \"On resume, Display Logon Screen\" option does not fix this. All had been working fine until 1903 update.","Actually, my problem didn't start with the 1903 update, but with the October 8, 2019—KB4517389 (OS Build 18362.418)—update to 1903, which my system installed on 11 October.  It is otherwise as described—nothing fixes it.  I’m forced to turn off my display at night.  I forgot to specify, but I've got an Nvidia graphics card, for which I reinstalled the latest update—no joy.I filed a bug with Microsoft, but my bet is that nothing will happen until some future update will mysteriously fix the problem, and no explanation or apology will be forthcoming."]},{"symptom":"Windows hello         hi I have a thinkpad 480s and on the hello face setup is says \" this option is currently unavailable\" click to learn more and below that it says \"we couldn't find a camera compactiable with windows hello face.any help to to resolve tis issue.thanks Andre","solutions":["Hi Andre Open Device Manager (accessible by right clicking your Start Button) Expand the Cameras section Right click the Integrated IR Camera and choose Properties On the Driver Tab, choose 'Roll back Driver' Restart (not shut down) your PC once done . . . If that does not resolve the issue, go to the support page for your device on the Lenovo website, then download and install the Integrated IR Camera driver they recommend, it may well be an older version to the one you are currently running, but should be more compatible with your system","Is the Camera shown in Device Manager and is the adapter up to date?","hi Lacrumb,wish u a happy new year.yes its uptodate. but still does not work.","hi DaveM121 ,wish you a happy new year,tried the above and no luck."]},{"symptom":"Other partition safety through windows 10 upgrade        Greetings,My Windows 10 are quite outdated and I need to do an upgrade through the Media Creation Tool. Because of how outdated my system is, the upgrade isn't allowing me to keep any of my files, apps and settings. My Windows are installed on C drive, but I also have a D partition with important files and apps in it. My question is, if I continue with the Windows 10 Upgrade, will my D partition and all my files and apps in it be safe, or will it all get deleted?Thanks.","solutions":["Hi I. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Of course an in-place Upgrade should not touch your data partition, but we see enough horror stories here that I can't promise you there's no chance. Plus please be aware that not having your files backed up at all times is extremely risky, because a hard drive can die at any time without notice. So I'll give you some backup ideas to consider, and suggest that since you need to back up anyway that instead of doing the inferior Upgrade you do the gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... A Clean Install is defined by wiping all partitions off the drive to get it cleanest, during a booted install from Windows installation media provided. You could save the D partition while doing this, but it is not quite as clean - although better than the Upgrade. BACKUP STRATEGIES: 1) You can sync your Desktop, Documents and Pictures folder using OneDrive Backup, or just drag valuable files into OneDrive folder, offering 5gb free with additional space for cheap:https:\/\/www.tenforums.com\/tutorials\/116029-turn... 2) Google Drive has a new Backup that allows you to choose User folders (Documents, Pictures, etc.) to sync up to 15gb for free to their cloud in real time so it always has the latest version.https:\/\/www.google.com\/intl\/en-GB_ALL\/drive\/dow... 3) In addition I'd have an on-site hard copy backup. The best way to do this is to sort all of your files into their User folders and then drag or copy them to another hard drive, USB external or flash drive. Here's how to drag, copy or move large groups of files: https:\/\/www.pcworld.com\/article\/2086566\/the-man... 4) Besides your files you should save a System Image back up to use in place of reinstall in 20 minutes. The best free alternative is Macrium:http:\/\/www.howtogeek.com\/howto\/7363\/macrium-ref... You can even use the Macrium program to mount and extract files from this image so it can serve as both image and file backup too.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I will look into this information, many thanks for the fast reply"," I'm happy to help. Let me know if there's anything else. Also when ready please mark the post which helped most as the Answer, to help others.Happy New Year!"]},{"symptom":"How to solve: \"Error: THREAD_STUCK_IN_DEVICE_DRIVER\" ?        Hello all,I just built a PC a few days ago to give to my dad for Christmas. When setting it up, I applied the RAM's XMP Profile, letting it get up to its full 3200 clock speed. However, this seems to cause the computer to BSOD on occasion and give the error in the title. Even running the RAM at a slightly lower clock speed of 3000 seems to cause trouble.Everything I've looked up for this issue says to update all drivers. I've done this. The motherboard BIOS is the latest version, the CPU drivers are completely up to date, and Windows Update is reporting no new downloads.For reference, the PC contains:CPU: AMD Ryzen 3 3200GRAM: T-Force Vulcan Z 16GBDDR4 3200MoBo: ASRock B450M-HDV R4.0During a chat with Windows Support, it was suggested that it was temperature related. I verified that it wasn't by running a stress test on the CPU and saw only about 63°C at full load. Alternatively, it was suggested that something was just wrong with my Windows install.Is this caused by the XMP Profile? Seems a waste to have bought 3200 ram only for it to run at 2400.There is another post in the community asking a similar question when updating AMD Drivers, which leads me to believe that the ones I downloaded may be a potential cause. However, I can't \"update\" to a previous version of the driver. A mod mentioned that they would need all the dump files to diagnose the issue. Here is a link to a shared OneDrive folder containing a system information file and all the dump files present in the minidump folder.Thank you!","solutions":["AMD is a bit different than Intel...Either way,if youre Win 10 OS is upgraded, v1903 or better & installed thru Microsoft-Windows Media Creation Tool,or Windows Upgrade Assistant,once the upgrade is thru,one must reinstall all the pc hardware components..Youre pc mfg has all,or run pc hardware components thru AMD,the 1st,as Intel says & AMD should,the Chipset software\/driver,then Storage controller\/Video & Audio are next..Once thru,R.click my computer\/properties\/advanced\/Virtual Memory tab\/Advanced\/Change Button..With C: HD highlited,set to: Let System Manage,click set 2X  close out restart pc.63 C  is about 150 F if my conversions are correct,that is a lot of temp to the CPU..Best bet,download the pc BIOS update from pc mfg,once run,power off pc.On pc start up,enter BIOS,locate set to advanced settings,usually exit tab,then go back and reset date\/time,edit for add-ons,save and exit..Youre Mini-Dump is always pc memory related,if ram is ok,then follow above in virtual memory\/page file...Once Virtual memory is reset,the cpu temp should go down,dont forget to run disk clean,and defrag...","Hi squeekybeef, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved.The link you posted is empty - please repost (do not just edit a new on in as I will not get notice of an edit).1. Heat related does not always mean the temps are excessive as a single component such as a resistor, capacitor, or so on, could be too sensitive to even the normal levels of heat. Use a fan blowing into the case to see if that alters is behavior. Also, you might want to try the stress tests below. 2. Be sure to reseat all the memory (remove all power then remove and replace). 3. Test the memory thoroughly - over 4+ hours. (Even sticks that seem to be an exact match can have tiny speed differences which cause the issues you are having - if all are with-in specs the slower still needs to be in front of faster - so swap the sticks in and out in different combinations and patterns). Memory tests do not catch all errors such as mismatched memory (possible even for sticks that appear to be identical) and when faster memory is placed in the system behind slower memory. So it is best to also swap sticks in and out to check for those even if all memory tests fail to show a problem. To test RAM check here - let it run 4+ hours or so. <-- best method www.memtest.org MemTestX86 - Test RAM With http:\/\/www.tenforums.com\/tutorials\/14201-memtes...For the Windows Memory Diagnostic Tool. Type in Cortana's search box -> Windows Memory Diagnostics ........find at top of the list - click it. in Windows 8\/8.1\/10 the name is \"Windows Memory Diagnostic\".4. After the above, if needed, run Driver Verifier to see if it can indicate a cause.5. Be sure to stay in touch with ASRock and AMD Supports and Forums about any known issues (you may be spinning your wheels).================================================ After doing ALL the updates you can, and if the issue continues, then run Driver Verifier. Driver Verifier can help find some BSOD issues : Using Driver Verifier to identify issues with Windows drivers for advanced users http:\/\/support.microsoft.com\/kb\/244617How To Troubleshoot Driver Problems in Windows Vista or 7. (8\/8.1 and 10 are essentially the same). http:\/\/www.winvistaclub.com\/t79.htmlUsing Driver Verifier https:\/\/msdn.microsoft.com\/en-us\/library\/window...WINKEY + X - RUN - type in -> verifier \/reset hit enter to disable If Driver Verifier creates a minidump upload it and post the link here so we can analyze it.====== Stress Tests - Free PC Stress Test free software for Windows 10\/8\/7 https:\/\/www.thewindowsclub.com\/pc-stress-test-f...Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all.","My apologies. The drive should now be full of the correct files. Here's the link.I'll run the tests you recommended and upload the associated dump files.Thank you for your suggestions!","Hi Rob,I ran the memory and stress tests you suggested and all seems well on that front. No faults or issues reported. Windows Driver Verifier reported no faulty drivers.When I open Performance Monitor, I get a message with the following:\"Unable to add these counters:\\Memory\\Available MBytes\\Memory\\% Committed Bytes in Use\\Memory\\CacheFaults\/sec\\Memory\\CacheFaults\/sec\\PhysicalDisk(*)\\% Idle Time\\PysicalDisk(*)\\Avg. Disk Queue Length\\Network Interface(*)\\Bytes Total\/sec\"I am still able to see memory usage in Resource Monitor.I was able to induce a freeze\/BSOD with a specific set of actions, including having multiple Chrome windows open, a YouTube video playing, and the performance monitor running.After looking at Event Viewer, I noticed a repeated event at approximately the right time of the freeze\/BSOD that said \"The AMD User Experience Progam Launcher service terminated unexpectedly. It has done this 1 time(s).\"I have since disabled\/opted out of this program and under my previously described conditions have not had BSOD. Over the next few days, we'll see how the machine stands up to typical use.I'll be contacting AMD about this issue as well to cover my bases."]},{"symptom":"Getting double image while using Dell Visor        I'm getting a double image when i move my head, fixed for a few seconds if I change the graphics setting or refresh rate but ends up going back. I fixed it by rolling back my nvidia drivers but now I can't find the right version\/get to it. Is this my computer or the dell visor?(gtx 960m)***Modified title from: Dell visor double image***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are receiving a Double image while using Dell Visor. I’ll help you with this issue. As you have mentioned that the issue was resolved by rolling back the NVidia drivers, it might be an issue with the Graphics Driver causing this. However, please let us know: Are you aware of any changes made to the computer recently?What is the make and model of the computer? I see that there is driver update for the NVidia graphics card released on Dec 10, 2019, I would suggest you to try installing the driver fromhttps:\/\/www.geforce.com\/drivers\/results\/155645 and see if that helps in resolving the issue. You can also install the Dell Visor application from Microsoft Store, check for firmware updates if any and install them. Let us know how it goes. Regards,Nikhar KhareMicrosoft Community - Moderator","The changes I made to my computer before it broke was updating Nvidia drivers and updating windows. After it broke I connected a monitor. The model of my computer is MS-16J2. I have the latest NVidia drivers and have run the dell visor application. The problem still persists","Nevermind! I found the problem. It runs without the double image on my intel integrated graphics, but not on my gtx960m. So the graphics card might be dying. Hope a new graphics card will help.","Hi, Thank you for keeping us posted on the issue. Glad to know that changing to integrated graphics allows you to use Dell Visor without an issue. I suspect it could be an NVidia driver issue, you can also get in touch with theNVidia Support team and see if they have any driver that might work with Dell Visor. Do contact us for any Windows related issues. Regards,Nikhar KhareMicrosoft Community - Moderator","Changing the driver version to 390.65 fixed the problem so it is a driver problem","Hi,Thank you for replying.Glad to know that changing the NVidia driver version fixed the issue. I would suggest you to keep checking for driver updates and installing them regularly.Feel free to contact us back for any Windows related concerns and we will be glad to help you further.Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Adding Yahoo email accounts to Windows Live Mail        I am using Cox email addresses and use Windows Live Mail to both receive and send emails.  Do not like the Cox website.  I use POP3 in Windows Live Mail.  Cox will eventually discontinue their email and so I thought I could switch to Yahoo.  Want all my emails together.  Gmail does not serve the purpose as you cannot share contacts for multiple accounts EASILY.  I'm not married to Yahoo.  As a matter of fact, I don't even know how to join several accounts together in Yahoo with Windows, let alone in Windows Live Mail.  On my smartphones, I use the Samsung email app. I want ALL of these to share the same email and only delete an email from Yahoo when I delete from Windows Live, not the smartphones.  Any suggestions or solutions how to accomplish the above?","solutions":["Hi T. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Windows Live Mail has been discontinued for two years, and is actively being shut down, with warnings for over a year that features would be shut off soon:https:\/\/www.computerworld.com\/article\/3067121\/e... I would migrate now to WIndows 10 Mail which is comparable except that it doesn't store any mail but is only a sync service for you web and Office Mail boxes. There's a full guide to set it up and use it here:https:\/\/www.windowscentral.com\/how-get-started-... I have no problems using WIndows 10 mail for several years now to sync all of my web mail boxes, like the ability to merge inboxes (or not) and the huge ad-free reading pane. To add Yahoo you need to do this extra step in addition to the tutorial above:https:\/\/support.reolink.com\/hc\/en-us\/articles\/3... Note that you may need to uninstall all Windows Live Essentials to get WLM out completely so it doesn't keep claim as default Mail app and you can choose a new one in Settings > Apps > Default Apps.If you have Mail you need to export to another Mail program, I would do it now while you still can as shown here:https:\/\/archive.codeplex.com\/?p=windowslivemail...https:\/\/www.experts-exchange.com\/questions\/2907...https:\/\/webapps.stackexchange.com\/questions\/496...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I am using Cox email addresses and use Windows Live Mail to both receive and send emails.  Do not like the Cox website.  I use POP3 in Windows Live Mail.  Cox will eventually discontinue their email and so I thought I could switch to Yahoo.  Want all my emails together.  Gmail does not serve the purpose as you cannot share contacts for multiple accounts EASILY.  I'm not married to Yahoo.  As a matter of fact, I don't even know how to join several accounts together in Yahoo with Windows, let alone in Windows Live Mail.  On my smartphones, I use the Samsung email app. I want ALL of these to share the same email and only delete an email from Yahoo when I delete from Windows Live, not the smartphones.  Any suggestions or solutions how to accomplish the above?","I am using Cox email addresses and use Windows Live Mail to both receive and send emails.  Do not like the Cox website.  I use POP3 in Windows Live Mail.  Cox will eventually discontinue their email and so I thought I could switch to Yahoo.  Want all my emails together.  Gmail does not serve the purpose as you cannot share contacts for multiple accounts EASILY.  I'm not married to Yahoo.  As a matter of fact, I don't even know how to join several accounts together in Yahoo with Windows, let alone in Windows Live Mail.  On my smartphones, I use the Samsung email app. I want ALL of these to share the same email and only delete an email from Yahoo when I delete from Windows Live, not the smartphones.  Any suggestions or solutions how to accomplish the above?"]},{"symptom":"Issue in Window OS Task Scheduler And Powershell issue        In Win 8 and 10  task scheduler management tool run automatically and consuming the more cpu usage and memory and stuck the computer system.","solutions":[]},{"symptom":"Windows 10 Volume Icon Disappears with Text Custom Scaling        When I set my text custom scaling to 110%, my volume icon is no longer displayed on the taskbar. The volume icon is displayed when I switch from 100% to 125%, but it disappears when I enter the custom size of 110% under the \"advanced scaling settings\".I did check the taskbar settings and under the \"turn system icons on and off\" the volume icon is still switched to ON. The problem is that 100% is too straining for my eyes and 125% is comically large.Any way to fix this?","solutions":["Hi KristjanD, This is a known issue, set it at 109% or 111% and it will be fixed. Let me know."]},{"symptom":"Original Email Changed When Setup Windows Platform        When I set up my computer with Windows 10 I used an email that I no longer own or have access to and all my C: drive files refer to it.  I want to change the email address assigned to my User name on the platform.  How do I do this?","solutions":["Hi LDJ. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.There's a couple ways you can do this. If you want to swap in a new email address to the same MS Account you can set it as an alias, then set it Primary and delete the old address:https:\/\/support.microsoft.com\/en-us\/help\/12407\/.... Your Windows 10 account should sync the changes, if not move to the next step.Another way is to change the Microsoft account used to sign into Windows to another one, by going into Windows Settings > Accounts Your Info to choose Sign in with a Local Account Instead. Restart PC. Then go back to the same place and choose Sign in with a MS Account instead and insert the desired MS account which effectively converts the Windows account from one MS Account to another.Keep me posted on your progress as I will be here to help until the case is resolved."]},{"symptom":"How to download google play app        im having troble downloading google play app onto my computer, can someone please explain to me how to do it. im sort of an idiot so any help would be nice","solutions":["Hi BigDripz,I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Google Play Store is an application store for Android OS so it would not be available in Windows as it is a different OS. Windows has Microsoft Store which is inbuilt into Windows. However, as the underlying platforms are different(Android is for phones and Windows is for PC) you may not find apps in play store in Microsoft Store.Hope that helps"]},{"symptom":"Minecraft Windows 10 Edition keeps crashing        I want to play minecraft the windows 10 edition, but after a few minutes of gameplay the game will crash and i am forced to restart my computer to use it again. I've reinstalled the game multiple times and put it on the lowest graphics i could and it will still crash.","solutions":["Hi, I'm an independent consultant willing to help. I recommend you to follow the following link to get more information for the solution of your problem:https:\/\/help.mojang.com\/customer\/portal\/article...If you purchased it through the Windows store, you can try the following: 1. Use the problem solver for Windows applications: https:\/\/support.microsoft.com\/en-us\/help\/402732...2. Search for updates to applications and games in the Windows Store: https:\/\/support.microsoft.com\/en-us\/help\/402625...3. Do as indicated in the following technical note: Windows 10 | Troubleshooting in the Windows Store:https:\/\/answers.microsoft.com\/en-us\/windows\/for... 3e8dd44194a2Source: https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this information will be useful. Best regards, Cristhian","My game does this as well. I've reset the app, reinstalled it, updated and reinstalled my graphic drivers, checked for numerous types of updates, updated windows 10, but minecraft still crashes after a couple minutes of gameplay, specifically while breaking blocks.The crash will lead to a black screen in which the cursor will display the loading icon. The mouse wont move, and the screen stays like this until I have to hard restart the computer.","I'm having the same issue and the generic responses don't help in the slightest. It worked a month ago when I setup a Bedrock realm for my kids and their friends, but now I can't load a local world at all. As soon as I load the world and it starts to appear, it freezes up and I have to do a hard restart of my computer. It locks so hard, task manager won't come up. A response from Microsoft \/ Mojang would be nice, and preferably not the generic \"reinstall your video drivers\" line. If I can run Ark with everything set to Ultra at 4k, I should be able to run Minecraft.","Ditto here. I can start the game and play for only a few minutes until it hard freezes when I used to be able to run it for hours just a month ago with no crashes at all. Can run other much more advanced games with no problem, even the java edition does not crash for me, with much higher settings.","Its the same over here too. What happens for me is the screen freezes and then it just closes. This happens when breaking blocks. Its annoying and ive turned off the computer, restarted it, and un installed and reinstalled minecraft itself. Nothing works","I also crash upon loading but I when the games still in the loading screen. I think it might be that we do not have enough Ram (or Memory)?"]}]}