{"windows":[{"symptom":"Error: Something went wrong when installing State of Decay 2 from Microsoft Store        I purchased SoD2 UD for a friend.He tried installing it and got the \"something wrong on our end\" message.We waited a day, same error.We waited a couple of days, same error.We then found a healthy list of things to try, no love.We got the idea of booting into safe mode as we were finding apps active that were stopping us from completing one of the indicated steps.  Now he can't log on to the MS Store at all!Please help.***Original title: Can't install SoD2, can't log in while in safe mode, only error is \"something went wrong on our end.\"***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues while installing State of Decay 2 game on your friends PC. For further clarity on the issue, please respond to the questions below: Which build version of Windows 10 is installed on the PC?Are you aware of any changes made to the PC prior to which you weren’t facing this issue?Have you tried installing any other app from Microsoft Store?Do you receive any error code when you try to install the app? Refer the article Which version of Windows operating system am I running? Meanwhile, I would suggest you to follow the steps mentioned below and see if that helps. Method 1: Try resetting the Store and see if that helps. Press Windows key + R. This will openRun. Alternatively, you can go to Start and search for ‘Run’.In Run dialog box, type ‘wsreset.exe’ and hit enter. Note: A blank Command Prompt window will open, and after about ten seconds the window will close and Microsoft Store will open automatically. Method 2: Run the Store App troubleshooter to identify and fix problems. Press Windows + I key together to openSettings.Click on Update &Security and then click on Troubleshoot.On the right hand pane scroll down and look for Windows Store Apps.Click on it and select Run the troubleshooter.Follow the on-screen instructions. Method 3: Run the PowerShell command to re-register store. Press Windows + X keys together and click onWindows PowerShell (Admin).Now type in the command and hit enter: Get-AppXPackage *WindowsStore* -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register “$($_.InstallLocation)\\\\AppXManifest.xml”}Restart the PC. Method 4: Try creating a new user account and see if you are able to install the game. Refer the articleCreate a local user or administrator account in Windows 10 Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Can't connect two similar BLE devices        I want to cennect two BLE controllers to one Windows PC.First controller connects fine.But trying to connect second - leads to error.From System log I've fond error: - System   - Provider    [ Name]  BTHUSB   - EventID 35    [ Qualifiers]  49157    Level 2    Task 0    Keywords 0x80000000000000 In description it says, that my controllers use the same PERMISSION KEY (if I translate correctly).How can I connect my two controllers at thew same time?","solutions":["I am getting the exact same thing. I work in the office and at home. I'm using a Surface Laptop 2 running Windows 10 v1909, totally up to date with latest firmware.I have a desginer mouse and keyboard for the office, and then one set at home.My mouse at home won't connect. When I try connect, it says try again. Event logs states the same as you:The device (ea:f8:44:45:d8:a0) is trying to distribute an Identity Resolving Key that is already used by a paired device. The pairing was rejected, if the intent was to pair with this device, you may need to first delete the existing pairing information. System   - Provider    [ Name]  BTHUSB    - EventID 35    [ Qualifiers]  49157     Level 2     Task 0     Keywords 0x80000000000000    - TimeCreated    [ SystemTime]  2020-01-13T08:21:58.957948500Z     EventRecordID 50707     Channel System  "]},{"symptom":"Hard drives are showing as failed in Disk Management        Hi, I recently restarted my computer and noticed that three of my hardrive partitions are now missing.All three show up in my Disk Management but are listed as failed with a red X next to them.I've tried researching solutions to this, but none of the youtube videos nor articles, cover this specific scenario. The closest ones I found mentioned that I'd need to change the hardrive letter, however, I don't see that option when right clicking but rather a reactivate volume message. Clicking that prompts me to use chxdiskafterwards. I tried using that to see if I could get anyway, but I'm unable to scan my affected drives since they aren't showing up as existing.I am noticing a prompt telling me from a few days ago to restart my pc to fix driver errors (the issue i'm experiencing occurred today) so i'll do that and see what happens.***Original title: Win 10 - Missing\/Failed Hardrives***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that hard drives in disk management are showing as missing on your PC. Based on the screenshot you have shared it seems that you are using dynamic and spanned volumes. We do have a dedicated forum where you should be able to find support for your query, let me help you in pointing towards the right direction. I would suggest you to post your query on TechNet forums, where we have support professionals with expertise on RAID configuration to assist you with your query. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Printing Files        I want to print the list of files I have under \"pictures\"  Is this possible?","solutions":["I want to print the list of files I have under \"pictures\"  Is this possible?Rather than asking \"Is this possible?\" you probably wanted to ask \"How can it be done?\". Here is a way to do it:Mark the code line below, then press Ctrl+C to copy it.Click the Windows orb.Press Ctrl+V to paste the code line, then press Enter.Open the desktop file Pics.txt.cmd \/c dir \/b \/s \"%UserProfile%\\Pictures\" > \"%UserProfile%\\Desktop\\Pics.txt\" & pause"]},{"symptom":"Unable to See Network Share Drive when Mapped only with Alphabet 'S'        Hello Microsoft,We are unable to map a network drive with Letter S on Windows10 all versions of OS. Little Story behind - There are few folders on a network share and they have to be mapped with letter S - As its configured on one of our local applications.When we map with any other alphabet apart from S - It gets mapped and displayed in File Explorer \/ Computer.But, When we map it as S Drive - The Operation gets completed but it doesnt show up in Computer. But we can access the Shared drive through Run. We have checked  below things. 1. Checked in net use and the S Drive is ON and connected. deleted using netuse delete S:\\ - No Luck2. Checked in all the other Win10 Machines - Behavior is same.3. netsh winsock reset performed - no luck4. HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\MountPoints2 - Checked here and S Drive is not listed.5. SMB 1.0 is enabled.6. HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System - DWORD is already created with EnableLinkedConnections.We wanted to understand - if this is an issue at Win10 OS level or there should be some settings at file server. ?","solutions":["Can you give us a screenshot of your Complete File Management?"]},{"symptom":"Will my Gigabyte GA-P55M-UD2 motherboard run Win 10? If so, what version?        Hi- I see the Win 10 compatibility application is no longer available. I tried upgrading my computer to Win 10 back during the free period and it didn't work. I assumed it was because my components were too old. I see here on the forums though that some older MoBo's can still run older versions of Win 10 and I was wondering how I might determine if mine can, and how I would go about doing the upgrade (I'm not very computer savvy). I don't want to purchase Win 10 to find out that my computer simply can't run it.My mobo is a Gigabyte GA-P55M-UD2. My CPU is an i5-760, in case that matters.Thanks!","solutions":["Hi Tim, Thank you for writing to Microsoft Community Forums. I appreciate your interest in Windows 10. Thank you for sharing the details. Upon checking the details provided by you, and I see that the manufacturer provides drivers only up to Windows 7. For more information, seeGA-P55M-UD2(rev. 1.1) There are some older motherboards, which supports Windows 10. Ideally, you may also require Windows 10 supporting driver and firmware updates from the hardware manufacturer, which currently is not available for your motherboard. However, it would be advisable to upgrade your computer hardware, to avoid any issues that may arise due to compatibility and you may also face performance issues in the future, for smooth running of Windows 10.​ Let us know if you need any further assistance, we will be glad to help you. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"How to get Refund from Microsoft Store        Installed spelling game jearle1974 from microsoft store but it does nothing apart from allow me to add player names. How to get refund?[Original Title: Installed and purchased spelling game jearle1974 from microsoft store  waste of money.]","solutions":["Take a look at:https:\/\/support.microsoft.com\/en-us\/help\/4026286\/microsoft-store-get-the-status-of-your-return-and-refund","Hi, Thank you for writing to Microsoft Community Forums. I understand your query related to getting a refund for the purchase made towards Spelling Game. I would suggest you get in touch with the Microsoft Store support team, where they have the right tools and access to provide you a refund related to the purchase made for Spelling Game. If you have any further queries related to Windows, please get back to us and we will be glad to assist you. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Refund for the purchase made towards Minecraft Windows 10 Edition        I accidentally had bought minecraft windows 10 edition but i dont have windows 10 so i cant even use the game. I would like to get a refund on it.***Original title:I bought the wrong one***","solutions":["This is a forum of users not Microsoft.","Hi Janelle, Thank you for writing to Microsoft Community Forums. I understand your query related to getting a refund for the purchase made towards Minecraft Windows 10 edition. I would suggest you get in touch with the Microsoft Store support team, where they have the right tools and access to provide you a refund related to the purchase made for Minecraft. If you have any further queries related to Windows, please get back to us and we will be glad to assist you. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Can't make a 2 player Realm           I play Minecraft windows 10 and I'm trying to make a 2 player Realm but it says \"You cannot play on Realms because of how your Microsoft account is set up\" and gives me a link to the privacy settings. I check all my settings and there is nothing that should stop me from creating a 2 player Realm (that I can see). I did not buy the Realms plus, but shouldn't I still be able to make a 2 player one? Idk, halp","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as you are unable to make a 2 player Realm, while playing Minecraft. In this scenario, we would suggest you to refer these articles: Minecraft RealmsXbox One online safety and privacy settings for parents and kids If you still face the issue, then we suggest you to post your query in theXbox forum by clicking on Ask a question. Where we have professionals who are experts for in game issues. Regards, Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"Printer Issues (No Homegroup to print from multiple devices)        Hello Everyone, I really could use some expert support. Before the home-group disappeared during a windows update; i was able to print files from my laptop in my kitchen to my printer in my bedroom which is attached to a desktop there. I have an older printer which is still very functional (Brothers DCP 8040). My desktop is an Dell Optiplex 320 (not wifi capable). My laptop is an Acer Aspire (wifi enabled). Both operating systems are running Windows 10 Home. I have to now carry the laptop into the bedroom; disconnect the printer from the desktop just to print what i need from the laptop. The printer prints fine from the bedroom desktop. My question is: how\/is it possible to put this older printer on my network and have it print from all my devices; fire 10 and 7 tablets, laptop and desktop without issues. Can you please help as I prepare to return to school.. Thank you for your time and support.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are unable to print wirelessly from your laptop on your Brother DCP 8040 printer. I’ll certainly help you with the issue. However, please let us know: Is the printer connected to the computer through USB or connected to the router? You might want to try sharing the printer on the network and then check if you are able to print from your laptop. To do this, refer the steps mentioned in the articleShare your network printer. For reference you might also want to check the steps mentioned in the articleShare your printer in Windows 10\/Windows 8\/Windows 8.1 (Shared printer). Although the steps are not for your printer model however, these are generic steps. Let us know the results.  Regards,Nikhar KhareMicrosoft Community - Moderator","Good morning Nikhar and community. As I was reading your instructions, I went back over each individual step. First, my primary computer is hardwired. Second I had everything set up originally; my problem was, I did not use my \\\\computername\\printername in the share printer field. As soon as I put that in the field box and tried printing a test page, it printed perfectly from my secondary computer to my primary computer.. Thank you so very much for your professional help and support Nikhar.The issue was successfully resolved within 5 minutes.Have a wonderful day","Hi,Thank you for replying.Glad to know that you were able to print by entering the printer name in the shared printer field.Please feel free to contact us back for any Windows related concerns\/queries, we will be glad to hep you further.Let us know if you got the help you needed by clicking 'Yes' or'No'.Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Win32k_callout_watchdog_livedump BSOD or not BSOD?        Hello.My question is. I get crash in game when i click exit to desktop. Black screen for 1 minute,nothing responding. Then desktop appeared ,screen appeared and after 1 minute pc just reset itself.I open eventog and there was only about KERNEL-POWER 41,but not bugcheck. So it was bsod or not?But i have found in windows\/livekernelreports\/ watchdogPOwin32k.sys ,screens:So is this possible for BSOD without bugcheck in event log then? Reboot was 20:22:00. That file watchdogPOwin32k.sys in livekernelreports are 20:18:00. Like i stated reboot was with KERNEL POWER 41 in event log. No bugcheck in eventlog. Only that file which i stated.My pc:Monitor:AORUS AD27QDCpu: i7-9900K stock 4.7 with Noctua NH-D15Gpu: Rtx 2080 Ti Aorus Xtreme Waterforce ( stock no oc,temps max 63C on load )Ram: 32gb 2x16 GB DDR4 GSKILL 3000MHZ XMPPsu: Seasonic Ultra Prime Titanium 850WMonitor: AORUS AD27QDSSD: Crucial 1TBHDD: WB BLUE 1 TBCase: Cooler Master Cosmos C700P","solutions":["Hi SasaAsasa, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved.Yes, that is a BSOD. Could be your computer just does not have the complete specs to run your programs or games. Best to check with the program and game makers' support and forums.ID41 with no Bug_Check - The main cause of this issue as you have described is hardware related :https:\/\/support.microsoft.com\/en-us\/help\/202850...1. Over-Clocking -> best to reset ALL to the defaults especially while troubleshooting2. Memory (check thoroughly as indicated below). 3. Power Supply (see below to ensure you have enough power). 4. Over-heating - even if the overall temps are with-in specs a single component can be too sensitive to even the normal levels of heat and fault at a lower temp. Try adding a fan blowing into the case to reduce the effects of heat even more than the cooler usually does. Of course ensure all built-in fans are running. ==================================================== After checking determining the wattage of the power supply you will then need to check the requirements of the motherboard and devices. Usually the video card is one of the major power users.How do I determine how big my power supply is? http:\/\/www.computerhope.com\/issues\/ch000800.htmOther good sources of information are the device makers' sites and their forums. eXtreme Power Supply Calculator http:\/\/extreme.outervision.com\/psucalculatorlit...Power Supply Calculator https:\/\/www.newegg.com\/tools\/power-supply-calcu...Choosing the right power supply for your computer http:\/\/en.kioskea.net\/faq\/588-choosing-the-righ...How Do I Test the Power Supply in My Computer? http:\/\/pcsupport.about.com\/od\/toolsofthetrade\/f...==================================================== Memory tests do not catch all errors such as mismatched memory (possible even for sticks that appear to be identical) and when faster memory is placed in system behind slower memory. So it is best to also swap sticks in and out to check for those even if all memory tests fail to show a problem. To test RAM check here - let it run 4+ hours or so. <-- best method www.memtest.org MemTestX86 - Test RAM With http:\/\/www.tenforums.com\/tutorials\/14201-memtes...For the Windows Memory Diagnostic Tool. Type in Cortana's search box -> Windows Memory Diagnostics at top of list - click it. in Windows 8\/8.1\/10 the name is \"Windows Memory Diagnostic\". ===== Troubleshoot blue screen errors <-- read this link http:\/\/windows.microsoft.com\/en-us\/windows-10\/t...For any minidump or memory.dmp files that you might experience upload them so I can analyze them.We can analyze the minidumps if you make them available from the OneDrive or other file sharing sites (such as MediaFire). If you have problems uploading the minidumps copy them to the Desktop or the Documents folder and upload them from there.One-Drive - Share files and folders and change permissions http:\/\/windows.microsoft.com\/en-us\/onedrive\/sha...Upload photos and files http:\/\/windows.microsoft.com\/en-us\/onedrive\/add...Zip or upload the contents of C:\\Windows\\minidump Use OneDrive to upload collected files http:\/\/social.technet.microsoft.com\/Forums\/en-U...====== Sometimes running stress tests will help to identify the problems. PC Stress Test free software for Windows 10\/8\/7 https:\/\/www.thewindowsclub.com\/pc-stress-test-f...Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all.","I have that file in  windows\/livekernelreports\/ watchdogPOwin32k.dmp. Event logs not showed any bugcheck. Only power KERNEL 41 in event logYou said it is bsod so what code is for that BSOD?  If there is no bugcheck so this is not BSOD?Also it happened once,i dont have any stability issues. I can left games for 24 hours without issues.My psu is enough. Memtest passing no errors. ","See the top link I posted in my reply = sometimes an ID41 does not produce a BugCheck.Please post that .DMP file you do have so I can look at it. Did you run memtest for 4+ hours? If caused by hardware, issues such as this will get worse over maybe a long period of time. If caused by software they may be very sporadic - possibly only showing up when the system is using a lot of resources.Rob","Yes i made even 12 hours without errors. Memtest86,RAMTEST ( better app ) and no errors. Realbench no errors. Stress tests passing fine.watchdogPOwin32k.dmp. that dmp was related to my reboot?","It might be,,, look at the date on the file - right click on it properties. If you think so then upload it so I can look at it.Rob","C:\/ windows\/livekernelreports\/ pow32kwatchdog.dmp <--- that file is 2GB. Also is that file related to that reboot?  There was not bugcheck in event log. Only power kernel 41","Well it may or may not help if I look at it. Did you check the date on it? Rob","Screen from event log:20:17:30 reported time of unexpected reboot. There was not bugcheck.windows\/livekernelreports\/ pow32kwatchdog.dmp.Time: 20:18:00Also my pagefile settings are 4200MB.Recovery settings auto:And question is. I had reboot due to hardware fault ( component )like power cut just. Or it was BSOD but it was not registered?","Did you look for a memory.dmp file in the Windows folder? There are a few BSOD the cause of which can reboot the computer and leave no DMP file. Among those are 0x00000124 and ID41.windows\/livekernelreports\/ pow32kwatchdog.dmp. created 30 minutes after the even could certainly be related to the ID41.If there was no DMP file created where did you get the file posted in your original two images in this question? Shows a BugCheck of 1A1 and the basic analysis.------ Mainly, have your used the methods I have posted to try to troubleshoot the issue? Those are actually more important than whether or not a DMP file was created (which is not that unusual).Rob","Windows\/memory.dmp not exist. Not created.windows\/livekernelreports\/ pow32kwatchdog.dmp. created 30 seconds after event,not minutes.! :)2 screens was from windows\/livekernelreports\/ pow32kwatchdog.dmp. <---- :So if that file was not related to that reboot. so i had only simply KERNEL-POWER 41 reboot? And this was caused by hardware? Or maybe it was  BSOD but not showed anywhere bugcheck?It happened once, i cant reproduce this anymore,weird."]},{"symptom":"USB game controller adapter        I have a generic adapter and here is the problem. It's a ps2 controller to USB adapter and it's a dual adapter. When I plug in 2 controllers, neither one is recognized. It only works when there is just one controller plugged in. Is there a driver that I can download to fix this? I'm using windows 10 and I don't know the manufacturer of the adapter. ","solutions":[]},{"symptom":"pop ups        How do I stop a website from popping up and kicking me out of the site I was in","solutions":["Hi sue_033, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.In Microsoft Edge, you can click on the three dots (...) in the top right of the browser, then select Settings, and then choose Privacy & security.Under Security, ensure that \"Block pop-ups\" is on. Source: https:\/\/support.microsoft.com\/en-ca\/help\/402639... If you are using a different browser, such as Google Chrome or Mozilla Firefox, please let us know as this will be a different procedure.If there are unwanted popups coming up even when you have the browser closed, you may wish to run a full scan with Windows Defender or a third-party malware scanner such as Malwarebytes.I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"I WASN'T OPTING OUT I WAS JUST SAYING I DIDNT DO ANYTHING        I HAVE BEEN TRYING TO GET IN TOUCH WITH DELL BECAUSE MY TABLET NEEDS TO BE UPDATED FOR WINDOWS 10 ITS MISSING A COUPLE OG UPDATED DRIVES","solutions":["All caps is considered yelling.  Please do not yell at the other users that make up this forum.","Hi Sharon You can go to the Dell website and manually download and install device drivers any time you need to . .You mention 'opting out' can you please provide a bit more detail on that . . . With regards to Windows Updates, click\/tap your Start Button, type winver and hit EnterOn the resulting dialog, what Version No. and build No. of Windows 10 are you running?"]},{"symptom":"Activating Windows 10        Hi all, I've spent many hours on my PC trying to activate Windows 10. I had an old version of windows about 5-years ago & got a free update to windows 10 by following a link that was emailed to me (from memory). When I try to activate I get this error message 0x8007232B. I need to locate the digital licence. Apparently I have Windows 10 Pro trying to run Windows 10 Home & it says I have to install Windows 10 Home but I cannot find a free version of this. Is this some sort of 'scam' that I have to fork out dollars for an update? It says I cannot change any personal information when I go into 'settings'. Any assistance would be great! I've tried the microsoft virtual assistance but am getting no help there. I can't see any other sort of support","solutions":["Microsoft Windows 10 Pro: https:\/\/www.microsoft.com\/en-us\/p\/windows-10-pro\/df77x4d43rkt?activetab=pivot%3aoverviewtabAlso on Virtual Agent say \"Hallo\" and then press 'Talk to a person' and you'll be able to talk to a person.","Hi Christine. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.It sounds like someone installed Pro on your PC and you only have a permanent Digital License for Home. This cannot be done by accident, it requires deliberately doing it. Someone may have thought they were giving you a gift since installing a special key can unlock Pro (the exact same OS as Home with a few extra expensive features that are hidden in Home) but it still requires a Pro Product Key or Store Upgrade once that's done.So you'll need to reinstall Home. This is not hard to do since the latest installation media is always available to be created free as a bootable 8gb+ flash stick or ISO download to burn to DVD, from the Media Creation Tool here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Just follow the instructions in the middle of the download page above.You may be able to avoid having to wipe the drive to reinstall Windows since there is a workaround to change from Pro to Home that is reported working by others here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...if not then follow the illustrated steps in this link which compile the best possible Clean Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thank you Derek!","Thank you Greg!","I am glad to help, Christine. Keep me posted on your progress as I will be here to help until the case is resolved.","You're welcome please press yes or no on which one helped you out thanks!","Hi Daniel, the installation has finished downloading. Unfortunately it is Windows 10 Pro which I want to over-ride with Windows 10 Home. What now please?","Sorry...Greg! ","When you download Windows 10 it includes both Home and Pro versions. You should have the choice when doing the Clean Install as long as you properly boot the media following the illustrated steps.If you do the Downgrade workaround it will self-select Home version based on the registry changes you make in the instructions.","Hi Derek, aren't I supposed to be over-riding Windows 10 Pro with Windows 10 Home? this appears to be a 'Pro' installation, thanks & regards,"]},{"symptom":"How to adjust multi monitor cursor transition        Hello ladies and gents of the forum. As the title suggest, I'd like to know how to adjust cursor behavior when transitioning between monitors.I'm just built my first (2) pc(s), and am trying to set up monitors for them both.pc1 has 2 1080p monitors at 24 and 27 inches. Windows seems to think they are the same size and as a result moving the cursor horizontally from one screen to another results in a change in height, which is slightly annoying.pc2 has a 24in 1080p monitor and a 28 in 2160p one. Windows seems to the 2160p one is physically double the size and will not let my mouse onto the smaller monitor unless I transition from the bottom half of the larger one, which as one can imagine is more frustrating still.Ideally I would like to be able to keep cursor's height (in the real world) when transitioning screens when possible, and when out of range have the cursor \"bumped\" down to the top of the smaller screen. Failing that, I'd like to at least have pc2 behave like pc1, that is to say at least allow screen transition along the entire edge of the bigger screen.Apologies if this isn't the right topic. My thinking is that this is a personalization issue, and I was not able to find one specifically related to displays.Further apologies if this is a \"why didn't you just google (bing?) it\" question. I did try to no avail, mostly due to not knowing what to search for.","solutions":["Hi ATMBot, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.Typically this can be adjusted by right-clicking anywhere on your desktop and selecting \"Display settings\"I assume that under Multiple displays, you are using the setting \"Extend these displays\"You should see the two monitors displayed as rectangles 1 and 2. You can click and drag on these rectangles to place them as your monitors are physically laid out.This affects how the cursor transitions across monitors and I hope this is what you are looking for!The attached image is from this website (specifically Part Six: Display layout), which also has some additional information on using multiple displays:https:\/\/www.tenforums.com\/tutorials\/21084-multi...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","Hello and thanks for the quick reply.Unfortunately this isn't quite what i'm looking for. I do have the displays sitting side by side both physical and virtually. The problem is that their size difference isn't the same physically and virtually.For instance, for my pc2 windows windows seems to think one display is 4x the size of the other with double the height, when in reality the larger is maybe 36% bigger and 17% taller. This results in a very awkward scenario where, as you pointed out I can choose where i'm unable to transition by dragging the smaller screen around, but there will always by 50% of the bigger screen's edge where the cursor cannot transition.For instance currently I have them aligned by the bottom edge with the smaller screen on the left. As it is, the cursor cannot move left from the entire upper half of the larger screen. I would rather it can.Hopefully I have better described my problem. Thanks once more for the reply.","Hi there, Just to verify, on all monitors, is the setting \"Change the size of text, apps and other items\" set to 100%?I'm out of ideas on this one personally, but another expert may have some other ideas!Best wishes for a quick resolution! (No pun intended) -Ashton","Hello again.Normally the 1080p monitor is indeed set to 100%, although the 2160p one is set to 150% to be more usable. I have tried adjusting the ratios but that seems to make no difference.Thanks for the attempt."]},{"symptom":"Windows 10 critical device failed        I keep getting this error message. I am unable to safe boot, reset pc, and ive tried multiple commands in the cmd. What should i do? Is my pc broken, if so can i save my parts like my hardrive ram graphics card processor motherboard ssd etc. ","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as you are unable to boot the PC to the login screen and getting a Blue Screen of Death,in order to get clarity and to assist you accordingly, please reply with the answers to the questions below. What is the Windows 10 version and Build installed? (Typewinver in Windows search\/Run command)What is the make and model of the PC?Are you aware of any changes on the PC, prior to this issue?What is the complete error message you are receiving? This error usually occurs if there is a corrupted device driver, or incompatibility issues with a newly installed hardware or driver. In this scenario, I would suggest you to disconnect all the hardware devices except for the mouse and keyboard and check if it helps. If the issue persists, perform an Automatic Repair using an Installation media. Automatic Repair is a Windows recovery tool that can fix certain system problems that might prevent Windows from starting. Automatic Repair scans your computer for the problem and then tries to fix it so your computer can start correctly. Run Automatic repair and check the issue status. Create Windows 10 ISO: http:\/\/www.microsoft.com\/en-us\/software-download\/windows10 Please follow the below steps to perform the repair for the computer.Insert the Installation Disk into the disk drive of the computer. Press any key from the keyboard when prompted to.Follow the instructions till the Install Now screen and then ClickRepair your computer.Click Advanced Options.Click Troubleshoot.Click Automatic Repair.Follow the on screen instructions. If you are successfully able to boot the PC, then provide us the mini dump file to analyze for further investigation.Open File Explorer and navigate to this location: C:\\windows\\MinidumpSort it by date and upload the dump file to OneDrive.Post the OneDrive link We await your response. Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"Windows store saying I have no applicable device linked to my account when I can see it on the website. Just got the xbox game pass for my PC and cannot even use it. help please        I just used the xbox game pass code that came with my GPU and I cannot download any xbox pass game to my pc. I have tried resetting the windows store, I updated my windows to the latest version, I have restarted, shut down and rebooted, changed my account info, unlinked and relinked my pc, changed my pc name, and I doubled checked the xbox game pass is on the right account. I have no idea what to do and I can't find any way to fix this. I am really disappointed and just want to play some games. If anyone can please help me I would greatly appreciate it... thank youSee below image.","solutions":["Hi FoggyDoor301231 This is reported a lot, what generally resolves this is resetting the Store App Click your Start Button, then just type wsreset and hit Enter When that completes, restart (not shut down) your PC, then check if your device is recognized . . .","So I did that and its the same result. My pc is recognized and attached on the microsoft website for \"microsoft account | devices\" but when it comes to the actual windows store application its still saying nothing is applicable. ","Okay update. Now some of the games with the free pass work but games like Outer worlds or Metro do not allow me to install them even though they are still part of the pass. I'm not sure what thats about... SUPERHOT worked. ReCore worked. Ruiner worked.  The games that don't work say they can be played on PC so I'm real confused.","Same thing I wanted outer worlds and I try to download it and it says not applicable even though it is on the game pass for pc and the outer worlds is supposed to be on pc ","It looks like you don't have any applicable devices... fixes checklist: A) First see this checklist from Microsoft: https:\/\/support.microsoft.com\/en-us\/help\/409890...B) Make sure all Windows Updates are installed, and that you have the latest version 1903 at Settings > System > About. If not manually upgrade to the latest version 1903 by opening the Media Creation Tool from this link:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m..., choose Download Tool Now, then open the tool and choose Upgrade This PC Now. This saves your files, apps and most settings in place, is the most stable method to change versions, brings your Updates current, resolves most problems. If any problems report back the verbatim error and number, then continue with these steps for overcoming Version Upgrade problems:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... C) Go to Settings > Accounts > Your Info to check if you need to Verify the account and do so now.D) The the Microsoft Account troubleshooter: https:\/\/download.microsoft.com\/download\/F\/2\/4\/F...E) Add the Device as a Trusted Advice: https:\/\/support.microsoft.com\/en-us\/help\/12369\/...F) I'll give you everything possible to repair the store. Even if you've tried a step please do it over in this sequence:1) See if the fixes here help: https:\/\/www.pcworld.com\/article\/3053099\/windows... 2) Try running the Windows Store apps Troubleshooter at Settings > Update & Security > Troubleshoot.3) Try resetting the Store cache: http:\/\/www.thewindowsclub.com\/reset-windows-sto... 4) If that fails go to Settings>Apps and highlight Microsoft Store, choose Advanced Settings, then Reset. After it resets, restart PC.5) If that fails then reinstall Store. Type CMD in Start Search, right click Command Prompt result to Run as Administrator, copy the following code and paste it into the box using the Edit tools from Box's top left dropdown menu, press Enter:PowerShell -ExecutionPolicy Unrestricted -Command \"& {$manifest = (Get-AppxPackage *WindowsStore*).InstallLocation + '\\AppxManifest.xml' ; Add-AppxPackage -DisableDevelopmentMode -Register $manifest}\"6) Clear the LocalCache Folder: Open Run by pressing the Windows key + R hotkey. Copy and paste %localappdata% in Run and click OK. Open Packages> Microsoft.WindowsStore_8wekyb3d8bbwe > LocalCache folder. Press the Ctrl + A hotkey to select all content within the LocalCache folder. Press the Delete button. 7) If these all fail then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... 8) Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account because of the serious and persistent problem with corrupted accounts. Then continue with the other steps to go over your install most thoroughly.9) If nothing else works then do a Repair Install, by installing Media Creation Tool and then choosing to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","None of these solutions worked. I bought the game pass, added my PC, and can't even install the games that I paid for. Quality service, very nice.","You will have to update your computer by going into the settings and checking for an update. Next you have to install the app called Xbox (Beta). This is where all the Xbox PC games are located.","You will have to update your computer by going into the settings and checking for an update. Next you have to install the app called Xbox (Beta). This is where all the Xbox PC games are located."]},{"symptom":"Windows update error 0x80070020 in Windows 10        I have Windows 10 on my PC. When going to settings, I see that my version is out of date and I should update. When doing the updates, I get error 0x80070020. Tried several times without success.Please, help.Thanks in advance.Original title: Updates to Windows 10","solutions":["Hello Munther,We regret the inconvenience. Let me assist you.This issue can occur if a program is interfering with the automatic update process. For example, antivirus programs that use real-time scanning can interfere with the automatic update process.So, place the computer in a clean boot state to determine if there are any third party application\/software to be causing the issue. After you place the PC in a Clean Boot state, now try performing a Windows update and see if it works this time.Clean Boot Disclaimer: Please go through the section: How to reset the computer to start as usual after troubleshooting with clean boot of the Kb article to boot the computer in normal startup after fixing the issue.Also, verify that you have disabled any other third party real-time antimalware products that were installed on your PC, to check if any how incoming\/outgoing connections to the PC are affected by the firewall.Disclaimer: Antivirus software can help protect your computer against viruses and other security threats. In most cases, you shouldn't disable your antivirus software. If you have to temporarily disable it to install other software, you should re-enable it as soon as you're done.If it still does not help, refer to the below methods and check if it helps to resolve the issue.Method 1Follow these steps to run the Windows in built troubleshooter. This is a diagnostic which helps to identify any potentialissues related to Windows update present in your PC.a)      Write Troubleshooting in the search box and hit enter.b)      Click on Troubleshooting tab.         c)      Click on view all option on the upper left corner.d)      Select the Windows Update option from the list.e)      Click Next to run the Troubleshooter. Note: Also, run BITS from the view all listMethod 2If the issue still remains, try manually reset the Windows Updates Components once again and thenreinitiate the Windows Update process.Resetting Windows Update Components will fix corrupt Windows Update Components and help you to install the Windows Updates quickly. Please follow the below steps to reset the Windows Updates Components:1. Press Windows Key + X on the keyboard and then select “Command Prompt (Admin)” from the menu.2. Stop the BITS, Cryptographic, MSI Installerand the Windows Update Services. To do this, type the following commands at a command prompt. Press the “ENTER” key after you type each command.                           net stop wuauserv                           net stop cryptSvc                           net stop bits                           net stop msiserver3. Now rename the SoftwareDistribution andCatroot2 folder. You can do this by typing the following commands in the Command Prompt. Press the “ENTER” key after you type each command.                          ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old                          ren C:\\Windows\\System32\\catroot2 Catroot2.old4. Now, let’s restart the BITS, Cryptographic, MSI Installer and theWindows Update Services. Type the following commands in the Command Prompt for this. Press theENTER key after you type each command.                        net start wuauserv                        net start cryptSvc                        net start bits                         net start msiserver5. Type Exit in the Command Prompt to close it and then restart the computer.6.After restarting the computer, now retry to install Windows Updates.Ref: https:\/\/support.microsoft.com\/en-us\/kb\/971058Registry disclaimer:Serious problems might occur if you modify the registry incorrectly. Therefore, make sure that you follow these steps carefully. For added protection, back up the registry before you modify it. Then, you can restore the registry if a problem occurs. For more information about how to back up and restore the registry, click the following article number to view the article in the Microsoft Knowledge Base:How to back up and restore the registry in Windows.Also, use the following tutorial to  Reset Windows updates completely and check if it helps:Full Reset Windows updatesWrite to us with the updated status and the required information related to Windows update, for us to be able to assist you further.Thank you"]},{"symptom":"Windows Server Essentials 2016        I am unable to login under a different username to some of my Pc's. It looks like there is no domain authentication but only the local Cache. This happened after a power failure during an update.","solutions":["Hello glj100, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemWhat kind of error does it come? are you able to log on the same pc with another user? Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolvedCheers! Farah","So on other pc’s i have multiple users but can not login with them, only the current user. It looks like i am only using the local domain cache to login and the pc is not communicating with the domain controller correctly","When you log with another user, what error message exactly appear? It could be that the PC has lost trust with the domain, which happens often"]}]}