{"windows":[{"symptom":"Biometric fingerprint scanner suggestion        I would like if Windows Hello added some way for me to use my fingerprint scanner to login to my computer games (Everquest 2, Diablo 3 and future versions).  If I could just swipe my fingerprint and  get in my games faster that would be AWESOME! Oh and add a topic for Windows Hello.  Thank your time.","solutions":["There is a topic for Windows hello. And I moved you there."]},{"symptom":"VPN and Windows 10        Hi! I have a strange issue with my Windows.I have a VPN-subscription, and I use the application I got from the VPN-provider, because the built-in VPN option in Windows is absolute worthless.Since I am using it, the system tray icon says no internet, but my internet working even better than before. Also my Outlook app is unable to download my mails, I have to use the web interface of Outlook in my browser.Whenever I open the Microsoft Store, I get the message 'It doesn't look like you are connected to the internet. Check your connection and try again.', and an error code: 0x800704cfWhy does the Windows Store and the Outlook app not working properly, when everything else does?","solutions":["Build in VPN in Windows required VPN server and is an interface to communicate with server and it works quick good but it doesn't provide functionality which you required, so call it worthless is unfair.You are using third-party VPN program to connect to another country with VPN server , is that correct?In some cases, the destination server won't support some websites or protocols.In such case, you will need to check with VPN provider.","Hi, donald421 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"won't let me delete stuff without administrator access even though I'm the administrator        every time I want to delete something I can't, its all In the windows drive and I have moved it to were I want but it duplicated the file and now that I want to delete it I cant because it keeps telling me to get admin permission but I am the admin","solutions":["Hi EthanVanderMey and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.“Access Denied” Folder Errors on Windows 10\" https:\/\/www.makeuseof.com\/tag\/fix-access-denied...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows 10 Home Product Key        I installed Windows 10 online and it loaded as Pro but I have a Home product key. Microsoft told me to reinstall windows 10 Home from the USB I purchased and that it would change to Home. Well it hasn't. I still show running Pro but only have a product key for home. It hasn't asked me for an activation key. Confused on what to do and could use some help. Thanks","solutions":["Hi Thomas, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.To downgrade to Windows 10 Home, a reinstall is required. Technically you should be prompted for which edition of Windows to install. Didn't it ask?I suggest downloading ei.cfg file for home and paste it into Sources folder of the flash drive to force Install Windows 10 Home.How to force Windows 10 Installation media to install a desired version? https:\/\/www.yourwindowsguide.com\/2018\/06\/force-...How to do a clean install https:\/\/answers.microsoft.com\/en-us\/insider\/for...https:\/\/answers.microsoft.com\/en-us\/windows\/for...","Did you boot from the USB media and select Custom install then delete all existing partitions. This is a clean install otherwise you can't \"downgrade\" from Pro to Home.All files will be removed so backup any personal files first.","There is the problem with activation of window 10 pro.Error code: 0xC004F074 has occured.Help me to out from this trouble, sir"]},{"symptom":"I WANT TO COPY A FORMULA  IN A COLUMN TO THE \"ANSWER\" IN A SECOND COLUMN.        I WANT TO COPY A FORMULA IN A COLUMN TO THE  \"ANSWER\"IN A SECOND COLUMN.","solutions":["Hi Hampton We need a bit more detail to be able to help you What formula are your trying to copy and what is the expected output of that formula in the second column . . .If possible, please provide a screenshot of your data so we may understand the problem in more detail . .","I SIMPLY  WANT TO TRANSFER A FORMULA  IN A LIST (COLUMN) TO ANOTHER  COLUMN - BUT THE NEW COLUMN - WILL REFLECT THE RESULT OF THE FORMULA.  IE    =+DATA!GA   TRANSFER TO  132   (OR WHATEVER).   SIMPLY COPYING A LIST OF FORMULAS TO A LIST OF \"ANSWERS\".THANK YOU!"]},{"symptom":"Sir i am unable to update windows 7, code shown \"WindowsUpdate_8007000E\"        Urgent Help needed.","solutions":["Try Download Update Troubleshooter for Windows 7 and Windows 8"]},{"symptom":"having my microsoft web cam work in Win10        it does not work VX-1000  help please or do I just buy a new  one?","solutions":["Hi RBBarnier I'll try to help you out According to the product page of the webcam : https:\/\/www.microsoft.com\/accessories\/en-us\/d\/l...You shouldn't have to use any specific software in order for the webcam to work. However, it may also have became un-compatible with Windows 10 after a specific build\/update.Is the webcam at least seen by Windows ? Does it appear in the device manager ? You can try to use the original software of the webcam, to check if this improves the situation.I'll wait for your news Regards"]},{"symptom":"How to restore the apps after Microsoft update .please        How does my computer restore the apps after Microsoft update. Lost everything.","solutions":["Hi, TeresaGreen2 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"If i try to install minecraft windows 10 it shows this message.        So before i used to own minecraft windows 10 on another computer and so im trying to download minecraft windows 10 for the past few days and heres what it says :https:\/\/prnt.sc\/qmaftfAnd also this :https:\/\/prnt.sc\/qmai2rThanks for reading and i guess if you do answer also thanks :DAny answer would be appreciated.And yes i  am on windows 10 and everything is fine on my computer i checked everything.","solutions":["Hi, The latest version of Minecraft requires build 1903 at least released last year. Your current build is 1511, released in 2015 hence the issue. Please go to https:\/\/www.microsoft.com\/en-in\/software-download\/windows10 And choose update this PC. Follow the on screen instructions which should install the latest release. Let us know how that goes. ","Thank you for that information. As per checking the system requirements for the game it requires a windows 10 build version of 17134.0 whereas you are currently on the 1511 version of build number 10586.I would recommend performing a windows update for you to be able to install Minecraft for windows 10.I've attached the game's system requirements as a reference. Let me know how it goes. :)"]},{"symptom":"ram, hardware        will there be a problem if I use both, i mean in performance ____samsung DDR4 2400T____hyperx DDR4 2400","solutions":["Hi Suraj, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.As long as the motherboard manual says they are compatible, there should be no issue of using different brands.I hope that helps.","Hi Suraj, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.As long as the motherboard manual says they are compatible, there should be no issue of using different brands.I hope that helps. will the different brand create any problem","Hi,As I said no issue."]},{"symptom":"windows powershell can I remove it?        How do I remove windows powershell? It tkaes forever to sign in! I really hate this thing!","solutions":["The PowerShell has nothing to do with signing in to windows. Just don't use PowerShell if you don't want to, you can change it to the old Command Prompt if you wish.Setting >  Personalisation and select Taskbar see the setting to replace the command prompt with PowerShell, toggle off for the old command prompt.If this is not what you mean then explain more please.","Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Powershell is a crucial component of the operating system, so unfortunately you can’t remove it. What are you trying to do that is taking a long time with Powershell?Regards, Ross"]},{"symptom":"100% CPU Usage after upgrading to Windows 10        I had a Windows 7 Professional and then thought about upgrading to Windows 10 since Windows 7 is coming to end. When I upgraded to Windows 10 i got a random Blue Screen. My PC restarted i opened Task Manager and there it is 100% CPU Usage non-stop. Its really annoying i read the same problem of some guy on this kinda forum, and followed his steps. None of them worked and i'm really annoyed by Windows 10. This never happened on Windows 7 and i'm really hoping there is a way to fix this.My PC:CPU: Intel Core i5 2400 3,10GHzRAM:12GB(4x3)Graphics Card: Nvidia Geforce GTX 1050 Ti 4GB GDDR5HDD:1TBI am waiting for help.","solutions":[]},{"symptom":"Memory Usage problem, can anyone please tell me how to fix it?        can anyone please help me, i'm getting that problem since i first update my window","solutions":["Hi Kanwar, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.It looks like Windows Defender is scanning your device continuously - one of the reasons might be disk corruption.How to do a Disk check of System drive in Windows 10 and interpret the logs https:\/\/www.yourwindowsguide.com\/2018\/04\/how-to...If the log looks clean you may check the answer marked here. https:\/\/answers.microsoft.com\/en-us\/windows\/for...Word of caution - Disabling periodic scan might pose a security risk. Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads."]},{"symptom":"Nvidia Released new Geforce  DCH & STANDARD WHQL Driver  v441.87 for notebooks gpu's & desktops gpu's to Windows 64bit on 06-01-2020        On 06-01-2020 Nvidia company has released the new Geforce DCH & STANDARD whql driver v441.87 for Windows 10 64 bit onlyOn 07-01-2020 I successfully installed the latest driver via another special method on windows 10 64bit 1909 build no 18363.535I would recommend you install the customized and certified driver for your laptop model from the manufacturer support site only.I would recommend you install the customized and certified driver fo desktop GPU model from the OEM manufacturer support site only.I am sharing only Generic driver links in this post.I am sharing the direct downloading link from Nvidia's official website for laptop builtin graphics cards and PCLe desktop graphics cardsfor DCH based notebook driverhttp:\/\/us.download.nvidia.com\/Windows\/441.87\/441.87-notebook-win10-64bit-international-dch-whql.exefor  STANDARD based notebook driverhttp:\/\/us.download.nvidia.com\/Windows\/441.87\/441.87-notebook-win10-64bit-international-whql.exefor DCH based desktop driver http:\/\/us.download.nvidia.com\/Windows\/441.87\/441.87-desktop-win10-64bit-international-dch-whql.exefor  STANDARD based desktop driverhttp:\/\/us.download.nvidia.com\/Windows\/441.87\/441.87-desktop-win10-64bit-international-whql.exefor release notes v441.87 in pdfhttp:\/\/us.download.nvidia.com\/Windows\/441.87\/441.87-win10-win8-win7-release-notes.pdfGaming TechnologyGame Ready Drivers provide the best possible gaming experience for all major new releases.Prior to a new title launching, our driver team is working up until the last minute to ensure everyperformance tweak and bug fix is included for the best gameplay on day-1.Highlights of this driver::01.Game Ready for Wolfenstein: Youngblood with Ray Tracing02.Maximum Frame Rate03.Variable Rate Super Sampling04.Image Sharpening Improvements05.Freestyle ‘Splitscreen’ Filter06.33 New Optimal Game Settings07.New G-SYNC Compatible DisplaysDiscontinued Support::3D VisionNVIDIA Kepler GPUs for Notebooks32-bit Operating SystemsSupported geforce cards for laptopsGeForce RTX 20 Series (Notebooks)GeForce RTX 2080, GeForce RTX 2070, GeForce RTX 2060GeForce MX200 Series (Notebooks)GeForce MX250, GeForce MX230GeForce MX100 Series (Notebook)GeForce MX150, GeForce MX130, GeForce MX110GeForce GTX 16 Series (Notebooks)GeForce GTX 1660 Ti, GeForce GTX 1650GeForce 10 Series (Notebooks)GeForce GTX 1080, GeForce GTX 1070, GeForce GTX 1060, GeForce GTX 1050 Ti, GeForce GTX 1050GeForce 900M Series (Notebooks)GeForce GTX 980M, GeForce GTX 980M, GeForce GTX 970M, GeForce GTX 965M, GeForce GTX 960M, GeForce GTX 950M, GeForce GTX 945M, GeForce 940MX,GeForce 930MX, GeForce 920MX, GeForce 940M, GeForce 930MGeForce 800M Series (Notebooks)GeForce GTX 860M, GeForce GTX 850M, GeForce 845M, GeForce 840M, GeForce 830MSupported desktop graphics cardsNVIDIA TITAN Series:NVIDIA TITAN RTX, NVIDIA TITAN V, NVIDIA TITAN Xp, NVIDIA TITAN X (Pascal), GeForce GTX TITAN X, GeForce GTX TITAN, GeForce GTX TITAN Black, GeForce GTX TITAN ZGeForce RTX 20 Series:GeForce RTX 2080 Ti, GeForce RTX 2080 SUPER, GeForce RTX 2080, GeForce RTX 2070 SUPER, GeForce RTX 2070, GeForce RTX 2060 SUPER, GeForce RTX 2060GeForce 16 Series:GeForce GTX 1660 SUPER, GeForce GTX 1650 SUPER, GeForce GTX 1660 Ti, GeForce GTX 1660, GeForce GTX 1650GeForce 10 Series:GeForce GTX 1080 Ti, GeForce GTX 1080, GeForce GTX 1070 Ti, GeForce GTX 1070, GeForce GTX 1060, GeForce GTX 1050 Ti, GeForce GTX 1050, GeForce GT 1030GeForce 900 Series:GeForce GTX 980 Ti, GeForce GTX 980, GeForce GTX 970, GeForce GTX 960, GeForce GTX 950GeForce 700 Series:GeForce GTX 780 Ti, GeForce GTX 780, GeForce GTX 770, GeForce GTX 760, GeForce GTX 760 Ti (OEM), GeForce GTX 750 Ti, GeForce GTX 750, GeForce GTX 745, GeForce GT 740, GeForce GT 730, GeForce GT 720, GeForce GT 710GeForce 600 Series:GeForce GTX 690, GeForce GTX 680, GeForce GTX 670, GeForce GTX 660 Ti, GeForce GTX 660, GeForce GTX 650 Ti BOOST, GeForce GTX 650 Ti, GeForce GTX 650, GeForce GTX 645, GeForce GT 640, GeForce GT 635, GeForce GT 630The source is taken from https:\/\/www.nvidia.com\/Download\/driverResults.aspx\/156281\/en-ushttps:\/\/www.nvidia.com\/Download\/driverResults.aspx\/156282\/en-usThanks for reading my post, If any user finds this  post  is useful means, then give UPVOTES","solutions":[]},{"symptom":"Microsoft account login password error        I just got a new computer. I am unable to register this device with my Microsoft account or use it to log into Microsoft because while it accepts my correct password at the first stage, it always claims my password is incorrect at the next stage when it prompts me to enter my password \"one last time\". I have made sure over dozen of tries that I am entering my password correctly, the same way, both times. I have changed my password to make absolute sure I know what it is.I got to Settings > Accounts > Your Info > Sign in with a Microsoft account instead. First step, enter email address. Accepted. Second step, enter password. Accepted. Then, this prompt:Sign into this computer using your Microsoft accountNext time you sign into this computer, use your Microsoft account password or, if you've set it up, your PIN or Windows Hello.We'll need your current Windows password one last time.The password you entered for your device is incorrect. Please try again.No matter what I do, it always claims my correct password is incorrect. Please help!","solutions":["Hi Laura. I'm Greg, an installation specialist and 9 year Windows MVP, here to help you.How about trying to change the password? https:\/\/support.microsoft.com\/en-us\/help\/402697...If not possible then user Microsoft Account Recovery to reset password: https:\/\/support.microsoft.com\/te-in\/help\/17875\/...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hello, On the 'We'll need your current Windows password one last time' screen, you need to enter your local account password, not Microsoft account password.Hope this helps!","I am having this issue and was wondering where I would find my local account password I only know my password I have for my email and xboxalso if you mean the password you set to log into your pc I dont have one the pc is new and I did not set it yet","I had the same problem. I finally figured it out 2 hours later on my own. try leaving local password blank.","Hello, On the 'We'll need your current Windows password one last time' screen, you need to enter your local account password, not Microsoft account password.Hope this helps! Thank you so much!","I had the same problem. I finally figured it out 2 hours later on my own. try leaving local password blank.Thank you. This worked for me.","Thank you Luthifer, you are the boss","I had the same problem. I finally figured it out 2 hours later on my own. try leaving local password blank.I let it blank and it works for me, thank you","Thanks man....","I reset my password and it's still saying that its incorrect. (Update: I figured it out, I was supposed to leave it blank apparently"]},{"symptom":"Ark Survival Evolved        Ark crashes as soon as i open it (windows 10) and have tried to fix but am not able to. My pc meets the requirements and everything Is up to date. what can I do?","solutions":["Hi, WittyExpert3784 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"windows 10 installation has failed        im updating from win10 1703 to 1909 after i downloaded win10 1909 an error occured and it says \"windows 10 installation has failed\"my pc specs i7 7700hq gtx 1060 16gb ram","solutions":["Hi marwan, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Let us check the Installation log to find why the update failed. Please share the logs as mentioned in this article. You should use a File sharing service like Onedrive or Media Fire to upload files and share the link in the next reply.https:\/\/answers.microsoft.com\/en-us\/windows\/for...The Panther logs. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\PantherThe Rollback logs: These usually are created if Windows Update rolls back. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\Rollback[Only if the error code is 0xC1900101-0x30018] The Device Install Log from C:\/$Windows.~bt\\Sources\\Rollback\\setupapi\\setupapi.dev.logAs the log size might be large consider zipping before uploading."]},{"symptom":"getting into old info stored by Clickfree in new computer        I was able to store all my data from my old computer before it died in a clickfree devise.  I downloaded it all into my new computer.  Now how do I access it?","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.I have found a previous thread which answers your query: https:\/\/answers.microsoft.com\/en-us\/windows\/for...Regards, Ross"]},{"symptom":"windows 7        Several years ago my computer upgraded itself to windows 10 from windows 7. Things went fine for awhile but then I could not boot up the computer and had to do a revert to get it to reboot. Is this going to happen again if I upgrade it again? I can't afford a new computer at this time.","solutions":["We don't know if it will happen again.We don't work for Microsoft.The free upgrade to 10 is yours for the life of that device.The best method to upgrade back to 10 is to clean install it.Use the Windows 10 media creation tool on the Software download page \"Start fresh with a clean installation of Windows 10\"https:\/\/www.microsoft.com\/en-us\/software-download\/windows10startfreshReinstall Windows 10:https:\/\/support.microsoft.com\/en-us\/help\/4000735\/windows-10-reinstall\"How to Clean Install Windows 10\"http:\/\/www.tenforums.com\/tutorials\/1950-windows-10-clean-install.html_______________________________________________How to Create Bootable USB Flash Drive to Install Windows 10 fromThis tutorial will show you how to create a bootable USB flash drive that can be used to installWindows 10 with or without UEFI.________________________________________________To access BIOS\/UEFI - UEFI\/EFI configuration:https:\/\/neosmart.net\/wiki\/boot-usb-drive\/_____________________________________When your free upgrade to 10 was  originally activated Microsoft will have kept the Hardware Configuration details of your device on their Servers for recognition purposes if you have to reinstall 10.\"Activation in Windows 10\" (Digital entitlement)https:\/\/support.microsoft.com\/en-au\/help\/12440\/windows-10-activation"]},{"symptom":"received a faulty ssd, installed new win10 software. When the new drive arrives, will I be able to install again with same product code?        Bad ssd","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,First, you'd need to identify if the product key for the windows 10 computer is either a retail or an OEM key.Normally OEM keys are solely embedded to one motherboard as they do not have transfer rights for other hardware, unlike retail keys which has transfer rights.For free upgrade licenses, the condition for these are relevant to an OEM key as the license is then considered a digital license once you upgraded free to windows 10.Under this link are reference to activation after hardware change https:\/\/support.microsoft.com\/en-ph\/help\/20530\/...For your windows 10 license, I'd recommend running the activation troubleshooter on the new ssd with the same motherboard. Go to Settings>Update and security>Activation and run the troubleshooter. and select I recently changed hardware on this device.If the troubleshooter hasn't helped, you would have to call Microsoft during support hours to get more help.https:\/\/support.microsoft.com\/en-in\/help\/405170...","If all you are changing is the SSD then you should be able to install Windows 10 using the same licence on new storage.The licence agreement allows OEM or Retail to be installed on original or new storage as many times as you require. The licence is registered against the motherboard for activation purposes."]}]}