{"windows":[{"symptom":"\"This file does not have an app associated with it for performing this action... Regarding external optical drive and DVD.\"        Hello, I have an old DVD containing media on it. I recently bought a external optical drive and have been using it without issues. I put the DVD in the drive and waited while it read it. Once it appeared to have finished I double clicked on the file in an attempt to open it and access the media. Upon doing this I got a message saying \"This file does not have an app associated with it for performing this action. Please install an app or, if one is already installed, create an association in the Default Apps Settings page.\" I did a system file scan and there are no issues there.  ","solutions":["Hi ErikTCG, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.It sounds like the file on the DVD does not have a program associated it. Are you able to tell us what kind of file it is? (For example, a .doc file or .mkv file)You can right click on one of the files, then choose Open With > Choose another appOR On the Start menu, select Settings > Apps > Default apps. Then if you are able to locate the type of tile there, you can specify the program thereI hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"boot disk        What key do I use to use boot up disk","solutions":["Hi Michael To boot from a USB or DVD, you need to generally change the boot order in BIOS, unless your system is a Dell . ..Insert the boot disk Start your PC, then on the manufacturers logo screen, repeatedly press the F2 key to boot into BIOS, then once you are in BIOS, look for Boot priority and set the boot disk to top of the boot orderIf F2 does not work for you, try F10 or the Del key repeatedly on the Manufacturers logo screen . . .If you have a Dell system, on the Dell logo screen, repeatedly press the F12 key, to bring up the Temporary boot menu and chose the Boot Disk drive . . .If none of the above works for you, what is the make and exact Model No. of your PC - that will be printed on a sticker on the bottom casing . . ."]},{"symptom":"AOL ACCT ISSUE        NEW COMPUTER had to get mcafee to transfer my antivirus software from old comp to new one. they took almost 2 hours to do that. finally got it done but now when I go to aol home page and go to retrieve mail a page comes up saying it won't connect and shows guce.advertising to check on bing. oand under that TO REFRESH. after refreshing twice it will load aol mail page and when done it does the same thing and I have to refresh twice again to get it to sign out. read that guce is a form of malware and want to get it off my aol and aol mail. have deleted aol for now.thanks,charlie","solutions":["Hi Charlie, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.User Ron Baker has contacted AOL support and they offered the following solution:1. Go to Internet Options ( search it from the 'Start' button ) 2. Go to the second tab(\"Security\") 3. For the first zone, named \"Internet\" - press Reset all zones to default level 4. Go to the third zone: \"Trusted Sites\" and click on \"Sites\" 5. Type in https:\/\/guce.advertising.com then click on Add and Close6. Hit Ok and reboot the browser. Source: https:\/\/answers.microsoft.com\/en-us\/edge\/forum\/... I hope this has helped you. If this did not help, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"Error 404.        While opening google chrome none of my apps will open.  Aw snap...something happened while trying to open.  Is my problem windows or my wifi.  Can someone steer me in the right direction to fix my laptop?  This may all be related to a 404 error.  How can I fix this?","solutions":[]},{"symptom":"RIP error on one track of an albumn with Windows Media Player        How do I fix a RIP error with windows media player. Windows 10 but I do not know the version of media player ","solutions":["Hi JamesCasper, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Can you share the message or error code? Happy Holidays Regards, Marc M."]},{"symptom":"install upgrade win 10 pro on win 8.1 device        After a long I decide to upgrade my windows from 8.1 to 10 prohave purchase win 10 pro and start to install as upgrade not fresh because I don't want to lose any programs or files.but installation stop after checking my system and show two application should be delete manually firstwhich those two not available in my device I check with regedit all system not available 1 Nero - Burning Rom2 PC-cillin Internet Securitythese two app which I don't have and stop my installation for upgrade to win 10 proif some one can help methanksAli               ","solutions":["Hi Alah, Could this programs be installed previously? They may not be deleted correctly. You may try to reinstall them and then remove again.Try special third-party tool to delete any traces of these programs - Nero General Clean Tool for Nero and ask PC-cillin support for similar tool.","Hi every one1 day searching then last find the problem for this situationthose programs not install in my system just stay in external drive in archive applications and I don't know why windows want I delete them because as soon as I remove them from hard there is no any more error and problem solvedthanks for all try to help and viewing this post ","Windows looks for program's files, it cannot verify are they in usage or not.","Yes right but now after 24 hours search find that possible in alert mention remove app not uninstall","Unfortunately there are technical writers who create documentation not developers and sometime contacts between them are not close enough. :("]},{"symptom":"Pasword        I want to reuse an old password for my Microsoft Account but you will not allow it.  You complete and utter JERKS!!!! Do you have any **** idea how hard it is to have to remember multiple passwords for diffrent sites, services, sysytems, etc. etc. etc. WHAT GIVES MICRSOFT THE RIGHT TO CHOOSE WHAT PASSWORDS I CAN USE ON MY ACCOUNT!!!!","solutions":["Hi, We aren't able to help with this here. This is the community forum, I would recommend leaving feedback in the Feedback Hub app.With regard to the password rules it's to make your account more secure, if your password is compromised during a data breach it's far less likely someone could gain access to your account if you have used a different password. I would suggest using a password manager if you have trouble remembering different passwords. It's recommended to have as many different ones for different services as possible.I hope that helps."]},{"symptom":"microsoft store        Try that againPage could not be loaded. Please try againReport this problem \/ Refresh pageErrorCode: 0x80131500CV:  EoBpdBm36k2mSGIW","solutions":["Hi Kathi, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Follow the instructions of the Windows MVP, he shares his experience and how to solve this error 0x80131500https:\/\/www.thewindowsclub.com\/microsoft-store-...Let me know if you have something else that I can help you with, I'd be happy to help.Happy Holidays Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Blue screen problem        I am getting this info and need help. Stop code: Page fault in nonpaged area    What failed: Netwtw06.sys","solutions":["Hi CalRamage Netwtw06.sys is the device driver on your Intel Wireless card . . . Try updating that from the Intel website, to see if that resolves this problem, if that does not, then an older version of that driver may be more compatible with your PC . . .Go to the support page for your device on the manufacturers website, then download and install the Intel WirelessLAN driver they recommend, it may well be an older version to the one you are currently running . . ."]},{"symptom":"HP Pavilion 15-cs2051od - No way to change scrolling options?        I've been looking EVERYWHERE on this computer on how to change the scroll settings. Right now, if I scroll down, it brings me back to the top of the page. I want it to do the opposite. When I am scrolling down, I want to view down the page. But I've looked under every computer setting I could find including the Touchpad and Mouse options (and their advanced settings) and there is just NO way to change the scrolling there. Does someone know a secret that I don't on how to get the scrolling changed? This is just personal preference.","solutions":["Go Settings, in the box at the top type scroll.   Click on the item you think will help.","Hi Mi-LinhSilva, My name is Riccardo and I'd be happy to assist. Here are a few things we can try... Step 1 - Go to Advanced Touch Pad Settings Go to Start > type in Touchpad settings > click Touchpad Settings icon Click Additional Settings > it should open up the advanced settings for your specific touchpad where you can change it...Other option is go here: https:\/\/ftp.hp.com\/pub\/softpaq\/sp94501-95000\/sp... Above is the touchpad download for the drivers. Install this and it will set things back to original factory settings which should fix the issue you are having...Let me know if you continue to have issues, I will be here until its fixed."]},{"symptom":"Minecraft windows 10 wont download        i purchased a key for minecraft. I redeemed it however when i go into the windows store to download i click install and it says, checking product file, almost ready etc. But then it says \"downloading...\" sometimes \"downloading... 65KB\" or \"downloading... 130 kb\" but nothing actually downloads. How do i fix this so i can download minecraft?","solutions":["Hi MuhammadKhalid3 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found a video tutorial that will help you resolve your concerns. You can check and see if the instructions provided can help you.https:\/\/www.youtube.com\/watch?v=wM-Jrr3WfI8I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"The Meaning Of Blue Screen Code 0x0000005C        What Is the Meaning Of BSOD Code HAL_INITIALIZATION_FAILED?","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.This article give a good explanation and some troubleshooting steps to follow: https:\/\/www.thewindowsclub.com\/hal-initializati...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Audio        My audio-only works on one of my computer account but not the other.","solutions":["Hi Tensaye. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you all possible solutions for Sound problems in order of priority, so please try any you've already tried again in order. If you have any problems performing any steps I'll be standing by here to help you.1) Update the sound driver from the PC or device maker's Support Downloads webpage for your exact model, if it is newer than the one presently installed in Device Manager reached by right clicking the Start button. While there compare to make sure you also have the latest BIOS, Chipset, Display, Network and all other drivers. 2) Restore the Windows Audio Service which may have become disabled: https:\/\/www.tenforums.com\/tutorials\/57567-resto... 3) Next try these checklists: https:\/\/support.microsoft.com\/en-in\/help\/402699... https:\/\/www.howtogeek.com\/443702\/how-to-fix-sou...4) Right click Volume icon in System Tray, choose Sound Settings, from the Output and Input devices dropdown menus, choose then one(s) affected to see if that helps. If not use the Troubleshoot button nearby.5) Run the Playing Sound troubleshooter at Start button > Settings>Update & Security>Troubleshoot.6) Try rolling back the sound drivers in Device Manager reached by right clicking the Start button. Choose Sound controller and other audio devices, then Driver tab, then Roll back if available.7) If no newer sound drivers then uninstall the one presently installed in Device Manager, reached by right clicking the Start Button. Restart PC to reinstall.8) Try other and older drivers for your model Sound controller, too. For example, try the next oldest driver in the model's online Support Downloads list. To try all previous drivers installed on your system, in Device Manager choose Sound controller's Driver tab, then Update Driver, then Browse, then Let Me Pick. Finally, try installing the latest Sound driver in Compatibility Mode as shown here:https:\/\/social.technet.microsoft.com\/Forums\/win...9) If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 10) If this was caused by a Version update (which you can confirm at Settings > System > About) then you can roll back the version in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 11) You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... 12) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, also Step 16 to test a new Local Account which may prove that yours is corrupted beyond repair so you can replace it. Then continue with the other steps to go over your install most thoroughly.13) If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I am just going to rest my whole pc.","See here to Reset Windows 10: https:\/\/www.zdnet.com\/article\/windows-10-tip-re...Keep me posted on your progress as I will be here to help until the case is resolved.","Yes it did work.","Really glad to hear it, Tensaye. Let me know if there's anything else. Also when ready please mark the post which helped most as the Answer, to help others.Happy New Year!"]},{"symptom":"Windows Easy Transfer using CD\/DVD        I am trying to use Windows Easy Transfer to transfer my files from a Windows 7 laptop to my new Windows 10 laptop using a CD for the transfer.  I get as far as putting in my password and to the next window where it shows the File Name and Save as Type. That window does not show the CD or DVD option to choose.  It only shows OS (C:), Recovery (D), under Hard Disc Drives.  Under Devices with Removable Storage it only shows DVD RW Drive (G:) HDShredder which is highlighted.  If I click save I get an error that says, You can't save here. Please choose another location.What am I doing wrong and how can I fix this.  I need to get my files transferred before Windows 7 is no longer supported.Thanks.Leanne","solutions":["Windows 10 does not support Windows Easy Transfer.  In addition, CDs or DVDs just don't have the capacity to be practical.Furthermore, your files will not disappear (or turn into pumpkins) on January 14, the date that Microsoft will stop supporting Windows 7.  You need not rush to make the transfer.If you really want to use a tool like Windows Easy Transfer, the one that Microsoft recommended was Laplink's PCMover Express: https:\/\/www.microsoft.com\/en-us%2Fwindows%2Ftransfer-your-dataHowever, in the opinion of many contributors here, the easiest way to transfer data is to use a USB flash drive:connect a USB flash drive (\"thumb drive\") of some reasonable capacity to your Windows 7 laptopCOPY the files from the Windows 7 laptop to the flash driveeject the flash drive (right-click on it in Windows Explorer or use the \"Safely remove hardware\" icon next to the time display)connect the flash drive to your new Windows 10 laptopCOPY the files from the flash drive to the appropriate locations on your new laptop.You should always COPY rather than MOVE files.  After you are certain that the files are in their new correct locations and you have no problems accessing them, you can delete them from the flash drive (and from the old laptop if you're planning on discarding it).These days, very large USB flash drives are quite inexpensive.  See, for example,https:\/\/www.amazon.com\/s?k=usb+flash+driveA USB 3.0 flash drive will transfer the data much faster than a USB 2.0 unit.  Your new laptop very likely will have USB 3.0 ports (with a blue insert).  If your old laptop only has USB 2.0 ports (with a black insert), a USB 3.0 unit will work, but it will only transfer at USB 2.0 speeds.","So this flash drive worked well for my word docs, pics, and favorites but I am wondering if this will also work for my emails and contacts.  I have always used Windows Live Mail for my emails and since Windows 10 does not have Windows Live Mail is this going to be a problem?Thank you.Leanne","I don't use Windows Live Mail, but there are others here who are quite knowledgeable about it.I suggest that you ask a new question: \"How do I move my emails and contacts from Windows Live Mail to Windows 10\"Here's the WLM section:  https:\/\/answers.microsoft.com\/en-us\/windowslive\/forum\/livemail?sort=LastReplyDate&dir=Desc&tab=All&status=all"]},{"symptom":"laptop ssd        I am using dell Vostro 2520 laptop recently my hdd got damaged so I go to dell service centre to replace with another one they told me to install ssd instead of hdd it will be more convenient so I install it no I use dell system detect app my question can I use it to check my pc condition after installing ssd is it good to use now ","solutions":["Hi Debashis Rest assured, it is perfectly safe to run System Detect with that SSD installed on your System . . ."]},{"symptom":"Windows 10 Boot Error        So turned pc off unplugged it, moved it to a different room, plugged back in, black screen and won’t boot to windows only MSI then skips to spinning dots screen.After 3rd restart manage to get it to boot to the repair screen. Tried repair through there it doesn’t work just goes round in a loop. Safe mode also doesn’t work goes into the similar loop after attempting a repair. and the restore point also doesn’t work as it can’t find one. I gave up and tried to do a restore with keeping my files. However this got to 6% froze and then the pc undid any changes and then went back to square one of the loop issue not booting to windows.  Anyone got any ideas on what to try nextThanks","solutions":["Hi Sam. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Is the hard drive detected in BIOS\/UEFI Setup accessed by one of these methods: https:\/\/www.mydigitallife.net\/comprehensive-lis...Check under Storage and also in the Boot Priority, which should remain Windows Boot Manager for UEFI installs and Windows Hard Drive for Legacy installs.If the hard drive is detected Test the hard drive or SSD with diagnostics: https:\/\/www.lifewire.com\/free-hard-drive-testin...https:\/\/mashtips.com\/ssd-health-test-and-perfor...HP and Dell have hardware diagnostics triggered by tapping the ESC or F12 keys respectively as you power on.Best is to use the HDD\/SSD manufacturer's own if there is one, otherwise use Seatools bootable long test:http:\/\/blog.nowherelan.com\/2013\/04\/04\/boot-seat... Follow this up with a full Disk Check from the Command Prompt in Repair Mode or from bootable media:https:\/\/www.groovypost.com\/howto\/check-hard-dri... if necessary from the Command Prompt at boot:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... If the drive has failed I'd replace it with an SSD which is the best Upgrade one can have - lightning fast, faster than a new higher-end PC without one, especially if you do the gold standard Clean Install in this link which compiles the best possible install which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If the drive is intact and good, then Unplug power and remove battery, press and hold power button for 30 seconds to release all power from circuitry, plug back in and power up to see if any change.I will give you steps to access the Repair Mode to try all repairs to get Windows started, and if not to do the automated Reset or the superior Clean Install after rescuing your files.1) Use whichever method works in this link to access Advanced Startup Options: https:\/\/www.tenforums.com\/tutorials\/2294-advanc.... Easiest may be to force shut down the PC (by holding in the power button) three separate times to trigger the Startup Options. If one of these methods work, then go to Step 3.2) If none of the other methods work it may be necessary to Create Windows 10 Installation Media on another PC following the steps in the middle of the downloads page here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... Make sure to uncheck the box for Recommended Settings to choose only the licensed version.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... Choose the boot device as a UEFI device if offered, then on second screen choose Repair Your Computer. If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first. There is always a way to get the media booted and I will guide you until it does, even if necessary to reset the BIOS to defaults via several methods.3) In the Advanced Troubleshooting options try to System Restore to a point before the problems began, try the new Uninstall Updates button, then Startup Repair, then if necessary from Startup Settings try to get into Safe Mode with Networking, or lastly Safe Mode. If Startup Settings aren't available you can force Safe Mode from the Command Prompt following Step 5 here:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf..., or using the command to unhide F8 Advanced Boot Options here:https:\/\/www.tenforums.com\/tutorials\/22455-enabl... where you can also try the old reliable Last Known Good Configuration.4) From Safe Mode w\/Networking work through the Windows 10 Install Integrity Checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... Update your drivers from the PC's Support Downloads web page. Compare the latest drivers with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.5) If Safe Mode doesn’t work or help stabilize things then return to Advanced Troubleshoot options. Next try Command Prompt to run through Windows 10 Install Integrity Checklist (above link) Step 10 repair commands including sfc \/scannow, DISM, a full Disk Check: https:\/\/www.groovypost.com\/howto\/check-hard-dri..., or return to Troubleshoot options to Reset Your Windows 10 PC.6) Better yet use the same booted media to do the vastly superior Clean Install following the steps in this link to delete all partitions down to Unallocated Space to get it cleanest:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... 7) There is a step to Rescue Files from the booted media or Repair Mode Command Prompt first:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... These steps are excerpted from my tutorial that compiles everything possible for Troubleshooting Windows 10 Failure to Start:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... You can continue with the other steps there.To test hardware, Dell and HP have onboard diagnostics triggered by powering up and pressing the F12 and ESC key respectively.Test the RAM overnight to stress it with the best bootable test memtest86, following these steps which test both the sticks and the slots:https:\/\/www.wikihow.com\/Test-PC-RAM-with-MemTest86Test the hard drive with diagnostics: https:\/\/www.lifewire.com\/free-hard-drive-testin...Best is to use the manufacturer's own if there is one, otherwise use Seatools bootable long test:http:\/\/blog.nowherelan.com\/2013\/04\/04\/boot-seat... Follow this up with a full Disk Check: https:\/\/www.groovypost.com\/howto\/check-hard-dri... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer There are links to a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","hithanks for this tried everything hard drive is all okay etc. But still nothing you suggested was working, i ended up doing a full MSI factory reset \/ reimage. That worked i then was redownloading my lost applications the computer froze mid download no response at all. I was forced to turn off by holding the power button. Now back to square 1!! Having to do another factory reset! Any ideas the computer is only 6months old.","If you only did the inferior Reset then everything was NOT tried. The very best thing you could do for the boot error and other symptoms there is to wipe the hard drive to do the gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... The reason I suggest this is that no one of millions who has adopted the install in the above link has ever come back to report further problems I've seen, including another version failure. This is because everything in Windows 10 is dependent upon the quality of the install, especially Version Updates which will choke on lesser quality installs. Whether we like it or not, this is where we are in Windows 10.To create bootable Windows 10 Installation Media (on another PC if necessary) install Media Creation Tool and follow the directions in the middle of the download page here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key for your PC maker given in this chart:https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, then on second screen choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, select the Unallocated Space, click Next to let it create and format the needed partitions and start install - this makes it foolproof.You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC because you will learn everything that works best and how to apply it with your own hands.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Printer printing  only blank pages after last Windows 7 update        I have Windows 7.   After the last system updates my printer prints only blank pages.  My printer is an EPSON CX9400FAX.   Is anyone else having this same issue?   It appears that the printer is no longer recognized as an accepted device.   ","solutions":["I suspect that the timing of this problem with system updates is likely to be a coincidence, but please do the following.1.  Click Start, type Windows Update in the search box, and press Enter.Click \"View update history\" in the left pane of the Windows Update windowReport the \"last system updates\" that preceded the printing problem2.  Open Devices and Printers.  Right-click the icon for your EPSON CX9400FAX and select \"Printer properties.\"  Click the \"Print test page\" button. 3.  Use the printer's front panel controls to print a \"Nozzle check\" page (also seehttps:\/\/epson.com\/faq\/SPT_C11CG06201~faq-0000491-wfc5210_5290?faq_cat=faq-topFaqs):1. Load letter-size plain paper in the sheet feeder.2. Press the Setup button.3. Select Maintenance and pressOK.4. Select Nozzle Check and pressOK.5. Press Start.Please report the results of using the \"Print test page\" button and the \"Nozzle check\" output."]},{"symptom":"Sharper Image Weather Station EC-WS115 with Windows 10        Hi all,This is related to a very informative thread started a couple of years ago - link: https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_7-hardware\/ec-ws115-sharp-weather-station-with-windows-10\/acf24d0b-88fc-45af-9dc5-ee05484bd18bI am having a problem finding the .exe file required to install the software. I have this item (EC-WS115 Sharper Image Weather Station) new in the box with the install CD, but that only appears to attempt to point to a server that no longer exists. I need the actual file, which apparently is named NIS01_INSTALL_2380.exe.Links to dropboxes in the original thread no longer work. Does anyone still have this file available? Sharper Image has been no help and I can't find a trustworthy-looking source online. I know this item is fairly old technology, but it seems like a good unit and I'd like to find a way to keep it working vs. adding it to the landfill. Any help appreciated.Thanks in advance!","solutions":[]},{"symptom":"I have a mac with a partitioned windows 10 drive which has crashed.?        I am trying to get it to restart but it keeps failing auto repair. I go into troubleshoot and have also tried reset it but it says there isn’t enough memory. I cant get into safe mode either and not sure if i can delete files that way to create more memory? I’ve no idea how to use the command prompt so I’m stumped can anyone help? ","solutions":["Hello, SarahClo2,Try using a Clean Boot process to ResetStart > Type MsconfigClick on Services TabSelect Hide All Microsoft ServicesSelect Disable AllClick on Start Up TabClick Open Task ManagerSelect All Services ListedSelect Disable AllClick Apply, OkReboot and you'll reload in a Clean Boot stateTry Reset option againWhen finished, go back to MSconfig appSelect ServicesSelect Enable AllDo the same with Startup ServicesClick Apply, OkReload and Windows will reload normally","Hi Smittychat,thank you, can you tell me how i get to  the clean boot process? Im guessing via command prompt but im not sure what you mean by services tab? Also do i do it in the mac side or the windows troubleshoot side? Sorry im not as techy as i used to be! many thanks sarah ","Sarah,I'm not familiar with the Mac side. I have suggested what will work with Windows.Question: Are you trying to use command prompt on the Windows side?Step One:See if repairing the Bootrec will launch Windows again.Follow the steps in this tutorial for using Bootrec commands in Command Prompt.https:\/\/www.groovypost.com\/howto\/fix-windows-10-wont-boot-startup-repair-bootrec\/Step Two: If the above works to load Windows, you will not need this step.Services Tab is in the Msconfig window. You'll see it once it's launched.In this tutorial you can find Safe Mode with Networking in Advanced Troubleshooting. Use that to launch the Msconfig window to attempt the clean boot > Reset procedure.https:\/\/www.howtogeek.com\/131916\/how-to-use-the-advanced-startup-options-to-fix-your-windows-8-computer\/"]},{"symptom":"Can’t connect to WiFi network        Hello, I have tried everything (including reinstalling my network adapter driver, running troubleshooting for the adapter, running troubleshooting for dell — SupportAssist), yet every time I try to connect to my WiFi network (which did work properly for a couple of days before this and is working properly in all my other devices) I get the message that the laptop can’t connect to WiFi, is there anything I can do? A laptop is no use without internet. ","solutions":["Hello Elbatista, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemWhat is your exact laptop model? There was an issue with a specific wireless chips which prevent Wireless from functioning properly..Have you tried running the Network troubleshooter? Regards! Farah","Hi, it’s a Dell Inspiron 7580. Also, yes, I tried troubleshooting for the network, but it’s meaningless because there is no way to troubleshoot it because my laptop can’t connect to it. ","I've checked your laptop model, and it has the same problematic wireless chip issue.https:\/\/docs.microsoft.com\/en-us\/windows\/releas...you've mentioned that you have already updated the driver. Have you done this via device manager or have you downloaded the latest driver from Dell website?Check please in Device manager, if the Wireless driver date is new. to do so: * Type device manager in start menu and open it * find Wireless network adapters and double click on the wireless card * Go to Driver tab, see what is the date. If it's older than Dec 2019. Please go ahead and download the new version under this link:https:\/\/dl.dell.com\/FOLDER05821208M\/1\/Qualcomm-...","How many devices do you have connected to your Router and or Modem\/Router? How long have you owned this Laptop and was it connected and working before? If it is new and you are trying to connect it, how many devices are allowed to connect to your internet? See example image below. Click on, tap or activate image to enlarge it.","Hi, yes, I got it in November and the network did work for some time before I had this issue. There’s around 16 people connected to the WiFi and this isn’t a new development at my house. ","I did updated the drivers, but my WiFi driver says it’s from around October, so now I’m in the process of downloading the new one. Let’s hope this works. ","no worries","Good, at Christmas only my daughter and I were here but after we opened up our new Laptop computers that meant we had 24 devices on the network that were connected and had to have addresses.  For my network that meant with it being set at 50, 26 more devices could be added. At this time I am the only one here and I have 17 devices connected, not all by wi-fi, several by ethernet cable and all addresses for devices are reserved. Devices not in use still have an address."]}]}