{"windows":[{"symptom":"Xbox game pass PC Rage 2 has stopped working.        I have been smashing out rage 2 on PC recently and after about 5 days of decent play it has suddenly stopped working. The game launches all the way to the press enter screen and then when i do it crashes with the \"rage 2 has stopped working\" message.I have updated all my drivers, windows ten is running at the newest version. have edited the screen from full screen to not. and attempted to add it to my windows defender list (hard to do when you cant get to the exe file for the game due to Microsofts install procedure. does anyone have a fix to this? the issue came out of the blue. i have been running it as an administrator since the get go and cannot work out why the issue came out of the blue?","solutions":[]},{"symptom":"Why did Windows 10 add \"English UK\" to my Keyboards out of NO where?        Hi All,This is absolutely irritating and annoying!!Somehow, out of nowhere, Windows 10 just decided to add additional Keyboard language to mine.I used to have only US English and Arabic keyboards.However now, I have UK English too! why?Worst still is, the Keyboard layout is different than the US one (which the Laptop happens to have it built-in).So, if im typing in Arabic and then switch to English (say to type a password), I keep getting wrong password! why?Because the \"@\"#\" on US Keyboard are on different locations on the UK Keyboard. it is frustrating to no End.On top of that, I am unable to find and remove the UK keyboard, where the hell is it hidden??Please if someone knows how to get rid of it let me know.Thank you in advance!","solutions":["Okay, in that case we may need to delete the Registry key for the UK layout.Please refer to the following page and perform the Registry Fix for this error. (Scroll Down the page and locate the steps written by \"DikkeryDok\") https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"Models smoothening completely in 3D Builder        Hi,I am hoping someone can help.I have a 3D file which is fairly low poly.In 3D builder, the 'smoothing' filter makes the object look perfect, nice crisp edges, but smoother surfaces.As far as I know there's no UV or other data that's giving it the 'look' of being smooth, but when I try and use the smooth function, even at the lowest setting, everything is just smushed into a softer version of the mode with no crisp edges.Is there any way to apply the smoothing filter to the acftual model then save it?I want to 3D print a couple of items for friends, but don't want to have to load each file into ZBrush and smooth them all by hand when 3D builder appears to be able to do the job quickly.Any advice?***Original title: 3D Builder smoothing issues***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query related to using the smoothening effect on Models through 3D Builder app. We tried reproducing your query by downloading a 3D model, and when we used the smoothening filter we observed the same behavior as yours, where the model became smooth. I commend you for bringing this to our notice, as this can be useful to many users. I would encourage you to provide a valuable feedback using theFeedback Hub app on Windows 10 so that our engineering team can look into this for you. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Unable to extend C drive        I have a laptop, I believed I had one disc with to partitions but I now believe I have 2 discs. My C drive is nearly full, I have deleted D drive its now showing as unallocated space. I deleted thinking I could extend but that's not the case. So now I have 250 GB of space I cannot use. Help please how to combine or use the larger volume as C drive is almost full...… Any help please","solutions":["You can experiment with moving new apps off in Storage Settings. Once you change the install location it will only do it for new apps, so try it for your next few apps to see if the speed is the same.More about this here: https:\/\/www.thedigitalmediazone.com\/2016\/02\/17\/how-to-change-the-windows-store-download-location\/https:\/\/www.howtogeek.com\/264809\/how-to-set-your-default-location-for-windows-10-apps\/https:\/\/www.thewindowsclub.com\/move-windows-10-apps-other-drive-change-install-locationLet me know if there's anything else.Also when ready please mark the post which helped most as the Answer, to help others.   A rating is also appreciated."]},{"symptom":"Unable to boot PC after installing updates        hi up until a few weeks ago my pc was working fine,then while I was out my daughter accepted an update from then on my pc won't load desktop! also task manager. I've tried a couple of youtube options to no avail. I left it as I got stressed now I want it to work.can anyone help plsregards johnps: its windows 7 ultimate with windows 10 update***Original title: desktop wont load***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues while booting the PC after installing updates. For further clarity on the issue, please respond to the questions below: What happens when you try to boot the PC to desktop?Do you receive any error message\/code while booting the PC?What is the make and model of the PC? Meanwhile, I would suggest you to try booting the PC to Safe Mode and see if you are able to boot the PC to desktop. Refer the articleStart your PC in safe mode in Windows 10 If you are able to boot the PC in Safe Mode properly then try performing Clean Boot on the PC and see if you are able to boot properly. Refer the articleHow to perform a clean boot in Windows Performing a clean boot will start the computer with minimal set of drivers and programs, to determine whether a background program is causing the issue. Some of the Startup programs will not load after performing a clean boot on the computer. However, that functionality will return when you reset the computer to start normally after finishing the troubleshooting. If the PC boots properly after performing Clean Boot, then please refer the sectionHow to determine what is causing the problem after you do a clean boot to identify the root cause of the issue. Note: Please refer the section Reset the computer to start normally after clean boot troubleshooting to boot the computer in to normal mode after troubleshooting Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Will windows 10 activate after I reinstall, like, by clean install?        I'm facing an issue here where in resetting my laptop has taken half a day so far, it's been 13 hours to perform the reset. It took 20 minutes to reach 99% and after that it's been more than 12 hours while it's still stuck at 99%.If I must perform a clean reinstall then what must be done and will windows 10 stay activated after performing a clean reinstall? I purchased my laptop with windows 10 in it, guess it wouldn't be a problem?","solutions":["Hi aravinds.cb Activation wont be a problem following a reinstall, because you have previously had windows 10 installed and activated on that device, you can reinstall windows 10 anytime you wish.To get the best install, with fewest issues, use the media creation tool to create bootable media and clean install windows 10.make sure to get the same edition of windows 10 (home, pro, etc) that you currently have.During install, skip the pages that ask for a key, it will activate automatically when you go online.Greg Carmack's article can help in guiding you through a clean install https:\/\/answers.microsoft.com\/en-us\/windows\/for...","If Windows 10 was previously activated then the hardware is registered on Microsoft server, so there is no issue with a clean install.If it came pre-installed by the manufacturer (HP, Dell etc.) then the licence is in the bios and will be read by the installation process. Just make sure you select Custom install during a clean install and delete all windows partitions, select next to proceed. This is the correct process for a clean install.You will need backups of your personal files.","Thanks for the response and are there any reasons as to why my laptop reset is taking this long? Are there any other ways to go about this without clean install?","Sometimes it takes a while but 13hrs is excessive so a clean install is the best option.As to the reason I wouldn't know I'm afraid.","Thanks for your time and the response, hoping the clean install will be smooth. ","Hi Martmcd,Thanks for the response, I tried to perform a clean install but every time I tried to do it using the create media tool, immediately after reaching 100% I get, message saying \"There was a problem running this tool\" and asking me contact the customer care with some error code.What's the reason that's causing it to behave like this?Thanks","can you tell us the exact error including the code. if you are running the tool on the same device you are having problems with, it may be related to the other issues, do you have anothe computer you can use to create the bootable media?make sure you have an empty usb flashdrive of at least 8GB","The message goes like this : \"We're not sure what happened, but we're unable to run this tool on your PC. If you continue experiencing problems, reference the error code when contacting customer support. Error code : 0x8007000D - 0x90002.\"And my pen drive is empty and is of 32GB capacity.","When running the Media Creation Tool you select to create media for another PC, is that correct. To create boot media this what you need to do.At this point you haven't started the clean install yet but just creating the boot media.","Sorry for the slow response, that error would normally indicate corruption of files needed to create the media.and is often sorted by repairing or resetting windows, however as this was your original problem, there seems little point in suggesting that.do you have access to another device that you can use to create the installation media? friend or family member?"]},{"symptom":"Unable to update Windows S Mode...        Hi all,Getting TOTALLY fed up with this new ACER, as it's got Windows S Mode installed, which is NOT helpful at all! Wish to switch it out, but keep getting told to go through 'update', which fails, showing the following error:Windows Malicious Software Removal Tool x64 - December 2019 (KB890830) - Error 0x800711c7Can anyone help","solutions":["Hey Master. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See here how to get out of S Mode: https:\/\/support.microsoft.com\/en-us\/help\/445606...If that fails you can wait until the servers are less busy, or contact Microsoft Support by one of these phone numbers:https:\/\/support.microsoft.com\/en-us\/help\/405170...You can also go here: https:\/\/partner.support.services.microsoft.com\/... choose the link for Browser help, interact briefly about your exact problem, keep replying agent until it connects with an agent.You can also try to repair the store which is working for some, or reinstall Windows 10 Home version which will definitely work to get rid of S mode.To repair Store: I'll give you everything possible to repair the store. Even if you've tried a step please do it over in this sequence:See if the fixes here help: https:\/\/www.pcworld.com\/article\/3053099\/windows... Try running the Windows Store apps Troubleshooter at Settings > Update & Security > Troubleshoot.Try resetting the Store cache: http:\/\/www.thewindowsclub.com\/reset-windows-sto... If that fails go to Settings>Apps and highlight Microsoft Store, choose Advanced Settings, then Reset. After it resets, restart PC.If that fails then reinstall Store. Type CMD in Start Search, right click Command Prompt result to Run as Administrator, copy the following code and paste it into the box using the Edit tools from Box's top left dropdown menu, press Enter:PowerShell -ExecutionPolicy Unrestricted -Command \"& {$manifest = (Get-AppxPackage *WindowsStore*).InstallLocation + '\\AppxManifest.xml' ; Add-AppxPackage -DisableDevelopmentMode -Register $manifest}\"If these all fail then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account because of the serious and persistent problem with corrupted accounts. Then continue with the other steps to go over your install most thoroughly.If nothing else works then do a Repair Install, by installing Media Creation Tool and then choosing to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... _________________________________ You can also Clean Install following these illustrated steps in this link which compile the best possible Clean Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... To create Windows 10 Installation Media (if necessary on another PC) install the Media Creation Tool and follow the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key here:https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, skip the Product Key screen and choose your licensed version only if offered. On second screen choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, click Next to let it create needed partitions and start install - this makes it foolproof.You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC because you will learn everything that works best and how to apply it with your own hands.If you have files that aren't backed up you can use the same bootable media to try to rescue your files using this method:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"can i activate win 10 with a win 7 key        can i activate win 10 with a win 7 key","solutions":["No one can answer that question with 100% certainty.You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700Cheers."]},{"symptom":"Blurry everything Windows 10 VER. 1909        Hi,After update from win 7 to win 10,I have blurry everything (desktop text, ikons and aplications).I have upgraded nvidia and lg drivers. Resolution:2560x1080. (Nvidia Quadro 410, Monitor LG 29UM59)I have tried XPExplorer Windows 10 DPI Fix and most options in windows and still nothing.It does not look like native resolution.In windows 7 everything was perfect. Any ideas ?Thank you.","solutions":["Don't call the scan phone number","Is the Nvidia Quatro 410 supported by Nvidia in Windows 10.Reduce the resolution. what is the recommended resolution in Display Settings.?","One more thing,After I uninstall NVidia drivers and went back to drivers provided by Microsoft, I can't go back to 2560x1080, the highest I can go is 1920x1080.","Hi Peter That Nvidia Quadro 410 graphics option is bordering on being legacy hardware at this time, try installing this WHQL driver for your Nvidia card, that is the most up to date version available . . .https:\/\/www.nvidia.com\/download\/driverResults.a...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","Thank you, but driver incompatible with win10. ","Hello Peter_K2011! My name is Marco, I am an Independent Advisor. I will do my best to help you.Did you check if your \"refresh rate\" is at 75hz? Right click on the desktop in the empty area. Click on \"nvidia control panel\" Click on \"Change resolution\" under \"display\" And for a little more information, did this happen immediately after the update from 7 to 10? or after installing any application or driver?","If you can you should consider a new graphics card. I've had to do that for Windows 10 when my old card lost support by Nvidia and didn't receive any new drivers.Failing that continue with Microsoft drivers at a reduced resolution."]},{"symptom":"How to Hide the taskbar while Gaming in Windows 10        Follow the Instructions given belowmethod 1:1. Right-click an empty place on the taskbar.2. Click the bottom option, “Taskbar Settings.”  The appropriate panel in Settings will open.3. You will see 2 options: \"Automatically hide the taskbar in desktop mode\" and \"Automatically hide the taskbar in tablet mode\" Toggle one or both of these options. it will only appear if you move your mouse to the bottom of the screen. Method 2:If the above method dose not solve the problem try this simple trick. Minimize the game and follow the instruction given below.Use the keyboard shortcut Windows key + R to open the Run prompt. 1. Type cmd in the box and press Enter 2. Type taskkill \/im explorer.exe \/f and press Enter 3. Type exit and press EnterWhen you finish your game Use the keyboard shortcut Windows key + R to open the Run prompt.1. Type cmd in the box and press Enter2. Type explorer and press Enter3. Type exit and press EnterThe taskbar will reappear.","solutions":[]},{"symptom":"Can't revert Windows 10        Upgraded Windows 7 to Windows 10 using media creation tool 1909. I can boot to login screen, but then I get a blank screen.  If I boot to safe mode, I can see desktop but some features do not work.  I have tried all the suggestions to fix this: display drivers, etc.  I just want to revert to Windows 7. But when I click on Settings in safe mode, nothing happens so I can't go to Updates and select revert to Windows 7.  I just did this upgrade and my Windows.old folder is on the hard drive.  How can I revert to Windows 7?","solutions":["Hi WDFrom the power button on your Start menu, press Shift and click RestartThat will bring you into the recovery environment, from there, choose Advanced Options and you should see the option to revert to your previous version of Windows..."]},{"symptom":"cannot open carmara        Hello,i cannot open carama,i don't know the reason","solutions":["Hi xueyaoCao, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Do you mean Windows Camera? If so, Camera doesn't work in Windows 10 https:\/\/support.microsoft.com\/en-in\/help\/13753\/...","You get lots of directions from MS and a bunch of others.  They make it tough to do....  I know little about PCs but my problem was solved by using RESTORE to the point that my camera was working.  And...it fixed my problem!! ","how do I restore it, its not giving me that option?","Go to Control Panel then click on Recovery then select restore and set restore date."]},{"symptom":"pc, games and apps crashing        System:AMD Ryzen 9 3900X (default settings)GiBy X570 AORUS MASTER X570AMD AGESA 1.0.0.4 BSapphire RADEON RX 5700 XT NITRO+ (Running on boost profile)Radeon Software Version 19.12.3LG 32GK650F-B 32 QHD Gaming Monitor (Display Port connection, monitor is running on 144hz)Windows 10 Pro 64-bit (Updated every patch Tuesday)Seasonic PRIME TX-1000 1000W ATX23 (Titanium)D4 32GB 3600-16 Trident Z Neo K2 GSK (F4-3600C16D-32GTZN, Trident Z Neo)XMP enabled (CL16 16-16-36)    Describe your issue:I am experiencing random crashes while gaming. Games that crash most often are Vermintide 2, Planetside 2, Destiny 2, Borderlands 3, Final Fantasy 14 Online, Total War Warhammer.When my games crash I noticed that sometimes apps in the background crash as well (Steam, GOG, Radeon Software, Epic Games, Discord). I have disabled all overlays.I have tried different settings in games (tried ultra and high). I have also disabled all the kinks in Radeon Software (No advanced sync, freesync etc).Sometimes a game will freeze (black screen but sound in the background), sometimes it is black screen with no sound and followed by a full system crash\/reboot, other times the game just crashes but system is up and running.I have also noticed that I can crash many times but once I restart the pc i usually experience no crashes at that point.Some of my crash dumps (WhoCrashed app): On Thu 02\/01\/2020 11:27:16 your computer crashed or a problem was reportedcrash dump file: C:\\Windows\\Minidump\\010220-9843-01.dmpThis was probably caused by the following module: ntoskrnl.exe (nt+0x1C14E0)Bugcheck code: 0x3B (0xC0000005, 0xFFFFF80504A667B3, 0xFFFFC180FC699930, 0x0)Error: SYSTEM_SERVICE_EXCEPTIONfile path: C:\\Windows\\system32\\ntoskrnl.exeproduct: Microsoft® Windows® Operating Systemcompany: Microsoft Corporationdescription: NT Kernel & SystemBug check description: This indicates that an exception happened while executing a routine that transitions from non-privileged code to privileged code.This appears to be a typical software driver bug and is not likely to be caused by a hardware problem.The crash took place in the Windows kernel. Possibly this problem is caused by another driver that cannot be identified at this time.On Thu 02\/01\/2020 11:27:16 your computer crashed or a problem was reportedcrash dump file: C:\\Windows\\MEMORY.DMPThis was probably caused by the following module: win32kfull.sys (win32kfull!EditionUpdateCursorAsync+0x5C)Bugcheck code: 0x3B (0xC0000005, 0xFFFFF80504A667B3, 0xFFFFC180FC699930, 0x0)Error: SYSTEM_SERVICE_EXCEPTIONfile path: C:\\Windows\\system32\\win32kfull.sysproduct: Microsoft® Windows® Operating Systemcompany: Microsoft Corporationdescription: Full\/Desktop Win32k Kernel DriverBug check description: This indicates that an exception happened while executing a routine that transitions from non-privileged code to privileged code.This appears to be a typical software driver bug and is not likely to be caused by a hardware problem.The crash took place in a Microsoft module. Your system configuration may be incorrect. Possibly this problem is caused by another driver on your system that cannot be identified at this time.On Mon 16\/12\/2019 09:44:51 your computer crashed or a problem was reportedcrash dump file: C:\\Windows\\Minidump\\121619-10062-01.dmpThis was probably caused by the following module: dxgmms2.sys (0xFFFFF802214FAA66)Bugcheck code: 0x1E (0xFFFFFFFFC0000005, 0xFFFFF802214FAA66, 0x0, 0xFFFFFFFFFFFFFFFF)Error: KMODE_EXCEPTION_NOT_HANDLEDfile path: C:\\Windows\\system32\\drivers\\dxgmms2.sysproduct: Microsoft® Windows® Operating Systemcompany: Microsoft Corporationdescription: DirectX Graphics MMSBug check description: This indicates that a kernel-mode program generated an exception which the error handler did not catch.This might be a case of memory corruption. This may be because of a hardware issue such as faulty RAM, overheating (thermal issue) or because of a buggy driver.The crash took place in a Microsoft module. Your system configuration may be incorrect. Possibly this problem is caused by another driver on your system that cannot be identified at this time.On Thu 12\/12\/2019 18:39:10 your computer crashed or a problem was reportedcrash dump file: C:\\Windows\\Minidump\\121219-9734-01.dmpThis was probably caused by the following module: dxgmms2.sys (0xFFFFF80018339D59)Bugcheck code: 0x1E (0xFFFFFFFFC0000005, 0xFFFFF80018339D59, 0x0, 0xFFFFFFFFFFFFFFFF)Error: KMODE_EXCEPTION_NOT_HANDLEDfile path: C:\\Windows\\system32\\drivers\\dxgmms2.sysproduct: Microsoft® Windows® Operating Systemcompany: Microsoft Corporationdescription: DirectX Graphics MMSBug check description: This indicates that a kernel-mode program generated an exception which the error handler did not catch.This might be a case of memory corruption. This may be because of a hardware issue such as faulty RAM, overheating (thermal issue) or because of a buggy driver.The crash took place in a Microsoft module. Your system configuration may be incorrect. Possibly this problem is caused by another driver on your system that cannot be identified at this time.On Fri 29\/11\/2019 18:13:21 your computer crashed or a problem was reportedcrash dump file: C:\\Windows\\Minidump\\112919-9593-01.dmpThis was probably caused by the following module: hardware.sys (hardware)Bugcheck code: 0x3B (0xC0000005, 0xFFFFB790DDC0E5C3, 0xFFFF9B054E3553A0, 0x0)Error: SYSTEM_SERVICE_EXCEPTIONBug check description: This indicates that an exception happened while executing a routine that transitions from non-privileged code to privileged code.This appears to be a typical software driver bug and is not likely to be caused by a hardware problem.A third party driver was identified as the probable root cause of this system error. It is suggested you look for an update for the following driver: hardware.sys .Google query: hardware.sys SYSTEM_SERVICE_EXCEPTIONOn Fri 29\/11\/2019 14:07:02 your computer crashed or a problem was reportedcrash dump file: C:\\Windows\\Minidump\\112919-9609-01.dmpThis was probably caused by the following module: ntoskrnl.exe (nt+0x67DAF)Bugcheck code: 0x1000007E (0xFFFFFFFFC0000005, 0xFFFFF80734C67DAF, 0xFFFF8081D412C2F8, 0xFFFFB1018EE7F930)Error: SYSTEM_THREAD_EXCEPTION_NOT_HANDLED_Mfile path: C:\\Windows\\system32\\ntoskrnl.exeproduct: Microsoft® Windows® Operating Systemcompany: Microsoft Corporationdescription: NT Kernel & SystemBug check description: This indicates that a system thread generated an exception which the error handler did not catch.This appears to be a typical software driver bug and is not likely to be caused by a hardware problem.The crash took place in the Windows kernel. Possibly this problem is caused by another driver that cannot be identified at this time. Conclusion6 crash dumps have been found and analyzed. A third party driver has been identified to be causing system crashes on your computer. It is strongly suggested that you check for updates for these drivers on their company websites. Click on the links below to search with Google for updates for these drivers: hardware.sysIf no updates for these drivers are available, try searching with Google on the names of these drivers in combination with the errors that have been reported for these drivers. Include the brand and model name of your computer as well in the query. This often yields interesting results from discussions on the web by users who have been experiencing similar problems.Read the topic general suggestions for troubleshooting system crashes for more information. Note that it's not always possible to state with certainty whether a reported driver is responsible for crashing your system or that the root cause is in another module. Nonetheless it's suggested you look for updates for the products that these drivers belong to and regularly visit Windows update or enable automatic updates for Windows. In case a piece of malfunctioning hardware is causing trouble, a search with Google on the bug check errors together with the model name and brand of your computer may help you investigate this further. Some event logs:Faulting application name: Radeonsoftware.exe, version: 10.1.2.1788, time stamp: 0x5df7cf62Faulting module name: Radeonsoftware.exe, version: 10.1.2.1788, time stamp: 0x5df7cf62Exception code: 0xc0000005Fault offset: 0x00000000004037e7Faulting process id: 0x27d0Faulting application start time: 0x01d5c15fecca9a19Faulting application path: C:\\Program Files\\AMD\\CNext\\CNext\\Radeonsoftware.exeFaulting module path: C:\\Program Files\\AMD\\CNext\\CNext\\Radeonsoftware.exeReport Id: d64b8d29-b51e-4247-9c9f-de5e844537eaFaulting package full name: Faulting package-relative application ID: Faulting application name: GalaxyClient.exe, version: 1.2.64.2, time stamp: 0x5de69429Faulting module name: unknown, version: 0.0.0.0, time stamp: 0x00000000Exception code: 0xc0000005Fault offset: 0x77d51c82Faulting process id: 0x1db4Faulting application start time: 0x01d5bf357944b9b9Faulting application path: D:\\GOG Galaxy\\GalaxyClient.exeFaulting module path: unknownReport Id: 9b5bb10a-01aa-48be-a27e-1b94541e66f1Faulting package full name: Faulting package-relative application ID: Faulting application name: Steam.exe, version: 5.56.68.4, time stamp: 0x5df7b612Faulting module name: unknown, version: 0.0.0.0, time stamp: 0x00000000Exception code: 0xc0000005Fault offset: 0x77d51c82Faulting process id: 0x13b8Faulting application start time: 0x01d5beec64c55642Faulting application path: D:\\Steam\\Steam.exeFaulting module path: unknownReport Id: 352f9864-c44b-4983-aa13-5cc53c5e0e16Faulting package full name: Faulting package-relative application ID: Faulting application name: RadeonSoftware.exe, version: 10.1.2.1788, time stamp: 0x5df7cf62Faulting module name: RadeonSoftware.exe, version: 10.1.2.1788, time stamp: 0x5df7cf62Exception code: 0xc0000005Fault offset: 0x000000000016b27fFaulting process id: 0x1270Faulting application start time: 0x01d5beec6806e05eFaulting application path: C:\\Program Files\\AMD\\CNext\\CNext\\RadeonSoftware.exeFaulting module path: C:\\Program Files\\AMD\\CNext\\CNext\\RadeonSoftware.exeReport Id: f9ac6f47-2093-4eac-a198-60944701ea0bFaulting package full name: Faulting package-relative application ID: Faulting application name: RadeonSoftware.exe, version: 10.1.2.1788, time stamp: 0x5df7cf62Faulting module name: RadeonSoftware.exe, version: 10.1.2.1788, time stamp: 0x5df7cf62Exception code: 0xc0000005Fault offset: 0x000000000016b27fFaulting process id: 0x27f8Faulting application start time: 0x01d5be6b77d28babFaulting application path: C:\\Program Files\\AMD\\CNext\\CNext\\RadeonSoftware.exeFaulting module path: C:\\Program Files\\AMD\\CNext\\CNext\\RadeonSoftware.exeReport Id: 1bd6e7a3-a13b-4fd7-8492-2255ab1e38b7Faulting package full name: Faulting package-relative application ID: Faulting application name: SystemSettings.exe, version: 10.0.18362.449, time stamp: 0x066bf1a5Faulting module name: Windows.UI.Xaml.dll, version: 10.0.18362.449, time stamp: 0xb90db728Exception code: 0xc000027bFault offset: 0x0000000000712ec0Faulting process id: 0x22d8Faulting application start time: 0x01d5ba8993f558f0Faulting application path: C:\\Windows\\ImmersiveControlPanel\\SystemSettings.exeFaulting module path: C:\\Windows\\System32\\Windows.UI.Xaml.dllReport Id: c96887c8-f054-4402-8e0f-05a4ddbe6656Faulting package full name: windows.immersivecontrolpanel_10.0.2.1000_neutral_neutral_cw5n1h2txyewyFaulting package-relative application ID: microsoft.windows.immersivecontrolpanel I hope that someone might help me investigate what is causing this as I am not sure if this is issue with amd-windows communication or something else.So far I ran memtest for the night and it found no issues after 5 runs. CPU is running on 35% idle with Noctua NH-D15 and GPU fan settings are ramped up so there shouldn't be any overheating.One of my games installed directx9 red after directx12 was installed and I am not sure if that might have caused this (reinstall of directx12 says that no reinstall is needed).Any help is appreciated. Thanks,Nik","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please reinstall the graphics driver. Run SFC scan at Command prompt (Admin) sfc \/scannow Run DISM command at Command prompt (Admin) DISM \/Online \/Cleanup-Image \/RestoreHealth","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please reinstall the graphics driver. Run SFC scan at Command prompt (Admin) sfc \/scannow Run DISM command at Command prompt (Admin) DISM \/Online \/Cleanup-Image \/RestoreHealth Hi Arif,I have done that several times already. I have booted in Safe Mode, ran DDU to uninstall graphics drivers and then re-installed them while internet connection was off so there would be no conflict with amd radeon software and windows auto update.I have also ran scannow command together with the image commands.Unfortunately the issue is still here.Regards,Nik","If this has started recently please Restore the PC to an earlier time when the games were working.Select a restore point prior to the date it started.","If this has started recently please Restore the PC to an earlier time when the games were working.Select a restore point prior to the date it started. It is a fresh install (new build) so there is no point to restore to as the issues were present since the start.","Alright, in that case I see no other option but another fresh installation. Hence, I would release the case and allow other experts take the opportunity to fix this.","Hi NikolaLeskovec As I'm experiencing a similar issue with my own computer, I will share my experience with you.I was using a i5-4460 with a RX 580. Everything was working perfectly. Then I upgraded the GPU to a RX VEGA 56. And everything went crazy, random crash, blue screen, freeze.I made a clean install, with a new build (R5-2600 \/ RX Vega 56). And I still got crashes all over the place, for various reasons (sometimes a graphics driver, sometimes a freeze, a blue screen, etc.)I switched the Vega 56 with my RX 580, and everything worked perfectly again, I didn't found out why the Vega is causing this much issues. But if you have another graphics card to test, try to switch it.Regards Jay","Alright, in that case I see no other option but another fresh installation.Hence, I would release the case and allow other experts take the opportunity to fix this.Thanks for the help. I will not be doing another fresh installation as there is no point since I do not even know what is causing it.","Hi NikolaLeskovec As I'm experiencing a similar issue with my own computer, I will share my experience with you.I was using a i5-4460 with a RX 580. Everything was working perfectly. Then I upgraded the GPU to a RX VEGA 56. And everything went crazy, random crash, blue screen, freeze.I made a clean install, with a new build (R5-2600 \/ RX Vega 56). And I still got crashes all over the place, for various reasons (sometimes a graphics driver, sometimes a freeze, a blue screen, etc.)I switched the Vega 56 with my RX 580, and everything worked perfectly again, I didn't found out why the Vega is causing this much issues. But if you have another graphics card to test, try to switch it.Regards Jay I do not have a spare GPU unfortunately so that is out of question. Still hoping that someone comes in that can decipher the logs etc.If anyone is good at reading crash dumps let me know and I can upload them.","And as ryzen won't run without a GPU, you can't test it without any GPU connected.You have some fault with the radeon software.","And as ryzen won't run without a GPU, you can't test it without any GPU connected.You have some fault with the radeon software. Yeah, it is a shame I can not test with a different GPU. I wish it is just the software."]},{"symptom":"PC flickers after updating        My PC deleted all the application setup, then I installed Windows 10 Pro which caused it to fail to restart. Then I installed Windows 10 32 bit by mistake, which I downloaded from Microsoft website. Upon installing, the PC flickered upon startup. I then installed Windows 8.1 Pro 64 bit, but still it was flickering when starting.Then I downloaded another Windows 10 64 bit, but still it's flickering when starting.The Windows 10 Pro also caused the problem with the pointer... it disappeared, then I fixed the problem. Now the flickering problem is still there. What might be the problem? Please help.Thanks.","solutions":["Hello NigelCoolsite, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemFlickering can occur because of a high display Hz frequency or a bad display driver.Did you install the display adapter driver or did windows install it by it self? is this a Laptop or a Desktop pc? Feel free to ask back any questions and let us know how it goes. Cheers! Farah","Hello Farah,Thanks for replying to my question regarding the issue with my PC.Firstly, I did not install the drivers myself, the drivers were installed by Windows, because it happened during the process of Windows installation.Secondly, it is a laptop I'm talking about.Please help, I want it to work in a normal way. So how do I solve the problems you've mentioned (high frequency Hz and adapters?)Thanks, hoping to hear from you soonest.","Hello there, can you provide me with the laptop model? Regarding the display frequency, you can change it as mentioned here: * Right-click the windows desktop, and then click Personalize. * Click Display. * Click Change display settings. * Click Advanced settings. * Click the Monitor tab and change Screen refresh rate from 59 Hertz to 60 Hertz.Check if it helps. Regards! Farah","Hello Farah, thanks for the response.The laptop model is Acer Extensa 2508 9H-CU.I've checked the Refresh Rate, it's on 60 Hz. When I click on it to change, it won't allow me to change... there's only that 60 Hz selected and no other values.However, I went on to Generic PnP Monitor and Intel (R) HD Graphics where there's a list of Hz values. It's set on 1366 by 768, True Colour (32 Bit) 60 Hertz.Thanks, hoping to hear from you soon.","Hello Nigel, So the display adapter is Intel, Please click on this link and it will install an Intel tool, which will detect and install the latest Intel device drivers including the display adapter.http:\/\/www.intel.com\/content\/www\/us\/en\/support\/...After updating the drivers. restart your device and let me know if it helps Cheers! Farah","Hello Farah, thanks for the response and link you provided.I clicked on the link and downloaded the software. It ran the installation and restarted the PC, but still it's flickering! Please help.Thanks"]},{"symptom":"Windows Configuration Designer - set password on never expire        Hi Everyone,I have a noob question.I want to test the Windows Configuration Designer.But i didn't see an option for set the password of localadmin to \"never expire\". Some one know where is it ? Or it's by default ?thanks by advance !","solutions":["Hi Amanda54 , I'm an independent advisor and have looked into Windows Configuration Designer. The option you wanted isn't available. You could consider scripting the command Dave has suggested and add it as part of the provisioning package.https:\/\/docs.microsoft.com\/en-us\/windows\/config...You might also want to Send feedback from About menu to suggest enhancements. Let me know if I can help you further!"]},{"symptom":"Windows Mixed Reality - 'Connect your Headset'        I can't seem to get the Mixed Reality app to read my Acer VR headset.I've disconnected all cables from headset to PC.I've reconnected all cables, even trying 4 different USB3 ports.The HDMI cable is connected directly to the port on the video card.The headset appears in the device manager, all drivers are up to date, and no errors have appeared.This all worked when I first purchased the PC\/VR headset bundle a year ago but now the app no longer registers the headset.Several similar issues have been posted online but so far nothing I've attempted has budged this situation.Thank you in advance for any assistance.","solutions":["I just did a fresh install of Windows and can no longer get my controllers to pair ....... Worked just fine 3 weeks ago, now it's nothing but an expensive paper weight .... Windows Bluetooth implementation is the worst in the industry, Just an on\/off switch and  an Add Device button and ZERO feedback what the hell is actually going on .... How do they expect anyone to troubleshoot a problem based on zero feedback, not even an obtuse error message"]},{"symptom":"High CPU usage on winword.exe windows 10 1903 while editing documents with WebDAV        Hi,We are using Windows10 1903 with Office Pack 2016, everything works smoothly and fast enough locally,but when the user opens a document with WebDAV on a IIS or apache server winword.exe use a complete CPU core for about 40 seconds, which if so slowI have to say-       Users have no problem with Windows10 1809 with Office Pack 2016-       The pure HTTP (without WebDAV) file will open very fast-       The windows boxes have common third-party apps like adobe acrobat and flash player and not thing else-       There is no firewall or WAF between clients and the web server","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing High CPU usage issue on winword.exe while editing documents with WebDAV. Since you are using WebDAV on a IIS, let me point you in the right direction, where you may get further assistance. I would suggest you to post your query inTechNet forums, where we have support professionals to address your query. I hope your query will be resolved at the earliest.  Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Unable to log onto Laptop        I purchased an EVOO 10.1\" Ultra Thin Laptop, Quad Core Processor, 2GB Memory, 32GB Storage, Mini HDMI, Front Camera, Windows 10 Home, for my daughter and she has tried multiple times to create an account on another computer and proceeded to try to log onto the EVOO laptop with no success. What can be done to address this problem? ","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as your daughter is unable to set up a user account on the newly purchased Windows 10 EVOO 10.1 laptop. In order to get clarity and to assist you accordingly, please reply with the answers to the questions below. Did she create a new Microsoft account on different computer?Do you have any administrator user account created on EVOO 10.1 laptop? (Local\/Microsoft)Did she create a Local administrator user account and tried to convert it to Microsoft account?What is the error you are getting while creating the user account? Meanwhile, we would suggest you to refer this article on How tocreate a local user or administrator account in Windows 10. Let us know how it goes. Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"Windows Mobile Device Center (WMDC) on Windows 10 Pro        Recently I had an issue running the WMDC on a x-64 based machine with Windows 10 Pro Version 18362 to connect to a mobile device running on Windows CE. I uninstalled the WMDC and installed the newest Version 6.1 of WMDC for x-64 based systems but it did not get me any further.I also remember the problems with WMDC after the Fall Creators Updates and I am wondering if it could be a similar problem.Can anybody help me out on this one? Thanks!*****moved to Windows*****","solutions":["Hi, Thank you for writing to Microsoft Community Forums. For better clarity, please help us with the details requested below: What is the exact issue you are facing while connecting a device?Do you receive any error message? The Microsoft Windows Mobile Device Center replaces ActiveSync for Windows Vista. Since you are already using it on Windows 10, and facing issues in connection a device, I would suggest you to refer theTroubleshooting tips section in the article Description of Windows Mobile Device Center and see if that helps. However, we have Windows Sync Center in Windows 10, which allows you to sync between your PC and certain mobile devices that are compatible with Sync Center. Refer the steps mentioned below to configure Windows Sync Center: Press Windows Logo key + R, to openRun dialog box.Type mobsync and click on OK.Click on Manage offline files from the left pane.On the General tab, click on Enable offline files to enable the offline files.You can configure the Disk Usage by going to Disk Usage tab. If you wish to change the disk usage limits click on Change limits. If you want to Encrypt the files, go the Encryption tab and select Encrypt. For more information, see Sync Center Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Another win10 genuine check        Hello all!Situation: Personal computer. Had win 10 Home (key is in the bios). Bought Win 10 Pro from Amazon. Key upgraded me to win 10 Enterprise. Reason: need to run Docker at home.Issue: I don't really care if its Enterprise or Pro - Docker accepts both. However I got the \"Activate Windows\" alert at the bottom right corner of the laptop and I have the0xC004F025 error in Activation Tab -> Update and Security and I would like for my Windows to be activated.Disclaimer: I already sent an email to the seller about this issue because I didn't get what I paid for. However I need to work on a project asap.If this is an easy solution, I don't mind having Enterprise over Pro. If not, I'll go ask for a refund :) Attachment:","solutions":["Hi GlebD There is a known bug in the Home to Pro upgrade process, which causes Windows 10 to upgrade to the Enterprise editionThere is an easy fix for this, click the link below, then follow the steps provided by trusted MVP Sumit Dhiman and you will be reverted to a fully activated Windows 10 Pro in a minute . . .https:\/\/www.yourwindowsguide.com\/2019\/07\/fix-pu...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]}]}