{"windows":[{"symptom":"Move retail Win10 Pro license onto a different already activated machine        I have 2 machines each running Windows 10, an old laptop and a new desktop. Both are activated with digital licenses linked to my Microsoft account. The desktop has an OEM Windows installation of Win10 Home, the laptop has a retail copy of Win10 Pro (determined using slmgr dli in cmd.exe).The outputs of slmgr-dli on each machine:Desktop:Name: Windows(R), Core editionDescription: Windows(R) Operating System, OEM_COA_NSLP channelPartial Product Key: <omitted>License Status: LicensedLaptop:Name: Windows(R), Professional editionDescription: Windows(R) Operating System, RETAIL channelPartial Product Key: <omitted>License Status: LicensedI'd like to retire the laptop, it's old and no longer used (for an idea of how unused it is, it's currently on update 1709 as it hasn't been turned on in about 2 years). Because of this I'd like to deactivate my retail Win10 Pro license on my laptop, and replace my OEM license on the desktop with said Win10 Pro license.Is this possible? If so, how?","solutions":["Hi Nick, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Before doing the procedure make sure both the devices are signed in with the same MS account.1. Turn the laptop off. 2.On the desktop, use the generic key to upgrade to Windows 10 Pro: https:\/\/www.tenforums.com\/tutorials\/95922-gener...Go to Settings>Update and security>Activation. Click Change product key. Disconnect from the Internet if it throws an error. 3.After the reboot, you would find Windows unactivated. Click on activation troubleshooter and select I recently changed hardware on this device. Select your old device and the computer should activate.Let us know how that goes. Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads."]},{"symptom":"Error Code 0xc000000e, when trying to boot Windows 10 on SSD        My computer has 5 disks 3 have the EFI boot partition. The 850 EVO SATA SSD has a EFI boot partition and 3 bootable OS partitions.The 970 EVO M.2 SSD has a EFI boot partition and 4 bootable OS partitions.The 500GB WD SATA HDD has a EFI boot partition and 0 bootable OS partitions.All 7 bootable partitions are Windows 10 Home.    6 are version latest update 1909    1 is minimal updated version 1809 for testing this problem. When the 850 or WD are set as the boot disk in the BIOS.You can only boot to either one of the four OS partitions on the 970 one time. After that you get the Boot Failed error, error “Windows Failed to start” could not find \\Windows\\system32\\winload.efi Error Code 0xc000000e. If you go in to the BIOS and reselect the 850 or WD the problem repeats.There are NO problems booting to any of the 3 OS partitions on the 850.When the 970 is set as the boot disk in the BIOS.There are no problems booting to any of the 7 OS partitionsMotherboard is ASUS Prime Z390-ACPU i9-9900CPU cooler Corsair H100iRam Corsair Vengeance LPX 16GB (2 x 8GB) DDR4Samsung  850 EVO SATA SSDSamsung 970 EVO M.2 2280 NVMe 1.3 SSDWD 500GB SATA HDDWD 2TB SATA HDDWD 42TB SATA HDDVideo Card – MSI GeForce GTX 1050 TiPower Supply - Seasonic FOCUS PX-850***Original title: ASUS Z390-A Will only boot one time to Samsung SSD 970 EVO M.2 from other boot disk Error Code 0xc000000e***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues with booting Windows on a SSD drive. Let’s try a couple of troubleshooting steps and see if we can fix the issue. Rebuild BCD: You can try rebuilding the BCD file manually and see if the PC boots fine. Create a bootable media and boot the PC using the media.On the initial setup screen, select the language and otherpreferences and click on Next. (If you don't see the setup screen, your PC might not be set up to boot from a drive. Check your PC manufacturer's website for info on how to change your PC's boot order, and then try again.)Now, click on Repair your computer.On the System Recovery Options screen, selectTroubleshoot> Advanced options > Command Prompt.Now type in the commands and hit Enter:BOOTREC \/FIXMBRBOOTREC \/FIXBOOTBOOTREC \/scanosBOOTREC \/rebuildbcdRestart the PC. Rebuild BCD Store: I would suggest you to export and delete the BCD store and rebuild the BCD store. Refer the steps mentioned below: Create a bootable media and boot the PC using the media.On the initial setup screen, select the language and otherpreferences and click on Next. (If you don't see the setup screen, your PC might not be set up to boot from a drive. Check your PC manufacturer's website for info on how to change your PC's boot order, and then try again.)Now, click on Repair your computer.On the System Recovery Options screen, selectTroubleshoot> Advanced options > Command Prompt.Now type in the commands and hit Enter:bcdedit \/export C:\\BCD_Backupc:cd bootattrib bcd -s -h –rren c:\\boot\\bcd bcd.oldbootrec \/RebuildBcd Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator","Are these instruction for MBR or GPT disk drive? Using the 1st set of instructions how do I tell BOOTREC which EFI boot partition I'm wanting to fix?Using the 2nd set of instructions I was able to export (what I think is a good version) from bcdedit by 1st assigning the sysstore to one of the 2 EFI Partitions using DISKPART and a valid letter to the primary version of Windows 10 Home I use.DiskPartSelect disk 0  (This is the 1TB Samsung M.2 disk)Select part 1Assign Letter=P   (This is the primary Windows 10 where I want to save a copy of export)Select disk 3  (This is the 500GB WD disk that has problems booting to the 1TB M.2Select part 0  (This is the EFI Partition that I labeled \"System #1)  Assign Letter=Q  (this is the partition I working on)exitBCDEdit \/sysstore QBCDEdit \/export \"P:\\BCD_Backup-System#1\"Q:; There is no boot folder in Q: ; I check the EFI folder and no boot folder thereI need more detailed instructions,Thanks for the helpRemember the problem is when booting from the 500GB EVO and trying to load one of the Windows 10 Home's that are on the 1TB EVO M.2.  If I boot from the 1TB EVO M.2 I'm able to load any of the Windows 10 Home's on either of the 2 Disk.","I have found a solution.In BIOS under Advanced \/ Boot \/ Boot Configuration change it from \"Fast Boot\" to \"Disabled\".don't know why but it now works!!!The reason it would boot (1 time) after setting the primary boot device is because BIOS doesn't do a \"Fast Boot\" the 1st time it boots."]},{"symptom":"Windows 10 Pro instead of Windows 10 Home was installed        I purchased a used Dell OptiPlex 7040 with no drives. I purchased a  new M.2 SSD and installed it. I purchased Win10 Home and have my key. I downloaded all software to create a USB and the ISO to create a DVD. No matter what I use to install, it always install Win10 Pro without any options to install Home. Apparently there is a Win10 Pro Key in the bios. I have tried everything to clear it but to no avail. I read another thread from 2018 that suggested creating a PID.txt file with my purchased key in it and placing the file in the Source folder on the thumb drive. Nothing seems to work. It installs Win10 Pro every time and when I check the activation page it says it is activated. This isn't what I paid for and since I purchased this for my elderly mother to use I don't want her having any issues. PLEASE HELP!Thread I got my information from: https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/windows-10-pro-instead-of-windows-10-home-was\/4333a629-3cce-447c-a6b6-c286c39cd835","solutions":["Hi, thanks for posting your question in the community! My name is David an independent advisor and I am here to help you.To determine if your PC really has a product key injected into the BIOS, follow these processes:* In the Windows search bar, type CMD and run the application as an administrator.* In the CMD window, type the following command wmic path softwarelicensingservice get OA3xOriginalProductKey and press enter.* If your PC has a preinstalled license, you will see the 25 characters on the screen.Note that a product key inserted in the BIOS cannot be removed unless the motherboard is changed. In this situation, if Windows 10 tells you that it is activated, there should be no problem with the use of the PC.Keep in mind that Windows 10 Pro is the same as Windows 10 Home, only it has some business environment features, so if you don't use them, there would be no problem.Let me know if the information has been useful or if you still need more help, I will be aware of your response."]},{"symptom":"Had Windows 10 Pro, it has downgraded to Home        Hi guys, first post here so hoping I will garner the answers I'm needing!I bought Windows 7 Professional several years back (circa 2015) when I was building my computer. No worries there. Eventually Windows 10 invited itself in. Okay fine, I can live with that.Initially it seemed my license was Windows 10 Professional. Upon looking at \"This PC\" today, it now tells me I have Windows 10 Home. Why has this downgraded itself and can I get it back?I repeatedly postponed the \"Upgrade to Windows 10!\" messages. One day I arrived home and my PC was off. I start it up and the boot logo looked a little different. The lock screen didn't seem quite right. It all became clear: I had been Wintendo'd! I kept the Pro that I paid for, although somewhere amongst these automatic updates it seems to have downgraded me. Help?","solutions":["Hi WW. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.There is no possible way for the PC to downgrade to Windows 10 Home from Pro. It requires a tricky workaround or a Clean Install.What is the Activation Status and Edition showing at the top of the page at Settings > Update & Security > Activation?If it says it's activated with a Digital License then that is the version that was Upgraded, and again it could not Upgrade from Pro to Home version by mistake as it's technically impossible.Was it ever reinstalled at all? This could have caused if it if Home was accidentally chosen during install. But there's no way it would force Home unless the PC had an embedded Product Key for Windows 8\/8.1 Home version.You can try Upgrading to Pro if your absolutely sure it has a Pro Digital License from the original Upgrade. After Version 1709 it won't even let you upgrade if it doesn't, so there's no real risk. To do this copy and paste the Generic Version Key for WIndows 10 Pro: VK7JG-NPHTM-C97JM-9MPGT-3V66T into Settings > Update & Security > Activation > Change Product Key. This will change the version to Pro IF it has a Pro Digital License.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Errors 0xC004F012 & 0x8004f807 Can't activate windows after refreshing the install.        I've been having a horrible year so far, my PC keeps breaking every few weeks, and I found its because one of the drives on my RAID0 died which cost me thousands in assets and work. And windows was constantly crashing because of the missing drive.I refreshed my installation and now my windows won't activate.First message in yellow: \"We can't activate Windows on this device because you don't have a valid digital license or product key. If you think you do have a valid license or key, select Troubleshoot below. Error core: 0xC004F012\"After doing so I get: \"We can't activate Windows on this device right now. You can try activating again later or go to the Store to buy a genuine Windows. (0x8004f807)I tried changing the key and using the original key for this installation and I get the same exact error as above. This key is from 2018, my Windows is up to date. I have a MS account linked and I'm pretty sure it was linked to the key as well.Please help me, I'm honestly on the edge of having a mental breakdown from all the **** I've been through recently. I can't afford a new key or a replacement drive for all the work I've lost.I'm an advanced user, feel free to give me complex answers, I know how a computer works and how to build them.","solutions":["Run System File Checker from Step 10 in this checklist: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...Once all files are repaired restart PC and run Activation Troubleshooter again. If problems persist I'd run a Repair Install which reinstalls WIndows while keeping your files, programs and most settings in place, by installing the Media Creation Tool from this link http:\/\/windows.microsoft.com\/en-us\/windows-10\/m..., open the tool and choose Upgrade This PC Now. This will solve most problems and also bring it up to the latest version which you need anyway and by the most stable method.If nothing else helps contact MS Support by one of the methods I gave."]},{"symptom":"Explorer uses a lot of memory and freezes periodically        Windows 10 Pro 64 bit, 16 GB RAMI have been having periodic freeze on this machine, each time last a few seconds.Recently, I start to keep Task Manager on the screen.  I can it's Windows Explorer taking CPU and memory.Is there any way to troubleshoot?Thanks","solutions":["Hello redhonker, My name is Don and I am a Windows 10 Independent adviser. Let me try and help you out with this problem.First, let me ask if there's been any recent change done on your computer before the issue started to happen. Has there been any software updates or installations that you've done on the computer?Have you tried to free up disk space on the system disk? Are there any external devices connected to your computer that might be causing the issue?Here are some helpful tips that you might undergo to help resolve the issue: 1. Update your drivers 2. Clear your computer’s temp files 3. Adjust your virtual memory 4. Run a memory check 5. Run Disk Check 6. Run System File Checker 7. Disable C-States in BIOS"]},{"symptom":"new computer, keyboard wornt work correctly        my olc computer no longer worked online, so got a new one and plugged in my keyboard its a Logitech K120 with numerics available for use on the riht hand side, I cant get my computer to recognize the side buttons so I can use them, help? ","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? Is the keyboard wired or wireless? If wireless have you downloaded the Logitech Options\/SetPoint software & the Unifying software?Are you using the USB dongle or connecting via the standard Bluetooth connection?https:\/\/support.logi.com\/hc\/en-gb\/search#q=Logi...I would also try the firmware update tool on the 2nd page of the downloads. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Please do not download any repair tool which is offered by this site other than the ones I mention\/recommend..Thoroughly research any product which is mentioned here before you decide to download and install it.","You must press the NumLock key when you wish to use the numeric keypad. P.S. You could press the three dots (. . .) under your original post in order to correct the spelling errors in the Subject line and the text."]},{"symptom":"USB stick problem        I am new to this so I will try to explain my problem as best as I can, I've been getting used to my new laptop that has windows 10 on it and so far I have been watching some movies a friend put on a USB stick and up until today it has worked but this morning I put the USB stick in and a problem happened that it said the stick needed to be formatted before I could use it but when I try to do just that it then says if I do it could erase what's on the USB stick, yet I was using it on this laptop with no problems until today so my question is how do I get it working again without erasing anything on it? any help would be appreciated and please explain as simply as possible.","solutions":["Hi Michael. I'm Reinald, an Independent advisor and a Windows user like you. Thank you for providing information on your issue, we are are happy to assist you.There are several reasons why this kind of USB stick issue occurs. Such as USB stick system corruption, virus damage or malicious program, improper use of the USB stick, it was incorrectly removed etc.To better diagnose your issue, is there any way you can try to plug your USB stick on another computer? That way we can isolate first if the issue is coming from the computer or the USB stick.Let us know how it goes and don't hesitate to ask if you have further questions. I will do my best to to assist you until your issue is resolved.","Hi Michael. I'm Reinald, an Independent advisor and a Windows user like you. Thank you for providing information on your issue, we are are happy to assist you.There are several reasons why this kind of USB stick issue occurs. Such as USB stick system corruption, virus damage or malicious program, improper use of the USB stick, it was incorrectly removed etc.To better diagnose your issue, is there any way you can try to plug your USB stick on another computer? That way we can isolate first if the issue is coming from the computer or the USB stick.Let us know how it goes and don't hesitate to ask if you have further questions. I will do my best to to assist you until your issue is resolved.I tried the USB stick in my neighbor's computer but hers is running Chrome OS but still, the same thing happens so does that mean the movies are no longer playable because of the way I removed the stick?","I can't guarantee that it is the exact reason why your USB stick is having problem but that's one of the reasons why this issue happens. I suggest to always use the \"Safely remove hardware and eject media\" option in your system tray before unplugging your USB stick or any external drives. This issue happens to me in the past due to removing my external drive improperly and it cost me lot of time and effort to get it back up and running so by ejecting it properly might prevent the issue from happening.Since the issue follows your USB stick on another computer, then the problem is from the USB stick itself and not the computer.There are some ways to recover your files but that involves a 3rd-party program which is mostly paid application, but still it is not a guarantee that it will be able to retrieve your files. If the files are not that important, i suggest to continue with formatting your USB stick. If the issue stills occurs even after formatting, then most probably your USB stick is already faulty.I hope these information helps."]},{"symptom":"windows 10         cumulative up dates for windows 10 version 1909 for x64 based system (kb4530684)   This has happened every day for last 20 days, just checked up dates and found that it has been doing that.  How do you rectify it?","solutions":["Hi Bill. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything possible for fixing failed Windows Updates, so that at least something will work before you work through them all. Even if you've tried a step, please do it over in sequence:Some Updates will sort themselves out in a few days so I'd wait to see. If not or they are bothering you then here are steps you can take:1) Run the Windows Update Troubleshooter from Windows Settings > Update & Security > Troubleshoot.2) There is a new guided walk-through from Microsoft for repairing Windows Update that leads up to resetting components if necessary:https:\/\/support.microsoft.com\/en-us\/help\/10164\/.... Try running that first. 3) If that fails try manually resetting Windows Update Service: Open administrative Command Prompt and type following commands one-by-one followed by Enter key.net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Close Command Prompt and see if Windows Updates works then 4) You can also install the Updates manually that fail to install, which are logged at Settings > Update & Security > Windows Update > Installed Update History, and then search for those to download and install from this Catalog:http:\/\/test.catalog.update.microsoft.com\/v7\/sit... 5) If they continue to fail and interfere, then you can block them using one of these methods:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... 6) If problems with Updates have become chronic and especially if you have other performance problems, go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 7) If nothing else works then do a Repair Install, by installing Media Creation Tool, open installed Tool and choose to Upgrade the PC Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version 1909. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... _____________________ Good news! There are major changes in Version 1903 giving back control over Updates to the consumer. Microsoft has heard us at the highest level who announced this here:https:\/\/blogs.windows.com\/windowsexperience\/201..._____________________ I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Bill, did you even attempt to manually install the Update from below, one of the first steps I gave?https:\/\/www.catalog.update.microsoft.com\/Search...","windows mvp2010-10  Hi, thanks for your input,my problem is that the updates repeats itself the same update cumulative 10 version 1909 for x64 based system(kb4530684) has installed approx.twenty times, it all started when that version up date was installed,did not notice anything until i look at the installed up dates.   The information you gave me was no use except perhaps to do a reinstall ?      Would that be the way to go,although i would have to reinstall everything,hope you can help some more,please note i am not that great at solving computer problems,regards,  Bill.","Bill, that's why I gave the steps which work for everyone else to find and fix Updates problems. May I ask why you rated my post unhelpful before even trying them?There's nothing mentioned at all about reinstalling WIndows, just a last resort Repair Install which keeps everything in place while reinstalling Windows, takes about an hour and solves almost all problems.Please start at the top of the list and complete all steps now. I am standing by here to help you."]},{"symptom":"Troubles opening Realtek HD Audio Manager        Hello, I've been trying to open the Realtek HD Audio Manager to set up a new external mic on my Inspiron 7570, but the app does not respond when I click on it. I've read this is because of the drivers, so I've tried using different versions of the Realtek Drivers - all to no effect. Anybody know of a solution?Thanks,Adam","solutions":["HI Adam. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Uninstall Realtek Audio Manager in Settings > Apps > Apps & Features, restart PC, then reinstall following this guide:https:\/\/www.thewindowsclub.com\/download-reinsta...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved._________________________ Linked tutorial is from a trusted Microsoft MVP","Ok, so I uninstalled and re downloaded the driver, unfortunately still doesn't work. Or were you referring to deleting the manger actual app? Didn't see it listed under apps and features. ","Did you follow the tutorial to reinstall Realtek Audio Manager? There are other steps there too to try.There's another tutorial here covering this slightly differently: https:\/\/ugetfix.com\/ask\/how-to-reinstall-realte...(Avoid all ad links in tutorial, follow only editorial steps which are good)______________________________________________Standard Disclaimer:   There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Maybe I'm just blind, but I didn't see any downloads for the actual application - just the drivers.Also, looking back now, it looks like I'm missing the files for the actual program.","Install the download here: https:\/\/realtek-download.com\/download-hd\/"]},{"symptom":"Switching out of s mode        I am attempting to switch out of s mode. I have scoured every article within the community and tried every suggested fix. When I access the Microsoft Store (which is upgraded to the most recent version) and go to \"switch out of s mode\" the button for \"Get\" is greyed out and advises to contact IT or my system administrator. I am the administrator and I am on a private network, not a domain network. I am at my wits end. This is a known problem, I see others complaining of the same thing, is there a fix coming for this? Am I missing something? Please help! Thank you ","solutions":["Hi Megan,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Have you tried creating a new local administrator account and try switching out from there?https:\/\/www.tenforums.com\/tutorials\/5440-add-lo...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads."]},{"symptom":"Problems accessing word, powerpoint, outlook and all saved documents after installing Windows 10 yesterday        We installed Windows 10 yesterday on my PC and can now no longer load word, powerpoint, outlook and any saved documents. They appear for a second and then disappear.  The start button is also not working.  Can anyone help a non-tech person. Bit of a disaster at the moment!thank you","solutions":[]},{"symptom":"windows 10 boots to bios        My computer is a tough gaming rig with an intel I5 processor. Last night I shut down my computer normally. This morning, I turned it on and it went to a black screen, showed:>>checking media presence.....>>media present>>start PXE over IPv4Then loads into bios. I have tried all the trouble shooting options using my restore disk, went to the command prompt and typed in c: then dir. It shows everything correct. I ran chkdsk\/f which it said it couldn't run as the disk was mounted and asked me if I wanted to demount the disk and continue. I did. It found no errors. In bios, It shows windows boot media (if that's the correct words) on and off. Sometimes it's there, other times it just shows the drives. I had hair when I got up this morning. I am now officially bald. Any advice would be greatly appreciated.","solutions":["Hi Mike My name is Jon and I am an independent technical adviser. Sorry you are experiencing this problem and I would like to help you resolve it.Can you see the Boot order in the BIOS? It seems to me like your PC is trying to boot from the network. Have you done a BIOS reset or updated it to a newer version? Hope this helps.","What do you show in the bios for the boot order.Can you run Start-up repair from the Troubleshoot menu when you boot from USB. (I'm assuming that is your restore disk) is the disk Windows 10 installation media or a restore disk you created from your Windows 10 build.","The bios order changes each time I go into bios.Sometimes it says:windows boot media (or something along those lines}UEFI; PXE IP4 ethernet connectionUEFI; PXE IP5 ethernet connectionThe rest of the time it's just the ethernet connection and doesn't show the boot media.I have not done a bios reset or update. It's currently dated 6-24-18","I attempted running startup repair from my usb restore media. It fails.  It's a restore disk made from within windows 10 and saved to a usb drive. ( I would have to run it again to give you the error message)","I have no idea why the boot order keeps changing. I would recommend resetting the BIOS to defaults (taking note of any specific settings you have set) and then if that doesn't resolve the issue, update the BIOS firmware.","I tried both. This time it shows an update for my bios, so I installed it. I now show no bootable devices.","Try following this https:\/\/www.eassos.com\/how-to\/no-bootable-devic...","\"bootrec.exe \/FixMbr\" says it fixed the boot record. then I ran \"bootrec.exe \/RebuildBcd\" it shows 1 identified. c:\\windows and asked if I wanted to add it to the boot list. I said yes. It says: \" The requested system device cannot be found.\"Am I going to have to reinstall windows all over again??","enter into bios, find PXE configuration disable it  find network slack and disable.restart the system ","Hi, MikeRowley57 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Windows 10 Screen Saver        Hi. my screensaver has stopped working the way it did when I first purchased the computer a month ago. It was displaying my photos as the screensaver and it filled the entire screen. It would display one or several photos, they would slowly zoom in and then move on to another picture. Now it only displays one photo at a time and there are black bars on either side. It is not filling the entire screen. I have tried adjusting the settings to no avail.","solutions":["Hi AshWinterz and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.1. Press the Windows key, type-in \"Settings\" and click Personalization. 2. Click on the Lock screen and click on the \"Screen saver settings\". 3. Select your preferred screensaver. 4. Check the \"On resume, display logon screen\". 5. Click on Apply. 6. Click \"Change power settings\". 7. Click the \"Balance Recommended\" button, click on \"Change Plan Settings\". 8. Power Options dialog box will appear, click on \"Restore Plan Defaults\". 9. Click on \"Apply\" & \"OK\". 10. Then set Turn off display time in the control panel window. (Note: Set the turn-off display time longer than the Wait time for Screen saver).I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Hi Tom_387 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.1. Press the Windows key, type-in \"Settings\" and click Personalization. 2. Click on the Lock screen and click on the \"Screen saver settings\". 3. Select your preferred screensaver. 4. Check the \"On resume, display logon screen\". 5. Click on Apply. 6. Click \"Change power settings\". 7. Click the \"Balance Recommended\" button, click on \"Change Plan Settings\". 8. Power Options dialog box will appear, click on \"Restore Plan Defaults\". 9. Click on \"Apply\" & \"OK\". 10. Then set Turn off display time in the control panel window. (Note: Set the turn-off display time longer than the Wait time for Screen saver).I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","thank you I have tried that, I saw this advice previously, but it had no effect.","Hi Tom_387, We need a bit more detail to be able to help you. Can you please specify what graphic card driver installed on your system? Thanks","Its an HP Pavillion 24 purchased at Costco. I believe the graphics are Intel UHD Graphics 630. Or perhaps it could be this: 128 GB Pcle Nvme M.2 Solid State Drive.","Hi Tom_387, You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Thanks Joseph, but this really is not helpful. It is not an answer to my query and it requires a very technical approach to search for corrupted files. I just bought this computer, I would think that Microsoft would supply better support. From what I can gather from the internet, its probably an update that has caused this bug. Very disappointed and now thinking it may be time to return this computer and go with an apple product, which I have resisted because of my familiarity with windows.My question is very simple and I would think a direct answer would be delivered, I am sure there are many out there with the same issue."]},{"symptom":"Faulting module name: ntdll.dll        I cant run a game due to this error. please helpFaulting application name: Launcher.exe_Rockstar Games Launcher, version: 1.0.13.176, time stamp: 0x5dcae459Faulting module name: ntdll.dll, version: 10.0.18362.418, time stamp: 0x99ca0526Exception code: 0xc0000374Fault offset: 0x00000000000f9269Faulting process id: 0x2ca0Faulting application start time: 0x01d59ad398bc80f5Faulting application path: E:\\Games\\Rockstar\\Launcher\\Launcher.exeFaulting module path: C:\\WINDOWS\\SYSTEM32\\ntdll.dllReport Id: 78ef2625-a6be-4ed9-887b-9d6d5434b655Faulting package full name: Faulting package-relative application ID:","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,May I ask what is the version of your windows 10? (You may locate it by going to start\/search for winver)____________________________ Method 1: Make sure that your system is currently up to date or has any pending updates1. Go to start menu and open settings with the gear icon 2. Open Updates and security settings 3. Choose Windows update 4. Click on check for updates Method 2: Re-register the dll file 1. Open start menu and search for command prompt 2. Right click and choose to run as admin 3. Input these commands regsvr32.exe \/u ntdll.dll (this will uninstall the file)regsvr32.exe ntdll.dll and press (this will reinstall the file).Restart the computer and try again. In the event that it still occurs, I would recommend a repair install\/in-place upgrade to override and fix system components while setting the system to the latest version of windows 101. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","It said operating command not found or something that didn't work.","We have lsass.exe and ntdll.dll error similar to OP's issue on our 2012R2 server. Tried your suggestion and got error:\"The module \"ntdll.dll\" was loaded but the entry-point DllRegisterServer was not found. Make sure that 'ntdll.dll' is a valid DLL or OCX file and then try again.\"Our server reboot by wininit Any suggestions?","Found the cause: IDMU caused our 2012R2 crash and reboot when UNIX ssod is not responding. We are planning on moving away from IDMU and use Kerberos instead.James"]},{"symptom":"Windows        I have a pc laptop that I had to reset. When I reset it only restored it to Windows 8.1. It had an automatic update to Windows 10 when purchased. How do I get my Windows 10 back?","solutions":["Hi Len. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.It sounds like you ran Factory Recovery partition or media which restores the manufacturer's factory install. This is different than the Windows 10 Reset which would have reinstalled the Windows 10 version you had, explained here:https:\/\/www.zdnet.com\/article\/windows-10-tip-re...At this point what I would do is a gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... This gives the opportunity the wipe all partitions off the hard drive which is the definition of a Clean Install. It is also a great learning experience that will make you permanently the master of your PC''s because you will learn what works best and how to apply it with your own hands. Skip the Product Key during install and it will reactivate afterwards with the permanent Digital License issues to your PC when you first Upgraded which is stored in MS Activation servers.If you don't want to invest in the best install then to Upgrade again to Windows 10 install the Media Creation Tool from this linkhttp:\/\/windows.microsoft.com\/en-us\/windows-10\/m... choosing Download Tool Now, install the tool, open it and choose Upgrade this PC Now. This will save your files and apps while bringing you up to the latest version by the most stable method.If any problems see these steps for overcoming Upgrade problems: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Keep me posted on your progress as I will be here to help until the case is resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Password        Im stuck in bios screen and it wont let me type my password in.","solutions":["Hi barbarawhite7 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.We need a bit more detail to be able to help you. Which passwords are you referring to? BIOS Password or Windows Password? I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"Windows Surface Pro 7 won't Miracast to Roku TV TCL 55US5800        I'm trying to use the wireless display functionality of Windows 10 to mirror my Surface Pro 7 to my TCL Roku TV model 55US5800.  I have used the TV as a wireless display for my previous HP Envy 17 u2713-cl laptop and also my OnePlus 3T Phone without issue.After pressing Win + P on my Surface, I select \"Connect to a Wireless Display\".  I then choose \"Roku TV\" from the list of available devices.  The Surface creates a dialog saying it is attempting to connect and the TV switches to a purple screen indicating it is trying to stream video from a wireless source.  The TV then reports \"Starting video from... <my login name>\" but then kicks me back to the TV menu's home screen.  I have noticed that the Surface screen refreshes after this fails, as though the graphics adapter were resetting itself.I have tried deleting and reinstalling the driver for the \"Roku TV\" found in Device Manager as well as whatever other relevant drivers I could identify.  I saw one recommendation to delete the \"Mircast driver\" but the only thing I see like that is a driver labeled \"Roku TV\" under \"Miracst devices\" in Device Manager.Any suggestions as to what I might try? Unfortunately, being able to wirelessly project my display is 100% essential to my current business and I am very disappointed that this didn't just work.Thank You,Renee Roman","solutions":[]},{"symptom":"Ethernet connection issues, internet working        I have an issue where my ethernet connection on my PC sometimes fails to work even thoughall my internet home devices connected to the same connection are working perfectlywhen I plug my wifi stick into this PC (which I used for months before I tried ethernet), it also works fine and won't come up with any issues even after I use it for months unlike my ethernetmy computer itself fails to detect the issue as the network is displayed as 'connected', I never get any error messages, running windows diagnostics on the connection fails to detect any problemsI say 'sometimes' because: this issue does not happen every time I start my PC restarting my PC 'sometimes' fixes the issue ipconfig\/release, ipconfig\/flushdns, ipconfig\/renew 'sometimes' fixes the issuereseting my network settings 'sometimes' fixes the issue (it might just be the restart though that 'fixes' it)More details on this issue: I believe this issue may be some sort of server connection issue as:the issue doesn't completely block my connection - if I wait long enough I can still google search things\/ load into some webpagesmy connection does not appear to be a speed issue - if I manage to load into youtube the youtube video loads at a normal rate, but moving between different pages in youtube takes foreversolutions that have not worked so far: deleting all my hidden\/unused network adaptersnetwork resetusing google's DNS servers disabling\/unchecking IPV6 to force the connection to use IPV4 (I thought it might be an IPV6 issue as my ethernet status says 'No network access' for IPV6)other details my windows 10 is fully up to date","solutions":["Hi Mary. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything else possible for Ethernet problems to try so that hopefully something works:Right click the network icon in System Tray at bottom right end of task bar to Troubleshoot Problems.Try powering off modem, router and PC and then restarting in that order with 1 minute in between each.Try all of these steps: https:\/\/support.microsoft.com\/en-us\/help\/10741\/... https:\/\/www.kapilarya.com\/how-to-reset-network-...Update your network adapter drivers from the PC maker's Support Downloads web page using the full model number, HP Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.If you have the latest network driver then try on it's Driver tab also to Roll Back, or Uninstall and then restart PC to reinstall the driver. Try also all older drivers from Update Driver > Browse > Let Me Pick list working backwards.Go to Device Manager > Network Adapters, select Ethernet adapter, then Power Management tab, clear the check box to \"Allow the computer to turn off the device to save energy.\" Then on the Advanced tab disable any energy-saving options.If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2...You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t...If this was caused by Version update then you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2...Enable IPv6 in the network adapter settings: https:\/\/www.tenforums.com\/tutorials\/90033-enabl... Download and run the fixit from https:\/\/support.microsoft.com\/help\/929852 to Re-enable IPv6 on all nontunnel interfaces and reboot.Right click the network icon in System Tray at bottom right end of task bar to Troubleshoot Problems.If you're plugging into a router then try plugging into the modem directly. Try turning off Modem and PC, wait 15 minutes to turn back on the modem, then the PC.You also are entitled to Support from your internet provider to get online on all devices. This is always included in the monthly bill. If your router is less than a year old they will also Support getting it connected and optimized.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"how do I download a copy of an older windows that will work on my new mother board        I would like to have one of my older versions that would work with my new motherboard.","solutions":["Windows operating systems do not come for free.Even if they are no longer supported, they are not for free.And even if you could buy an older operating system, the motherboard manufacturer would have to support that operating system and supply drivers for that motherboard for that particular operating system.","Bill is correct in the response,older versions of windows might be found at  amazon.comFirst,go to youre pc mfg,downloads,pc model see what is offered..If XP is current,maybe stick with it,anything but windows 10 is retired,no\/most pc software for older OS isn't updated,it to is retired versions. ","Windows 8.1 is not \"retired\"Microsoft supports Windows 8.1 and will receive updates until 2023."]}]}