{"windows":[{"symptom":"Bluetooth        I recently upgraded my Acer Aspire 57332-4633 from Windows 7 to Windows 10 used to have or so I thought Bluetooth but now I can't find it anywhere what do I do or how do I install something to be able to have Bluetooth","solutions":["Hi Christina If you previously had Bluetooth on that device, then the upgrade has most likely corrupted the Bluetooth driver, and possibly others as wellGo to the support page for your PC on the Acer website, then from there, download and install the Bluetooth driver they recommend . .If you have any difficulty locating that support page, what is the exact Model No. of your Acer Aspire, that will be printed on a sticker on the bottom casing . . ."]},{"symptom":"Microsoft Windows 10 OEM Key on other sites in very cheap price is genuine or Fake?        I seen lots of websites where we got Windows 10 in very cheap price.They said it's genuine and Blah blah blah...I think it's Fake.But I seen lot's of youtuber promoting this site and they says it's genuen.That's why I have to ask all you guys, is that keys really genuine?","solutions":[]},{"symptom":"appointments cannot delete - Special Report with Bret Baier - TV show        I don't recall how I selected to be alerted for a TV show, Special Report with Bret Baier, but now every day I get an alert on my computer to watch this show.  I don't want to be alerted anymore, so I tried deleting the alert in my Appointment Calendar.   But, it will NOT let me delete this recurring alert.   when I try to delete, I get the message, \"you cannot make changes to the content of this read only folder\".   I also notice that at the bottom left of the appointment it says, \"in shared folder, special report with bret baier\".   I'm sure I had selected this alert when I was playing around with one of microsoft's apps, but I now can't find out where I need to go to shut this off.   Any help here would be much appreciated.  thanks.","solutions":[]},{"symptom":"Remote Desktop Printing        Several years ago I lost the ability to print from my office server running Windows Server 2008 R2 Service Pack 1 to my local printer connected thru WiFi to my Windows 7 PC.  Local IT guys were no help.  Recently updated to Windows 10 on a new PC and I gave the local ITY guys another chance but after 2-3 hours they were again no help.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are unable to perform Remote desktop printing from the newly updated Windows 10 PC. However, for issues related to Remote Desktop, let me help to point you in the right direction. I would suggest you to post your query inTechNet Forums where you will find professionals with expertise on RDP for Windows 10 and that would be the appropriate forum. However, you may want to check this article to troubleshoot the issue: Fix printer problems Regards, Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"Windows 10 activation on new device        So i bought a new device and would like to use the old windows key to activate it, (yes i checked an i can do that with my key). how exactly do i remove it from my old device so it can be used in the new one?","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,First you need to identify if the product key on the old computer is a retail key which normally has transfer rights.To uninstall the product key on the other computer 1. Go to start menu and open command prompt with admin permission 2. Execute this command slmgr \/upk To install the product key on the new computer 1. Go to start menu and open command prompt with admin permission 2. Execute this command slmgr \/ipk xxxxx-xxxxx-xxxxx-xxxxx-xxxxx Let me know how it goes. :)","You don't need to do that. Power off the old one and install Windows 10 using boot media created with the Media Creation Tool http:\/\/www.microsoft.com\/en-us\/software-download\/windows10 and use the licence key when asked.I assume you mean your licence is a Windows 10 retail product licence.","my licenese is actually attached to my account since i upgraded the old one from win 7 to win 10 and now i've bought a new computer and would like to transfer it, but i'm not sure how exactly it works out"]},{"symptom":"Minecraft windows 10 wont work        Hello! So basically i had gotten minecraft windows 10 with a code from the xbox edition on another computer , so then i bought a new computer because my old one was broke, and i signed into the same account on the microsoft store but it says i own the trial and not the full game, minecraft windows 10 used to work perfectly on my old computer, but on this one it just doesnt it says i own the trial , i viewed some other people who had the same problem as me and did what the independent advisers told them to do and it doesnt work! i rechecked if i  had the correct account and i did! Please help! ","solutions":["Hi HmAdAdHamHan My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.It looks like your Minecraft game that is stuck on trial mode, has something to do with your Xbox account.So, please try the below steps and check if you are able to play the full version of Minecraft.Launch the Xbox app > Sign-in to the Xbox application using your Microsoft Account (Account which you used to purchase Minecraft) > Browse the games to find Minecraft and click on the Play button the play the game check if it is still showing the trial version.Hope this helps.","I tried it and it showed that i owned minecraft (https:\/\/prnt.sc\/qmlb0r) but if i launch minecraft windows 10 using the xbox app it still says im in trial mode. Thanks for trying to help!","Try to view your Xbox purchase history online to confirm the redeemed code on the Microsoft Account.I recommend checking out the Minecraft support https:\/\/help.minecraft.net\/hc\/en-us for further options if you haven't already.Try installing it again from the Microsoft store browser extension.","No, It didnt work , But i think i know why... So basically i think ( I am not sure ) i bought minecraft the xboxedition on another email, But i downloaded minecraft windows 10 from minecraft xbox edition on another email and not the one with which i bought minecraft xbox edition, and i lost access to the account in which i bought minecraft xbox edition. And also by the way i still have access to the account with which i downloaded minecraft windows 10 but it still says i have the trial. I hope this helps you to find me a solution "]},{"symptom":"Zero performance with on screen keyboard        Hi all,After typing a few characters with the OSK in, say, a web browser, the spacebar simply stops working and complete key-rows turn blue one after another and \"start rolling down\". Although it looks beautiful and I wish I could program this behaviour myself, it makes the OSK absolutely useless. Yet it should be my major mode of input on my brand new Surface Go (updated with W10 Home 1909 and the latest Surface drivers).I'm totally clueless after a couple of resets. Hopefully you're not...Tnx,drftr","solutions":[]},{"symptom":"Unable to set brightness level for Plugged in and on battery        I am using a laptop and I would like to set different screen brightness levels for ac and battery power. I used to be able to do this in the power options but after some version I don't remember, it was removed. However, I was not unhappy with this change because windows remembered what level I have set my brightness to, seperately for plugged and unplugged use. But shortly after some update, this feature stopped working too. Now, it doesn't remember any of my brightness settings. I can change the brightness manually of course, but I dont want to do that every time I plug or unplug my laptop. Did this happen to everyone? Or is it just me? In any case, is there a workaround that allows me to set different brightness levels for both use case scenarios?***Modified title from: I can't set different brightness levels for plugged and unplugged use.***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are unable to set brightness level for plugged in and on battery. I would like to inform you that the brightness slider to adjust brightness separately was removed from Windows 10 starting from the build version 1903. The screen brightness can be adjusted using the slider from the Notification center. Ideally, the brightness slider will allow a user to adjust the display brightness, and that brightness will be remembered as the preferred brightness whether the laptop is on battery or connected to a charger. However, as you have mentioned that after an update the feature is not working, we would like to know the update that was installed recently. To check go toStart >> Settings >> Update & Security >> Windows Update >> View update history. We would also like to know the build version of Windows installed on the computer currently. To check type: winver in thesearch bar on the Taskbar and hit Enter. Meanwhile, I would suggest you to try updating the display drivers and check if that helps. Refer the steps mentioned below: Press Windows Logo key + X, and selectDevice Manager.Expand Display adapters.Right click on the display device and select Update Driver. Article for reference: Update drivers in Windows 10.  For additional information, see Change screen brightness in Windows 10.  Let us know how it goes. Regards,Nikhar KhareMicrosoft Community - Moderator","My build is 1909. However, the problem emerged with an earlier build, maybe 1903.My display drivers are up to date.","Hi,Thank you for replying.I would suggest you to create a new user account and check if the brightness settings work.Refer the steps mentioned in the article Create a local user or administrator account in Windows 10. Let us know how it goes.Regards,Nikhar KhareMicrosoft Community - Moderator","Hello,Please refer these suggestions:1. Run Power troubleshooter from Settings app > Update & security > Troubleshoot.2. Open Device Manager (run devmgmt.msc command), try uninstalling your display adapter and then click Action > Scan for hardware changes.You can refer this fix for additional suggestions:https:\/\/www.kapilarya.com\/fix-cant-change-screen-brightness-in-windows-10Let us know if this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP.","I am afraid that the matter may be somehow misunderstood. I have  the same problem on three different laptops, starting from a recent Windows update, probably 1903. The issue does not refer to malfunctioning of a driver, it is a separate setup of the brightness level for battery operations which has been recently deleted in Windows. In details: it was  possible to easily setup a different brightness level of the display when the laptop was on battery (eg. 80%) and when plugged in (e.g. 90%), for example just through the brightness slider in the  Action Center. Once the laptop was on battery,  reducing the brightness level to (e.g). 80% in the slider of the Action Center was remembered by Windows, so that each time the laptop was unplugged the display brightness was automatically dimming the brightness level (in my example to 80%) . Now the user has to re-set the brightness level manually each time the laptop goes on battery, if the user wants to dim the brightness level when on battery.The problem is that there is no longer a dedicated set up of the display brightness for battery operations, and the specific setups still present in BIOS are overridden by Windows as soon as the brightness level is changed.Reinstating the old feature will  improve the battery runtime of laptops.     "]},{"symptom":"Epson scanner will not work with latest windows 10 update        My epson perfection v700 scanner (that allows me to scan photos, negatives, documents, etc.) and that I paid over $800 for) stopped working with teh latest update two days ago. I've downloaded a new driver and other software from Epson and it doesn't work. Can I uninstall this update? I like my scanner a whole lot more than I like Windows.","solutions":["There seems to be some early adopter issues at this time with Windows 10 1803, if you can, I recommend you downgrade to your previous version until the Spring Creators Update matures with future cumulative updates.Open Start > Settings > Update & security > Recovery > under Go back to my previous version of Windows 10, click Get started.or Press Control + Alt + Delete Click Sign out At the Sign In screen, hold down the shift key on your keyboard while clicking the Power button on the screenContinue to hold down the shift key while clicking Restart Continue to hold down the shift key until the Advanced Recovery Options menu appearsClick Troubleshoot Click Advanced options Click Go back to the previous version of Windows Windows Update might attempt to upgrade to Windows 10 1803 again. See instructions how to block it:https:\/\/www.groovypost.com\/howto\/block-windows-...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi MorningStar. I'm Greg, an installation specialist and 8 year Windows MVP, here to help you.Rather than spending too much more time fiddling I'd simply Clean Reinstall the printer\/scanner which always works, lasts longer and actually saves time:1) Power up the printer, if wired unplug it's USB cable from PC. 2) Go to Settings>Apps>Apps and Features to find and Uninstall the printer software.3) Next right click Start button to open Run box, copy and paste in the following command and press Enter: printui \/s \/t2 (Note that there is one space before each forward slash).4) Right click result to Run as Administrator. 5) Open the Print Server properties, Remove the printer’s drivers for this printer and for any other printers you don't use presently. If you get a message about access denied or the printer being in use and you cannot find the driver or any installed program that would account for this, you may restart the computer in a diagnostic startup and then use the printui command to remove the driver package(s):https:\/\/www.isunshare.com\/windows-10\/enable-dia... You must restart back to normal mode before you will be able to install the printer again.6) Now type Control Panel in Start Search, open CP, choose Icon View. In Control Panel open Devices and Printers, right click the printer to delete the Printer and any scanner or fax of the same name. Restart PC.7) Go to the printer model’s Support Downloads webpage to download and install the latest full software package. Now is also the time to check for any newer printer firmware to install which matters a lot.Older software may need to be installed in Compatibility Mode to run correctly: https:\/\/www.groovypost.com\/howto\/run-old-softwa... 8) Extract Printer software, right click Setup file to Run as Administrator. Follow the setup screens closely as you install the software. For USB it should prompt when to plug in the printer.If you have further problems reply back with results of each step.","I'm not sure if it matters that I'm referring to a scanner as opposed to a printer . . .Unfortunately, I don't know where the CD containing the software is, and Epson doesn't have it as a download. I have to request a CD by mail, I think, and I suspect that it hasn't been updated (or they would probably have it available on line). They undoubtedly would prefer that I spend another $800 to buy an Epson 800 (to replace the 700 that I have). I do scan an inordinate amount of information, but I'm not ready to shell out another $800 because of a Microsoft update.I'm going to have to try to remove this update, and I'm going to turn all future updates off.  I'm tired of the problems they cause.I do appreciate you taking the time to respond, however, and I thank you.","The driver download is here: https:\/\/epson.com\/Support\/Scanners\/Perfection-S.... Disks are dated as soon as they're pressed, all modern downloads come from the Support Downloads webpage for the software or product.Printer steps are same for scanner when it comes to clean installing to avoid repeat problems. I would follow them closely, ask back if you have any problems.","The first thing that I did was check to see if I had the most recent driver (which is dated 07\/26\/13).  I downloaded it an installed it anyway. I also downloaded everything else they had available, but it didn't make a difference:Epson Software Updater v4.4.603\/26\/186.26 MBESU_4.4.6.exeEpson Event Manager v3.10.8803\/05\/1816.5 MBEEM_3.10.88.exeScanner Driver and EPSON Scan Utility v3.92107\/26\/1339.57 MBepson15550.exeEpson Copy Utility v4.1.107\/25\/136.47 MBepson16827.exeThe don't have a product program available for download:How can I get a replacement CD for my product?You can download the driver from the Downloads tab for your product.Note: Only the drivers are available for download. Any extra software that came with the product is only available on the CD.If you wish to obtain a replacement copy of the Software CD (stock permitting), please contact our Driver Fulfillment department at 562 276-4367 (US) or 905 709-3839 (Canada). A charge for shipping and handling plus any applicable taxes may apply.I rolled back the update, and the scanner is working again.Thank you for taking the time to try to help me fix the problem.","It might be necessary to install that old of a driver in Compatbility Mode: https:\/\/www.windowscentral.com\/how-install-non-... Otherwise I'm afraid that the hardware may have been deprecated with the new version of WIndows 10. However if you want to hide the Update so it doesn't reinstall it then they may fix whatever caused it to stop working if you wait to install it, even skip to the next version in six months: https:\/\/www.howtogeek.com\/224471\/how-to-prevent...","I am having similar issues as Morningstar. Epson scanner DS-510 will scan once, then requires a restart of my whole computer to scan again. This behavior began 5\/22\/18, the day my Windows 10 v. 1803 update was installed. Attempted Greg's solution and it did not work (I actually had my original driver CD, which I installed and updated). I will try to roll back the update next. IT takes SO much time! ","Thank you all for this information. I appreciate Greg's advice to try a clean driver uninstall.This appears to be the same problem I am facing with my Epson Perfection V700 Photo scanner. I installed the Windows 1803 update in May when Epson Scan started to crash. I uninstalled and reinstalled the latest scanner driver. I tried rolling back to an older graphics card driver. I also tried a different usb cable and port. However the problem persisted.Epson scan crashes when I click on any window outside the Epson scan interface and then click back into Epson scan. Then a blue circle starts turning forever. I have to close Epson scan using the task manager or by right clicking Epson scan in the taskbar\/close and Windows gives the option to send an error report. I have to turn off the scanner and unplug it and start it up again before launching Epson scan again. A reboot is not required.So I can see I have some choices. Either I can wait for Epson to update the driver or Microsoft to fix the problem or I can downgrade Windows to the older version. In the meantime its still possible to scan as long as I do not click outside the scanner interface window. After a scanning session I can close Epson scan. Hopefully Microsoft or Epson will fix the problem soon.Kind regardsChris","I've got the same issue here. Any solution now?Thanks.","I called Epson, after spending a week on two different systems with fresh installations of both Windows 10 1709, and Windows 10 1803 we determined that the Epson Scan application isn't compatible with 1803.The only fix at this time is to roll back!Epson will need to work with Microsoft to figure out why it's broken, but all Epson scanners that rely on the Epson Scan application are broken on 1803."]},{"symptom":"How do I properly express that I hate OneDrive?        Don't misunderstand me. I have enjoyed using OneDrive for word documents and small data files. But, I moved 60gb of photos from a hard drive into my new computer. Now Onedrive is forcibly trying to move those pictures online. It seems I have absolutely ZERO CONTROL on which folders OneDrive will try to take online. Sure, I can slow down the upload speed, but can I stop the transfer? Nope! I have been at this for an hour, and what I thought would be fun perk has been nothing but annoying.You're out of here OneDrive! I'm going back to Google Drive","solutions":["I'm experiencing this exact same problem. Cut 50gb photos from an external hard drive onto 'My Documents'. Syncs automatically with OneDrive, obviously fills up the 5gb free storage. Cue dozens of notifications asking me to purchase more space. In trying to cancel the process OneDrive has managed to permanently delete those photos from my laptop. I'm devastated. Now my screen is filled with red crossesTruly is an awful program","My problem is just the opposite. I want to save data on OneDrive but I do NOT want it copied in any way to my computers. I want a purely online storage site. I have looked at numerous sites telling how to make this happen. Nothing works to accomplish this.I am currently engaging with OneDrive Support trying to find out if this is even POSSIBLE.Because of my Office 365 Home subscription I have 1 TB of space available on OneDrive, but if I cannot totally stop syncing in any way, OneDrive is useless to me.What crap. Google Drive is looking better and better, but it does not give me the storage space that OneDrive purports to do.Very unhappy.","OneDrive is the most useless product I have ever had. It will not sync files and I have spent hours of my time with their email tech support (what a joke). They should be ashamed of themselves for releasing such a poorly executed program. This came with my office 365 and was loaded with windows 10. It will sync some files and others it never updates. I have literally left my computer on for days to try and get it to sync.The support is painful and now all I want to do is delete it and save my files on a hard drive. Sure its old school, but it has never failed me. Why cant a company as large as microsoft build a decent product and offer support on it. Having to deal with email support is like talking to the wall. Now I am stuck with this junk and cant easily take it off my computer so that my office programs will just save to the hard drive.Thanks for nothing Microjunk!","It continues on. Despite my repeatedly telling email OneDrive support that I'm fed up with this, they keep offering solutions. THEIR SOLUTIONS DO NOTHING TO TOTALLY STOP SYNCING!!!I have  told them that Microsoft ought to dump OneDrive as it currently exists. It is an example of being overly complicated, and not being able to do a basic thing. Told them they should emulate Google Drive, which I do use for small things. I'm getting 1 TB of OneDrive space with my Office 365 subscription, but it is useless to me.Microsoft devotes too much attention to adding more \"features\" glut to Windows (some of which I do not even see after doing their upgrades), and no attention to fixing what is broken. I have read that Edge browser is going to be replaced with something based on Google Chrome. Good!! If they can do that, they should be able to offer cloud storage that is as simple as Google Drive.Does anyone from Microsoft respond to these discussions?","It continues on. Despite my repeatedly telling email OneDrive support that I'm fed up with this, they keep offering solutions. THEIR SOLUTIONS DO NOTHING TO TOTALLY STOP SYNCING!!!I have  told them that Microsoft ought to dump OneDrive as it currently exists. It is an example of being overly complicated, and not being able to do a basic thing. Told them they should emulate Google Drive, which I do use for small things. I'm getting 1 TB of OneDrive space with my Office 365 subscription, but it is useless to me.Microsoft devotes too much attention to adding more \"features\" glut to Windows (some of which I do not even see after doing their upgrades), and no attention to fixing what is broken. I have read that Edge browser is going to be replaced with something based on Google Chrome. Good!! If they can do that, they should be able to offer cloud storage that is as simple as Google Drive.Does anyone from Microsoft respond to these discussions?I completely agree. As of now I have many hours ahead of me to try and capture my original files and the save them to a hard drive. I purchased office 365 for the 1tb storage and it is useless. I should have keep my older office program, which worked perfectly. Now I will be stuck with this garbage. Onedrive will still be intrusive and very difficult to stop. What a nightmare and waste of money. Microsoft will do nothing as evidenced by the countless complaints over the years!","OneDrive can be closed, from its settings menus. It can also be uninstalled entirely, from Start-Settings or Control panel.I've closed it so it's not showing in the Notification Area. I haven't uninstalled it yet....still awaiting a Microsoft miracle to allow me to use it.  If uninstalled, you can reinstall it  again whenever.","OneDrive can be closed, from its settings menus. It can also be uninstalled entirely, from Start-Settings or Control panel.I've closed it so it's not showing in the Notification Area. I haven't uninstalled it yet....still awaiting a Microsoft miracle to allow me to use it.  If uninstalled, you can reinstall it  again whenever.I will try that today, however I was under the impression that it is difficult to remove it from their office package. Hopefully it will ok. For now I have to go through 50 gb of data to sort the duplicates and get one clean file to copy to a hard drive. What a nightmare.","I HATE THIS \"SERVICE\". So not only was 50GB not enough space, fine okay I get that. But it won't stop SYNCING. And when asking me to free up space so that it won't freeze not only does it remove the document from online it removes it locally too. I have three backup locations, my hard drive, my google drive and my one drive. For whatever reason removing it from Onedrive online removed it from ALL LOCATIONS. How did this happen??? So now I'm forced to pay a $6.99 subscription for 1TB to restore everything that was deleted. Re save it to everywhere (I now have a 1TB external) and then cancel the subscription and remove everything from onedrive yet again and hope it doesn't remove it from my local hard drive and Google Drives. This truly is a horribly flawed \"service\" that I can't wait to be done with. ","Oh let me add, now that I have restored everything and I'm trying to now save it all to my external. The program is stopping abruptly and exiting before the files are saving to the external. My patience is about non existent after working on this for hours. But I'm determined. ","I spent weeks and weeks going back and forth with diffrent MS OneDrive Support people, all thinking that they were telling me how to have OneDrive COMPLETELY STOP SYNCING.  Nothing can accomplish this.I have 1 TB. of OneDrive, thanks to my Office 365 subscription, but it is of NO USE to me unless I could have it be ONLY ONLINE  IN-THE-CLOUD STORAGE, with no connection to any folders on the computer. But, it doesn't appear that is possible.What a waste.I can do what I want with Google Drive, but I'd have to pay for a decent amount of space (still nowhere what I get with OneDrive),so I'm dispensing with the cloud, period.I have a number of 2.5\" external hard drives, so I can take the entire contents of my NAS network storage with me if I want portability.I'm starting to dream that the new Edge browser, based on Chromium (in beta testing now), could lead MS to be more Google Drive-like with their cloud system."]},{"symptom":"Windows 11        Saya mau tanya apakah benar windows 11 akan rilis bulan maret 2020?","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I see that you are looking for Indonesian language support. I would like to inform that you have reached the English support forum. For better clarity, we would appreciate if you could post your query in English. However, upon translating your query, I see that you want to know about Windows 11. I would like to inform that currently, the latest version of Windows available is Windows 10 and the information about Windows 11 is just a rumor. As of now, there is no information available about Windows 11 officially. If you are using Windows 10, I would suggest you to keep your computer updated with the latest updates. For more information on installing Windows updates, see Windows Update: FAQ. I would also suggest you to beware of the sites providing information on downloading Windows. If you wish to download Windows, you can navigate tohttps:\/\/www.microsoft.com\/en-us\/software-download\/windows10 If you need assistance in Indonesian language, you may want to get in touch with our Live Technical Support team by calling them. Please refer the articleGlobal Customer Service phone numbers to get the Customer support number as per your country. Let us know if you need any further information, we will be glad to help you. Regards,Nikhar KhareMicrosoft Community - Moderator","Saya mau tanya apakah benar windows 11 akan rilis bulan maret 2020? - Tidak itu tidak benar"]},{"symptom":"Windows Time-Service        Log Name:      SystemSource:        Microsoft-Windows-Time-ServiceDate:          1\/4\/2020 5:06:10 AMEvent ID:      134Task Category: NoneLevel:         WarningKeywords:      User:          LOCAL SERVICEComputer:      DESKTOP-10C8IUPDescription:NtpClient was unable to set a manual peer to use as a time source because of DNS resolution error on 'time.windows.com,0x9'. NtpClient will try again in 15 minutes and double the reattempt interval thereafter. The error was: No such host is known. (0x80072AF9)Event Xml:Community friends,Ever since the calendar rolled into 2020, I have been getting this logged Event ID 134 (see below).This appears to be occurring at my every morning startup and login to my PC.Would anyone have any thoughts or comments on why this may be happening?Many thanks!IndyIceMan _____________________________________________________________________________________________________________________<Event xmlns=\"http:\/\/schemas.microsoft.com\/win\/2004\/08\/events\/event\">  <System>    <Provider Name=\"Microsoft-Windows-Time-Service\" Guid=\"{06edcfeb-0fd0-4e53-acca-a6f8bbf81bcb}\" \/>    <EventID>134<\/EventID>    <Version>0<\/Version>    <Level>3<\/Level>    <Task>0<\/Task>    <Opcode>0<\/Opcode>    <Keywords>0x8000000000000000<\/Keywords>    <TimeCreated SystemTime=\"2020-01-04T10:06:10.415885400Z\" \/>    <EventRecordID>10778<\/EventRecordID>    <Correlation \/>    <Execution ProcessID=\"13668\" ThreadID=\"11484\" \/>    <Channel>System<\/Channel>    <Computer>DESKTOP-10C8IUP<\/Computer>    <Security UserID=\"S-1-5-19\" \/>  <\/System>  <EventData Name=\"TMP_EVENT_MANUAL_PEER_DNS_ERROR\">    <Data Name=\"ErrorMessage\">No such host is known. (0x80072AF9)<\/Data>    <Data Name=\"RetryMinutes\">15<\/Data>    <Data Name=\"DomainPeer\">time.windows.com,0x9<\/Data>  <\/EventData>________________________________________________________________________________________________________________________","solutions":["Hi there My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.1. Try changing the synchronization server to time.nist.gov and click Update now.Open Control Panel. Click on Clock, Language, and Region. Click on Date and Time. Click on the Internet Time tab. Click the Change settings button. Check that the Synchronize with an internet time server option is selected. Choose a different time server from the list or type in time.nist.gov Click the Update now button to synchronize the time with the new server. Click OK. Click Apply. Click OK. 2. Open administrative Command Prompt. Click on Start, type cmd, right click command prompt and select run as administratorAnswer yes Type these commands one-by-one and press Enter key after each: w32tm \/debug \/disable w32tm \/unregister w32tm \/register Hope this helps.","JonBland,I have attempted all your suggestions, but they had no affect. I am still getting the same event error. What's puzzling, is the fact that before the clock rolled over into 2020, I had never ever gotten this event error.So what could have changed to cause this ?Thanks for your help all the same !indyice ","1. Try running the following from command prompt as above ipconfig \/flushdns (Clear the dns cache) nbtstat -RR (release and refresh NetBIOS names) netsh int ip reset (reset ip settings) netsh winsock reset (Reset Winsock Catalog) 2. Check local hosts file In the folder below there is a file called hosts (no extension) that can be opened with notepad.C:\\Windows\\System32\\drivers\\etc See if there are any dubious entries in there. 3. Change time server Open Control Panel. Click on Clock, Language, and Region. Click on Date and Time. Click on the Internet Time tab. Click the Change settings button. Check that the Synchronise with an internet time server option is selected. Use the drop-down menu to select a different server or type in a new time server such as time.windows.com or time.google.com or time.nist.gov or pool.ntp.orgClick the Update now button to synchronise the time with the new server. Click OK. Click Apply. Click OK.","JonBland,I am a little reluctant to try any more suggestions as when I tried your last ones, I seem to have now lost the ability to sync with the time.nist.gov server. I am getting an error message every time I try to. What happened there ?I can now only sync with the time.windows.com server. IndyIce ","I can understand your frustrations.Option 1 is resetting your network and flushing your dns (both will be reapplied and work after a restart).Option 2 is simply checking a file.Option 3 is changing the time server to see if you can sync with it. If not you can change it again until one works or back to time.windows.com.Another option would be to see if you can ping time.nist.gov by entering the following command at a command prompt:Ping time.nist.com","JonBland,I just discovered that I am getting this event error \"ONLY\" when I have \"FAST START\" enabled.No event errors when disabled.Any thoughts ?Thanks again,IndyIce"]},{"symptom":"how to remove dos mode from windos 10        hey  how i can remove dos mode from windos 10","solutions":["Hello mhmadking, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemDo you mean by Dos mode, windows safe mode? can you please explain more or send a screenshot? Regards! Farah","hey farah thanks for reply i need to lanuch fivem for gtav but when i open it he say could not load gamecitizen dll and when i open this dll  he say This program cannot be run in DOS mode. i just need to run this dll file i wish you help me...","Hello there, This has nothing to do with Windows, as this is a special configurations to the game,You need to do as this video and it should work https:\/\/www.youtube.com\/watch?v=17Ilawr-N-c","no i try every thing on google and youtube the problem is dos mode i need to delet it because  when i open the dll the problem say dos mode and i dont know if he mean safe mode but i dont thing there is a way to delet dos can you tell me what is he and last thing if i delet this windows and buy new windows 10 is the dos he willnot exist .......","Hello again, the error you receive has nothing to do with windows.. Dos mode means that you don't have graphical interface and you are booting up to Dos command mode.I suggest you check your game and install it again.","i instal it again and again but the file because he dont lanuch fivem he say this programe cannot run in dos tell me how i delet him please","or how i can order the dos mode run this dll","Sorry I can not help you further","Hi, DOS is an integral part of Windows and can't be removed. The issue doesn't require you to remove DOS though as .dll files are meant to be used by other programs, and not opened directly. I would like to troubleshoot the gamecitizen issue with you, as I think that's the main issue here. Was the game bought through Steam or the Rockstar launcher?","hey thanks for reply  i buy the game from steam the game is gtav and when i open fivem he say could not load citizen game dll and this dll are existing in same file but when i open this dl written inside them this programe cannot run in dos mode  the name of dll is citizen game dll"]},{"symptom":"Not sure if Microsoft is who called me? How do I find out?        I had a phonecall from a number 02039723701, it was london area code, they said they are Microsoft and that my computer is sending errors to them, and that I have a virus and they need to do something on my computer to stop it. I know that sometimes there are scams like this, but this was an English man, from London, and he knew things about my computer that a stranger would not know, He is calling me back at 1pm because I told him I was about to go to my dentist appointment this morning. I just need to know if this is real microsoft tech support number or not. I looked on google already and on https:\/\/scam-caller.co.uk\/there was one comment for this phone number saying it was microsoft tech support too. I just need to be sure, is there a safe number I can call to check or is this the real tech support number please? ","solutions":["Hi Dynlan,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Definitely a scam. Microsoft never calls their customers unless you made arrangements. Also, one computer never sends out viruses to other computer.Via Bruce Hagen's post from here.https:\/\/answers.microsoft.com\/en-us\/feedback\/fo...It's a scam that has been going on for about twenty years. Microsoft never makes unsolicited phone calls.Is that call from Microsoft a scam?http:\/\/answers.microsoft.com\/en-us\/protect\/wiki...Report the scamhttp:\/\/support.microsoft.com\/reportascamEmail and web scams: How to help protect yourselfhttp:\/\/www.microsoft.com\/security\/online-privac...Is it a genuine call from Microsoft?http:\/\/www.computeractive.co.uk\/ca\/pc-help\/2134...Avoid tech support phone scamshttp:\/\/www.microsoft.com\/en-gb\/security\/online-...Do not fall for phony phone tech supporthttp:\/\/blogs.msdn.com\/b\/securitytipstalk\/archiv...Aggressive, persistent Windows tech support scammers continue to stalk consumershttp:\/\/www.computerworld.com\/s\/article\/9248122\/...Disclaimer:There are links to non-Microsoft websites which would provide accurate and safe information. Watch out for ads on the websites which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","That's a scam.Microsoft will never call you out of the blue.Only if you have previously contacted the official Microsoft Support, they might call you.Next time you receive such a call: Just hang up!FYI: Official Microsoft Support phone numbers can be found here: https:\/\/support.microsoft.com\/en-us\/help\/4051701\/global-customer-service-phone-numbersYou might want to read:Some related and official Microsoft articles:Protect yourself from tech support scamsTech support scamswww.microsoft.com\/reportascamOther non-Microsoft, but very good articles worth reading: https:\/\/blog.malwarebytes.com\/tech-support-scams\/:Beware of Phony Tech Support Scams  "]},{"symptom":"Message:  Error accessing registry        I tried to install some older software on WIN 10 which, according to the 'net, others have done successfully.When I try to run the set-up program, I get the above-referenced message.  Research suggests this is usually due to \"dead\" entries in the registry left over from applications which were not completely removed and\/or remnants from a previous version of Windows IE installing WIN 10 over top of Win 7 (which might be the case with me)Several people on this forum have suggested \"it's never a good idea to run a registry cleaner\".  This being the case, HOW do I find and remove the offending registry entries?I may not be posting this to the correct topic.Thanks in advance for any suggestions,Terry","solutions":["I may not be posting this to the correct topic.Yes, registry \"cleaners\" are bad news.Nothing wrong with the forum you selected.How old is the program you're trying to install?Try this:Right-click setup.exe (or whatever the installation program is called)Left-click Run as Administrator","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. I totally understand the query. However, it may be possible to know which registry entries are dead. As it may not be possible to recognize which registry entries are troubling your program to get installed, we would not be able to clear those entries particularly.If you really want this program to be installed in your PC and if you think this is the only resolution (registry fix), you may need to perform a clean installation of Windows 10.","The technician who installed WIN 10 told me he had formatted my C: drive.  This \"should\" have meant he did a clean install.Thanks for your reply.Terry","Thank you Frederik!  I'll try running as administrator.The program in question is Lotus 123 - a part of Lotus SmartSuite Version 9.6.  I KNOW this is \"old\", but a search of the ''net suggests several people have this installed successfully on WIN 10 machines.Terry","Terry, please ask the technician to use the Media Creation Tool to run the clean installation. You can also try to prepare an installation media and start the installation setup using the Media Creation Tool.The installation disk the technician is using might have some issue. https:\/\/www.microsoft.com\/en-in\/software-downlo...","Terry, please ask the technician to use the Media Creation Tool to run the clean installation. You can also try to prepare an installation media and start the installation setup using the Media Creation Tool.The installation disk the technician is using might have some issue. https:\/\/www.microsoft.com\/en-in\/software-downlo...Your advice applies when someone wants to upgrade from Win7 to Win10.Terry does not want to do this. He wants to install Lotus 123."]},{"symptom":"Windows will not allow me to control \"Read Only\" on any folder no matter what.        I have tried CMD, with the steps outlined in every Windows \"Solution\" possible done exactly, to no avail. I have tried to use the Registry Editor, setting everything up (yes, even made a back up) to allow me full 100% unrestricted access to everything (that isn't \"protected\" like AntiVirus or certain Windows shells) and that works. I can edit just about anything that I would to edit. It isn't perfect, but any control is better than none that Windows comes standard with. I am currently running Windows 10 Pro (serial upon request), with my PowerShell version at 5.1.18362.1I am running into issues with Modding games, more specifically with LOOT. For some reason I cannot gain access to a file log that is required to run LOOT effectively. I can access the file log by myself just fine, Windows appears to have \"Read Only\" unselected on the actual .pak file and the .dll files that I need access toyet every other folder still have the \"Read Only\" box darkened, including the folder that holds the files I need to have LOOT access.From my understanding of how Windows operates, the dark box (not the check mark) indicates that there is something within that folder that is \"Read Only.\" Yet within that same folder, if I check each folder and file within those, every last one has \"Read Only\" unchecked. So, either Windows is locking \"Read Only\" even though I have full rights according to Windows, or Windows has files that are \"hidden\" even though I have \"Show Hidden Files and Folder\" activated by default through Registry Editor. I have it done through Registry Editor because I've found that after updating Windows many things (like hidden folders and files and many of my individual folder and file settings) resets. Sometimes it even happens when the computer either restarts or is shut off.I refuse to believe that there is zero way to make these issues go away permanently, and every last one of the \"default\" Windows \"solutions\" do not work at all.Thank you~Mike","solutions":["Thank you Richard Watson36 who created their account 20 minutes ago and gave a funky formatted phone number for me to call. I think I'll wait a bit for someone else to reply.","I've had similar issues with Windows not giving me the right permissions, even running as an administrator.On your 2nd screenshot you have the \"Advanced Security Settings for Program Files (x86)\" settings. Click the \"Change Owner\". Then on the next pop-up that comes up there is a text box at the bottom with the title \"Enter the object name to select (examples):\"Put your username in there and click \"Check Names\" it should then resolve your username to the full one that the PC knows you as. Then click \"OK\". That box will disappear. Back on the \"Advanced Security Settings for Program Files (x86)\" box click the check box at the bottom that says \"Replace all child object permission entries with inheritable permission entries from this object\".Then click \"Apply\". If the box doesn't close, close it and then restart your machine.Not guaranteed to fix it, but I've used this method before and it's worked for me. Even when it shows as me being the owner to start with","This is definitely not a \"standard\" solution. Thanks!However, it didn't work. It didn't work magnificently! Not only did this (the child object permissions) take a very long time to compile, but the entire process stopped every time a program wouldn't allow me to change it, which was a lot, and I had to sit and manually click OK to each and every one. Funny enough, one of the programs that wouldn't allow me to modify was Solitaire!Which is plain silly.Anyway, it did finish (after an hour), I restarted the computer, checked my files, and it's still the same. Nothing works. Everything appeared to revert back to the way it was before. So all that appears to have done nothing. I was ready to just give up and continue my life, but now my Start Menu won't work!The Start doesn't open no matter what I've tried. It doesn't work on the keyboard or on screen. And neither does the \"Type here to search\" tab next to Start. I can still left-click on the Windows button and options pop up, but that's it. Nothing else at all.I've tried the \"sfc \/scannow\" fix (nothing was wrong), I've tried the \"dism \/online \/cleanup-image \/restorehealth\" fix (no issues), I've even tried the \"restart Windows Explorer\" fix, with restarting every time, all to no avail. I also tried \"Application Identity Service\" then restart.Start no longer works."]},{"symptom":"Intermittent dropouts with Bluetooth \/ WiFi module and Ethernet port on any Windows 10 machine I sign in with.        Hi there,I seem to be having a weird problem where my WiFi\/Bluetooth module and Ethernet port would intermittently dropout. It's happened to my past 2 laptops and I've already tried updating device drivers, firmware and chipset drivers for all 3 laptops. I'm also running a very reputable virus scanner that detected no threats.   My guess it's some sort of setting or file from OneDrive that's causing these issues. I'm not saying all copies of Windows 10 are like this, just this particular Microsoft account and any laptops accessing it. ","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please Back up your One Drive folder to another folder location and Disable OneDrive for a couple of hours and check if this is happening or not.Please let me know the status."]},{"symptom":"PC trouble (big problem)        So I don't know if what happened to me is rare, but apparently in a fit of panic over BIOS telling me about my CPU fan, I restored defaults and accidentally uninstalled my network drivers in the process. I know logging in to my desktop would fix it but I appear to of lost my password because PIN became a mandatory sign in. How do I fix this without logging on? I can't recover the password as far as I'm aware. Is a factory reset needed?Please help?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. If this is a Microsoft Account you can Reset the password at the following website.https:\/\/account.live.com\/password\/resetHowever, you need to connect the PC to the internet in order to Sign-in. Because the entered password will be verified by the cloud server.Hence, if you cannot connect the PC to the WIFI, please try the Ethernet cable. If this is a Local Account, you need to perform a clean installation."]},{"symptom":"BSOD et Windows 10 version 1909        Hi,It offers a menu and I choose the mode without failure. Attached is the TXT file containing the last dump files. Nic","solutions":["There is no attachment. You need to share a folder on OneDrive (for example) with the text file to share it here.","* Merged Windows starts and creates a dump file, it restarts and indicates that it could not boot properly. I do a re-start and no problem this time.The last three dump files in txt file :Thank you for your help.NicSorry for my english, I am French :-)","Please update your original post and not create a new one.","Hi Nic We need the actual minidump files, not a text file, please share those so we can help you . . .Open Windows File Explorer Navigate to C:\\Windows\\Minidump Zip up the contents of that folder If you have problems zipping those files, copy them out onto your Desktop and zip them from thereUpload the zip file to the Cloud (OneDrive, DropBox . . . etc.) Then post a link here to the zip file, so we can take a look for you . . .","Sorry but I don't use OneDrive because problems.I have a link on Google Drivehttps:\/\/drive.google.com\/file\/d\/1fjswI-bEVpwpa7KqW_-ZkDZvFZAX0NUx\/view?usp=sharingI hope it will work","Hi,Nobody can help me ?Nic","Hi, I've had a look at your dmp file. I'm not really very good at reading these files (no experience) but see a PAGE FAULT that could be something to do with your RAM. I guess you've not had a problem with memory in the past.The only thing that stands out to me is the dates of files seem to be all over the place with some file dates very old and some in the future. I don't know why that would be but your time and region settings are okay as far as you can tell? (it could be normal for dmp files)I had left your thread to begin with as DaveM121 had asked for the dmp file and is usually good at coming back to answer. I'll try to get his attention to see if he can advise you.","Hi Nic,I need the actual dump files, not the printout in text format, please try to upload those . . .Open Windows File ExplorerNavigate to C:\\Windows\\MinidumpCopy any minidump files onto your Desktop, then zip those upUpload the zip file to the Cloud (OneDrive, DropBox . . . etc.), then choose to share those and get a share linkThen post the link here to the zip file, so we can take a look for you . . .","Hi,Link to minidump ziphttps:\/\/drive.google.com\/file\/d\/1FmhUnMx9XJHHNdzlt4nbakoiYW3LjPNM\/view?usp=sharingThank you","Hi, Sorry, I was offline . . All your minidump files indicate your system crashes are caused by npf_devolo.sys, that is a virtual device driver associated with NetGroup Packet Filter Driver (devolo) by CACE TechnologiesAre you using software like WinPCap to filter network traffic?"]},{"symptom":"How can I restore Windows 8?        I had Windows 8 on my laptop. When hard disc crashed it was changed and I have lost Windows 8(it was upgraded to Windows 10). Is there any code on my laptop(Windows came allready installed on laptop) so I can restore Windows?Thank you(and I am sorry for my bad english)","solutions":["Support and downloads for 8 has ended.Do a clean install of the exact same edition of 8.1 as 8 is. Windows 8 > 8.1 is a free upgrade released by Microsoft.@@@@@@@@@@@@@@@@@@@@@@@@@@IMPORTANT: Read the part about generic keysYou can download and create your own Windows 8.1 Installation Media to reinstall the Operating System with..\"Create installation media for Windows 8.1\"http:\/\/windows.microsoft.com\/en-us\/windows-8\/create-reset-refresh-media\"Download Windows 8.1\"https:\/\/www.microsoft.com\/en-us\/software-download\/windows8A similar Tutorial which may also assist you\"Create Installation Media for Windows 8.1\"http:\/\/winsupersite.com\/windows-8\/create-installation-media-windows-81In the first screen of this very simple wizard, you need to choose the following:Language. English – en-us if you're in the United States.Edition. Windows 8.1 (Core), Windows 8.1 N, Windows 8.1 Pro, Windows 8.1 Pro N, or Windows 8.1 Single Language.Architecture. 64-bit (x64 ) or 32-bit (x86)._______________________________________\"How to Create a Bootable USB or DVD with a Windows 8 or 8.1 ISO\"http:\/\/www.eightforums.com\/tutorials\/2227-create-bootable-usb-dvd-windows-8-iso.html   WarningThis will not work to install Windows 8 or 8.1 for UEFI. For that, see this tutorial below instead.UEFI Bootable USB Flash Drive - Create in Windows_____________________________________To access BIOS\/UEFI - UEFI\/EFI configuration:https:\/\/neosmart.net\/wiki\/boot-usb-drive\/_____________________________________How to clean install:\"How to Do a Clean Install of Windows 8 or Windows 8.1\"http:\/\/www.eightforums.com\/tutorials\/2299-clean-install-windows-8-a.htmlMake sure that you read Section 4 about using generic keysIf you have a retailWindows 8 product key and want to clean install Windows 8.1or Windows 8.1 Update, then you would need to enter a generic key below to install unactivated with, and change the product key later on instep 22 below to activate with your Windows 8 key.If you have a retailWindows 8.1 product key and want to clean install Windows 8.1or Windows 8.1 Update, then you are good.If you have an OEM Windows 8product key and want to clean install Windows8.1 or Windows 8.1 Update, then you would need to enter a generic key below to install unactivated with, and change the product key later on instep 22 below to activate with your OEM Windows 8 COA product key.If you want to clean installWindows 8 Enterprise,Windows 8.1 Enterprise, or Windows 8.1 Update Enterprise, then you would need to change the product key later on instep 22 below to activate since Enterprise editions do not ask to enter a key at this step._____________________________________With Windows 8\/8.1 The Product Key on preinstalled Operating Systems (HP, Acer, etc) is embedded in the BIOS in the Motherboard, so that the lost and\/or worn C.O.A. Sticker problem is no more.When you reinstall it will pick up the Product Key and activate the system automatically.If it does not, follow these steps:\"How to Activate Windows 8 and 8.1 by Phone\"http:\/\/www.eightforums.com\/tutorials\/24636-activate-windows-8-phone.html\"Get help with activation errors\"http:\/\/windows.microsoft.com\/en-us\/windows-8\/activation-errors\"How to activate a Microsoft product by using Microsoft Product Activation Center\"http:\/\/support.microsoft.com\/kb\/950929\/en-us_______________________________________________How to find the Windows 8 product key:\"Windows 10 Embedded Product Key Tool\"https:\/\/neosmart.net\/blog\/2014\/windows-10-embedded-product-key-tool\/\"We’re proud to introduce the immediate release of our newest utility for Windows users: the NeoSmart Technologies Embedded Product Key Tool. Designed for users of Windows 7, Windows 8, and Windows 10, our embedded product key tool will retrieve and display the Windows setup product key embedded in the BIOS or EFI, allowing you to store it for safe-keeping or use it to reinstall Windows with an official Windows setup image.\"You can also use:\"Belarc Advisor - Free Personal PC Audit (Version 8.5c)\"http:\/\/www.belarc.com\/free_download.htmlOr:\"Product KeyFinder\"https:\/\/www.magicaljellybean.com\/keyfinder\/Cheers."]}]}