{"windows":[{"symptom":"[SOLVED] There were problems installing updates. But we'll try again later        While setting up my windows mixed reality headset, I was greeted with the message that windows mixed reality needed to update, and to go to settings and update & security. Turns out that I was actually behind on updates, so I started installing things and quickly ran into this issue. \"2019-12 Cumulative Update for Windows 10 Version 1903 for x64-based Systems (KB4530684) - Error 0x80073701\". When I retry the exact same thing happens. Any clue as to how I could solve this?","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command prompt DISM \/Online \/Cleanup-Image \/RestoreHealth Run these commands on the command prompt to restart windows update services net stop bits net stop cryptsvc net stop wuauserv net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start bits net start cryptsvc net start wuauserv net start msiserver After successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig 2. On the system configuration window go to the services tab 3. Tick on hide all microsoft service so that this won't be affected 4. Choose to disable all services 5. Next, go to the startup tab and on the window choose to open task manager 6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok 8. A prompt to restart the computer will show up, choose to restart This should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo... 2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept. 4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","The first method didn't work, but the second one did! Thanks Gary.","My pleasure! Please do keep me posted regarding this so that we can have it sorted out. :)","The first method didn't work, but the second one did! Thanks Gary. When ready please mark the post which helped most as the Answer, to help others. A rating is also appreciated."]},{"symptom":"Cortana adds tasks to the \"wrong\" to-do list        When I add a task using Cortana, it appears in her task list (i.e., the new task appears in Cortana > Notebook > Organizer > Lists > To Do), but it doesn't appear in my Outlook (2016), Outlook.com, or Microsoft To Do lists.Cortana and Microsoft To Do are linked to my Microsoft account (i.e., choosing Cortana > Notebook > Manage Skills > Manage Accounts > Outlook shows my Microsoft email and says that my calendar, email, and reminders\/lists\/tasks are linked). Cortanacan read appointments from my Outlook calendar.When I add tasks in Microsoft To Do, they do show up in Outlook 2016 and Outlook.com (i.e., those are clearly linked).I have read plenty of posts that explain how to link Cortana and Microsoft To Do (please don't post a generic link explaining how to do that), and my accounts are linked and Cortana can read my Outlook calendar, but she adds tasks to her own to-do list rather than to Microsoft To Do.Thanks!","solutions":["Hah! Unlinking and relinking my accounts fixed it. I'm a little chagrin after saying that I didn't need people to tell me how to link my account. It is curious, because Cortana could read my linked calendar. In any case, if something similar happens to you, try unlinking (Cortana > Notebook > Manage Skills > Manage Account > Outlook > Unlink) and relinking your account."]},{"symptom":"Stuck in UEFI BIOS Utility EZ Mode        When I start my pc, it will automatically enter the UEFI BIOS Utility EZ Mode. After press F10 (Save & Exit), it will shut down and restart and enter the UEFI BIOS Utility EZ Mode again.It's ASUS UEFI BIOS. And I failed to disable the Secure Boot.PLEASE HELP!!! THANKS A LOT!!!","solutions":["Hi Monica. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.What happened just before this occurred. Were there Windows Updates? Please explain in detail.Go into UEFI setup and scour the Settings to try to find the Windows hard drive listed in Storage or other settings. It may have failed.While there check the Boot Priority Order to make sure Windows Boot Manager is still set first to boot as it must always be.Try finding Secure Boot again and Fast Boot to disable them until after this is resolved.If the hard drive is discoverable, then Test the hard drive or SSD with diagnostics:https:\/\/www.lifewire.com\/free-hard-drive-testin...https:\/\/mashtips.com\/ssd-health-test-and-perfor...HP and Dell have hardware diagnostics triggered by tapping the ESC or F12 keys respectively as you power on.Best is to use the HDD\/SSD manufacturer's own if there is one, otherwise use Seatools bootable long test:http:\/\/blog.nowherelan.com\/2013\/04\/04\/boot-seat... Follow this up with a full Disk Check from the Command Prompt in Repair Mode or from bootable media:https:\/\/www.groovypost.com\/howto\/check-hard-dri... if necessary from the Command Prompt at boot:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... If it passes, can you trigger the Repair Mode by whichever method works here: https:\/\/www.tenforums.com\/tutorials\/2294-advanc...It may be necessary to create bootable media to access Repair Mode or do the Clean install:To create Windows 10 Installation Media on another PC install Media Creation Tool and follow the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, on second screen choose Repair Your Computer, then Advanced Troubleshoot Options, then System Restore. If that fails go back to Troubleshoot Options to try a Reset.If that fails choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, click Next to let it create needed partitions and start install - this makes it foolproof. Everything needed to get the best possible Clean Install is here: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... It is a better install than any amount of money can buy and a great learning experience that will make you the master of your PC because you will learn what works best and how to apply it with your own hands. I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Greg, thanks a lot for your reply.It turns out to be that my SSD, where the system was installed, is not found.Thanks for your help.Happy New Year!","Hi Monica - You can go ahead and test it with the bootable diagnostics I provided or the manufacturer's own tool from their Support site.Or you can replace the SSD and do this gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... To create bootable Windows 10 Installation Media (on another PC if necessary) install Media Creation Tool and follow the directions in the middle of the download page here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key for your PC maker given in this chart:https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, then on second screen choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, select the Unallocated Space, click Next to let it create and format the needed partitions and start install - this makes it foolproof.There is a step to rescue your files first using the booted media if you don't have them backed up:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC because you will learn everything that works best and how to apply it with your own hands.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Can't select HDD to install apps from the Microsoft Store        Hi - I recently purchased a Razer Blade Stealth with a 256GB HD for gaming and a bit of work. I also bought a Samsung SSD T5 external hard drive to store my games because I have limited space on my HD. I purchased Gears of War 5 from the Microsoft store and went to install it but unfortunately, it only will install on my C: drive. In my Settings > Storage > Apps, I chose the external Samsung SSD but when I go to download GOW5 in the Microsoft store it only offers me the C: Drive. Is there any workaround to get it on my external HD instead of my C: Drive? If it is only C: Drive then I will likely not be able to hold more than a single game on my computer because I also have files. I appreciate the help! ","solutions":["Hi SR. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Unfortunately we cannot move the default install location for any apps to an external hard drive. This is because the USB controller is a throttle and could never be as fast as the SATA\/AHCI controller.There is also a speed loss from C drive on an SSD to a HDD to be aware of. A better idea is to keep all apps on the WIndows drive since they write registry keys to Windows which integrate them until they are uninstalled so they should stay on C with the image.What can move without speed loss are User files. A popular way to do this is have a separate data partition where the User folders get moved following this method:http:\/\/www.dummies.com\/computers\/operating-syst...This way if Windows ever becomes irreparable you can restore C in 20 minutes from recovery media, and your files will be current and safe in their own separate partition. If they are left on C they will be dated from when the image was taken.The best free imaging app for saving the backup image externally is here: https:\/\/www.howtogeek.com\/howto\/7363\/macrium-re...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","SSD HDs require special drivers\/software,for Intel based pc MB controllers,follow the link.https:\/\/downloadcenter.intel.com\/product\/35125\/Memory-and-Storagehttps:\/\/downloadcenter.intel.com\/product\/53\/ChipsetsThe 2nd link gets you Chipset software-drivers,by Intel defaults its 1st after the OS installation,2nd is HD storage drivers\/software.Youre pc mfg should have same,however Intel or AMD will have latest.Also,once installed,in run type: diskmgmt.msc  in msc,L.click on a drive,go up to Actions\/All\/Make Active...Also,install Microsoft download mgr","Hi Andrew - I appreciate the prompt response and the help. I went with the Samsung T5 because I could actually use a USB-C connection which means it should have sufficient speed to run the game. The underlying issue is games like Gears of War 5 are over 60GB. With a 256GB HD, its extremely limiting on what games I can play because I would constantly need to delete a game to download a new one. Is there no way I could override it and at least try to run it on my T5? Thanks again for the help!","Andrew, did you try this to store the game on your external: https:\/\/www.windowscentral.com\/how-install-wind...https:\/\/www.groovypost.com\/howto\/make-windows-s...https:\/\/www.windowscentral.com\/how-install-apps...I think this needs to be escalated to Microsoft developers since there is increasing demand for this from gamers who expect it since Steam allows it.If you want to report this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems.If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it. If you are an Insider I can also vote it up with my MVP badge and track the issue for you."]},{"symptom":"about installing windows        I want to delete the current window 10 and I want to install new windows 10 ","solutions":["Hi SUSHANTDEWARKAR Because you have previously had windows 10 installed and activated on that device, you can reinstall windows 10 anytime you wish.to get the best install, with fewest issues, use the media creation tool to create bootable media and clean install windows 10.make sure to get the same edition of windows 10 (home, pro, etc) that you had before.during install, skip the pages that ask for a key, it will activate automatically when you go online.Greg Carmack's article can help in guiding you through a clean install https:\/\/answers.microsoft.com\/en-us\/windows\/for...","I just want to know that when I choose advanced option from (reset this pc )thenwhat am I need to choose after that","from the advanced startup -> troubleshoot when you choose reset this pc you are given a choice Keep my files - this will keep your personal documents, pictures etc but will delete apps and reset windowsDelete everything - this will remove all files, apps and settings leaving windows as if it was just installed.if you choose to delete everything, you are given another choice just remove my files - quickly erases the files, if you are keeping this device, this is sufficient.fully clean the drive - cleans the drive to ensure data cannot be recovered, takes some time"]},{"symptom":"Windows10        Will Sage Simply Accounting Pro 2011 run on Windows 10?","solutions":["Hi BJWQB According to their website, Sage Simply Accounting Pro 2011 is not even tested\/supported on Windows 8, though most users could get that working on that version of Windows, it is doubtful you will get that working on Windows 10, the best place to check this would be on their forum https:\/\/www.sagecity.com\/________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]},{"symptom":"Total identified Windows installations: 0        Please help me.After updating my Microsoft Surface RT to Windows 8.1, it failed to start up again. It will prepair and attempt auto repair, which also keeps failing and will give me: Log file: C:\\windows\\System32\\Logfiles\\Srt\\SrtTrail.txtI tried to recover with the USB, but this doesn't work.After trying to bootrec\/rebuildbcd I find that there are \"Total identified Windows installations: 0\"Also I will get either a Bad system config info blue screen.I really don't know what went wrong, I am just pretty upset that my tablet remains unresponsive.What else is there to do? I live in The Netherlands but bought my tablet in the US. Could this be the problem?***Post moved by the moderator to the appropriate forum category.***","solutions":["Hi,1. First Start System Recovery Options. To start system recovery options.a) Boot from the disk, Once you get the welcome screen of installation with the option “Install now”b) Click on Repair your computerc) On the next page click on Advanced Optionsd) Now click on Troubleshoote) Lastly click on Command prompt and follow the on screen instructions2. At the prompt, type the bootrec command as shown below and then press Enter: bootrec \/rebuildbcd The bootrec command will search for Windows installations not included in the Boot Configuration Data and then ask you if you'd like to add one or more to it.3. You should see the following message.Scanning all disks for Windows installations. Please wait, since this may take a while... Successfully scanned Windows installations.Total identified Windows installations: 0The operation completed successfully.4. Since the BCD store exists and lists a Windows installation, you'll first have to \"remove\" it manually and then try to rebuild it again.At the prompt, execute the bcdedit command as shown and then press Enter:bcdedit \/export c:\\bcdbackupThe bcdedit command is used here to export the BCD store as a file: bcdbackup. There's no need to specify a file extension.The command should return the following on screen:The operation completed successfully.Meaning the BCD export worked as expected.5. At this point, you need to adjust several file attributes for the BCD store so you can manipulate it.At the prompt, execute the attrib command exactly like this:attrib c:\\boot\\bcd -h -r -sWhat you just did with the attrib command was remove the hidden, read-only, and system attributes from the filebcd. Those attributes restricted the actions you could take on the file. Now that they're gone, you can manipulate the file more freely - specifically, rename it.6. To rename the BCD store, execute the ren command as shown:ren c:\\boot\\bcd bcd.oldNow that the BCD store is renamed, you should now be able to successfully rebuild it, as you tried to do in Step 2.Note: You could delete the BCD file entirely since you're about to create a new one. However, renaming the existing BCD accomplishes the same thing since it's now unavailable to Windows, plus provides you yet another layer of backup, in addition to the export you did in Step 5, if you decide to undo your actions.7. Try rebuilding the BCD again by executing the following, followed by Enter:bootrec \/rebuildbcdwhich should produce this in the Command Prompt window:Scanning all disks for Windows installations. Please wait, since this may take a while... Successfully scanned Windows installations.Total identified Windows installations: 1[1]  D:\\WindowsAdd installation to boot list? Yes<Y>\/No<N>\/All<A>:meaning that the BCD store rebuild is progressing as expected.8. At the Add installation to boot list? question, type Enter Y orYes, followed by the Enter key.You should see this on screen:The operation completed successfully.meaning that the BCD rebuild is complete.9. Restart your computer.Assuming that an issue with the BCD store was the only problem, Windows should start as expected.If not, continue to troubleshoot whatever specific issue you're seeing that's preventing Windows from booting normally.Important: Depending on how you started System Recovery Options, you may need to remove a disc or flash drive before restarting.","Hi Sandor,To undo the step 5 provided by Vijay B, replace the -h -r -s  to  +h +r +sin the Command Prompt.Please let us know how it goes for us to assist you further."]},{"symptom":"windows re-activation after hardware change.             Hello, I recently upgraded my motherboard and cpu. I made sure to link my windows digital license to my microsoft account before I did this. I ran the troubleshooter and it was unable to reactivate windows. Is there anything I can do?","solutions":["As Windows 10 activation is registered against the device (motherboard) when you change it then the hardware needs to be registered again.Have you ran the update Troubleshooter and what does it report back.Whether you can activate without buying a new licence depends on the type of windows licence you have, OEM or retail.OEM (supplied by the manufacturer of the device cannot be transferred)Retail has transfer rights, if you have a licence key then enter it in Settings > Update and security select Activation and Change product key.To verify you current licence state type slmgr \/dlv in a PowerShell and press return. Please post a screenshot of the result.Do yo know the history of your windows licence.","Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,First, you'd need to identify if the product key for the windows 10 computer is either a retail or an OEM key.Normally OEM keys are solely embedded to one motherboard as they do not have transfer rights for other hardware, unlike retail keys which has transfer rights.For free upgrade licenses, the condition for these are relevant to an OEM key as the license is then considered a digital license once you upgraded free to windows 10.Under this link are reference to activation after hardware change https:\/\/support.microsoft.com\/en-ph\/help\/20530\/...For your windows 10 license, I'd recommend running the activation troubleshooter. Go to Settings>Update and security>Activation and run the troubleshooter. and select I recently changed hardware on this device.If the troubleshooter hasn't helped, you would have to call Microsoft during support hours to get more help.https:\/\/support.microsoft.com\/en-in\/help\/405170...Let me know how it goes. :)"]},{"symptom":"How to reset Windows 10 Pro Links        I uninstalled OneDrive; however, I cannot link my \"OS (C:) > Users > billy > Documents\" to \"This PC > Documents\".See the following Screen Print for the message received on attempt to perform a link:Please provide step-by-step procedures to correct my problem.Thank you for assistance.","solutions":["Hi Billy, You might want to check this article: https:\/\/www.thewindowsclub.com\/desktop-location...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"Account number        My computer is locked up how do i fine my administrator pass word. Or can i call someone.","solutions":["Hi Ronnie it depends on what type of login you use . . . If you log into Windows with a Microsoft Account: https:\/\/support.microsoft.com\/en-us\/help\/402697...If you log into Windows with a Local Account: https:\/\/support.microsoft.com\/en-us\/help\/402845...Hopefully one of those methods will get you into your PC . . ."]},{"symptom":"Slow windows store downloads        I need serious help.I have been downloading sea of theives on my pc for 2 DAYS.all of my microsoft store downloads are so slow and i need help.I have tried every way to fix it and i have talked with 17 microsoft community members and helpers to try to fix this but nothing works. No it is not my pc, i have 4 windows 10 devices and they all have slow downloads. No it is not my internet, i just downloaded destiny 2 on steam to test and it downloaded in 30mins and destiny 2 is a 120gb game and sea of theives is only 44gb but it has been downloading for 2 days. Its not on my side its on microsofts and i just spent $50 on xbox game pass on my pc for 3months with a voucher code and i cant play games because by the time my games load the 3 months will be over. i have download the games on the xbox beta application and microsoft store and they both are so slow. My steam downloads can download at 150Mbps but my xbox beta and microsoft store download at on 100Kbps which is like 100x slower. I need serious help because im mad i just spent $50 and cant use it. I have the latest windows updates, latest xbox beta, i have tried all the things such as wsrest, ipcofig, flushdns, and so much more weird programs and administrator programs ect and nothing works plz help me plz.","solutions":["Hey Josh. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything possible to repair the store. Even if you've tried a step please do it over in this sequence. If any steps cannot be performed then report it and move on to the next:1) Try updating Store apps: https:\/\/support.microsoft.com\/en-us\/help\/402625... 2) Make sure you have the latest Windows 10 version 1909 in Settings > System > About and if not skip to Step 10 to install it by the most stable method.3) See if the fixes here help: https:\/\/www.pcworld.com\/article\/3053099\/windows... 4) Try running the Windows Store apps Troubleshooter at Settings > Update & Security > Troubleshoot.5) Try resetting the Store cache: http:\/\/www.thewindowsclub.com\/reset-windows-sto... 6) If that fails go to Settings>Apps and highlight Microsoft Store, choose Advanced Settings, then Reset. After it resets, restart PC.7) If that fails then reinstall Store. Type CMD in Start Search, right click Command Prompt result to Run as Administrator, copy the following code and paste it into the box using the Edit tools from Box's top left dropdown menu, press Enter:PowerShell -ExecutionPolicy Unrestricted -Command \"& {$manifest = (Get-AppxPackage *WindowsStore*).InstallLocation + '\\AppxManifest.xml' ; Add-AppxPackage -DisableDevelopmentMode -Register $manifest}\"8) Clear the LocalCache Folder: Open Run by pressing the Windows key + R hotkey. Copy and paste %localappdata% in Run and click OK. Open Packages> Microsoft.WindowsStore_8wekyb3d8bbwe > LocalCache folder. Press the Ctrl + A hotkey to select all content within the LocalCache folder. Press the Delete button. 9) If these all fail then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account because of the serious and persistent problem with corrupted accounts. Then continue with the other steps to go over your install most thoroughly.10) If nothing else works then do a Repair Install, by installing Media Creation Tool and then choosing to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... 11) You said you'd tried most network repair steps but one thing that's working for many is to try a wireless nano 5ghz USB adapter to compare, like this one's good:https:\/\/www.amazon.com\/OURLiNK-600Mbps-Wireless... which is plug n play and will tell you a lot quickly.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hello thanks for this but nothing worked. I did everything on the list 2-3 times and still nothing works i even reseted my pc and still didnt work. I already have that usb wifi adapter as i was recomened to buy it from another microsoft helper. Nothing works ","Hello thanks for this but nothing worked. I did everything on the list 2-3 times and still nothing works i even reseted my pc and still didnt work. I already have that usb wifi adapter as i was recomened to buy it from another microsoft helper. Nothing works ","Hello anyone there","Hi Josh. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything that works to fix Wifi so that at least something will work. Even if you've already tried a step please try or check it again in sequence. If you need any assistance I'll be standing by here to help:Update your network adapter drivers from the PC maker's Support Downloads web page using the full model number, HP Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.If you have the latest network driver then try on it's Driver tab also to Roll Back, or Uninstall and then restart PC to reinstall the driver. Try also all older drivers from Update Driver > Browse > Let Me Pick list working backwards.Go to Device Manager > Network Adapters, select Wifi adapter, then Power Management tab, clear the check box to \"Allow the computer to turn off the device to save energy.\" Then on the Advanced tab disable any energy-saving options.If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool explained here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them.If this was caused by Version update then you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool.Enable IPv6 in the network adapter settings: https:\/\/www.tenforums.com\/tutorials\/90033-enabl...Run the fixit from https:\/\/support.microsoft.com\/help\/929852 (Re-enable IPv6 on all nontunnel interfaces) and reboot.Right click the network icon in System Tray at bottom right end of task bar to Troubleshoot Problems.Try all of these steps: https:\/\/support.microsoft.com\/tr-tr\/help\/10741\/... https:\/\/www.kapilarya.com\/how-to-reset-network-...Go to Settings > Network & Internet > WIfi > Manage Known Networks, highlight and remove the network having problems, restart PC to see if it shows up again.Try plugging in by ethernet cable to the router to compare, then plug the ethernet cable into the modem (if separate) to see if this might be an issue with the router.Try powering off modem, router and PC and then restarting in that order with 1 minute in between each. You may need to reset your router or even optimize it following these steps:https:\/\/www.lifewire.com\/resetting-a-home-netwo...https:\/\/www.pcmag.com\/article\/258865\/how-to-set...Your router manual is always available from the manufacturer's website for your exact model.You also are entitled to Support from your internet provider to get online on all devices. This is always included in the monthly bill. If your router is less than a year old they will also Support getting it connected and optimized.Another option is you could replace the wireless adapter with an inexpensive USB nano adapter like this one:https:\/\/www.amazon.com\/OURLiNK-600Mbps-Wireless...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Nields and Supercomputing on my computer playing ads in the background        Can anyone help me delete this thing i keep hearing videos and music playing in the background. It is really annoying. when i press alt+tab i see a red yellow blue square but i can't open it, it just play ads every time","solutions":["Do you have any Anti-Malware software installed?Open start and search for Windows Defender and open it and run a full system scan with it.","Hi Lance 1 First we need to take that off your Startup processes . . . Task Manager and indeed Msconfig offer only limited control over Startup items . . .Click the link below to download a small free utility that does not require installationhttps:\/\/docs.microsoft.com\/en-us\/sysinternals\/d...When the file downloads, unzip it. Depending on your system, run Autoruns or Autoruns64 as Administrator In the search box, individually search for Nields and Supercomputing, then right click any entries found and choose to delete those2 You should run a full scan with the free version of MalwareBytes . . . https:\/\/www.malwarebytes.com\/________________________________________________________ Standard Disclaimer This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. ."]},{"symptom":"What Happened?        This morning I went to copy the contents of my Saved Folders from my computer to my external hard drive for long-term storage. Up until this morning, my Downloads Folder's contents was arranged like this (a screenshot from my External Hard Drive):This morning, however, my Downloads File Folder contents look like this:As far as I know, I didn't do anything to cause this.How do I return the Downloads Folder on my computer (the second image, above) to what it used to look like (the first image)?  The subdivisions make it infinitely more difficult for me to transfer the files to my hard drive.","solutions":["That changed with version 1903 (I think) in File Explorer select Downloads and then select View and Group by, select None. Does that get it back how you like it.","Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.This ‘Group by’ option isn’t new in Windows 10 1903. It has been a part of Windows for ages. The only bug here is that Windows 10 decided to enable it for the Downloads folder on its own. Before that, the files in the folder had no sorting and it is possible some users never even knew it existed. You may have seen the ‘Group by’ option but not paid attention to it or used it. It can group by more than just time and you might find the other options in the sub-menu to be useful.Although I find it very practical to know the day that I download software, you can deactivate it simply like this:Right click in the empty area Click \" group by \" And select \" none \" It is classified like that because it is checked by date :) If the problem is resolved, have a great and happy new year!"]},{"symptom":"Mailing list groups in Windows 10 Mail        I recently upgraded to Windows 10. I had been using Hotmail\/outlook.com for my email. After the upgrade, I found my contacts but all of my mailing lists were gone. I checked the People app, but there was nothing there to help me create groups.Is there a way to recover or create mailing lists now that I have upgraded?________________________________________Volunteer Moderator Comment:Please see the marked Answers below for a workaround and also Feedback posted by a MS engineer to the Feedback hub which you can click on to Upvote and add your comments of support. In order to get this needed feature added we need to create momentum and you can help in this way!  But Microsoft will not even see this here because it is mostly staffed by volunteers who give our time to help others. ","solutions":["There is NO option to create groups but there is a work around, using the Mail and People app together.To create the group:  In Mail, create New Mail, open the cc\/bcc field and insert all the addresses for the particular group.When completed (with the mouse pointer at the end), right click and select 'select all'.  For some reason you can't right click and select copy but you can copy with ctrl+c. Now, open the People app, create new contact, give the group a name and paste the copied names into an email field, I use the 'Other' option and click the SAVE button.To use the group: Mail app - New mail, click bcc field or whatever, open the People app, snap it left or right, find your group name, click on it, on the right hand side you will see all your group addresses, right click and copy, go back to mail, right click and paste.I don't know the limitations of this (and there probably is).  None of my groups have more than 10 names in them.","Hi everyone,               I am a Microsoft support engineer and I want to gather more feedback from you in regards to the issue that users cannot send emails to multiple contacts in People App, so I can drive a feature request with Windows engineering group.                I have submitted a Feedback Hub post with the issue description here:https:\/\/aka.ms\/AA21cea.                If you couldupvote the issue and leave a detailed comment about your frustration with the absence of this feature, that would help me make a strong business case for the request.               Thank you very much and please comment below if you have any more questions!"]},{"symptom":"Turn colors from grayscale?        How do I change my windows 10 screen from grayscale to color in settings?","solutions":["HiMy name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help answer your question.Hope this helps.Jon. HiMy name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.The simplest way to go from grayscale to full color mode is to hit CTRL + Windows Key + C, which should work right away. ...Type \"color filter\" into the Windows search box.Click \"Turn color filters on or off.\"Toggle \"Turn on color filters\" to On.Pick a filter.orTo use a color filter:Select Start > Settings > Ease of Access > Color filters.Switch on the toggle under Turn on color filters.Then, select a color filter from the menu. Try each filter to see which one suits you best.Note: To get to color filter settings in previous versions of Windows 10, select Start > Settings > Ease of Access > Color & high contrast.Hope this helps.","Hello Tom,The tutorial below can show you how to turn on color filters, choose a filter, and turn off color filters in Windows 10.https:\/\/www.tenforums.com\/tutorials\/86376-turn-off-color-filters-screen-windows-10-a.html"]},{"symptom":"autofill email address        How do I get Windows 10 to autofill my email address?","solutions":["How do I get Windows 10 to autofill my email address?Windows 10 is an operating system, not an E-Mail application.You need to tell the forum which E-Mail application you are thinking of.","Hi CarlasueMy name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help answer your question.What application are you trying to save your email address to auto fill? Edge?Hope this helps.","yes    Windows 10.  Just got a new computer and every site I go into I have to type in my email address.  On Windows 7 I typed a \"c\" and the rest automatically filled in.,","Until you have used Edge for a while and selected an option for the browser to remember your info (when prompted) you will have to input all your info.","Thanks for your reply. I will assume you are using the Microsoft Edge browser.In Microsoft Edge , select Settings and more > Settings > Passwords & autofill.Turn Save passwords to On.","Can you also confirm the version and build you have on this new device. Type winver in Search and select the top result, post a screenshot or quote the full version and build numbers."]},{"symptom":"What happened to simple way to delete items in Favorites Bar        Why can't you simply right click an item in favorites bar to delete it like you used to.  There is no delete button anymore. Every update just makes things more complicated  ","solutions":["No one can guess what web browser you're using. Right-click > Delete works for me in the Bookmarks bar of Google Chrome and the Favorites bar of Microsoft Edge."]},{"symptom":"Mouse without Borders encryption keys         Gentlemen:       We love the mouse without borders and would like to use it in our control room environment.  However, since different shift users are going to use the same control room computer.  Is there a way to hard code an encryption key for a pair of machines for all users that log into that machine?  [Moderator Edit: Moved to Windows]","solutions":["I too have the same question"]},{"symptom":"Windows 10 extremely slow after updating to 1909        I have been using a PC with 800 M Hz AMD Phennom II processor and 8 GB RAM running 64-bit Windows 10 for several years. It has been running great until recently it became extremely slow after Windows update since November.  I noticed that the CPU and Memory usage changed from about 50% to close to 100%. The performance resumed after I restored the system to the earlier version. Today was the 3rd time I did this and I checked the current stable version is 1903, so I guess the problem was caused by the new update 1909. I am afraid it will become slow again after the automatic update. Please advise if there is a way to allow me continue to use this computer. Thanks!","solutions":["If you already done some updates and pc slowed down,then you need to delete most of the .net framework updates.Since there's something wrong with your Windows 10 after an update. Another good option is touninstall Windows 10 update and go back to the previous version. If you're having problems with your PC, there arerecovery options to use as well.","hi there:1903 is like 1909. So, 1909 didn't cause your issue. I have been using 1909 since it came out and found no issues like yours. Did you have SSD for your device? If not, that is one reason why your Windows 10 is slow. You can install SSD and try it out. Maybe the processor is causing the issue too. Slow processor.","Hi, Thank you for writing to Microsoft Community Forums. We understand your concern, as the PC became slow after the PC upgraded to Windows 10 1909. We appreciate your effort in providing us the detailed information on the issue. Meanwhile, put the PC in Clean Boot and see if you still have the performance issue. Refer the articleHow to perform a clean boot in Windows. A ‘clean boot’ starts Windows with a minimal set of drivers and startup programs. If the lag in performance does not reoccur in Clean Boot then please refer the sectionHow to determine what is causing the problem after you do a clean bootto determine the root cause of the issue. Note: After you finish troubleshooting, follow the sectionReset the computer to start normally after clean boot troubleshooting to reset the computer to start normally. Let us know how it goes. Aditya RoyMicrosoft Community – Moderator","hi there:1903 is like 1909. So, 1909 didn't cause your issue. I have been using 1909 since it came out and found no issues like yours. Did you have SSD for your device? If not, that is one reason why your Windows 10 is slow. You can install SSD and try it out. Maybe the processor is causing the issue too. Slow processor.Thanks for your reply. The PC has an SSD and a HHD for several years. The processor is slow but it has been running well enough for my needs until recent updates. ","If you already done some updates and pc slowed down,then you need to delete most of the .net framework updates.Since there's something wrong with your Windows 10 after an update. Another good option is touninstall Windows 10 update and go back to the previous version. If you're having problems with your PC, there arerecovery options to use as well.I have been using \"System Restore\" to go back to previous version\/setting when it slowed down. I will try uninstall the update if it happens again to see if it helps. Thanks!","Hi,Thank you for writing to Microsoft Community Forums.We understand your concern, as the PC became slow after the PC upgraded to Windows 10 1909. We appreciate your effort in providing us the detailed information on the issue.Meanwhile, put the PC in Clean Boot and see if you still have the performance issue. Refer the articleHow to perform a clean boot in Windows. A ‘clean boot’ starts Windows with a minimal set of drivers and startup programs. If the lag in performance does not reoccur in Clean Boot then please refer the sectionHow to determine what is causing the problem after you do a clean bootto determine the root cause of the issue.Note: After you finish troubleshooting, follow the sectionReset the computer to start normally after clean boot troubleshooting to reset the computer to start normally.Let us know how it goes.Aditya RoyMicrosoft Community – ModeratorThanks for your detailed information. I tried block some programs at the Startup tag of Task Manager but it didn't help. I think the problem was \"memory leak\" caused by recent update. I will try a Clean Boot to further diagnose the problem. ","It is obvious from the number of reports that there are major problems going from 1903 to 1909.My Dell Inspiron running 64-bit Core i5 at 1.8 GHz with 8 GB ram became unusable. It seems the suggested solution is for all the users to do the debugging to discover where the problem exists.Horrible quality control and testing on Microsofts part.  I will stay with 1903 until those losers in Redmond produce a decent product.    ...or may Ubuntu Linux is a better answer"]},{"symptom":"turbo c++ programming application issue        turbo c++ programming application doesn't work properly..... ","solutions":["It appears that you downloaded a compressed package that was supposed to include an installer for \"Turbo++ 3.2\" and that either the download was corrupted or your attempt to extract the contents of the package did not work correctly.Turbo C++ is a discontinued product, but if you really want to use it, perhaps you should check out Embarcadero: https:\/\/www.embarcadero.com\/I really can't recommend any of the third-party web sites that purport to have Turbo C++ 3.2 for download, but if you're determined to get it, try one of these: https:\/\/www.google.com\/search?q=turbo+C%2B%2B+3.2I suggest that whatever download you select, you upload it to VirusTotal before attempting to execute it. https:\/\/www.virustotal.com\/gui\/home\/upload"]}]}