{"windows":[{"symptom":"edge favorites won't sync with my other devices        my edge favorites will not sync with office 360 to my other devices. I get this message when try to set \"Sync is not available for your account. Contact your system administrator to resolve this\"  I believe that my 2 \"work school email accounts are causing part of the problem.","solutions":["Hi busboy, You might want to check this article in order for you to sync your Edge favorites:https:\/\/www.groovypost.com\/howto\/fix-edge-favor...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"Possible security or app conflicts        My Dell XPS 15 laptop win 10 refuses to let me login to my credit card account and to print a calendar of activities from a service provider and I think this is due to some conflict or security protection as I can perform both operations with an older win 7 laptop.  Can you suggest what I might look for to correct these anomalies?","solutions":["Hi Chris, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.May I know the browser you are using right now to login to the card account and the one you used in Windows 7?","Thank you, Sumit, for your response.  I hope you can help.  The browser I use in my Dell XPS 15 9570 win 10 is MS Edge while the browser I use with the Sony VAIO win 7 is Google Chrome.Kind regards,Chris."]},{"symptom":"Guest User Restriction        Hello.I want to restrict access to a drive by a local user account. With my admin account I did Properties > Security > Remove all access for that user account. And when I switch to the other account it just shows NTFS drive and inaccessible.But within that account when I did Properties > Security > Gave myself all permissions it removed the restriction. Note : No admin password was asked. My admin account was signed out.How is this possible ?Thank You","solutions":["Hi CriticalHunter, I'm Charles, an Independent advisor trying to help. Please, check the indications of this link that is used and shared by Windows MVP, it is the way to set up a guest account in Windows 10.https:\/\/www.howtogeek.com\/280527\/how-to-create-...I hope the steps work for you Attentive to any comments Have a happy day Best Regards, Charles. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hello. The problem was not to create a Guest user account. Yet I created an account by the steps mentioned in that guide. Problem is how the guest\/visitor user is able to revoke the restrictions that were put by the administrator account.I removed all access to the drive for that particular guest user from my admin account. I switch to guest user and its locked. But then without any authentication I am able to change the security settings.Should this happen? Then how to restrict access to folder\/drives for other users?","Hi, I understand, let me do the tests to verify it, if I find the steps I will notify you immediately, otherwise I will release the question for another advisor to support you in the requirement. Have a nice dayRegards","Hello, Waiting for a reply. Is the issue looked at or fixed? Need help. Thank You"]},{"symptom":"horizontal dashed line in windows 10 network status!        I have the same problem as others but I coudn't find any working solutions in the one proposed by the helpdesk.So I  don't have anymore a wifi or network icon.  and when I go the my network I have this : When I go to my network adapters, I've tried to deactivate\/activate wifi, réinstall drivers, restart... it stays activate but with no network.Weird thing : if I use \"Speccy\" a program from piriform, He finds the card and the wifi networks. If I deactivate my card, i doesnt...So for me. It's not an hardware problem (the green leds on the wifi card are on) and it's not a router problem : my other computer\/smartphones have no problem.What can I do?","solutions":["Hi Gregory and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by Windows MVP, so it is safe.https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Dear Joseph. Thanks for help but I seems the link doens't describe the same problem as me...I've created a new user. same problem. Notice that I have that view of my network with a cable connection active. I've also tried to disconnect the cable, it doenst change anything... except that I don't have any internet since no wifi is working. ","Hello Gregory. I am Andrew. Are you able to plug the computer in to the router with a cable? We need to check the Windows system files which works best with an internet connection as it downloads new system files.Plug in the computer if you can and follow these steps. In the search bar, type cmd. Right-click on cmd.exe and select Run as Administrator. Type SFC \/scannow and press the Enter key. Re-enter Command Prompt as Administrator and run these: dism.exe \/online \/cleanup-image \/startcomponentcleanup dism.exe \/online \/cleanup-image \/scanhealth dism.exe \/online \/cleanup-image \/restorehealth Come back to use when you've done these. Take care, Andrew"]},{"symptom":"Adding an AV Receiver to my 'All-Wired' Network        Really struggling with this.How do I make my network 'see' the receiver that is connected(wired) to it please??","solutions":["How is it connected? Is it to your Router? Does it show on your router as part of the Network? The more details you provide the easier it will be to help you.","Solved. Please close. My 'BAG' as they say!!","For cables are they CAT 5 or 6?  How long are they? What type of Router and what are the LEDs doing at the connections? ","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please check if there is any driver for this particular model of the AV Receiver.If there is, please install the same.","For cables are they CAT 5 or 6?  How long are they? What type of Router and what are the LEDs doing at the connections? Please see #3Thankyou....but solved!","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please check if there is any driver for this particular model of the AV Receiver.If there is, please install the same. Please see #3Thankyou....but solved!","Good, glad you got it working."]},{"symptom":"Multi-monitor mouse corner boundary        On a multi-monitor setup, there is a small area in the corners that the mouse is not allowed to move past. The below figure shows the areas for a two monitor setup where the mouse is not allowed to pass.This feature makes you 'lose track' of where your mouse is when moving between monitors: as for your feeling it should be on a target monitor while it remains stuck on the origin monitor. This is a nuisance for many users, evidenced by the large number of topics\/posts on various websites (1,2, 3, etc). Is there a way to disable this feature and\/or a work-around?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. This is happening because the monitors have different resolutions. Please go to the Display Settings. Make sure both monitors have save resolution settings.If there is a mismatch of resolution between the two monitors, please change one of the monitor's resolution and make them same.Click on Monitor 1 and check the resolution. Click on Monitor 2 and check the same. Now make sure same resolution is set for both."]},{"symptom":"Realtek audio control & dts headphone X:V1, error        Hello there, anyone can please help me regarding my realtek audio control & dts headphone X V1 Initially both were working too good, my laptop is asus tuf gaming FX505GD, But recently after installing ssd and new Windows 10 Home installed, anyone of them is giving trouble,Can anyone please help me out! ","solutions":["Hello LuckyTILAK, I am Andrew an independent advisor. When you reinstalled Windows 10 on your new hard drive did you allow Windows to install all drivers, or did you update them via the vendor? Its best to use vendor supplied drivers. I suggest going to the laptop manufacturer web site and download latest drivers for all your hardware.If this does not solve the issue please let us know, we can further troubleshoot.Take Care, Andrew","Yes, Andrew I have allowed windows to install all drivers & I have also used the vendor supplied drivers. In fact i have visited the manufacturer site and installed my device drivers too... Still im facing the problem!? ","Does your headphones come with any kind of software suite? Are they wireless?","No they are wired only ","If you can, take another pair of headphones and plug them in to the same output. This will eliminate the headphones themselves as the issue.","Ok lemme try and ping you up. ","How did the new set of headphones work out?","Sorry for late reply, but it didn't work out.... Actually the problem is with dts application and drivers... Its not setting up as default... Any fix? ","To set as default right click the audio icon in the task bar, click properties. In this menu you can select default output with the headphones plugged in."]},{"symptom":"touchpad.        For the past 3 weeks. I've been unable to drag and drop, right click and select text outside Microsoft Word. I've tried almost all solutions that I could find on the Internet that didn't involve resetting my PC, Unfortunately I can't still fix it, I even signed up for Windows 10 insider program hoping to get an update that would fix it but it is still not fixed. I use a Dell inspiron 7560 laptop, The problem started with the December update on windows 1903, but still exist on windows 1909.","solutions":["Hello emmanuelkiprono, I am Andrew an independent advisor. Since it's been more than 10 days we can't roll back the update, so lets uninstall the touchpad and reinstall using vendor drivers, you'll need a mouse for this.First go to Dells website and download the appropriate driver for your touchpad. It may come in a .exe file. After that is downloaded, right click your start menu and open the Device Manager.In the device manager find the TouchPad. It will probably have the Synaptics Device installed. Expand the menu, double click the device, click the Driver tab and uninstall.Reboot the computer. When it boots back up it will say a new hardware has been found. You want to choose to find the driver yourself, navigate to the folder you just downloaded and install the driver in there, provided it's not an exe file. If it is a exe, select to search for best drivers to install. Once complete run the exe file you downloaded, it should replace the Windows installed drivers.That's all to it. Let me know how your touchpad works when all is done. Take Care","Thanks Andrewunfortunately, that didn't work I also tried it today it didn't work...","Ok with the driver issue taken care of lets check Windows system files. It could potentially be a hardware issue as well. To check the Windows software follow these steps.In the search bar, type cmd. Right-click on cmd.exe and select Run as Administrator. Type SFC \/scannow and press the Enter key. Re-enter Command Prompt as Administrator and run these: dism.exe \/online \/cleanup-image \/startcomponentcleanup dism.exe \/online \/cleanup-image \/scanhealth dism.exe \/online \/cleanup-image \/restorehealth"]},{"symptom":"choose manually windows 10 updates        I want to choose manually windows 10 updates just as before with windows 7","solutions":["I want to choose manually windows 10 updates just as before with windows 7Windows 10 is not Windows 7. You owe it to yourself to learn the differences.","Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.That isn't possible in Windows 10 but you can disable driver updates via Windows update by following the steps in this article:https:\/\/support.microsoft.com\/en-us\/help\/307393...Regards, Ross","The only manual option for Windows Updates is to click on Check For Updates at a time that suits you,but before Windows Updates starts downloading an update automatically. The new WU option to Pause Updates for7 Days is helpful for people wanting to update a time that suits them as well.This does not allow you to 'pick and choose' which updates you want to install though.The Win10 mandatory updates regime has been well advertised, and now that MS have moved away from the very largebi-annual version updates they are not as big an issue as they were prior to v1909..","BossDweeb makes a good point:As Windows 10 matures, Microsoft has announced that the semi-annual version updates will get smaller. This will make them easier to install."]},{"symptom":"photos from samsung 6 to windows 10..problems        I have done this before but there is no sign of the phone being recognised on the computer.   I don't have an original cable.  I have 3 I have tried.  'when I put them in the phone is getting charged.   In developer options I have the MTP selected under USB configuration.  should I have the USB debugger on?  any ideas from the Samsung or computer side.  I did try to get the photos onto another computer and this didn't work either.  Would that mean it is the phone\/cable?","solutions":["Hi Kate Setting USB as MTP might indicate you are running an older version of Android Connect your phone to your PC, do you not get a popup asking how you want USB to be set (Charging, File Transfer . . .etc), if not what version of Android is installed on your Phone?On your Phone, swipe down from the top, do you see that USB connection setting there?If setting USB to MTP or setting USB to file transfer does not connect your phone, it may well be that the cable is at fault, try getting a lend of another cable to see if that allows WIndows to see your phone . . ."]},{"symptom":"Logging in as administrator        I am trying to instal LibreOffice free office suite on my Windows 10 laptop. When it comes to installing, a message pops up when new files start to be installed which asks me to log in as administrator. I am the only person who uses the laptop and I enter my password each time I start up. I have failed to get anywhere via settings because no accounts appear except, probably the hotmail account that I have used to set everything up. This account does not appear as an entity in settings so that I can select it and make it Administrator. Please assist!","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. 1. Open Settings using Win + I key, and then go to Accounts > Your info. 2. Now you can see your current signed-in user account. If you are using an administrator account, you can see an \"Administrator\" word under your user name.Please let me know if it shows Administrator or Standard."]},{"symptom":"How to restore default display settings in Windows 10        The upgrade to Windows 10 has made it very difficult for me to see things on my laptop.  Everything got teeny tiny, for one thing.  I had it set up before to accommodate my visual needs, and tried to replicate what I had before the upgrade with larger fonts and so forth .... but when I went down the rabbit hole of changing the color scheme, many pages do not display the way they should.  Nothing like trying to guess where to enter text for a search, or a black-on-black drop-down menu. I simply want to restore the default display settings, so I can start over, but all search results only address previous versions of Windows.  Even this forum insists the answer is already here. It is not.  I already know how to change colors.  That's what got me in trouble in the first place.   I do not want to completely reset everything with a system restore.  I just want to restore the default display. Longing for the simpler times when MS provided a nice range of displays in various palettes to pick from.","solutions":["Hi,Thank you for contacting Microsoft Community.I understand the inconvenience caused to you. We will help you to resolve the issue.I suggest you to follow the below steps to change the settings and check if it helps.Step 1: To check the text and font size follow the below steps.1.       Go to settings.2.       Click on “system”, under the display option click on “advanced display settings”.3.       Then click on “advanced sizing of text and items” and check whether the text and font size settings.Step 2:  To check the color contrast follow the below steps and check.1.       Press “Windows+X” and go to “control panel”.2.       Click on “Ease of access center” and click on “Choose high contrast theme”.3.       Under “High contrast themes” check whether any option is selected, if selected then I suggest you toselect any option under “Windows Default themes”.Hope this information is helpful and do let us know if you need further assistance. We will be glad to assist."]},{"symptom":"Using a keyboard to click.        I have an HP Envy Laptop.  Clicking on the touchpad is not working.  I can move the mouse with the touchpad.  My computer repair shop says it is a hardware problem and they will need the laptop for at least 6 weeks as they will have to open the computer, and then order the correct keyboard.  I cannot afford to be computerless for that length of time.  I feel that there should be an ease of access setting which would allow me to use the keyboard to \"click\" but I can't find one.  My operating system is Win 10.","solutions":["Hi NatalieWhen you say you cannot click with your touch pad do you mean the physical button does not work?If so, if you just tap with a finger on the touch pad, does that result in a click?If not, what is the Make and exact Model No. of your laptop, that will be printed on a sticker on the bottom underneath casing...","Hi Dave,The model is HP Envy 17-ae007na.It has an awful minimalist (eg no right Ctrl key) keyboard.The touchpad doesn't have any premarked areas, but when new, a tap in the bottom right corner activated a right click and a tap anywhere else activated a left click.  tapping anywhere stopped doing anything.  My computer literate son-in-law checked drivers and settings but they all looked OK.  I have never used any other gestures on the laptop.","Natalie, if this is a hardware issue, you have to repair it eventually. However, if you are asking for a workaround, you can always use the Enter key for left click and Fn+Right Ctrl keys for right click.However, I would suggest you to kindly download and install the following driver and check.https:\/\/ftp.hp.com\/pub\/softpaq\/sp81501-82000\/sp...","ArifAhmed, Enter does not work in many cases.  For example in Facebook when the mouse is positioned over notifications; in iplayer when the pointer is over the \"remove program\" x.  And this expensive laptop doesn't have a right control.   That is why I am hoping that there is an accessibility hack.  A six-week computerless stretch will have to wait till I am on a long vacation somewhere remote.  Even while writing this reply I am frustrated because the navigation keys are not taking me down to the submit button","ArifAhmed2 I get the message that I already have a later version of the driver installed.  Are you suggesting that I go back to an earlier driver?","Yes, please install this earlier version of the driver and check.I would like to inform you that there is a virtual keyboard but there is no such virtual mouse.Pardon me if this sounds invasive suggestion, but there are various cheap USB wired mouse available in the market. Will it be possible to get one of those? Because, if there is a hardware issue, I am not sure if there is any settings for virtual mouse.TouchScreen PCs have this option though, but this one is not a TouchScreen device.","Hi ArifAhmed2,I will try the earlier driver, but am not hopeful.  I have used keyboards with a right-click key.  In fact I felt rather foolish that I had obviously been using such a keyboard for years without wondering what that key with a chequered board logo actually did.  I only made the discovery when I was showing someone how to Google for keyboard shortcuts.In view of the difficulty some people have in controlling a mouse, I had hoped that Microsoft as part of their accessibility aims would have made a mouse optional.I obviously use an external mouse on this laptop, but I also record screen captures.  If I am not paying attention the mouse sometimes appears to move into the capture area and so I tend to unplug it.  Although I don't like using a trackpad it is sometimes useful.Thanks for your suggestion.","Hi, Try to install the earlier driver and Let's see."]},{"symptom":"The \"Location\" tab in region setting in control panel is GONE        I can't seem to find the solution for this anywhere, hoping someone who has the same issue can help me out here. So I have a game that require Japan locale, so I went to region setting in control panel but the \"location\" tab wasn't there. Then I try change it through \"country or region\" in windows app setting but the game still won't launch. Anyone has any ideal on why the \"location\" tab is missing ? If anyone know please help me out","solutions":["Hi Nguyen All location settings were moved form the old Control Panel to the new Settings App in a previous version of WIndows 10 . . .Open the Settings App (gear icon on your Start Menu) Go to Time and Language - Region That is one of the Settings Then in the Settings App, go to Privacy - Location and make sure Location is turned onWhat game are you referring to and what is the exact error you are seeing?","Thank you for the reply Dave.The game I referring to is a visual novel with siglus engine, don't know if you knows about it. When i try to launch the game it popup a warning saying \"this game is japan only\"I used to be able to play it on windows 7 when I change my computer location to Japan","Hi Nguyen If that game expects a Japan location and you are not in Japan, then you need to turn off location services in the Privacy section of Settings and in the other part, set your current location to Japan, also there may be an issue if that is reading your IP address, though if you were able to run that on Windows 7 the IP address should not be an issue . ..","I have tried everything but it still not working. I tried turn off location service like you said, change date format, change system locale, using VPN Gate to change my IP address, still the same. Well, no game for me then, thank you for the support"]},{"symptom":"WINDOWS AND OFFICE FOR SMALL BUSINESS        Hi,I need WINDOWS & OFFICE for small business where 5 to 10 computers would be connected to a server Or just one main computer. Can someone recommend an economical windows and office package for say 10 systems?And also, how and where to purchase package?Thanks, ","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please refer to the following page for Volume Licensing: https:\/\/www.microsoft.com\/en-in\/licensing\/produ..."]},{"symptom":"My nvidia gpu cant be detected        Yes i know...But i have already researched the problem a lot and still no results, i have tried to messege nvidia support but no respond,The problem is with my gtx M850 and yes the driver installer cant detect any nvidia gpu, what could be the problem then?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please try the following driver for GTX M850: https:\/\/us.download.nvidia.com\/Windows\/441.87\/4..."]},{"symptom":"Windows Hello Face \"Currrently unavaliable\" \"Try again later\"        Hello,I just got my brand new Surface Pro X and I have been using it for over a week. The Windows Hello Face worked perfectly with no problem, but after windows update it stopped working. I'm not an expert but I believe the recent update has affected the system in some way. Right now my computer is fulling updated. Someone please help, thanks.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please create a Local User Account and check if you can use Windows Hello. Let me know the status."]},{"symptom":"Error: 0x80070002 - Unable to Install\/Update Windows Store Apps on Win 10 - 1903        Unable to suddenly update or install any apps anymore in Windows Store. Am on Win 10 1903 (Build 18362). Getting Error Code: 0x80070002Have tried all online options like running Store\/Update troubleshooters and deleting the SoftwareDistribution folder, and checking date\/time, etc.I tried the In-place upgrade, but getting the same issue. Nothing getting updated or installed from Windows Store. Am flummoxed on what possibly could be the Issue.Unfortunately, resetting the OS, or reverting back to an older backup is not possible for me.Please help me as I need to update my WSL due to some critical work requirements.","solutions":["Hi Russell,I am not based out of the US and hence cannot call on the given number. Any other channel you can suggest?","Hello! I am an Independent Advisor, I would love to help you out! The first thing I would suggest to do is to reset the microsoft store app. To do this you can: Open settings >apps Search for \"Microsoft store\" and select it Click advanced options Then click \"reset\"","Thanks, Thagstrom!Already done that, and everything that is published on this forum and elsewhere. No use :-(","Sorry about that! Could you verify how much free space is left on your C: drive? Also I would recommend to try to run the following if you have not yet in command line:sfc \/scannow DISM.exe \/Online \/Cleanup-image \/Scanhealth DISM.exe \/Online \/Cleanup-image \/Restorehealth DISM.exe \/online \/cleanup-image \/startcomponentcleanup","Done those steps. Still, the same Issue persists.","Could you tell me how much free space is left on your C: drive?","Around 300 GB","Unable to suddenly update or install any apps anymore in Windows Store. Am on Win 10 1903 (Build 18362). Getting Error Code: 0x80070002Was this ever resolved?I have the same issue with the downloads\/updates on Microsoft Sore on version 1909..Any ideas? I've tried resetting, restore, CMD Services, everything other a reinstall of windows... ","Unable to suddenly update or install any apps anymore in Windows Store. Am on Win 10 1903 (Build 18362). Getting Error Code: 0x80070002Was this ever resolved?I have the same issue with the downloads\/updates on Microsoft Sore on version 1909..Any ideas? I've tried resetting, restore, CMD Services, everything other a reinstall of windows... "]},{"symptom":"Your Phone App        Hi,The problem which I am facing is, Your Phone app does not shows me the call option and mirror option. You can see this in the image below. Can someone help me to fix this please ?","solutions":["Hi Ritwik, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Calls feature was withdrawn by the team with a recent update - most likely they need to tweak things to improve the same.Hopefully, the next update would bring it back, keep an eye on Store updates."]},{"symptom":"Program Compatibility System, Continuously Causing Popping Up        I recently installed an app, and after checking it out i decided to uninstall via the windows uninstall, since then I get a pop up (image included) every time i ALT+TAB. It is quite annoying and I cant seem to find a fix for it. Any help would be appreciated.The Pop Up","solutions":[]}]}