{"windows":[{"symptom":"No Audio Output Device is Installed. (Tried many thing without any results)        Yesterday I upgraded from Windows 7 to 10 (I know, it took me a long time) using the Windows Media Creation Tool, everything was working perfectly until this morning, when I had no sound.There's only been one update and I haven´t changed any hardware, and all wires and cables are fine. In the device manager it shows that all drivers under \"Sound, video and game controllers\" have a Warning Symbol (Yellow Triangle), and I've tried updating and uninstalling (before restarting the system) each one of them in every conceivable way.I've checked a lot of forums for possible solutions, reinstalled Windows 10 again, used the help of two online Microsoft Support agents without any results.My motherboard is an ASRock 990 Extreme3, I'm not running a dedicated audio card and my microphone and speakers work perfectly in other devices as they have standard jack connections (not USB).I'm starting to lose hope, can anybody help me?","solutions":["Hi, Can you check the following registry key: HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Class\\{4D36E96C-E325-11CE-BFC1-08002BE10318}At that registry key, in the right window, is there, under \"Name\", either an UpperFilters or LowerFilters value?If so, for each of the UpperFilters and\/or LowerFilters value, what is listed under \"Data\"?"]},{"symptom":"LiveKernelEvent 141        Hello everyone!Since yesterday morning, my pc freezes, presenting a screen full of vertical lines and emitting an annoying sound through the headphones (as if the audio track, from Youtube video or videogame, started playing the same note): since I don't get answers through inputs on the keyboard, I just have to turn the pc off.After that, turning it on is problematic, as I have to make several attempts before the PC is able to correctly boot the BIOS without presenting the same screen with vertical artifacts; when I can turn it on, checking in the \"Security and maintenance\" section, I find the following warnings which are almost contemporaneous with the PC freeze:1)DescriptionA hardware problem has occurred that prevents Windows from functioning properly.Signing the problemProblem event name: LiveKernelEventCode: 141Parameter 1: ffffca0bca8ed010Parameter 2: fffff803412409f0Parameter 3: 0Parameter 4: 2818Operating system version: 10_0_18363Service Pack: 0_0Product: 256_1OS version: 10.0.18363.2.0.0.256.48Local Settings ID: 10402)DescriptionPath to the application that generated the error: C: \\ Program Files \\ AMD \\ CNext \\ CNext \\ RadeonSoftware.exeSigning the problemProblem event name: APPCRASHApplication name: RadeonSoftware.exeApplication version: 10.1.2.1788Application timestamp: 5df7cf62Module name with errors: RadeonSoftware.exeModule version with errors: 10.1.2.1788Module timestamp with errors: 5df7cf62Exception code: c0000005Exception offset: 00000000004037e7OS version: 10.0.18363.2.0.0.256.48Local Settings ID: 1040Additional information 1: 0f1eFurther information 2: 0f1e8efbe4eda39817605f485fdb728aFurther information 3: 5231Further information 4: 52314ae56742624bb3d80fa6633ab45eLearn more about the problemBucket ID: 02bf88a692555ec2a4a3635017d5d94c (1487141497610819916)Can anyone suggest me any solutions? Thank you in advance.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please perform the following steps: Right-click on Start and then select Command Prompt (Admin). Type DISM \/Online \/Cleanup-Image \/RestoreHealth, and then press Enter. This will fix any corruptions that it finds.Type SFC \/Scannow on the prompt, and then press Enter. This scan will repair system files.","Command prompt says that \"Windows Resource Protection did not find any integrity violations.\", if this means that my system files are ok, is it possible that my problem is related to something else? ","It is related to the GeForce graphics driver. If you having a NVIDIA graphics adapter, I would suggest you to download the graphics driver from NVIDIA's website."]},{"symptom":"I HAVE A PROBLEM WITH OBS AND FORZA HORIZON 4        Hello , i want remove the game capture block on Forza and for that matter ALL Windows 10 games.  I pay for the game and i cant stream this game , i want a solution! please remove the block in the game with a update ! thanks! ","solutions":[]},{"symptom":"keyboard setting.        when i type 1. in my laptop it turns to ⁴. please give me a suggestion to solve this.","solutions":["Hello, this is Roman, I'm a independent adviser. With this information the only thing I can do is guessing... Maybe you got the \"FN\" function key locked in and so the optional key is pressed - you can try to type the \"FN\" key and then check if its the \"1\".Maybe your Keyboard drivers are not working or you got a wrong keyboard layout. For more and better informations please tell us which laptop you're using (model and manufactuerer), which language you have set up and which keyboard layout.best regards, Roman"]},{"symptom":"C:\\\\Windows\\System32\\LogiLDA.dll error on my new windows 10 laptop?        Hi,My laptop has this pop up error every time I start up my computer. I haven't noticed anything different, but I would like it to stop.. Is there anything I can do to fix it?","solutions":["Hi Syd_beth this is caused by Logitech Download Assistant and that can be hard to find, work through these steps until you find that . . .Open Control Panel - Programs and Features If you find Logitech Download Assistant, uninstall it Press Ctrl + Shift + Esc to open Task Manager Click on the Startup Tab See if Logitech Download Assistant, is listed there If it is, select it and click 'Disable' Close Task Manager Click your Start Button, type msconfig and hit Enter When the System Configuration dialog opens, click on the Services Tab Check the box marked 'Hide Microsoft Services' In the remaining list look for Logitech Download Assistant,, uncheck it if you find itClick Apply and OK Click your Start Button, type Regedit and hit Enter to open the Registry Editor In the left Pane, navigate to: HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run Find Logitech Download Assistant, then right click and choose delete Restart your System and this annoyance will be gone . . ."]},{"symptom":"Windows 10        About 20H1what is 20H1??","solutions":["Hello,20H1 is development branch for Windows 10's upcoming version.Regards."]},{"symptom":"Windows 10 Mail        Hello all,I am experiencing issues in using Microsoft Mail app which is synced with my google account.I noticed that quite a lot of mail is not being shown inside my Mail app. Does anyone have similar issues or is there any way of fixing it?","solutions":["Hi, Have you tried reinstalling the application or resetting it? Was it working fine before and now is not?Follow the steps below Go to the Microsoft Store and update Apps. Go to Settings > Apps > Apps & features > Mail and Calendar > Advanced Options > Reset.You can also Reinstall. I would also go to your Gmail Account via Web Mail and see to settings pages, as they are updating Gmail.Are you on the newest update of Windows 10?","Why not go straight to GMail? That's what I do. Nobody does GMail better than Google.Just because Windows has a Mail app, that doesn't mean you're supposed to use it.","Ofc, but I like the app and I want to use it :)fixed it. Heres what issue was:I've had a mail with large attachments and it stuck in outbox. As app is working synchronously it always stuck on trying to send it.When trying to recreate mail on Gmail Web, it resulted with forcing me to use Google drive service due to size of attachments.This should be updated in app so that user is informed that attachment exceeds the allowed size."]},{"symptom":"unale to add gmail account        I am unable to add gmail account in the mail app. It showing the error code: 0x800b109","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Could you try the steps in this guide to resolve: https:\/\/answers.microsoft.com\/en-us\/windows\/for...Regards, Ross","I am unable to add gmail account in the mail app. It showing the error code: 0x800b109Hello,See if this fix helps you:https:\/\/www.kapilarya.com\/fix-cant-add-gmail-account-to-windows-10-mail-appHope this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP. "]},{"symptom":"Windows showing battery 0% but charging.        Hi,From today evening, I have been noticing something strange happening to my laptop. When plugged in, the battery shows 0% Plugged In, Charging.When I disconnect the AC input, the laptop turns off. Even after restarting the laptop, it doesn't seems to be solved.Any suggestions will be gratly appreciated.","solutions":["Hello, Please run Power troubleshooter from Settings app > Update & security > Troubleshoot. Let us know what it reports back. Regards.","Hi Jyotirmay Open Device Manager (accessible by right clicking your Start Button) Expand the Batteries section For each device in that section: Right click and choose Uninstall Shut your laptop down Disconnect the power adapter If you can, remove the battery from your laptop Press and hold the Power button on your laptop for 30 seconds Re-insert the battery, if you removed it Re-connect the power adapter Turn on your laptop Check if your battery is charging . .."]},{"symptom":"multiple user accounts        I am having issues with adding a second user account to my pc.Every time I log back in to my account (administrator) after the other user has been logged in, I have multiple issues.  They seem to be caused by changes to settings, though the other user does not change other settings, even when she is logged into her account on her own pc.Issues that seem to be settings related:Mouse settings are dramatically different and do not change back when I go in as admin and attempt to change them.  They seem to correct, though after several start-ups (reboot).Settings in Chrome browser are changed with the most obvious being video playback.  The fix seems to be going into settings and turning off hardware acceleration.On Startup, Continue where you left off is turned off when I always have it turned on.Glitchyness  Subjective I know, but my pc just doesn't function as smoothly.  there are more frequent and longer delays between initiating an action (like opening a browser or WORD), and there is more flickering in general as if video output\/rendering is affected.Everything is up to date including Windows 10, video drivers, browsers, apps, virus protection (only have Windows Defenders) and Malware.  Again, I had no issues with my pc until I added a second user account.  After I work on getting things better again, it is all undone the next time the other user logs in.","solutions":[]},{"symptom":"Error: 0x80070002 - Unable to Install\/Update Windows Store Apps on Win 10 - 1909        Hi there, I'm trying to find a solution to Error: 0x80070002, which appears while trying to download any new app OR, update any existing app in windows store. The error pops up as soon as the store shows \"Downloading\". I'm currently using Windows 10 Version 1909. I've tried multiple \"fixes\" including date\/time, resets, turning on\/off system processes & clearing data, windows update (Which appears to be functioning,) system restore and troubleshooting.Any other ideas?","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command prompt DISM \/Online \/Cleanup-Image \/RestoreHealth Run these commands on the command prompt to restart update services net stop bits net stop cryptsvc net stop wuauserv net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start bits net start cryptsvc net start wuauserv net start msiserver After successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig 2. On the system configuration window go to the services tab 3. Tick on hide all microsoft service so that this won't be affected 4. Choose to disable all services 5. Next, go to the startup tab and on the window choose to open task manager 6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok 8. A prompt to restart the computer will show up, choose to restart This should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update\/install apps again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo... 2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept. 4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command prompt DISM \/Online \/Cleanup-Image \/RestoreHealth Run these commands on the command prompt to restart update services net stop bits net stop cryptsvc net stop wuauserv net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start bits net start cryptsvc net start wuauserv net start msiserver After successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig 2. On the system configuration window go to the services tab 3. Tick on hide all microsoft service so that this won't be affected 4. Choose to disable all services 5. Next, go to the startup tab and on the window choose to open task manager 6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok 8. A prompt to restart the computer will show up, choose to restart This should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update\/install apps again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo... 2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept. 4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :) Ok, first two options did not work :( It is strange that I only noticed the issue since the update to V. 1909..Anyway, I'm going to try the upgrade tool, and will advise once completed. Thank you for your help so far.","Fingers crossed!"]},{"symptom":"computer        where do i find defrag my computer","solutions":["See if this assists you:How to Use Windows 7 Disk Defragmenterhttps:\/\/www.sevenforums.com\/tutorials\/11733-disk-defragmenter-open-use.htmlOPTION ONEUsing \"Disk Deframenter\" in Windows 7 1. Open the Start Menu, and double click on to expandAll Programs, Accessories, System Tools, and click onDisk Defragmenter. (See screenshot below)Cheers."]},{"symptom":"Windows 7 update server        How long will the Windows 7 update server work for? (not new patches, just the present updates for a clean install).Thanks","solutions":["XP, Vista,, etc. updates until the end of support date for them have still been working for years.We don't work for Microsoft so can not tell you what their plans are for 7.","Thanks for the reply, noticed that XP was available for a long time (but seems to have ended  recently, at least on two machines here). Never used vista, but I guess 7 will be available for at least a year then.","You should have no problems getting updates up to end of support date after the end of support date."]},{"symptom":"ATI Radeon HD 2400 XT Driver for iMAC running windows 10        I successfully installed Windows 7 on my mid 2007 iMac (stuck at Mac OS X 10.9.5), using Boot Camp, and then updated to Windows 10 because my University is ending support for Windows 7.It's a great computer, and while it's aging, I have 6 GB of RAM, 250 gb SSD, and it runs and looks great and I can continue to use it in my lab.I noticed it is using a generic Microsoft display adapter and not an ATI branded driver.  After reading a few threads in our Community and going to AMD web site, it looks like there may only be a Windows 8 version driver, but it's not clear if it's compatible or how to install under Windows 10.I've read one thread about using Windows 7 compatibility mode, but before I take any chances, I figured I'd ask this group for clarification.I downloaded the file \"13-1-legacy_vista_win7_win8_64_dd_ccc.exe\" file from AMD\/ATI web page, but am apprehensive about installing.Any clear advice (steps) would be appreciated. ","solutions":["Right click the file and go to properties, select Compatibility and then Windows 8, select OK Double click the file to run it and if it is compatible with your version of Windows 10 it will install the driver.This may be your only option as these graphics are not supported in Windows 10 otherwise and the Microsoft driver may be the only option."]},{"symptom":"Missing search tab - File Explorer (Windows 10 - 1909)        Hello,I have installed the latest update of windows 10 (home and pro).Windows 10 Pro - 1909 (v. 18363.476)Now the \"search\" tab is no longer in the folders and I can't clear the search history either. Where is this tab?!","solutions":["Hi Yaek.m and thanks for reaching out. My name is Joseph. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by a Windows Support, so it is safehttps:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.Thank you!","Hello,After scann, I am get this message:Windows Resource Protection did not find any integrity violations.This same problem occurs with 2 different computers. one with windows 10 home and the other with windows 10 pro...Could it be a bug?","Hi Yaek.m, See the attached file. I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.Thank you!","You can see in Yaek.m's screenshot he is actually clicking in the search box and it isn't showing. I have same problem too.","I am experiencing the same issue here also after installing the 1909 update.This is what I see when I click in the search box.  How can you break this and not know as it is all over the internet?","I have a network with a lot of users and they have the problem as well.  When you click on the search box it does nothing.  There is no search tab.  All of the routine suggestions to fix Windows search problems does not fix this.  Clearly is a new bug.  Need to fix it asap!","I have the exact same problem. I've tried every suggestion found online, nothing worls.","Is this seriously support for the most popular operational system in the world?","Hello,I have installed the latest update of windows 10 (home and pro).Windows 10 Pro - 1909 (v. 18363.476)Now the \"search\" tab is no longer in the folders and I can't clear the search history either. Where is this tab?!I've found if you press [return\/enter] after your search word the search tools pop up and stay up until you close explorer. ","I have been having the same problem. If I put kind: in the search bar and pressEnter it brings up the search tools.You can also enter the information manually, ex: kind:=pictures for example to bring up all pictures in search. However, there was a time when just clicking in the search field added the tab automatically, I do not know why Microsoft changes things that work so well."]},{"symptom":"Windows error activation code 0xc004f050 After going from W7 to W10.        Hi,I have a laptop which is 10 years old, upgraded when bought new from windows vista to windows 7 with new product code and used the same windows 7 code to go from Windows 7 to Windows 10 but it will not accept the code and keeps coming up error code activation code 0xc004f050,  I have been through the trouble shot and looked on line but could not find a fix. Can anyone help?Regards","solutions":["Hi p147, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.The free upgrade offer ended on July 28th 2016 which is probably why you are seeing the activation message. There are claims on the Internet that the free upgrade offer works as of now as well, but in reality it is upto Microsoft. The ones who upgraded now run the risk of being deactivated later. So you have two options: 1. Return to Windows 7 provided it is under 10 days from Settings>Update and Security>Recovery.2. Buy a new license of Windows 10.","Hi p147, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.The free upgrade offer ended on July 28th 2016 which is probably why you are seeing the activation message. There are claims on the Internet that the free upgrade offer works as of now as well, but in reality it is upto Microsoft. The ones who upgraded now run the risk of being deactivated later. So you have two options: 1. Return to Windows 7 provided it is under 10 days from Settings>Update and Security>Recovery.2. Buy a new license of Windows 10. Thank you for your reply.1) The problem with that is Microsoft will stop update security support of W7 in the next week, and that might have serious implications for W7 users.2) I have been quoted £119 from Microsoft for this. it would almost be cheaper to buy another computer, Therefore looking for other options. ","Hi, Yes, it is correct. We strongly recommend upgrading to Windows 10. Buying a product key from Microsoft guarantees it would be authentic and would be transferrable to another computer in future if you buy new hardware. Buying a cheap key from Internet marketplace run the risk of being deactivated anytime."]},{"symptom":"Display        Is it possible to reduce the screen display from 100% to less than 100%","solutions":["Hi Robert If you are referring to the Scale factor in Windows 10, in Display Settings, then I am sorry, 100% is the minimum value . . .The only thing that will make objects on your screen smaller is a higher resolution setting, and if you go too high with that setting, you may put your monitor out of range . . ."]},{"symptom":"Delivery Optimization Files        I was downloading Forza Horizon 4 yesterday and today I went to see my disk's and saw that I lost like 60 GB on my C disk (installed on D) and then I ran disk cleanup tool and saw the Delivery Optimization Files. Is it safe to delete?","solutions":["Hi TotalingBanjo62 Rest assured, you can safely delete those Delivery Optimization files without any fear of harming Windows, in fact you should run Disk Cleanup twice as explained below, and delete everything in the lists, because Windows will not suggest deleting anything that can harm your PC There is one exception to this rule, in version 1903 of Windows 10, your Downloads folder was added to the Disk Cleanup process by default, if you store files in that folder, either move those to another folder for long term storage, or untick the downloads folder in Disk Cleanup . . . Open File Explorer Click on your hard drive On the Manage Tab, click Cleanup Let Disk Cleanup do its initial scan Select Everything in the list and choose Delete Start Disk Cleanup again Let Disk Cleanup do its initial scan This time in the resulting dialog, click 'Cleanup System Files' Let Disk Cleanup run another scan Select Everything in the list and choose Delete"]},{"symptom":"Memory dump accessed date        If server is configured for full memory dump, each time the server crashes, will a new dump file be created or existing dump file is updated?","solutions":["If server is configured for full memory dump,each time the server crashes, will a new dump file be created or existing dump file is updated?Your question is beyond the scope of these ForumsThis Community is mainly for home users and their computer problems, not business systems.Kindly post your question in the TechNet Server Forums.http:\/\/social.technet.microsoft.com\/Forums\/windowsserver\/en-US\/home?category=windowsserverTechNet Forums: https:\/\/social.technet.microsoft.com\/Forums\/en-US\/homeMSDN Forums:https:\/\/social.msdn.microsoft.com\/Forums\/en-US\/homeCheers."]},{"symptom":"Text encoding in Mail agent for Windows 10        When I attach to e-mail file named with Cyrillic letters it would change name to \"=_UTF-8_B_...\". Otherwise e-mail and windows in general work ok.I could not find any app specific text encoding settings.Mail is Version 16005.12026.20218.0Windows 10 Home Single Language","solutions":["Hello EkSMsk, this is Roman, I'm a independent advisor. The email protocols are quite old and so they don't support unicode. The changed name is the conversion from Cyrillic to Base64. The conversion is needed so all servers can read the filename.The best way is to rename the file - if there is an app for converting the filename it must be installed on each sender \/ receiver system.best regards, Roman","Thank youBut everything has been working properly until yesterday. Something changed and I'm struggling to find out how to get back to original settings ","Do you habe older Emails, where the encoding was Cyrillic and how do they look now?","File names in older e-mails have also changed to unreadable. Although they we ok at the time I sent them.This has something to do in communication between google (gmail) and Windows mail agent. ","When you log into gmail - how do the files look there? Can you add a file in Gmail and check if the encoding is Cyrillic there? Your request is very special and so we have first to check where exactly the change was and then we can go on and try to change it.best regards, Roman","Thank you for talking care of thisIf access my gmail via internet browser I can attach Cyrillic named files and they are sent and received well. When I see the same message in Sent folder via Windows mail agent, the file name is unreadable. ","Did you check for all updates? The newest version seems to be 16005.12026.20368.0 (on my system, but I already got the 1909 Update)best regards, Roman","Hi,My sytems's Mail (Windows 10, Update 1909, Mail version, Version 16005.12026.20368.0) is having a similar issueThe PDF files that I receieve as attachments, are renamed with \"=_UTF-8_\" ... beginning and ending with the file name & file extension is replaced. Windows can't open these PDF files for it doesn't recognize the file type. Regards","The problem below gets resolved by resetting the Mail app, FYI, thxHi,My sytems's Mail (Windows 10, Update 1909, Mail version, Version 16005.12026.20368.0) is having a similar issueThe PDF files that I receieve as attachments, are renamed with \"=_UTF-8_\" ... beginning and ending with the file name & file extension is replaced. Windows can't open these PDF files for it doesn't recognize the file type. Regards","I have the same issue. I have to start web version of Gmail to extract a PDF file with a cyrillic name. Gmail shows the cyrillic name properly, Windows Mail App does not. Version 16005.12228.20356.0."]}]}