{"windows":[{"symptom":"Laptop with Windows 7 will not boot up        Laptop with Windows 7 failed to boot - Windows Recovery Screen went into Start up Repair checking system for problems. Took well over an hour, so I left it on overnight. The next morning when I turned it on, it displayed a different repair screen - this one showed details of everything it was checking, found some bad sectors and 'repaired' them (I think this means shuffles files away from them). After this it started up normally, and I was able to access and use all my files. All seemed okay.Following day, it fails to boot again. This time Recovery Screen and Start up Repair again take over an hour so I left it on overnight but this morning it still showed Start up Repair screen still active.I have a Recovery disk I made when I first got the laptop but can't use it as the CD\/DVD drive hasn't worked for a very long time. So I can't use that by changing the boot option.I have another computer with Windows 10, but don't know if I can 'link' them to recover my laptop - I don't want to corrupt my Windows 10 computer.I now have an expansion portable drive to 'save' all the stuff off my laptop, if I can manage to boot into it one more time!I don't know much about technology but any help at all will be much appreciated. ","solutions":[]},{"symptom":"My internet works but anything related to google.com throws out a DNS error        Hi,I have Verizon FIOS bundle, intenet, tv, and digital phone.  My connection is to a single house where the fiber enters the garage to an ONT, then coaxial to the Quantum Router G1100, and in my detached garage i have a Verizon provided wi-fi extender (uses coaxial & MOCA) to extend the wi-fi signal.Everything has been working fine for about 4 fours until a few days before Christmas, i started to notice whenever i open up Chrome, Internet Explore, or MS Edge, my default homepage is google.com the google logo shows up, but the google services such as gmail, images, or the six dots for other Google services were not present.  Long story short, i have verified that i still have internet, but anything google related or a search query on the google.com bar would give me a DNS error.  But if i type bing.com or yahoo.com into the bar the page would load and i can query anything.  I also found out a reboot of the router fixes the problem for a few hours.  I have been on the phone with Verizon, resetting the router to factory defaults, changing the network name, removing the wi-fi extender, and even replacing the router with a brand new one.  My problem persists.  I have removed everything from the network, wired and wireless except for a handful of devices that is needed for work.  The problem persist with not just one PC, but also the mobile phones, both Apple, and Android.  I tried to flush DNS, i tried to change DNS addresses in the router, i tried just about everything.  Any other ideas before i drop Verizon?Thanks!","solutions":["Well, in that case this is a DNS error. The DNS service of the ISP is not working properly. I suggest you to kindly ask the ISP to allocate another IP address for you."]},{"symptom":"Activation after hardware change.        Apparently I was supposed to associate\/link my digital key to my account but I never knew that, and recently my motherboard died on me so my hardware has changed. Now windows is claiming it is not activated. What is the fix? Or is there one? Would be very important as my HDD is failing too, so I will need to reinstall as well.","solutions":["Hi Chrome, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.Do you recall if you had an OEM version or a Retail version of Windows 10? OEM versions are not transferrable, while a Retail version is. Changing the motherboard, as you noted, means the license was valid for the old motherboard, so if it was an OEM license, it is not transferrable to the new one.If you use a brand name PC (and not a custom motherboard), you may wish to contact the manufacturer to see if there is something they could do for you.The Windows activation is generally linked to the Microsoft Account you use to log in, so activation would hopefully occur seamlessly if you are using the same account as the old motherboard. Otherwise, a 25 character product key may help to activate.If you purchased Windows through the Microsoft Store, you may want to see if you can see your Windows purchase under your Microsoft Store order history, at:https:\/\/account.microsoft.com\/billing\/ordersYou may need to contact Microsoft Support directly via phone or live chat, as we on these forums do not have visibility into Microsoft Accounts or license activations:https:\/\/partner.support.services.microsoft.com\/...This article has an overview of the activation process which may be helpful: https:\/\/www.groovypost.com\/howto\/transfer-windo...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","Hi Chrome, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.Do you recall if you had an OEM version or a Retail version of Windows 10? OEM versions are not transferrable, while a Retail version is. Changing the motherboard, as you noted, means the license was valid for the old motherboard, so if it was an OEM license, it is not transferrable to the new one.If you use a brand name PC (and not a custom motherboard), you may wish to contact the manufacturer to see if there is something they could do for you.The Windows activation is generally linked to the Microsoft Account you use to log in, so activation would hopefully occur seamlessly if you are using the same account as the old motherboard. Otherwise, a 25 character product key may help to activate.If you purchased Windows through the Microsoft Store, you may want to see if you can see your Windows purchase under your Microsoft Store order history, at:https:\/\/account.microsoft.com\/billing\/ordersYou may need to contact Microsoft Support directly via phone or live chat, as we on these forums do not have visibility into Microsoft Accounts or license activations:https:\/\/partner.support.services.microsoft.com\/...This article has an overview of the activation process which may be helpful: https:\/\/www.groovypost.com\/howto\/transfer-windo...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton What I had was Windows 7, and did the free upgrade to 10. It was retail but of course I no longer have the packaging or old serial. And from what I read i was supposed to Link your Windows 10 digital license to your Microsoft account.In Windows 10 (version 1607 or later), it is essential that you link your Microsoft account with the Windows 10 digital license on your device.I never knew this, and now that the change is done I get the option to trouble shoot it (under settings then activation) and when it completes I can click the \"I changed hardware on this device recently\" Link which loads another window and gives meUnable to activate WindowsWe can’t reactivate Windows on this device. Try again later.Learn moreYou can also activate this device by going to the Store and purchasing a genuine copy of Windows. My copy is still genuine, but now of course because of something I never was aware of, I am having this issue.","You can try key finders. In the Store ShowKeyPlus and the web Produkey-64 https:\/\/www.nirsoft.net\/utils\/product_cd_key_viewer.htmlIn both you are looking for the previous or original key. In Produkey it is shown as Internet Explorer. This is assuming you have never clean installed.Otherwise you can try Chat or Tech support.Chathttps:\/\/partner.support.services.microsoft.com\/en-us\/contact\/menu\/software\/windows\/setup\/Techhttp:\/\/partner.support.services.microsoft.com\/en-us\/contactus\/windows\/tech-services\/"]},{"symptom":"keyboard unusable        Why do I have to keep re-installing my keyboard in order to use it. I have an HP usb keyboard","solutions":[]},{"symptom":"Log into another device from my main device        I have just recently upgraded my desktop PC from Windows 7 Pro N to Windows 10 Pro N. I also have a Surface Pro 4 running Windows 10 Pro. Both are on version 1909.Build versions:PC - 18363.418Surface Pro 4 - 18363.535I use my Microsoft account for both machines (*** Email address is removed for privacy ***).Both machines are connected to the same network, and can see each other in Network Discovery. I also have sharing turned on on both devices.The problem I am facing is that I want to be able to navigate through the Surface Pro 4 from my desktop and vice versa when the need arises.So, in Network Discovery I double click on whichever device I want to navigate through, i.e. From my desktop I double click the Surface Pro 4.The Windows credentials screen pops up asking for username and password, so I pop my Microsoft account address in and then type the password for it, but it just keeps saying that my password is incorrect. I know 100% it isn't, as I have just logged into this support page with the exact same credentials.How do I do it? It was so simple with Windows 7!","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues in accessing your Surface Pro 4 from your Desktop. I’ll help you with the issue. I would like to inform that on the first connect, the PC will ask for a password for authentication. One of thing that I can suggest you is to try entering the Device name and password when you receive the prompt. To check for the Device name, go toStart >> Settings >> System >> About. If that doesn’t work, try the steps mentioned below: On the computer for which you are being asked for password, typecommand prompt in the search bar on the Taskbar.Right click on the command prompt icon, and selectRun as administrator.Now, type whoami and hit Enter.You will get the name of the device, try using the name as the username and use the computer password. For additional information, see File sharing over a network in Windows 10. Let us know the results.  Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"BSOD on Windows 10, DUMP files        My computer keeps on crashing at random times and it displays a blue screen.Since the the computer is already in warranty i've already sent it to the producer and they changed the motherboard with a new one but the problem still there.I use an HP ProBook 440 G5 with Windows 10. All the drivers are up to date and so the operating system.Here are the DUMP files and msinfo for anyone who could help me fix this.Thanks.https:\/\/1drv.ms\/u\/s!ArWQEaBx4VS7alRxmeihuKsQ9IY?e=MugJ9X","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Did this computer come with Windows 10 pre-installed? If you are installing the OS yourself, may I know the source of the Windows 10 ISO that you are using to perform a clean installation?","Yes it came with Windows 10 pre-installed.The version is now 1909 (OS Build 18363.535)","Okay, please perform the following steps after logging in to the PC. Type msconfig at Start Menu and open it. Click on \"Selective Startup\" Tick on \"Load System Services\" Uncheck\/Untick other options. Apply > OK Restart the PC. Observe the computer if the error appears again."]},{"symptom":"Internet connection sharing problem in 2003 server        Internet connection sharing is getting disabled in windows 2003 server, after installing domain controller. ","solutions":[]},{"symptom":"Outlook settings out of date. Win 10        I've had many problems logging-in since the 25th November and have created several threads in the hope that someone will explain what the heck is going on. But no one has.I'm now getting a message \"Your outlook settings are out of date.\" More nonsense. More time wasted just to get to the Community\/my mail.I clicked 'Fix it' and then had to go through the time-wasting rigmarole with inputting my Hello PIN number [edit typonumbers] several times. It did fix it - for now - but what in Hades is causing all these issues. There hasn't been a Windows Update so that can't be the cause.Is the Community, mail and other Microsoft products\/site about to be changed?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. This issue may appear due to mismatched internet date\/time. This error often happens when you don't use SSL to secure your email account. To fix this error, use the following steps.Choose Settings > Manage Accounts. Choose the account that's out-of-date to display the account settings dialog. Choose Change mailbox sync settings > Advanced mailbox settings. You may have to scroll down in the dialog to see Advanced mailbox settings.Check the boxes for Require SSL for incoming email and Require SSL for outgoing email and then choose Done > Save.As of now you mentioned it is working. However, I would request you to execute outlook in safe mode once and check if it is working.Open Run. Enter the following command. outlook \/safe","With all that's happened this morning Arif I'm now certain that the problem is much bigger.(1) First, I signed in as usual and entered my Windows Hello PIN. What I then saw is shown inTHIS ONE  of the three previous threads I'd created. It ignored the Windows PIN by telling me I had to \"enter your PIN\" and it took me though most of the stages shown in the above thread.In addition (1) I had this 'Microsoft Account Problem' message in my notificationsThis happened when I signed in on the 1st January and also two weeks before that. Both times I clicked to \"fix it in Shared experience settings\", both times it worked at the time but the problem re-occurred.(2) When I received the email notification about your reply (\"Question has a reply\" -Outlook settings out of date), I pressed Reply but instead of being taken to this thread I was taken to here:I had to go to \"My Activity\" to get back here.(3) The problem has 'spread' to my Word - again. When I opened my Word template to save your advice & deal with later, this was at the top of it. (I've hidden my name.) I clicked on the Exclamation mark and saw this(I've removed the bit in the middle as it has all my PI.)The same nonsense is affecting my Excel template as well.I'll try the instruction on it & will sign out of my Word & Excel and then sign in again. I'll let you know shortly if there's any changeBut it's clear to me that this is a bigger problem than just the SSL, although I will try that later.","update - I just had another blasted \"Your Outlook Account settings are out of date\" notification.I'm going out for a while - when I return I'll check if the Word & Excel problems have gone.","Okay, please try verifying the account. Perform the following steps: 1. Open Settings app and go to Accounts > Your info. 2. After doing that, click Verify. 3. Now select the desired verification method and click Next. 4. After that, you’ll get a confirmation code. Enter the code to verify your account.After you verify your account, check if the problem still persists. Keep in mind that you should use the email address or phone number you entered when creating your Microsoft account.","good morning, Arif. When I signed in just now, I again had these two Frankenstein messages in my Notifications:And of course both my Word & Excel templates are showing the same Frankenstein error that I've flagged up many times:(The part in between the two has my personal info so I've left that off.)Your advice was Open Settings app and go to Accounts > Your info. 2. After doing that, click Verify. ***3. Now select the desired verification method and click Next. 4. After that, you’ll get a confirmation code. Enter the code to verify your account.After you verify your account, check if the problem still persists. Keep in mind that you should use the email address or phone number you entered when creating your Microsoft account.I went to my Settings>Your Account>Verify. It asked for my Hello Pin so I entered it. It then removed my input and showed a suggestion that I sign in with a local account.This was on https:\/\/account.microsoft.com\/security\/I didn't proceed, but I then saw \"see when & where you used you're account\".The latest entry was this morning - as above. It showed that two-stage verification is off (which is how it should be). It also showed my wife's email address, which I input when I set up the account but said that no email alerts have been sent to her.It suggested HERE that I change my password but that was only for mail so again I ignored it.***But the biggest change that's happened today is that I no longer have \"Verify\" in  Settings>My Account so what should I do now please?","Okay, in that case I suggest you to Remove and Add the existing Microsoft Account again.1. Back up all your required files from the current account. 2. Create a Local Account (Administrator) 3. Log in to the new Local Account. 4. Remove the troubled Microsoft Account. 5. Add the Microsoft Account again. 6. Sign out from the Local account and log in to the re-added Microsoft account 7. Remove the Local Account. Steps to Create a Local Admin Account: https:\/\/support.microsoft.com\/en-in\/help\/402692...Steps to remove a Microsoft Account: Click the Start button, and then click Settings. Click Accounts, scroll down, and then click the Microsoft account you would like to delete.Click Remove, and then click Yes.","Hello Arif. My brain is still reeling from all the problems every time I log into my account so I'll sleep on your suggestion","I think you can ignore the fact that you see the standard starting website when you select Reply. I get this now, someone has been fiddling again with the Community Forum. If I select Sign-in (top right) first then selecting Reply does just that.This is not related to your apparent account program responses.","Sure. Let me know if the issue persists."]},{"symptom":"shared printer is offline        printer says offline","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that your printer shows ‘Offline’. I’ll certainly help you with the issue. Are you aware of any changes made to the computer recently? Meanwhile, I would suggest you to refer the article on Change a printer’s status from “offline” to “online”. If you still face issues, please refer the troubleshooting steps mentioned in the articleTroubleshooting offline printer problems.  Let us know how it goes. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Windows 10 pro ugrade from Windows7 pro with UEFI bios? Purchsed over the counter Windows10 Pro.        I am trying to upgrade my computer running Windows 7 pro but keep running into an error that wont allow Windows 10 to finish. I am unable to boot straight from the USB because of the UEFI bios format. It does not have a boot directory to support booting from USB.Everything on the computer is updated. Drivers, Bios etc..Can I use the media creation tool to utilize my over the counter upgrade?Thank you for suggestions.J","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query related to upgrading from Windows 7 to Windows 10 on your PC. For further clarity on the issue, please respond to the questions below: What is the make and model of the PC?What is the error message\/code that you receive when you try to upgrade the PC?How are you trying to perform the upgrade? One of the things that I can suggest is to make sure that Service Pack one is installed and then perform hardware Clean Boot and Software Clean Boot and then try initiating the upgrade on the PC. Follow the steps mentioned below to perform hardware clean boot. Press Windows key + R. This will openRun. Alternatively, you can go to Start and search for Run.In Run dialog box, type devmgmt.msc and hitEnter.Now expand the Display adapters, Printers, Sound, video and game controllers.Now right click on the drivers inside the section and click onDisable.If asked for restart click on restart later and disable all the drivers.Close the device manager window. Once you finish performing Hardware Clean Boot, perform Clean Boot on the PC and proceed with the installation. Refer the articleHow to perform a clean boot in WindowsIn addition, you may want to refer the article Get help with Windows 10 upgrade and installation errors Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator","If you are trying to upgrade Windows 7 Pro you don't need to boot from the USB but just run setup within Windows Explorer in Windows 7. Is that what you mean or do you want to clean install Windows 10 Pro.?"]},{"symptom":"The sound card E-MU 1616m does not work with the new update        I'd like to ask you to help us using these sound cards. I tried all the options that were available to me. None has been successful.I returned to the previous version of Windows 10 1803, and the sound card works properly.Thank you in advance for help and response.Best regardsTomislav","solutions":["Hi Tomislav According to Creative, that device is now classed as 'End of Service' They have not produced a new device driver for that card, since 2011 Most likely, the newer versions of Windows 10 will not be compatible with that card due to lack of a device driver, you may need to stick with 1803, because a lot changed in Windows 10 version 1809, which made a lot of hardware, including graphics cards, audio cards . . .etc. obsolete . . . . .. https:\/\/support.creative.com\/Products\/ProductDe...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","Thank you for your response.There are plenty of users of this sound card, and this sound card is not like an ordinary sound card. It is used extensively in the studios. Total disappointment in Windows 10.","Try this, from another thread :.................................................................................................................................Bryan86_HU\"I have found a solution. Just download the offical Audigy RX driver from Creative website.https:\/\/support.creative.com\/Products\/ProductDetails.aspx?catID=561&catName=Sound%20Cards&subCatID=1123&prodID=21723&prodName=Sound%20Blaster%20Audigy%20Rx&_ga=2.220384088.1563738097.1557985768-1807327002.1557156356#Extract it with Winrar or other tool. Manually install the driver from the folder Audio -> DriversWin10 -> wdm -> browse wdm_emu.inf file.If installed succesfully, then  just restart the PC.Step 2.Download the Audigy Support Pack from https:\/\/drive.google.com\/file\/d\/0B4veZnyFbxW4VjdhUVMzOG1yVFE\/view, or from the website:http:\/\/danielkawakami.blogspot.com\/2017\/01\/sb-audigy-series-support-pack-62.htmlExtract it. Then run Setup. Choose Custom install. Uncheck the Driver. Install all other App. Restart PC, and Audigy 2 ZS is working.All apps working. Speaker Settings, EAX Console, Audio Console\".............................................................................................................................................................................................................I uninstalled my audigy 4 driver and then the wdm_emu.inf file (right click, select 'install') and it worked. I didn't bother with the Audigy Support Pack at all.So maybe it will also work with your sound card. Doesn't hurt to try.","I solved the problem.Now my sound card works perfectly on Widows 10, 1903@ laudablepus, What you wrote has nothing to do with this sound card E-MU 1616m PCI-e.I thank everyone who has read this problem at least.😊","@ laudablepus, What you wrote has nothing to do with this sound card E-MU 1616m PCI-e.","I realized after I posted that it likely wouldn't apply. Sorry for wasting your time.However, please post how you solved the problem so others with the same problem might be helped.","I solved the problem.Now my sound card works perfectly on Widows 10, 1903Hey.Let the other users know how do you solve this problem, please.Is it fixed emu-asio in your solution? Or you just replaced driver with wdm version of another creative non-professional card?","E-MU 1212m\/1616m - Complete Install Guide for Windows 10 (1903)This is a complete guide to setting up the E-MU 1212m\/1616m audio interface on Windows 10 version 1903x64 and above.It will work for both PCI and PCI-Express and should work with the E-MU 1820\/1820m\/0404 audio interfaces too but you may need to rename the 2 instances of your device name in the EMU_Driver_Fix script file.Huge thank you to ClubHouseKey and Martin, Producer at Sherwood Sound Studios whose information saved us and give us compatibility with Windows 10x64 1903. The E-MU 1616m PCI-Express is the audio interface I have and I will never get rid of it unless there is absolutely no way to keep using it. Amazing piece of hardware! If any new updates are posted in this thread then this first post will be edited accordingly.E-MU 1212m\/1616m - Complete Install Guide for Windows 10 (1903 & Above)*Please perform each task in the exact order listed.*1.  Remove all current E-MU Drivers and PatchMix software.2.  Download the E-MU_Windows_10_Install.zip file from   https:\/\/1drv.ms\/u\/s!Ar-KCv7xikVOh23zeXTESuD8k2ih.3.  Extract the zip file to a folder on your main Windows 10 drive and call it---> \"temp\". (C:\\temp4.  Install the EmuPMX_PCDrv_US_2_30_00_BETA drivers 5.  RESTART INTO SAFE MODE by holding the shift key when clicking on Restart. 6.  Choose Troubleshoot, Advanced Options, Start-up Settings and click Restart. You will later be prompt with safe mode restart option. Select option 4 in Safe mode.7.  Once in safe mode right-click on the start button and open Windows PowerShell (Admin).8.  Type into the PowerShell window --> \"cd c:\/temp\/EMU_Driver_Fix\"   or you can right click with your mouse to run the script run with help ofWindows PowerShell (Admin).     *Note: On some systems Windows 10 1903 has another security layer even in safemode that forbidd you to run unkown scripts and code.You get then a confrimation message if its okay to run the selected script \"EMU_Driver_Fix\".  Select \"yes\" and then the script will finally run for you.  This a modified version of ClubHouseKey's script. This will replace our windows files with the new updated files.*Note: Performing this step in a normal Windows environment will either cause the script to not run at all due to script settings within Windows or some files will not get overwritten because they're in use.9.  Restart Windows as normally and then install the EmuPMX_PCApp_US_2_20_00 PatchMix Software.You should now have successfully installed your E-MU Audio Interface and everything will and should work as normal.Extra ASIOx64 driver10.  If you plan to use the ASIO x64bit driver in a x64bit DAWs like Cubase Pro 10, Studio One, Pro Tools, Sonar and other x64 environments.Click on \"Start\" and type \"regedit\" in the search bar and click on \"Registry Editor\" to run it.11.  Go to    HKEY_LOCAL_MACHINE\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows\\CurrentVersion\\Run 12.  Right-click \"AsioThk32Reg\" and choose Modify. 13.  Change \"CTASIO.DLL\" to \"CTASIO64.DLL.\"I hope this guide helps everyone that wants to keep their 1212m\/1616m running in Windows 10 1903.Big thanks to ClubHouseKey and Martin,Producer at Sherwood Sound Studio that found this solution for us all.You can find and follow updates of this driver here!https:\/\/www.kvraudio.com\/forum\/viewtopic.php?t=529349I hope this helped you all to make the installation of the new driver easy and informative for everyone.Best RegardsFreddie","Freddie you are a lifesaver for posting this. Thank you and thanks to ClubHouseKey and Martin, this got my 1616m back up and running!","E-MU 1212m\/1616m - Complete Install Guide for Windows 10 (1903)This is a complete guide to setting up the E-MU 1212m\/1616m audio interface on Windows 10 version 1903x64 and above.It will work for both PCI and PCI-Express and should work with the E-MU 1820\/1820m\/0404 audio interfaces too but you may need to rename the 2 instances of your device name in the EMU_Driver_Fix script file.Huge thank you to ClubHouseKey and Martin, Producer at Sherwood Sound Studios whose information saved us and give us compatibility with Windows 10x64 1903. The E-MU 1616m PCI-Express is the audio interface I have and I will never get rid of it unless there is absolutely no way to keep using it. Amazing piece of hardware! If any new updates are posted in this thread then this first post will be edited accordingly.E-MU 1212m\/1616m - Complete Install Guide for Windows 10 (1903 & Above)*Please perform each task in the exact order listed.*1.  Remove all current E-MU Drivers and PatchMix software.2.  Download the E-MU_Windows_10_Install.zip file from   https:\/\/1drv.ms\/u\/s!Ar-KCv7xikVOh23zeXTESuD8k2ih.3.  Extract the zip file to a folder on your main Windows 10 drive and call it---> \"temp\". (C:\\temp4.  Install the EmuPMX_PCDrv_US_2_30_00_BETA drivers 5.  RESTART INTO SAFE MODE by holding the shift key when clicking on Restart. 6.  Choose Troubleshoot, Advanced Options, Start-up Settings and click Restart. You will later be prompt with safe mode restart option. Select option 4 in Safe mode.7.  Once in safe mode right-click on the start button and open Windows PowerShell (Admin).8.  Type into the PowerShell window --> \"cd c:\/temp\/EMU_Driver_Fix\"   or you can right click with your mouse to run the script run with help ofWindows PowerShell (Admin).     *Note: On some systems Windows 10 1903 has another security layer even in safemode that forbidd you to run unkown scripts and code.You get then a confrimation message if its okay to run the selected script \"EMU_Driver_Fix\".  Select \"yes\" and then the script will finally run for you.  This a modified version of ClubHouseKey's script. This will replace our windows files with the new updated files.*Note: Performing this step in a normal Windows environment will either cause the script to not run at all due to script settings within Windows or some files will not get overwritten because they're in use.9.  Restart Windows as normally and then install the EmuPMX_PCApp_US_2_20_00 PatchMix Software.You should now have successfully installed your E-MU Audio Interface and everything will and should work as normal.Extra ASIOx64 driver10.  If you plan to use the ASIO x64bit driver in a x64bit DAWs like Cubase Pro 10, Studio One, Pro Tools, Sonar and other x64 environments.Click on \"Start\" and type \"regedit\" in the search bar and click on \"Registry Editor\" to run it.11.  Go to    HKEY_LOCAL_MACHINE\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows\\CurrentVersion\\Run 12.  Right-click \"AsioThk32Reg\" and choose Modify. 13.  Change \"CTASIO.DLL\" to \"CTASIO64.DLL.\"I hope this guide helps everyone that wants to keep their 1212m\/1616m running in Windows 10 1903.Big thanks to ClubHouseKey and Martin,Producer at Sherwood Sound Studio that found this solution for us all.You can find and follow updates of this driver here!https:\/\/www.kvraudio.com\/forum\/viewtopic.php?t=529349I hope this helped you all to make the installation of the new driver easy and informative for everyone.Best RegardsFreddiePerfection...thank you SO MUCH !!! 1212 working better than it was in Build 1809, which was far more painful a process to accomplish--- JodyMo Digital Audio-Video Productions"]},{"symptom":"Windows 8        Hi I had my hp laptop for about 5 years and I have just reset it back to factory setting. It's now saying the product key is not working for windows 8 and i dont have the key for it. It wants me to buy another what can I do ? Or where can I find it Thanks ","solutions":[]},{"symptom":"activation of product key        You have 30 days after installing Windows to activate it online or by telephone.So according to this how to activate my product key via online or telephone","solutions":["Activate Windows 7 or Windows 8.1 - Windows Help - Microsoft SupportWhen you begin activation, Windows will try to use your Internet connection to activate online. If you have problems activating online, you can activate using the phone.\"How to Activate Windows 7 by Phone\"http:\/\/www.sevenforums.com\/tutorials\/18715-activate-windows-7-phone.html"]},{"symptom":"My keyboard and pointer stop working        My keyboard and pointer stop working on my surface pro 4. Please help to solve this problem!","solutions":["Hi ShirishJoshiSJ and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps on how to troubleshoot your Surface pro 4 keyboard and pointer. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/448682...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Hi ShirishJoshiSJ, Have you tried cleaning the contact points at the center of the Keyboard connecting the Surface?- For this, use a cotton ball and with 95% isopropyl alcohol solution. - After cleaning both contact points let it dry for a couple of minutes before re-attaching both surfaces again.I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"English (United States) keyboard layout keeps appearing        Hello there , So i have an issue with the keyboard layout , it not a huge problem but it's time time consuming ,so to get you in the picture , i'm using windows 10 in english and for the keyboard layout i choosed french ( azerty) , but everytime the system keeps adding the us english (qwerty) layout  by it self and it's annoying , and to fix the problem i just enter the language preferences and delete the us keyboard , now it returned and i can't remove it when i enter the language preferences i only find the french and arabic is there is a way to fix this problem ? ***Modified title from: Issue with the keyboard layout***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that English (United States) keyboard layout keeps appearing automatically. I’ll certainly help you with the steps to remove it.  I would suggest you to refer the steps mentioned below and see if you are able to remove the language pack: Type command prompt in the search bar on theTaskbar.Right click on the command prompt icon and selectRun as administrator.Now, paste the following command and hit Enter:lpksetup \/u en-US.Restart the computer.  Let us know the results. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"8007001F-20006 error when updating from Windows 7 to Windows 10        Despite successfully upgrading to Windows 10 from my Windows 7 PC using the initial \"free upgrade offer\", and in doing so acquiring a valid Windows 10 Licence, I have since been unable to re-install Windows 10 after returning back to Windows 7 using the roll back feature.  Using the Download Tool, I have made many attempts to upgrade my PC using both the Update Now feature and the Create Installation Media feature, all of which fail during the installation with a 8007001F-20006 error.","solutions":["Hi Jonathan, Thank you for writing to Microsoft Community Forums. I appreciate the efforts taken by you in resolving the issue. I understand that you receive an error, ‘0x8007001F - 0x20006’ when trying to upgrade the computer to Windows 10. However, we would like to know the make and model of the computer that you are using. I would suggest you to unplug all the external devices except from Mouse and Keyboard and try the following steps. Hardware clean boot: I suggest you to follow the steps mentioned below and disable the devices is Device Manager: Press Windows key + R. This will openRun. Alternatively, you can go to Start and search for Run.In Run dialog box, type devmgmt.msc and hit enter.Now, expand Display adapters, Printers, Sound, video and game controllers one by one.Right click on the devices inside the section and click onDisable device.If asked for restart click on restart later and disable all the devices.Close the device manager window. Once all the devices are disabled, you can perform clean boot. Performing a clean boot will start the computer with minimal set of drivers and programs, to determine whether a background program is causing the issue. Some of the Startup programs will not load after performing a clean boot on the computer. However, that functionality will return when you reset the computer to start normally after finishing the troubleshooting. To perform a clean boot on the computer refer to the article How to perform a clean boot in Windows.  After performing clean boot, proceed with the installation.  Note: Please refer the section Reset the computer to start normally after clean boot troubleshootingto boot the computer in to normal mode after troubleshooting. Delete the previous installation files: Follow the steps to delete the previous Windows Installation files. Press Windows + E key to open file explorer.Now open C drive and click on View on the top of the window.Now click on Options and select theView tab under Folder options window.Now click on the radio button Show hidden files, folders, and drivers.Click on Apply and OK.Now delete the $Windows.~BT & $Windows.~WS folders.  If you face any permission issue, run the below commands in command prompt to delete the folders. Open Start Menu and type CMD.Right click on it and click Run as administrator.Now run the following commands: takeown \/F C:\\$Windows.~BT\\* \/R \/A icacls C:\\$Windows.~BT\\*.* \/T \/grant administrators:Frmdir \/S \/Q C:\\$Windows.~BT\\Once the command is executed run the below command:takeown \/F C:\\$Windows.~WS\\* \/R \/A icacls C:\\$Windows.~WS\\*.* \/T \/grant administrators:Frmdir \/S \/Q C:\\$Windows.~WS\\Once the command is executed type exit to close the command prompt window. Also, if you are using a security software, I would suggest you to try disabling the anti-virus program temporarily. Note: If you disable the security software or firewall, the system might be temporarily exposed to security threats and risks. Please make sure to turn it on after performing the steps. You can also refer the steps mentioned in the article Get help with Windows 10 upgrade and installation errors.  Let us know how it goes.  Regards,Nikhar KhareMicrosoft Community - Moderator","Hello Nikhar Khare,Thank you for your suggestions posted on the 31 December 2019 in reply to the problems I've had in trying to upgrade from Windows 7 to Windows 10.I have followed your instructions to the letter but keep getting the same error.For your information, my PC is a Toshiba Satellite C855 1GP Laptop running Windows 7 Home Premium SP1.I would be grateful for any further help in resolving this issue as I'm not going to be able to continue using my PC after the 12 January 2020.Kind regards,Jonathan Beazer","Hi Jonathan, Thank you for replying. I certainly appreciate your efforts in trying to resolve the issue by following the troubleshooting steps. However, to identify the root cause of the issue, let’s try running Setup Diagnostic tool which will look for the exact reason of the error. Refer the articleSetupDiag and share the log files after running the tool. To share the log files, upload the files in OneDrive and share the OneDrive link. We await your response. Regards,Nikhar KhareMicrosoft Community - Moderator","Hi,I have tried several times upgrading to windows 10 from windows 7 Home Premium OA and I keep getting this same error, 8007001F-20006. I've updated all my drivers, done all windows updates. I have also done this suggestion. My laptop is an Asus K53E.Please Help   "]},{"symptom":"Paid for Forza Horizon 4 Standard        I just paid for Forza Horizon 4 Standard Edition,after going through 3 different e-mails not being able to verify them because my old Phone number is in use,and I have to wait a month for the 'security' settings to change to an alternative e-mail.I wonder, if I buy a game on a hacked e-mail, the only thing that can happen is the actual owner retrieving the e-mail that belonged to him\/her..So, what's the point? I just want my game.Anyway,The 69,99€ has been removed from my bank account and I do not see my game anywhere in:- All- In progress- Returned\/Refunded- Digital - PhysicalMicrosoft sucks, I hope it's just a delay with the Microsoft Store to update my game onto itThanks for nothing but a bunch of stress with your bs verify security bsEdit: I went through some info\/help about orders not coming through...You make me go through too many steps, just to find out I have to cancel my order, and wait 7-10 days for it to be accepted.Not to mention I can't even cancel my order because my order didn't go through?But my 69,99€ has been removed from my bank lol.Great system for a billion dollar company, how about you stop trying to be different and buying games so only you can sell itand leave the game selling to Steam eh Microsoft?","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand how difficult it could be when you can get the purchased item. I would like to inform that you have reached the Windows Technical support forum, where we provide assistance and troubleshoot on technical issues. However, we do have a dedicated team for issues related to Store purchases, who will be able to assist you with the appropriate details, let me point you in the right direction. I would suggest you to get in touch with the Microsoft Store support team and check if the purchase is still under pending status. Alternatively, you can also get in touch with the respective bank and check the payment status. I hope your query gets resolved at the earliest. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Installation of Windows update fails at 99%                    Windows 10 Update Install fails at 99%.  I did the install trouble shooting with no success. Tried to install again as suggest,  Fails at same point.  HELP!!!!***Modified title from: Windows 10 Update ***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that installation of Windows update fails at 99%. I’ll certainly help you with the issue. However, please let us know: How are you trying to update Windows?Do you receive any error message\/code?What are the troubleshooting steps you have tried so far?Which build version of Windows 10 is installed on the computer? To check type:winver in the search bar on the Taskbar and hitEnter.  Meanwhile, I would suggest you to try running the Windows Update troubleshooter and see if that helps. Refer the articleWindows Update Troubleshooter.  If you still face issues, you can try resetting the Windows update components. Please refer the article onHow to:Reset Windows update components in Windows bySumit.  If the issue persists, I would suggest you to refer the troubleshooting steps mentioned in the articleTroubleshoot problems updating Windows 10 and see if that helps. Note: The last step in the article talks about performing a clean installation of Windows. Please do not perform a clean installation. Note: While performing chkdsk on the hard drive if any bad sectors are found on the hard drive when chkdsk tries to repair that sector if any data available on that might be lost. Let us know the results.  Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Application Error in Word or Outlook when browsing network Drive - Faulting module name: Windows.UI.FileExplorer.dll        Hi. Recently a number of computers I manage have begun experiencing Application Errors from both Word and Outlook when browsing a network drive. This is happening intermittently, but frequently.For Word, it can occur when selecting a network drive location to save or open a file, and for Outlook, it is when selecting a file attachment from the network drive. In both instances, the office application closes down. In word, there is no recovery file.All computers are running Windows 10 with all latest updates installed. I have installed the latest round of Office 365 updates and the issue is still occurring.  eg Microsoft Outlook for Office 365 MSO (16.0.12325.20144) 32-bitI have run an online repair for Office, issue is still occurringExample event logs below:Faulting application name: OUTLOOK.EXE, version: 16.0.12228.20290, time stamp: 0x5dda2fdeFaulting module name: Windows.UI.FileExplorer.dll, version: 10.0.18362.449, time stamp: 0x5dac51b9Exception code: 0xc0000005Fault offset: 0x0000553aFaulting process ID: 0x1cf0Faulting application start time: 0x01d5b0b86f6df70dFaulting application path: C:\\Program Files (x86)\\Microsoft Office\\root\\Office16\\OUTLOOK.EXEFaulting module path: C:\\Windows\\System32\\Windows.UI.FileExplorer.dllReport ID: 0a384a25-69ff-41d3-925a-6d85f41f3330Faulting package full name: Faulting package-relative application ID: Faulting application name: WINWORD.EXE, version: 16.0.12228.20290, time stamp: 0x5dda254bFaulting module name: Windows.UI.FileExplorer.dll, version: 10.0.18362.449, time stamp: 0x5dac51b9Exception code: 0xc0000005Fault offset: 0x0000553aFaulting process ID: 0x2cd4Faulting application start time: 0x01d5b0b54a8e8a57Faulting application path: C:\\Program Files (x86)\\Microsoft Office\\root\\Office16\\WINWORD.EXEFaulting module path: C:\\Windows\\System32\\Windows.UI.FileExplorer.dllReport ID: 7682ffc6-9f54-497a-ab0a-8e153c81a74fFaulting package full name: Faulting package-relative application ID: Any ideas on how to troubleshoot if this is a local PC software issue, or if it is potentially being caused by either the network or Windows Server?","solutions":["Hi DavidAdamson2 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by a Windows Support, so it is safehttps:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes. I will keep working with you until it's resolved.Thank you!","Hi Joseph. Thankyou very much for offering to help.I have followed the steps in the article, and it resulted in not finding any integrity violations. Please see below:C:\\WINDOWS\\system32>DISM.exe \/Online \/Cleanup-image \/Restorehealth Deployment Image Servicing and Management toolVersion: 10.0.18362.1 Image Version: 10.0.18363.535 [==========================The operation completed successfully. C:\\WINDOWS\\system32>sfc \/scannow Beginning system scan.  This process will take some time. Beginning verification phase of system scan.Verification 100% complete. Windows Resource Protection did not find any integrity violations.","Hi all,Same error here on 3 PCs - all completed DISM and SFC checks with no errors - all 1909 Win10Pro.Same Faulting module name: Windows.UI.FileExplorer.dll but with Excel.exe.Same network drive access symptom.What are next steps?"]},{"symptom":"Error Code 10: This device cannot start. For Trusted Platform Module 2.0        My HP Envy laptop x350?. The TPM has an error code 10.  This device cannot start.   Can I delete it and will it auto reinstall and fix the problem?***Modified title from: Trusted Platform Module 2.0 ***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that TPM 2.0 shows an error code 10 in Device Manager. I’ll certainly help you with this issue. However, please let us know: Are you aware of any changes made to the computer recently?What is the complete model number of your HP Envy laptop? As per the error Code 10 \"This device cannot start. (Code 10)\", we will need to manually update the drivers. For more information, seeError codes in Device Manager in Windows. To update the drivers, refer the steps mentioned below: Press Windows Logo key + X, and selectDevice Manager.In Device Manager window, expand Security devices.Right click on Trusted Platform Module 2.0 and selectUpdate Driver.Restart the computer.  Alternatively, you can visit the computer manufacturer’s website and check if there is any BIOS update available. However, we recommend that you check with your motherboard manufacturer regarding BIOS update. Note: Modifying BIOS\/ complementary metal oxide semiconductor (CMOS) settings incorrectly can cause serious problems that may prevent your computer from booting properly. Microsoft cannot guarantee that any problems resulting from the configuring of BIOS\/CMOS settings can be solved. Modifications of the settings are at your own risk. Let us know the results. Regards,Nikhar KhareMicrosoft Community - Moderator"]}]}