{"windows":[{"symptom":"Can't get Windows 7 to connect to wired internet        I had a modem\/router combination that went bad.. I have replaced it with a D-Link modem and a NetGear router. I have them both set up and working fine.I multi-boot Linux and Windows 7 and use wired internet access. When my old setup (modem\/router combo) was running, all my OSes had internet access. Now with my new network all the Linux OSes have internet access but I haven't been able to connect with Windows 7 whereas it was connected on the old system. I have tried downloading drivers and installing them but that didn't help. I have even went so far as re-installing Windows 7 but it still doesn't connect. I am far from a network guru. When trying to get Win 7 connected, I have gotten to the point that it was wanting my id and password that my ISP gave me. I input that but it didn't connect. I tried the ID and PW for the modem and that didn't work either.I am wondering if maybe there is a setting in the modem that needs to be enabled  or changed. Maybe someone more knowledgeable about networking would have some suggestions that I could try?Thanks,hwms43","solutions":["Hi hwms43,but what is the error message you receive from Windows when you try to connect with Windows 7?Try running the Troubleshooter.If you prefer, post the screenshot.Have you already tried to connect with your PC directly to the modem bypassing the router?https:\/\/support.microsoft.com\/en-us\/help\/10741\/windows-fix-network-connection-issues","When trying to connect my computer goes to 'Connect Broadband Connection'. There I put in the id and pw given me by my ISP. That returns \"error 651: The modem has reported an error\".The troubleshooter did no good. It couldn't find the problem and suggest that I look online to find a solution. Since I am not connected to the internet in that install, that is impossible. I have not tried to connect with my pc directly to the modem and bypassing the router. I have two or three other OSes on this pc that have no problem connecting to the internet.When I log into the Windows 7 os the resolution is not correct. Everything is huge and the start menu is just about off the desktop to the left. I re-set the resolution to be smaller and the next time I boot it is still huge. But that is another problem","Hi hwms43,run the network reset commands as described in the guide I posted to you previously.","Hi hwms43,run the network reset commands as described in the guide I posted to you previously.I will do this and post back what happens. Thanks","I ran the network reset commands as administrator.netsh winsock reset - oknetsh int ip reset - okipconfig \/release - \"The operation failed as no adapter is in the state permissible for this operation\"ipconfig \/renew - \"The operation failed as no adapter is in the state permissible for this operation\"ipconfg \/flushdns - \"Gigabit network connection adapter is experiencing driver - or hardware - related problems\" Detected","If you use VPN software try to uninstall it temporarily and then try again.Go to Device Management> network adapters, post the screenshot","If you use VPN software try to uninstall it temporarily and then try again.Go to Device Management> network adapters, post the screenshot","Hi hwms43,what is the exact model of your D-Link modem?And what is the version of the driver currently in use of the Intel (R) 82574L Gigabit Network Connection network adapter?","Right-click on the Intel 82574L Gigabit Network Connection in Device Manager and report the \"Device Status.\"Until I see what is reported there, my guess is that you need to install a driver for this device.  If you have a brand-name computer, you should go to the computer manufacturer's support web site, enter your computer's serial number (or Dell Service Tag) and then download the driver appropriate to your edition of Windows.  Otherwise, go here: https:\/\/downloadcenter.intel.com\/download\/18713\/Ethernet-Intel-Network-Adapter-Driver-for-Windows-7-?product=32210While you are in Device Manager, you should also expand the \"Other devices\" section and list what you see there.  This may shed some light on your other issue:  \"When I log into the Windows 7 os the resolution is not correct. Everything is huge and the start menu is just about off the desktop to the left.\"","Device status says: \"Device cannot start (code 10)\"I have previously downloaded and installed \"Prowinx64legacy.exe\"Attached is a picture of 'other devices'."]},{"symptom":"Unable to rip music to mp3 (but WMA works fine!)        Hello,Windows 10 media player is refusing to rip a CD to MP3. I've tried all the stock suggestions on multiple  similar posts:Error correction is turned on for the CD\/DVD drive in Media Player.There's a valid folder for it to rip to (have tried 2 separate drives, includng C:).Have tried increasing quality to maximum for MP3.None of this has any effect; I still get the error message:Windows Media Player cannot rip one or more tracks from the CD. If I turn the file format to WMA, then I can rip fine (but I don't want it in WMA format).Suggestions? I've seen posts on non-microsoft forums that suggest an MP3 codec might be the issue but that seems... odd when it plays mp3s just fine. Not sure where I would get a legitimate one either?Thanks in advance!","solutions":["Just to check what version and build of Windows 10 do you have, also check media player. Mine is 12.0.18362.418.To check you version of windows type winver in Search and select the top result.Post back the full version and build.","In addition try re-installing Media Player, bottom of the link page.https:\/\/support.microsoft.com\/en-gb\/help\/14209\/get-windows-media-player","WIndows 10 Pro version 1903, OS build 18362.535I can't find the full info for Media Player, the help menu where I'd expect to find this information doesn't seem to exist... I can only find e.g. \"help with\"... options that link to webpages.","You have to press the Alt key to get the menu but it looks like you should be on the latest version anyway.Did you see the link for reinstalling WMP.If that doesn't work then system file scans would be my next suggestion.Method 1: Run DISM tool and check the issue. Please follow these steps:a. Press Windows + X keys and click command prompt (admin). Or PowerShell (Admin).b. Type the following command in command prompt and press Enter.DISM.exe \/Online \/Cleanup-image \/Scanhealthafter the scan is complete type the following and press EnterDISM.exe \/Online \/Cleanup-image \/Restorehealththen use method 2.Method 2: System file checker is a utility in Windows that allows users to scan for corruptions in Windows system files and restore corrupted files.Run system file checker (SFC) and see if it helps. Please follow these steps:a. Press Windows + X keys and click command prompt (admin). Or PowerShell (Admin).b. Type the following command in command prompt and press Enter.sfc \/scannowAfter completing the scans restart using Start > Power > Restart.","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. MP3 Codecs are already included in Windows Media Player. Please try another Audio CD\/DVD and check if the same happens when you Rip the CD\/DVD is MP3 format.If this is only happening with this Audio CD, then there might be some issue with the Source data of the songs and you may need to use a different Ripping program.","Tried reinstalling WMP, no joy. Version 12.0.18362.418.Tried a different CD as well, same problem (figured there can't be anything wrong with the CD if it rips to WMA happily, but worth checking).Will try the filesystem cleanups tomorrow - I suspect it'll take a little time to run.Thanks.","Completed the filesystem scans - still not working. Tried a few other file types, and apparently they all work except for MP3. It has to be something specific about MP3 file formats...","I've just tried to Rip a audio CD to MP3 and it works no problems. My Audio Quality is set to the default (I assume) at 192Kbps.Running Windows 10 Home version 1909 18363.535, WMP same as you.","I have not found a commercially made music CD that I could not rip to MP3 with Windows Media Player.Full disclosure: I have not purchased a commercially made music CD in years, and the last time I ripped with WMP (in Windows 10) was several years ago, when I converted my remaining CDs to digital format. Now, the only thing ripped around here is me, but that's different. 😁"]},{"symptom":"recover from crash        Hello. Trying to recover from a disaster. Win 10 computer became infected or crashed hard to tell. Would not boot. Got new drive to replace sys drive (c:) . Microsoft tech support helped me create (on my laptop which incidentally is also dead now) a bootable ISO Win 10 image on a thumb drive. I used that to do a clean install on this c: drive. Great. But now I have zero applications.  All those (data too)  is on my original c drive.  I need to figure out how to move or reinstall all of those to my new c drive???Data probably a simple copy but applications like office 365 and photoshop cloud and Norton and mozilla and so much more. Is there any help out there? Oh and I am a bit leery of putting the old c dive in as I dont know if it is infected or not.TIAGeorge","solutions":["Go to Norton and get their removal software and completely remove it.  All you need is Windows Defender and Malwarebytes.","Hello George, I am Andrew an indpenedent advisor. Each of the programs you listed needing can be downloaded for free from the company websites.Office 365 can be found at office.com. log in to your account and will let you download the version you own.Norton, adobe, firefox can all be downloaded on their sites.You dont need to put your old drive in to get these. Personal information, such as photos and document, on the other hand yes you will need to.","Andrew yes that makes sense for some apps.  Right now I'm trying to get data back from the old sys c: disk but the OS does not see it.  Comp management does see it as 1800GB of unallocated space. I've got it hooked as an external USB.  I'm not sure how to regain that space without destroying all the data? Thanks","Are you seeing the drive itself in the File browser? If so it should have a drive letter.You said this drive got infected and then wouldnt boot so if its not showing up there its possible the drive was corrupted and not infected.If its not in the file browser check drive manager. Right click the start menu to bring up the drive manager. See if its in there. Let me know what youre seeing and where","Andrew - It is not in the file manager.  It is in the disk management window as Disk1 - an 1863GB unallocated disk.  Disk 0 is my newly installed 3TB drive with 3 partitions - Recovery at 529MB, EFI system as 99MB and 2794GB NTFS.Thanks for hanging with me.  I'm thinking next thing to do is download one of the programs I found thru google which purport to get data back from an unallocated drive. ","Are you able to right click the old drive in Drive Manager and assign it a letter?","Andrew - Sorry I've been fighting other fires.No I cannot assign a drive letter.  It reads as a Basic Online 7GB healthy GPT protectivepartition.","Andrew - Sorry I've been fighting other fires.No I cannot assign a drive letter.  It reads as a Basic Online 7GB healthy GPT protectivepartition.Here's a screen shot of disk mgt"]},{"symptom":"minecraft pc and ps4        if I own Minecraft on ps4 then does that mean I can use that account to play Minecraft on pc because Minecraft ps4 has bedrock edition now","solutions":["Unfortunately not unless the game specifically states it is multi-platform edition.You would have to repurchase the Windows edition if you wished to play. There is a workaround in that you can download the Playstation 4 remote play, this allows you to play the PS4 version on Windows as the software connects to your PS4.https:\/\/remoteplay.dl.playstation.net\/remotepla...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Please do not download any repair tool which is offered by this site other than the ones I mention\/recommend..Thoroughly research any product which is mentioned here before you decide to download and install it."]},{"symptom":"Computer login        Windows log in using windows hello photo is refusing as a previous user name on my computer had used this type of sign in security. That user is deleted off my computer and off Microsoft so why does it still say that type of security is already in use?","solutions":["Hi, Thank you for writing to Microsoft Community Forums We understand your concern as you are having difficulties in setting up picture password on the PC.In order to get clarity and to assist you accordingly, please reply with the answers to the questions below. What is the Windows 10 version and Build (1903\/1909) installed? (Type winverin Windows search\/Run command)Does the PC configured with multiple user accounts?What is the exact error message you are getting? Meanwhile, we would suggest you to create a local user account with Administrator privilege on the PC with a password (do not convert it to Microsoft account) and then try setting up the picture password for this account. Refer this article toCreate a local user or administrator account in Windows 10. Let us know how it goes. Aditya RoyMicrosoft Community – Moderator","My windows version is 1903.The error message is the following: Sorry,something went wrong.It looks like you've already set up windows hello on another account. Remove face recognition from your other account and try again.The other account has been deleted from my PC and from Microsoft so I do not understand why this error is occurring.Any further ideas?I did not understand how to open a local user account using administrator privilege??","I have got it working now. thanks"]},{"symptom":"DLL not working        A while ago I updated me pc to a newer version of windows 10 because it said my current type of windows 10 would stop getting support or something next to my icons in the bottom left. Recently I tried to play a game which used msvcr120.dll to run, and it didn't start. It said that the dll was 'either not designed to run on widows or it contains an error'. I did play the game very close to the update and it worked fine before. After the update it was broken but I hoped that it would be corrected  in a later update but at this point it has been about half a year and nothing has changed and I don't know what to do. I have looked online but no-one seems to have the same error as me. The error code is 0xc000012f.","solutions":["Hi Therealbean That error is generally caused by one of the Visual C++ Redistributables on your PC, in this case it is the 2013 version of that redistributalbe, then best option is to download and re-install that from the link below:https:\/\/support.microsoft.com\/en-us\/help\/297700..."]},{"symptom":"Windows 10 corrupted?        Hi all, Recently I have a problem with windows 10, it's a long one so sit tight. On Saturday, I just got back to my dorm, booted up my laptop as normal, everything seemed normal so I just went to have a shower while its loading up. When I got back to it, I noticed everything starts acting really slow and so I open task manager to check what's happening, but it is frozen, and when I closes it, it crashed. I have no access to the Internet for some reason, and I have no access to settings or the search bar, not responding. I went ahead and contacted a person for support, rolled back the version or whatever and seemed fine. The next day, I did the same thing, but just watched it instead of taking a shower, all the problem comes back, same thing again, did a file scan and said no corruption. So now I'm backing up my laptop for a factory reset, can anyone tell me what's the problem and how to prevent? Specs:Laptop-Rog Strix Scar II (Gl_504GW)Cpu:Intel i7 8th genGpu:Nvidia RTX 2080Ram:12gb","solutions":["Hi WavedCell. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.If any steps cannot be performed normally then try them in 1) Safe Mode with Networking (so you have internet) or 2) Safe Mode accessed by one of the illustrated steps in this guide:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf.... You will need to use your password to get into Safe Mode as a PIN is not accepted.1) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 2) Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.3) If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... -------------------------------------------- But remember that in Windows 10 everything depends upon the quality of the install, and Factory or Upgrade installs are inferior installs which most enthusiasts won't even run because they'd expect endless issues. Consider now or later doing the Clean Install in this link which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... There is also an automated Fresh Start that reinstalls WIndows while shedding corrupting factory bloatware, saves your files, but doesn't clear the drive to get it cleanest:https:\/\/www.howtogeek.com\/265054\/how-to-easily-... I hope this helps. Feel free to ask back any questions and let us know how it goes. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Registry Cleaning tools         I have  been a long time user of certain utilities that automate the general health status of the PCThis includes such cleansing as unnecessary file removal - registry cleaning - bleaching of free space among others.Now I find that enhancement of such application may not include registry cleaning in the future.As the application performs its tasks I observe the numbers of registry issues it appears to resolve.I am now wondering ? Is this all gimmickry? If it is no longer done by this third party app then what ultimately happens to the registry?Will it become corrupt?Does W10 require this level of maintenance?Are there Microsoft tools embedded or available to carry out these tasks - if indeed they are necessary at all.It just feels a bit fake that I have believed that I was doing the right thing for a long time but now the \"experts\" at \"******\" are implying it is not necessary.They didn't say that when they sold it to me - very much the opposite.Was it ever necessary ?Do Microsoft endorse such cleansing.","solutions":["Hi JustWilliammm registry cleaners have never been necessary or a good idea, the potential for causing serious damage is greater than the benefits they claim.it is good to know that the developers of this type of snake oil are realising that people are now aware of the risks.Microsofts policy on the use of registry cleaners https:\/\/support.microsoft.com\/en-gb\/help\/256325....","[1] Is this all gimmickry? [2] Was it ever necessary ?[1] Completely![2] Never.[Does] Microsoft endorse such cleansing?Let's ask them: Microsoft support policy for the use of registry cleaning utilitiesFull disclosure: In my earlier days of being a computer user, there was no cleaning or optimizing tool I did not try. I loved 'em all. Here's the insidious thing about this software: Very often, when you use it, it seems like you're doing something good for your computer, or at the very least, it doesn't seem like you're doing any harm. But you very well may be doing harm, by making unsupported changes to your configuration, only you might not realize that until next month, or next year, or the next major update, when all of a sudden, for no reason at all, your computer starts acting weird, or crashes, or becomes totally unusable, because of an unsupported action taken by your cleaner\/fixer\/optimizer long ago. And by this time you have no idea what is causing the problem or how to fix it, if it's even fix-able.And then some people make raving, foam-at-the-mouth posts here about how Microsoft destroyed their computer, and where can I find a lawyer, etc. when they had it coming all the time.","Why you should not use Registry Cleaners and Optimization Tools","Many thanks for your reply.All very enlightening - as is the other responses I have had to this topic.The advice is overwhelmingly against the practise - and I respect these opinions coming from community members offering their advice and experience for free - not to mention Microsoft themselves.","Many thanks for your reply.All very enlightening - as is the other responses I have had to this topic.The advice is overwhelmingly against the practise - and I respect these opinions coming from community members offering their advice and experience for free - not to mention Microsoft themselves.Interesting that you appear to be from the same stable in that you have tried lots of these optimizers over the years.I take it from your text that you no longer subscribe to any idea of registry cleaning or indeed any other automated cleaning tools.If I am to follow your lead and dispense with such utility programmes there is still surely some attention required to maintenance - example - clearing temporary files,  bleaching etc. It's not like we are going to run out of disk space these days so I wonder if any of it is necessary ?De fragging was an issue that I remember from early years that was a popular fad that did appear to have a positive effect on performance - or is it that NOT defragging would eventually lead to poor performance. I believe that was a Microsoft feature then - but having become a slave to this utility cleaner idea doing everything I wouldn't know if it still exists.I am aware that there are cautions wrt to SSD's but  where the more  traditional hard disks are concerned I presume they still periodically benefit from defragging  -  or do they ? Many thanks for jump starting my brain - I will continue to  do more reading.","Many thanks for your reply.All very enlightening - as is the other responses I have had to this topic.The advice is overwhelmingly against the practise - and I respect these opinions coming from community members offering their advice and experience for free - not to mention Microsoft themselves.Many thanks for jump starting my brain - I will continue to  do more reading.","... there is still surely some attention required to maintenance - example - clearing temporary files,  bleaching etc. It's not like we are going to run out of disk space these days so I wonder if any of it is necessary ?Windows and hardware in general has advanced to where very little regular maintenance is needed, if any at all.Just so you know where I'm coming from: I used to follow a detailed regimen of maintenance procedures that took many hours to complete. And I used to do this every week. It's no exaggeration to say that I spent more time maintaining my computer than actually using it. Very little of that obsession remains. (I'll tell you what remains later.) Let's go over some of what I used to do, and I'll explain why it's not necessary.RAM: I used to run Memtest64 - a popular memory tester. Today's RAM is so reliable and sophisticated that the chances of coming across defective RAM modules are less than negligable.Hard Drive:  I used to defrag the c**p out of my hard drive until my Diskeeper interface looked like a stack of colored Legos. Even then all that defragging was unnecessary, and I definitely spent more time defragging that I could possibly save over the drive's lifetime by doing that much defrag.Today's HDD hardware is much more robust than in earlier HDDs and the firmware is much more sophisticated. Years ago PC professionals started discussing whether defragmentation was needed at all. Today we know that defragging beyond what little Windows does on its own is completely unneeded.For the same reason, there's no need to run CHKDSK or any of the other 'disk health' utilities that are still being marketed today.SSDs, of course, work completely different from HDDs, so none of the HDD procedures apply. Defragging, in particular, is an excellent way to shorten the life of an SSD.For years, HDDs and SSDs have been shipping with an industry standard utility called S.M.A.R.T. which continuously monitors the drive for signs of impending trouble. S.M.A.R.T. will alert you in the very unlikely situation that your drive may have a problem.Clearing caches: A cache, by that name or any other name, is simply a place where files created for temporary use are stored. After their temporary need is fulfilled, they are useless. Like empty drinking cups. They do absolutely no harm to your computer. Sure, they occupy space on your hard drive, but it would take many years of accumulation before you run out of drive space due to caches. And since Windows clears caches on its own, you'll never get to that point anyway.From time to time, you may need to clear your web browser's cache - but that isn't a maintenance procedure. Since browsers check their caches for web content to avoid downloading the same thing twice, you'd clear that cache if you want your web browser to get a new copy of the page.And that was only the tip of iceberg for me. I was just getting warm.If there was ever a time when all that maintenance was a good idea, that time has long gone. For today, here's the unvarnished, unpleasant truth: There are people who still haven't learned how to operate their computers correctly, so they cause themselves all kinds of trouble. Instead of learning how to use their computers, they run to fixit\/cleaner\/optimizer utilities, which won't save them from themselves and are only likely to make a bad situation worse.So what's my remaining obsession? I still like to have only the absolute bare minimum of software that starts with Windows. Here's my Startup tab from Task Manager:","Many thanks for that concise account.Quite refreshing.My suspicions were very much in line with you but I just hadn't had the confidence to believe this was the way with modern computers.I do clear my browser history on exit by default - ensuring that any useful links\/information I want is  added to favourites.","Please remember that a computer is not a human, and doesn't need the same kind of maintenance as a human.A human benefits from regular washing and shampooing - not a computer.A human works faster with less to carry around - not a computer.To wean yourself off registry cleaners in a hurry, try this experiment:Install a brand new, fresh, untouched copy of Windows is a virtual machine.Run your favorite registry cleaner on that copy of Windows.Look at all those 'errors' that the registry cleaner found! How dare Microsoft include so many errors in abrand new copy of Windows!Now restore that same, brand new, pristine copy of Windows in the virtual machine, and run adifferent registry cleaner on Windows. Holy cow! Look at all those 'errors' in the registry! What's wrong with you, Microsoft? So many errors in a brand new copy of  ... wait a minute.The second registry cleaner found errors that the first registry cleaner apparently missed, and the first registry cleaner found errors that the second registry cleaner missed. How can that be? Should you perhaps try a third registry cleaner as a tie-breaker?On the other hand, if these registry cleaner companies are so smart - smarter than Microsoft, it seems - why don't they write their own registries for us to install? Heck, they should write their own operating system. Or maybe Microsoft should hire their developers for big bucks to 'fix' Windows and put the registry cleaning industry out of business.Or maybe there's something about registry cleaners that is fundamentally wrong?"]},{"symptom":"Windows infinite restart        My windows pc has been having some trouble recently... i am unsure of the cause but its been causing problems from, only booting to the bios, random freezing for two to three minutes and now my pc is stuck on the restart screen. This is after doing a clean reinstall of windows. I think it may have something to do with bit defender but i don’t know. Ive also turned off wake timers... i don’t know what is causing this so I’m trying to give any info on what i think may be causing it. Any help would be greatly appreciated.","solutions":["Hi Arron. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) I would uninstall any 3rd party antivirus in Settings > Apps > Apps & Features and try running only built-in Defender which gives adequate protection, best Windows performance, least issues, and is from Microsoft who knows how to protect their OS best.After uninstalling antivirus in Settings > Apps > Apps & Features, restart the PC, then type Security in Start Search, open Windows Defender Settings, there and in Windows Defender Security Center fix anything that's flagged.If you want the best on-demand scanner download and install Malwarebytes from https:\/\/www.malwarebytes.com\/mwb-download\/ In it's Settings > Protection > Scan Options enable Scan for Rootkits. Then on Scan tab choose Threat Scan and Run Scan. Clean up anything found, restart PC and then run again until it comes up clean. If you want to keep Malwarebytes as an on-demand scanner then you can disable its Real Time trial version in it's Settings > Accounts tab.Next check for damaged System Files: https:\/\/www.lifewire.com\/how-to-use-sfc-scannow... If it cannot repair them see Step 10 here to continue: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... 2) Run a full Disk Check: https:\/\/www.groovypost.com\/howto\/check-hard-dri... 3) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 3) Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.4) If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... 5) If these all fail to correct the problem then it may be caused by boot level code only corrected by wiping the hard drive with Diskpart Clean Command when doing a Clean Install:https:\/\/www.tenforums.com\/tutorials\/85819-erase...http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC because you will learn everything that works best and how to apply it with your own hands.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Insert Images to Answers Forum - Some Screen Capture Tools You can Use        Technical Level : Basic SummaryWindows includes some tools to capture screen information beyond the simple Print Screen.  As well, you can use 3rd party tools for more advanced functions.<PrintScreen>MS Snipping ToolPSR - Problem Steps RecorderMS GamebarTextify3rd Party toolDetailsHow to insert Images on Answers ForumTo insert pictures into the Answers forum you have to do the following:Using your screen capture tool, save the capture to your HDClick on the \"Insert Picture\" button at the top of the input dialogBrowse to find the save imageupload it .Screen Cap(ture) Tools.<WIN><SHF><S>- Snip & Sketch, once called Screen Sketch is Replacement for Snipping Toolhttps:\/\/www.zdnet.com\/article\/windows-10-screen-snipping-tool-microsoft-gives-it-a-new-name-adds-delay-feature\/<snip 2018 09 18>Snip & Sketch is only available to insiders on its skip-ahead track -- that is, the ones testing the version of Windows 10 after thesoon-to-be-released version 1809.users can access the snipping feature by pressing the WIN + Shift + S keys. <\/snip>How to use Snip & Sketch to take screenshots in Windows 10https:\/\/www.digitalcitizen.life\/how-use-snip-sketch-take-screenshots-windows.*******************************************.TEXTIFY – CAPTURE TEXT FROM ALMOST ANY DIALOG BOX!http:\/\/rammichael.com\/textify I (Rohn007) have been using this tool for a while now in Windows 10. It it great. One place I use it a LOT is reporting version\/build numbers..<snip>Have you ever wanted to copy some text from a dialog box which doesn’t provide such functionality?.Textify was created to solve this problem: you can point your mouse over the text, click on the mouse shortcut (Shift + Middle click by default), and get a selectable view of the text.<\/snip>..You just put the mouse pointer on the desired line and hit the keyboard shortcut (ie I tweaked it to be <left mouse>+<Shift>For example, in Programs and Features I can capture this about Office 2010: .<snip>Microsoft Office Home and Student 2010Publisher: Microsoft Corporation, Installed On: ‎2017-‎03-‎18, Size: 49.8 MB, Version: 14.0.7015.1000<\/snip>.Unfortunately this is the initial install version information, but by going to Word 2010 File menu > Help command I could capture the current info:.<snip>Version: 14.0.7177.5000 (32-bit)<\/snip>.Playing around I’ve found it seems to be able to capture a line of displayed text almost anywhere (not just dialog boxes) in many applications, ie in many dialog boxes I was able to capture the setting name and its value.<snip>Distance:0 pt<\/snip>.Which I would tweak for documentation and sharing to be<snip>Distance: 0 pt<\/snip>.Note: in the comments of the Textify web page there is a tweak to allow it to automatically select and copy the text.  In the Textify.ini change the line “auto_copy_selection=” to have value “1”. The change will take effect after you stop and restart Textify..I found that you could capture text not just from dialog boxes but from almost any application text..***********************************.2018 11 26- How to Record Your Desktop Screen Using VLC on Windowshttps:\/\/www.groovypost.com\/howto\/record-your-desktop-screen-using-vlc-windows-10\/Record Your Windows Desktop with VLC, it gets the job done for a quick raw video to a family member or your IT dept, for example.2018 10 16- 9 ways to take a screenshot on a Windows PC, laptop, or tablet, using built-in toolshttps:\/\/www.digitalcitizen.life\/4-ways-take-screenshots-windows-8-81-using-built-tools2015 06 15  6 Ways To Take Screenshots in Windows 8.1 & 10, Using Built-in Toolshttp:\/\/www.digitalcitizen.life\/4-ways-take-screenshots-windows-8-81-using-built-toolsSome of our readers asked us to share all the Windows tools you can use to take quick screenshots of your screen. We’ve done a bit of testing and experimentation and we’ve found six different ways for taking all kinds of screenshots, without using third-party programs. Here’s how to take screenshots in Windows 8.1 and Windows 10.***********************************Note: MS Snipping Tool is being Deprecated as of Version 1809https:\/\/www.zdnet.com\/article\/windows-10-1809-microsoft-reveals-features-its-dropping-in-october-2018-update\/MS Snipping Tool The Snipping Tool has been added to Windows 7\/8.1\/10 an an enhanced PrintScreen feature. You can use the run it from the Run dialog: <WIN><R> Snippingtool, or search for Snippingtool in the start menuThe tool can capture static images of various shapes and you can add simple annotations.***********************************Sharexhttps:\/\/getsharex.com\/I have just \"discovered\" a new (well Version 12.2), free, screen capture tool called ShareX. At first glance it appears to be the best free screen capture tool I've seen. I will be playing with it to see if it lives up to its early promise.FeaturesHere are a few highlights of the features I've seen (so far)Step (inserts numbered \"step\" counters)BlurPixelateSpeech balloonsRecognize text (OCR)Blob emojiCropScrolling CaptureUpload to multiple image handling sources (including OneDrive)Screen Recording MP4, GIF, AVIURL Capture of whole web pagesHere are some other more in depth reviewshttps:\/\/www.windowscentral.com\/sharex-windows-screen-capture-app-could-replace-your-snipping-tool-good***********************************PSR - Problem Steps RecorderThe PSR captures on screen events and screen caps of relevant Window and detailed information about the applications and onscreen elements.  You can save the output and play back the screen caps as a slide showPSR - Win7 & Win8  & Win10 Problem Steps Recorderhttp:\/\/www.howto-connect.com\/windows-10-problem-step-recorder\/http:\/\/windows.microsoft.com\/en-CA\/windows7\/How-do-I-use-Problem-Steps-Recorderhttp:\/\/www.windows10compatible.com\/blog\/using-problem-steps-recorder-in-windows-10\/http:\/\/www.maximumpc.com\/article\/how-tos\/how_use_windows_7_problem_steps_recorder_make_easy_pc_guides http:\/\/msdn.microsoft.com\/en-us\/library\/dd371782%28v=vs.85%29.aspxhttps:\/\/www.youtube.com\/watch?v=z6EgLm3-XcQAn Example of a problem that using PSR solved: “The Cat’s Revenge” - Excel Minimized Permanentlyhttp:\/\/answers.microsoft.com\/en-us\/office\/forum\/office_2007-excel\/the-cats-revenge\/d2a1a6c2-13fe-4187-a2bc-b155dee69b45?page=2&tm=1373855486532#_selfA user posted a question with the following description:Last night when I had an excel spread sheet open the cat jumped on my desk and walked across the keyboard. Immediately the spread sheet was reduced to a thumbnail.  Now all my excel files load but are only thumbnails. The files when copied and transferred to another computer open fine. I have uninstalled and reinstalled office 2007.  But still the problem persists. When I go into the task manager it tells me excel is running fine.  I  have looked at all possible key combinations that might restore the thumbnail to full screen,but nothing works. HELP!!!! Please (Windows 7 computer)The solution turned out to be an application Window opened \"off monitor\" because Windows thought it was a dual monitor setup. All the user had to do was move that application window back onscreen.**************************************** VLC2018 11 26- How to Record Your Desktop Screen Using VLC on Windowshttps:\/\/www.groovypost.com\/howto\/record-your-desktop-screen-using-vlc-windows-10\/Record Your Windows Desktop with VLC, it gets the job done for a quick raw video to a family member or your IT dept, for example.**************************************** MS GameBar <WIN><G>NOTE: On Sept 3 2018 I tried to use GameBar to record video. It didn’t work. YMMVThe GameBar is intended to be used with XBox games played on Windows computers.  But it also may be used to MPEG4 videos.Here are some articles about using the GameBar.2017 03 10- Win10 Game Bar \/ GameBar http:\/\/www.digitalcitizen.life\/things-you-can-do-new-game-bar-windowsthe Game bar lets you record game clips, take screenshots, and even stream your gaming sessions on the internet, for everyone to see.2017 07 00- Record Screen In Windows 10 Without Any Software – XBox App \/ GameBar and VLChttps:\/\/techviral.net\/record-screen-in-windows-10-without-any-software\/**************************************** Other 3rd Party ToolsPersonally I am now using PicPick for my screen capture and annotation tool.  It includes a Blur\/Pixelate feature, although I tend to just use filled shapes to obscure sensitive information.For a long time I used FastStone 5.3, but it could not handle my 4K screen. Alternatives to PicPick for all platformshttps:\/\/alternativeto.net\/software\/picpick\/***********************************How to hide visual clutter on your screen before your next web demohttp:\/\/www.techrepublic.com\/article\/how-to-hide-visual-clutter-on-your-screen-before-your-next-web-demo\/When giving a demo, make sure you keep the focus on your software, site, and message—not your apps, bookmarks, and extensions.","solutions":["This is perfect for what I was looking for. I used to capture screenshot withAcethinker Screen Grabber, free and works quite well. Share it here as an alternative to SNIP.","Major edit:removed obsolete contentadded new content"]},{"symptom":"Cannot connect to Android. Missing Portal Devices and MTP driver        My Android phone is unable to be found in drive.I searched solutions online and tried many ways, which all does not work.I tried to install MTP Porting Kit => not effectiveI tried to find my phone in Device Manger, it is not under \"Portable Devices\" but \"Other Devices\". No \"MTP USB Device\" option!!!I tried to find wpdmtp.inf in Windows\/INF dir => missingI tried to transfer wpdmtp.inf from another working computer => Third party signature, not allowed to installI tried to reddit to path Computer\\HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Class to CTRL+F find \"Portable Device\" => Missing !!I tried to \"Reset this PC\" => same result afterwardsI tried to install these versions of Microsoft Media Feature Pack (1903, 1809Oct, 1803) => This update is not applicable to your computerPlease... hows Windows work with these driver...Why on Earth there is no a suitable isolated patch for this MTP USB hell thing.My Windows version: 19041.1","solutions":["Hi Edgar,If a different cable produces the same results, the answer might be in the last line of the post - Because you are running an Insider build you are seeing the same. Is 19041 the latest slow ring release? Mine fast updated to some 195XX today.","Hi, Can you install the Media Pack using \"Microsoft Optional Features\"?: https:\/\/support.microsoft.com\/en-us\/help\/451639...","tried to install but it said fail...","definitely not a cable issueI failed to change myself to 'Fast' in the Insider settings. It would change back to \"Slow\" automatically.With \"Release Preview\", i dont have a update after a sync.","Fast has more bugs.To achieve maximum stability you would have to reinstall the latest public release like 18363\/1909.","It may be that the Media pack is not available for this build.","So there is no way for me to fix this MTP driver issue?","is there still no wpdmtp.inf in the C:\\Windows\\INF directory?","is there still no wpdmtp.inf in the C:\\Windows\\INF directory? no, cannot find this inf","This is my pc spec & windows specWould this tell why am I being refused to install 'Media Feature Pack'?"]},{"symptom":"maps in windows 10 starts for sec, then disappears        I have a brand new Dell computer running Windows 10, when I click on the MAPS tile in START, the app appears for a sec, then disappears. I have tried all suggested fixes: troubleshooter, latest updates, Update from MS Store - same result. For the sec that it appears, it looks like the app is trying to load maps.","solutions":["Hi, malcolmgoddard My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I have a brand new Dell computer running Windows 10, when I click on the MAPS tile in START, the app appears for a sec, then disappears. I have tried all suggested fixes: troubleshooter, latest updates, Update from MS Store - same result. For the sec that it appears, it looks like the app is trying to load maps.","I'm reluctant to try this solution, worried about side effects. I'm thinking I could try copying the MapData from another computer where Maps works properly?"]},{"symptom":"WINDOWS DEFENDER \"GROUP POLICY\"??        Windows defender wont turn on \"to allow this app to run must contact security administrator to enable program via group policy\" first i thought it was because i had McAfee installed on my computer but after totally uninstalled still giving same message when attempt to turn on. I have Windows 10 version 1607 which needs updated but have to do it on another PC drive stick to transfer onto this PC because lack of storage. Tech Support said the needed updates could be preventing the program from running but i find this hard to believe because my other PC the one i will be using to install updates on drive stick to transfer updates onto this PC is only a Windows 7 and it runs windows 7 perfectly without issues. So if a Windows 7 version is able to run defender why couldnt a Windows 10 version 1607? Especially when the tech made sure he emphasised on \"COULD BE\" . My McAfee is expiring here in a few days & since Windows defender is reliable enough it would be nice & convenient to just switch that on when expired. Can anyone help me PLEASE???","solutions":["When you uninstalled McAfee did you go to McAfee and get their removal software?  If not then you did not remove all of the code.","Hi CourtneyLeever, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.Is your computer part of a company or business network? If so, you should contact your company's tech support team because this may be applied to all company computers for a good reason.If it is a personal computer and not connected to any company network, please see the following article:https:\/\/www.thewindowsclub.com\/windows-defender...* Please do not follow the section about modifying Registry settings unless you are comfortable doing so, because any improper modification can break your Windows installation!Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. It is also important to remove McAfee properly when the time comes in order to ensure all components are uninstalled. You can visit McAfee's guide on uninstalling their products at:https:\/\/service.mcafee.com\/webcenter\/faces\/orac...!Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"Windows Update (Win10x64 Pro Workstation v. 1909) Not Showing Update History...        Not sure why Update History is not being listed, but Updates are apparently being checked for...However, just before this happened, I was checking for updates and it was taking over 10 minutes (never takes longer than a minute) and I restarted the laptop.Tried turning of updates (defering\/pausing them), but still no Update History being listed...Restarted as well...","solutions":["Hi,Did you run the Windows update troubleshooter recently? It sometimes erases the same...FYI The last set of cumulative updates were released last month\/year and the next is scheduled for upcoming tuesday.","Nope, never did that - nor knew about it.Have just started actively using Win10 now - because that is all this workstation supports - would MUCH PREFER to go back to Win7!!!Too many problems, too simplistic...","Hi SuperFlyBoy2 My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help answer your question.What version of Windows 10 does it say if you run Winver (Windows key + R and type winver and press enter)?Have you had a recent Features Update? If so, that would explain the 'missing' updates. A features update installs a new version of windows, replacing your old version and any updates it had. The updates to your previous version are not relevant to the new version. Hope this helps.","Hi SuperFlyBoy2 My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help answer your question.What version of Windows 10 does it say if you run Winver (Windows key + R and type winver and press enter)?Have you had a recent Features Update? If so, that would explain the 'missing' updates. A features update installs a new version of windows, replacing your old version and any updates it had. The updates to your previous version are not relevant to the new version. Hope this helps. Thanks for the reply Jon.Build is 18363.535.No idea on the features update....","A Features Update clears all the history - it's no longer relevant as it applied to the previous version.Some previous cumulative updates have been known to clear the history too. You can however check on which updates are installed in several other ways.In Settings, on the 'View installed update history' page click 'uninstall updates'. There you will find a list of installed Windows updates and their KB numbers or open command prompt as administrator (press Windows key, type cmd, right click command prompt and run as administrator) type systeminfo and the updates are listed as 'Hotfix(s)' by KB number."]},{"symptom":"Windows 10 1903 Update 2019-12 Error 0x800f0831        My PC tells me it has successfully installed all previous updates.  This one will not install and I have tried several times.  What do I do?  I am not a confident tech person!","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command promptDISM \/Online \/Cleanup-Image \/RestoreHealthRun these commands on the command prompt to restart windows update servicesnet stop bitsnet stop cryptsvcnet stop wuauservnet stop msiserverRen C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.old net start bitsnet start cryptsvcnet start wuauservnet start msiserverAfter successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartThis should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","When I said I am not a confident tech person I mean it.  That answer is too daunting and if I go wrong I do not know what I would do.  Is there a different answer?  Simple!Thank you."]},{"symptom":"Windows 10 installation not allowing network connection        So i have a computer that has had a 1 tb hdd hardrive for years, but recently i have upgraded to an ssd and wanted to install windows 10 on my ssd, while still keeping my hdd as extra storage. So i plugged in my windows 10 usb installation usb drive and booted off of that. While in the installation process I used diskpart in command prompt to conpletely clean my hdd, which had windows 10 installed on it. I then proceeded with the dowbload for the ssd and finally got to the setup screens and everything was going well until i got onto the network screen, i sat there for about 30 minutes and nothing popped up. I have an ethernet connection with my router and the network was working fine on my old instance of Windows 10, but i ended up pressing skip this step, thinking that i could do it later. Next was supposed to be the microsoft account login, but i guess because of no internet connection I couldn't login and was told to put in my name. I put in my password and finished the setup but was brought to my desktop with no internet connection and no access to my microsoft account. I have tried many different ways to get my network to connect, but nothing has worked yet. I've even booted back up off of the Windows 10 usb and wiped my ssd, thinking that I could just go back to Windows 10 on my hdd. I went through the setup until the network screen and was left disconnected on my hdd instance of Windows 10. I cannot figure out whats happening and have been trying to fix ny computer for days. Whenever I do the network troubleshoot it says that Windows did not detect a properly installed network adapter. My specs on my computer are an Intel 17 9700k, an NVidia GTX 1060 6gb, 16 gigs of ddr4 ram, and of course my 1tb hdd and 1tb ssd.","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Windows 10 comes with a great many drivers built-in to the install file - and in the majority of cases will identify and install your network card driver automatically. However it sounds like, for whatever reason, it hasn't been able to identify your network driver in this case. If you were to look in Device Manager (right-click START, choose Device Manager) you might find you have one or more \"unknown\" devices listed - one of which will likely be your network device.There are a couple of options: 1. If the computer is a custom-build gaming type machine you might have some original installation CDs - if you have one for your motherboard it will contain drivers for your network device.2. If you know the make\/model of your mainboard and you can use a different computer to download the required drivers to a USB device and then install them on the problem PC.3. Get a USB plug-in network adapter - generally these either come with a built-in driver so work automatically or will have their own driver CD you'd need to install. that would get you online. Once you are online Window will likely be able to download the drivers for your original network device! Regards, David","Thank you for your advice, I installed my motherboards network driver and everything worked. Thank You!","You're welcome! Let us know if there's anything else. If you don't have any more questions, feel free to choose a rating. Thanks!"]},{"symptom":"Update to Windows 10 version 1903 stuck at 48%        Hi I have a customer's Acer Aspire E1-572G laptop that crashed overnight doing the 1903 update. So I took it back to try to do it for her since she needs the laptop for work.This is a standalone Workgroup laptop and not connected to a domain.I have been trying for days to upgrade this laptop to Windows to version 1903.The update downloads to 100% and then the laptop reboots to install 1903.Nothing external is plugged in.It consistently freezes at 48%.There is a single C partition so nothing out of the ordinary.The spinning circle stops.I have left it alone overnight but nothing changes.I have used the Windows 10 update troubleshooter.I have uninstalled all third party apps other than Office 2016.I have done a disk cleanup to clear out left over filesCurrently it is on 1803 so has missed the 1809 upgrade.I have tried downloading the update through the update option as well as using the media creation tool.However with a USB stick plugged in I get the not able to upgrade error message because an external drive is plugged in!I don't want to do a clean install because I don't have the reg key for my Office 2016. (Jellybean can't find the key).Anyone else with this issue and managed to fix it please?","solutions":["Hi hongkongpom The most successful method to get the 1903 upgrade is to use the Media Creation Tool to create an ISO, not a USB driveThen when the ISO file completes downloading Disconnect from the Internet Temporarily disable any 3rd party Anti-virus you may have installed Then in Windows File Explorer, double click the ISO and then run Setup.exe to begin the upgrade . . .","Watch the blow video and follow the steps. In this video I have used Media Creation Tool to install 1903 update:https:\/\/www.youtube.com\/watch?v=IaGM7UmpBYYIf it is still getting stuck I am going to upload a new video. I am working on it so by the time you will reach that point my video will be ready so you can watch.Thanks","Hi,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.We would like to see the Installation log to check what caused the update to fail\/stuck\/rollback.Share Setuperr.log and Setupact.log named files from C:\\$Windows.~BT\\Sources\\Rollback\\ and C:\\$Windows.~BT\\Sources\\PantherYou can open the folder by typing the path in Run or showing hidden files and viewing through explorer.Use Onedrive\/Google Drive\/Mediafire to share the files and drop the links in the next reply.","http:\/\/s000.tinyupload.com\/index.php?file_id=85060494741417177849https:\/\/www.mediafire.com\/file\/ibfdyncpas443hp\/setupact2.txt\/filehttp:\/\/s000.tinyupload.com\/index.php?file_id=00947298486935553894","Please read my question I have used Media Creation tool thank you","Hello I have uninstalled Avast but that has never caused problems with previous upgrades.","Hi, Looks like a driver migration is preventing as the error code is 1900101. Please share the following file: C \\$Windows.~bt\\Sources\\Rollback\\setupapi\\setupapi.dev.log","Thank you for your helphttp:\/\/s000.tinyupload.com\/index.php?file_id=76002751555731382652","I have removed all third party apps bar Microsoft Office and my Avast anti-virus.I am using a 240GB SSD which shows 61GB of free space.I tried cloning this drive to another 240GB drive and had the same problem so it's not the drive.","I am having the same problem with my ASUS B-360-H, i5 8600k.It stops every time at the 48% mark. Uhhhh"]},{"symptom":"connecting 2 win10 pc's over internet for file access        I know this is simple for some of you however, I have been getting confused by watching youtube videos on how to do this.I have two Windows 10 PC's - One desktop at work, and my laptop I use on the road. I want to have the ability to connect to my desktop from my laptop and retrieve any of my files needed using theinternet.I don't want to put \"everything\" on OneDrive which I already know I can use, I just want to remotely access my desktop from anywhere I at.Most of the info on the internet is fairly vague or videos poorly done. Most of which I can understand the Narrator (language bearier)or the video is of such poor quality I can't see what their doing. Thanks so much,Pete","solutions":["Hi Pete, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.On your work desktop, you'll need to set up the ability to allow remote connections.You can do this through Start > Settings > System > Remote Desktop, and turn on Enable Remote Desktop.There are instructions here on \"How to connect to this PC\". On your laptop, you can open Remote Desktop Connections to connect. Source: https:\/\/support.microsoft.com\/en-ca\/help\/402837... If you are using the internet, the difficulty will be making sure you have the IP address of your work desktop, and that if it changes, you note the new address for making these remote connections. You also need to consider any firewalls that may block the connections, and encrypting the connection if you are working with sensitive data.There are some third-party software options that make remote access a bit easier since they are an intermediary that connect to both devices, for example TeamViewer which offers a free version for personal use:https:\/\/www.teamviewer.com\/en\/credentials\/free-...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","i tired your instructions and it work great however, I didn't want to take over the desktop computer, I only want to access files within a folder so I could transfer files back and forth. I worry that if I use remote desktop, then if someone is using the desktop, this would impact them as well during a remote sessionPete","Hi Pete, Thanks for this extra information. The file sharing protocol used for network file sharing (SMB) is highly insecure and not recommended for over-the-internet use without encryption. Some internet service providers block this port as it can be exploited to spread malware. Business typically use a secure Virtual Private Network (VPN) connection to share files over the internet.I would suggest that if you or someone at your work does not have the expertise to set this up, that you explore using a service like OneDrive to put this folder on, and the files will then be available from wherever you have an internet connection, and in a secure manner. Is there something specific you do not like about OneDrive? There is a desktop app to allow the files to sync to the local machine, and it is also accessible over a website interface.-Ashton","Ashton,Initially that is what I was going to do, use OneDrive however, then I found out that I could not save and use QuickBooks file to a virtual drive so that kind of messed things up for my plan.In the office, we just plug out pc's into the same router and make the connection and no problems however, if I want to access my files (specifically quickbooks) while on the road, it's a problem. So I checked with quickbooks and they suggest QuickBooks online, which is their web based solution but, I already own and just upgraded to latest version. Also, I didn't want to be dependant on a life long subscription to quickbooks just to access my financial information. The other issue I have is sync on OneDrive - if I setup my desktop to use OneDrive under my MS account, it sync's everything in my OneDrive folder (as it should) however, if I log into my MS account with my laptop on the road, it also sync's everything in the local OneDrive folder on the laptop.  Since the desktop has to be on in order for me to access files remotely, I worry that making changes on the laptop with trickle over to the desktop prematurely. This might be a problem but, I haven't tried it yet. Pete","Hi Pete, Thanks for this extra information. Yes, OneDrive will sync most folders unless you exclude them manually. This article describes the process on how to select the folders:https:\/\/support.office.com\/en-us\/article\/choose... I am not sure on QuickBooks itself (and I did search around and find that there is trouble using it on cloud services such as OneDrive) but I am out of ideas on this one - hopefully another expert will chime in with some other suggestions!Best wishes, -Ashton"]},{"symptom":"Games        How do I get Premier Solitaire?","solutions":["Hi Marcella. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.You can get a free week of Premium Microsoft Solitaire collection to see if that is what you want. Go here:https:\/\/blogs.windows.com\/windowsexperience\/201...Otherwise Premier Solitaire is a wooden solitaire board game here: https:\/\/www.barnesandnoble.com\/w\/toys-games-pre...https:\/\/www.amazon.com\/New-Entertainment-1064-S...Was there some other Solitaire game you meant instead? The popular Windows 7 games are still available for free download here: https:\/\/winaero.com\/download.php?view.1836I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Tons of BSODs        I have been getting lots of random BSODs for quite a while now. They are not always the same exception. I have created a compressed folder of the minidumps I found and was hoping for some help.Here is the link to the OneDrive that contains these minidumps.https:\/\/1drv.ms\/u\/s!AiqaycZ9KqUcoDZMQnvY6LVKLTeX?e=ZROphS","solutions":["Hello TommyPham7! My name is Marco, I am an Independent Advisor. I will do my best to help you.Here are the 2 errors mentioned in the DUMP files. SYSTEM_SERVICE_EXCEPTION (fltmgr.sys) And MEMORY_MANAGEMENT Which suggests that your memory is causing problems. It can be as much hardware as software.First, scan for malware, it can be the cause of these frequent BSODs. Here are 2 reliable and free antimalware.AdwCleaner : https:\/\/www.malwarebytes.com\/adwcleaner\/ Malwarebytes : https:\/\/malwarebytes.com\/ If nothing has changed ... try these basic steps. 1] Run Windows Update Since the source of this fltmgr.sys file is Microsoft; you might want to run Windows Update and see if it resolves the issue.2] Run sfc\/scannow Now, press WINKEY + X button combo or right-click on the Start button and click onCommand Prompt (Admin) or just search for cmd in the Cortana search box, right click on the Command Prompt icon and click onRun as Administrator. Click on Yes for the UAC or User Account Control prompt that you get. Then, the Command Prompt window will finally be open.After that, type in the following command: sfc \/scannow And then hit Enter. Let it scan the whole drive for any errors and then Reboot your computer to check if it has fixed the Blue Screen of Death Error.3] Checking hardware for physical issues Sometimes, faulty hardware can also result in the software driver not working properly. We would recommend checking the internal components of the CPU for any issues. These issues are not only caused when the device encounters physical damage but can also be caused due to voltage fluctuations and short circuits. You may also want to run ChkDsk. You could run a command like the following to check and repair disk errors on your C drive:chkdsk c: \/f \/r 4] Run the Windows Memory Diagnostic Tool. Click on Start, type in mdsched.exe and allow the tool to check your computer memory (RAM) for problems.5] Update your BIOS and drivers. BIOS updates can be found on your manufacturer’s website, and driver updates can either be done manually through Device Manager (use Start Search to find it)6] If on a laptop, change power settings to High Performance. 7] If this problem occurs shortly after installing a new program, remove that program right away.Give me news. ;-) Marco _________________________________________________ Note: Il y a des liens vers des sites Web autres que Microsoft. Les pages semblent fournir des informations précises et sûres. Méfiez-vous des annonces sur les sites susceptibles de faire la publicité de produits fréquemment classés comme PUP (produits potentiellement indésirables). Avant de décider de le télécharger et de l’installer, recherchez soigneusement tous les produits annoncés sur les sites.","Hi Marco! Thanks for the quick response.Running a system scan using BitDefender resulted in nothing being found.=============================Updating windows resulted in one optional feature.=============================sfc \/scannow resulted in some files not being able to be fixed after the verification process. I've uploaded that log file at https:\/\/1drv.ms\/u\/s!AiqaycZ9KqUcoDdZ-l_LZmJ8of6V=============================Regarding the physical issues, I did try to re-set my RAM sticks. When I placed it in, there was a slight sound that sounds like sand grinding,=============================There was also a BIOS update so I updated that as well.=============================Running the memory diagnostic tool resulted in no problems being found.=============================No issues with chkdsk c: \/f \/r=============================I'll update you if I get more BSODs after running all of these. Perhaps the log from sfc \/scannow will help with resolving this issue.","Ok, but you scanned with bitdefender, but also scan with the 2 that I mentioned"]}]}