{"windows":[{"symptom":"Windows 10 upgrade - Error 0x8007042b        Hello,As with many users, I'm encountering the same issue when trying to upgrade my PC to 1909 from 1803. I used the Windows 10 Media Creation tool to create an ISO and mount it virtually, then executing the update. I've disabled all external antiviruses, and even use the Malwarebytes Removal tool to scrub Malwarebytes from my system. I've ran sfc \/scannow and DSIM online image repair in safe mode. The update still continues to fail. Any help would be much appreciated.This is the thread I followed to try to read the logs, but I really don't know what to look for:https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/windows-10-upgrade-error-0x8007042b-0x4000d\/70dae59f-1cba-4538-95f7-d4a75f98ecc5#windows","solutions":["I'm happy to help. Keep me posted on your progress as I will be here to help until the case is resolved."]},{"symptom":"Windows 10: All network connections stop working periodically        This is a desperate call for help.For years now I have been having the same problem: Once in a while, and for a couple of days at a time, I cannot establish a stable network connection of any type (Wi-Fi or Ethernet) on my desktop PC. The problem disappears by itself after a while and so to this day I do not know the cause of this tormenting issue.I will try to provide useful information and describe the symptoms I encounter as best I can and hope that somebody with the ability to identify my problem will come along and save me from this misery I am finding myself in once again.I have tried all the things that googling for network issues will lead you to, like reinstalling or updating network drivers, renewing the ip config and all that fun stuff, but nothing has worked, and I have searched for a long time.I have also suspected the quality of my internet connection is at fault but that is not the case. While my internet connection is not the best, I don't think it is the reason for my PC being unable to connect to my modem during these periods.My Wi-Fi adapter is connected via PCIe.When my PC is not on its network period, everything works almost all the time and I usually only use my Ethernet connection.I will list some odd behaviors which occur when my PC is on its network period: - Ethernet will not be working at all. It will just show \"No internet\" and I will not even be able to ping other devices or anything, the line is just completely dead. - This is a rough estimation just to illustrate: 80% of the time my computer will not be connected to the internet or a network, 15% of the time my computer will be connected to the internet with a terrible connection and 5% of the time it will show I am connected to the network, but not the internet. - When I try to connect to a Wi-Fi network, there are three different results, although eventually it will always turn out to be the last:a) I get \"Connected, secured\", which will turn out to be a very unstable connection, good enough to stream a video for 10 minutes but not enough to just browse the web or have a voice chat without frequent interruptions.b) I get \"Connected, No internet\", although the same network works fine on other devices.c) I get the error \"Can't connect to this network\", although the same network works fine on other devices. - Sometimes, when I click on the network icon in the windows bar on the bottom right, the window will be empty for a couple of seconds with just the loading dots animation at the top, then the window will show with just 2 or 3 nearby Wi-Fi networks nearby when there are usually far more. This is usually a sign that things are completely fricked at that moment.My suspicion is that there is something fundamentally wrong with my PC, possibly on a hardware level. But I don't know how to pinpoint my issue or how to describe it properly and have thus not been able to find any solutions on my own.This may be completely irrelevant, but I will mention it: When the most recent \"network period\" started, i had some humming in my audio interface, this does not happen usually, and hasn't happened for a long time.Please let me know if there is any other information I should provide.Thank you for taking the time.Any input is greatly appreciated.","solutions":["Hi, champiebampie My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps to repair your Internet connections: Enter the Start menu or by pressing the Win + I key combination, open the Settings and click on the Network and Internet option. Once there, we select the Status option from the menu on the left side and, within the configurations and options that are loaded in the right panel, we have to look for the restoration of the network. When you click on this option, it will show us a new window from where we can restore the network in Windows 10. In this way, all network adapters will be removed and reinstalled, and the original configuration of other network components will be restored. net. This implies that if we were using some software, such as a VPN client or virtual switches, we will have to reinstall them.A process that the system performs automatically by clicking on the Reset button that is now displayed in Network Reset in Windows 10 settings. It is normal for the process to not take long, although we must wait until the end completely and restart the computer to continue with the network configuration in Windows 10 as we have done so far.https:\/\/www.kapilarya.com\/how-to-reset-network-...https:\/\/support.microsoft.com\/en-us\/help\/10741\/...You can also check that your drivers are updated. https:\/\/support.microsoft.com\/en-us\/help\/402844...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hello,Thank you kindly for your response, I tried the reset and checked for driver updates, but my situation remains the same unfortunately. No ethernet and disappointing wifi connection. :( I have tried many of the common fix attempts like this one before.Best regards.","I recommend that you repair Windows completely before you must make a backup of your personal files, third-party software will be removed. Here the link to download the Windows ISO.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hello. Have you ever thought about buying a cheap USB wifi adapter to rule out the hardware issue? I wouldn't get a replacement PCIe card in case it is that connection that is failing. "]},{"symptom":"how can i find a scan        I scanned something  to email and cant find it. how do I recover this?","solutions":["Did your scanner come with an owners manual that explains where scans go, or can you find the owners manual on the manufacturer's website?You haven't told us anything about your scanner, so it's a total guess from us.","Maybe open Internet Options,L.click on the Star in upper task bar\/History,locate date-time of scan\/properties.","Hi Melsmom. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Is it not popping up on the desktop? If the software is installed, up to date and working properly then when you scan from the printer\/scanner top it should send it to the PC and pop up on your desktop.Scan to email doesn't always work properly because it depends on the default email app that is set and that can't always be set in Windows 10 in Settings > Apps > Default Apps. It's better to scan it to file, then attach it to the email from there.The actual folder it goes into is different for each brand, but usually a folder named Scans in Documents or Pictures. You can also change where it is set to download to.Rather than spending too much more time fiddling I'd simply Clean Install the printer which always works, lasts longer and actually saves time:1) Power up the printer, if wired unplug it's USB cable from PC. 2) Go to Settings>Apps>Apps and Features to find and Uninstall any printer software.3) Use one of these methods to remove all of the old printer drivers: https:\/\/www.tenforums.com\/tutorials\/101274-unin...https:\/\/helpdeskgeek.com\/how-to\/remove-uninstal...4) Now type Control Panel in Start Search, open CP, choose Icon View. In Control Panel open Devices and Printers, right click printer to delete Printer and any scanner or fax of the same name. Restart PC.5) Go to the printer model’s Support Downloads webpage to download and install the latest full software package. Now is also the time to check for any newer printer firmware to install which matters a lot.6) Extract Printer software, right click Setup file to Run as Administrator. Follow the setup screens closely as you install the software. For USB it should prompt when to plug in the printer.Older software may need to be installed in Compatibility Mode to run correctly: https:\/\/www.groovypost.com\/howto\/run-old-softwa... If you have further problems reply back with results of each step. Once it's installed and you've run a test print, then scanned it to see that it opens on the desktop, open the Printer software and go into its Settings to set the scan-to file location you prefer, also the email app you want opened for Scan to Email, if applicable.I hope this helps. Feel free to ask back any questions and let us know how it goes. If you will wait to rate my post until we are done, I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","no it didnt","thank you buty you lost me at step 3. i cant do any of the above do to I wont have acces  to my scanner until  again until tomorrow and my documents need to be in by then,.","I see. Then I would re-scan them to file, attach the files from the email."]},{"symptom":"Update Error code        There were some problems installing updates, but we'll try again later. If you keep seeing this and want to search the web or contact support for information, this may help: (0x80070422)","solutions":["Hi Robert,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.80070422==>Service Disabled.Make sure Windows Update service and Background Intelligence transfer service is running and not disabled. Change Startup type to automatic.https:\/\/www.tenforums.com\/tutorials\/4499-start-...Let us know if there are any questions. Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads.","Hi Robert,The cause of this error the startup type has been edited to forbidden. So we can correct the startup type to fix the issue.Push Windows + R on your keyboard to open Run panel.Here you type: service.msc Push Enter, you find and click on Windows Update on the pop-up panel.There you can change the start up type to  Automatic (Delayed Start) Now your problem should be sorted out.Regards,"]},{"symptom":"Stuck with the \"Device  was not migrated due to partial or ambiguous match.\" issue        I have now two occurrences of this problem and there seems to be no way to resolve it. I already checked all information on the Internet and did all troubleshooting and uninstall \/ install operations - nothing helped. But let me describe the issue:1. With the Logitech Mouse M705: It suddenly stopped working and I noticed the \"Device  was not migrated due to partial or ambiguous match\" in the USB Composite Device properties. I changed to another Logitech Mouse with another remote adapter and this worked for a while until it got the same issue. And so I changed to yet another mouse with a cable connection and this works as of now.2, With an ASUS external display connected via HDMIThis happened last night while using the display. The display stopped working after using it for a couple of hours in the middle of a Karaoke party. I checked the event viewer and noticed that there was some automatic WIndows Update going on at the time it stopped working. I still can connect the device and Windows recognizes the device but nothing is displayed. And of course the \"Generic PnP Monitor\" device has this crazy \"was not migrated\" issue. When I open the \"Advanced Display Settings\" I can see both displays listed. As you might guess the mouse workaround by buying new mice would be too costly for displays.Note that all my drivers are up to date including the Intel drivers and the Nvidia GeForce GTX 1050, which is listed for the malfunctioning display.The system is a Windows 10 Home Edition Version 1803.Here the event for the display:Device DISPLAY\\ACI24FA\\5&aaea2d5&1&UID4352 was not migrated due to partial or ambiguous match.Last Device Instance Id: DISPLAY\\LGD0590\\4&223d200f&0&UID0Class Guid: {4D36E96E-E325-11CE-BFC1-08002BE10318}Location Path: Migration Rank: 0xF000FFFF0000F100Present: falseStatus: 0xC0000719","solutions":["Hello DanielScholzCH,Thank you for writing to Microsoft Community Forums. I understand how difficult it feels when the devices stop functioning as they are supposed to. Let’s try to narrow down the issue by following the below methods:Method 1: Check for Updates.Driver updates in Windows 10 are automatically installed along with Windows Updates. But you can go ahead and check if there is any new update available for that particular driver. You can go through the article onhow to update drivers in Windows 10.Method 2: Roll back driver.If there are no new updates available for the driver, it shows that you have already installed the latest build of drivers. At that situation, you may roll back driver and check if the works. Sometimes rolling back to the previous build resolves the issue.  Also, you may uninstall the device and driver package from device manager. To do that, you may go through the article onhow devices and driver packages are uninstalled.Method 3: BIOS Update. The error which you are getting could also be due to problematic BIOS (Basic Input and Output System). Hence, you could update your BIOS to fix the issue.BIOS Disclaimer: Modifying BIOS\/ complementary metal oxide semiconductor (CMOS) settings incorrectly can cause serious problems that may prevent your computer from booting properly. Microsoft cannot guarantee that any problemsresulting from the configuring of BIOS\/CMOS settings can be solved. Modifications of the settings are at your own risk. Hope it helps. Regards, Mala SMicrosoft Community - Moderator","Hi Mala ... ... these devices stop working while a \"Windows Update\" is running. The culprit is the Windows Update and the only possible way to get back to a clean system would apparently be to reinstall Windows 10 and then make sure that no Windows Update will ever run uncontrolled.Who provides the drivers for the \"USB Composite Device\" and the \"Generic PnP Montitor\"? Microsoft? Ahhhh :-) ... and do I have a \"rollback\" option there? Oooops ... no Sir .... no chance ...And please try to understand the really silly message. \"Devce xyz was not migrated due to partial or ambiguous match.\" Wow ... So there was a partial or ambiguous mismatch discovered by the Windows Update running in the background and the decision was to declare the device to stop functioning. And ironically these device drivers are from the very same company that proudly runs the Windows Update.Now let me prove to you that I am right and that *WIndows Update\" is confused and not any BIOS or other components.1. The issue arises on a running system when a Windows Update is busy in the background. E.g. the external display was running fine for 5 hours until it suddenly stopped working. The only changing process running at the very time was \"Windows Update\". The same is true for the mice that I have lost.2. The drivers for the devices still work \"partially\". E,g, the external display is still recognized correctly and the Logitech Utility still discovers the mouse. The pointers just don't move.  The monitor remains black. The devices are still working. The connections are still working.3. The Device Manager does not flag the devices as faulty. You have to go into the events tab to see that there is something wrong. This is a Device Manager error by itself as it does not report the problem.4. I have 2 \"Generic PnP Montitor\" entries - one for the Laptop display and one for the external ASUS display. Both are the same Microsoft drivers. But only the ASUS shows this partial ambiguity error. The same is true for the USB Composite Device. I have 2 USB ports and only when I attach the Logitech mouse then I get this issue. 5. 2 and 4 prove that it can't be the provider drivers. They are still working but they are prevented to work correctly by these generic Microsoft drivers or better the device management which is confused by ambiguity. (btw. I uninstalled \/ installed those drivers just in case).6. Can it be a BIOS problem? Could you believe that the BIOS would suddenly decide after 5 hours that it does not like the Asus monitor anymore? Or the Logitech mouse? Or the many other devices reported here by the community? That's not a BIOS problem.I have 33 years experience in the IT industry and when I learned something about this type of problems then it is to acknowledge the facts and believe that the process running when an issue occurs is also the culprit. Just believe it.There would be a nice quick fix for Windows - just ignore your ambiguous \/ partial decision and let the drivers do their work. Flag it in the device manager with a warning and so let the user decide if there is really an ambiguous situation that needs to be worked on.And so Mala - please go back to development and open a problem record. After 3 years of reports of this issue this is something that your Windows users would deserve. Hope you can help. ","Hi Daniel & Microsoft Support,You know what's funny?I have the same \"Device was not migrated...\" issue, also with an ASUS secondary display.Rocking an Nvidia GTX 1080 and Win 10 64bit.Even funnier is the fact that my main primary display is exactly the same model as my secondary and surprisingly this device could be migrated successfully.Also, the 'not migrated' secondary display continues to flicker a teeny tiny bit.ASUS support just told me the brand new display must be broken. I'll probably now order a new one to see if that might fix the issue but I really doubt it.And @Daniel:I know that's kind of the obvious but...Have you tried to install the latest driver for the displays? Based on ASUS that should change the label of the monitors from 'Generic PnP Monitor' to the 'ASUS Model XYZ' and fix the problem. But didn't work for me thou. Still showing the Generic label and adding the ASUS color profile won't work either.And @Mala:I really admire your try for support but your answer is only a \"I already did that, that's why I am writing to Microsoft Support\".Please add this to your bug report if you didn't already. And say that this is an issue that you are currently working on.","Hi Mala ... ... these devices stop working while a \"Windows Update\" is running. The culprit is the Windows Update and the only possible way to get back to a clean system would apparently be to reinstall Windows 10 and then make sure that no Windows Update will ever run uncontrolled.Who provides the drivers for the \"USB Composite Device\" and the \"Generic PnP Montitor\"? Microsoft? Ahhhh :-) ... and do I have a \"rollback\" option there? Oooops ... no Sir .... no chance ...And please try to understand the really silly message. \"Devce xyz was not migrated due to partial or ambiguous match.\" Wow ... So there was a partial or ambiguous mismatch discovered by the Windows Update running in the background and the decision was to declare the device to stop functioning. And ironically these device drivers are from the very same company that proudly runs the Windows Update.Now let me prove to you that I am right and that *WIndows Update\" is confused and not any BIOS or other components.1. The issue arises on a running system when a Windows Update is busy in the background. E.g. the external display was running fine for 5 hours until it suddenly stopped working. The only changing process running at the very time was \"Windows Update\". The same is true for the mice that I have lost.2. The drivers for the devices still work \"partially\". E,g, the external display is still recognized correctly and the Logitech Utility still discovers the mouse. The pointers just don't move.  The monitor remains black. The devices are still working. The connections are still working.3. The Device Manager does not flag the devices as faulty. You have to go into the events tab to see that there is something wrong. This is a Device Manager error by itself as it does not report the problem.4. I have 2 \"Generic PnP Montitor\" entries - one for the Laptop display and one for the external ASUS display. Both are the same Microsoft drivers. But only the ASUS shows this partial ambiguity error. The same is true for the USB Composite Device. I have 2 USB ports and only when I attach the Logitech mouse then I get this issue. 5. 2 and 4 prove that it can't be the provider drivers. They are still working but they are prevented to work correctly by these generic Microsoft drivers or better the device management which is confused by ambiguity. (btw. I uninstalled \/ installed those drivers just in case).6. Can it be a BIOS problem? Could you believe that the BIOS would suddenly decide after 5 hours that it does not like the Asus monitor anymore? Or the Logitech mouse? Or the many other devices reported here by the community? That's not a BIOS problem.I have 33 years experience in the IT industry and when I learned something about this type of problems then it is to acknowledge the facts and believe that the process running when an issue occurs is also the culprit. Just believe it.There would be a nice quick fix for Windows - just ignore your ambiguous \/ partial decision and let the drivers do their work. Flag it in the device manager with a warning and so let the user decide if there is really an ambiguous situation that needs to be worked on.And so Mala - please go back to development and open a problem record. After 3 years of reports of this issue this is something that your Windows users would deserve. Hope you can help.I have just encountered the same problem with an external SSD hooked to a Surface Book 2 (another source of joys).Having really only stumbled across the warning in Device Manager (on a familiarisation \"tour\") what I would like to know is what practical effect this has.Your screen and mice stopped working, my drive still accepts files and which is all I was going to use it for, back up storage not a system drive.PS Are you:a) still waiting for an answerb) given upc) there is no c) as that would be \"have received answer and full rectification of problem\"","Same exact problem here and disgusted that no one has gotten back to answer this question.  Disgusted with Microsoft all around.  This is just more of the same nothing.","Just thought I would add my setup to your issue. I am on an Intel I7 with Nvidia GeForce 1030, the good one with 2gb not the one they have all the trouble with.  I switched out my two View Sonic 27\" Monitors for a 4K 55\" Samsung TV, I had read about it and liked the idea even though most that are doing this are gamers and I am not, I wanted the true 4k view and now I can have 4 27\" monitor size windows stacked and it is awesome.  I have to upgrade my video and upgrade my HDMI to the 18gb cable, and update bios and use newest drivers.  When it all came out I have a true 4096 X 2160 native 4X4X4 setup and the picture is incredible...until the latest windows update and now my screen dos this flickering thing and drives me crazy.  It will stop when you close the browsers and wait a few minutes, sometimes you have to log out and back in.  But I spent a lot of money and time getting all this tricked out and windows update gives me the device not migrated message ?  I spoke with Nvidia and Samsung and both were very helpful but I had all their settings correct.  That just leaves one culprit, so I am very interested in whatever someone hears from them.Thanks Rick","I have the same issue with a Plugable dock and my HP laptop.  Both USB-C ports worked perfectly fine for over a year, now plugging into the rear port gives a similar error and doesn't fully use the dock.  If I reinstall windows it works fine, then somewhere along the line the updates break it.  Very, very frustrating.  ","I've had this same problem. I believe this malfunction is related to USB XHCI (the USB 3.0 protocol) and the system power management. I believe the port or device, possibly even a hub, goes into a low power state and perhaps switches to a USB 2.0 protocol to save power or goes into a sleep\/hibernate state when not in use or being fully utilized.  When the port attempts to resume to full USB 3.0 protocol, the device ends up getting reinitialized and Windows breaks at some driver level code or something of that nature.  I found that switching my keyboard and mice to a completely USB 2.0 port that they no longer exhibit this behavior, and have also had some success disabling power management settings in the device manager for each individual port and device, particularly by changing the view to \"View devices by connection\" and tracing each affected device up the tree to the very top level port.  This is the right-click \"Power Management\" checkbox that states \"Allow this device to go to sleep to save power\" and making sure it is unchecked.","I have this same message when I have tried to connect 3 different types of Bluetooth headphones to my Lenovo Yoga 3 Pro. I have tried uninstalling both the bluetooth drivers and headphones. I even tried installing the bluetooth drivers in Windows 8 compatibility mode. In all cases, the bluetooth finds the headphones and 'pairs'(through Windows Bluetooth panel), and Windows tells me it has installed the drivers for the headphones. However, when I try to connect the headphones, nothing happens. When I then go into Control Panel\/Sound, I can see the headphones with a disconnected status. I try to connect. I can not make it a default device(greyed out). I then click on the headphones properties, click properties again and bring up the 'events' tab. This is where I see the message that is the subject of this thread. The expanded version reads:Device BTHENUM\\{24df01a9-3e4f-4c9f-9f66-5aa8ab14f8f4}_LOCALMFG&0000\\7&5b09c4b&0&000000000000_00000000 was not migrated due to partial or ambiguous match.Last Device Instance Id: BTHENUM\\{24df01a9-3e4f-4c9f-9f66-5aa8ab14f8f4}_LOCALMFG&0000\\7&21da09c0&0&000000000000_00000000Class Guid: {4d36e96c-e325-11ce-bfc1-08002be10318}Location Path: Migration Rank: 0xF00000002001F120Present: falseStatus: 0xC0000719So this problem extends to many devices. Microsoft seems to be quite disinterested in coming up with a solution. I have spent many hours trying to research this problem, all to no avail.","So I have had this same problem since May 9th, 2019. It is strange, I have the exact same partially migrated message as the rest of you. I have a Lenovo flex-5 model 80XB with the NVIDIA graphics and my HID touchscreen driver is only partially working for my laptop screen. I can use it just fine like a regular computer, but the touch screen will not recognize my finger. HOWEVER, here is the strange part: it will recognize my Lenovo active pen. I can still draw on the screen. it works just like it always has, but this past may it stopped recognizing my finger in the middle of doing some homework. this has caused me HUGE problems, and I am wondering if I should trade this thing in and go for another brand of laptop, or maybe even a MAC. I am a graphic design student, and this is a SERIOUS inconvenience for me...Does anyone know if I will be able to buy an external display and use THAT monitor's touchscreen capabilities? or since I am on a laptop, will the driver that runs its screen work on the potential new monitor as well? If there is no solution to this problem, and I cannot uby another monitor, then I will have to trade his in for what I can get and buy something I can actually work on the way I purchased it for. It is useless to me without the touch capabilities. ALL of them. Here is the message I get under the details of the driver tab:5\/9\/2019 at 3:50pm device was not migrated.Device HID\\WCOM50E8&Col01\\5&11e08167&0&0000 was not migrated due to partial or ambiguous match.Last Device Instance Id: HID\\WCOM50E8&Col04\\5&11e08167&0&0003Class Guid: {745A17A0-74D3-11D0-B6FE-00A0C90F57DA}Location Path: Migration Rank: 0xF000FC00FFFFF100Present: trueStatus: 0xC0000451right before that it did this....Device HID\\WCOM50E8&Col01\\5&11e08167&0&0000 was configured.Driver Name: input.infClass Guid: {745A17A0-74D3-11D0-B6FE-00A0C90F57DA}Driver Date: 06\/21\/2006Driver Version: 10.0.17134.648Driver Provider: MicrosoftDriver Section: HID_Raw_Inst.NTDriver Rank: 0xFF1004Matching Device Id: HID_DEVICE_UP:000D_U:0004Outranked Drivers: input.inf:HID_DEVICE:00FF1005Device Updated: falseParent Device: ACPI\\WCOM50E8\\1so apparently it was not updated at all. I check the \"driver details\" and it says it cannot give me any information because there is no driver found for this device. but how in the WORLD am I using the pen on it if it doesn't have a driver? HELP! I loved this laptop, and windows 10, until it did THIS. now I barely use it. id rather throw it right now to be honest with you. Microsoft, is says it was your update service that did not update my drivers, and now my laptop is broken. what gives? aren't there enough people with this problem yet?"]},{"symptom":"windows 10 realtek disapears.        like many others i have no sound after windows upgrade 1909. I have tried all of the fixes including doing all of the drivers. I have gone thru the entire device manager route,The problem is Realtek is completely gone from my PC. I vant go to the drop down menu and do anything with Realtek because it isnt on my PC anymore. The PC says all of my drivers are current and working properly. Im very frustrated. I have tried virtually every fix that all of the problem solving sites have offered, bottom line is nothing has worked. I even Did a system restore and downloaded windows 10 overagai, trying to go to an earlier time when it worked. I think when i did the upgrade, Realtek was dumped with the other files thtr got dumped during the upgrade. Please HELP, ive tried going stright to realtek to see if i could download realtek from them,and all there was , is a driver download which i did and it didnt work. I need the Realtek manager. The real tek was on there and now its just gone.","solutions":["Hi, It doesn't look like you have an audio driver that's from Realtek. Please try to download the audio driver for your model here: https:\/\/support.hp.com\/us-en\/drivers\/selfservic...There are other drivers from HP for your model: https:\/\/support.hp.com\/us-en\/drivers\/selfservic...If these doesn't work, please Press Win + R keys, enter \"winver\" and click Ok. Post a screenshot of it. I like to verify which edition of Windows 10 is installed.Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Windows 10-compatibility issues (What is? What if not?)        I currently have Windows 7 Home Premium Service Pack 1, on a Toshiba Satellite C855 laptop. I want to upgrade to Windows 10, but Idon't want to lose any of my 20+ non-factory, non-OS apps. Having to individually reinstall and reconfigure dozens of apps would take a lot of time and money I just don't have. I heard that the upgrade will leave applications intact, but there's some confusion about what happens if a non-Win10-compatibile app is found during the upgrade. Does it:automatically uninstall it (very, very bad!),abort with a list of apps to uninstall before trying again, then reinstall\/upgrade afterward (better), orupgrade the OS anyway, leaving it up to you to upgrade problem apps (ideal, albeit at one's own risk)?Also, I need to know if the following apps are Win10-compatible:Visual Studio 2015,Microsoft Word 2010,Skype 8.20, andother Microsoft products dated back to 2008 Please respond ASAP.","solutions":["I can't answer those questions but the first thing to do is see if there are Windows 10 drivers for your system.So hop out to the Toshiba Satellite C855 Support\/driver page and take a look at what drivers they offer.Of course you would have to enter your own exact model\/serial number:With no Windows 10 drivers offered the upgrade from 7 to 10 might not go very well for you.Before you start it would behoove you to make an image of your current system so when or if something goes horribly wrong during the upgrade you will be able to restore the image and start over again.Maybe you will have better luck by entering your system information or ask in their community forums:https:\/\/support.dynabook.com\/forums"]},{"symptom":"newest win10 update messed up my parents computer, now they have no access to important finical sites or records, and can't even navigate their computer        What the heck! I have parents way past the age of looking for answers on your stupid blog about how you just messed up their computer, and need someone to talk to  for help. No Go with windows support! we're too big for a support line! we rely on our users to provide support for no cost. yay multi-billion $$ corporations!Guess what, you messes, I can't walk them through the download and multi-step process to undo your mess up, because i'm 1200 miles away, and they need help now and don't know how to navigate your new improved helpful interface that came (was forced upon) with windows 10. I just set up their brand new computer in November with everything they needed to manage their financial records, and with a stroke of your limp finger, messed it the mess up. MESS YOU! Sure let me spend another 1500 bucks to go down and un-mess everything you messed up. I can't remote to them because my computer doesn't support easy connect and my mom doesn't remember how to attach a downloaded file to email. Sure, next time I spend the money to go fix your mess-up, i'll take my computer and set up a remote desktop function, but until then, they're messed.You, your company, and everyone involved can go mess yourself.Completely disgusted with you right now. Adam HunterP.S. I hope that one day when you have parents in this stage of life and in this stage of memory loss, you push out a \"helpful\" update. You inconsiderate messes.","solutions":["Hi Adam. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.If you want to complain to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. But Microsoft will not even see it here because this is a tech forums where we are mostly volunteers trying to help solve your problems. I have an elderly Mom I help with computer problems so know the frustration. Is there someone on her end who you can guide with these steps.Easiest would be to trigger it into the Repair Mode by holding in the power button until it cuts off three times. On the third it should boot into Automatic Repair.From there choose Troubleshoot, then Advanced, then the new button to Uninstall Updates.If that fails also from Advanced Options try System Restore, Startup Repair and if necessary a Reset saving files.If it needs any more than that just let me know and I'll continue. Here's hoping!"]},{"symptom":"sound problems with Windows 10        Can anyone explain to me why this is a consistent, continuous problem with Windows 10 -- external speakers not working, troubleshooter can't solve the problem, over and over again re-booting with no benefit, posting comments on the troubleshooter, seeing it is a prolific widespread problem affecting so many, why has Microsoft not addressed this issue????????I'm just appalled by this continuous hassle.  I'm extremely disturbed and disappointed with Microsoft service.  Not due yet for a new computer, but if this company can't get it together and provide better product service, I'm done with them.  Apple (who I currently despise) will be my next purchase.  Hey, we do what we have to do to survive.","solutions":["Hi Marilyn. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you all possible solutions for Sound problems in order of priority, so please try any you've already tried again in order. If you have any problems performing any steps I'll be standing by here to help you.1) Update the sound driver from the PC or device maker's Support Downloads webpage for your exact model, if it is newer than the one presently installed in Device Manager reached by right clicking the Start button. While there compare to make sure you also have the latest BIOS, Chipset, Display, Network and all other drivers. 2) Restore the Windows Audio Service which may have become disabled: https:\/\/www.tenforums.com\/tutorials\/57567-resto... 3) Next try these checklists: https:\/\/support.microsoft.com\/en-in\/help\/402699... https:\/\/www.howtogeek.com\/443702\/how-to-fix-sou...4) Right click Volume icon in System Tray, choose Sound Settings, from the Output and Input devices dropdown menus, choose then one(s) affected to see if that helps. If not use the Troubleshoot button nearby.5) Run the Playing Sound troubleshooter at Start button > Settings>Update & Security>Troubleshoot.6) Try rolling back the sound drivers in Device Manager reached by right clicking the Start button. Choose Sound controller and other audio devices, then Driver tab, then Roll back if available.7) If no newer sound drivers then uninstall the one presently installed in Device Manager, reached by right clicking the Start Button. Restart PC to reinstall.8) Try other and older drivers for your model Sound controller, too. For example, try the next oldest driver in the model's online Support Downloads list. To try all previous drivers installed on your system, in Device Manager choose Sound controller's Driver tab, then Update Driver, then Browse, then Let Me Pick. Finally, try installing the latest Sound driver in Compatibility Mode as shown here:https:\/\/social.technet.microsoft.com\/Forums\/win...9) If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 10) If this was caused by a Version update (which you can confirm at Settings > System > About) then you can roll back the version in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 11) You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... 12) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. 13) If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Oh, my - so simple to fix?  Lollll!! How ridiculous. Why doesn't the troubleshooter solve the problem? Why do things get screwed up EVERY SINGLE TIME there is a software update? Why did I never have this problem  b4 using Windows 10? Why did I PAY for a driver update service that doesn't solve the problem?  (Have since cancelled) Microsoft is a worthless product, with worthless support. (More importantly, why do I still own stock?)"]},{"symptom":"Cannot set pin to sign in windows 10        To be able to log into my account on windows 10 after adding it, it requires me to set a pin. However it says “error, cannot set a pin at this time, retry or skip this step and set up later” if i skip the step then it boots me back to the lock screen and it all starts over. I have tried logging in with my account password, but it says im using the wrong password. I went to microsoft on my phone and it let me in using that password, so the password is correct. Even if i sign in using the authenticator app, it requires a pin to be set up. ","solutions":["Hi LC. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See Dave's answer here to cancel prompts to set up PIN if you don't want one: https:\/\/answers.microsoft.com\/en-us\/windows\/for...If you do then If you cannot Add or Remove the PIN in Settings > Accounts > Sign in Options even after a restart, then unhide Hidden Files in File Explorer > View tab > Options > Folder and Search Options > View tab > tick box to Show hidden Files.Browse to C:\\Windows\\ServiceProfiles\\LocalService\\AppData\\Local\\Microsoft\\Ngc Delete or rename to Ngc.old this folder to reset the PIN. **You may need to first take ownership of the folder: https:\/\/www.tenforums.com\/tutorials\/3841-add-ta... Once you delete or rename the folder it will recreate it so you can add a PIN normally in Sign-In Options. You may need to restart the PC first.For any unexpected problems see the full illustrated tutorial covering all possible problems here:https:\/\/www.askvg.com\/fix-unable-to-add-and-use...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","His solution wont work for me. I cannot sign in to my account on the pc, meaning im stuck at the lock screen that you are presented with after turning on your pc. So i cannot get to the windows defender app. ","Use whichever method works here to get into Repair Mode so you can run a System Restore to a point before this problem began, Startup Repair, Go back to Old Version, the new button to Uninstall Updates or do a Reset:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... If necessary you may need to create bootable media (which uses different drivers) to access the Repair Mode.To create Windows 10 Installation Media on another PC install Media Creation Tool and follow the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, on second screen choose Repair Your Computer, then Advanced Troubleshoot Options, then System Restore, Uninstall Updates, or Go Back to Old Version. If that fails go back to Troubleshoot Options to Reset.If all else fails choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, click Next to let it create needed partitions and start install - this makes it foolproof.Follow the illustrated Clean Install steps in this tutorial which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... There is a step included to rescue your files first if they are not backed up using the bootable media here:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC. I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Microphone blocked        I allowed my microphone on everything, but it says that steam and all my games are blocked from using my microphone for privacy. ","solutions":["Hi TS> I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See here how to unblock Microphone privacy restrictions: https:\/\/support.microsoft.com\/en-us\/help\/446823...I hope this helps. Feel free to ask back any questions and keep me posted.","When  I go into the  microphone settings, at the bottom are the apps I want my microphone on. But, they are under a section that is labeled \"Some desktop apps might not appear in the following list or are not affected by this setting\" Apps under this text are things like  Steam, certain games, etc.","That is explained here: https:\/\/support.microsoft.com\/en-us\/help\/10557\/...","Is there no way to give these apps access? If I am misunderstanding something said in the article please tell me. ","The article says you can go to the App download page to see what permissions are granted, but the only choice is to not install it if you don't like them. I believe that means the app needs those permissions and can't run without it."]},{"symptom":"how to install missing API-MS-WIN-CRT-CONVERT-I1-1-0.DLL        API-MS-WIN-CRT-CONVERT-I1-1-0.DLL  how do I reinstall it ?","solutions":["Hello,You can get that file from the following link along with the steps of installationhttps:\/\/www.sts-tutorial.com\/download\/api-ms-win-crt-convert-l1-1-0"]},{"symptom":"Version 1903-1909 Update        Don't know how to contact the devs so I figured I'd post this here.Windows gave me the option to update to version 1909 even though it's \"not ready\", so once it finished installing it told me to restart. I restarted my PC, but it got stuck loading after it shut down. It was on the normal loading screen. I have it displaying the MSI logo instead of the Windows logo, and it had the loading dots. Nothing else. It stayed like that. I had to shut the computer down, wait a while (don't know how long, I just left it for around 20 minutes) and started it back up. It did some repairs and booted back in to version 1903. I'm not sure if this is some sort of local issue or an issue with the new build.","solutions":["Hello Yeetuss,You can check the following link which contains several steps in order to resolve windows 10 1909 update problemshttps:\/\/www.windowscentral.com\/windows-10-november-2019-update-common-problems-and-how-fix-them"]},{"symptom":"Windows 10 Update from 1809 to 1903 stuck at 27%        Hi,My computer is supposed to be updating from 1809 to 1903 right now - however for the past 20 or so minutes it has been stuck at 27% \"Working on Updates\".So here's my question: What do I do? Can I cancel the update? Is there anything I can do to fix the update and get it going again?  Or will it be stuck like this forever and all of my files, applications, etc. gone?Hardware:Mushkin Chronos 500gb SSD for Windows installation1TB Samsung 850EVO SSD2TB Seagate SSHDGTX 980Tii7-4790k28GB DDR3 ramI have a Plugable Docking station which I use as a USB hub, if that is relevant.I also have a server (Western Digital MyCloud) on my home network which I use for file storage. I've heard external storage can cause issues for this particular update. Could this cause any problems?","solutions":["Hi GenericalUser If that has only been 20 minutes, you have nothing to worry about, the 1903 update an take anywhere from 1 - 3 hours, depending on Internet speed . . etc.Usually it will look like the update is stuck for a long time, then the progress will suddenly increase, your best option is to give that update a lot more time . . ."]},{"symptom":"Merry Christmas, gamers! Want help getting started with your new device? :)        Hey there, everyoneMerry Christmas, and I hope you have a happy New Year!For those of you who have just opened your presents, and found you have got a Gaming laptop, a new game or even starting out on Xbox Live. I have some handy links available that may just save you some time!Getting started on Windows 10Windows 10 can be a little daunting when you first look at it. Especially when you're so used to a different operating system. Why not check out these articles for getting started with Windows 10:https:\/\/blogs.windows.com\/windowsexperience\/2016\/12\/26\/windows-10-tip-getting-started-windows-10\/ Get Started with Windows 10Getting started with Xbox & Xbox Live You can play selected Xbox games on your Windows 10 laptop, with friends on Xbox live. Even if they are playing the game on the Xbox console. Allowing PC gamers (on Windows 10) to play with Xbox One players!Before you start doing this, you will need to make sure you're all good to go. All you need to do is load up the Xbox App, and you will be given a Gamertag that identifies you on Xbox. To change this, as the system has a bad taste for Gamertags!, take a look at this article here:Change your Gamertag: https:\/\/support.xbox.com\/help\/account-profile\/profile\/change-xbox-live-gamertag Articles for getting started on Xbox Live These articles will help you get started on Xbox Live. Great for getting started with gaming on Windows 10.Xbox Game Pass ultimate, which includes Gold Membership: https:\/\/www.xbox.com\/en-US\/xbox-game-pass Xbox Gold membership: https:\/\/www.xbox.com\/en-US\/live\/goldAdding friends on Xbox: https:\/\/support.xbox.com\/help\/friends-social-activity\/friends-groups\/add-friendsUse Game bar on Windows 10: https:\/\/support.xbox.com\/help\/games-apps\/game-setup-and-play\/get-to-know-game-bar-on-windows-10Change your profile picture for your Xbox Account: Changing your profile picture on the Xbox App If you're wanting to change a profile picture from an Xbox console, check this link: https:\/\/support.xbox.com\/help\/account-profile\/profile\/change-gamerpic-on-xbox-onePrivacy SettingsIf you are worried about your privacy and what folk can see. Check this article for information on how to change your privacy settings on Xbox: https:\/\/support.microsoft.com\/help\/4026796\/ (This works for non child accounts too)To do this on the console, check this link: https:\/\/support.xbox.com\/help\/account-profile\/profile\/edit-xbox-profileSafety for all the familyTo learn how to keep your family safe on Xbox Live and on Windows 10. Check out Microsoft Family here: https:\/\/support.microsoft.com\/help\/12413\/ To create\/set up Microsoft Family for your family, visit this link: https:\/\/account.microsoft.com\/family\/ You can set time limits, restrictions and add money to their account. All from one place!                                   ____________________________________________I hope I have not missed anything off the list. If you think of something to add, please comment it underneath and I will add it to the list. Happy holidays, and happy gaming!Regards, Note: Questions posted on this thread will be split onto their own new thread where you can get better help\/support with your question. Happy Gaming!","solutions":[]},{"symptom":"windows update problem        My daughter had an old computer I wanted to use as a backup.  She had lost the charger and all documentation.  It was a dell computer purchased I believe in 2013.  She had no discs or backups, or recovery files.  I bought a new charger and started it up.  It was slow but it had an Intel I5 processor.  Only 4GB Ram.  After I started it up it updated to Windows 10 successfully.  I decided to update the RAM to 8GB.  The Dell Inspiron 5010 was super easy to update the RAM with only 1 screw needed to get access to the memory.  After installing the RAM I looked at the system and it showed the new RAM.So far I was very pleased but the computer speed looked about the same and I suspected the disk was slow.  I looked at windows update and it was ready to install about 8 updates.  The first it worked on was a cumulative update to Windows 10.  This all seemed to install ok although it said it had a problem at 30% and said it was going to restart.After the restart it completed the update to 100%.  Then it said it was cleaning up.  That completed to 100%.  Then it said it needed a restart so I clicked \"Restart Now\".  After the restart the fan kept running at high speed.  I got to the Spotlight image and I clicked that I like the image.  But when I tried to go further the image would just get very faded and the computer would not go further.  I can't access Task Manager or the settings page.  After about 30 seconds on the blurry image it pops back to full focus but I still can't access anything on the computer.  I have tried Ctrl, shift, esc and ctrl, alt. delete but nothing seems to respond.  I left the computer running for about 4 hours and it still is the same.  The power light ison and there is a light that blinks every second.  Multiple restarts leave me at the same place.  Is there a way to still use this computer even if data is lost? ","solutions":["Hi, lostinspaceQF My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Diagnostics & Feedback: Some of these settings ﻿are hidden or managed by your organization        Hello everyone,I have a problem with the option Diagnostic & Feedback. Under the main heading of that option it says: Some of these settings are hidden or managed by your organizationAt the Diagnostic Data the setting is set basic The Full option is greyed out.Under the option: Improve Inking and typing, that option is also greyed out and Windows is saying: Your current Diagnostic data setting prevents inking and typing data from being sent to Microsoft.So the question I put to you: is there a solution to fix this nasty problem?According to Microsoft it should be a register problem. Well I don't know.Perhaps some of you might have the solution. I would be forever grateful.Thanks in advance, Johan","solutions":["Hi Johan,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.The usual cause of this is joining the Windows Insider program. Do you have an Insider build installed?For beta builds telemetry helps to improve builds and fix bugs hence it is set to full.","Thanks for the quick reply. No, it is a genuine copy of Windows 10 Pro. No Insiders Preview.Cheers, Johan","Thank you. Then, see the steps by Kapil here which discusses every case.https:\/\/www.kapilarya.com\/some-settings-are-man...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads.","There are a lot of solutions, but NOT for the one I have. I did what the video told me to do without positive result.","Out of curiosity .....Is your machines \"Connected User Experiences and Telemetry\"service running ?If not, please consider starting it.","Yes. It is set on Automatic","Hi, Try doing a repair install. A repair Install keeps everything including Files and applications and reinstalls Windows.http:\/\/www.yourwindowsguide.com\/2016\/06\/how-to-...http:\/\/www.tenforums.com\/tutorials\/16397-repair...The best and the easiest way is to use first method in the first article. Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","Should I still trying to repair?I am half way lol I managed to get the Insiders Preview from greyed out to on. And under the Diagnostics & Feedback I can nowenable basic and full. So there is some progress. Only the top red sentence remains: Some of these settings are hidden or managed by your organizationI will await your reply before I do anything lol","I believe if the Group policy reset hasn't helped then nothing would correct the same. A reinstall can only correct this - fortunately you can keep everything.","Okay. I will first make a backup and try to fix it. I'll keep you informed."]},{"symptom":"Single Sign on Issue in Windows 10 os        We are facing the Single sign on (SSO) issue in chrome browser.We have observed that SSO is working properly in Internet Explore, Edge and Firefox Browsers and Windows 7- chrome browser.But the Issue is with chrome browser (Windows 10 Os).We have tried with the following solutions:1. added the site to the local intranet sites list using GPO. 2. Clear the browsing history and cache.Please suggest for the same issue.","solutions":["Hi Vinod, Thank you for writing to Microsoft Community Forums. I understand that you are unable to use Single Sign on feature in Google Chrome in Windows 10. Since you are using GPO, we do have a dedicated forum for issues concerning to GPO, let me point you in the right direction, where you will get assistance on this issue. I would suggest you to post your query inTechNet forums, where we have support professionals to address your query. Few articles for reference: How to configure single sign-on to an Application Proxy applicationAzure Active Directory Seamless Single Sign-On: Quick start Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"all attempts to connect to internet websites fail, while ALL GOOGLE urls still work fine        Suddenly... with no changes made by me to any settings...1) fails to communicate with all Ethernet Network connected devices (printers etc) for first time after 6 months of stable service2) Cannot browse internet webtites... EXCEPT ALL GOOGLE related urls DO work...   gmail, news, youtube, etc   AT&T Connect Tech CSR guided me through all she could to correct any bad settings   finally guided me to Windows 10 image restore, using prior stable Windows 10 saved image from6 month priorWindows 10, Dell 8500 XPS i7 PCipconfig yields \"media disconnected\" on Bluetooth, WIFI, Ethernet.Successfully connects to AT&T modem as NETWORK 2with the above going on...Why would all attempts to connect to internet websites fail, while ALL GOOGLE urls still work fine?Not sure what to do next...","solutions":["Hi Forrest. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything that works so that at least something will work. Even if you've tried some of these steps already please do them over in sequence to see if it makes as difference:Update your network adapter drivers from the PC maker's Support Downloads web page using the full model number, HP Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.If you have the latest network driver then try on it's Driver tab also to Roll Back, or Uninstall and then restart PC to reinstall the driver. Try also all older drivers from Update Driver > Browse > Let Me Pick list working backwards.If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them.If this was caused by Version update then you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool.For Wifi won't connect after Version 1903: https:\/\/windows101tricks.com\/fix-wifi-keeps-dis...https:\/\/www.techrepublic.com\/article\/wi-fi-and-...https:\/\/pureinfotech.com\/fix-wifi-problems-wind...For Ethernet not working: https:\/\/www.kapilarya.com\/wifi-ethernet-doesnt-...Go to Device Manager > Network Adapters, select network adapter in use, click on the Power Management tab, clear the check box to \"Allow the computer to turn off the device to save energy.\" Then click on the Advanced tab, disable any energy-saving options.Enable IPv6 in the network adapter settings: https:\/\/www.tenforums.com\/tutorials\/90033-enabl... Run the fixit from https:\/\/support.microsoft.com\/help\/929852 (Re-enable IPv6 on all nontunnel interfaces) and reboot.Right click the network icon in System Tray at bottom right end of task bar to Troubleshoot Problems. When prompted put in a few URLs it cannot connect to for it to trace the reason.Try all of these steps: https:\/\/support.microsoft.com\/en-us\/help\/10741\/... https:\/\/www.kapilarya.com\/how-to-reset-network-...Go to Settings > Network & Internet > WIfi > Manage Known Networks, highlight and remove the network having problems, restart PC to see if it shows up again.Try plugging in by ethernet cable to the router to compare, then plug the ethernet cable into the modem (if separate) to see if this might be an issue with the router.Try powering off modem, router and PC and then restarting in that order with 1 minute in between each. You may need to reset your router or even optimize it following these steps:https:\/\/www.lifewire.com\/resetting-a-home-netwo...https:\/\/www.pcmag.com\/article\/258865\/how-to-set...Your router manual is always available from the manufacturer's website for your exact model.You also are entitled to Support from your internet provider to get online on all devices. This is always included in the monthly bill. If your router is less than a year old they will also Support getting it connected and optimized.Another option is you could replace the wireless adapter with an inexpensive USB nano adapter like this one:https:\/\/www.amazon.com\/OURLiNK-600Mbps-Wireless...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thank you for the very thorough tips Greg,However, I basically tried all of them and the problem still exists.The last item you mentioned was substituting a new USB WIFI adapter.I'm still puzzled, as to why I can ONLY connect and run any GOOGLE\/GMAIL\/YOUTUBE etc product on the internet,while ALL other attempts to view other url based connections FAIL.Doesn't this prove that my (Dell OEM Realtek) Ethernet board is somewhat working, since it allows all Google internet based apps to work in real time?All this while have the WIFI setting OFF, so I'm only on Ethernet.(same results with WIFI only)Again, I have also fully re-installed Windows 10 using image restore from a very stable\/working saved image of Windows 10 from July 2019. (with all hardware unchanged when that image was saved)  ...Problem still persistsAny other ideas?","Try resetting the network: https:\/\/www.thewindowsclub.com\/windows-10-netwo...","I did that too.   No change.by the way...I did notice that turning OFF IPv6 (Ethernet) causes all GOOGLE sites to also fail, just like all the other urls. When I turn on IPv6, Google sites work again.  So, is Google's advantage here that they adapt to IPv6, and most other url server\/sites do not?","Are you connected to Google DNS? https:\/\/www.howtogeek.com\/164981\/how-to-switch-...","No...  The IPV4 settings were set for DNS server connect automatically.Just now changed them to the Google DNS, experienced same issues.then changed it back to  obtain DNS server connecting automatically","Does the same thing happen now with ethernet cable? That narrows the problem to Wifi.Try another wifi adapter to compare. That would narrow it to Windows. Otherwise let's try some driver swapping. Under WIfi adapter in Device Manager, try uninstalling the Wifi adapter, then reinstall by restarting PC.Next try all previous WIfi adapters via Update Driver > Browse > Let Me Pick. Next try auto Update of driver. Then try all old and newer Wifi drivers on the Dell Support Downloads web page for your Service tag. Even try the Windows 8.1, 8 and 7 drivers if available. This will eliminate driver as cause.Is there a BIOS Update? Chipset?","Thank you for all the suggestions...This really is a great forum.Sometimes, it's just helpful to have \"the village\" weigh in with possiblities in the reasoning process...PROBLEM SOLVED...After reasoning that IPV6 worked with Google based apps, but failed when IPV6 was disabled (even though IPV4 was enabled)...I reasoned that either a new Windows 10 update had created an unsolvable conflict or possibly a marginal hardware failure had occurred somewhere in the motherboard based Realtek PCI GBE Family Ethernet Controller to cause IPV4 to fail(especially, after applying each one of the suggested remedies from Microsoft, AT&T ConnectTech, and this forum)So I just plugged in a $13 PCIe Gigabit adapter from HiRO and...All is functioning properly again without having to make any other setting changes to Windows 10,except I did disable the original Realtek PCI GBE Family Ethernet Controller in \"Device Manager\"(whether I needed to or not).It was a totally \"plug and play\" experience.So... Since this specific problem was solved in this case by merely replacing the Ethernet adapter,it might be a good idea for folks to add this cheap fix as a possible remedy to the \"try this list\",somewhere before giving up and suggesting a complete Windows re-installation.like an AT&T ConnectTech CSR had guided me to do, which turned out to be completely unnecessary in this case.","Forrest - I'm glad to hear that the suggestion to replace with an inexpensive network adapter to compare, worked for you. This is becoming an increasingly viable step as older adapter are deprecated or start having issues in the newer versions. Right now I'm testing several replacement nano adapters for my two year old Dell laptop which never had 5ghz and is starting to fail.Let me know if there's anything else. Also when ready please mark the post which helped most as the Answer, to help others. A rating is also appreciated.Happy New Year!"]},{"symptom":"Want an old update, not the current one        My PC is running ver 1803.  It has tried to upd 1909 half a dozen times but always fails.  Is there a way to get the 1809 or 1903 version at least?  The 1803 version is at the end of it's life and if I could at least get 1809 I would have 6 more months.","solutions":["Hi Christy, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.If it failed to install 1909, most probably it would fail 1903 as well. You may download an ISO file and try to perform an Inplace upgrade. If it fals, we would check the logs.To Download an ISO file of 1809\/1903 from Microsoft servers, use the following website:https:\/\/tb.rg-adguard.net\/public.phpOpen the ISO file and run Setup.exe. All steps, including upgrading using ISO file and Media creation tool, are covered here:https:\/\/www.yourwindowsguide.com\/2019\/11\/update...Disclaimer: There are links to non-Microsoft websites which would provide accurate and safe information. Watch out for ads on the websites which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]}]}