{"windows":[{"symptom":"How do I remove the advertisement about Outlook for mobile on the Windows 10 Mail app ?        I don't want ads in my mail appI already have the Outlook app on my mobile, it's logged on the same account.Can you ask the people who decided to have such a feature to make love instead of pushing useless ads ?Thank you very much.","solutions":[]},{"symptom":"Windows 10 OneNote can't find some ONote files that can be accessed via cloud Office 365 and old One Note 2016        looking at my OneNotes from the old OneNote 2016 I still have one machine, I can they are stored in a variety of locations that do get synched to the cloud: some in user's name SharePoint, some in shared organizational SharePoint, some in business OneDrive.When i try to open the file I get a message telling me it was created in an earlier ver of ON, and that i should download and open with OneNote and then synch.But the local Win 10 ON thinks the file is corrupted.Any suggestions on how to systematically move all my cloud ON files to cloud folders that Win ON can access.Don't see why I'd want to keep any ON files in One Drive if i use SharePoint.Office 365 tried to help but said Win10 ON is outside their realm.  Is there a windows 10 tech support that deals with ON? I'm ok with using up one my Windows support incidents if it would help.Len","solutions":["Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.If you have downloaded OneNote from Windows Store, please download and install the desktop version of the App.Download link:https:\/\/www.onenote.com\/download","I looked at that.1.  The file title implies that it is the older OneNote 2016 not the latest OneNote that I thought was called \"OneNote for Windows 10\".  I don't want to go back to ON 2016 because it is no longer getting updated by MS (as much I liked it better than the Win 10 OneNote)2.  I'm running Office 64bit and Win 10 Pro 64bit. Is download compatible with my version of Office and Windows?Thank you.Len","Okay, in that case I would suggest you to kindly download the notes from OneNote website and upload them again and check if they sync.","ArifAhmed2, please give me specific step by step instructions.  I'm very experienced non techie Exchange, Office admin, but i already tried simply downloadinng files and trying to open them locally. Couldn't open them even though fine on the cloud.  Synching from the cloud didnt give any errors.Plus there are a lot of files.Len","Please go to OneNote online website. https:\/\/www.onenote.com\/notebooksSign in to your account. Download the notes that are not working. Rename the notes locally. Upload them back to your OneNote account.","I do appreciate your help, but without screen shots, I can't figure out how to follow your instructions.   e.g. when you say download my version of ON, do you mean the Windows 10 version or the Office 365 version?  And is there a 64 bit version of  the new ON vs 32 bit ver, the way there was for the old Office 365 ON? The Win 10 verson is installed by default and opens most files created in the older Office 365 workstation ON (and stored in cloud) but not all. So I don't see the point of reinstalling what already works for most files.I'm thinking it has something to do with where the files are stored in the cloud. Some in sharepoint, some in one drive, all accessible from business Office 365 portal apps.","Leonard, I did not suggest you to download OneNote of any version. I suggested you to download the Notes from the OneNote website. You can later upload these Notes or paste these Notes in your existing OneNote application installed in the PC and save them.","ArifAhmed2,  please provide sample screen shots because when you refer to OneNote website, do you mean my Office 365 portal OneNote site or the Microsoft Apps site? or do you mean the \"Notes\" data files themselves from the Office 365 portal for me. And not obvious how one \"uploads them\".","https:\/\/www.onenote.com\/notebooksGo to above website. Enter your email and password. You will see your Notes.","ok, that's progress. that url is a shortcut to the Office 365 ON web app and I signed in with my Office 365 login.Then yes, i do see the \"download\" selection.I downloaded a single ON doc, automatically a zip was created. Unzipped it on my local drive. There were two files. But I don't see a \"file open\" choice in WIn 10 OneNotes.  When I use FIle Explorer to click on either of the two files downloaded. ON Win 10 opens and gives me a message that the file is in archive format. I say convert and only get a blank notebook.   Also seems that after clicking on one of the files, it gets deleted."]},{"symptom":"Wrong file size displayed        I am getting this in my F drive. I updated windows, scanned it using Windows Defender Offline scan but still it's appearing like this. Please help","solutions":["Hi Divyashree Windows 10 has never, ever been able to display the size of folders in Windows File Explorer, that column will show a random size . . .We have for many years tried to get Microsoft to add this functionality to Windows, but it has not happened yet . . .If you want to find the size of a folder, you must right click a folder and choose PropertiesIf you want to view the size of all folders on a drive: Click the link below to download a small free utility called Treesize. Using that tool, you will instantly see where this space is being usedhttps:\/\/www.jam-software.com\/treesize_free\/________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]},{"symptom":"Driver irql not less or equal. Ndis.sys        As i am using my p.c. a blue screen suddenly comes up with the above subject message. This can happen at any time and on average roughly once a day. It normally happens in the middle of something important, but i guess that is when all problems happen.","solutions":["Hi, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.We need log files(called dump files) that tell us what lead to crash. Please share them with us for a better analysis of the problem. Instructions can be found here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Please let us know if you need any assistance about posting dump files.","Thank you very much for your help.This information is way over my head unfortunately. I do wish that i could do what you are telling me. Thank you for your help anyway.Hooly Dooly.","Hi Hooly, I would try to explain as best as I can. Press Windows+R buttons on the keyboard to open Run. Type in the following and press Enter. C:\/Windows\/Minidump Copy the files inside to the desktop. Open https:\/\/Onedrive.live.com and upload the files you copied to the desktop.Right click the files and select Share. Copy the link in the next reply.","https:\/\/1drv.ms\/u\/s!https:\/\/1drv.ms\/uhttps:\/\/1drv.ms\/u\/s!Ak2txdbFB7yEhQmKKelewdugbUe_?e=69ZQGA\/s!Ak2txdbFB7yEhQgEEugCS-E5aiJD?e=JVH1P4?e=mQKGGUThank you once again for your help. I have put in three files and i sincerely hope that i have done what you need to help me.This is way out of my league.Thanks again, Hooly.","Unfortunately, that did not work :( I have another method. Please open the link and choose upload and upload the dumps on the folder. When done let me know.","I really do not know what i am doing wrong but i cannot for the life of me work out how to do what you are asking.I am really sorry, but i am very thankful for you trying to help me.Thank you again.","No issues. I have asked someone else to help you :) Have a good weekend!","Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.IRQL not less or equal error occurs due to Wireless driver malfunction.Please download the WiFi adapter driver from the Manufacturer's website.You can also share the Model Number of the PC so that I can share the download link of the driver.","Hello Arif,Thank you for your help.Do i get the wifi adapter from microsoft?How do i find the model number of my pc. It is a desk top, i dont know if that makes any difference or not.This is way beyond me but i am trying.Thank you again for your help.","You can find the Model Number by following the steps bellow. Type \"System Information\" in Start Menu and open it. Look for Baseboard Model or System SKU. Let me know this information so that I can get you the driver."]},{"symptom":"Sound Icon in system tray missing        For my Windows 8.1 notebook, I read another article that mentioned said to enable the sound icon in system tray and the steps were super simple until I reached a dead end.1.) Right-click on the taskbar2.) Select Properties3.) Select \"Customize\"4.) Select \"Turn system icons on or off\"After that, I found the option to enable the sound icon in the system tray as mentioned in said article, but to use the drop down menu was impossible as it was simply grayed out.","solutions":["It's Volume Icon you want.The first part is how I do it:Click on the little up arrow ^ in right hand side of Taskbar > then click on Customize > in the next window, Notification Area Icons > under \"What you want to alter, etc....\" in left Icons column, change the settings under Behaviours right hand column to show it.\"How to Hide or Show System Icons and Notifications in Windows 7 and Windows 8\"http:\/\/www.sevenforums.com\/tutorials\/293-notification-area-icons-hide-show-system-icons-notifications.html\"How to Turn System Icons On or Off in Windows 7 and Windows 8\"http:\/\/www.sevenforums.com\/tutorials\/292-system-icons-turn-off.html\"How to Reset the Notification Area Icons Cache in Vista, Windows 7, and Windows 8\"http:\/\/www.sevenforums.com\/tutorials\/13102-notification-area-icons-reset.html_________________________________________________You could also do a System Restore to before the problem.\"How to Do a System Restore in Windows 8 and 8.1\"http:\/\/www.eightforums.com\/tutorials\/4692-system-restore-how-do-windows-8-a.htmlCheers."]},{"symptom":"windows boot        In the past five months, my laptop has failed to boot to windows directly. I first thought it was a software problem and after changing windows, the problem was still there. The hard disk is also perfect, and the specs of my laptop make it one of those laptops that can support windows! I am actually shocked and I do not know the next move.","solutions":["The laptop is hp Elitebook folio 9470m core i5 3rd generation","Hi Pius When you say Windows fails to boot directly, what exactly happens when you try to boot up that laptop, what is the exact sequence you see on the screen?You mention .changing Windows', do you mean you re-installed Windows, if so, did you just reset Windows 10 or did you clean install Windows 10 using bootable USB media?If you did clean install Windows 10, did you then go to the support page on the HP website to download and install a full set of device drivers for your laptop?","When I open(boot) my laptop, it delays\/hangs at the hp logo and does not open windows. First of all, I tried resetting windows but that did not solve the problem. I then tried re-installing windows but that has also not solved the problem.I also updated all the drivers on my laptop.","Hi Pius That laptop should run Windows 10 with no great problems, I would suspect the age of the hard drive is causing this, it is nearly 6 years old and probably on its last legs . . .","What about the laptop? It is a core i5-3337u 1.80ghz. Can the generation of the processor be affecting windows in that it can not support windows 10?I check the health of the hard disk and it is 100%","Hi Puis With a 3rd gen i5 I would only install Windows 10 up to version 1703, more recent Windows 10 versions like 1809, 1903 and 1903 have made hardware of that age legacy and sometimes not supported, particularly the Chipset, Video and Network cards . . .","Thank you! This seems a great idea. I'll try that","Hey Dave M121,Would installing the latest version of windows plus intel drivers for that version of Windows support the windows in i5 3rd generation laptop?"]},{"symptom":"My new device is showing under \"Devices\" but my old device is showing when I attempt to reinstall Office 365        My ACER laptop - on which Office 365 was loaded recently - was stolen in Dec'19.I now have a LENOVO, on which I would like to reinstall Office 365 but... - My new device is showing under \"Devices\"  - but my old device is showing up when I attempt to reinstall Office 365Please assist ASAPThank you","solutions":["Hi Virginie On the new Lenovo, go to http:\/\/www.office.com and if you're not already signed in, select Sign inOn that page, you should simply need to click 'Install' to install Office 365 on your new system, there will be no need to use a product key . .Is that not working for you? Also on that pate, click the Gear icon on the top bar Select Office 365 settings under the My app settings heading Click Install status on the left hand sidebar You should then be able to deactivate the old installation from there . . ."]},{"symptom":"Dynamic Lock allow windows to automatically lock your device when away greyed out        Hi Communityplease look at the pictures !not able to change Dynamic Lock settings, because the option is greyed out !the group policy editor does not list Dynamic Lock configuration !Kind Regards","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Did you try to Unpair your device or reset the Bluetooth Driver? If you did not try these, please try Unpairing your phone and Pair it again. Then check if it works.If it still does not work, please reset the Bluetooth adapter driver and connect the device again.Steps: Go to Device Manager. Locate Network Adapter. Double tap on Network Adapter. Right click on the Bluetooth Driver and select Uninstall. (Do Not click on ant check box)Restart the PC.","Thank you Arif, but unpairing and reinstalling did not solve the problem.","Okay, please try this registry fix. Enable Dynamic Lock Using Registry Editor: Open the Registry Editor and navigate to the following path: HKEY_CURRENT_USER\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon Double-click on the EnableGoodbye entry on the right, and set its value data as per your requirement. 0 = Disable, 1 = EnableSo, put 1 as the registry value to Enable.","was on 1, changed it to 0, but no suxess, option still greyed out ","Please try changing the value again from 0 to 1 and check","no success ;maybe the group policy settings ?remember :SOME OF THESE SETTINGS ARE HIDDEN OR MANAGED BY YOUR ORGANIZATION  ","\"Some settings are managed by your organization\" message can appear due to your registry. Certain registry values can interfere with your operating system and cause this and other errors to appear.Please perform the following steps: 1. Press Windows Key + R and enter regedit. Now press Enter or click OK. Registry Editor will now start.2. Before we make any changes, it’s recommended to export your registry. The registry is sensitive to changes, and sometimes new issues can appear if you modify your registry, therefore it’s a good idea to create a backup. To do that, follow these steps:Click on File > Export. 3. Now select All as Export range and enter the desired name. Choose a save location and click the Save button.Once you do that, you’ll create a backup of your registry. You can use this file at any time in order to restore your registry to its original state if anything goes wrong.4. In the left panel, navigate to the following directory: HKEY_LOCAL_MACHINE\\SOFTWARE\\Policies\\Microsoft\\Windows\\WindowsUpdate key. In the right pane, look for Wuserver. 5. Right-click Wuserver and choose Delete from the menu. A confirmation dialog will now appear. Click Yes to remove this entry. 6. Restart the Computer.","thank you Arif, but not going there.rather waiting for the program to work genuinely. because right now it does not work at all !DYNAMIC LOCK does not connect to my Samsung android cell phone (though bluetooth transfer at the same time is possible) nor does it lock the account (which the program actually is supposed to do in this case) ! same problem exists at all 6 of my laptops independently !","Okay, will it be possible to arrange another Android phone and pair via bluetooth and check if it works for Dynamic Lock?","done, but still not operating09:30 pm, found out, windows bluetooth settings do NOT show my cell phone as CONNECTED only as PAIRED, though bluetooth transfer is possible ! weird !"]},{"symptom":"Surface Book 2 BSOD - DRIVER_POWER_STATE_FAILURE (9f) - Suspect Surface Dock        Hi,I recently purchased a Surface Dock and since then I have started to have DRIVER_POWER_STATE_FAILURE (9f) BSODs when the system is idle, I assume when trying to hibernate.  The crash dump below suggests that this is related to the dock ethernet drivers. The msux64w10 driver version is 10.7.807.2018 and I have tried to update the dock firmware but cannot tell if this has worked as the instructions talk about a flashing light while updating in the Eth port, but there are not LEDs on this dock!  Any ideas?Microsoft (R) Windows Debugger Version 10.0.18362.1 AMD64Copyright (c) Microsoft Corporation. All rights reserved.Loading Dump File [C:\\Windows\\MEMORY.DMP]Kernel Bitmap Dump File: Kernel address space is available, User address space may not be available.Symbol search path is: srv*Executable search path is: Windows 10 Kernel Version 17763 MP (8 procs) Free x64Product: WinNt, suite: TerminalServer SingleUserTSBuilt by: 17763.1.amd64fre.rs5_release.180914-1434Machine Name:Kernel base = 0xfffff800`3de02000 PsLoadedModuleList = 0xfffff800`3e21b710Debug session time: Fri Jan 10 00:31:17.428 2020 (UTC + 0:00)System Uptime: 0 days 3:48:12.433Loading Kernel Symbols......................................Page 2001e354c too large to be in the dump file.............................................................................................................................................................................................................Loading User SymbolsLoading unloaded module list..........................For analysis of this file, run !analyze -v0: kd> !analyze -v********************************************************************************                                                                             **                        Bugcheck Analysis                                    **                                                                             ********************************************************************************DRIVER_POWER_STATE_FAILURE (9f)A driver has failed to complete a power IRP within a specific time.Arguments:Arg1: 0000000000000003, A device object has been blocking an Irp for too long a timeArg2: ffffd503d395b8f0, Physical Device Object of the stackArg3: fffff800408687d0, nt!TRIAGE_9F_POWER on Win7 and higher, otherwise the Functional Device Object of the stackArg4: ffffd503cbe7b010, The blocked IRPDebugging Details:------------------Implicit thread is now ffffd503`d6527040KEY_VALUES_STRING: 1PROCESSES_ANALYSIS: 1SERVICE_ANALYSIS: 1STACKHASH_ANALYSIS: 1TIMELINE_ANALYSIS: 1DUMP_CLASS: 1DUMP_QUALIFIER: 401BUILD_VERSION_STRING:  17763.1.amd64fre.rs5_release.180914-1434SYSTEM_MANUFACTURER:  Microsoft CorporationSYSTEM_PRODUCT_NAME:  Surface Book 2SYSTEM_SKU:  Surface_Book_1832SYSTEM_VERSION:  D:0B:10K:0F:5C:10P:38BIOS_VENDOR:  Microsoft CorporationBIOS_VERSION:  389.2837.768BIOS_DATE:  08\/21\/2019BASEBOARD_MANUFACTURER:  Microsoft CorporationBASEBOARD_PRODUCT:  Surface Book 2DUMP_TYPE:  1BUGCHECK_P1: 3BUGCHECK_P2: ffffd503d395b8f0BUGCHECK_P3: fffff800408687d0BUGCHECK_P4: ffffd503cbe7b010DRVPOWERSTATE_SUBCODE:  3FAULTING_THREAD:  ffffd503d6527040CPU_COUNT: 8CPU_MHZ: 840CPU_VENDOR:  GenuineIntelCPU_FAMILY: 6CPU_MODEL: 8eCPU_STEPPING: aCPU_MICROCODE: 6,8e,a,0 (F,M,S,R)  SIG: B4'00000000 (cache) B4'00000000 (init)BLACKBOXBSD: 1 (!blackboxbsd)BLACKBOXPNP: 1 (!blackboxpnp)DEFAULT_BUCKET_ID:  WIN8_DRIVER_FAULTBUGCHECK_STR:  0x9FPROCESS_NAME:  SystemCURRENT_IRQL:  2ANALYSIS_SESSION_HOST:  YAR-CLE-PC03ANALYSIS_SESSION_TIME:  01-10-2020 08:17:39.0292ANALYSIS_VERSION: 10.0.18362.1 amd64freLAST_CONTROL_TRANSFER:  from fffff8003deaa627 to fffff8003dfbf546STACK_TEXT:  ffffd309`91e7fd60 fffff800`3deaa627 : 00000000`00000000 ffffd503`d6527040 ffffd309`91e80280 ffffd503`cbe80010 : nt!KiSwapContext+0x76ffffd309`91e7fea0 fffff800`3deaa199 : ffffd503`c99851a0 ffffd309`91e80280 ffffd309`91e7ff90 fffff800`00000000 : nt!KiSwapThread+0x297ffffd309`91e7ff60 fffff800`3dea8f20 : 00000000`00000100 ffffd503`00000000 fffff800`00000000 ffffd309`91e80071 : nt!KiCommitThreadWait+0x549ffffd309`91e80000 fffff800`3de63b70 : ffffd309`91e80108 00000000`00000000 fffff800`52f6a400 fffff800`52e2bc00 : nt!KeWaitForSingleObject+0x520ffffd309`91e800d0 fffff800`52f9a99c : fffff800`52e06180 00000000`00000001 00000000`00000004 ffffd309`91e80428 : nt!ExWaitForRundownProtectionReleaseCacheAware+0xa0ffffd309`91e80140 fffff800`52e3707a : ffffd503`d5e25100 fffff800`00000003 ffffd503`c67e8660 ffffd503`c67e8660 : tcpip!FlpWaitForMiniportToReturnTransmittedPackets+0x14ffffd309`91e80170 fffff800`52e062b4 : 00000000`00000000 fffff800`51d508e0 00000000`7377444e 00000000`00000008 : tcpip!FlpUninitializePacketProviderInterface+0x52ffffd309`91e801b0 fffff800`52e0618e : ffffd503`d6dee280 00000000`00000008 ffffd503`bce138e0 ffffd309`91e80420 : tcpip!FlPnpEvent+0x108ffffd309`91e80250 fffff800`51d72119 : ffffd503`d5e251e0 fffff800`51d66e04 ffffffff`5f114500 00000000`00000002 : tcpip!Fl48PnpEvent+0xeffffd309`91e80280 fffff800`51d71dba : 00000000`00000008 ffffd503`d6dee280 ffffd503`bce138e0 ffffd503`d6dee280 : ndis!ndisInvokeNetPnPEvent+0x49ffffd309`91e802c0 fffff800`51dbe47a : 00000000`c00000bb ffffd309`91e80420 ffffd503`bce138e0 ffffd503`cbe87c70 : ndis!ndisDeliverNetPnPEventSynchronously+0x9effffd309`91e80320 fffff800`51d6e8fd : ffffd309`91e80570 ffffd309`91e805e9 ffffd309`91e80570 ffffd503`c99851a0 : ndis!ndisPnPNotifyBinding+0xdeffffd309`91e80500 fffff800`51d6a15c : ffffd503`d6dee280 fffff800`51d7066b ffff8f0f`b6f03de0 ffffd309`91e805f9 : ndis!ndisPnPNotifyBindingUnlocked+0x35ffffd309`91e80550 fffff800`51d6a08e : ffffd309`91e806c0 ffff8f0f`b6f04780 00000000`00000000 ffffd503`00000000 : ndis!ndisPauseProtocolInner+0x68ffffd309`91e80650 fffff800`51d6fe42 : 00000000`00000000 ffffd309`91e80790 00000000`00000001 ffffd503`c99865b8 : ndis!ndisPauseProtocol+0x66ffffd309`91e80690 fffff800`51d6fc73 : ffffd503`c99865b8 ffffd503`c99865b8 ffffd503`c9986630 ffffd503`c99851a0 : ndis!Ndis::BindEngine::Iterate+0x13effffd309`91e80800 fffff800`51d724ed : ffffd503`c99865b8 ffffd503`cbe7b000 00000000`00000000 ffffd309`91e80880 : ndis!Ndis::BindEngine::UpdateBindings+0x7bffffd309`91e80830 fffff800`51d6f9d0 : ffffd503`c99865b8 00000000`00000000 ffffd503`c99865b8 fffff800`51d703d7 : ndis!Ndis::BindEngine::DispatchPendingWork+0x75ffffd309`91e80860 fffff800`51cdfffb : ffffd503`c99851a0 ffffd503`cbe7b020 ffffd503`c99865b8 00000000`00000003 : ndis!Ndis::BindEngine::ApplyBindChanges+0x54ffffd309`91e808b0 fffff800`51ce0355 : 00000000`00000800 ffffd503`cbe7b010 ffffd503`c99851a0 ffffd503`c99851a0 : ndis!ndisPrepForLowPower+0x20993ffffd309`91e80980 fffff800`51d67bda : 00000000`00000000 ffffd503`cbe7b010 ffffd503`cbe7b680 ffffd503`d6b2e490 : ndis!ndisSetDevicePower+0x20919ffffd309`91e809f0 fffff800`51cd3c01 : ffffd503`cbe7b010 ffffd503`d395b8f0 ffffd503`cbe7b680 ffffd503`cbe7b010 : ndis!ndisSetPower+0x5effffd309`91e80a30 fffff800`3df70016 : ffffd503`d6527040 ffffd309`91e80ae0 ffffd503`cbe7b010 ffffd503`cbe7a100 : ndis!ndisPowerDispatch+0xa1ffffd309`91e80a60 fffff800`3de5a9c5 : ffffffff`fa0a1f00 fffff800`3df6fdf0 ffffd503`c616b770 00000000`00000000 : nt!PopIrpWorker+0x226ffffd309`91e80b10 fffff800`3dfbfdfc : ffffbc82`003cf180 ffffd503`d6527040 fffff800`3de5a970 00000000`00000000 : nt!PspSystemThreadStartup+0x55ffffd309`91e80b60 00000000`00000000 : ffffd309`91e81000 ffffd309`91e7a000 00000000`00000000 00000000`00000000 : nt!KiStartSystemThread+0x1cSTACK_COMMAND:  .thread 0xffffd503d6527040 ; kbTHREAD_SHA1_HASH_MOD_FUNC:  0d4afe61821f4ce125981cea28a3b288745a5608THREAD_SHA1_HASH_MOD_FUNC_OFFSET:  30cc7d81059d4ad4e1455b8febfd23d1f7c7b2dfTHREAD_SHA1_HASH_MOD:  3ff2f9e2eba41bc3c3b5337f3bb249eb0e2b33c1FOLLOWUP_IP: tcpip!FlpWaitForMiniportToReturnTransmittedPackets+14fffff800`52f9a99c 4883c428        add     rsp,28hFAULT_INSTR_CODE:  28c48348SYMBOL_STACK_INDEX:  5SYMBOL_NAME:  tcpip!FlpWaitForMiniportToReturnTransmittedPackets+14FOLLOWUP_NAME:  MachineOwnerMODULE_NAME: tcpipIMAGE_NAME:  tcpip.sysDEBUG_FLR_IMAGE_TIMESTAMP:  257daf83BUCKET_ID_FUNC_OFFSET:  14FAILURE_BUCKET_ID:  0x9F_3_tcpip!FlpWaitForMiniportToReturnTransmittedPacketsBUCKET_ID:  0x9F_3_tcpip!FlpWaitForMiniportToReturnTransmittedPacketsPRIMARY_PROBLEM_CLASS:  0x9F_3_tcpip!FlpWaitForMiniportToReturnTransmittedPacketsTARGET_TIME:  2020-01-10T00:31:17.000ZOSBUILD:  17763OSSERVICEPACK:  0SERVICEPACK_NUMBER: 0OS_REVISION: 0SUITE_MASK:  272PRODUCT_TYPE:  1OSPLATFORM_TYPE:  x64OSNAME:  Windows 10OSEDITION:  Windows 10 WinNt TerminalServer SingleUserTSOS_LOCALE:  USER_LCID:  0OSBUILD_TIMESTAMP:  unknown_dateBUILDDATESTAMP_STR:  180914-1434BUILDLAB_STR:  rs5_releaseBUILDOSVER_STR:  10.0.17763.1.amd64fre.rs5_release.180914-1434ANALYSIS_SESSION_ELAPSED_TIME:  5a9cANALYSIS_SOURCE:  KMFAILURE_ID_HASH_STRING:  km:0x9f_3_tcpip!flpwaitforminiporttoreturntransmittedpacketsFAILURE_ID_HASH:  {56e2c87f-3e61-a984-a054-31675410c461}Followup:     MachineOwner---------0: kd> !devstack ffffd503d395b8f0  !DevObj           !DrvObj            !DevExt           ObjectName  ffffd503c9985050  \\Driver\\msux64w10  ffffd503c99851a0  NDMP20> ffffd503d395b8f0 Page 20018d3b7 too large to be in the dump file. \\Driver\\USBHUB3    ffffd503d5eb27f0  USBPDO-6!DevNode ffffd503d89dc9a0 :  DeviceInst is \"USB\\VID_045E&PID_07C6\\000001000000\"  ServiceName is \"msux64w10\"","solutions":["Hi Matt Most likely this is caused by your Network card device driver, however, to diagnose the underlying issue, I need to analyse your Mini-dump file(s):Open Windows File Explorer Navigate to C:\\Windows\\Minidump Zip up the contents of that folder If you have problems zipping those files, copy them out onto your Desktop and zip them from thereUpload the zip file to the Cloud (OneDrive, DropBox . . . etc.) Then post a link here to the zip file, so we can take a look for you . . .","Thank you Dave!Here is a link to the zipped Minidump fileshttps:\/\/drive.google.com\/file\/d\/1rxWF68CQekevLRfIumwPTCYZzPZyaUCP\/view?usp=sharing","Hi Matt Those minidump files just indicated a Memory Corruption error, which is generic and does not actually point to a specific driver . .You should still install the set of drivers released for your Surface, that were released on 25 November, which will hopefully stabilize your system . . .https:\/\/www.microsoft.com\/en-us\/download\/detail...","Thanks Dave,I downloaded and installed the latest of the updates from the link you provided, however, I got another 9f BSOD last night while the computer was idle.  The crash dump looks exactly the same a before. This has only started happening since I started using the Surface Dock.Here is a link to the latest mini dump.https:\/\/drive.google.com\/file\/d\/1rE0iZDQYg44SFD4CAO1mI7w0i7Lorh-p\/view?usp=sharingAny further thoughts?","Hi, There was a Bug Check 0x9F: DRIVER_POWER_STATE_FAILURE, This error indicates that the driver is in an inconsistent or invalid power state.And the driver of \"USB FastGigabit Ethernet NIC\" is causing the error. Driver: \"msux64w10\"","Hi, There was a Bug Check 0x9F: DRIVER_POWER_STATE_FAILURE, This error indicates that the driver is in an inconsistent or invalid power state.And the driver of \"USB FastGigabit Ethernet NIC\" is causing the error. Driver: \"msux64w10\" Thank you, I had worked this out and have updated to the latest drivers but this is still happening. What I need to understand is why this is happening, and how to fix it. ","As a further update to this, last night I disconnected the ethernet cable from the Surface Dock and I did not get a BSOD, whereas with the cable connected I was getting a BSOD every evening.Any advice on how I can get to the bottom of this?"]},{"symptom":"I cannot delete any photos.        When trying to delete photos I get an icon that says \" photos being used in another app. or you do not have permission\" any help would be great. Thanks","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please make sure the image you want to delete is not getting used by another Application at that time.If it still dors not delete, please boot the PC in Safe Mode and try to Delete the photos.","I do I know if they are being used with another app ? Thank You","Please enter Safe Mode and try to delete them."]},{"symptom":"Calls do not appear in Your Phone app on my PC        Working with Win 10 Pro, Ver 1903, build 18362.535. Using Galaxy S9 with Android 8.I can only see SMS, notifications and pictures on my PC but the CALLS menu does not appear at all.Tried already all suggestions of Microsoft including uninstalling and disconnecting my phone from PC and reconnecting with no change.","solutions":["Hi rafimandler Last week, Microsoft temporarily removed the Calls functionality from the Your Phone App, there are resolving some problem with that and that functionality will be restored as soon as possible . . .","Thanks Dave! Why can't Microsoft mention anything about this??? Wasting so much time trying to figure out what's wrong....How shall we know it's back?Thanks again!Rafi","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. An update will be available shortly related to the Call Feature. You can check for update of the app at Windows Store.","still dosnt work, no option for calls"]},{"symptom":"ms-resource:AppName\/Text appeared on Start Menu All Apps since 1903 update        This rogue entry, which does not start anything and can't be removed, appeared on most of the accounts across all of our three different machines. If you drag the entry to the desktop, it seems that underneath the \"ms-resource:AppName\/Text\" it is pointing at Microsoft.Windows.HolographicFirstRun which is not listed anywhere else (Settings\/Applications) and even through PowerShell Get-AppXPackage.It would appear this is something that was uninstalled but left the entries which the (new Start Menu in 1903) All Apps picks up.I have found no way to delete this rogue entry - and searching for this shows plenty of examples of the problem, and STILL no resolutions.I don't have the time (at least a week) to rebuild the machines, nor the time to try to recreate all of the users across them - which is prone to too many errors in doing this (the machines variously have complex set of uses including gaming, video\/photo editing, VR and music production).Surely it is not beyond the wit of Microsoft (or even a third party) to provide a fix for this - or a generic tool to allow experienced users to clean-up entries from All Apps menu (or a FixIt tool to clear these sorts of issues automatically) when these sorts of corruptions occur, which do seem to be too many times (unfortunately).","solutions":["Well the the python script I wrote is just to make sure that the commmandGet-AppxPackage-all *HolographicFirstRun* | Remove-AppPackage-AllUserscan be executed successfully. At least, in my computer, Microsoft.HolographicFirstRun cannot be uninstalled until I change IsInbox to 0.Any way, the annoying entry has gone.","For anyone who want to remove ms-resource:AppName\/Text, here's a solutionhttps:\/\/gist.github.com\/DoubleLabyrinth\/ffae94cb9444bbdae1d11deeaa247310Having to install Python 3 just to fix this problem is a really contrived solution. But the reading there set me on the right track, and turns out thefix.py script (and hence Python3 as well) is not even needed. In fact, not even a reboot is needed.All you need is this:Run Powershell with Admin privilegeOn the prompt, run this command:Get-AppxPackage -all *HolographicFirstRun* | Remove-AppPackage -AllUsersOpen Task manager, kill explorer.exe (keep the powershell console open)Back on the prompt, type:cd $Env:localappdata\\Packages\\Microsoft.Windows.StartMenuExperienceHost_cw5n1h2txyewyIf the previous command succesfully put you on AppData\\Local\\Packages\\Microsoft.Windows.StartMenuExperienceHost_cw5n1h2txyewy directory inside your profile dir, then run:Remove-Item -Recurse -Force .\\TempState\\Start explorer.exe back up from task manager (File -> New Task)The rogue start menu item should be gone.Just for kicks, after doing the above I checked out the database that the Python script messes around with. The record for the HolographicFirstRun package on the Package table (where theIsInbox column value is changed, which is the point of the script) no longer existed - so that Python script was really a whole lotta work for nothing. *shrug*"]},{"symptom":"Windows 10 Home Group Policy Editor        I have windows 10 Home installed. From what I understand is that Group Policy Editor is not available on the Home edition. However I can open it with gpd.msc. Does it mean that it works on my HOME edition?","solutions":["Hi Deon, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.There is a way to access Group policy editor in Windows 10 Home, as mentioned in the link below.https:\/\/www.makeuseof.com\/tag\/access-group-poli...Your computer might be configured with that hence you can use and it would most likely work.Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"Face Recognition        I have a surface pro used by my husband and myself. As I clicked on my account to sign in, my 2yo daughter was standing infront of the screen while I was standing. To my surprise, the laptop signed in using my daughter’s face. And I tried it so many times.Is this normal? Has anyone ever encountered this? My daughter does sure looks like me when I was her age, but it makes me think that the face recognition isn’t as secure since it can sign in with similar faces (even not the same age!).","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as the facial recognition is accepting your two year old daughter’s face to unlock the Surface. Ideally this should not happen. In this scenario, we would suggest you to reconfigure\/recalibrate Windows Hello with Facial recognition. Login to surface on your account.Press Windows + I key to open Settings.Click on Accounts and thenSign in options. In that see SectionFace Recognition and then select Remove.Restart the PC and login with PIN or Password.Then PressWindows + I key to open Settings.Click on Accounts and thenSign in options.In that see SectionFace Recognition and then select Set up. Note: Make sure when you are setting up the facial recognition, your daughter or any other person should not be in front of the PC. As an additional information, you can refer this doc article:Windows Hello face authentication Hope it helps. Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"window 10 pro activation        Hi every one!I bought a  ( windows 10 pro for OEM software) to activate my window 10 pro but it is not working can any body help me in this case ???","solutions":["Where did you buy it?","Hi Waheed,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.From where did you buy the key?Try using CMD to change the key(option 5) using the steps given here:https:\/\/www.tenforums.com\/tutorials\/7209-change...Also there is a slight chance that the product key from a 3rd party Store might not work. In that case you need to contact the seller.Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads.","I bought these licenses from local market","Hi Waheed,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.From where did you buy the key?Try using CMD to change the key(option 5) using the steps given here:https:\/\/www.tenforums.com\/tutorials\/7209-change...Also there is a slight chance that the product key from a 3rd party Store might not work. In that case you need to contact the seller.Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads.I have bought 36 of these activation codes from local market here in Afghanistan ","Hi Waheed, The seller probably sold you a used key. Ask him for a replacement or a refund."]},{"symptom":"On screen keyboard on dual monitors        Hi there, Is there a way to disable on screen keyboard on non touch screen monitor. The laptop opens up the on screen keyboard but the monitor with non touch screen also opens the same onscreen keyboard. Is it possible to open the on screen keyboard on only the touch screen for typing on the non touch screen monitor.Thanks ","solutions":["Are you duplicating the monitors or extending?If extending you may want to move the keyboard so it is not in the extended area, ie. to the left side of the screen.","thanks for replyingIt's the touch keyboard that has the icon on the taskbar. It pops up automatically on the screen when I click on the icon. It does the same on the dual monitor which is non touch screen. It just pops up from the taskbar icon.","Your problem is not that it pops up but where it pops up.If you are duplicating the monitors it will pop up on both.  If you are extending you may be able to have it just open on the primary monitor.","Thanks for reply, I extend my monitor. But I'm not able to put it on the primary monitor which is the touch screen. The keyboard pops in the extended monitor that does not have the touch screen. I am not able to find a setting that would disable the keyboard on non touch screen monitors."]},{"symptom":"Can't update 1703 to 1903: \"Not enough space\"                     This post will be longer and different than most, but I hope it shows as is, because it will be of benefit to a large market segment that normally gets overlooked.I am a retired senior on a fixed income and rely on my computer to stay in touch with friends and get information on Social Security, Medicare and the like. I could not call myself tech savvy by any stretch of the imagination, but I have a basic knowledge of how this works. I do not play games, stream movies or shows, or watch live news or live programs or anything of that nature. In other words, I have no need for stuff like the Xbox feature, and have no outside apps or superfluous crud of any kind on my computer. I regularly delete temp files and empty the trash bin.I have an HP Stream laptop I bought two years ago. It runs Windows 10 Home, version 1703.For the past few months I have been getting pop up messages several times a day, telling me \"feature update for Windows 10, version 1903\" is available, but cannot be downloaded because there is not enough space.I have clicked the \"Fix Issues\" tab countless times, followed all the prompts, and even added external storage as suggested. But to no avail. I have perused various Windows forums I was directed to through Bing and Google, read numerous posts and answers, and spent hours applying suggested fixes to a variety of error messages -- but I keep getting the same results.To list every step and fix I have tried would take several pages, and I am not going to do that. Suffice it to say that after all said and done, it eventually gets to a point where the screen message will read \"Downloading updates\" and a blue bar will go to 100%. Then \"Preparing to install updates\" and again a blue bar will go to 100%. Then it will sit there like that for several minutes, but finally the original message comes up again, stating that more space is needed yada yada yada. Very frustrating, to say the least. Surely there has to be a way to resolve this issue without having to go and pay some computer guru $200 -- which should not be necessary and I very definitely cannot afford, anyway.Current storage reading is: C Drive: 23.9 GB used out of 29.1 GB; D Drive: 3.24 GB used out of 29.2 GB. So it really is not like there is nowhere to put stuff. Just how much space is needed for that update??? There has to be an answer -- other than dynamite......Your comments and suggestions -- in plain english, please -- will be sincerely appreciated .Thanks.* Original title: Help for the gray haired part of the population","solutions":["Hi Henry #9 one option is to transfer files from your C-drive to your D-drive where you have 29.2GB of volume. The files to transfer from your C-drive are in your 'Download folder\", 'Documents\", 'Pictures', 'Music', 'Video & Movies' Delete any files that you do not need in those folders as they are only taking up valuable space that you need to use for your update\/upgrade. The more space you create in your C-drive the better!The only files you do not touch in your C-drive is 'Win 10'You can even delete the 3.24GB of data in your D-drive in order to create more room to accommodate transferred data from your C-drive?By doing this you will have enough space in your C-drive to Upgrade your Computer from the current Version 1703 to Version 1903Hope this will help you out?","Hi there, and thank you for the response.Okay. I opened the Download Folder from the Desktop and looked at what is in there.  The Pictures, Music, Video & Movies folders all are empty. The Documents folder has only one item, the Windows 10 Update Assistant (5.97MB). So, nothing to delete or transfer.When I click on C Drive, it shows these folders:Windows 10 Upgrade; Windows; Users; swsetup; Program Files (x86); Program Files; PerfLogs; Intel; inetpub  as well as a Text Document: url_setting_definitions 37KBWhere do I go from here?","Oops, I meant the Windows 10 Update Assistant is in the Download s folder, not the Documents folder. Sorry!","Hi there Henry#9, so it would appear that your chances of being able to upgrade your system to Win 10 Version 1903 is indeed very slim to being impossible, other than to purchase a new higher volume boot drive; an impossible suggestion, given your limited financial resources? As it is, all the free space in your system C-drive is a mere 5.20GB, which is totally inadequate to do the Upgrade of Win 10 to version 1903!Re-configuring Disk Management, looking for any partition to delete to make more room for your C-drive might not help either, given the current volume of your C-driveA Crucial 250Gb SSD drive as your new C-drive would be an ideal choice for an upgrade to allow you to upgrade your system to the next Win 10 Version 1903 and you a looking at a one-off spend of $80.00; but you can shop around for a better price, as there are so many Computer shops selling the same item these days?Just a suggestion and the decision is yours?RegardsGeorge","Hi George. Yoiks. I appreciate your candor but freely admit it is not the type of solution I was hoping for. Yes, there is a little more than 5GB of space on the C drive right now -- but just how much do we need total to facilitate the update? Is there really nothing else on the C drive that can be deleted or uninstalled?","Hi there Henry#9 you'll definitely need more than 5GB of volume in your C-drive to upgrade your computer, as Windows is telling you when you try to Update.Can you again click on your C-drive and then right click on 'Users' to see the volume of that folder and  also right click on 'Windows' to see its volume and let us know?NB: only right click with your Mouse!!!! and note down the volume of those two folders? Do nothing else!CheersGeorge","Hi Henry#9: addition, after right clicking on those two folders, click 'Properties' at the bottom of the option list and be careful NOT to click anything else.. just select 'Properties'and note down the volume in GBCheersGeorge","Hi George.Okay, here's what I did to execute what you suggested:Opened \"file explorer\" on task barThat brings up a screen and on the left it reads This PC: and underneath that: Desktop, Documents, Downloads, Music, Pictures, Videos, Windows (C).When I right click on Windows (C), it brings up a dropdown menu that reads: Expand, Scan with Windows Defender, plus a few more such things, Copy, Rename, New, and at the bottom, Properties.No sign of Users or Windows there that you said I should right click on.If I right click on Properties, it brings up another multi-tab window but at least it shows Used Space 22.9GB; Free Space 4.90GBIt seems the only way to get more info is to click on Expand. I tried that briefly and right clicked on it and it opens another screen that shows a bunch of folders: inetpub, Intel, PerfLogs, Program Files, Program Files (x86), swsetup, Users, Windows, Windows 10 Upgrade. But I did not open anything without getting your input.","OK that's great and that is the window we want to be on> Now right click on 'Users' and a drop down list will appear, then click 'Properties' and AVOID clicking 'Delete' which is just next to 'Properties'> then record\/write down the volume in GBNext, right click 'WINDOWS' and a drop down list will also appear then click 'PROPERTIES' at the bottom of the list and AVOID by all means, clicking 'DELETE' which is just before 'PROPERTIES'-if you are NOT confidant to do this then abandon looking at the volume Windows files use, so we just go with the volume of the 'USERS' folder?Let us have the results when you are readyCheersGeorge","Okay. Went to \"Users\" and then to Properties at the bottom. It reads:Size: 1.28GBSize on disk: 1.02GBThen to \"Windows\" and Properties at the bottom:Size: 20.6GBSize on disk: 15.0GBAs I'd mentioned previously, it also lists \"Windows 10 Upgrade\". It may not have anything to do with what you need, but I looked at that too.Size: 25.9MBSize on disk: 26.1MB"]},{"symptom":"Missing Operating System Files        In attempt to set-up my new wireless printer, I keep getting the message that operating system files are missing (i.e. c:\\windows\\inf\\usb.inf; windows\\inf\\usbprint.inf) and a couple others similar.  I was told to use the CD that came with my computer to fix these missing files; I don't have a CD.  I understand a CD can be purchased BUT I don't want to destroy the files that are already on my computer. Is there a product CD that will reinstall the missing OP files without having to uninstall everything and reinstall?","solutions":["In attempt to set-up my new wireless printer, I keep getting the message that operating system files are missing (i.e. c:\\windows\\inf\\usb.inf; windows\\inf\\usbprint.inf) and a couple others similar.  I was told to use the CD that came with my computer to fix these missing files; I don't have a CD.  I understand a CD can be purchased BUT I don't want to destroy the files that are already on my computer. Is there a product CD that will reinstall the missing OP files without having to uninstall everything and reinstall? This may seem a silly question but have you installed the Printers Drivers ???Follow the instructions as per printer set up.Usually the printer drivers will install what is required.Check your Device Manager to see if there is a issue with your Universal Serial Bus controllers. ","Unfortunately, I get just so far into the printer download of drivers installation process and I get the message that the following files are missing - c:\\windows\\inf\\usb.inf, windows\\inf\\ntprint.inf, windows\\inf\\usbprint.inf, windows\\inf\\usbstor.inf - and the installation stops.  I've gone to HP Support - they want lots of money to \"fix the files\".  This is a new printer, the computer itself is not new but other than the old printer stop working, the computer is fine.  Yes, from what I can see, there is a problem with the USB controllers, but how do I fix that problem? This is so maddening!"]},{"symptom":"Win10 BSOD Randomly whilst watching YouTube        Recently I was just chilling watching YouTube and for some unknown reason I got a BSOD; I was only watching YT and wasn't doing anything demanding with my PC.MSInfo32: MSInfo32.zipMinidumps: Minidumps.zipMinidumps_02: Minidumps_02","solutions":["Hi darylt77 I am sorry, can you try uploading those minidump files that link is not coming through . . .Open Windows File Explorer Navigate to C:\\Windows\\Minidump Copy any minidump files onto your Desktop, then zip those up Upload the zip file to the Cloud (OneDrive, DropBox . . . etc.), then choose to share those and get a share linkThen post the link here to the zip file, so we can take a look for you . . .","The links need to be clicked on and then select download; it uses end-to-end encryption so if you are right clicking on the link and using \"Save As Link\" it wont work."]},{"symptom":"Error: Something went wrong when installing State of Decay 2 from Microsoft Store        I purchased SoD2 UD for a friend.He tried installing it and got the \"something wrong on our end\" message.We waited a day, same error.We waited a couple of days, same error.We then found a healthy list of things to try, no love.We got the idea of booting into safe mode as we were finding apps active that were stopping us from completing one of the indicated steps.  Now he can't log on to the MS Store at all!Please help.***Original title: Can't install SoD2, can't log in while in safe mode, only error is \"something went wrong on our end.\"***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues while installing State of Decay 2 game on your friends PC. For further clarity on the issue, please respond to the questions below: Which build version of Windows 10 is installed on the PC?Are you aware of any changes made to the PC prior to which you weren’t facing this issue?Have you tried installing any other app from Microsoft Store?Do you receive any error code when you try to install the app? Refer the article Which version of Windows operating system am I running? Meanwhile, I would suggest you to follow the steps mentioned below and see if that helps. Method 1: Try resetting the Store and see if that helps. Press Windows key + R. This will openRun. Alternatively, you can go to Start and search for ‘Run’.In Run dialog box, type ‘wsreset.exe’ and hit enter. Note: A blank Command Prompt window will open, and after about ten seconds the window will close and Microsoft Store will open automatically. Method 2: Run the Store App troubleshooter to identify and fix problems. Press Windows + I key together to openSettings.Click on Update &Security and then click on Troubleshoot.On the right hand pane scroll down and look for Windows Store Apps.Click on it and select Run the troubleshooter.Follow the on-screen instructions. Method 3: Run the PowerShell command to re-register store. Press Windows + X keys together and click onWindows PowerShell (Admin).Now type in the command and hit enter: Get-AppXPackage *WindowsStore* -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register “$($_.InstallLocation)\\\\AppXManifest.xml”}Restart the PC. Method 4: Try creating a new user account and see if you are able to install the game. Refer the articleCreate a local user or administrator account in Windows 10 Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator"]}]}