{"windows":[{"symptom":"Inspiron 7386 Wifi throttling with Intel 9560        I have a Dell Inspiron 7386 which is about 11 month old so still under the basic 1 year warranty when the wifi started being very unreliable a kept dropping and even not finding the adapter at all. I returned the laptop to Dell who replaced the adapter and the motherboard.I am finding that if the laptop had been in sleep mode, the speed to a NAS drive was severely restricted as per CrystalMark[Read] Sequential 1MiB): 1.677 MB\/s [Write] Sequential 1MiB: 4.404 MB\/sI found that if I Enabled and Disabled the 9560 Adapter, full speed was returned:[Read] Sequential 1MiB: 31.876 MB\/s [Write] Sequential 1MiB: 37.543 MB\/sYesterday I spent 5 hrs on the phone with Dell support and did not resolve the problem. This included a restore of an original Win10 image and resetting the router. Other laptops in the house do not have the problem.We have replaced drivers and changed some BIOS settings but not solution yet.I pay for 80mbps download and 20 mbps upload and this is reduced to 20 and 20 unless I disable\/enable the adapter every time the PC wakes from sleep. I store Pictures\/Videos\/Backups on the NAS so this extends the access time by over a factor of 10 and in fact can't play 4K video as the speed is too slow at 1.7MB\/s.Dell confirm that this is not normal, but with a new motherboard, wifi adapter, and clean install, I'm stuck.If I set the power \/ sleep option on battery to Always Disconnect on sleep, it does resolve the problem if the PC is not charging. If it's charging, it going into throttled mode, but resolves itself if it then sleeps on battery mode.This is a crude workaround, but saves me disabling and enabling everytime it sleeps.I have trid a different router and the problem persists, and my wife's laptop is also fine.Any suggestions - sorry it's a bit long!RichardWindows 10 Home verion 1909 - latest update","solutions":["Hi Richard. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything so that at least something will work. Even if you've tried some of these steps already please do them over in sequence to see if it makes as difference:Update your network adapter drivers from the PC maker's Support Downloads web page using the full model number, HP Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.If you have the latest network driver then try on it's Driver tab also to Roll Back, or Uninstall and then restart PC to reinstall the driver. Try also all older drivers from Update Driver > Browse > Let Me Pick list working backwards.If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them.If this was caused by Version update then you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool.For Wifi won't connect after Version 1903: https:\/\/windows101tricks.com\/fix-wifi-keeps-dis...https:\/\/www.techrepublic.com\/article\/wi-fi-and-...https:\/\/pureinfotech.com\/fix-wifi-problems-wind...For Ethernet not working: https:\/\/www.kapilarya.com\/wifi-ethernet-doesnt-...Go to Device Manager > Network Adapters, select network adapter in use, click on the Power Management tab, clear the check box to \"Allow the computer to turn off the device to save energy.\" Then click on the Advanced tab, disable any energy-saving options.Enable IPv6 in the network adapter settings: https:\/\/www.tenforums.com\/tutorials\/90033-enabl... Run the fixit from https:\/\/support.microsoft.com\/help\/929852 (Re-enable IPv6 on all nontunnel interfaces) and reboot.Right click the network icon in System Tray at bottom right end of task bar to Troubleshoot Problems.Try all of these steps: https:\/\/support.microsoft.com\/en-us\/help\/10741\/... https:\/\/www.thewindowsclub.com\/windows-10-netwo...Go to Settings > Network & Internet > WIfi > Manage Known Networks, highlight and remove the network having problems, restart PC to see if it shows up again.Try plugging in by ethernet cable to the router to compare, then plug the ethernet cable into the modem (if separate) to see if this might be an issue with the router.Try powering off modem, router and PC and then restarting in that order with 1 minute in between each. You may need to reset your router or even optimize it following these steps:https:\/\/www.lifewire.com\/resetting-a-home-netwo...https:\/\/www.pcmag.com\/article\/258865\/how-to-set...Your router manual is always available from the manufacturer's website for your exact model.You also are entitled to Support from your internet provider to get online on all devices. This is always included in the monthly bill. If your router is less than a year old they will also Support getting it connected and optimized.Another option is you could replace the wireless adapter with an inexpensive USB nano adapter like this one:https:\/\/www.amazon.com\/OURLiNK-600Mbps-Wireless...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thanks for all those links and I shall work through them. Most of them I have tried, but shall recheck.The element that I don't understand is that with a new fresh image Windows 10 from the Dell repair facility when they fitted a new adapter and motherboard, I stll had the problem.I don't know where it is occuring - Dell Hardware or Windows Software or the Plusnet One router.I thought I had tested the router as my wife has no issues with her Dell laptop,This maybe a red herring but looking at the Network with a bit of windows software I compared three senarios.1 On Battery with full speed2 Running throttled on Power 2 Running properly on power after a disable\/enable of adapter.There is a difference in the Device Type and Service Type with the full speed at one setting and throttled (centre panel) on another. - I don't really know what I'll doing here!","If the adapter was replaced by Dell under warranty then they must get it working.The steps I gave usually resolve most normal issues with getting network connected. But this may be something related to the adapter itself. You can test this by plugging in an inexpensive USB nano adapter such as the one suggested.Please do not skip any steps. We often find out later that the fix was the skipped step. If you need help performing any step I will help.","I am working through the list, but no luck so far. I agree that it's looking like the adapter as I have tried a couple of n 2.4G usb adapters and I can't reproduce the problem. However, if I use the 2.4G SSID (I have 5G and 2.4G  split into two), I can't reproduce the problem either, so it's a 5G issue.As for Dell, I didn't quite give the full story, they have actually had the PC back twice and replaced the wifi card twice. It passes the windows diagnostic test, so they say it's OK.I have also extended the Dell warranty with the Premium edition for another 12 months which is a home visit rather than collect and return which took about 3 weeks.I have now set the on power sleep mode to never and the battery mode to always disconnect the network when sleeping. It now auto resets if it slips into throttling mode.Have you come across this before? I would like to set the on power sleep mode to Disconnect too, but there isn't a setting.Thanks for your helpRichard","See how to adjust your Power Plan settings here: https:\/\/www.tenforums.com\/tutorials\/2843-change...Do other devices on your network get a successful 5g connection?","Thanks again, I shall experiment with some of the PowerCFG options.No, other PC's using the 5G SSID don't have a problem either.It is interesting that if I try and add extra power plans, the system drops one so I only ever can see two listed. There maybe a small corruption in the registry here .My setting of AWAYS disconnect wifi on battery sleepandNEVER sleep when plugged in catches most options which mitigates the problem largely. If I plug in when in sleep mode it fails, but at the sleep, it resets again.My new Dell warranty doesn't cut in for a few week so  shall see how this works.Thanks againRichard","To find the missing Power Plans, right click the battery icon in System tray at right end of Task Bar, choose Windows Mobility Center, then Battery Status, choose the one you want to display.Go into Device Manager, open Network Adapters, then Wifi adapter. On the Power Management tab experiment with the checkboxes to see if they are interfering. These are different for each controller.Also have you assured you have the latest driver for the device from Dell, then compared it with the stock driver from the device manufacturer? I'd even try older drivers to see if one can be made to work. These may be queued at Wifi Driver tab > Update Driver > Browse > Let Me pick.","Thanks again for your help and suggestions. I am surprised this is being so difficult! This was a current production model till very recently and is still available new so rolling back drivers shouldn't be necessary.My workaround setup works well enough for now and if it becomes a problem, I shall go back to Dell Support when the Premium level kicks in.I have ordered a USB adapter anyway. My instinct is that it's the wifi adapter again, but done of the dell hardware tests confirm this. I'm 99.99% sure it's not the router or the NAS unit. .It is easily reproducible by changing the Network Connection on Battery in the Power and Sleep settings from ALWAYS to NEVER and pushing the power button to SLEEP (no power connected), wait 30secs, and wake up. It's then throttled. Disable\/Enable the wifi adapter and it's OK again. I use a shortcut which runs:C:\\Windows\\System32\\netsh.exe interface set interface name=\"WiFi\" admin = disabledand again with 'enable'.This other curious thing is there are no other reports of this, so that suggests - hardware.Richard","Richard, I agree that hardware is the likely culprit and will be interested to hear if the problem reproduces itself with the new USB nano adapter.One thing you may not have tried yet is thoroughly troubleshoot Sleep to see if that checklist turns up anything at fault. I will give you all possible fixes for Sleep. If you need help performing any step just ask back:First confirm you have the Sleep options configured correctly as shown here: https:\/\/www.tenforums.com\/tutorials\/2843-change....You might want to try Hibernate to succeed Sleep, or use Hibernate in place of Sleep - it's just a deeper sleep that actually powers off because desktop stored in RAM during sleep is written to hard drive hiberfile then powered off. When it starts up it loads the hiberfile and starts faster. Most Sleep problems are caused by the Display driver, so try updating yours from the PC or Device maker's Support Downloads web page for your full model number, Serial Number or Dell Service tag. While there make sure you have the latest BIOS, Chipset, Network, Sound, USB and all other drivers by comparing those posted for download with the version and date of the corresponding ones in the Device Manager.If that doesn't help then in Device Manager on Display device Driver tab choose Roll back, Uninstall (then restart to reinstall) or try another one previously installed at Device Manager>Display adapter>Driver>Update Driver>Browse>Let me pick.In addition there are steps here to specifically troubleshoot Sleep mode problems:http:\/\/www.makeuseof.com\/tag\/fix-windows-10-sle... What I do is go into Advanced Power options and set Display and Sleep to 1 minutes, Hibernate to 2 minutes, then after completing each step restart the PC and observe what happens for 3 minutes.Also did it previously work? Do you have a System Restore point from when it did?http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t...This may have been caused by Windows Updates. Check which Updates were installed right before the problem began, and if necessary uninstall them from Settings > Update & Security > Windows Update > Installed Update History.You can also try to roll back using System Restore to a point before this began: http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... Then if an Update reinstalls and causes the same problem uninstall or roll it back again, then immediately hide it using the Hide Updates tool from Method Two here:https:\/\/www.askvg.com\/fixing-windows-10-automat... If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1903 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Error code 0xC004F074        Please help me resolve error code 0xC004F074","solutions":["Hi Franz. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.That message normally means that someone has activated Windows with a KMS or Volume License Key meant only for business or organizations that activate a large number of PC's, which need to check in with the organization's server regularly to reactivate.Sometimes this is done by shops reinstalling Windows, unnecessarily because the PC either came with a Windows Product Key embedded in the BIOS\/UEFI firmware, or it was already activated by free Upgrade or a retail Product Key, and would have reactivated after a reinstall had they given it the chance and not interrupted this by installing the illegal key.If you know Windows was originally activated legitimately by one of these methods then to fix the problem what I would do is go offline to remove the Volume License key and then restore the Generic Product Key that is used to activate with the Digital License issued by Upgrade or Factory install, the factory key embedded in the UEFI\/BIOS firmware chip, or the retail key you used. Then we'll see if it activates:1) Go offline by opening Action center at the right end of Task Bar, then clicking on Airplane mode to turn off internet.2) Next type CMD in Start Search, right click to Run as Administrator, then right click to copy and paste this command in and press Enter: slmgr -upk3) Restart PC and then insert Generic Product Key for your licensed version from here:http:\/\/winaero.com\/blog\/generic-key-to-install-...This sets everything back to default so that if there is a Digital License issued during a proper Upgrade it should reactivate within a few days. If not we will need to try something else:If it doesn't activate after going online and you originally had factory installed Windows, read the Product Key embedded in the UEFI firmware chip at the factory by running ProducKey:http:\/\/www.nirsoft.net\/utils\/produkey-x64.zip, copy and paste the OEM-BIOS key (only) into Settings> Update & Security > Activation.If you were sold a Volume license product key or the PC came from seller activated with one, then It is piracy when someone resells Windows with no way to legally activate it. You can report this to Microsoft here:https:\/\/www.microsoft.com\/en-us\/howtotell\/cfr\/r.... In the past when victims cooperated with an investigation they would sometimes give them a free copy as thanks.You can also contact the seller and let him\/her know you are taking these actions and that they need to make the activation good. Many will comply rather than risk investigation or prosecution.For further assistance restoring the original legal activation you can contact Microsoft Support phone or chat options here:https:\/\/partner.support.services.microsoft.com\/... I hope having all possible options helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Will I still have my files after trying the generic product key ","I got an error message saying Error 0xC004F025 access denied :the requested action requires elevated privileges ","Hi Franz. May I ask why you rated me unhelpful before I even had the chance to reply? I said I would keep helping until it's resolved. I do have to sleep.What are you trying to do exactly when you get the error - you have never said. Are you trying to activate Windows?If so then restore the Generic key if you've tried any other. It will not affect your files. But of course your files should be backed up at all times anyway or they are valued at nothing.Your files should always be backed up because a hard drive can die at any time without notice. Some suggestions to help ease into this habit:1) You can sync your Desktop, Documents and Pictures folder using OneDrive Backup, or just drag valuable files into OneDrive folder, offering 5gb free with additional space for cheap:https:\/\/www.tenforums.com\/tutorials\/116029-turn... 2) Google Drive has a new Backup that allows you to choose User folders (Documents, Pictures, etc.) to sync up to 15gb for free to their cloud in real time so it always has the latest version.https:\/\/www.google.com\/intl\/en-GB_ALL\/drive\/dow... 3) In addition I'd have an on-site hard copy backup. The best way to do this is to sort all of your files into their User folders and then drag or copy them to another hard drive, USB external or flash drive. Here's how to drag, copy or move large groups of files: https:\/\/www.pcworld.com\/article\/2086566\/the-man... 4) Besides your files you should save a System Image back up to use in place of reinstall in 20 minutes. The best free alternative is Macrium:http:\/\/www.howtogeek.com\/howto\/7363\/macrium-ref... You can even use the Macrium program to mount and extract files from this image so it can serve as both image and file backup too.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I'm sorry for rating you unhelpful but please I don't have problem with backups. I have backed most of my files up on Google drive and OneDrive, but I'm unable to backup again due to the activation problem. Whenever I connect my PC to the internet it's says connected but the only app that uses the internet is chrome and I don't understand ","Greg,I am having the same issue with my laptop. I ran all the steps you laid out above, with the exception of the CMD prompt: when I click 'run as Administrator' nothing happens, and using your prompt when just running the app results in the same error message Franz listed. Nevertheless, I completed the steps using the generic key, and I am now getting an error of 0x803FA067 - 'not a valid digital license or product key'.To make all of this even more confusing, my laptop came with Windows 7, and I installed Windows 10 with the free upgrade. I have never purchased Windows 10 or been given a product key, as the free upgrade supposedly assigned this automatically. I have had no issues for the first 1.5 years of owning this laptop, but suddenly this error appeared a couple of months ago. Occasionally, the ghost image in the lower right corner saying 'Activate Windows' will disappear, but it always comes back the next time I use the computer."]},{"symptom":"how do I fix stopcode        how do I fix stopcode?","solutions":["Hi Dick Please check to see if your PC has produced any minidump files . . . Open Windows File Explorer Navigate to C:\\Windows\\Minidump Copy any minidump files onto your Desktop, then zip those up Upload the zip file to the Cloud (OneDrive, DropBox . . . etc.), then choose to share those and get a share linkThen post the link here to the zip file, so we can take a look for you . . ."]},{"symptom":"Where do I look for my pdf files? Since I replaced my cpu I cannot find it.        I am having trouble finding my pdf files after replacing my cpu","solutions":["Hi Pat Can you please provide a bit more detail, when you say you replaced your CPU, do you mean the whole unit, or just the processor?If you replaced the whole unit, what happened to the hard drive that was in that unit, did you move that across to the new unit?Do you use OneDrive to sync\/backup your files?"]},{"symptom":"Win 10 cant connect to wifi please help        So I got on my pc once and I could not connect to the internet.I went to network connections and it said wifi not connected.Then I went to the cmd and typed ipconfig it said media acces denied.I have a asus n14 802.11n wireless driver and driver is installed and everythingTroubleshooting doesnt work so that cant help me.Ive tried dissconecting the router and the pc so can anyone help me please","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please try resetting the Wireless Adapter driver and check. Go to Device Manager. Locate and double tap on \"Network Adapter\". Right click on the Wireless Adapter and select Uninstall. (Do Not click on any check box)Restart the PC."]},{"symptom":"missing an operating system        so ever since I bought my Lenovo Ideapad 320, i have been experiencing the same struggle. i would be using my laptop normally then it just turns into a black screen and when I restart it, it tells me that system needs repair so I try all the advanced options and nothing really works. for the last 3 times, I sent my laptop to an IT worker who would just install the windows again. But now this is the forth time this has happened so I really do not know what to do. While I was trying my advanced options for the 15th time today, I pressed system repair and suddenly a black screen with the words missing an operating system appeared. So can anyone please help me know what happened.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. I suggest to install the Windows 10 OS using the Media Creation tool. Please refer to the following page and download the Media creation tool. (Or ask the IT worker to use the media creation tool install Windows 10)https:\/\/www.microsoft.com\/en-in\/software-downlo..."]},{"symptom":"office 365 account        I want to add a computer to my office 365 account. How do I do that?","solutions":["Hi William If you want to add a PC that you log into and use yourself: On that PC, go to http:\/\/www.office.com and if you're not already signed in, select Sign inLocate your Office licence and click 'Install', that's it, you will not need a Product Key . . .If you have Office 365 Home and want to share your Office 365 licence with another person on another PC:On your PC: Sign in to https:\/\/account.microsoft.com\/services\/office\/s... Select Services & subscriptions FInd your Office 365 subscription and click Sharing Choose Invite via email or Invite via link If you select Invite via email, enter the email of the person you want to share with and then select Invite - Got itIf you want to invite someone else, select Invite someone else If you select Invite via link, copy the provided link then send that to the person or people you want to invite to share Office"]},{"symptom":"win 10 mail        Using Win 10 Mail when I hover over a picture in a message it shows the address of the picture.  How do I get rid of that","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? You can try: Navigate in the Windows Registry to HKEY_CURRENT_USER\\Control Panel\\Mouse in the right pane, double click on MouseHoverTime and change the value to something so high it virtually disables the popup.400 should be default, 4000 should do it. Requires a Restart. From TenForum website. I believe this is a feature which is built into the mail app & I feel it is a security feature as it’ll also show a popup when hovering over a link within an email, this will show whether the link is showing a genuine link or a scam site.If you wish you can send Microsoft feedback via Win key + F."]},{"symptom":"Windows 10 Lines of Code        Hey, can anybody give me a rough idea of how many lines of code there are in Windows 10? It's for a school assignment.","solutions":["Hi dnyge1024 There is approx. 50 Million lines of Code in Windows 10 . . .","Hey, can anybody give me a rough idea of how many lines of code there are in Windows 10? It's for a school assignment.Part of your assignment would be where to obtain such information from. The answer is amazingly simple: Ask Google like so:how many lines of code in windows 10","Yes but every reference on Google is based on numbers from older versions of Windows such as XP and Vista. I have seen no credible source which can point to a statement by Microsoft on it. Everybody is either trying to extrapolate for old numbers or saying that it was 50 million for Vista and we don't know what it is now."]},{"symptom":"Windows Search bar bug\/glitch        Hello everyone. I have an issue which has been bothering me for the past month and it is very annoying. I don't really know how i need to explain it but i made a video of it. Here. https:\/\/www.youtube.com\/watch?v=qVt-tHQ6ROMIf you know how i need to fix this, please leave it down it the comments of this question.Thanks!","solutions":["Hello Bort! My name is Marco, I am an Independent Advisor. I will do my best to help you.It looks like a keyboard which would have the TAB key to stick ... try to clean this key, or maybe also the arrows of the keyboard. Also disconnect it, and go so simply with your mouse to check if it still does it, If not try it in another usb port.Give me news","Dear Marco,I tried disconnecting my keyboard, and it still did it. Then i changed my mouse usb port, and it still did it.","Ok then we now know that the problem does not come from these two peripherals there.Consult these 2 links, do the steps of the first link (the microsoft page) otherwise after the second link they show you how to do a reconstruction of Windows Serach ...It all depends on the speed of your PC, it can take a while. Method 1- https:\/\/support.microsoft.com\/en-us\/help\/452014...Method 2- https:\/\/www.tenforums.com\/tutorials\/58569-rebui...Marco _________________________________________________Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I tried the 2 different possbile solutions, but without any luck. They didnt work for my device.","Sorry I don't have any more ideas for the moment, maybe another one will have better ideas :-)","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Okay, please try resetting the Start Menu and check. 1. Type Powershell at start menu and when it appears right click on it and select Run as Administrator.2. Copy the following command into powershell and press Enter. Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register “$($_.InstallLocation)\\AppXManifest.xml”}3. Wait for the process to finish and finally Restart the PC."]},{"symptom":"Xbox One X error code 0x800704cf        I can connect the xbox to our internet but when trying to sign in to my account I receive the error code 0x800704cf.  Usually spend at least an hour trying to connect.  Internet works fine on all other devices.  Please help!","solutions":["Hi. Please check service status in your region https:\/\/support.xbox.com\/en-GB\/xbox-live-statusCheck your account signing option on the www account.live.com. Any issues here? Waiting for your reply","Everything is Green\/Normal","The Message says \"You'll need the internet for this.  It doesn't look like you are connected to the internet.\"  But when I go to settings the xbox is connected.  I have tried switching it offline then resetting up the internet connection and it still doesn't work.","I should say, the xbox connects but I can't sign in to my account.","I am now signed in but I would like it to not take 2 hrs.  Please help me find a solution to this.  Thank you.","While my son was trying to play fortnite he now has error code 0x87dd001a.  This is getting terrible.","I also called the toll free number.  I could barely hear the person I was talking to (Sam , yeah right) due to backround noise and they wanted to charge me to help fix this problem!!!!! Unbelievable.  Think I may have to switch to playstation or nintendo switch!!!  Terrible customer support!","Rakamaz19","I can connect the xbox to our internet but when trying to sign in to my account I receive the error code 0x800704cf.  Usually spend at least an hour trying to connect.  Internet works fine on all other devices.  Please help!","Same problem here. Can't sign in to my profile getting this 0x800704cf error. In the network settings everything is fine. I can also open the store app and everything loads. Just can't sign in. Having this problem for almost 24h now. What's going on?"]},{"symptom":"Windows 7 login issue on Sony Vaio        I have a laptop running Windows 7 for which I unfortunately forgot the login credentials. Don't remember the user id also to reset the password. Saw that support for Windows 7 is going to end on Jan 14 2020. How can i dispose my old laptop running Windows 7 so that I can get a new one running Windows 10? If that's not possible, let me know how I can login into my laptop as the login credentials are forgotten? Thank you.","solutions":["How can i dispose my old laptop running Windows 7 so that I can get a new one running Windows 10?Here are two easy options:You could open it up, remove the hard disk and destroy it.You could ask the shop where you buy the new PC to do this for you.","Another option is to use any other working system to create a bootable CD or USB flash drive with DBAN, then boot the old laptop with DBAN and wipe the disk.Darik's Boot and Nuke (DBAN):  https:\/\/dban.org\/You will download an ISO file.  I suggest that you use ImgBurn (http:\/\/www.imgburn.com\/) if you want to make a bootable CD\/DVD or Rufus (https:\/\/rufus.ie\/) if you want to make a bootable USB flash drive (assumes your laptop can boot from USB).  Both of these are free utilities.DBAN Help & FAQs:  https:\/\/dban.org\/help-center\/"]},{"symptom":"I have a new computer and I cannot load my CDs        Please help me  load CDs into my new computer","solutions":["Please help me  load CDs into my new computer","Hi AnnIllingwoth can you give us a bit more information. are these programs you are trying to install from cd? are the programs compatible with windows 10? which program? are they music cds that you are trying to rip? are they backups of data files that you made? what happens when you try to load the cds? do you see any error? what does the error say?"]},{"symptom":"https:\/\/go.microsoft.com\/fwlink\/?LinkId=389361.     This is not and reconised to solve the problem which is asking to find it to be put right.        https:\/\/go.microsoft.com\/fwlink\/?LinkId=389361. This is not recognised which cannot download to find the cause of the situation of the warning it keeps sending me. I am blind so if this means moving into different programmes it will be very difficult for me to do without assistants, ","solutions":["Hi Geoff That link you provided goes to a 'Fix email delivery issues for error code 550 4.4.7 in Exchange Online' pageYou do not mention your initial problem can you please provide more information on the initial problem you were encountering, so we cal look at that for you . . .","I paying my money and cant get into this damn account to send my paper off for school. I need this fixed ASAP"]},{"symptom":"Automatic repair loop and black screen on usb boot attempt        Hello everyone.I'm facing a really strange problem and I feel I tried everything I can without success.I got an ACER computer on which I installed Windows 10 and OpenSUSE (a linux distribution). This installation was a success, and worked well for weeks without any problem - excepting some disk check when booting Windows.But recently, I encountered what I saw as called \"Automatic Repair Loop\" on the Internet : Windows does not manage to boot, it restarts the computer after one minute of white turning circles and then I see a screen with \"Preparing Automatic Repair\" for a few seconds. Then, the screen goes black and... Nothing more happens. I let this \"repair\" run for 6 hours without any success too.I can't access to the Troubleshoot menu : at the second hard reboot, I automatically enter in the Automatic Repair mode that I definitely can't avoid.It is important to say that I'm currently using the exact same computer on OpenSUSE, so I don't think I'm facing a hardware problem here. I just can't boot on Windows.I decided to create a Windows USB drive to repair\/recover\/reinstall Windows 10. I downloaded the Windows 10 iso, used WoeUSB to install it on a key, then configured my BIOS to boot on it.I saw the white dots turning as in the initialization of Windows 10, but after some seconds, the screen goes black and nothing else happens.The installation usb drive does not work either, and I don't understand how it is possible.So, I'm currently stuck on my 40 GB OpenSUSE distribution, and I definitely need to access to my windows folders and applications...I don't remember any event that could have led to this situation. I think Windows has been up to date for a while.Do you guys have any idea about a way to boot on this installation usb drive ? I would really, really appreciate some help.Thanks for reading, I'm waiting for a possible answer, and I stay here for any more piece of information that could be useful.","solutions":["Hello Yarkane, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemAre you sure that you have booted from the USB drive? I would suggest to recreate the bootable USB, if the IOS is fresh downloaded and available, try another tool to create the bootable drive, such as dd.command would be somehitng like: sudo dd if=\/path\/to\/windows10.iso of=\/dev\/sdb bs=4M && sync windows10.iso is the image oath and \/dev\/sdb is the usb drive path, To check the current usb path type sudo fdisk -l Once the ISO is burned to the USB, continue with the other options: go to BIOS at first, check if there's any Secure boot option enabled, if found, disable it. then edit the boot menu and add the USB as first bootable option.Try again and let me know how it goes Cheers! Farah","Hello Farah, thanks for your quick answer !I'm currently trying to boot the windows iso. I learned during the process that fat32 can't be use for that because it rejects files heavier than 5Go and one file from the iso is... 5.1 Go.I'll let you know if I solve my problem !Thanks again !","no worries :)","Okay, so.I faced a lot of issues regarding files systems (FAT32 wasn't good because install.wim exceeds 4 Go so I had to try some things), I finally booted on the USB stick and...Well, same thing again, the screen is fading black and nothing happens, exactly like when my windows system enters in \"automatic repair mode\". I don't understand how this can be related, do my BIOS have a problem ?I looked at the ACER website and the software to use to update the BIOS... is an executable in .exe .I do not know what to do now. Maybe I can switch my BIOS to Legacy mode and try to boot on the usb stick again... But I'm not sure about this. Everything on my computer has been made in UEFI mode, I don't want to mess it up.Any ideas ?Thanks again.","Do you have another display adapter? integrated and other as Nvidia or AMD? Have you checked in the bios if any display adapter settings are there? I would start with resetting the bios to the defaults, removing any extra hardware, external keyboard or mouse, network cables,, if it didn't help. check display adapter settings, try to change in there a little.","I do not have any display adapter settings in my BIOS.My 2 graphic cards are Intel HD Graphics 530 and NVIDIA Geforce GTX 950M, as listed below.","I tried with another key, on a legacy boot, with a boot repair iso... Nothing works.I got a \"missing BCD file\" error during when I tried to boot on the key in UEFI... while the file was here in place.I truly lack of ideas now.","If you install windows on w UEFI bios, you shouldn't change to legacy. if you have more than one display adapter, then there should be an integrated display option in BIOS.If you haven't found it, I'm also out of ideas unfortunately. maybe others can help out as well","I also tried Boot Repair, which does not work."]},{"symptom":"Computer says not connected to Internet even after connected to Internet        unable to find why office suite pro 2016 Outlook, Edge and Network Trouble shooter also the hidden icon (that when connected changes from a ball to a display icon)  Network Status  to name a few programs ALL      THINK I am NOT CONNECTED TO A NETWORK.AT the VERY SAME TIME I was using Firefox browser to log in to amazon account.IF I COULDN'T CONNECT USING ANY BROWSER, WHEN I GOT NOT CONNECTED I WOULD RUN ALL THE CHECKS LISTED for a not connected to network.But REMEMBER at the SAME TIME I was ABLE TO log into my Amazon account.  so I HAD TO HAVE INTERNET ACCESS, I also browsed web using Firefox browser, going to sites I NEVER saw before so I made sure what I was seeing was NOT a stored file. using win 10 pro.    have latest updates. any ideas to check would be nice.Mark***Modified title from: WHAT IS the FIX? i am unable to find why office suite pro 2016 Outlook, Edge and Network Trouble shooter to name a few programs THINK NOT CONNECTED TO A NETWORK, BUT AM CONNECTED USING FIREFOX.***","solutions":["unable to find why office suite pro 2016 Outlook, Edge and Network Trouble shooter also the hidden icon (that when connected changes from a ball to a display icon)  Network Status  to name a few programs ALL      THINK I am NOT CONNECTED TO A NETWORK.AT the VERY SAME TIME I was using Firefox browser to log in to amazon account.IF I COULDN'T CONNECT USING ANY BROWSER, WHEN I GOT NOT CONNECTED I WOULD RUN ALL THE CHECKS LISTED for a not connected to network.But REMEMBER at the SAME TIME I was ABLE TO log into my Amazon account.  so I HAD TO HAVE INTERNET ACCESS, I also browsed web using Firefox browser, going to sites I NEVER saw before so I made sure what I was seeing was NOT a stored file. using win 10 pro.    have latest updates. any ideas to check would be nice.Markperson was nice. BUT told me to call when this problem is acting up.  do to hrs listed NOT 24\/7 be interesting if problem occurs again during hours this support location is open. told call ext 403","Hi Mark, Thank you for writing to Microsoft Community Forums. I understand that applications show that you are not connected to Internet. I’ll certainly help you with this issue. However, please let us know: How is the computer connected to Internet i.e. Ethernet or Wi-Fi?Are you aware of any changes made on the computer prior to this issue?Which build version of Windows 10 is installed on the computer? To check type:winver in the search bar on the Taskbar and hitEnter. I would suggest you to try changing the network connection i.e. if the computer is connected to Internet through Wi-Fi, try using Ethernet and check if that helps. You may also want to refer the troubleshooting steps mentioned in the articleFix network connection issues in Windows. Let us know how it goes. Regards,Nikhar KhareMicrosoft Community - Moderator","person was nice. BUT told me to call when this problem is acting up.  do to hrs listed NOT 24\/7 be interesting if problem occurs again during hours this support location is open. told call ext 403 You may have been Scammed. Ignore the number. Do not give them credit card or bank information.If you wish to contact Microsoft Support, click on your region to contact Customer Service.https:\/\/support.microsoft.com\/en-us\/help\/4051701\/global-customer-service-phone-numbers","computer is connected to internet using a smart phone as a mobile hotspot. using USB tethering between the two. the computer shows I have a Ethernet connection. when connected.only changes  to computer would have been the ones caused by the Microsoft software updates \"security\" and or  \"features\" updates.  NO HARDWARE changes, or were  any settings changed by me.build  is 1903PLEASE remember I stated Microsoft Network Troubleshooter ALSO thought I was NOT connected to the network WHILE I was able to use Firefox to browse to a site I had NEVER gone to before.  AND I was able to log in to AMAZON site, and also browse to a items on Amazon (the selling stuff site) that I had never gone to before."]},{"symptom":"Does anyone know what these are and why they wont install even after I reset my PC.        It also tries to install the 2015 version at times and its getting really annoying as I cant find anything online about it. Help will be appreciated. I also cant install apps like netflix as the same issue happens as the Desktop runtime it says its downloading but never does","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Downloads get stalled mostly due to the Windows Update service malfunction. Please perform the following steps and check. Go to services.msc Locate Windows Update and double tap on it. Use the drop down button and make sure the service start up settings is \"Automatic\"Restart the PC."]},{"symptom":"Help Please        Just got new PC and I can't seem to activate windows10 home its giving me error code any ideas please Help I have tried troubleshooting but to no avail still error code coming up","solutions":["Hi Irene, A product key consist of 25 character codes that may be on a sticker attached to the device. You may refer to this linkhttps:\/\/support.microsoft.com\/en-ph\/help\/10749\/... Some retailers also issues devices with digital license which does not have a unique key but rather is already activated by its hardware. It may be best to reach with the point of purchase in regards to the license for the computer."]},{"symptom":"Search grayed out in file explorer but works if brought from command prompt.        Shortly after feature upgrade 1909 I noticed the problem.  Probably a coincidence. Right click on the windows icon allows file explorer to come up. Nothing happens if I position the cursor in the search block.However, if I bring up a command prompt, does not have to be elevated, and I \"CD\" to the folder and type\"explorer .\" then the same form pops up but I can type into the search bar unlike the form from the windows icon.Dism \/Online \/Cleanup-Image \/RestoreHealthtakes an incredible long time to run.  Can probably solve this by rebooting.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as the search box is not working properly in File Explorer as it should be. We would like to know what happens when you launch file explorer when you press Windows + E key from the keyboard or when you click on the file explorer icon from the Taskbar. Does search box works or you get the same issue? Meanwhile, we would suggest you to perform these methods and check the status of the issue. Method 1: Run SFC scan on the PC.ClickStart, type Command Prompt or cmd in the Search box, right-clickCommand Prompt, and then click Run as administrator. Typesfc \/scannow and click on Enter and once the process is completed, launch file explorer and check the search box. Method 2: Check in Safe Mode with clean boot environmentPlease refer this safe mode article and start the PC in safe mode. If the issue persist in safe mode then perform clean boot in safe mode environment, please follow the steps mentioned in thisclean boot article. A ‘clean boot’ starts Windows with a minimal set of drivers and startup programs, if the issue doesn’t persist in safe mode, then try clean boot in normal mode, so that you can determine whether a background program is interfering and causing this issue. Clean Boot Disclaimer: A “clean boot” starts Windows with a minimal set of drivers and startup programs, so that you can determine whether a background program is interfering with your game or program. Your computer may temporarily lose some functionality while in a clean boot environment, however that functionality will return when youreset the computer to start normally after you have finished your troubleshooting. Method 3: New user account.Check in new user account. Follow the steps from the articleCreate a local user or administrator account in Windows 10 to create a new user account and check if you are facing the same issue with the file explorer. Regards, Aditya RoyMicrosoft Community – Moderator","I have the same problem, the suggested solutions didn't work.","Do not understand how this can happen or how to fix it.Running the cmd prompt must enable some environmental variable that somehow was disabled causing file explorer to enabled \"search\"The top picture was obtain using mouse -> file explorer -> quick access -> downloadsThe bottom window was obtained using windows key +R and typing \"cmd\" then ...cd \/user\/josep\/Downloadsexplorer .\/In the top window, putting the cursor in the search windows does nothing other than  BEEPING every time I press a key .  It does allow the entry of text nor pop up any search history.In the bottom windows everything works fine.  Letters show up when I type.There is nothing suspicious in the file manager as shown by grpedit.msc.Can this problem be bumped up higher?  Maybe I should take it to the TechNet?I ran sfc\/scannow and also Dism \/Online \/Cleanup-Image \/RestoreHealthno errors reported and same problem exists.  I also went to the view - options and restored \"defaults\" to no effect.question:  Exactly where and what is the \"file explorer\".  There is no property for it.  Using left or right mouse button simple runs it.  Typing \"where explorer\" shows it is at \"c:\\windows\\explorer.exe\"I suspect the property for the \"file explorer\" has been corrupted.  I am guessing it is supposed to flash the subliminal message \"buy more mlcrosoft products\" but instead has somehow disabled the search feature.So, how can I remove it from the startup and put it back in or maybe fix it as I suspect it is actually a shortcut and has a property.  [EDIT] Another problem I just discovered.  If I create a shortcut on the desktop and point to \/windows\/explorer.exe with the working director set to by my download or document folder the PROBLEM STILL EXISTS UNLESS I PUT THE FOLLOWING FOR THE SHORTCUT\"C:\\windows\\explorer.exe c:\\users\\josep\\Downloads\"[EDIT AGAIN] - solved by rebooting window.  Next time please advise to reboot before trying sfc or that health check","I have the same problem, the suggested solutions didn't work. Do you have any of Visual Studio 2017, 2013 and GitHub's  \"bash\" as well as GitHub Desktop installed?","\"Solution\" did not address the disabled search nor could I unearth how to enable search for explorer. Frustrating the way updates are breaking common functions like this.  Microsoft, your all really need to clean this sort of thing up.  It doesn't make you look good.","Problem solved!I leave the reason for it to the experts. Due to an unrelated problem, I had to restore a full image from the previous day. Guess what? File Explorer search is back and working OK!","Lucky you!It worked for a while for me but today it is back to the same problem.  Besides the aforementioned programs I am also using both RealVNC,  Splashtop, and putty to handle access to headless systems.  Cannot use the Microsoft remote desktop due to problems with CUDA apps on the GPUs.","Shortly after feature upgrade 1909 I noticed the problem.  Probably a coincidence. Right click on the windows icon allows file explorer to come up. Nothing happens if I position the cursor in the search block.However, if I bring up a command prompt, does not have to be elevated, and I \"CD\" to the folder and type\"explorer .\" then the same form pops up but I can type into the search bar unlike the form from the windows icon.Dism \/Online \/Cleanup-Image \/RestoreHealthtakes an incredible long time to run.  Can probably solve this by rebooting.I have nearly the same problem since updating to 1909 two days ago.My Explorer will allow one search and then grays out. the only way to get it back is to quit Explorer and start again.","I just found what caused this and !!! I CAN DUPLICATE THE PROBLEM !!!!Unfortuntately, do not know how to fix it.1 -> bring up file explorer and observer it is working2 -> browse to an folder \/ directory that CANNOT be searcheda black bar is shown in the search window:  normal as search does not work3 -> return to any searchable folder ie: c drive, d drive, etc        the black bar is gone BUT THE SEARCH NO LONGER WORKS!!!Examples of non-searchable objects: 1 Acronis TIB backup.  It can  be viewed but only searched if it is mounted2 contents of 7z compressed file (there is no search bar anyway)3  some folders on synology NTFS as they do not support 8dot3net file names the same way as Microsoft.  Since the TIB files are on the NTFS server maybe it is Acronis and not synology.My guess:  WIndows is removing the black bar from the search but fails to unmark the property that allows the search to work.Right now I need to reboot as search no longer works after running one of the testsI just went over to social.msdn to post the problem but did not see a technical forum for windows.  Where can I report what seems to be a windows bug? [edit] social.msdn is for developers, not bug on windows. Going to post the problem here but change the title to indicate a bug in windows[edit-2] Inconsistent duplication of problem:  After rebooting I went to iCloud and clicked on pictures.  The connection had not been established yet so no picture and the black bar showed up. When I attempted to browse the C drive the search did not work.  Restarting file explorer fixed the problem.  Did not have to reboot.  When I tried to duplicate this effect on iCloud the pictures were available so the black bar did not show up.  I then opened some TIB files and the search bar \"worked\" in the sense I was allowed to enter something to search for but unless the backup is mounted there is no recursive search.  Exiting and then browsing the C drive I was unable to duplicate the problem.  Not going to submit a bug unless I can get %100 duplication.","I have the same issue right now on a freshly installed Windows 10 machine after installing the latest feature updates (though perhaps not causally linked, as I made tons of other changes to the new system as well). It doesn't happen every time on every directory, but it pops up enough that I can reproduce it within a minute or so.One workaround I discovered was to toggle the ribbon in Windows Explorer by clicking the upside-down caret (^) just above the greyed out search box, which shows the ribbon, and then clicking again to hide the ribbon again. The search bar then comes back and once I replace the original search term, becomes operable again.This suggests to me that we are dealing with a GUI bug that was introduced recently. Is there an official way to report this to Microsoft as a bug?"]},{"symptom":"Product: Google Update Helper -- Error 1316. The specified account already exists.        I saw this error in event viewer. How can I fix it? I installed Chrome and Brave Browser. Do they make conflict in my system? I have reinstalled Chrome and checked Windows but nothing happen!","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. “Error 1316” A Network Error Occurred While Attempting to Read From the File. This occurs due to previous installer left files from the old install behind and those files prevent the new install from proceeding.This is not considered a very serious error though. However, I would suggest you to go to the following page and perform the steps written by \"Vijin V\" and check if you see this error again.https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]}]}