{"windows":[{"symptom":"Connecting laptop to tv using hdmi cable        When I connect HDMI cable from laptop to tv, I do not get a picture on tv. TV setting is on HDMI.","solutions":["HI Melody. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Is this a Smart TV with settings to receive input from PC? Did you consult the TV Manual on the manufacturer's Support Downloads web page to make sure the Settings are correct?See how to connect PC to TV via HDMI here: https:\/\/www.wikihow.com\/Connect-PC-to-TV-with-HDMITroubleshoot HDMI PC to TV here: https:\/\/www.lifewire.com\/fix-hdmi-connection-pr...https:\/\/www.windowstechit.com\/16388\/windows-10-...https:\/\/jtechdigital.com\/articles\/how-to-troubl...https:\/\/windows101tricks.com\/windows-10-not-det...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"‘Error Loading Operating System,’ need help!        Hello, ive run into an issue where upon starting my new pc, i get a message of ‘error loading operating system.’ This message popped up after I installed some wifi adapter drivers, so I’m assuming theres some things conflicting inside the pc. The pc’s OS is Windows 10 Pro and i dont have a back up disk (and i dont think the disk drive works) so i was wondering if theres another way of fixing the pc that i guaranteed? ","solutions":["Hi Sofia.SVE, You can try booting into safe mode and remove the wifi drivers that may be incompatible with the OS. Safe mode starts Windows in a basic state, using a limited set of files and drivers. If a problem doesn't happen in safe mode, this means that default settings and basic device drivers aren't causing the issue. Observing Windows in safe mode enables you to narrow down the source of a problem, and can help you troubleshoot problems on your PC.You can follow steps on the link below on how to boot into safe mode and how to remove the drivershttps:\/\/support.microsoft.com\/en-ph\/help\/12376\/...https:\/\/docs.microsoft.com\/en-us\/windows-hardwa...Let me know how it goes."]},{"symptom":"Windows        I turned my pc on and all my settings had been cleared and my desktop was cleared, everything was still on my pc but every application had logged out, Chrome, Steam etc and I've had to go through a lot of trouble setting everything back up, whats happened and what (if I can) can i do to get everything back to how it was","solutions":["Hi Eoin. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Sometimes if the User account gets corrupted and cannot start, Windows will sign you into a temporary account. A Temp Account cannot be used as a normal account so do not set it up or copy files into it because at any restart it might decide to start into your old Account. I'll give you everything that can be done to repair or replace your account, based on helping countless others get through it.1) Try restarting the PC a few times to see if it can sign into your account. 2) Check at C:\\Users if you can see your old account with its files intact. If not check at C:\\Windows.old to see if files were archived there during a version install that fails.If so copy the files out externally so they are safe. Files should always be backed up if you value them at all. You can copy or drag them to an external USB flash or hard drive, or into Onedrive (up to 5gb free) or Google Drive (up to 15gb free).3) From the temp account try to repair the old account using one of these methods:https:\/\/www.tenforums.com\/tutorials\/48012-fix-y...https:\/\/winaero.com\/blog\/windows-10-youve-been-...4) If not then you can try to create a new Admininstrator Local Account to see how it works:https:\/\/answers.microsoft.com\/en-us\/windows\/for.... 5) If necessary to try to repair the old account or create a new Account you may need to enable and sign into the Hidden Administrator account used only for emergencies, using one of these methods:https:\/\/www.isumsoft.com\/it\/enable-hidden-admin...https:\/\/www.tenforums.com\/tutorials\/2969-enable....6) If no other method works you may need to create Windows installation media to boot into to access the Command Prompt at boot to perform Option 5 above, or do a Reset:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Detailed steps to boot media are in the tutorial in Step 12 below.7) Once the new account is created: sign into the new account, move your files over, test that all programs run. If you decide to keep it then you can delete the old accounts when ready in Settings > Accounts > Family and other Users.8) If the install is too corrupted for even a new account to run well or you want to invest the time in trying to fix the old account, then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... 9) If any steps cannot be performed normally then try them in Safe Mode with Networking or Safe Mode:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... 10) If nothing else works to fix the install try running a Repair Install which reinstalls WIndows while keeping your files, programs and most settings in place, by installing the Media Creation Tool and choosing from it to Upgrade Now. This will solve most problems and also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... 11) If those fail then you can do a Reset: http:\/\/www.laptopmag.com\/articles\/reset-windows... 12) Or you can use the bootable media from Step 6 to do the vastly superior Clean Install which should get you past all difficulties as it has hundreds of thousands of others who have followed the steps in this link and never come back to report another problem:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Make sure during the booted install to follow the illustrated steps to delete all partitions down to Unallocated Space to get it cleanest, then click Next to let it auto-create the needed partitions, format them and begin install - this makes it foolproof.If you have files that aren't backed up you can use the same bootable media to rescue your files using this method:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the linked tutorial. It's a better install than any amount of money could buy.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"The system image restore failed. Error details: The parameter is incorrect. (0x8000700057)        I have current Win 10 x64 system and data backups on a portable HD and a repair CD. Using the repair CD to restore the latest system image from the portable HD to a new HD in a HP 8100 tower resulted in \"The system image restore failed. Error details: The parameter is incorrect. (0x8000700057)\".Any assistance would be welcome and appreciated.","solutions":["Umm ... never mind. System recovery USB worked the 3rd time.","Hi RichMorgan1, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Here the instructions of the Windows MVP, he shares his experience and how to solve this error 0x80070057, if he presented it again.https:\/\/www.thewindowsclub.com\/system-image-res...Let me know if you have something else that I can help you with, I'd be happy to help.Happy holidays Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"I notice windows 10 update using scvhost.exe using http unencrypted tcp - Is it safe?        I notice windows 10 update using scvhost.exe using http unencrypted tcp - Is it safe?","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Yes this is perfectly safe, as it is publicly available data there is no need to encrypt in transit. Additionally once downloaded the files are verified using a checksum you ensure they haven’t been either modified in transit or downloads from a spoofed location.Regards, Ross","So the connection cannot be hijacked in anyway by a hacker?","No it wouldn’t be possible as windows verifies the file once it has been downloaded to verify it’s source.Regards, Ross"]},{"symptom":"Blue Screen error with Bad_System_Config_Info after an upgrade        After an upgrade to my husband's HP All-In-One computer,  can't get it to start up. It shows a blue screen with a circling startup icon.  The code that comes us is \"Bad_System_Config_Info\".I've tried about everything the computer suggests for repair, but nothing works.Any help will be appreciated.Thanks,Jan Burk***Modified title from: After an upgrade, computer won't start up.***","solutions":["Hi Jan, Thank you for writing to Microsoft Community Forums. I appreciate the efforts take by you in resolving the issue. I understand that after an upgrade you are receive Blue Screen error on the computer with Bad_System_Config_Info. I’ll help you with the issue. However, please let us know: May I know the update that was installed on the computer recently?What is the complete model number of the computer that you are using? The “Bad_System_Config_Info” error means that something is wrong with the registry on your PC and you'll need to return to a previous configuration. I would suggest you to refer the steps mentioned in the articleError 0x74: Bad_system_config_info and see if that helps. Note: The last step in the above article talks about performing a reset on the computer. Resetting the computer will delete all the files and applications from the computer. Do not perform reset on your computer. You may also want to refer the steps mentioned in the article Troubleshoot blue screen errors. Select After an update was installed and perform the suggested steps.  Let us know the results. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Toshiba function key        I’m using a toshiba laptop, forgot exactly how old, but the problem is really just annoying. Whenever I use the function key to turn on the numpad overlay, I get the message saying its on but the problem is the message doesn’t go away and stays there bothering me. Please tell if there’s a way to stop it. thank you.","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.It’s very likely there is a piece of toshiba software installed which is displaying this message. I’d suggest checking the list of installed apps in setting and removing the app which is causing this.Unfortunately I can’t give advise on what app the might be, but it will be a toshiba app.Regards, Ross"]},{"symptom":"German keyboard appearing in Taskbar        Hello,Recently a keyboard language appeared out of nowhere in my windows, the German keyboard.As you can see in the screenshot, the German keyboard appears despite not being reflected in the windows settings.I read in another post that I had to enter the control panel in the language app to change it but for some strange reason, the languages ​​section does not appear on my control panel, so I don't know what to do anymore.This is driving me insane please help me from stop switching to a QWERTZ keyboardThanks in advance.***Modified title from: German keyboard***","solutions":["Hi, Thank you for replying.  I would suggest you to refer the steps mentioned below and see if you are able to remove the language pack: Type command prompt in the search bar on theTaskbar.Right click on the command prompt icon and selectRun as administrator.Now, paste the following command and hit Enter:lpksetup \/u de-DE.Restart the computer.  Let us know the results.Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"MP3 codex issue        Hello - I am attempting to listen to an MP3 that I downloaded, and media player says it might not support the file or codex. I am not tech enabled in my life yet, can anyone help. I do have Windows10...when I go online it confuses me. If you can help, please share as if helping a senior = patience.Thank you!!!","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.I’d suggest trying VLC player, it can play most media file format without any additional codecs:https:\/\/www.videolan.org\/vlc\/index.en-GB.htmlRegards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Why Can't I Set Adobe Lightroom as Default Picture Viewer?        I have the whole Adobe Creative Cloud installed. Lightroom does not show up in the list of installed Apps","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Unfortunately it isn’t possible to set light room as the default photo viewer, here is a thread which gives an explanation of why this is not possible:https:\/\/community.adobe.com\/t5\/lightroom-classi...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Photos app. How to view entire image when viewing tiles in a collection        Hi,Just wondering if it's possible to turn off the auto zoom\/cropping that happens to images in a Photos App collection when viewing it???As in not when opening an individual image but when there are multiple images in a folder or collection.cheers.","solutions":["Hi jamessheather, I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.From your description, you seem to be referring to the action of zooming when your mouse cursor hovers over a particular picture. Unfortunately there isn't an option to turn this effect off.Let me know if I can help you further! Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Cheers for the reply....I'm meaning before you move the cursor onto an image the Photos App has tiled the photos in a collection and in doing so crops and changes the images so you can't see the entire image until you open it individually. I'd like to see the images in that collection each in their entirety.  So some are cropped top and bottom others a little bit of the sides etc....so when you have a number of images that are only slightly different from when you took them you can't actually see everything to compare them next to each other.Cheers again....","Yup, I'm sorry that it cannot be turned off within the Photos App. You could use Windows Explorer, navigate to the folder where the photos are stored, select View > Extra Large Icons as a workaround."]},{"symptom":"Windows 10 update 1903 failing at 60%        Hi,I've been trying to update to Windows 10 1903 but for the past week every time I try it fails at 60%.I have googled and tried many ways: manually updating with Windows 10 Update Assistant, turning off antivirus, disabling IIS ... but nothing workedI include here Panther logs, Rollback logs and Device install log for your considering.https:\/\/drive.google.com\/open?id=1CCt4hU5kNa7cQASagp29PHgdSIldDDjnThanks,Ruan,","solutions":["Hi Ruan,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.It looks like IIS is blocking the update. This is a common problem with 1903.As a first step, try disabling Internet Information Services and try again:Turn Windows Features On or Off in Windows 10 | Tutorialshttps:\/\/www.tenforums.com\/tutorials\/7247-turn-w...If you get an error 800F922 disabling it, boot into the Safe mode and rename the following folder:C:\\Windows\\System32\\inetsrv to inetserv.oldTry disabling IIS again and update manually in normal mode.Let us know how that goes. Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads.","It appears you may be having a Recovery Tools situation where the upgrade cannot find the current settings.Would you open an admin command prompt and type the following command and copy and paste the results.reagentc \/infoIt would also be helpful to have a snipping tool picture of your Disk Management window and expand it so we can read the partition descriptions.","I also see the following..  It looks like you do have IIS enabled or at least many of its components.. or maybe ASPNET4.5, which is listed in the .Net 4.X section of the Windows Features window.  To open, type optionalfeatures.exe in a run box. CSIPERF:AIDONE;{81a34a10-4256-436a-89d6-794b97ca407c};Microsoft-Windows-IIS-SharedLibraries-GC, version 10.0.18362.418, arch amd64, nonSxS, pkt {l:8 b:31bf3856ad364e35};338356us, Error      [0x018007] CSI    00001f2c (F) Failed execution of queue item Installer: Generic Command ({81a34a10-4256-436a-89d6-794b97ca407c}) with HRESULT HRESULT_FROM_WIN32(14109).  Failure will not be ignored:A rollback will be initiated after all the operations in the installer queue are completed; installer is reliable[gle=0x80004005]","Yeah, after fixed the error 800F922 when disabling IIS as Sumit's guide, I could update windows to 1903 patch.Thank you so much Sumit and Salgrass.Ruan,","create space on hard disck","Thank you gentlemen for all you help in this forum...Kudos to all of you for your help with this buggy Win 10 update.Now Microsoft should be ashamed of themselves for allowing such a terrible major Win 10 update to be released.  I'm a very unhappy MSFT customer due to the countless months and hours I've been trying to get the update to Window 10 ver 1903 and now 1909 installed.  Now I consider myself pretty tech savoy having worked for major mobile carrier releasing the early smart phones, initial T-Mobile Hotspots deployments and then did a tour at Microsoft.  If I as a program manager released such a faulty update I would have been fired from any of these high-tech companies.  Now the really sad thing is the countless untech savoy Microsoft customers (likely millions) that are having the same issues we encountered and either forgo trying to complete the updates (I've attempted easily 30) or will spend hundreds taking their systems to Geek Squad, etc. for something that should be tweaked within the OS build.  I also must admit previous builds have been buggy in past years but nothing like this.  Shame on MSFT and do you think you loyal customers will remain loyal after such poor experiences with your latest Windows product?  I hope you take this to heart and fix the current issue and ensure customers come first and respect their time.  Again kudos to the folks in this forum for providing clearly the best straightforward manual resolution...Best regards!","THANK YOU...THANK YOU...THANK YOU...!!!! You, sir, are a Steeley-Eyed Computer Guru. I have been fighting updates and following suggestions from all over the web trying to get past 1709 with no luck. Finally, I'm at 1903 thanks to you."]},{"symptom":"Background selection        Neither the picture or color I select for Background is working. My desktop will flash the picture as I move from 1 icon to the next on the task bar. ","solutions":["What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK","My version shows 1909The problem corrected itself.  I've been making changes right and left, last thing I just did was when into a full screen in Microsoft help and then escaped out of full screen.  I also played with the zoom + and - while in Microsft help.  Almost seems like my screen thought I wanted full screen.  All is fine now.  My background is holding the picture I selected in themes\/background.  ","Hi SK191517, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Try the following: Start Windows with a clean boot, it is an error-proof process, which allows us to detect if any third-party program or driver is generating the problem.https:\/\/support.microsoft.com\/en-us\/help\/929135...After having applied the above process, you try again. https:\/\/support.microsoft.com\/en-us\/help\/17144\/...Let me know if you have something else that I can help you with, I'd be happy to help.Happy holidays Regards, Marc M."]},{"symptom":"Need help identifying the correct Windows 10 key        I'm about to upgrade my computer for the first time since Windows 10 came out, and it is a substantial upgrade (including the motherboard.)  I have four computers in the house running Windows 10.  Two of them use upgrade licenses from Windows 7, two have retail copies purchased from Amazon.  My Amazon account has three keys:  my two, plus one I purchased on behalf of a friend when I was setting up his new system.I need to find out which product key is associated with this computer.  It could be any of the three listed on my Amazon account (one of which is not actually mine), or (potentially) it could be one of the upgrade licenses and I'd need to buy a new copy of Windows with my upgrade.  How in the world do I figure out which one is on one specific PC?","solutions":["Which of the 4 are you upgrading?  Make sure it is one that has a retail purchased license.","Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,You may download the showkeyplus app from the Microsoft store to locate the registered product key on the devicehttps:\/\/www.microsoft.com\/en-us\/p\/showkeyplus\/9...Normally free upgrades are provided with a generic product key on top of its OEM license for windows 10.By identifying that your system has a generic product key would mean that you would either have upgraded for free in the past or you have registered a digital license from the Microsoft store.Here's the list of generic product keys for windows 10 https:\/\/www.tenforums.com\/tutorials\/95922-gener...You may use slmgr to pull the information regarding your license which would display the last 5 digits of the registered keyTo do so, 1. Open command prompt with admin permission 2. Execute this code slmgr \/dlv Let me know how it goes. :)"]},{"symptom":"XPS viewer unable to locate in Windows 10        I have installed XPS viewer on Windows 10 through optional feature, but I am unable to find XPS viewer to launch or open under search.Any solution?Thanks.","solutions":["Hello Kok,Please refer to the following link in which you can find the steps to install and run XPS viewerhttps:\/\/www.wikihow.com\/Open-XPS-Files","Hello Kok,Please refer to the following link in which you can find the steps to install and run XPS viewerhttps:\/\/www.wikihow.com\/Open-XPS-Filesalready done that but xps viewer does not appear on search when type.","Hi Kok. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Shawn has a tutorial here for two different ways to get XPS Viewer back: https:\/\/www.tenforums.com\/tutorials\/109719-add-...If problems I'd ask Shawn in the tutorial Comments because he is always the best experts on all subjects he writes about.______________________________________________ Note: Linked tutorial is from Shawn Brink who is a trusted Microsoft MVP.","Hi Kok. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Shawn has a tutorial here for two different ways to get XPS Viewer back: https:\/\/www.tenforums.com\/tutorials\/109719-add-...If problems I'd ask Shawn in the tutorial Comments because he is always the best experts on all subjects he writes about.______________________________________________ Note: Linked tutorial is from Shawn Brink who is a trusted Microsoft MVP. I have done the installation from option features but i still don't find XPS viewer under windows search.","They've removed XPS viewer. Try this Microsoft Store app which opens XPS, TIFF and PDF files:https:\/\/www.microsoft.com\/en-us\/p\/reader\/9wzdnc..."]},{"symptom":"Is it okay to use the internet while backing up your hard drive?        Thank you.","solutions":["Hi Christina. usually backup programs allow normal computer usage, they make a snapshot of disk state and new changes are not reflected in backup.But sometimes very active disk usage (including occur during Internet access) may cause a fault of backup programs. So just try - if backup will not fault all is OK.","I've never had a problem. That's why processors have multiple cores and threads. The processor can perform more than one task at a time. It may slow the backup process down a little. You may want to schedule your backups to take place when you know you will not be using your computer.https:\/\/techterms.com\/definition\/processorhttps:\/\/techterms.com\/definition\/thread"]},{"symptom":"Your Phone Companion on Android phone        OK guys, have a really strange problem here. I've been having MAJOR problems with the Your Phone app on windows 10.The phone I have, is a Samsung Galaxy s10, PC is i7 processor, 16Gb memory, windows 10 Pro (Build 19536.1000). It has a bluetooth connection to the phone using a plugin dongle, so no problems there. The phone is connected to my wi-fi network, my PC is plugged directly into the router. (So theoretically, they are connected to the same network correct???). (Router is the EE BrightBox 2)Firstly, the app is installed on the phone, as when i last checked google play updates, it was being updated. HOWEVER, I thought that I'd remove the app off the phone, as for some reason the your phone app on the PC, says check your phone to finish connection.THE APP DOESN'T APPEAR ON THE PHONE AT ALL. The only option I get is to uninstall updates if i go into google play store. No icon, no nothing on screen, not even actually listed in installed apps. Cant open the app if there is no way of actually opening it.How can an app be installed, but still not exist on the phone????The app used to work fine when I had my old PC, and an old bluetooth adaptor (which I've also tried in this new PC) and my old Galaxy s7 edge. Since all these updates etc, it just fails to work now.Is there ANY way of manually deleting the YourPhoneCompanion when you cant see it on your phone apps list, so I can try and restart this Your Phone process again?Should I be using the app from the Microsoft store on my phone instead of the app from google play store, or does it not make any difference?Shame, as I really liked the YourPhone app, but if I cant use it, then why have it installed.","solutions":["OK guys, have a really strange problem here. I've been having MAJOR problems with the Your Phone app on windows 10.The phone I have, is a Samsung Galaxy s10, PC is i7 processor, 16Gb memory, windows 10 Pro (Build 19536.1000). It has a bluetooth connection to the phone using a plugin dongle, so no problems there. The phone is connected to my wi-fi network, my PC is plugged directly into the router. (So theoretically, they are connected to the same network correct???). (Router is the EE BrightBox 2)Firstly, the app is installed on the phone, as when i last checked google play updates, it was being updated. HOWEVER, I thought that I'd remove the app off the phone, as for some reason the your phone app on the PC, says check your phone to finish connection.THE APP DOESN'T APPEAR ON THE PHONE AT ALL. The only option I get is to uninstall updates if i go into google play store. No icon, no nothing on screen, not even actually listed in installed apps. Cant open the app if there is no way of actually opening it.How can an app be installed, but still not exist on the phone????The app used to work fine when I had my old PC, and an old bluetooth adaptor (which I've also tried in this new PC) and my old Galaxy s7 edge. Since all these updates etc, it just fails to work now.Is there ANY way of manually deleting the YourPhoneCompanion when you cant see it on your phone apps list, so I can try and restart this Your Phone process again?Should I be using the app from the Microsoft store on my phone instead of the app from google play store, or does it not make any difference?Shame, as I really liked the YourPhone app, but if I cant use it, then why have it installed.OK, update for my original post, found on Galaxy s10, you turn on the Link to Windows in the pull down settings at the top of the screen as now, due to samsungs new update, there will be NO icon shown or app actually listed on your phone from now on, so thank you Samsung for screwing up on that one (Cant open the settings of the your phone app on your phone, BECAUSE WE AT SAMSUNG HID IT FROM YOU). Now linked the phone in my phone settings to windows.Phone is fully connected to my wi-fi network, pc plugged into the router directly, yet your phone app STILL SAYS TO CHECK MY PHONE AND PC ARE CONNECTED TO THE INTERNET AS IT CANT CONNECT TO THE PHONE. If they are not both connected to the internet, then can microsoft explain how,1. How can I be posting this onto the community forums on my main pc if its not connected to the internet (Which it is DUH!!!!!!)2. How can I also be checking my Facebook account on my phone, VIA MY WIFI, at the same time as I'm using this PC to post this post on the community forums?????How much more connected to the same network do you need?????????UPDATE!!!!!!When I click on 'Link to Windows' it shows that my PHONE is logged into my microsoft account, so all is well there.On the PC, it states, That youre sucessfully logged into your phone, hang on tight while we finish one last thing to get your devices linked. THEN below it a big red 'RESEND NOTIFICATION' button.All settings for notifications and permissions are set on the phone, yet NO notification ever gets recieved from the pc to the phone, no matter how many times i send the thing. Once this is redone (losing count of the nuymber of times its being sent) the yellow banner stating 'Make sure your phone and PC are connected to the internet.' THEY BOTH ARE!!!!!!!It's always the same error time after time after time. I've even had the phone sitting within an INCH of the bluetooth adaptor (even tho i can send an image from the pc to phone\/phone to pc directly via bluetooth from across the room) Is the bluetooth even needed, or is it all done through wifi now, all i know is im now getting fed up with it, and thinking of going for a better and WORKING alternative, and removing this crappy app altogether"]},{"symptom":"Lumia 635        i am trying to remove photos from my wifes Nokia Lumia 635 and load them on my windows 10 laptop. keep getting error message.","solutions":["Hello AngelRivera7, I'm Didi, an independent advisor. Can you please tell us what exactly is the error message so we can help you better ?Also how are you trying to transfer the photos from the Lumia to your laptop ? Regards, Didi"]},{"symptom":"Sound        Hi,I recently bought a Aokeo Microphone to video blog on my laptop, but I am having problems setting it up. When I go to the Control panel it is not reading it as a device. Also on my camera the microphone even installed in laptop isn't working and I'm not sure how to get it to work, my settings say I've given permission to use the microphone but it still isn't working.I am not sure what my software has I'm pretty sure it is windows 10. My laptop is only a couple of months old and it is an HP ENVY 360. ","solutions":[]},{"symptom":"I can' t open espn app        you'll need a new app to open this espnapi link","solutions":["Hello DeniseLamb1, I'm Didi, an independent advisor. To fix the error where you see a popup with \"You'll need a new app to open this espnapi\" please follow the methods provided in this guide (if a method doesn't work try the next one) :https:\/\/www.thewindowsclub.com\/youll-need-a-new... Regards, Didi --------------- Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]}]}