{"windows":[{"symptom":"Unable to select the correct .mdb database        I have an application that stores its data in a .mdb database.I have taken over the database from a previous PC and installed the application with a basic database on the new windows 10 pc.I can locate the file using windows explorer and it shows the correct file size.If I locate the file from the application it only shows the basic file version in the same folder","solutions":[]},{"symptom":"cloudlibrary will not load in my windows 7 pc        I downloaded clloudlibrary from their site. When I try to launch program it does not load. In task manager it keeps increasing the memory that it is using. Up to 500,000k in a few minutes and growing.","solutions":[]},{"symptom":"Windows 10 SSD recognition\/boot        I am experiencing the effects of a boot defect involving some combination of Windows 10, a Samsung SSD, and a Dell BIOS. I am hopeful that someone is familiar enough with the boot process to provide enough insight, or leverage a Microsoft\/Dell\/Samsung response, to correct the behavior. BACKGROUND I purchased a Dell Inspiron 3050, which came with a Samsung 32GB SSD and Windows 8.1. Windows 8.1 upgraded to Windows 10 on the 32GB SSD with no problems. I installed a leftover 500GB mechanical SATA drive with no problems. I purchased a Samsung 250GB SSD as a system drive to replace the original 32GB SSD. To accomplish this, I first migrated Windows 10 to the 500GB mechanical drive with no problems. I removed the 32GB SSD and installed the 250GB SSD with no problems. I used the same process to move Windows 10 back to the SSD as was used to move it to the mechanical drive. The transfer process succeeded without error, but the drive would not boot. Through all iterations of BIOS, driver, and Windows 10 updates, the new SSD was recognizable and useable but would not boot Windows 10. CURRENTLY (new SSD) Windows 10 (1909) is installed with all service updates on the mechanical drive. I have confirmed that the BIOS, Dell driver updates, and SSD firmware are current. With Windows 10 (1903), the system would not reboot during the upgrade unless the SSD was removed. (I subsequently rolled back to Windows 10 (1809).) With Windows 10 (1909), I have determined that it will boot with the SSD installed, but only if the SSD is uninitialized or initialized with nothing allocated to any volume\/partition. So, the SSD is still recognized but no longer useable. CHARACTERISTICS (new SSD) I can create a primary partition on the SSD, assign a drive letter to it, and it works perfectly - until I reboot. During the boot I can enter the BIOS setup and boot menu, but it will not transfer to Windows, either by the Windows Boot Manager nor by a BIOS boot file entry. (Both methods work if the SSD is unallocated.) No Windows event log entries are created during the failed boot. No errors or messages are displayed. The PC apparently completely stops - no drive activity, turns off immediately with the power button, cannot coerce a memory dump, and immediately restarts with Alt-Ctrl-Del. When the SSD is allocated I can boot to a Windows 10 (1809) recovery drive. I cannot boot to a Windows 10 (1909) recovery drive. Both recovery drives boot correctly when the SSD is not allocated, suggesting that something in Windows 10 has changed. Startup repair finds nothing to fix. The only connected devices are: Wired USB keyboard, wired USB mouse, monitor. I have never encountered an error using the SSD other than the current failure to boot if allocated, or its previous failure to boot as the boot device with Windows 10 installed. Windows 10 (1909) boots and operates perfectly with the original 32GB SSD installed. The original 32GB SSD also continues to boot (Windows 10) and operate perfectly when selected as the boot device. The mechanical drive identifies as 'Drive 0'. The SSD identifies as 'Drive 1'.","solutions":[]},{"symptom":"Audio Device Dropped no cause can be found        Hardware:  Windows 10 laptop Dell Latitude E7470 (all drivers updated by company ITLaptop connected to Room Display unit via HDMI cable (no issues)Audio device selected via USB connection is Room Crestron Speakers and MicrophoneTeams voip only meeting (no dial in users or connection)2 1\/2 hours into the meeting the audio was lost. The Technology Operations Officer was in charge of the presentation laptop and checked the audio device list:  the room speakers and mic no longer displayed as an option.  The meeting was finished using a dial in audio bridge.  The computer never regained the room speakers and microphone as a connection option.What would cause this issue?","solutions":["Hi MM, You may want to use the troubleshooter first. https:\/\/support.microsoft.com\/en-gb\/help\/452028...If problems still persist, please check this article instead: https:\/\/www.howtogeek.com\/395296\/fix-my-microph...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Thank you for the quick reply we did try the troubleshooter list and since IT staff were involved the items in the second page were also tried.  The key to the issue is that the device was there and working without intervention, nothing touched the audio disappeared and the device was not displayed as an option.After the meeting was over, the usb cable was removed and then reconnected and wala it was available again.  Although it may seem easy and no big deal most executives during meetings don't want to see this. Any other suggestions would be appreciated."]},{"symptom":"Background and transparency in my PNG files?        Hello everyoneYears ago, i made som pictures in MS Paint and saved them as PNG.I was now wondering, if the pictures have a background or any transparency.The files are bit depth 24.They do not have any tRNS chunks.They do not have any bKGD chunks.So it is safe to say, that my pictures do not have any background or transparency?Is there other indicators, for if the pictures have transparency or a background?Thanks in advance for answeringBest regardsEmil","solutions":[]},{"symptom":"Projecting to this PC        So, I've purchased some time ago, a Surface Pro 6 with the hopes that I'll be able to use it as a second monitor when I get my Surface Book 2 as I looked online and Windows offers that functionality. I've purchased my Surface Book 2 and tried to connect my Surface Pro but it doesn't seem to work. The Book connects to the Pro but it doesn't display anything, the screen turns blank for a fraction of a second on the Book like it's about to project to the Pro. On the pro it says that the Book is about to project until the connection drops because of time out. It shows on the Pro that an connection has been established.I was wondering if anyone has a solution to this problem. I know that there are many threads on various forums out there asking the same question but their solution doesn't fix my problem. This is what I've tried so far on both devices:Uninstall \/ install driversCheck for driver updatesCheck for system updatesReboot the deviceTried both 2.4 and 5 GHz boundsDifferent internet connectionsI've also tried other free software but had no luck.My devices are:Surface Pro 6 128GB i5Surface book 2 256GB i7 15\"","solutions":["*** UPDATE ***When I change the project settings like duplicate or extended, the screen turns black until I move the mouse but then it disconnects.","Hi Rafal99, You might want to check this article for full guide on how to set this up: https:\/\/surfacetip.com\/use-your-surface-as-a-po...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"New Windows setup rebooting at region selection        Hello,I just build with\/for my daughter a new computer though there are some issues we are running into.The computer powers up normally. In BIOS, everything looks fine, memory is recognized, CPU is fine, HD detected....We were able to install windows on the only M2 HD drive.We connected a USB mouse and a USB keyboard. The installation starts and upon selecting the US region, the computer restarts on the click of the mouse. At one point we were able to go all the way to the selection of WiFi (the motherboard has built-in WiFi), but a click of the mouse also caused a reboot. We tried to avoid the mouse and use the keyboard only, but with \"next\" the PC rebooted again.Booting from the Windows CD disc and selecting repair did not offer any repair. Basically it says that no repair found or something similar. At this point we cannot move forward.  Any advice on what is this about and how to fix it? Thank you","solutions":["Hi, PurMar My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Well, we wiped out the installation and reinstalled windows.We were able to reinstall Windows and it finished setup, even though the computer restarted itself couple of times during the process. Win10 is installed now, but even if it loads (boots fast), it shuts down and restarts. It is a new built, so I wonder if we have something not connected well. What would cause the computer to just shut down over and over?","Try entering the BIOS and reset factory settings","I entered the BIOS and could not find how to reset it. Yesterday I did remove the battery so I assume that forced it to reset. Found out in BIOS that there is an updated version, so flashed the bios, it updated. The computer started, windows loaded, and after 30 seconds or so restarted itself. Few times it stayed up for up to 2 minutes though most of the time it restarts after 15 seconds or so. ","Hi,Does it work OK after the restart ?","I recommend you to do a new installation of Windows","This is a second win installation and the problem is that during the installation this was happening over and over. https:\/\/www.dropbox.com\/s\/rogjgdhwaxs28w3\/20200105_190757.mp4?dl=0Finally, it went through but still shuts down after a few sec...  I am able to log in to win, the computer boots fast, but then... restarts. ","Hi PM. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.The problem is likely with hardware since it happened in boot mode during install when Windows didn't even exist yet. So I would check over your build carefully, that all the connections are tight and correct. There are good new build diagnosis tutorials here:https:\/\/www.windowscentral.com\/diagnosing-commo...https:\/\/techguided.com\/pc-building-mistakes\/Test the hardware: Try with only one RAM stick, then swap sticks and slots to see if any configuration is stable.Test the RAM overnight to stress it with the best bootable test memtest86, following this guide to test both sticks and slots:https:\/\/www.wikihow.com\/Test-PC-RAM-with-MemTest86Test the hard drive or SSD with diagnostics: https:\/\/www.lifewire.com\/free-hard-drive-testin...https:\/\/mashtips.com\/ssd-health-test-and-perfor...  Best is to use the HDD\/SSD manufacturer's own if there is one, otherwise use Seatools bootable long test:http:\/\/blog.nowherelan.com\/2013\/04\/04\/boot-seat...Follow this up with a full Disk Check from the Command Prompt in Repair Mode or from bootable media:https:\/\/www.groovypost.com\/howto\/check-hard-dri... if necessary from the Command Prompt at boot:https:\/\/www.tenforums.com\/tutorials\/2294-advanc...If Windows is unstable you can use a bootable Linux distro to test the hardware, while the hard drive is unplugged to rule it and Windows out:  7 best Linux live CD distro for 7 different purpose - PCsuggest I hope this helps. ______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","This may have been the issue...The CPU core voltage was set to AUTO and 0.7 V. Changed to 1.275 V and so far it is has been running for 30 minutes or so. Hope it stays. Thanks.","Good catch. Let me know if that resolves it."]},{"symptom":"Windows 10 PC goes to lock screen after 2 minutes        Screen saver set at 15 minutes, yet after 2 minutes of inactivity display goes blank requiring \"enter\" to get lock screen . I must always move my mouse to stay \"active.\" Can't seem to find a solution online that works. *Modified title for accuracy**Original title: Windows 10: PC goes to lock screen after 2 minutes*","solutions":["The setting to fix this is \"System unattended sleep timeout\" in advanced power settings. (Control Panel\\Hardware and Sound\\Power Options\\Edit Plan Settings > change advanced power settings).However this setting is hidden because Microsoft wants waste our time and make our lives miserable. To un-hide it, you need to change a registry attribute value data from 1 to 2 at the following registry path:HKEY_LOCAL_MACHINE > SYSTEM > CurrentControlSet > Control > Power > PowerSettings > 238C9FA8-0AAD-41ED-83F4-97BE242C8F20 > 7bc4a2f9-d8fc-4469-b07b-33eb785aaca0Full instructions:windows key + Rtype regedit and hit enterclick Yes if askedon registry editor - ctrl+Fsearch for 7bc4a2f9-d8fc-4469-b07b-33eb785aaca0 wait, can take a while to findwhen found, double click attributes on the right panechange value data to 2hit ok, close registry editor.Right click the start button > power options > Additional power settings > Change Plan Settings > change advanced power settingsexpand Sleepexpand System unattended sleep timeoutchange both values to zero for never or set your preferred value."]},{"symptom":"Printer status ONLINE but will not print.        Canon printer installed properly. It is set up without issue. Spent hours on the phone with Canon support to confirm printer is not the problem. Have updated drivers, uninstalled and re-installed printer.Still, every time I try to print a test page (or anything), I get an information notice telling me my printer is ONLINE!This is driving me crazy. HELP?!","solutions":["HI CC. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Run the Printer troubleshooter at Settings > Update & Security > Troubleshoot. Rather than spending too much more time fiddling I'd simply Clean Install the printer which always works, lasts longer and actually saves time:1) Power up the printer, if wired unplug it's USB cable from PC. 2) Go to Settings>Apps>Apps and Features to find and Uninstall any printer software.3) Use one of these methods to remove all of the old printer drivers: https:\/\/www.tenforums.com\/tutorials\/101274-unin...https:\/\/helpdeskgeek.com\/how-to\/remove-uninstal...4) Now type Control Panel in Start Search, open CP, choose Icon View. In Control Panel open Devices and Printers, right click printer to delete Printer and any scanner or fax of the same name. Restart PC.5) Go to the Canon Support Downloads webpage here https:\/\/www.usa.canon.com\/internet\/portal\/us\/ho... to download and install the latest full software package. Now is also the time to check for any newer printer firmware to install which matters a lot.6) Extract Printer software, right click Setup file to Run as Administrator. Follow the setup screens closely as you install the software. For USB it should prompt when to plug in the printer.Older software may need to be installed in Compatibility Mode to run correctly: https:\/\/www.groovypost.com\/howto\/run-old-softwa... If you have further problems reply back with results of each step. Once it's installed and you've run a test print, then scanned it to see that it opens on the desktop, open the Printer software and go into its Settings to set the scan-to file location you prefer, also the email app you want opened for Scan to Email, if applicable.I hope this helps. Feel free to ask back any questions and let us know how it goes. If you will wait to rate my post until we are done, I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thank you Greg, but that did not solve the problem. What I noticed is that when the program was installed, it did not create a Standard TCP\/IP port - was trying to use a WSD one. I added a Standard TCP\/IP port using the IP address for the printer and it works!! ","Never seen that before. The software is supposed to do all of that for us, or I would not buy their products. Glad it's resolved.","To clarify, it is not a Canon product issue. Printer installed correctly on another PC. Something is running in the background on my PC that is causing the problem. Still, happy it is resolved too. Thank you for your help!","You can eliminate most unwanted 3rd party background processes by turning off Startup freeloaders from Step 4 of this checklist:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki..."]},{"symptom":"MS Wireless mouse scrolls too fast        My 'MS wireless mouse 1000' scrolls too fast. This is in spite of bringing down the number of lines to just one at a time.Please advise","solutions":["Hi Dr. and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.1. Press the Windows key and type in \"Settings\" and press enter. 2. Select \"Devices\". 3. Select \"Mouse\". 4. On the upper right corner click \"Additional mouse options\". 5. Under the \"Mouse Properties\" click the \"Wheel\" tab. 6. Set according to your own settings. 7. Click \"OK\". I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Hello Dr. Abdul Rasheed K.,If you like, you could see if using an option in the tutorial below may reduce your mouse scroll speed.https:\/\/www.tenforums.com\/tutorials\/83213-change-mouse-scroll-speed-windows-10-a.html"]},{"symptom":"Accidentally set my .package file to notepad        So, I accidentally set a .package file to notepad as default. How do I revert it?","solutions":["Hello ofirgutnick, I'm Didi, an independent advisor. To delete the association of .package files with Notepad please follow the instructions provided by DaveM121 on this thread, scroll down to see his answer marked in green :https:\/\/answers.microsoft.com\/en-us\/windows\/for... Regards, Didi","Hello ofirgutnick,If you like, you can download a .reg file for the \"Package\" option listed in the table of option 2 in the tutorial below to restore its default association.https:\/\/www.tenforums.com\/tutorials\/8703-restore-default-file-type-associations-windows-10-a.html"]},{"symptom":"Windows Hello -This option is currently unavailable        I just bought a new laptop the other day and for the first few days I had no problems setting up a pin and fingerprint sign in. Over the past few days, the settings sign-in options tab display the error \"This option is currently unavailable-click here to learn more\", and i can not setup\/remove any sign in options. I have the latest updates and all drivers should be up to date as the laptop was shipped 2 weeks ago. Does any one else have this problem, or any ideas on how i can solve this problem?","solutions":["I factory reset my laptop and windows hello sign in set up seems functional."]},{"symptom":"Error: Check with your IT or System administrator when trying to switch out of S mode        I want to switch out of S mode but when I try the button is not available and there is a message: \"Check with your IT or system administrator.\"My computer is personal and I am the only profile and administrator already. How can I transpose my problem?Thank you!***Modified title from: Switching out of S mode - Check with your IT or system administrator.***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are getting an error, ‘Check with your IT or system administrator’ when trying to switch out of S mode. I’ll certainly help you with this issue. However, please let us know: How are you trying to switch out of S mode?Are you using a University\/School account to login to the computer?Where do you see the error \"Check with your IT or system administrator.\"?Which build version of Windows 10 is installed on the computer? To check type:winver in the search bar on the Taskbar and hitEnter.  I suggest you to refer the article on Switching out of S mode in Windows 10 and see if that helps. If you are using a University\/School account to login to the computer, I would suggest you to create a new user account, login to Store using your personal Microsoft account and try switching out of S mode. Refer the articleCreate a local user or administrator account in Windows 10.  If you face any issues, I suggest you to refer the steps mentioned below: Reset Windows Store Cache: Try resetting the Store and see if that helps. Press Windows key + R. This will openRun. Alternatively, you can go to Start and search for ‘Run’.In Run dialog box, type ‘wsreset.exe’ and hitEnter. Note: A blank Command Prompt window will open, and after about ten seconds, the window will close and Microsoft Store will open automatically. Re-register Store: Run the PowerShell command to re-register store. Press Windows + X keys together and click onWindows PowerShell (Admin).Now type in the command and hit Enter:Get-AppXPackage *WindowsStore* -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register “$($_.InstallLocation)\\\\AppXManifest.xml”}Restart the PC. Let us know the results.  Regards,Nikhar KhareMicrosoft Community - Moderator","When I tried to switch out s mode in Microsoft store, it shows \"check with your IT or system administrator\", and the get button is Grey. I'm tired of this  shi t, tried several methods and it just doesn't work. One more thing note that any .exe can not be executed in s mode, so don't say run cmd... Anyways, s mode is good for 6-year-old kids, please don't pre install this shi t in any or your product. Thx."]},{"symptom":"Reactivating Win 10 on a new device after crash of the motherboard        Hey community!I hope you guys can help me. I'm trying to reactivate Win 10 on my desktop PC after a massive crash of my last PC (motherboard, CPU, GPU).The problem is i have recieved my Win 7 Image at Microsoft Dreamspark as student a few years ago and did the free upgrade to Win 10. I still have the image available but not the productkey. Is it somehow possible to avoid buying a new licensekey?Thank you for your help.Pablo","solutions":["Hi . I'm Reinald, an Independent advisor and a Windows user like you. Thank you for providing information on your issue, we are are happy to assist you.To be assist you, i just need additional information so i can better assist you: 1. Are you trying to reactivate the license on a new computer or did you just upgrade parts on the original computer?2. Do you know what type of Windows license do you have? OEM, Retail or Volume? 3. Did you link your license to you Microsoft account? For us to know your Windows license type, can you also do the instructions below and attach the screenshot.1. Click Start > type CMD> Right click on \"Command Prompt\" and select Run as administrator > and type in the following command:slmgr.vbs \/dlv 2. A \"Windows Script Host\" box will pop-up Check \"Product Key Channel\". IT should tell you what type of license do you have Let us know how it goes and don't hesitate to ask if you have further questions. I will do my best to to assist you until your issue is resolved.","Hi Reinald thanks for the fast reply. I'm trying to reactivate the license on a new computer. Actually i have no idea what type of windows license i had before. If \"link\" to the Microsoft account means, that i have created an account and used the one drive cloud, yes.The Windows Script Host says that the product key-channel is a retailversion.ThanksPablo ","Hi Pablo, Since you have a retail license you should be able to transfer the license to a new computer.A Retail license refers to the license that you acquire when purchasing a copy of Windows 10 from your local store or a retailer. This type of license is transferable a even after changing major hardware parts or reactivating to a new computer.How did you originally activated your license to your old computer? Was it by using a product key or a digital license? A digital license is a method of activation in Windows that doesn't require you to enter a product key.If you previously linked your Microsoft account to your license, you can easily transfer the license to the new computer by following the instructions on the link below for - Reactivate Windows 10 after a hardware change:https:\/\/support.microsoft.com\/en-us\/help\/12440\/...If you are not sure if your license is linked to your Microsoft account, You might need to access your old computer and linked your license or you won't be able to transfer the licenseYou can follow this guide for linking your license to you Microsoft account: https:\/\/www.windowscentral.com\/how-link-your-wi...If it fails, you can also try contacting Microsoft for further assistance in your retail license:Call\/Chat\/Schedule a Call https:\/\/partner.support.services.microsoft.com\/...Local Phone Number: https:\/\/support.microsoft.com\/en-us\/help\/13948\/...I hope this information helps. Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Lifecam studio webcam can't run on Windows        I'm trying to use my Microsoft LifeCam studio webcam on Windows 10 version 1909, I can view the cam in skype and the camera app on edge but I don't have control over the cam including zoom, pan and tilt.  When I attempt to install the software for the cam I receive a message saying....LifeCam can't run on Windows, check for an updated version of this app that runs on Windows, I have searched everywhere, any help would be greatly appreciated. ","solutions":["Hi JCT. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See possible fixes for running Lifecam Studio webcam in WIndows 10: https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/www.mattwoodward.com\/2016\/09\/14\/fixing-...There are also other solutions here from Windows Report which has excellent editorial content but I would not click on any ad links!https:\/\/windowsreport.com\/microsoft-lifecam-win...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Task manager 100%        I have a problem where task manager states i am using 100% of my cpu when i am not, no matter what i shut down task manager replaces it with something else to put my usage back to 100% the laptop is fast getting unusable.","solutions":["Hi James, There's a lot of things to consider in regards to this issue. Please check these suggestions and check this article: https:\/\/www.windowscentral.com\/15-tips-increase...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"remove click or tap to follow link        remove click or tap to follow link","solutions":["Hello! I am an Independent Advisor, I would love to help you out! Where are you trying to remove this from? A specific application? Is it a link you are inserting or is already there?Could you include a screenshot?"]},{"symptom":"win10  WiFi hotspot        IPV4 No network access rights","solutions":["Hello YadongCheng! My name is Marco, I am an Independent Advisor. I will do my best to help you.Try this Press the \"Windows + r\" key and write \"NCPA.CPL\" (without the quotes) Right click on your wireless network card and click \" properties \" First, make sure \" Internet Protocol Version 4 (TCP\/IPv4) \" is checked. If it was not go test your connection. Otherwise continue with the steps below Now double click on Internet Protocol Version 4 (TCP\/IPv4) Select \" Use the following IP address \" Enter these figures in each of the boxes mentioned. IP address: 192.168.1.5 Subnet mask: 255.255.255.0 Default gateway: 192.168.1.1 Then press OK Now check if your connection work . If not please re-check the box \"Obtain an ip address automatically\" and we will try something else.","你好亚东成！我叫马可，我是独立顾问。我会尽我所能帮助你。请尝试按\"Windows + r\"键并写入\"NCPA\"。 CPL\" （没有报价）右键单击您的无线网卡，然后单击\"属性\"首先，确保\"互联网协议版本4（TCP\/IPv4）\"被检查。如果它没有去测试您的连接。否则，请继续执行以下步骤，现在双击 Internet 协议版本 4 （TCP\/IPv4）选择\"使用以下 IP 地址\"，在上述每个框中输入这些数字。IP 地址： 192.168.1.5子网掩码： 255.255.255.0默认网关： 192.168.1.1 然后按\"立即确定\"检查连接是否正常工作。如果没有，请重新选中\"自动获取 IP 地址\"框，我们将尝试其他操作。I tried a few times, but I still couldn't","Did you try to uninstall the network card, then restart and let windows reinstall it? Or go to the manufacturer's site to download the latest updated drivers.To do this Right click on start button Go \"Device Manager \" Find your network car and right click on it and unintall.","Hi YadongCheng,more details are needed: how do you connect to the internet, via LAN or wirelessly?Did the mobile hotspot work on your pc previously?Did the problem appear after updating or installing new software? Are you using Microsoft \/ third-party firewall \/ antivirus?Post the screenshot with the error message you receive when you try to enable the mobile hotspot.Otherwise try to restore the network:Settings> Network and Internet> Status.Click Network Reset on the right side, follow the instructions and read the notes.","通过局域网连接的英特网","I tried a few times, but I still couldn't","This is not the screenshot I want to see.Go to Network and Internet Settings and enable Mobile Hotspot, what is the error message you receive?Post the screenshot.","Did you reinstall your network card? With updated drivers on the manufacturer's site?"]},{"symptom":"Mouse randomly becomes unresponsive\/ screen involuntary reverts\/jumps back to previous screen.        This is a two-part problem that I believe is related or connected. 1.       The mouse stops working.  The curser moves but loses click response. I accidentally discovered that by bringing up the Taskmaster screen (by using ctrl-alt-del keys), the mouse regains functionality for a short while before becoming inactive again. I swapped out both, the mouse and the keyboard, but the problem persisted. Therefore, it isn’t a device problem.  I also tried another computer and the problem persisted with the transferred devices. 2.       When viewing a directory file, or while browsing, the screen involuntarily reverts to the previously viewed screen which triggers the mouse unresponsive problem. Any suggestions?","solutions":["Hi, Ron My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps: Press the Start key and type the word CMD or Powershell, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanu p-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/929833..."]},{"symptom":"trouble after Windows 10 upated my computer        After windows updated my computer I can not find my webcam and it is not listed Device Manager and error message webcam can not be found.","solutions":["Hi MrMarr and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/support.microsoft.com\/en-us\/help\/13753\/...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","None of that worked. After windows updated my computer I cannot find my webcam and it is no longer listed in device manager. I get error message “No Camera Detected”.","Hi MrMarr, I found an existing thread that will help you resolve your concern, please check the link below for your reference.https:\/\/answers.microsoft.com\/en-us\/windows\/for...Let me know how it goes. Thank you."]}]}