{"windows":[{"symptom":"how to clean ink jets on hp office jet 3050?        how to clean ink jet on office jet 3050?","solutions":["Hi Harold Please see Step 11 in the Windows section of this page on the HP website: https:\/\/support.hp.com\/us-en\/document\/c02206095________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","Hi Harold, IMPORTANT Please DO NOT call that Phone No. form Dylan Scoot above, that is a Tech Support Scammer and they will be removed Shortly . ."]},{"symptom":"Update fm Windows 7 Home Premium 64bit to Windows 10        I have a custom built (I built it) desktop running Windows 7 Home Premium w\/6 Gigs of RAM-DDR3.How can I determine if my system is compatible with a similar version of Windows 10?Thanks,Kevin","solutions":["When you run the upgrade it will check and tell you if you have any problem software or hardware.You can download the ISO image file using the Media Creation Toolhttp:\/\/www.microsoft.com\/en-us\/software-download\/windows10","Don't call the fake support number."]},{"symptom":"talk with someone        Can you please send me a telephone number to call and speak with someone???I need some help, and I really think that it would only take about 10 minutes to resolve.Thank you!","solutions":["Hi Pamela If you think we can help with this here, please explain what is happening with your PC and we would be glad to help you . . .If you feel you need to speak with Microsoft Support, you can choose a local Phone Number from the link below . . .https:\/\/support.microsoft.com\/en-us\/help\/13948\/...","I want to migrate the info and programs from my Windows 7 computer to my Windows 10 computer.  Thank you,Pam","Hi Pamela You can move your data (Files and Folders) across from one PC to the other, using a USB Flash Drive or external Hard driveHowever, you cannot move your Apps across form one PC to the other, those will need to be downloaded and re-installed, the reason is, when you install software, files are copied to many locations on your PC and a lot of Registry entries are created, this cannot be replicated by copying Apps from one PC to another, sorry . . ."]},{"symptom":"contoso is blocking  a me from opening a file?        contoso is blocking a file","solutions":[]},{"symptom":"In File Explorer, Folder with many pics snaps back to beginning constantly while working with pics        So Irritating!  I have a file folder in Windows 10 that has almost 2500 photos that I need to work with such as renaming different ones, etc.  When I am scrolling down the large icons to the one picture I want to rename, let's say, I finally find it and select to rename and then the folder snaps all the pictures back to the beginning of the files within that folder.  I need them to be in the one folder even though that is a lot of pictures.  Is there some setting I can change so that I can scroll all I want up and down through the photos and it doesn't constantly go back to the beginning of the photos.  It sure makes doing what I'm trying to do so time consuming.  Any help would be appreciated. Thanks!","solutions":["Hello InDeeper, I'm Didi, an independent advisor. To fix the issue where Explorer is jumping back to the beginning of the file list, there is a fix that worked for many people even though it looks strange :Press Windows key + D (or Windows + M) to go to your desktop. Right-click anywhere but not on a shortcut and click on Personalise. On the left click on \"Colours\", uncheck \"Automatically pick an accent colour from my background\".Regards, Didi"]},{"symptom":"trying to switch out windows 10 s mode        trying to switch out windows 10 s mode through store just keep getting messaage problem our end try again later","solutions":["Hi paultoon1 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that might help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/windows10skill.com\/something-happened-t...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","hi I have been on phone to Microsoft for nearly two hours and they could not fix it just recommended I keep trying for a week or so and then phone back","Hi paultoon1, I will release the question for other experts come to give his opinion, I am sorry not to find the problem.Thanks!","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please perform the following steps and then try to Exit the S mode. 1. Type powershell at start menu. When it appears right click on it and select Run as Administrator.2. Copy and paste the following command and hit Enter. Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register “$($_.InstallLocation)\\AppXManifest.xml”}3. Wait till the process ends and the restart the PC. 4. Then try to exit S Mode."]},{"symptom":"0x00000124        I was playing videogames, and suddenly my pc restarted with a blue screen.I have compilated all the information I could:123119-10015-01.dmp 31\/12\/2019 2:01:31 0x0000012400000000`00000000 ffff8704`8e4c7028 00000000`b200000000000000`00030005 hal.dll hal.dll+47fe8 x64 ntoskrnl.exe+1c14e0 C:\\WINDOWS\\Minidump\\123119-10015-01.dmp16 15 18362 941.836 31\/12\/2019 2:03:04What should I do now?","solutions":["Hi Enrique, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Was it a one off crash?","Hi Enrique, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Was it a one off crash? I completely rebooted the pc yesterday cause it happened like 5 times three days ago, that is why I did it, and I thought that it was going to work but it didnt, and it crashed with a blue screen again t_t","Hi, We need log files(called dump files) that tell us what lead to crash. Please share them with us for a better analysis of the problem. Instructions can be found here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Please let us know if you need any assistance about posting dump files.","Here it is:https:\/\/1drv.ms\/u\/s!Ar9prjo9VS-Tjw0I29EXtx2f6EvP?e=VJVvFX","Thank you. I looked at the crash - Bugcheck 124 is usually a hardware problem. Unfortunately, Dump didn't provide much info:Flags : 0x00000000 Severity : Fatal Error : Unknown (Proc 15 Bank 0) Status : 0xb200000000030005 Let us check the state of the processor. Please run Prime95 and post the results.https:\/\/www.tenforums.com\/tutorials\/16474-prime...Disclaimer: There are links to non-Microsoft websites which would provide accurate and safe information. Watch out for ads on the websites which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","Well, i just started the test and the blue screen jumped on with error code: WHEA_UNCORRECTABLE_ERROR","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. A \"0x00000124\" Stop error message occurs when you use the \"hot plugging\" feature to add or to remove a PCI Express device.Hence, I suggest you to check with the peripherals you plugged in to the PCI express slot. (For example Video card, Sound card, Wireless Card, SSD etc..)If you have overclocked the CPU or GPU, reset it to normal clock speed."]},{"symptom":"Having Bluetooth Stuttering Issues on Windows 10        As of recent, when connecting any pair of bluetooth headphones or devices, I would get stuttering problems where when using bluetooth headphones, the audio would frequently cut in and out randomly, and it would frequently disconnect, even when it was fully charged. And yes, I've tried to fix the issue by disabling audio enhancements, but it hasn't helped at all. Additionally, I've had problems with other bluetooth devices where they would also frequently disconnect. Is there a fix to these problems?","solutions":["Hi ToniFlamboni,Please run the Bluetooth troubleshooter and see if the issue will persist. Please follow the steps below on how:Press Windows and I keys to open Settings.Click on Update & Security.On the left hand pane, click on Troubleshoot.Under Find and Fix other problems, click on Bluetooth.Click on Run the troubleshooter.If the troubleshooter was unable to fix the issue, please download and install the latest drivers for your Bluetooth adapter. Please click on thislink on how to Update drivers in Windows 10.Let us know how it goes.","I tried using the troubleshooter, and even though it said something about fixing an issue, the problem with stuttering connection and frequent disconnects continued. I also tried updating my drivers, but it said that they were up to date. I also tried reinstalling the driver for my Bluetooth headphones, but that didn't fix the problem either. Is there any way to fix this problem?","I still am unable to fix the issue. Can I still get help on this?","I am experiencing the same trouble.Terrible BT audio stuttering to the point where the audio (speech) is nearly impossible to understand. The stuttering is accompanied (or caused) by a ticking sound (like the BT is being rapidly turned on\/off), but the problem seems to start whenever audio is played. When the audio stops, the rapid \"ticking\" continues for a few seconds.What I know:The stuttering is not related to the BT add-on because it occurs with two other BT USB plugs (different manufacturers)It is not related to a specific audio headset. I have paired three different headsets (ranging in price from $300+ to $40) - Same stuttering.Possible reason based on Internet searches:Possibly related to network (WiFi) interference?Seems to be a unique problems in Windows 10. :( ","I am having the same issue. Just started yesterday and ONLY happens with windows. My android phone still has perfect audio.The headphones work in low quality 'headset' mode in win 10 but if you put them into 'headphone' mode as selected in the audio panel the audio immediately goes out of sync, I mean, out of sync by over a second within seconds of playing then the video I am watching begins to skip and jump and if I pause it the audio continues for a few seconds afterwards.Using the Bose QC35 ii, and they have had no issues with my PC for over a year. Not sure what Microsoft has changed now but its really ruining my experience.","I have recently begun to have this issue as well. I have used the headphones in question (Sony wh-1000xm2) for some time now, without issue. This problem started within the last week.The troubleshooter did not help.","I am having the same problem with my Bose QC35 ii's.","I am also having problems with Windows 10 Pro and Bluetooth headphones. I spent a rather great deal of money on the headphones. They pair and connect but stutter badly on a Laptop and a PC both running Windows 10 Pro.The headphones are completely and totally unusable. I should note they work perfectly on my Android phone when paired with my Google Pixel 2 XL.I reached out to the headphone manufacture and was told it's a Microsoft Windows 10 issue.","I was having this issue. @SDCinVan suggested that it may be because of wifi interference. I was running my laptop on the 5GHz connection. After switching to the 2GHz option, I haven't had any issues. If you have the option of switch wifi frequencies, give it a try.","I am having the same issue. I have tried 3 bluetooth headsets (Plantronics, AudioTechnica and JBL) at this point and all have the same problem. It has something to do with the headset functions of the headphones. When I am just listing to music there are no issues, but the moment I need to get on a call the audio degrades heavily to the point that I cant understand or be understood. Even skype tells me something like \"Your audio device is causing poor call quality\".This issue does not happen on my android phone. I have been forced to take all my calls through my cellphone, which is not ideal."]},{"symptom":"uninstall .net framework 3.5 Error code: 0x80073701        Initially, I noticed:2019-12 Cumulative Update for Windows 10 Version 1909 for x64-based Systems (KB4530684)was failing to install:There were problems installing some updates, but we'll try again later.2019-12 Cumulative Update for Windows 10 Version 1909 for x64-based Systems (KB4530684) - Error 0x800f0831My attempts to fix this problem have all failed. These are the steps I've taken so far:C:\\WINDOWS\\system32>sfc \/scannowBeginning system scan.  This process will take some time.Beginning verification phase of system scan.Verification 100% complete.Windows Resource Protection did not find any integrity violations.C:\\WINDOWS\\system32>dism \/online \/cleanup-image \/restorehealthDeployment Image Servicing and Management toolVersion: 10.0.18362.1Image Version: 10.0.18363.476[==========================100.0%==========================]Error: 0x800f081fThe source files could not be found.Use the \"Source\" option to specify the location of the files that are required to restore the feature. For more information on specifying a source location, see http:\/\/go.microsoft.com\/fwlink\/?LinkId=243077.The DISM log file can be found at C:\\WINDOWS\\Logs\\DISM\\dism.logI confirmed .net framework 3.5 was installed, and I then installed all the parts of 3.5. This worked too, and instead of a black checkbox, it became a black checkmark in the .net framework 3.5.I also confirmed .net framework 4.8 was installed.After days of trying various fix methods, I stumbled upon an article that suggested:1. uninstalling .net framework 4.82. uninstalling .net framework 3.53. installing .net framework 3.54. installing .net framework 4.8I uninstalled .net framework 4.8, but when I tried to uninstall .net framework 3.5, I get an error:Windows couldn't complete the requested changes.The referenced assembly could not be found.Error code: 0x80073701Tell me how to solve this problemNothing I look for talks about how to fix this error when UNInstalling .net framework 3.5 -- they all talk about installing, and lay out careful instructions about where to get the .net framework 3.5 to install... but, the problem is I can't uninstall it, and I suspect this means I can't install it either because it's already installed.What else can I do?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please perform the following steps and check if the Windows Update is working or not.Press Windows+R to open Run. Type services.msc and press Enter Look for \"Windows Update\" service Double tap on it and make sure the Startup is set as Automatic. Restart the PC. Check for Updates.","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please perform the following steps and check if the Windows Update is working or not.Press Windows+R to open Run. Type services.msc and press Enter Look for \"Windows Update\" service Double tap on it and make sure the Startup is set as Automatic. Restart the PC. Check for Updates. I did as you asked, and Windows Update is set as Automatic (Trigger Start). Since I did not make any changes, restarting again is unlikely to fix any problems.However, I have restarted many times during my attempts to fix this, and the errors I reported in my original post are the original, and current errors.Do you want me to reboot anyways?","Please check if there is any option for only \"Automatic\". Switch it to just Automatic. Then Restart the PC. If there is no such option (just \"Automatic\"), please right click on the Windows Update service and select Restart.Then check for update. Let me know the status.","Please check if there is any option for only \"Automatic\". Switch it to just Automatic. Then Restart the PC. If there is no such option (just \"Automatic\"), please right click on the Windows Update service and select Restart.Then check for update. Let me know the status. I apologize. The option is called 'Automatic' in the dialog box.The setting outside of the dialog box reads 'Automatic (Trigger Start)'.This is the automatic that you want.Since I am not changing anything, I won't reboot for this.Thank you for your aid.","Alright, in that case please right click on the Windows Update service and select Restart.After this, check for update. If the issue remains, please use the following tool and check for updates. https:\/\/www.microsoft.com\/en-in\/software-downlo...","Alright, in that case please right click on the Windows Update service and select Restart.After this, check for update. If the issue remains, please use the following tool and check for updates. https:\/\/www.microsoft.com\/en-in\/software-downlo...As you requested, I right clicked the Windows Update service, and clicked Start.Then I right clicked the Windows Update service and clicked Restart.Then I checked for update:There were problems installing some updates, but we'll try again later.2019-12 Cumulative Update for Windows 10 Version 1909 for x64-based Systems (KB4530684) - Error 0x800f0831Then I downloaded the tool you pointed me to and ran it.This stated only:Thank you for updating to the latest version of Windows 10.and it didn't do anything else.So, I checked for updates again, and clicked retry.Update went through the installation, and failed in the same manner as before.","Okay, could you please create a Local Account (Admin) and check for updates?You can remove the local Account anytime.If it still refuses to update, you may need to create a fresh installation disk with Version 1909 and perform a clean installation.","Okay, could you please create a Local Account (Admin) and check for updates?You can remove the local Account anytime.If it still refuses to update, you may need to create a fresh installation disk with Version 1909 and perform a clean installation.I am already running a Local Account (Admin) and checking for update.On the other hand, I have never checked for an update with a Microsoft account.","I would recommend you to log in using your Microsoft Account then and try to update.","I would recommend you to log in using your Microsoft Account then and try to update.As you suggested, I logged in with my Microsoft account, and it started forcing me to do a number of things like creating a Windows Hello PIN to make hacking into my computer much easier.There was no change to the error message.I'll have to research how to disable the Microsoft Hello PIN now.I do not care to do a clean install of Windows since that tends to mess up everything I do by (for example) not importing my current desktop, and forgetting everything I have installed."]},{"symptom":"Icons broken after switching from Game window to desktop        I have stumbled on a quite peculiar problem.I have a 1st generation Surface Book with a fully updated Windows 10.I installed a game from Steam (Dark Souls II), then alt+tabbed it, and after that desktop icons become \"broken\".All desktop icons were grouped at the same location, one above the other. Their active area spanned the whole screen, not just the icon.https:\/\/imgur.com\/LOPkJIeThe image above shows me hovering the mouse cursor on top of the screen, the icon itself is nowhere to be seen, but its active area spans the whole top row.I've tried to hide system desktop icons (My Computer and Recycle Bin) and delete all programs shortcuts, and then add again, but the problem was the same. I tried to change resolution, DPI scaling, connect another monitor, restart, shut down, enter tablet mode, with no success in resolving the problem.I also tried to restart the game, change game resolution settings, alt+tab again, but the problem stayed the same.In the dialog to show system desktop icons, I noticed that icons aren't shown...or probably are but I can't find them.https:\/\/imgur.com\/nxG61XxOnly desktop icons are affected. Taskbar, wallpaper, lock screen, mouse cursor, are all fine.Anyone got an idea on how to solve this?Thank you.***Original title: Icons \"broken\" after alt-tabbing a game on Surface Book***","solutions":["Have you tried right clicking the desktop and clicking View?","It changes the icon size (I think), but the active area remains the same size and the icons remain outside the screen.","Did you look at the Align icon items?","Yes, and does absolutely nothing. The icons' active area continue to stretch beyond normal boundaries, preventing me to see the icons and arringing them as usual on the desktop.","Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues with desktop icons on your PC, and I certainly appreciate your efforts in trying to resolve the issue by following certain troubleshooting steps. I would suggest you to follow the suggestions mentioned below and see if that helps. Method 1: Try running the troubleshooter to fix issues with Windows Files and Folder problems. Refer the articleAutomatically diagnose and repair Windows file and folder problems Method 2: Try rebuilding the icon cache and see if that helps. Type command prompt in the search bar on theTaskbar.Right click on the command prompt icon and selectRun as administrator.Now, past the following commands and press Enter after each command:ie4uinit.exe -showtaskkill \/IM explorer.exe \/FDEL \/A \/Q \"%localappdata%\\IconCache.db\"DEL \/A \/F \/Q \"%localappdata%\\Microsoft\\Windows\\Explorer\\iconcache*\"shutdown \/r \/f \/t 00 Method 3: You can try creating a new user account and see if the issue persists. Refer the articleCreate a local user or administrator account in Windows 10 Let us know how it goes.  Regards,Prakhar KhareMicrosoft Community – Moderator","Methods 1 and 2 didn't work. The second method's first deletion command returns a file not found error; the other commands work.Creating a new user does solve the problem, icons and active areas are correctly displayed as they should. However, I'd really like to find a solution to the problem should it surface again, and not lose everything I have in my current account.Thank you.","Methods 1 and 2 didn't work. The second method's first deletion command returns a file not found error; the other commands work.Creating a new user does solve the problem, icons and active areas are correctly displayed as they should. However, I'd really like to find a solution to the problem should it surface again, and not lose everything I have in my current account.Thank you."]},{"symptom":"Problem with shared folder Windows 10 1909        Hi! I have a problem with shared folder since I installed Windows 10 1909. My scanner and phone app (total commander) don't have an access to shared folder on my computer. The second computer (Windows 10 1903) in my network has an access to that folder on my computer. I have tested scanner and phone app with the second computer and everything works, as with my computer before update to 1909.","solutions":["Hi, macivsIm new to windows put i think i know a solution1. Make sure you right click the folder you want to share then share it to all users and not only your second PC if it is ok follow the next stepsMethod:1. Verify if your account is an admin probaly this is causing the trouble (in settings)2. Try reset your PC (keep files!) or if is possible account3. Verify is your PC is up-to-date4. Try share a shortcut of that folder5. Verify is folder is not yours or is for someone else (example if you have more than 3 accounts on your PC)If this helped you thanks! My name was Nick see you later! bye!","Nick, everything is set right (as you wrote) and it doesn't work.","oh ok.","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please disconnect the PC having Windows 10 1909 from the Network and add it again.Then check if it recognizes the shared folder."]},{"symptom":"Can I stop alerts from appearing?        Whenever I wake up my computer, messages from Outlook and Facebook appear in the bottom right corner of my screen.  Can I use Windows to stop these?  Or must I go to Outlook and Facebook.  Facebook's a problem since I deleted my membership over a month ago....tialas","solutions":["If you mean in the Notification area then select the Notification icon (after you see the item appear) and hover over the particular notification you should see a little gear icon in the top corner. Select this to see if there's an option to control the notification.","Hi Laurel Open the Settings App (gear icon on your Start Menu) Go to System - Notifications and Actions On that page is a list of Apps allowed to show Notifications Check if those two apps appear there, if not and you use those in a web browser, turn off notifications form that web browser . . ."]},{"symptom":"Windows Contact editing        When a contact is viewed, I am unable to add information in the Notes tab.  Is there any help available to correct this issue.  Also, when the list is viewed, the email and telephone numbers are grayed out.  Any suggestions?  Thank you.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. This has been reported by users that People app is not able to add information to the existing contacts. However, I am sure it will be fixed and the app will be updated.I suggest you to try to update the information from the Microsoft People website.https:\/\/office.live.com\/start\/People.aspx?ui=en..."]},{"symptom":"RDP issue        Hi Team,Few users are unable to RDP  to the windows server 2016 and also we can't reboot the VM. I can see the user name who have connected to VM in task-manager users tab but one user name is showing 4 instead of user name. So i tried to disconnect the user (4) it doesn't disconnected and then i try to connect the user (4) and then disconnect the other user session then all the users are able to RDP. Please let me know is there are any bugs in Windows Server 2016 Remote desktop service.Thanks,Ashadeep","solutions":["Your question is out of scope in these consumer-level forums. Please ask in the Windows Server forums on Technet.https:\/\/social.technet.microsoft.com\/forums\/en-...","Thank you"]},{"symptom":"Shortcut icons missing        Hello, I installed programs on my new laptop, but the shortcut icons in the programs folder disappeared. Any way to make them display again?","solutions":["Hi, I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Go into C:\\Program Files and C:\\Program Files (86) to find the programs, in their folders locate and test the program .exe to be sure it's the one which starts the program, then copy it to the Start menu folder.If you need to Take Ownership of files or folders to do any of this, add this convenient shortcut to your right click menu to take ownership of any file or folder:https:\/\/www.askvg.com\/add-take-ownership-option.... Just don't use it on the c:\\windows folder for security reasons.Be aware that heavy modification or registry editing of the Start Menu can result in it not working properly. If you need to reset it to defaults or repair it see here:https:\/\/www.tenforums.com\/tutorials\/3087-reset-...https:\/\/www.kapilarya.com\/re-register-start-men...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I have the same question!"]},{"symptom":"Windows 10 not activating after recent Hardware Change???        I have made a recent hardware change (motherboard, cpu) and I found out you can transfer Windows 10 Digital License with your Microsoft Account. Before I physically made the hardware change I made my Microsoft Account link with my Windows 10 like told from your forums. Everything was good until now I am trying to activate windows with my new hardware. I did the troubleshoot>hardware change, but when I select my device it says \"Unable to Activate Windows\". Idk if this is a server problem of some sort or me because I know 100% sure I linked my windows 10 to this Microsoft account so I can transfer its license. On the activation setting I also get an error code: 0xC004F025 and it shows the last 5 digits of the product key. Please help, Ive been trying to fix this problem for 3 days now. Thanks!","solutions":["Hi Suzuno Is your Windows 10 licence based on an OEM licence (came pre-installed on a PC) or Retail (purchased separately to a PC)If it is a Retail licence, then it will have transfer rights to a new Motherboard or PC, if it is OEM it will not . ..Is your Windows 10 licence a retail licence? If so, that Activation troubleshooter rarely resolves this issue after a hardware change, your best option is to contact Microsoft Support and ask them to help you re-activate your Windows 10Chat - you will get the bot, keep typing 'Speak to an Agent' when prompted for what you want, that will get you through to live chathttps:\/\/partner.support.services.microsoft.com\/...Or choose a local Phone Number: https:\/\/support.microsoft.com\/en-us\/help\/13948\/..."]},{"symptom":"Moving SSD windows 10 pro to a new motherboard        Planning on upgrading CPu\/GPU\/RAM\/motherboard but I hate reinstalling everything as my current set up of installed softwares are already optimal. Any way i can move my SSD with the OS to the new motherboard without reinstalling? Windows 10 pro wasn't preinstalled, it was a windows 7 pro disc install then upgraded to windows 10 pro as this is a gaming HTPC. (8 years old now)","solutions":["Hi Used You can move that SSD to the new hardware, with your installation setup exactly as is, Windows 10 is very adaptable to new hardware . . .When you initially boot up the new setup, you should see a 'Setting Up Devices' screen and then Windows 10 should just boot to the Desktop. You will then need to manually install any device drivers that Windows 10 could not find automatically . . .The only problem you may encounter is an activation error on Windows 10. If you do get an activation error, run the Activation troubleshooter from Settings - Update and Security - Activation.If that does not resolve the error, you will need to contact Microsoft Support to get them to move your licence across to the new hardware . . .Choose a local Phone Number: https:\/\/support.microsoft.com\/en-us\/help\/13948\/...","Ok thanks. I forgot to mention that they aren in RAID 0 too. Shouldn't matter right? ","If activation is required then try your Windows 7 Pro licence key first and you may well need it for support.","Hi Used No, that should not make any difference . . ."]},{"symptom":"Windows 10 Icons Modifications for 3rd Parties Applications to Look Better        Dear Community members,Is there any procedures or possible way to modify the 3rd Parties Application Icons to look better as Native Applications.I know we can change the Icons, But it doesn't look as native applicationsFor example, I have enclosed the photograph. The First Image describes the Icons for Office 365 and the way it looks in startup.The Second image shows a third party icons and how it is represented.Is there any way that we can change it to look better?.Thank you,","solutions":[]},{"symptom":"problem with driver for wifi adaptor        I am running windows 10 Home. some days ago my wifi not connected to Internet, My Laptop is a Dell Inspiron 13 5379 2 in 1. Could anyone help me to solve the driver problem, Please?","solutions":["Hi Jacob, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Does the network troubleshooter say no drivers are available for the wifi device?https:\/\/support.microsoft.com\/en-in\/help\/403865...The link for Qualcomm WiFi driver for your device is the following: https:\/\/www.dell.com\/support\/home\/in\/en\/indhs1\/...Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","If you have access to internet (e.g. using LAN or Ethernet) then run Windows Update and install all updates.You may also visit Dell support website and look for the latest driver:http:\/\/support.dell.com\/"]},{"symptom":"HDD Not Recognized in Disk Management        Hello,2 weeks ago I received a new ASUS laptop (ASUS 15 X509FL) with no OS my decision).After installing the OS (Windows 10) via DOK I'v noticed that my HDD (st1000lm035-1rk172) is detected in the BIOS and the Device Manager but not detected in the Disk management so I cannot use it at all. So for now I can only use my SSD.What I tried to do so far:Uninstall the HDD from the device manager.Update the storge devices and storage controllers drivers.Install the OS again and from a different USB port.Update the BIOS into version 302.Ran windows memory diagnostic.And nothing helped it.I did noticed that in the BIOS the HDD is 'Non RAID Physical Disk'Is there anything I can do before sending the PC to a shop for the physical connection check?Thanks.","solutions":["Hi Tsvi, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.The troubleshooting steps you have taken is enough to troubleshoot a Windows-only issue. Hard drisk not visible despite a clean install ultimately confirms it as a hardware issue.Suggest you to get in touch of Acer support asap."]}]}