{"windows":[{"symptom":"Error Message - \"The package runtime information is corrupted\"        I get this message as in subject line whenever i try to open a jpg file. The default app to open photos is Microsoft Photos. I can open the same photos in 'Paint' though.I also notice that i have two 'Microsoft Photos' and two 'Microsoft Store' apps showing in the list of installed apps. i can't uninstall any of these! I can't open the Microsoft Store.I have uninstalled McAfee, it didn't help.System re-starts didn't help.I have run the 'sfc \/scannow' command. the result shown below for ready reference.System info in the enclosed pictures.","solutions":["Hi Rajesh Seeing as SFC found but could not fix those errors, try running this command, which should fix those errors:dism \/online \/cleanup-image \/restorehealth When that completes, restart (not shut down) your PC Then run the SFC command again Then open the Settings App and go to Apps to find the Photos App Select that, choose Advanced Options and then click Reset Then check the functionality of that App . . ."]},{"symptom":"High Definition Audio Controller - Yellow exclamation        Hello, my onboard sound doesn't function properly suddenly once my graphic driver is updated to latest version Intel® Graphics - Windows® 10 DCH Drivers 26.20.100.7584. Everything worked fine except no sound. I went into Device manager to look and see if there was a problem. There was. The High Definition Audio Controller isn't working with the following message in the status box:This device cannot start. (Code 10){Operation Failed}The requested operation was unsuccessful.I then tried the following solutions:1 - Updating the driver, but I have the latest released one.2 - Reinstalling the driver to no success.3 - When I try and Troubleshoot the problem, Troubleshooting came up saying that the device has a problem and it was unable to solve said problem4 - Downgraded the graphic card driver version to 26.20.100.7463 but not work.5 - I also tried to perform windows updates but not successful. Once installed the latest windows updates and reboot, Windows doesn't launch anymore and when i reboot by pressing the power button, Windows can resume but no latest windows updates.For your information, please find below hardware ID for your reference,PCI\\VEN_8086&DEV_A348&SUBSYS_87601043&REV_10PCI\\VEN_8086&DEV_A348&SUBSYS_87601043PCI\\VEN_8086&DEV_A348&CC_040300PCI\\VEN_8086&DEV_A348&CC_0403Compatible ID:PCI\\VEN_8086&DEV_A348&REV_10PCI\\VEN_8086&DEV_A348PCI\\VEN_8086&CC_040300PCI\\VEN_8086&CC_0403PCI\\VEN_8086PCI\\CC_040300PCI\\CC_0403Please assist. Thanks.","solutions":["Hi Wilson. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Go into Device Manager and roll back the High Def Audio Controller, then block it from being reinstalled by Windows Update:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...If the Roll Back button is not active, choose Update driver > Browse > Let Me Pick and try all previous drivers to find one that's stable and best. If another driver tries to replace it, I will show you how to remove that driver identified in Driver tab > Details pane. Check the PC, motherboard and device maker's Support Downloads web page for newer or other drivers to try. You may need to wait for a new version.If you want to report this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems.If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it. If you are an Insider I can also vote it up with my MVP badge and track the issue for you.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Wilson. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Go into Device Manager and roll back the High Def Audio Controller, then block it from being reinstalled by Windows Update:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...If the Roll Back button is not active, choose Update driver > Browse > Let Me Pick and try all previous drivers to find one that's stable and best. If another driver tries to replace it, I will show you how to remove that driver identified in Driver tab > Details pane. Check the PC, motherboard and device maker's Support Downloads web page for newer or other drivers to try. You may need to wait for a new version.If you want to report this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems.If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it. If you are an Insider I can also vote it up with my MVP badge and track the issue for you.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.Hi Greg,Thanks for your prompt reply. Unfortunately, it does not work.1) No rollback button is available.2) I tried to block it from being reinstalled by Windows Update.3) I have tried to download the drivers from Realtek (https:\/\/www.realtek.com\/en\/component\/zoo\/category\/pc-audio-codecs-high-definition-audio-codecs-software) and ASUS (https:\/\/www.asus.com\/Motherboards\/TUF-H370-PRO-GAMING\/HelpDesk_Download\/), however, none of them can remove the yellow exclamation after manually update or running the built-in exe file.4) I also tried to install Driver Easy software. The scan result shows the driver version is latest updated.Alternatively I am using the sound out from my monitor which is connected with my display card via HDMI. In the long run, I still prefer fixing this bug instead. Thanks.","You said this is the Audio driver installed by the Display driver, correct? Was it delivered by WIndows Update or did you install it from the PC or display device's Support Downloads?I'll give you all things to try with display drivers to see if that helps get a better High Def audio driver:Update the Display driver from the PC or Display adapter maker's Support Downloads web page for your exact model number, HP Serial Number or Dell Service Tag - from the sticker on the PC.While there check also for newer chipset, BIOS\/UEFI firmware (very important), network, sound, USB3 and other drivers, comparing to the ones presently installed in Device Manager reached by right clicking the Start Menu.If this doesn't give you the latest or ideal driver for what you need, compare it to the driver offered by the Intel driver update Utility here:http:\/\/www.intel.com\/content\/www\/us\/en\/support\/... or the Nvidia Update utility here: http:\/\/www.nvidia.com\/Download\/Scan.aspx?lang=e... or the AMD autodect utility here: http:\/\/support.amd.com\/us\/gpudownload\/windows\/P... For Display issues one fix that is working is to Roll back or Uninstall the Driver on the Display Device > Driver tab, restart PC to reinstall driver.You can also try older drivers in Device Manager > Display device > Driver tab > Update Driver > Browse > Let Me Pick.Then you will know you've tried everything in addition to Windows Update drivers.","Hi Greg,The problem is at my High Definition Audio Controller with Yellow exclamation and no sound come out from my onboard sound port. Everything began when the Intel driver and support suggested me to upgrade Intel UHD graphic driver.My computer is customized, not Dell or HP model. Specification can be found below,Operating System: Win10 Pro (64-bit)Memory: 64GBCPU: i7-8700@3.20GHzMotherboard: ASUS - TUF H370-PRO GAMING (Audio chipset is Realtek ALC887)Video card: Radeon RX 570Dual monitors: DELL U2717D x 2Drivers information is shown as below,Onboard Graphic: Intel UHD Graphics 630: 26.20.100.7584 which is released on 16 Dec 2019Audio: AMD High Definition Audio Device: 10.0.1.12 I downgraded the video drivers from 26.20.100.7584 to 26.20.100.7463 which is released on 11 Jun 2019. It doesn't fix the issue.Chipset, firmware driver from ASUS website are downloaded and updated as well, not working.Regarding BIOS, I don't know how to enter BIOS when i reboot my computer. [DEL], [F1], [F2], [F12] buttons have been tried but i cannot enter.The status remains unchanged.","Power on while pressing the F8 button to enter UEFI Setup. From my previous post try running the auto scans from both Intel and AMD, and installing the drivers manually from both sites.Do the step for trying all previously installed drivers, which survive Version Updates.","Hi Greg,I did try [F1], [F2], [F5], [F8], [DEL] to enter BIOS but no luck. I didn't see the motherboard LOGO when i reboot my computer and the first screen is Windows login.I also tried INTEL driver update utility, it does not state the driver for High Definition Audio Controller, but only for AMD High Definition Audio Device which is with latest driver version without issue.Regarding AMD autodect utility, the download of the utility stops at 37% and i tried twice and stop at the same stage, therefore, i give up.Although i cannot fix this High Definition Audio Controller error at this moment, i can use the audio out from my monitor which connected via HDMI at this moment.Anyway, i appreciate your support and thanks for your help. Happy New Year!Regards,Wilson"]},{"symptom":"Windows 10 File Manager - Need To Sort Alphabetically But Not Group Files And Folders Separately        The file manager has always grouped folders separately from the files. If you sort by Name > Ascending, folders are always grouped together and then sorted alphabetically and then repeats this for any files, but the two never mix.You end up with: Folder A, Folder B, Folder C followed by File A, File B, File C.Is there a way to sort alphabetically without them grouping so that you end up with:File A, Folder A, File B, Folder B, ect.","solutions":["Hi Chris unfortunately this is the way windows file explorer works, you would need third party software to sort it the way you describe.you can make the suggestion to the windows development team by using the feedback hub (winkey+F), if enough people want it microsoft may consider adding the feature in a future release.","Is there a way to sort alphabetically without them grouping so that you end up with:File A, Folder A, File B, Folder B, ect.You would need to move the folders elsewhere (or hide them), then create shortcuts to them."]},{"symptom":"Windows 10 Version 1909 - Cannot type into File Explorer search box        Hi all,I have an HP 15-DW0046NR laptop with Intel 8265U processor and 8GB RAM. Windows version is Windows 10 x64 Enterprise, Version 1909 OS Build 10.0.18363.535 (Nov 2019 Update).The problem is that since I received the update the other day the search box is \"dead\". By that I mean that you can attempt to click inside it but no cursor appears when you do and typing does nothing.A \"fix\" (which is not a fix because the problem comes right back) is to open Task Manager, find the process named \"Windows Explorer\", right-click it and select \"Restart\". The search box will now work as expected for only for a random amount of time. Maybe 10 seconds, maybe 10 minutes.My work is seriously affected by this. Quickly searching for and finding the files I need are part of my normal workflow and this search box problem makes that impossible. What results is opening files one by one until I find the one I need. And that's only possible if I know what folder it's in, which is not always possible.I've resorted to using the 30-day trial version of Directory Opus, which has so many features that it has a little bit of a learning curve. Hopefully Microsoft will issue a fix for this problem in less than 30 days because I don't intend to pay $49 US to be able to search for files.With all that said, has anyone found a fix for this? I searched but all the results I get are people complaining about the problem and posting the same \"fix\" I found, which is restarting the Windows Explorer process. (Note: Most posts mention using taskkill.exe to kill the process then restart it. That's not necessary. Just use the method I described to restart it. Much easier.)","solutions":["Post this in Feedback.  win key+f","Hi Old_Computer_Guy My name is Jon and I am an independent technical adviser. I'd like to help you resolve your issue.Can you see if there is a process called ctfmon.exe running? If not try starting it manually by searching for ctfmon.exe in Cortana search and clicking on it.Hope this helps. Jon.","\"File Explorer is a tool in Windows 10 that allows you to browse the files and folders on your hard drive, and it comes with a search box that is supposed to let you quickly and easily find files within drives and folders. Unfortunately, Microsoft saw fit to tinker with the search box in the Windows 10 November 2019 Update by adding the ability to search your online OneDrive cloud storage as well as your local files.As well as adding this function, the update broke the search bar, as a number of users are complaining that using search makes the window become unresponsive for a while. Users are also unable to right-click and paste text into the search bar with a mouse.\"Source: https:\/\/www.techradar.com\/news\/windows-10-file-explorer-is-still-broken-but-microsoft-is-promising-to-fix-it","The website https:\/\/www.tenforums.com  suggests  a solutionFar from ideal But works!! (W10 version 1909 is the cause..)Just Google: 1909 \"file explorer\"  You 'll see that you are not alone..Microsoft sites (& others) are pathetic with regard to the above!!Good luck","Ok, I see now that Microsoft was aware of the problem before the Fall 2019 update (1909) was released. (!)This problem was present when the update was released in the Slow Ring of the Windows Insider program. They did NOT fix it and allowed it to continued into the Fall 2019 update, months later.However, they have promised a fix. Look for it sometime in 2020. Sometime in 2020.For the low, low price of at least $199.99 to buy the privilege of \"renting\" Windows 10, one would expecta faster approach to a serious problem. Apparently, as mrBillyy mentioned, the problem was introduced unintentionally when Microsoft decided \"Wouldn't it be great if Windows Search searched our online storage, OneDrive, from File Explorer?\"Well, it was great indeed except for two facts: A lot of people don't trust Microsoft tonot go through your OneDrive files with the intention of mining data to \"provide you with a better user experience\" (which actually means \"more precisely targeted advertisement\") thus don't use it for \"cloud\" storage (just regular online file storage servers, nothing more) , and two, it broke a critical feature in a part of File Explorer which users utilize to accomplish trivial things such as...oh, I don't know...finding files.So thank you Microsoft Software Engineers for one, breaking it and two, not fixing it.","Hi JonBland,The process that controls the Alternative User Input and the Office Language bar? Wasn't running, I started it and nothing happened. Then again, I'm not searching using an alternative method such as speech or pen. Just the old-school typing into the search bar of File Explorer. Or NOT typing into the search bar of File Explorer, as is the case here.Additionally, I do not use Office products. It's all LibreOffice for me.","HelloI had  the same problem, couldnt type in the search box of Explorer.\"Askvg\" explains the problem and give a very easy solution. Just press the ESC key when the search box is blocked. No need to restart Explorer. https:\/\/www.askvg.com\/bug-fix-search-box-in-windows-10-file-explorer-stuck-or-not-responding\/#comment-2752005Regards","Same issue.  Sometimes restarting fixes it for a while, but it will eventually happen again.  None of the so-called \"fixes\" have worked.  I have tried sfc and dism, pressing 'esc', restarting explorer, restarting the computer, it always comes back.  Microsoft needs to hurry up and fix this."]},{"symptom":"resetting computer to factory settings        I am going to be returning a laptop I bought and want to reset it to factory settings. I know how to do that but is the laptop going to want me to set up an account again once it's done it's reset? I don't want to have to do that because I want the computer to be clean when I return it.","solutions":["Hi asheryl Initiate the Windows Reset, choosing to keep nothing When that reaches the end of the reset, you will reach the OOBE (Out of Box Experience) where you are asked to input a new user profileYour best option at that point is to press and hold the Power button on the laptop for 5 - 10 seconds to perform a hard shut downThen, when that is returned, when they start up the laptop, it sill initiate the OOBE again . . .","Thank you for the quick reply. Sounds easy enough."]},{"symptom":"Windows 7 Pro & uTorrent Client        Hello all,I have Windows 7 Professional on my laptop and it seems that it will not install a uTorrent client. Has anyone else had this problem? If you did, were you able to solve it?Thanks just for reading this post!","solutions":[]},{"symptom":"Problem updating firmware for display adaptor        I am having the following problem updating the MS Display Adaptor (3.4.137.1000) firmware from 2.0.8372 to 2.0.8384 using a Lenovo MIIX510.When the update process starts the laptop screen goes black and the connection to the DA is lost.I have tried restarting the DA from the app, unplugging\/replugging it at the TV, and pressing the DA reset button, all without success.Any ideas please?Can the DA firmware be updated by wired connection directly to the laptop?","solutions":[]},{"symptom":"Importing Photos        When I go onto my laptop to try and import photos from my phone my laptop can only find 400 out of the 9,000 photos I have.  How can I import all 9,000 photos onto my laptop. ","solutions":["Hi Louisa, When all else fails, the manual approach is your best option to transfer the files, the built in Photos App can be a bit unreliable, and you will have more control over the files are transferred . . .Open Windows Fie Explorer (folder icon on your Taskbar) On the left click 'This PC' On the right double click your phone or the DCIM folder (whichever shows up) Then simple select the files you want to transfer and drag them into the Pictures folder in the left pane of File ExplorerThat's it!"]},{"symptom":"my card reader doesn't read my SD cards anymore        My Lenovo Flex 5 is not reading my SD cards anymore. When I insert them the computer shows no action at all. I know the problem isn't the SD cards because they work in other devices. I looked under devices and printers but my drive doesn't show up. If I don't get help I'm going to put this thing out in the yard and shoot it to shreds with my gun!","solutions":["Hi Joshua. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See here for SD card not working: https:\/\/www.thewindowsclub.com\/sd-card-readed-n...https:\/\/www.gihosoft.com\/windows-tips\/sd-card-n...Right click Start button to open Device Manager, find the SD card reader, open and choose Driver tab, try Roll back. If not available try Uninstall, restart PC to reinstall Driver.Next right click Start to open Disk Management, find SD card on map at bottom, right click to assign a drive letter.If nothing else helps see if you can get it recognized on another PC to save the files, then reformat in the problem PC:https:\/\/www.lifewire.com\/format-sd-card-using-w... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","So, I tried to but I couldn't find the SD card reader in the device manager"]},{"symptom":"FSX flight simulator        Can anyone help us with our Microsoft flight simulator X please? our computer completely shuts down after about 15 minutes flying time even when graphics are turned down low.","solutions":["Hi Janet,Happy New Year to you, though not off to a good start with your FSX problem.So I assume that after 15 minutes flying it is the computer that shuts down (and reboots?) or does FSX first shut down and then the computer?   Is this the first time this has happened?   Are you using a laptop or desktop computer?   And graphics card type?Probably, I would first check to see if any error message has been recorded for this shutdown event.   For this, go to your Event Viewer (type in Event Viewer in your Cortana Search box and click on it).   When it opens, click on Custom Views > Admin Events:  this window will take a little time to populate.   Scroll down to the date and time that the crash occurred and click on that Item.   I would be interested to see details recorded there (usually the top part of the report beginning with Faulting.......).   You could copy and paste it into your response here.Chris","Hi!A solution is that you skipped validating the Acceleration Pack along a installation course! In that case, FSX limitates the game time to about that durationIf that, the solution is easy (from my personal website about flightsim with the FS series of Microsoft):'The registration of the FSX firstly installed does not pose troubles, generally as the one of the Acceleration Pack does. Once installed and launching back FSX you may get a 1-80004005 error, which will limit the use of your FSX at 30 minute of time. The solution, which is widely given on the Internet, resides into a faulty entry of the Windows Registry. To fix that, run 'regedit' from Cortana and launch that utility. It will show you the registry content. CAUTION, THAT CONTAINS SENSITIVE DATA! DO NOT CHANGE ANYTHING EXCEPT WHAT FOLLOWS! Expand HKEY_LOCAL_MACHINE\\SYSTEM\\CURRENTCONTROLSET\\CONTROL\\CLASS\\{4D36E967-E325-11CE-BFC1-08002BE10318}. In the left column, double-click the UpperFilters entry (note! there may be there several {4D36E967-E325-11CE-BFC1-08002BE10318} entries; just find the one which holds UpperFilters). Thence three possibilities: either you will just read 'partmgr,' and just change that into 'PartMgr' -- with capitals -- and exit the registry by clicking to the upper right as registry automatically saves. Either you will find a '0' value; change it too to 'PartMgr' and idem. Or, at last, you may find other values of which 'partmgr'; some advice to first backup tall those, then erase everything except 'partmgr' (you will turn to 'PartMgr'; exit idem, and once the registration performed, you may paste the backup back). In all cases, once the Registry entry fixed, restart your PC and then launch FSX. The registration panel will pop up!'"]},{"symptom":"Windows is asking me to activate?        Hello, yesterday I got a brand new motherboard, cpu, and decided to start all over so Windows could be on an SSD. I already had the usb boot for it so once it was good to go I downloaded Windows and it didn't show anything for a day so I thought it was good. But I woke up this morning, turned it on, and had the Activate Windows in the bottom right. I went to the activate in settings, and clicked that I changed hardware on this device recently. Then it said that it could not find Windows. I am signed into the same Microsoft account as I was on my PC before I started on my SSD.","solutions":["Hi JackJediPlays Is your Windows 10 licence based on an OEM licence (came pre-installed on a PC) or Retail (purchased separately to a PC)If it is a Retail licence, then it will have transfer rights to a new Motherboard or PC, if it is OEM it will not . ..Is your Windows 10 licence a retail licence, or is it an upgrade from a previous Windows 10 licence, that was retail?","It is a retail licence","Hi JackJediPlays A lot of users are experiencing this same problem after swapping out a motherboard, and the Activation Troubleshooter does not resolve this a lot of the time, your best option is to contact Microsoft Support and ask them to help you re-activate your Windows 10 Choose a local Phone Number: https:\/\/support.microsoft.com\/en-us\/help\/13948\/..."]},{"symptom":"I lost my administrator rights on every thing        I am the only one user on my laptop and it states me as administrator in account settings but when i try to run any software as administrator or click on any option which requires administrator permission to access, it says\"Windows cannot access the specified device path, or file.You may not have the appropriate permission to access the item.\"","solutions":["I am the only one user on my laptop and it states me as administrator in account settings.Having a single admin account is as risky as having a single car key. Sooner or later it will cause you a big problem, perhaps right now. What do you see underLocal Group Memberships when you do this:Mark the code line below and press Ctrl+C to copy it.Press the Windows key+RPress Ctrl+V to paste the code line and press Enter.cmd  \/c  net  user  \"%UserName%\" & pause","I see thisLocal Group Memberships      *Administrators       *UsersGlobal Group memberships     *None","Hi Anish My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Method 1: Gain the Permission of the File or Folder Now that the error suggests that \"you may not have the appropriate permissions to access the item\", you should first check if you have the permission of the file or folder. To gain permission to access a file or a location, do as follows.Step 1: Right-click the file or folder and select \"Properties\". Step 2: Under Group or User names, click your name to see the permissions you have.Step 3: Select \"Edit\", where you can have permissions like full control, modify, read & execute, read, write or special permissions. Choose the permissions you need and click \"OK\".Method 2: Check the File Location You may also get this error if the shortcut or installation is attempting to access a location that is not currently available such as a networked or a removable drive. Check the path of the file and make sure that the location is accessible.Step 1: Right-click on the file or folder and select Properties. Step 2: Under the General tab, check the Location, make sure that the file path is correct and accessible.Method 3: Disable Antivirus and Unlock the File\/Folder What antivirus software are you using? You can check to see if your antivirus software is blocking a file by temporarily disabling it, and then trying to open the file. Then unlock the file. In some cases, the file may be blocked by Windows. You can check the properties of a file to see if it is blocked. Right-click the blocked file and then select \"Properties\". In the General tab, select \"Unblock\" if the option is available. Hope this helps.","Can you open a Command Prompt (Admin) or PowerShell (Admin) if you can then run a system file scan and restart.Method 1: Run DISM tool and check the issue. Please follow these steps:a. Press Windows + X keys and click command prompt (admin). Or PowerShell (Admin).b. Type the following command in command prompt and press Enter.DISM.exe \/Online \/Cleanup-image \/Scanhealthafter the scan is complete type the following and press EnterDISM.exe \/Online \/Cleanup-image \/Restorehealththen use method 2.Method 2: System file checker is a utility in Windows that allows users to scan for corruptions in Windows system files and restore corrupted files.Run system file checker (SFC) and see if it helps. Please follow these steps:a. Press Windows + X keys and click command prompt (admin). Or PowerShell (Admin).b. Type the following command in command prompt and press Enter.sfc \/scannowAfter completing the scans restart using Start > Power > Restart.If you can't open a command line then you should consider a repair install.http:\/\/www.tenforums.com\/tutorials\/16397-repair-install-windows-10-place-upgrade.htmlDepending on you current version of Windows 10. Check by typing winver in Search and selecting the top result. What is the full version and build numbers.","This looks good. Now what happens when you do this:Create a desktop shortcut for cmd.exe.Right-click this shortcut, then left-click \"Run as administrator\".Accept the challenge. You will should a black frame.","Hello,See if this fix helps you:https:\/\/www.kapilarya.com\/fix-lost-administrative-rights-in-windows-10Let us know if this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP. ","While using this method I couldn't access c:\\ drive(where my windows is installed) while loading hive. Please help.  ","While running the shortcut of cmd.exe as administrator it says\"Windows cannot access the specified device, path or file. You may not have the appropriate permission to access the item.\"","While running the shortcut of cmd.exe as administrator it says\"Windows cannot access the specified device, path or file. You may not have the appropriate permission to access the item.\"Did you attempt to change certain folder access permissions? If so, which ones, an d why?","No just bought this laptop 20 days ago, installed some software and games only. Didn't changed any access permission of any folder."]},{"symptom":"s mode        this s mode is annoying I cant download anything not even chrome and ive tried every solution but it wont work. this is what I get when I try to switch out of it","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Did you PC come pre-installed with Windows 10 or did you purchase a key from somewhere. It appears that the installation you are running does not have a valid license.Regards, Ross","it came with the computer","Have you changed any hardware on the computer recently such as hard drive, motherboard, etc?","nope I just got this computer yesterday ","Can you check your activation status using the steps in this article and post the results:https:\/\/support.microsoft.com\/en-us\/help\/12440\/...Thanks, Ross","btw thanks for the fast help","No problem at all, see step 4 on this article. If this is just a new computer it sounds like a manufacturer fault.https:\/\/support.microsoft.com\/en-gb\/help\/433979...Try that, if that doesn’t help unfortunately you would need to contact the manufacturer support service so they can resolve.Regards,Ross","Thanks Ross so much. THX","Happy to help. Regards, Ross"]},{"symptom":"application to show the size of each type like in macOS        Is there a built-in application from Microsoft or an open source shows me the consumed size of the hard drive and what is type of like movies, documents......etcthis feature is exist in macOS","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.I would recommend using this free software, it gives a detailed breakdown of what is using your disk space:https:\/\/windirstat.net\/ Regards, Ross","Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Laggy after update to latest version        Why am I the only one experiencing a lag in my laptop here and there after i updated the latest software? I know it was supposed to be smoother but for my case it didn't. When I tried to use any of the Microsoft Office like Word Docu, Powerpoint, it ended up lagging. I tried to scroll up and down the pages\/slides, it took a quiet some time to get to the page that I want or even when I wanted to type a sentence, the words came out so slow like it's in early 2000s. I tried to reset my laptop but still no sign of improvement literally all my files gone but luckily i did saved on my hard drive. I bought this laptop around May 2018. Please help me.","solutions":["Hello AimanRahman, I am Andrew an independent advisor. Could you press CTRL+ALT+DEL on your keyboard and open the task manager. In the open programs and process tab look for some high usage in memory and CPU. If possible take a screenshot and post back what it is. Often the Windows process \"super fetch\" will consume a lot of resources. Look for this and lets us know what you find.Take Care :)"]},{"symptom":"candy crush game        Wont connect to game,Says lash player is not enabled.","solutions":[]},{"symptom":"KMSPICO        i am having a free dos laptop i was using non activated windows on it but my friend activated it using KMSPICO and now when i reinstated windows its showing windows activated by digital license but i think this activation is causing problems so how can i get that digital license remove ","solutions":["Hi Rastogisahab007 Do you mean you reinstalled Windows 10 by booting form a USB drive to remove the KMSPico activation and when that was done, Windows self activated again?Click your Start Button, type cmd then right click Command Prompt and choose 'Run as Administrator'Run or paste this command and hit Enter: slmgr.vbs \/dlv Please post a screenshot of the resulting dialog . . .","i am having a free dos laptop i was using non activated windows on it but my friend activated it using KMSPICOand now when i reinstated windows its showing windows activated by digital license but i think this activation is causing problems so how can i get that digital license remove You never had an activated Windows 10 operating system installed on your laptop.Your friend then used a Key Activator to pirate the Windows 10 operating system.Buy a legal Windows 10 license.","tried this one also but when I connect to internet it got activated again.","Hi Rastogisahab007 Click your Start Button, type cmd then right click Command Prompt and choose 'Run as Administrator'Run or paste this command and hit Enter: slmgr.vbs \/dlv Please post a screenshot of the resulting dialog . . ."]},{"symptom":"Resizing Items on the Desktop        I am using Windows 10.Just got a new Desktop with a 27\" monitor.  I thought the larger monitor would give me more space.  It did not.  Everything is just bigger!How can I resize things on my Desktop so that I can fit more Windows, icons, etc.?I tried Display settings but it only allows me to make Fonts BIGGER!  I would like Icons and Fonts to appear smaller.I work with  multiple items open and would like to have many on the Desktop at one time.  Yes, I know I can resize the Window but the Icons don't get smaller!Any ideas?","solutions":["Please do this:Start button > Settings app > System > Display > Display resolutionClick on the downward pointing arrow to open this 'dropdown box' and choose the resolution that is 'Recommended.'","Hi James check the native resolution of that monitor, then right click your desktop and make sure that is the resolution you have set. Also make sure scale is set to 100% on that monitor...","Already did that. What I have is the smallest available. Everything after that only makes the screen larger!","If that momitor is set to the recommended resolution you can set that to a higher resolution to make things smaller, however don't set that too high or you may put that out of the acceptable values","All listed resolutions are lower and make everything larger.","Hi JamesBolster, My name is Riccardo and I'd be happy to assist... Are you able to send a screenshot of what you are seeing? Also what is the brand of your 27\" monitor?I will help you troubleshoot this.","Fixed it!","Awesome! What did you do?"]},{"symptom":"File history in Windows 10 on C drive        As we know that we need to hook up an external drive to use file history, but I am wondering if we can configure file history on the same hard drive or different partition on the same physical drive. ","solutions":["File History in Windows 10 is a per user option. Each user must enable File History to maintain a backup of all the files in their libraries"]},{"symptom":"During upgrade to win10 used hard disk as the flash boot and 20 years of all my family movies and photos lost forever. Microsoft team, Please put a warning so it will not happen again.        You guys there, be aware, there is no warning that it will format the usb device.20 years of information deleted in seconds.Still can't forgive myself not uploading all information to a cloud.","solutions":["You guys there, be aware, there is no warning that it will format the usb device.20 years of information deleted in seconds.Still can't forgive myself not uploading all information to a cloud.Two points:If you were able to run your PC for 20 years without any backup to an independent medium then you were very, very lucky. Important data must at all times be stored on at least two independent media.The warning you mention was there all along:"]}]}