{"windows":[{"symptom":"Compatibility mode test does nothing        Hi, i have a brand new laptop with Windows 10 as i cannot update mine from windows 7 and have several problems: Random apps (UTOMIK) have appeared out of nowhere that i cannot uninstall (no option on right click, not showing in the list of apps or in add\/remove programs etc), There are services that are still running constantly despite having uninstalled the apps they belong to and i am \"not allowed\" to disable them and, worst of all, i cannot run the programs that i had on my old laptop. When i try to install or run programs that worked perfectly in 7 it displays \"this app is not compatible with this PC\". Running the compatibility mode tester finds the programs compatible with 7, 8 etc and asks me to click the \"test\" button to see if the program will work but, when i click \"test\" absolutely nothing ever happens, when i then try to run it in compatibility mode i get \"This app is not compatible..... \" again.I have put this in the Install & upgrade topic as there does not seem to be a compatibility or issues with running programs section.","solutions":[]},{"symptom":"Isn't there anywhere to get DRM key and unlock DRM protected files anymore???        I have some .wma files that I had ripped 12 years back that are DRM protected. I'm on a newer system now without any DRM licenses so I'm unable to play them. When I do try to play them with Windows Media Player, the browser opens up, and instead of it directing me to the Microsoft DRM key download, it redirects to the Microsoft home page. I've tried countless times searching and searching on Google and haven't found anything. Any link provided is a 404. Any ideas at all???","solutions":[]},{"symptom":"Windows Installation Is A Joke        Hard drive crash. Bought a new one. I have gone so far as to attempt to install Windows 95, Windows XP, Windows 7 and Windows 10. None of them will go all the way through. Several attempts, each taking 4 to 12 hours to go through, only to find someone stating that you need to press this key or that one, install in safe mode, yada yada yada. There is no where I can find of the ACTUAL instructions to follow. For example I read that I need to install in safe mode and to press <F8> key to choose safe mode. That key will NOT work in several attempts. I later read that you need to press <F4> to get to the advanced boot options and then press <F8>. I got this to finally work in installing Windows 7 once. The install later crapped out on me for a different reason. This <F8> will NOT work in Windows 10 at all. Also when pressing the <F8> key the display comes up to press ANY key to boot from CD\/DVD and this makes the <F8> \/ <F4> keys not work.After waiting for 6+ hours in a Windows 7 install in one attempt I got to entering the product key and it just sat there for hours. I later found ANOTHER web page that stated to not enter the key, but do it later. So, I spent another day and a half getting back to that point, only to have it stop at a different spot. Now it just sits there and states that windows in starting, or just a blank black screen. There is not enough paper on the planet to keep track of all the steps, different keys and spots where the screen goes blank or the system just sits there.Why is there so MANY programs that install so easy and yet Microsoft cannot manage to have an installation program actually install the software. I have stripped the PC of everything, removing cards, trying safe mode, blah blah blah.......Is there a single set of instructions that actually work?As a programmer of 30 years I could never create software as lousy as this. Does Microsoft have any decent programmers, or are they paid to create garbage?","solutions":["Hard drive crash. Bought a new one. I have gone so far as to attempt to install Windows 95, Windows XP, Windows 7 and Windows 10. None of them will go all the way through. Several attempts, each taking 4 to 12 hours to go through, only to find someone stating that you need to press this key or that one, install in safe mode, yada yada yada. There is no where I can find of the ACTUAL instructions to follow. For example I read that I need to install in safe mode and to press <F8> key to choose safe mode. That key will NOT work in several attempts. I later read that you need to press <F4> to get to the advanced boot options and then press <F8>. I got this to finally work in installing Windows 7 once. The install later crapped out on me for a different reason. This <F8> will NOT work in Windows 10 at all. Also when pressing the <F8> key the display comes up to press ANY key to boot from CD\/DVD and this makes the <F8> \/ <F4> keys not work.After waiting for 6+ hours in a Windows 7 install in one attempt I got to entering the product key and it just sat there for hours. I later found ANOTHER web page that stated to not enter the key, but do it later. So, I spent another day and a half getting back to that point, only to have it stop at a different spot. Now it just sits there and states that windows in starting, or just a blank black screen. There is not enough paper on the planet to keep track of all the steps, different keys and spots where the screen goes blank or the system just sits there.Why is there so MANY programs that install so easy and yet Microsoft cannot manage to have an installation program actually install the software. I have stripped the PC of everything, removing cards, trying safe mode, blah blah blah.......Is there a single set of instructions that actually work?As a programmer of 30 years I could never create software as lousy as this. Does Microsoft have any decent programmers, or are they paid to create garbage?We don't work for Microsoft, so skip the rants hereI don't know where you are getting your instructions from but you don't install an operating system in safe mode1. You make USB Bootable Media after downloading the OS ISO, or make a Bootable DVD.2. Change the Boot Order to make the USB or DVD drive first in the Boot Order.3. Clean install the operating system.4. And before you do any of that check to see if your system hardware is compatible for whatever OS you are installing5. These are Windows 7 forums.6. After you BUY the license to use an operating system and if you lose the disk that comes with a legal package, as you should buy the complete sealed package of license\/DVD:Windows 7Download the correct ISO file and make your own disk and use the Product Key that is on the COA Sticker. This is on a first come, first served weekly basis.https:\/\/www.heidoc.net\/joomla\/technology-science\/microsoft\/67-microsoft-windows-and-office-iso-download-toolDownload: Windows ISO Downloader.exeAnd here are instructions on how to burn ISO images to disk:http:\/\/www.snapfiles.com\/get\/ISORecorder.htmlYou change the Boot Order in the BIOS to be able to boot from your installation media:How to Boot Your Computer From a Disc or USB DriveHow to access Boot Menu:https:\/\/neosmart.net\/wiki\/boot-usb-drive\/Then do a clean install:http:\/\/www.sevenforums.com\/tutorials\/1649-clean-install-windows-7-a.html@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Windows 8.1\"Create installation media for Windows 8.1\"http:\/\/windows.microsoft.com\/en-us\/windows-8\/create-reset-refresh-media\"Download Windows 8.1\"https:\/\/www.microsoft.com\/en-us\/software-download\/windows8A similar Tutorial which may also assist you\"Create Installation Media for Windows 8.1\"http:\/\/winsupersite.com\/windows-8\/create-installation-media-windows-81In the first screen of this very simple wizard, you need to choose the following:Language. English – en-us if you're in the United States.Edition. Windows 8.1 (Core), Windows 8.1 N, Windows 8.1 Pro, Windows 8.1 Pro N, or Windows 8.1 Single Language.Architecture. 64-bit (x64 ) or 32-bit (x86)._______________________________________\"How to Create a Bootable USB or DVD with a Windows 8 or 8.1 ISO\"http:\/\/www.eightforums.com\/tutorials\/2227-create-bootable-usb-dvd-windows-8-iso.html   WarningThis will not work to install Windows 8 or 8.1 for UEFI. For that, see this tutorial below instead.UEFI Bootable USB Flash Drive - Create in Windows_____________________________________To access BIOS\/UEFI - UEFI\/EFI configuration:https:\/\/neosmart.net\/wiki\/boot-usb-drive\/_____________________________________How to clean install:\"How to Do a Clean Install of Windows 8 or Windows 8.1\"http:\/\/www.eightforums.com\/tutorials\/2299-clean-install-windows-8-a.html@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Windows 10.Use the Windows 10 media creation tool on the Software download page \"Start fresh with a clean installation of Windows 10\"https:\/\/www.microsoft.com\/en-us\/software-download\/windows10startfreshReinstall Windows 10:https:\/\/support.microsoft.com\/en-us\/help\/4000735\/windows-10-reinstall\"How to Clean Install Windows 10\"http:\/\/www.tenforums.com\/tutorials\/1950-windows-10-clean-install.html_______________________________________________How to Create Bootable USB Flash Drive to Install Windows 10 fromThis tutorial will show you how to create a bootable USB flash drive that can be used to installWindows 10 with or without UEFI.________________________________________________To access BIOS\/UEFI - UEFI\/EFI configuration:https:\/\/neosmart.net\/wiki\/boot-usb-drive\/_____________________________________","In many of the attempts to install.1. Made a DVD from Microsoft for Windows 7, also bought one for Windows 10 just in case.2. Made a USB flash drive with Windows on it.3. Originally purchased PC and installed Windows XP. Upgraded with a full install disc for Windows 7 Pro. I finally found the original disc with the product key in the case. I throw away nothing. This has been running fine for several years. Many upgrades. Switched to a better video card years ago. Purchased a lot of games and upgraded software like Visual Studio and Microsoft Office. Some software has gone through multiple version upgrades. So, the system is good for all those games, and the OS for several years.4. I do not care if you do not work for Microsoft. I am angry and have a 1st Amendment right to express my frustration. I have spent several days reading posts and attempting to find out if the person writing knows what they are saying or not. This is impossible on the Internet. I read about people installing in safe mode and tried it. I do not work for Microsoft, so I did not know if it was the right thing to do or not. So, I ranted. What's your point? I am trying to deal with the excessive amount of time waiting for responses. I had to wait for 15 minutes trying to click on a box to accept the terms. It occasionally scrolled down, but then would pause and do nothing. Walked away, came back to see the box was finally checked. So, I pressed the NEXT button and had to wait yet again. This happens in every version of Windows I have tried.5. Thank you very much for the set of web pages for instructions. I am bookmarking them. Thank you. I might even print them out in case I do not also have my laptop running at the same time. Again. Thank you for your response. I will ponder over all these things and hopefully be patient with the install. Having a memory issue (brain not the PC) I do not even remember which OS I am currently trying.Thank you for your help. Please forgive my ranting. I am upset with my failures to do what I used to do so easily. I have not only installed software, I have built PCs from scratch. I also wrote programs for many companies to include writing software for the V-22 Osprey vertical takeoff aircraft. So, I am frustrated immensely for not doing this right.I know it is not your fault. I am sorry for causing you any pain. Thank you again for the help.","Good luck with it. As you are going to do, just work your way though the information I gave you.Cheers."]},{"symptom":"Can't Switch From S Mode        Recently got the GeoFlex 11 hybrid tablet\/laptop and have been setting it up today. Wanted to install a program and was asked to switch from S Mode to Windows 10 home. Tried to do that and received the message 'Try Again Later, Something happened at our end'I have already been through the Microsoft forums and tried every fix available that I have found online.Other info:My device is totally up to date with all new updates been doneI've restarted multiple timesI have checked my activation, and it says my device is windows activatedInternet connection is fineI have turned off my virus protection (one of the fixes said to try this)I have installed no other software or apps on the PC. It is completely as new from box to set up.I am also unable to download Netflix and Spotify directly from the Microsoft store. When trying to download these apps I receive the error message code 'Code: 0x87E10BCF' which comes up after the app starts looking to 'acquire licence'The following update is also not installing due to error: Windows Malicious Software Removal Tool x64 - December 2019 (KB890830) -Error 0x800711c7.Some of the other issues may not be relevant but I wanted to include them incase it helps someone to identify the issue for me.","solutions":["Hi Faebon 1 Click your Start Button, type winver and hit Enter On the resulting dialog, what Version No. and build No. of Windows 10 are you running?2 Open the Store App Click the 3 dots at the top right of the Store App and choose Settings Scroll to the bottom of that page, what is the exact version No. of your Store App?","Hi Faebon 1 Click your Start Button, type winver and hit Enter On the resulting dialog, what Version No. and build No. of Windows 10 are you running?2 Open the Store App Click the 3 dots at the top right of the Store App and choose Settings Scroll to the bottom of that page, what is the exact version No. of your Store App?Hello,Version No. And Build No. Is: Version 1909 (OS Build 18363.535)Microsoft store version number is: Version 11912.1001.1.0Thanks!","Hi Faebon, You might want to check this thread in regards to the suggested step to fix this issue.https:\/\/answers.microsoft.com\/en-us\/Surface\/for...Please let us know if this will work. Thanks and regards,","Hi,Unfortunately I have tried this and it did not work. My Microsoft store is fully updated. There's also other people still having this same issue as myself as recent as 2 weeks ago replying to that thread you linked through so it still seems to be an ongoing problem for many.","Hi Faebon, Yes, you are correct. In this case, we need to further check this out and I'll make sure you'll be updated in regards to this.We do apologize for the inconvenience as well. You have a good day Thanks and regards,"]},{"symptom":"Upgrading Windows Server 2008R2 to newer version        Please give advise to upgrade.Would like to talk to someone in Microsoft support whoknows the required hardware, ram etc. to be able to upgrade.Thanks, Penny","solutions":["Hi Penny I am sorry, Community is just a consumer forum, due to the scope of your question (Windows Server 2008+) can you please post this question to our sister forum on TechNet in the Windows Server section (linked below)Over there you will have access to a host of Windows Server experts and will get a knowledgeable and quick answer to this question . ..https:\/\/social.technet.microsoft.com\/Forums\/Win...","Do NOT reply to that scammer Russell Watson22  claiming to be from Microsoft Support.They have been banned.@@@@@@@@@@@@@@@@@@@@@@@@@Your question is beyond the scope of these ForumsThis Community is mainly for home users and their computer problems, not business systems.Kindly post your question in the TechNet Server Forums.http:\/\/social.technet.microsoft.com\/Forums\/windowsserver\/en-US\/home?category=windowsserverTechNet Forums: https:\/\/social.technet.microsoft.com\/Forums\/en-US\/homeMSDN Forums:https:\/\/social.msdn.microsoft.com\/Forums\/en-US\/homeCheers."]},{"symptom":"Problem in the Microsoft Store with the download of the app. Error code 0x80073D0D        Hi everyone, today i was downloading Realtek Audio Control application from the Microsoft Store when suddenly it told me \"There was an unexpected error\" with this error code 0x80073D0D.Someone know how i can resolve this problem?? Thanks in advance.","solutions":["Hi, MatteoArdau My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I already contact microsoft support without solving anything...","Thank you so much for your help, but...I tried all the procedures and I was unable to solve anything","I recommend that you repair Windows completely before you must make a backup of your personal files, third-party software will be removed. Here the link to download the Windows ISO.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Permanent Automatic Repair loop?        it says i have no administrator accounts on the pc, so it doesnt let me use command prompt. is there a way for me to retrieve the hard drive data without booting at all?","solutions":["You can pull the Hard Drive and put it in a USB Hard Drive Enclosure > plug it into another Computer > and attempt to read and copy over your Data that way.@@@@@@@@@@@@@@@@@@@@This Program may interest you too.\"TestDisk, Data Recovery\"http:\/\/www.cgsecurity.org\/wiki\/TestDiskTestDisk can run under DOS (either real or in a Windows 9x DOS-box),Windows (NT4, 2000, XP, 2003, Vista, 2008, Windows 7 (x86 & x64), Windows 10@@@@@@@@@@@@@@@@@@@@Or, you can download Knoppix > make a Bootable disk from it > Boot into your System with it (IF your Hardware is all working) > and copy your Data from the Hard Drive that way.http:\/\/knoppix.net\/\"How to use Knoppix\"http:\/\/lifehacker.com\/192982\/geek-to-live--rescue-files-with-a-boot-cd@@@@@@@@@@@@@@@@@@@@\"Recover files from Windows drives using Puppy Linux\"https:\/\/www.winhelp.us\/recover-files-using-puppy-linux.html"]},{"symptom":"switcch accounts back from sync        Over the summer my laptop asked to sync my accounts. When I did that it changed my computer to Windows 7. I didn't realize this until I recently did system scan and notice the change. My desktop isn't Windows 10. How to I do reset my computer back to Windows 10? How to change sync back ? ","solutions":["Hi SaudCP Can you please provide a screenshot of your Desktop, or whatever you are seeing in its place on your PC . . ."]},{"symptom":"can't open pdf file        can't open pdf file","solutions":["There should be a pdf reader on the operating system.What is the error message?Is .pdf files set up correctly in file associations?"]},{"symptom":"Installing 8.1 and screen went black        Screen went black after 10 minutes of install. Seems to be common with no definitive answer. Any thoughts?","solutions":["Screen went black after 10 minutes of install. Seems to be common with no definitive answer. Any thoughts?It's not a common problem at all if the device is compatible with 8.1 and no hardware has failed.You say nothing about what OS was on the device, if a new install, if a reinstall....."]},{"symptom":"Клавиатура и мышь не работают в BIOS и при загрузке компьютера (когда нужно выбрать клавишу для перехода в BIOS)        После перезагрузки клавиатуры она включается слишком поздно, я не могу зайти в BIOS. Даже когда я захожу в него через Восстановление -> Особые варианты загрузки и там уже настройки UEFI, все равно клавиатура и мышь не работают. А когда я просто загружаю компьютер - все работает. Что это?","solutions":["Добрый день. Это быстрый запуск. Его можно отменить на одну загрузку. Нажмите Пуск, Выключение и удерживая клавишу Shift, Завершение работы.","Добрый день. Это быстрый запуск. Его можно отменить на одну загрузку. Нажмите Пуск, Выключение и удерживая клавишу Shift, Завершение работы. Здравствуйте, да нет... Я только что попробовал так сделать, когда сделал с Завершением работы - у меня он запустился как обычно, клавиатура по прежнему не работала. Когда сделал это с Перезагрузкой - вылезло такое-же окно, как и в Восстановление -> Особые варианты загрузки, т.к. я не знал, что выбирать там - просто нажал продолжить и система загрузилась снова, при этом, клавиатура по прежнему не работала, а заработала только с запуском компьютера, уже когда нужно ввести пароль.","Когда делаете полное выключение, есть возможность нажать функциональную клавишу для входа в БИОС.Из меню восстановления(перезагрузка с Shift), так же можно войти в БИОС. Нажмите это. .","Когда делаете полное выключение, есть возможность нажать функциональную клавишу для входа в БИОС.Из меню восстановления(перезагрузка с Shift), так же можно войти в БИОС. Нажмите это. .Я уже нажимал эту кнопку и заходил в BIOS, проблема в том, что когда он открывается, я не могу использовать клавиатуру и мышь, они просто не работают и не горят, я пробовал переподключить их во время того, как я в BIOS и это не дало результатов.По поводу быстрого запуска - я отключил его в разделе Электропитание отдельным флажком, но это так-же не дало никаких результатов, и клавиатура с мышью так-же не работают при перезапуске, когда появляется экран с подсказками. В интернете я тоже не нашел никакой информации по этому поводу, поэтому вся надежда на вас сейчас.","Ваш компьютер это случайно не планшет? Обычно у них штатная клавиатура не работает пока система не загружена.","Ваш компьютер это случайно не планшет? Обычно у них штатная клавиатура не работает пока система не загружена.Нет, это стационарный компьютер, и у меня все всегда работало, пока я не поменял железо на более новое, после этого начали происходить вот такие вот фокусы...","Это не правильные фокусы. Есть у вашего компьютера разъем PC\\2?","Это не правильные фокусы. Есть у вашего компьютера разъем PC\\2? Да, но у меня нет ни одного устройства под этот разъем, я уже хотел было что-то такое провернуть, но покупать клавиатуру только ради этого - очень неприятно. Есть ли какие-нибудь другие варианты? Я просто хочу переустановить Windows и мне мешает вот эта проблема, т.к. для флешки нужно же сначала зайти в BIOS и Boot Menu... Хотя, я видел в особом запуске возможность запуститься с USB, но у меня там есть только нерабочий вариант Hard Drive, а флешки нет, хотя компьютер её видит и она загрузочная. В общем, тут просто какая-то чертовщина творится, хотелось бы узнать, как все это провернуть правильно. И спасибо за поддержку)","Устаревшую клавиатуру можно найти на прокат(у друзей, на работе). Покупать точно не нужно.Если у вас UEFI загрузка, то можно использовать флешку, внешний диск. Главное помнить, UEFI понимает только файловую систему FAT32. Диск, флешка могут быть не загрузочными, загрузчик у вас EFI. Создаем раздел FAT32 размером 6-7 гигабайт. Копируем в него установочные файлы, загружаемся используя это. .","У меня флешка с файловой системой FAT32, все верно. При нажатии на кнопку, которую вы сказали, у меня есть только 1 вариант - Hard Drive. Скриншот не могу приложить, не дает."]},{"symptom":"printer wont print. tried everything        I cannot copy, paste or print. Also says temporary environment variable has a problem","solutions":["Copy\/paste is nothing to do with your printer."]},{"symptom":"PC stuck at a blurry login screen        I recently updated my PC and now it is stuck at the login screen. It boots up normally to the lock screen, after pressing any button or using the mouse it goes to the next screen for the login but does not load the password box and the screen remains blurry. I can use the power, network and easy of access buttons but that is it.Safe mode will not start, restarting 3 times does not take me to the repair screen, ctrl+alt+delete does nothing, I even tried using ctrl+F8 and nothing has worked. Anyone have any ideas on how to fix\/bypass the login screen?","solutions":["***FIX***Initial Steps (Enter Recovery Environment):Enter Recovery Environment (If you are unable to get into the recovery environment via a menu, you can turn off your system during the initial boot when the Windows logo is on the screen and the dots are circling. Do this at least twice and you'll see the message \"Starting Automatic Repair\").Once the recovery environment loads select \"See advanced repair options\", then \"Troubleshoot\", then \"Advanced options\".Method #1 (Via Command prompt - assumes basic command prompt knowledge):Click \"Command Prompt\".Change directory to your boot drive if necessary (for example, type c: and press <ENTER>)Type \"CD %windir%\\system32\\config\\systemprofile\\appdata\\local\\microsoft\\windows\\caches <ENTER>Type \"DIR <ENTER>\" and make sure you are in the right path. You should see one or more .db files -- usually just cversions.3.db. If there are no files in this directory see the addendum below.Type \"DEL *.* <ENTER>\"Reboot and testMethod #2 (Via Safe Mode and File Explorer - may require adjusting permissions):Click \"Start-up Settings\" and\"Restart\" to reboot the system and get the option toenter Safe Mode.)At the Startup Settings screen press \"4\" to boot in Safe Mode.Log into your administrator-level account.Open File Explorer and browse to %windir%\\system32\\config (example: c:\\windows\\system32\\config)Gain access to systemprofile (you may be able to just double-click it to gain access)Drill down to %windir%\\system32\\config\\systemprofile\\appdata\\local\\microsoft\\windows\\cachesDelete all files inside cachesReboot and testAddendumSome have reported that it is necessary to clear the caches folder of the local user account also or instead of the systemprofile account. If the above procedure does not work for you, delete the file(s) in the local user cache folder (located in%localappdata%\\microsoft\\windows\\caches) using either Safe Mode or the recovery environment command prompt.Good luck!Special thanks to John_E_M for first suggesting the localappdata caches folder, and to Artaeos who also narrowed down the problem to the systemprofile caches folder at the same time I did. Great job guys!**Edited 9\/6\/2019 to add command prompt method, local account provision, and acknowledgements**-Forjo"]},{"symptom":"255% available (plugged in)        How will I removed the display in my laptop it says 255% available (plugged in)please help thank you","solutions":["Hi ChaiLeonido, I am Dexter, an Independent Advisor, here to help you. Do you mean the \"Scale and layout\" from display settings is set to 255%? Could you please attach a screenshot of this issue?","Sorry for the misunderstanding, you mean the battery percentage display is incorrect.I would like to suggest you update\/re-install the power manage driver from your laptop manufacturer's website. If you have no idea how to get this driver, please provide the detailed model of your laptop, I'll search it for you.","Yes sir, i am referring to the battery. My battery is not attached but the battery icon in the system tray shows 255% available(plugged in) that was after i uninstall the battery from the device manager and reboot it. But nothing changes.So i will have to update the driver.Thank you.","You're welcome. Feel free to ask back any questions and let me know how it goes. I will keep working with you until it's resolved."," I tried to update and reinstall driver, it says i have the best drivers installed on my device.  ","I'm using acer laptop","It's a bug.. i have it since 1803 or even earlier. This is not related to old drivers at all. You shouldn't need to install any driver for windows to be able to tell you the right value.There are lots of people affected by this, and it affects all brands.","Is there a way to resolve it? ","No, not unless microsoft knows about it and patches it.And i don't think it ever will since nobody takes it seriously because 1) it's not that serious, it's just a minor asthetic thing and 2) the specialists always think it's related to the specific user and not the OS itself.","It actually does matter in my case. Whenever I have the battery not inserted and the 255% is shown, my computer is capped at 34% of CPU performance. I guess it is due to the \"charge\" being outside the possible 0-100. When I insert the battery (regardless of charge cable plugged in or not) all is back to normal. This is really annoying and has worked fine prior to the November 2019 Windows 10 Update. However, I can't roll back the update since more than 10days passed until I figured this out."]},{"symptom":"Purchase additional coins and tickets for Microsoft Bingo!!        Unable to purchase more coins and tickets to play Microsoft Bingo!!","solutions":["Hi Jilly. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Guardian Moderator here to help you.Sometimes it takes a day for the servers to work right. You can also reset the game at Settings > Apps > Apps & Features > Microsoft Bingo > Advanced Settings > Reset. Restart PC.If that fails you can uninstall the game in the same place, restart PC, then reinstall from Microsoft Store settings > My Library.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thank you Greg for the info, however I am a computer \"dummy\" and have looked everywhere and found settings in several places but I can't find Microsoft Bingo or advanced settings.  I found where you can uninstall but Microsoft Bingo was not listed??   Can you guide me through the steps?  Been playing the game for weeks so it's got to be installed somewhere??  Any other suggestions or am I a hopeless case :)","Jill - The Windows Settings button (which replaced the Control Panel) is the gear icon just above the Start menu button at left end of task bar, when you click it.Open Settings button and go to Apps. Scroll down the list to Microsoft Bingo, click on Advanced Options, then Reset. If that fails continue with the steps I first gave.Keep me posted on your progress as I will be here to help until the case is resolved.","Greg, nothing worked!  I went to the game and tried to purchase coins and tickets and I get the same message.\"You already own this.  Go to my games or my library on your home device to download it)I went ahead and uninstalled the game & restarted PC.  I then went to Microsoft store settings, my library and the only thing there is 1 App (Image Essentials for Power Point)   I can't find the game now to reinstall!!  I guess I've definitely done something wrong.","Jilly, look for the game under Setting > Purchased, or Downloads, or search for the game in Store and choose install.","Gregg, I found the game and was able to reinstall it, but I still get the same message....you already own this, download from my library or my games. I appreciate you trying to help, but I have taken up too much of your time.  I will continue to play by closing game and wait a bit and then clicking on game again.  Each time you do this, it gives you a few tickets and coins, so you can play a few games before running out.  You would think Microsoft would make it easy for players to spend their money on their games.  It would be interesting to  know if other people have had this problem with this particular game or if it's just me that's done something wrong!!","Jilly, I am glad to help you to try to get this fixed. I've looked into it a bit more and think you should run the Windows Store app troubleshooter at Settings > Update & Security > Troubleshoot.This can mean the Store app is damaged. I'll give you everything possible to repair the store. Even if you've tried a step please do it over in this sequence. If any steps cannot be performed then report it and move on to the next:1) Try updating Store apps: https:\/\/support.microsoft.com\/en-us\/help\/402625... 2) Make sure you have the latest Windows 10 version 1903 in Settings > System > About and if not skip to Step 10 to install it by the most stable method.3) See if the fixes here help: https:\/\/www.pcworld.com\/article\/3053099\/windows... 4) Try running the Windows Store apps Troubleshooter at Settings > Update & Security > Troubleshoot.5) Try resetting the Store cache: http:\/\/www.thewindowsclub.com\/reset-windows-sto... 6) If that fails go to Settings>Apps and highlight Microsoft Store, choose Advanced Settings, then Reset. After it resets, restart PC.7) If that fails then reinstall Store. Type CMD in Start Search, right click Command Prompt result to Run as Administrator, copy the following code and paste it into the box using the Edit tools from Box's top left dropdown menu, press Enter:PowerShell -ExecutionPolicy Unrestricted -Command \"& {$manifest = (Get-AppxPackage *WindowsStore*).InstallLocation + '\\AppxManifest.xml' ; Add-AppxPackage -DisableDevelopmentMode -Register $manifest}\"8) Clear the LocalCache Folder: Open Run by pressing the Windows key + R hotkey. Copy and paste %localappdata% in Run and click OK. Open Packages> Microsoft.WindowsStore_8wekyb3d8bbwe > LocalCache folder. Press the Ctrl + A hotkey to select all content within the LocalCache folder. Press the Delete button. 9) If these all fail then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account because of the serious and persistent problem with corrupted accounts. Then continue with the other steps to go over your install most thoroughly.10) If nothing else works then do a Repair Install, by installing Media Creation Tool and then choosing to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Wow Greg!  You've certainly done a lot of research.  I am printing all the instructions and will start working on this today.THANKS SO MUCH....HOPE SOMETHING WORKS THIS TIME.  :}","Greg, I have been out of town for 2 weeks and have not had a chance to go through all the steps you researched for me to see if anything worked.  Just wanted you to know that I'm still working on this, but the holidays are taking up a lot of my time!!  ","I finally have a chance to work on this problem (re: the instructions you gave me).  I am a real computer \"dummy\" and don't understand how to do some of the steps.  I have a person who has worked on my computer before and has a \"team viewer\" that will allow him to work on the system from his shop.  I will contact him for his help following the steps you researched and think may work. I will get back with you if we get any results.  Thanks so much for your help!! "]},{"symptom":"Stuck in WinRE        Anyone can help, Please? I got very important document inside my laptop.After my laptop pop up blue screen showing error, I restart it then it became like this. No matter what option I choose it can’t be complete. For more information: I just update some of the window feature (I forgot what is that).","solutions":["Hi Nicolas, Can you recall what was the error code or message on blue screen? Did you try any steps for recovering? Please run command prompt, run chkdsk c: \/f \/r command, Then try to use restore points.","it was like this.","Try to use restore point to roll back to previous date.","This is what happen when i choose system restore","Do you have more than one Windows installation? Did you run chkdsk command mentioned above?","What you mean by more than one window installation?Yes, I did run the command as you mentioned above.","System restore says \"to select operating system\" this usually means it see at least two Windows instances could be restored.This may mean serious system fault so seems it is better to reinstall Windows."]},{"symptom":"Why does Win10 keep toggling between applications I have running without my input?        I am usually only running 2 applications, Chrome and Outlook.  I can just be looking at something in Chrome, not moving the mouse at all and it will jump over to Outlook for no reason.  I am running windows 10.","solutions":["Hi susanisley, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Start Windows through a clean boot, it is an error-proof process, which allows us to detect if the behavior is generated by third-party drivers or programs, if once you run it, the error does not happen, go to the section >> How to determine what is causing the problem after you do a clean boot https:\/\/support.microsoft.com\/en-us\/help\/929135...To complement the above process, let's scan the computer for corrupt files that can interfere with Windows processes, if they exist, and if they are detected, they will be automatically repaired.https:\/\/support.microsoft.com\/en-us\/help\/929833...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M.","Marc,  I did all of the above.  Now, I am still in clean boot mode.  Do I need to go back and change all those things under system startup where I hid all Microsoft files  and then do another boot?  It did not make any switches between apps while in clean boot.","Hi, When the process of link 2 ended, did you get any information about correcting any files?Regards"]},{"symptom":"Constantly getting MDM configuration manager error in Event Manager about Family Safety enrollment.        I'm not trying to enroll anything.  I'm running windows 10 home so I don't think I even have MDM.  Not sure why this keeps happening.  It's many times a day.  Any ideas on how to stop it?Log Name:      Microsoft-Windows-DeviceManagement-Enterprise-Diagnostics-Provider\/AdminSource:        Microsoft-Windows-DeviceManagement-Enterprise-Diagnostics-ProviderDate:          1\/8\/2020 4:23:50 PMEvent ID:      454Task Category: NoneLevel:         ErrorKeywords:      User:          SYSTEMComputer:      XPSDescription:MDM ConfigurationManager: Command failure status. Configuraton Source ID: ({D9E3514D-4668-424B-A6B9-9B16B1C935BE}), Enrollment Type: (FamilySafety), CSP Name: (AppLocker), Command Type: (Add: from Replace or Add), Result: (.\/Vendor\/MSFT\/AppLocker\/FamilySafety\/FamilySafetyGroup\/StoreApps).Event Xml:<Event xmlns=\"http:\/\/schemas.microsoft.com\/win\/2004\/08\/events\/event\">  <System>    <Provider Name=\"Microsoft-Windows-DeviceManagement-Enterprise-Diagnostics-Provider\" Guid=\"{3da494e4-0fe2-415c-b895-fb5265c5c83b}\" \/>    <EventID>454<\/EventID>    <Version>0<\/Version>    <Level>2<\/Level>    <Task>0<\/Task>    <Opcode>0<\/Opcode>    <Keywords>0x8000000000000000<\/Keywords>    <TimeCreated SystemTime=\"2020-01-08T22:23:50.905451100Z\" \/>    <EventRecordID>3780<\/EventRecordID>    <Correlation \/>    <Execution ProcessID=\"18588\" ThreadID=\"19496\" \/>    <Channel>Microsoft-Windows-DeviceManagement-Enterprise-Diagnostics-Provider\/Admin<\/Channel>    <Computer>XPS<\/Computer>    <Security UserID=\"S-1-5-18\" \/>  <\/System>  <EventData>    <Data Name=\"Message1\">{D9E3514D-4668-424B-A6B9-9B16B1C935BE}<\/Data>    <Data Name=\"Message2\">FamilySafety<\/Data>    <Data Name=\"Message3\">AppLocker<\/Data>    <Data Name=\"InternalCmdType\">1<\/Data>    <Data Name=\"Message5\">.\/Vendor\/MSFT\/AppLocker\/FamilySafety\/FamilySafetyGroup\/StoreApps<\/Data>    <Data Name=\"HexInt1\">0x82aa0002<\/Data>  <\/EventData><\/Event> configuration manager: command failure status regarding family status.  ","solutions":[]},{"symptom":"YourPhone Support--When I click \"Link Phone\" A window opens, but then closes        Hello,I am trying to start Your Phone. When I click here, a window opens, but then it just closes and I can't continue.","solutions":["Hi TravisR1, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.I suggest you consult the indications of these links, they are the steps offered by the community, and by the Windows MVP.Your Phone app not working or will not open on Windows 10 https:\/\/www.thewindowsclub.com\/your-phone-app-n...Troubleshooting the Your Phone app >> Data syncing and connectivity issues https:\/\/support.microsoft.com\/en-us\/help\/453129...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I'm still having the same problem.","Hi, If the above steps do not work, starting Windows through a clean boot is an error-proof process that helps us detect if the problem is generated by third-party drivers or programs, if the error does not happen after executing it, go to >> How to determine what is causing the problem after you do a clean boot https:\/\/support.microsoft.com\/en-us\/help\/929135...Once you run it, try the process again. Regards"]},{"symptom":"Prints perfect from hard drive but not from email or internet!        Until recently, I could print from my emails on my desktop to my HP Officejet printer wirelessly. Now I can only print from my iPad, iPhone, or hard drive. Any suggestions?","solutions":[]}]}