{"windows":[{"symptom":"Windows 10: Wireless logitech keyboard and mouse lags intermittently suddenly.        Original Title: Wireless logitech keyboard and mouse lags intermittently suddenlyHave had Logitech M185 mouse and K270 keyboard for years and got a HP preinstalled Windows 10 PC this past Christmas w\/o any issues until yesterday.I noticed huge lag in keyboard responsiveness and then slight lag with mouse. Ended up replacing with fresh batteries to no avail.Then switched USB from hub to PC itself and 2 USB ports, resinstalled drivers (even though it said everything working well). Noticed that some of the things I did made it work temporarily and then sometimes mouse worked but keyboard not at all.Tried to restore Windows 10 OS to last month when everything worked well but took forever and I had to leave but my wife says screen says it failed.Using corded mouse\/keyboard without any issues (had to use to restore\/log in during multiple restarts, etc).Any thoughts or suggestions? I have not installed anything lately although Windows updates itself along with a few other programs. Working well for almost 5 months. ","solutions":["Hi Jack, I realize the inconvenience you are experiencing with Windows 10. I will certainly help you. This issue might occur if mouse and keyboard driver is corrupt. I suggest you to follow the methods below to run hardware troubleshooter. Also update mouse driver and keyboard.  Method 1: I suggest you to perform the Hardware and Devices troubleshooter. Check if it helps.1. Click on Search bar.2. Type “Troubleshooting” without the quotes and click onTroubleshooting.3. Click on View All on the left panel of the screen.4. Click on Hardware and Devices.5. Click on Next and follow the prompts to run the troubleshooter.If the issue still persist, refer to the below method.Method 2: I recommend you to update the latest driver for mouse and keyboard.1. Press Windows Key + R Key.2. Then type “devmgmt.msc” without the quotes and hit on Enter Key.3. Expand Keyboards. Also expand Mice and other pointing devices.4. Right click on the drivers and click on Update Driver Software.5. Follow the instruction to update the driver.  Please get back to us with an update on issue with using mouse and keyboard, we will be happy to help. Thank you.","I will try to but to clarify:my wireless keyboard\/mouse are not working currently so to do Method 1, I have my wired mouse\/keyboard plugged in. Logitech USB receiver is in wireless hub.I obviously can't do anything without working mouse\/keyboard.When restarting without wired mouse\/keyboard, there's some kind of keyboard error.","I used wired to restart and plugged USB receiver directly into PC instead of hub and it's working now.However, in the past day or two I was able to get it to work again, only to have the insufferable lag return.I tried restoring PC to a month ago but it failed after a long time. Right now everything does seem to be working properly","Hi Jack,Thank you for your response with the current status of the issue.Glad to know to that you are able to resolve the issue. Appreciate your efforts.Thank you for sharing your valuable information regarding the issue. It might help other community members in resolving similar issues.Let us know if you need further assistance on Windows related issues and we will be glad to help.Thank you.","The fix METHOD 1 worked.Method 1: I suggest you to perform the Hardware and Devices troubleshooter. Check if it helps.1. Click on Search bar.2. Type “Troubleshooting” without the quotes and click on Troubleshooting.3. Click on View All on the left panel of the screen.4. Click on Hardware and Devices.5. Click on Next and follow the prompts to run the troubleshooter.If the issue still persist, refer to the below method.However, within 24hr the lag in the keyboard came back. I did the same thing and it's now working. Is there a more permanent fix? This if very frustrating. I do have my wired keyboard nearby too but since it works for awhile, this is obviously a driver issue or something. Has there been a recent Windows 10 update which may be causing this perhaps?I forgot to add that Windows says my drivers are up to date. I had done that prior to posting but did it again as per Method 2.","Hi Jack, Thank you for your response with the current update on the issue.Glad to know that your are you able to resolve the issue temporarily using method 1.I suggest you to download the latest mouse and keyboard driver from the Logitech websites and check if it helps.http:\/\/support.logitech.com\/en_us\/product\/wireless-mouse-m185#downloadhttp:\/\/support.logitech.com\/en_gb\/product\/wireless-keyboard-k270#downloadPlease get back to us with an update on issue with using mouse and keyboard, we will be happy to help.Thank you.","I've downloaded the latest drives (logitech unifying driver) twice now.I've rebooted my PC after running trouble shooter a few times too. It seems to fix the problem temporarily and issues are back within a few hrs if that. I've plugged my wired keyboard into the PC just to type this and access the troubleshooter.","Hi Jack,Thank you for your response with the current update on the issue.I suggest you to uninstall and reinstall the (keyboard and mouse driver) which is downloaded fromLogitech in a compatibility mode. Check if it helps. 1. Right-click on the driver setup file and click on ‘Properties’'.2. Click on the ‘Compatibility’ tab and check the box ‘Run this program in compatibility mode for’ and select Windows 7, 8\/8.1 operating system from the drop down menu and proceed with the installation. Once this is done, restart the computer and check if the issue persists.Please get back to us with an update on issue with using mouse and keyboard, we will be happy to help.Thank you.","Hi Nyima,I appreciate your efforts but wanted to clarify a few things.My keyboard is so buggy and lagging so much that I've basically had to plug in my wired keyboard to do anything (although my mouse seems to be working fine)When I uninstall\/reinstall, does it matter if my wired keyboard is plugged in or not (I need it to do any typing basically)Logitech basically uses a unifying driver. Is that what I should run in compatibility mode?Lastly, how come I've had this pc running windows 10 since Christmas with no issues until now?","Hi Jack,Thank you for your reply with the current update on the issue.Yes, I suggest you to reinstall the Logitech driver which is available from the Logitech website in compatibility mode and check if it helps.Please get back to us with an update on issue with using keyboard in Windows 10, we will be happy to help.Thank you."]},{"symptom":"Overscan        I am running integrated graphics off of a ryzen 3 2200g connected to my tv via hdmi and inside of the radeon settings there is no option to manually scale, there is a ton of overscan and i need help. The layout and resolution is grayed out in display settings","solutions":[]},{"symptom":"Microsoft support tech messed up my PC        I have a brand-new PC. I have been having issues connecting my wireless headphones and all of my research and support knowledge (I have an IT background) came up empty, so I tried Microsoft support at their official phone number.I spoke to one tech and he remoted in with Quick Assist. Before support began the problem cleared itself up with no further issue, so we disconnected. The issue immediately came back, so I called back and was given to a new tech to reopen the ticket.The new tech, Rohan, also remoted in with Quick Assist. He then went lightning-fast, doing the following:Opened Device manager and disabled my bluetooth deviceLaunched MSDS (Surface diagnostic tool). I am NOT on a Surface device and he did not ask.When MSDS Terms of service popped open, he clicked the \"accept\" button without asking or even saying a wordOpened SysConfig and disabled the first 20 or so programs in the \"services\" tab. This included several Microsoft services.Opened task manager and disabled my entire startup listOpened RegEdit and did SOMETHING. I didn't have more than a second and I couldn't catch what he did before he had closed this and all other windows, and restarted the computer.Which then had issues booting.When it finally got back to the desktop, Rohan asked me to reconnect the support session, but I couldn't--I had an empty system tray, nothing in my internet adapters, everything in \"Services.msc\" was disabled or stopped. Rohan then said that before we continued support I would need to contact my internet provider.I told him that's not the case, and explained that I had just watched him disable all this stuff. Rohan got very angry and started saying I shouldn't blame him for this problem, and that he hadn't done anything wrong. I asked to speak to a manager and Rohan hung up.It has been several hours and I have my PC back up to where it was before Rohan's interaction, but my initial issue remains unsolved and I feel like my trust in Microsoft support has been severely damaged here. What Rohan did not know was that I was recording my desktop with OBS, and I have been able to recover part of the recovered desktop recording, showing him do most of the things listed above.- Sam","solutions":[]},{"symptom":"我已是成人，開啟firefox卻被要求向成人取得權限        而點選透過電子郵件，卻顯示請問該如何解決","solutions":["您好，我是Jarl，一名独立顾问 (Independent Advisor) 和Windows 10的资深用户，很荣幸能为您提供技术支持。目前来说，您可以尝试：（一）请您的家长账户登陆account.microsoft.com\/family，对有关浏览器进行解除封锁的操作。（二）离开家庭群组：由于您已经满18岁，您可以离开家庭群组，以避开有关信息。一般来说，系统需要24小时以上才会对离开家庭群组在所有设备上生效。《从家庭组中删除成员》https:\/\/support.microsoft.com\/zh-cn\/help\/402770...如果还有其他相关的问题，我会努力为您解答！Jarl"]},{"symptom":"Windows Reactivation Errors        I recently upgraded the motherboard and CPU on my PC, upon entering my windows product key for reactivation it gives me the error code 0xC004C060. I have tried changing and re-entering my product code with no results, and have run the activation troubleshooter.","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,First, you'd need to identify if the product key for the windows 10 computer is either a retail or an OEM key.Normally OEM keys are solely embedded to one motherboard as they do not have transfer rights for other hardware, unlike retail keys which has transfer rights.For free upgrade licenses, the condition for these are relevant to an OEM key as the license is then considered a digital license once you upgraded free to windows 10.Under this link are reference to activation after hardware change https:\/\/support.microsoft.com\/en-ph\/help\/20530\/...For your windows 10 license, I'd recommend running the activation troubleshooter. Go to Settings>Update and security>Activation and run the troubleshooter. and select I recently changed hardware on this device.If the troubleshooter hasn't helped, you would have to call Microsoft during support hours to get more help.https:\/\/support.microsoft.com\/en-in\/help\/405170..."]},{"symptom":"Charger for my old Windows XP laptop        <a href=\"https:\/\/filestore.community.support.microsoft.com\/api\/images\/ac9ea91b-b065-4ee7-9341-09e846f9db50?upload=true\" target=\"_blank\"><img src=\"https:\/\/filestore.community.support.microsoft.com\/api\/images\/ac9ea91b-b065-4ee7-9341-09e846f9db50?upload=true\" \/><\/a><a href=\"https:\/\/filestore.community.support.microsoft.com\/api\/images\/8a9e0ccb-a32f-4a00-b8e8-ccb5de78c587?upload=true\" target=\"_blank\"><img src=\"https:\/\/filestore.community.support.microsoft.com\/api\/images\/8a9e0ccb-a32f-4a00-b8e8-ccb5de78c587?upload=true\" \/><\/a><a href=\"https:\/\/filestore.community.support.microsoft.com\/api\/images\/b34fdf0a-8844-4c2c-90d4-8490faca1af4?upload=true\" target=\"_blank\"><img src=\"https:\/\/filestore.community.support.microsoft.com\/api\/images\/b34fdf0a-8844-4c2c-90d4-8490faca1af4?upload=true\" \/><\/a><a href=\"https:\/\/filestore.community.support.microsoft.com\/api\/images\/63266c61-02f5-49df-ab9e-09ab19552f5e?upload=true\" target=\"_blank\"><img src=\"https:\/\/filestore.community.support.microsoft.com\/api\/images\/63266c61-02f5-49df-ab9e-09ab19552f5e?upload=true\" \/><\/a><a href=\"https:\/\/filestore.community.support.microsoft.com\/api\/images\/1c33c9c4-dd76-4d28-8581-9d613f6b522d?upload=true\" rel=\"noreferrer\" target=\"_blank\"><img src=\"https:\/\/filestore.community.support.microsoft.com\/api\/images\/1c33c9c4-dd76-4d28-8581-9d613f6b522d?upload=true\" \/><\/a>Hello! My dad just found a old laptop of his and we are trying to find the right charger for it. Anyone know what charger this laptop needs?","solutions":["I suggest that you ask the laptop manufacturer that question.","Try Walmart, they now care several universal power supplies for Computers with inter changeable adapter ends. Minw works fine and cost less than the manufacturer."]},{"symptom":"I can't download Minecraft W10 edition even though I meet the requirements.        I own Minecraft W10 edition and I recently got a PC with windows 10 in order to run it (This same PC is able to run java edition seamlessly), but when I try to install W10 edition it'll tell me that there aren't any devices that meet the requirements registered in my Microsoft account (yes I did register my PC into my account)  Can anyone help me? PD: (It's a laptop and my windows 10 version is 1809, compilation 17763.914)","solutions":["Hi Yogurt_, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Try to apply the steps shown in this official link. If it does not solve the problem, check the links at the end of the article that have helped other users with the same message.https:\/\/support.microsoft.com\/en-us\/help\/13765\/...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M."]},{"symptom":"Consolidating several users to just one        I had a computer with a corrupt hard drive years ago and it was set up with multiple Users.  When I got my current PC (an HP about 3 years ago) everything was moved over the same as it was on the old computer. All fine and dandy until I just got a new laptop (Dell) with OneDrive.  Now I want to sync my PC with my laptop, but it seems to be a bit confusing having 4 different Users (which I don't need).  I am in the process of moving all the files into just one location (MANY of them were triplicated because of all the different users).  What do I do do next?","solutions":["OneDrive syncs to a single location - the location doesn't have to be the same on each PC. The usual location for OneDrive is: c:\\Users\\Username\\OneDrive or similar... but it could be located anywhere you choose.The contents of the Onedrive folders on any device you connect are merged across all your devices.If you make a folder called \"My Files\" within the Onedrive folder on your new laptop and store 10 files in it that folder the files will eventually appear in the OneDrive folder on your other computer too. Basically anything you move to OneDrive on either computer will appear on the other one too. In your example you'll eventually end up with Folder A and Folder B on BOTH your computers if they are both within OneDrive.As for getting rid of the users - assuming the old computer is Windows 10. Cilck START > Settings (the cog) > Accounts > Other Users... you can then select the account you want to remove and then click \"Remove\"."]},{"symptom":"Sound disappeared        Hello!Today I got new unpleasant surprise - the sound disappeared. I didn't do anything unusual today, in the evening installed PCloud and then uninstalled it. I restarted the PC but the sound didn't appear. Everything seems ok in Device Manager. In Winamp the songs don't start. In Classic Media Player videos starts but with no sound. Please, help me!Also one more strange things - CPU usually was on 2-3%. Now is on 30% because Desktop Window Manager. System Interrupts also appears in the processes. PCloud was integrated in Win shell, is it possible it's install and uninstall to cause this? The PC makes noise like never before.Win 10, build 1510PS. I restarted again and now sound is back and processes are like before. Maybe my old man was just tired from today's tasks (he's 6 yo).","solutions":["If the build is really Version 1510 you are way being up to date.  We are now at Version 1909.","I know that very well. My PC is incompatible with every version after 1510."]},{"symptom":"performence        My laptop does not perform as well as it is supposed to. this started to happen about four or five months ago when I went into taskbar and ended random tasks because I thought I had so many things running. When I play a game, graphics are worse, and frames per second has lowered after I ended random stuff in task bar. someone help me please.","solutions":["Hi VendelEx, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved. One real problem with laptops and tablets is heat, If the heat levels even approach the max (or sometimes just above mid-levels) the computer will slow down. Heat issues can happen because the programs running, particularly games, are using most or all of its capacity and\/or because the heat is not being dissipated as it needs to be. Check by adding a fan blowing underneath and\/or into the vents. Of course, ensure the vents are clean and clear.Check with the makers' of the programs and games, especially their forums. to see if the system will handle what you are running.======= More troubleshooting (not to replace the above steps). If using an SSD or hybrid hard drive be sure it has the latest firmware. Try the Clean Boot method to see if a startup program is involved - if so it is a process of elimination :Right Click the start button - Command Prompt (Admin) OR Windows PowerShell (Admin) - at the prompt type inMSCONFIG and hit enter How to perform a clean boot in Windows https:\/\/support.microsoft.com\/en-us\/kb\/929135Other programs to help : Autoruns - Free - See what programs are configured to startup automatically when your system boots and you login. Autoruns also shows you the full list of Registry and file locations where applications can configure auto-start settings.http:\/\/technet.microsoft.com\/en-us\/sysinternals...Process Explorer - Free - Find out what files, registry keys and other objects processes have open, which DLLs they have loaded, and more. This uniquely powerful utility will even show you who owns each process.http:\/\/technet.microsoft.com\/en-us\/sysinternals...Process Monitor - Free - an advanced monitoring tool for Windows that shows real-time file system, Registry and process\/thread activity. It combines the features of two legacy Sysinternals utilities, Filemon and Regmon, and adds an extensive list of enhancements including rich and non-destructive filtering, comprehensive event properties such session IDs and user names, reliable process information, full thread stacks with integrated symbol support for each operation, simultaneous logging to a file, and much more. Its uniquely powerful features will make Process Monitor a core utility in your system troubleshooting and malware hunting toolkit.https:\/\/docs.microsoft.com\/en-us\/sysinternals\/d...================================================== Do all of these : If you had a 3rd party antivirus on the OS you upgraded OR if you have one now uninstall it and then run its maker's removal tool. Use Windows Defender which in Windows 8\/8.1\/10 is a full antivirus. Despite all the hype out there Windows Defender and the Windows Firewall are true superstars. List of anti-malware program cleanup\/uninstall tools http:\/\/answers.microsoft.com\/en-us\/protect\/wiki...Uninstallers (removal tools) for common antivirus software http:\/\/kb.eset.com\/esetkb\/index?page=content&am...=============================== Check this : Right Click Start button - Control Panel - Troubleshooting - on right side click View all - \"Hardware and Devices\".----------------------------------------------------- Tips to improve PC performance in Windows 10 <-- read this link https:\/\/support.microsoft.com\/en-us\/help\/400201...The below is additional help with some of the methods in the \"Tips to improve....\" link.Windows Key + X - Command Prompt (Admin) OR Windows PowerShell (Admin) (Run these one line at a time.) SFC \/scannow Note if that shows uncorrected errors - do the below regardless. When that completes run these : DISM \/online \/cleanup-image \/scanhealth DISM \/online \/cleanup-image \/restorehealth Note if that shows any uncorrected errors - do the below regardless. Then restart the computer. ----- Be sure you are running the latest available BIOS, chipset drivers, and all the major device drivers.Check with System Maker (Motherboard Maker for custom systems) for updates to the BIOS, low level chipset drivers, and the major on-board and separate device drivers. Run DriverView - set VIEW to Hide Microsoft drivers - update those without Dump in their name.DriverView - Free - utility displays the list of all device drivers currently loaded on your system. For each driver in the list, additional useful information is displayed: load address of the driver, description, version, product name, company that created the driver, and more. http:\/\/www.nirsoft.net\/utils\/driverview.htmlFor Drivers check System Maker as fallbacks and Device Maker's which are the most current. Right Click Start Button - Display Adapter - write down the make and complete model of your video adapter - double click - Driver's tab - write down the version info. Now click UPdate Driver (this may not do anything as MS is far behind certifying drivers) - then Right Click - Uninstall - REBOOT this will refresh the driver stack.Repeat that for Network - Network Card (NIC), Wifi, Sound, Mouse and Keyboard if 3rd party with their own software and drivers and any other major device drivers you have.Now go to System Maker's site (Dell, HP, Toshiba as examples) (as rollback) and then Device Maker's site (Realtek, Intel, Nvidia, ATI as examples) and get their latest versions. (Look for BIOS, Chipset, and software updates at System Maker's site while there.)Download - SAVE - go to where you put them - Right Click - RUN AD ADMIN - REBOOT after each installation.Repeat at Device Makers - BTW at Device Makers DO NOT RUN THEIR SCANNER - check manually by model.Manually look at manufacturer's sites for drivers - and Device Maker's sites. http:\/\/pcsupport.about.com\/od\/driverssupport\/ht...Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all."]},{"symptom":"topaz Impression 2 \"For Security, Program will exit\"        How I can fix that? Topaz Impression was working for me always until I changed my Dell 24\" with 1920x1440 monitor to a newer 27\" ultra sharp  with 2560x1440. Now the Security program will exit pop up. I reinstalled Topaz but still the same.  I have Win 10 64 bit. Please help Topaz not helping. Thanks!","solutions":["Hi there My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.1. Try configuring the display size to 200%. Step 1: Open Settings → Display Step 2: Set the Display Size to 125%, 150%, or 200% 2. Update the display driver In the search box on the taskbar, enter device manager, then select Device Manager.Expand the display adapters category to see names of devices, then right-click (or press and hold) the one you’d like to update.Select Search automatically for updated driver software. Select Update Driver. If Windows doesn't find a new driver, you can try looking for one on the device manufacturer's website and follow their instructions.3. Reinstall the display driver In the search box on the taskbar, enter device manager, then select Device Manager.Right-click (or press and hold) the name of the device, and select Uninstall. Restart your PC. Windows will attempt to reinstall the driver. Hope this helps.","I did all three suggestion none of it works.  Help please!Thanks","Hi Zzsuzsanna and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.Please take a screenshot of the error message you have received and post it here so I can understand what issue you are facing.Thank you.","Hi Zzsuzsanna and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.Please take a screenshot of the error message you have received and post it here so I can understand what issue you are facing.Thank you.","Sorry it is upside down I can't change that. When I push OK it will close the app.  ","this is the error message close up             ","The error came from dirrctly from the 3rd party application. Please try submitting a support request with them:https:\/\/help.topazlabs.com\/hc\/en-us\/requests\/newYou can also try to update the application by download the latest version here: https:\/\/topazlabs.com\/downloads\/ Please let me know if I can help you further! Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thanks! I tried them first but they not support older version.  Thank you again. Zsuzsa"]},{"symptom":"Change Administrator        HelloI need to change the administrator on my laptop to my new microsoft account. I cannot recover the old one. How do I change this?","solutions":["Hi, Go into Windows Settings --> Accounts --> Family & Other People > Other Users to create a new account.Tips: To create\/change passwords: Settings --> Accounts --> Sign in Options --> Change PasswordRegards,","Hi Justine. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Can you still sign into Windows 10 with the Admin account? If so go into Settings > Accounts > Your Info and choose Sign In with a Local Account Instead. Restart PC.Go back to the same place where the link will now read: Sign in with a MS Account Instead, choose that, provide your desired MS Account and password.If you cannot sign in with the old account to convert it as above, then can you sign in at all? If so create a new MS Account in Settings > Accounts > Family & Other People > Other User, assign it Admin privileges:https:\/\/www.windowscentral.com\/how-change-user-... Sign into the account, move your files over, test all programs run correctly, then when ready delete the old account.If you cannot sign in at all right now, then enable the hidden Built-in Administrator used only for emergencies from the Sign In screen as shown here:https:\/\/www.isumsoft.com\/it\/enable-hidden-admin.... Sign into it and create a new Local or Microsoft Admin account at Settings > Accounts > Family & Other People > Other User, sign into it, move your files over, when ready delete the old account and hide the built-in Admin.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","The issue is, the admin account was never completed. It is an account using my phone number and then when I tried to complete set up of the account with my email address, it claimed I had an account already with that email. It must have been from years ago and the recovery email address no longer exists. So I set up a new microsoft account with a new outlook email. Somehow the half set up account with my phone number as the user name is the ADMIN to my new laptop microsoft settings. I have downloaded microsoft office onto laptop with my new account ( outlook email) ...which was set up on my desktop. Now I want to get rid of the half set up account but I cant as I cant access it with any email address to complete it! ugh!"]},{"symptom":"Windows 10 update        Windows 10 wants to update, and it has been several times that it starts update but gets stuck in the middle of the process and returns it back. Then after few days it again requires consent for update. And then again failure occurs in the middle of the process. How to stop it asking for updates frequently or how to fix updates? The form of failure is like this: During the update it restarts PC several times and in one of these restarts it gets stuck. ","solutions":["Hi pashapashazade I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Let us check the Installation log to find why the update failed. Please share the logs as mentioned in this article. You should use a File sharing service like Onedrive or Media Fire to upload files and share the link in the next reply.https:\/\/answers.microsoft.com\/en-us\/windows\/for...The Panther logs. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\PantherThe Rollback logs: These usually are created if Windows Update rolls back. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\Rollback[Only if the error code is 0xC1900101-0x30018] The Device Install Log from C:\/$Windows.~bt\\Sources\\Rollback\\setupapi\\setupapi.dev.logAs the log size might be large consider zipping before uploading.","https:\/\/1drv.ms\/u\/s!Aj454qL9QZ68hnexvtDLdIX-rnrB?e=d3SzWE","Hi, I see you shared on Setuperr.log only. Can you please upload other files I mentioned as well for a complete understanding?","For Setupact.log it says you don't have permission. And the other two does not exist I guess, because I can't find the directory you wrote (gives error).","You need to copy the files to the desktop first and then upload, if you are hitting a permission error. There is no good need of Rollback log however.","nokia microsoft 535","Windows 10 wants to update, and it has been several times that it starts update but gets stuck in the middle of the process and returns it back. Then after few days it again requires consent for update. And then again failure occurs in the middle of the process. How to stop it asking for updates frequently or how to fix updates? The form of failure is like this: During the update it restarts PC several times and in one of these restarts it gets stuck. nokia microsoft 535 update for windows 10","https:\/\/1drv.ms\/u\/s!Aj454qL9QZ68hnjIj_e_kh4IIcGJ?e=y70Gsp","Thank you. Unfortunately, the logs do not point to any root cause of the problem.If you have not, try updating manually. Enable Clean boot mode first. https:\/\/support.microsoft.com\/en-in\/help\/929135...Try updating to 1909 using Media Creation tool and if it fails let us know. The fastest way to get the upgrade is through Media creation tool or ISO file. Please download Media Creation Tool from the link below and select Upgrade this PC at the first screen.https:\/\/go.microsoft.com\/fwlink\/?LinkId=691209All steps, including upgrading using ISO file and Media creation tool, are covered here:https:\/\/www.yourwindowsguide.com\/2019\/11\/update...Content on the above blog is written by a Microsoft MVP so it is safe.","Does it mean that all the upcoming windows update versions are going to fail in my PC? I would rather wait until the next update than doing all these steps, which I suspect is going to be successful. Do you think of any problem possible if I do this? Thank you for your help."]},{"symptom":"Wow, wheres Line in recording settings???         Hey there, ive recently updates windows 10, ive recently been using magix music studio to record with the operating system using a aux to usb cable from my synthesizer to my computer, but when I try to record the software tells me it cant record because its in the \"microphone\" input, but its not. I checked the settings thur windows and to my shock they got rid of the line in recording so now theres only microphone input. Please help me, is there a way to enable or like turn on line in recording instead of using the microphone input for my synthesizer so I can start recording music?? Please help, thank you!","solutions":[]},{"symptom":"Unable to open links in emails        with my job I receive weekly reports  why can I not open the link when I click on it states un able to open this happens to every email even from friends or family (lap top) however if I use my iPhone I am able to open the link***Modified title from: email***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are unable to open links from emails. I’ll certainly help you with the issue. However, it would be great if you can help us with the details requested below: What is the complete error message that you receive?Which email client are you using to access your emails i.e. Microsoft Outlook or Windows Mail?Were you able to open links from emails earlier?Which version of Windows are you using? To check type:winver in the search bar on the Taskbar and hitEnter. If you are using Windows Mail app, I would suggest you to try changing the Default web browser and check if that helps. Refer the steps mentioned in the articleChange default programs in Windows 10.  If you are facing this issue in Microsoft Outlook, I suggest you to refer the steps mentioned in the articleHyperlinks are not working in Outlook.  Note:  Important this section, method, or task contains steps that tell you how to modify the registry. However, serious problems might occur if you modify the registry incorrectly. Therefore, make sure that you follow these steps carefully. For added protection, back up the registry before you modify it. Then, you can restore the registry if a problem occurs. Follow the steps to take backup of registry.  We await your response. Regards,Nikhar KhareMicrosoft Community - Moderator","What I did and worked for me, was to remove the accounts from email accounts either from the mail app or settings and uninstall it and re-install it from the store, now links open in my default browser."]},{"symptom":"Windows 10 - Recording Devices setting missing.        Greetings,I was looking for the volume input control for my recently added microphone and realised (after some searching online) that I no longer have the Recording Devices option when right-clicking my volume icon.  Nor do I find it anywhere else.I have uninstalled and reinstalled the latest microphone (AT2020 USB) to no avail but neither does my webcam microphone (my current default) show.Where do we now set the INPUT level of microphones without this setting, please?Cheers.Ian.","solutions":["Hi Ian I am Vijay, an Independent Advisor. Please try these steps and check after each step.1. Run Audio Troubleshooter Windows Key+i > Update & security > Troubleshoot > Playing Audio > Run the troubleshooter2. Take actions related to Audio Driver Windows Key+X > Device Manager > View tab > Show hidden devices > Sound, Video & game controllers > Right Click on your Audio driver (if more than one, then you will have to repeat the steps for all) > Properties > Driver Tab >A. Roll Back - If Roll back driver is enabled, roll it back B. Update - Update driver C. Download and reinstall the driver from computer manufacturer's website - f you need my help to locate the driver on the website, please let me know following -A. What is your computer's make and model? For example Lenovo T470 B. Windows Key+X > Click Device Manager > Sound, Video & game controllers > Right Click on your Audio driver > Properties > Driver tab > Post the screenshot3. Check if Windows Audio service is running or not Windows Key+R > Type services.msc > Scroll down to Windows Audio > Change the startup type to Automatic > Restart computer4. Check Speaker \/ headphone is not disabled and is set as default Type Sound in Windows Start Seach box > Click Sound > Under Playback tab, right click on an empty space and select, Show disconnected devices and Show disabled devices > Select Speaker and click on Properties and make sure that it is is enabled > You may also check if the Speaker that you are using is set as default. 5. Also check additional Microsoft recommendations Fix sound problems in Windows 10 - https:\/\/support.microsoft.com\/en-in\/help\/402699...","This is not helpful, because the setting has been literally removed from the right click menu. You can still access it by manually searching for it, but there is no reason to remove this. The same settings are NOT in the new UI. You cannot access stereomix and \"listen to this device\" any way except for the sound settings, so it is just annoying. ","Very much agreed.","Very much agreed. Yes, I totally agree aswell. I just bought a new headphone with mic and I cant for the life of me understand how to turn off the damned listening mode in windows. Its driving me nuts. Microsoft, dont remove features that are actually good from the UI so we normal people cant access your features anymore. this is literally torture. static white noise is gonna be my death."]},{"symptom":"Sleep button in start menu restarts computer.        As my title says, when I press the sleep button or when the timer to put my computer to sleep runs out the computer goes to sleep but immediately wakes up with a black screen and the windows logo with the dotted loading circle. It appears the computer restarts but at no point does it state that it restarted. It then prompts me to sign in, when I do all programs have closed. When I open Chrome it tells me it didn't shut down properly which tells me the computer either restarted or crashed. I've looked into turning off fast start up. I adjusted the Hybrid sleep setting. I updated my graphics card. I ran the power troubleshooter and it tells me nothing is wrong. I've looked up and down the forums yet no solution works. This computer is a brand new custom build, I don't understand why this is happening. Can anyone help with an actual solution?","solutions":["Hi Jay. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See fixes here for Sleep restarts PC: https:\/\/www.tenforums.com\/general-support\/59776...This is likely a problem with Sleep. I will give you all possible fixes for Sleep. If you need help performing any step just ask back:First confirm you have the Sleep options configured correctly as shown here: https:\/\/www.tenforums.com\/tutorials\/2843-change....Most Sleep problems are caused by the Display driver, so try updating yours from the PC or Device maker's Support Downloads web page for your full model number, Serial Number or Dell Service tag. While there make sure you have the latest BIOS, Chipset, Network, Sound, USB and all other drivers by comparing those posted for download with the version and date of the corresponding ones in the Device Manager.If that doesn't help then in Device Manager on Display device Driver tab choose Roll back, Uninstall (then restart to reinstall) or try another one previously installed at Device Manager>Display adapter>Driver>Update Driver>Browse>Let me pick.In addition there are steps here to specifically troubleshoot Sleep mode problems:http:\/\/www.makeuseof.com\/tag\/fix-windows-10-sle... What I do is go into Advanced Power options and set Display and Sleep to 1 minutes, Hibernate to 2 minutes, then after completing each step restart the PC and observe what happens for 3 minutes.Also did it previously work? Do you have a System Restore point from when it did?http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t...This may have been caused by Windows Updates. Check which Updates were installed right before the problem began, and if necessary uninstall them from Settings > Update & Security > Windows Update > Installed Update History.You can also try to roll back using System Restore to a point before this began: http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... Then if an Update reinstalls and causes the same problem uninstall or roll it back again, then immediately hide it using the Hide Updates tool from Method Two here:https:\/\/www.askvg.com\/fixing-windows-10-automat... If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1903 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Inconsistent date formats        Generally dates are shown in Australian format, but when SEARCH (Cortana ?) reports a file, the date of latest modification it shows is in American date format. Can that be 'aligned' ?","solutions":["Hi JosephPHILIPPA, Generally Cortana takes on the settings set in Settings \/ Control Panel... Have a look at the below link, do all these settings align? https:\/\/www.tenforums.com\/tutorials\/73360-chang...DISCLAIMER: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Both Settings and Control Panel are set to Australian, yet SEARCH\/CORTANA shows American format."]},{"symptom":"Error 1719: Windows installer service could not be accessed        Dear All,i am trying to install Gnu Octave in my computer using Windows 7 (64-bit) for the purpose of learning (self-study, and practical issues). however, it does not see JRE, that was installed, earlier, as a part of Java JDK (v. 12).now, i tried to remove (delete) Java JDK in the Control Panel ..., however, i am receiving the Error message - \"Error 1719. The Windows Installer Service could not be accessed. This can occur if the Windows Installer is not correctly installed. Contact you support perconnel for assistance\".i had not had such problems before. is that associated somehow with the fact that Microsoft will stop a support of Windows 7 in, about, one week ?if the answer is \"no\", then i would appreciate someone's help to resolve the technical problem associated with the message (Error 1719 ...) mentioned above.Thank you.","solutions":[]},{"symptom":"Error state        My Canon TS3100 is not communicating with my computer. Says \"Error state\". What do I do to fix it?","solutions":["If this is after an update try just reinstalling the printer.","Hi Barbara, You may need to identify the error number and check this article for possible fix.https:\/\/ugp01.c-ij.com\/ij\/webmanual\/Manual\/All\/...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]}]}