{"windows":[{"symptom":"Your Windows license will expire soon        My window product id 00331-10000-00001-AA322 is going to expire on 16 Jan 2018 and want a product key how can I found my product key?*Modified title for accuracy**Original title: My window product id 00331-10000-00001-AA322 is going to expire on 16 Jan 2018 and want a product key how can I found my product key?*","solutions":["Hello,First, check the type of license installed on your system.1. Open administrative Command Prompt.2. Type slmgr \/dlv and press Enter key.3. Note the Product Key Channel section Windows Script Host box:If it mentions OEM <method>, you’ve OEM license installed.If it says Retail, you’ve retail license installed.If it mentions GVLK, VOLUME_<method> then you’ve volume license installed. Note that GVLK stands for Generic Volume License Key.---------Retail license users facing this issue, run Activation troubleshooter:https:\/\/support.microsoft.com\/en-in\/help\/20527\/windows-10-activation-troubleshooterContact Microsoft Support or license vendor, if issue still persists.In case if it reports that you've volume license installed, then it is not a valid license to be used by end users (correct me, if your system is part of organization). In this case, you need to buy genuine license for your Windows 10.Hope this helps!"]},{"symptom":"no place to imsert cd        I just purchased a HP Laptop and do not have a slot or place to insert a cd I have tried all the fixes I could find can someone give me some insight to this problem ?  Thank you. ","solutions":["Hello ELLENBROWN1, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemI'm not sure if you mean hardware or software. What is your laptop model to begin with?Do you mean that there's no physical place to insert the CD in your laptop? it could be that your laptop is built without CD player, since most of the new laptops comes without a CD-Rom.Feel free to ask back any questions and let us know how it goes. Cheers! Farah"]},{"symptom":"Win 10 Edge and Feedback Hub will not connect to Internet        Hi - Just recently updated to Win 10 Pro - all ok.All my existing browsers (Chrome and Firefox) access the internet OK - as does the Windows Update.However, MS Edge and the Feedback Hub refuse to access the net.I can access my MS Account through my legacy browsers but if I try and provide feedback through the new utilities such as the Feedvback Hub - it again states it cannot access my MS Account. \"Something has gone wrong\" states the message.I have tried the various \"File Integrity\" scripts that some forum suggest - but they do not detect any problem.I have tried turning off the AV and Firewall - but makes no difference.My DNS Client is running - which has also been mentioned in some forum - so n go there.Any ideas greatly received.CheersBrian","solutions":["Hi BrianCox4B and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Tried these already - no luck.Have also changed Network adapter from Public to Private and back again.I have messed with various Services I can log on to my MS account through Chrome etc - but it is almost as if there is something stopping the Win 10 specific stuff connecting - including the Feedback Hub that it opens because the Edge fails -- but that fails too!Brian","So a bit more experimenting - I have updated the Network adapter driver - it passes the Network Troubleshooter tests.I can log in to MS Account through Chrome and Windows update working okBut if I try to log in to MS Account through Edge or \"Your Info\" under \"Accounts\" it simply says \"Something went wrong\" no error code.So - I suspect the problem is linked to the inability to log in to a MS Acount through Win 10.Still no closer to finding the solution - help please!","Hi BrianCox4B, I would suggest you do a repair using the in-place upgrade. https:\/\/www.kapilarya.com\/how-to-repair-windows...let me know how it goes. Thanks! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","So a bit more experimenting - I have updated the Network adapter driver - it passes the Network Troubleshooter tests.I can log in to MS Account through Chrome and Windows update working okBut if I try to log in to MS Account through Edge or \"Your Info\" under \"Accounts\" it simply says \"Something went wrong\" no error code.So - I suspect the problem is linked to the inability to log in to a MS Acount through Win 10.Still no closer to finding the solution - help please!Also - I have come at the MS Account from the other direction.I logged on to the MS Account page through Chrome. Chose Add a Device \/ PC \/ Windows - this could not find my PC! So there is a disconnect somewhere in the state of Dennark! ","Thanks for your answer, worked for me.","Hi BrianCox4B, Have you tried resetting your network connectivity? Open CMD [administrator mode] type the following. ipconfig \/release <Press Enter> ipconfig \/renew <Press Enter> ipconfig \/flushdns <Press Enter> ipconfig \/registerdns <Press Enter> nbtstat -rr <Press Enter> netsh int ip reset all <Press Enter> netsh winsock reset <Press Enter> Restart PC. Thanks!","Thanks for these - all ran ok - but did not change the situation.","Hi BrianCox4B, I back read our conversation and notice that you have not conducted an in-place upgrade.I would suggest you do a repair using the in-place upgrade. https:\/\/www.kapilarya.com\/how-to-repair-windows...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"top of screen cut off        almost the top of the screen is cut off, I can just make out the bottom of the site I'm at and the X to delete it, so its not a super big deal, but still??. I've tried  the double click at top, tried the CTR+SHIFT+WIN+B combo that didn't work, tried turning off and restarting again, that didn't work, really not all that good with computers to start with so it's really hard for me. Also does any one know why I can't get my computer to recognize my LG soundbar, no longer have the option to set it as default so it doesn't work with PC, works fine with TV and Toslink cable.","solutions":["Hi there, my names Matt.It sounds like your screen issue may come down to the resolution being incorrect. On the desktop if you right click and go to Display Settings. then scroll down to resolution, you should see a drop down menu. Click on the menu and preferably use the recommended setting, but do try other resolutions. If none are correct then check the windows updates and see if there is a display driver to download.please let me know if this is helpful at all. Thanks :) .","Thanks for getting in touch with me, it takes me a while to respond to things since typically I don't generally get on the computer until the weekends.  I did what you suggested, and used what the recommended resolution was at 100% that didn't work and I am not good enough with these things to try anything fancy. The thing is it's like only a quarter of an inch is whats missing, and i tried to shrink the page, but since I can't see what that double arrow icon is doing I have to minimize it and now I can see the arrow and shrink it a bit, but of course when I maximize it , it goes back the same, its not the biggest deal since I can just make out the very bottom of what is on the tab up there specially the X to delete something, but still! I have played around with that double arrow icon when it is in full screen but can't get it to cooperate. what is more important though is one time we can chat about why my PC doesn't recognize my LG soundbar!!"]},{"symptom":"Windows store freezes and keeps loading forever in \"Downloads\"        When i click install\/update\/get updates the store freezes and in the \"Downloads\" part it keeps loading","solutions":["it just keeps loading","Hello SuixideThoughts, I am Andrew an independent advisor. What may be your issue is the store needs to be reset and repaired. To do this open the Settings menu, WINKEY+I is the fastest method. Open the APPS and find Store. You can right click it and choose to REPAIR the store. Once this has been completed reboot the computer and try again. Let us know if this has worked for you.Take Care, Andrew"]},{"symptom":"IGCCTray.Exe Error Message of Intel Graphic Driver        Hello, Microsoft. I face an annoying Error Message Missing IGCCTray.exe in WindowApps folder . It is very annoying.Can Microsoft Expert advice me to fix this issue? Error Message Appear:\"Windows Cannot find 'C:\\Program File\\WindowsApps\\AppUp.IntelGraphicsExperience_1.100.17250.0_x64_......\\IGCCTray.exe\"Make Sure you typed the name correctly , and then try again. Best Regards,","solutions":["Hi solidaritysarat, I am glad that error is now gone . ..","Hi solidaritysarat Have you tried re-installing your Intel HD Graphics device driver from the support page for your PC on the Manufacturers website, that should resolve this for you . . .If not, open Device Manager (accessible by right clicking your Start Button) Expand the Display Adapters section What is the exact Model of Intel HD graphics on your PC?"]},{"symptom":"i purchased a second hand laptop from ebay        it says my windows 10 is not active error code 0xc004f74 could i get some help please","solutions":["Hi Ross, unfortunately this error say the seller did not remove his corporate Windows license. You need to use correct license. Please check if Windows was preinstalled by manufacturer. Run a built-in commandwmic path softwarelicensingservice get OA3xOriginalProductKey (need to be run from Windows PowerShell (administrator). If it will show 25-digit product key, ask manufacturer about Windows edition and reinstall Windows according license.Otherwise ask manufacturer's support about preinstalled OS.","If I acquired a used computer, no matter how I got it or who previously owned it --even if it was  a relative or close friend--the first thing I would do with it would be to reinstall the operating system cleanly. You have no idea how the computer has been maintained, what has been installed  incorrectly, what is missing, what viruses and spyware there may be, etc. I wouldn't want to live with somebody else's mistakes and problems, possibility of kiddy p00rn, etc., and I wouldn't recommend that anyone else do so either.Your choice of course, but in my view, you're playing with fire if you don't reinstall Windows cleanly."]},{"symptom":"passwords just to use YOUR OWN office!!!        In Windows 7 and b4 we only needed a password when using a WEBSITE.  to my disgust I'm having to put in a password just to open MY OWN OFFICE.  Surely this isn't needed. PLEASE TELL ME ITS NOT NEEDED.","solutions":["Hello MarleysGhost, I'm Didi, an independent advisor. Can you please tell me exactly what you mean by your own office so we can help you better ?Are you talking about the Microsoft software Office which contains Word, Excel, Powerpoint and other elements or are you talking about something else ?Regards, Didi"]},{"symptom":"Emails        I have just purchased a new Acer laptop with Windows 10. Although I can send emails, it is not receiving any.  What is the problem?","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.It’s likely an issue with the setting on your mail account, you would need to contact your provider to obtain the correct details and then check these against what has been set in the mail app.This guide provides details on how to do that: https:\/\/www.dummies.com\/computers\/pcs\/change-ac...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","* Merged thank you Rossmcbain for your reply.  I have followed all your instructions but the Mailbox is still saying ‘Nothing arrived yet’.  Dont quite know what to do next.Abigael12","Considering the amount of detail in your question, nobody knows what the problem is ... we can only guess what the problemmight be.So here's my guess: Your outgoing mail settings are incorrect or altogether absent. Your email service provider has detailed instructions on the proper settings for outgoing mail.","Considering the amount of detail in your question, nobody knows what the problem is ... we can only guess what the problemmight be.So here's my guess: Your outgoing mail settings are incorrect or altogether absent. Your email service provider has detailed instructions on the proper settings for outgoing mail.No, its not my outgoing mail that is the problem.  Ive already checked if I can send mail and it is ok.  Its my incoming mail that is the problem.  My mailbox is saying ‘Nothing has arrived yet’...whatever that means??","Just in case you're confused, let me point out the settings for  the incoming mail server and the outgoing mail server are different. If the mail you are sending is received, the outgoing settings are correct. Please check the settings for the incoming mail server very carefully; there is very likely an error there."]},{"symptom":"Windows 10 pro local networking        ....I can see shared folders but cannot access them on my local ethernet network","solutions":["Hi dbieber, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Please, check if you have applied all the configuration suggestions indicated in this official link.https:\/\/support.microsoft.com\/en-us\/help\/409269...This is a detailed article of the steps to follow, taking into account the permissions, it is a website managed by a Windows MVP, it is verified informationhttps:\/\/www.thewindowsclub.com\/share-files-and-...Let me know if you have something else that I can help you with, I'd be happy to help.Regards, Marc M. Have a nice day Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi Marc and many thanks for the reply.I've done it all!Uninstalled Mcafee on both PCs.Following set to automatic:-Function Discovery Provider HostFunction Discovery Resource PublicationSSDP DiscoveryUPnP Device HostRemove ipv6 from both ethernet adapters,Ticked every darned thing with allow file and printer sharing on both PCs.Password protection off.Tried re-setting both PC networks with discovery selected.Even tried this trick from a guy on youtube:-regedit\/localmachine\\system\\currentcontrolset\\services\\lanmanworkstation\\parameters add (regdword32)AllowinsecureguestAuth   set hex 1Still the same.Can see all the folders on both networks but still getting windows cannot access files.If had any hair I'd tear it out.  Windows 10 pro 1909 ver.Dave","Hi, I fully understand your situation, seeing that you have executed several additional steps to those that I suggested and the problem persists, I will release the question so that another expert brings new ideas, have a great dayRegards","Hi, Are these shared folders on the same network? Is it a domain environment or a work group? Have you had access to them before? You might not have permissions to view it and your account might need granting permissions by the network shares owner.","Hi Mobyd33,Many thanks for your reply,Apart from the fixes I tried in my first message i.e Function Discovery Provider HostFunction Discovery Resource PublicationSSDP DiscoveryUPnP Device HostRemove ipv6 from both ethernet adapters,Ticked every darned thing with allow file and printer sharing on both PCs.Password protection off.Tried re-setting both PC networks with discovery selected.Even tried this trick from a guy on youtube:-regedit\/localmachine\\system\\currentcontrolset\\services\\lanmanworkstation\\parameters add (regdword32)AllowinsecureguestAuth   set hex 1I have also checked TCP netbioshelper autoadapter TCIP Ipv4 obtain Ip auto  defaultgrp editor  windows settings\/local pol\/security\/send LM +NLTM grp editor computer config\/admin\/network\/lanman workstatn\/ enable insecure guest logon set to enable.Private file folder sharing ,no password (ALL) both PCs show homeworkgroup.I can see all the 'shared' folders from each named PC on the other PC but cannot open them to see files with windows message...you do not have permission   etc. etc. contact administrator.I am not a computer geek, bu have tried every trick that i could find on youtube as shown above. This is ridiculously complicated and  never had any problems networking with Windows XP or Windows 7....","Has ANYONE ever solved this problem?I have been chasing my tail for about a month, and I have yet to find any set of instructions to fix the problem.Surely someone at Microsoft has a solution other than to try a unix operating system.  If I sound sarcastic, I am!  I have been a MS user since before most folks were born and was amazed with Windows 3.1.  I've been upgrading ever since and Win 10 has got to be the worst OS MS has ever created.Please, can someone help me setup a Local Area Network, using a NetGear (hardwired and WIFI) router to share files and folders, just like I did in Win 7?Thanks for ANY input.","Condolences Patrick.Same here. I was using MSDOS for a year before W 3.1 arrived.It really is typical and very unsatisfactory that after , what is it?, three years or more, it is still unresolved.Support ending for W7 so I bit the bullet and installed W10 on my three computers, because I read that W10 is officially MS final operating system.Do their people not understand that most purchasers of their product are not software specialists?The silence is deafening.","Hmmm … still no response from MS.I am a member of several hobby type forums where I get useful info, and feedback on my posts.  This being my second (first is above) post on a Microsoft forum, I guess I sort of expected it to be similar.  WRONG!In browsing around the different forums here it appears that unless the subject stays at the top, there are no responses.  Themodus operandi seems to be if ignored long enough the issue will go away. I intend to keep requesting assistance to keep this thread at the top of the Windows 10\/ Network & Internet forum until somebody from Microsoft addresses the issue.  It's obviously a Win 10 software issue, and the manufacturer of the software should be able to provide an answer.Why am i unable to share files and folders on my local area network on Windows 10 when the machines are visible, but inaccessible?Thank you for ANY response ...","Sad isn't it.All those billions and they can't be bothered to get involved.At the risk of repeating myself,I can see all the folders on each PC (which I have marked as share with everybody) , but the only folders I can access are those in the Public area.","Still trying to get an answer …I've been cruising the Network & Internet Forum of the MICROSOFT  Windows 10 Community forums.  I am amazed at the number of individual threads that have similar problems with Win 10 networking.  What is even more amazing is the number of zero (0) helpful comments. Beyond those two observations, the seemingly total lack of Microsoft employee comments is unexplainable. Lots of independent advisors and MVP members try to assist, but NO Microsoft employees try to assist their paying customers.So, I am trying to set up a Private LAN with two computers hardwired to my Netgear router, and two laptops using WiFi.  The computers can see each other, but I received inaccessible errors when I try to access any shared folders\/files.  I have been through all of the suggested Windows Control Panel and Settings (multiple times) to attempt to fix it, but nothing helps.  I have also tried many of the on-line suggested fixes with negative results. Can anyone from Microsoft help me?I would suggest that one solution to fix most of the problems in these threads is to put HomeGroup back into Win 10. There are still millions of Windows users who do not wish to place Documents\/Spreadsheets\/databases, etc. on the Cloud, because of a desire to keep sensitive information private on their Home networks.  Please help them all by simply adding HomeGroup  in the next Win10 revision.Thanks, and I welcome any assistance from Microsoft."]},{"symptom":"Windows 10 1909 File Explorer Search issue        What happened to explorer search? Unable to paste the copiedfile name to search for as it was in previous versions. I have tomanually type the file name and press Enter. This is terrible!Why does Microsoft only make things worse with each new version ?!","solutions":["Hi Human Greetings! I am Vijay, an Independent Advisor. Restart Windows Explorer Windows Key+X Click Task Manager Head to Processes tab and select Windows Explorer Right click > Click Restart","Thank you for your reply. I did it several times. Nothing changes.Because of this problem, I must return to version 1903. For my work, searching in Explorer is a very necessary function.But Microsoft ruined everything as always!","Please work with other experts on this. Somebody will respond to you who has better understanding of this issue.Please ignore my previous suggestions.","What happened to explorer search? Unable to paste the copiedfile name to search for as it was in previous versions. I have tomanually type the file name and press Enter. This is terrible!Why does Microsoft only make things worse with each new version ?!I have the exact same problem: When I right-click on the explorer search box I get nothing, No paste no copy. All I get when I click is the history of my past search words that I cannot even delete!Right-click paste in explorer search box is an essential feature and it would be really silly to take it away.","Same problem here. But you can still use Ctrl-V to paste into search. Although I keep having to go into Task Manager and restart Windows Explorer periodically. This is a really annoying Version 1909 bug.","I had to return to version 1903 too, 'cos of that. It is insane idea to remove paste into searchexplorer window with right click menu. Please MS restore this ability, unless it's a BUG !!!","What happened to explorer search? Unable to paste the copiedfile name to search for as it was in previous versions. I have tomanually type the file name and press Enter. This is terrible!Why does Microsoft only make things worse with each new version ?!I have the exact same problem: When I right-click on the explorer search box I get nothing, No paste no copy. All I get when I click is the history of my past search words that I cannot even delete!Right-click paste in explorer search box is an essential feature and it would be really silly to take it away.Also, when using Control-V to paste, File Explorer search box stops working after a few searches (you can't even access it to type).",">>  Also, when using Control-V to paste, File Explorer search box stops working after a few searches (you can't even access it to type).The workaround for that is to restart Windows Explorer from Task Manager.","Ah, another Microsoft \"improvement\".  In this case it actually makes the search worse.  Is there a way to disable this new unified search and get the old functionality back?  All I need is a way to search files in the current folder and its sub-folders.   That's it.For me the search box just becomes inaccessible after some time.  Yes, restarting file explorer fixes it. ","What happened to explorer search? Unable to paste the copiedfile name to search for as it was in previous versions. I have tomanually type the file name and press Enter. This is terrible!Why does Microsoft only make things worse with each new version ?!I have the same problem you cannot paste into the search in Windows Explorer. Plus you cannot clear the results if you manually type something in. You have to close the window and start over. Huge bug!!!! Please fix I use this all the time on 10 different systems and this has extremely impacted my work. We are frantically blocking the upgrade in GPO on 5,000 machines!!!! Microsoft please fix ASAP!!!!"]},{"symptom":"Can't change taskbar color in Windows 10        So the problem is that under \"Personalisation\" --> \"Colours\" the option to \"Show the accent colour on the following surfaces\" for \"Start, taskbar and action center\" is greyed out for some reason.Whatever colors I change, it will not apply to start, taskbar, and action center and they will stay in their default light grey color.EDIT: I just figured out that if I change the theme back to \"Windows\" then it will give me the option to change the color of the taskbar. However, once I select a different theme, that option is once more greyed out.","solutions":["Hi Zaid You must have received version 1903 of Windows 10, you cannot change the Taskbar color in the new Windows 10 light themeGo to Settings - Personalization - Colors Set Windows default mode to Custom That should enable you to charge the taskbar color, regardless of whether you set App Mode to light or darkPlease Note, there is another setting you may also like and be unaware of in 1903For each app, you can now set them individually to light or dark mode - in Settings go to Apps, select an app and choose Advanced Settings, you will find that option there . . ."]},{"symptom":"How to set up pop3 email in Windows 10?        I have been trying for so many hours to set up my pop3 email in windows 10 but without success.  Can someone help me on this please?  What should I put in Incoming server and outgoing server boxes?  * Moved from msn","solutions":["Previously, I was using Windows 7 until my hard disk crashed.  I had to use a new computer installed with windows 10.","Contact your e-mail provider or look an their web site to find the names of their servers.Also are you using the built-in Windows 10 e-mail program? If so, let me point out that there are many other choices of e-mail program, some by Microsoft, some by third-parties, some for sale,  some free. My personal opinion is that the built-in Windows 10 e-mail program is one of the worst choices available. There are many better choices."]},{"symptom":"Get Started\/Tips app        where is this app ?","solutions":["Hello pauljones, my name is Farah and I'm an Independent Adviser. I can help you regarding this problema direct link to the app can be found here: https:\/\/support.microsoft.com\/en-us\/help\/4027049\/Cheers! Farah"]},{"symptom":"Virtual Memory        What is the recommended Virtual Memory for my laptop?https:\/\/1drv.ms\/t\/s!ApFhXMFCkw0wiARdOisNu01fep5C?e=Tg8mgYhttps:\/\/prnt.sc\/qj9xpb Please tell.....Thanks & Regards,Regal76","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Windows will automatically adjust the size of your virtual memory depending on your usage, if you select the automatically adjust option as shown in your last screenshot.Regards, Ross","What is recommended is for you to leave it alone, and let Windows make the decision."]},{"symptom":"Realtek Audio Line In (blue) detected as Microphone, Breaks Audio and Forces System Restore to Fix        With the newest iterations of Windows 10 my onboard Realtek HD Audio \"Line In\" input (blue 3.5mm audio input) is detected as a microphone. I know this because of the Microphone icon appears in the tray when I plug it in and disappears when I unplug it. I have NO microphone plugged into my PC at all. I use the audio input to listen to my stereo receiver (mainly LPs) while computing. The sound outputs via my NVidia RTX2070 HDMI High Definition Audio to my monitor which has a soundbar attached via optical. This setup worked flawlessly until recent Windows 10 updates introduced the microphone always on with the icon feature. The blue 3.5mm onboard Realtek HD Audio Input is the only Realtek input\/output port in use. No microphone is plugged into either rear or front (pink) microphone input port. With this new \"microphone\" situation, any website browsed to can activate the microphone (which I don't have as stated). One site of note is Netflix. If I go to one of these sites that wants to activate my microphone (that I don't have):1) my display blacks out for a second, then comes back on with a notification that the site has accessed my microphone.2) my music that I was playing through my Realtek Audio Line In goes silent. From that point on I cannot get my Audio In music to play through my soundbar. The Audio Line In is working because the audio meter in the Sound settings is still pulsing. No reboots nor enabling and disabling Sound settings can get the \"Line In\" sound playing back to the soundbar. System sounds and web site videos can still be heard. Essentially a microphone (that I don't have) event breaks the Line In audio from being \"heard\" from that point on. The only way I have figured to get the ability to hear my receiver on my PC out to my soundbar is to run System Restore to my last restore point. Is there a workaround? The blue Realtek Audio Line In should not be detected as a microphone and utilized as such. This needs to be fixed ASAP!","solutions":["Hi LS. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Type Control Panel in Start Search, open CP as Admin, choose Devices and Printers, right click the stereo to Troubleshoot. If that doesn't help then right click to Remove, restart PC to reinstall the Device (hopefully correctly).I'll give you all possible solutions for Sound problems in order of priority, so please try any you've already tried again in order. If you have any problems performing any steps I'll be standing by here to help you.1) Update the sound driver from the PC or device maker's Support Downloads webpage for your exact model, if it is newer than the one presently installed in Device Manager reached by right clicking the Start button. While there compare to make sure you also have the latest BIOS, Chipset, Display, Network and all other drivers. 2) Restore the Windows Audio Service which may have become disabled: https:\/\/www.tenforums.com\/tutorials\/57567-resto... 3) Next try these checklists: https:\/\/support.microsoft.com\/en-in\/help\/402699... https:\/\/www.howtogeek.com\/443702\/how-to-fix-sou...4) Right click Volume icon in System Tray, choose Sound Settings, from the Output and Input devices dropdown menus, choose then one(s) affected to see if that helps. If not use the Troubleshoot button nearby.5) Run the Playing Sound troubleshooter at Start button > Settings>Update & Security>Troubleshoot.6) Try rolling back the sound drivers in Device Manager reached by right clicking the Start button. Choose Sound controller and other audio devices, then Driver tab, then Roll back if available.7) If no newer sound drivers then uninstall the one presently installed in Device Manager, reached by right clicking the Start Button. Restart PC to reinstall.8) Try other and older drivers for your model Sound controller, too. For example, try the next oldest driver in the model's online Support Downloads list. To try all previous drivers installed on your system, in Device Manager choose Sound controller's Driver tab, then Update Driver, then Browse, then Let Me Pick. Finally, try installing the latest Sound driver in Compatibility Mode as shown here:https:\/\/social.technet.microsoft.com\/Forums\/win...9) If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 10) If this was caused by a Version update (which you can confirm at Settings > System > About) then you can roll back the version in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 11) You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... 12) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. 13) If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... 14 If you want to report this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems.If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it. If you are an Insider I can also vote it up with my MVP badge and track the issue for you.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I found a workaround, but the big concern for me (and I'm sure others) is the recent addition of the microphone feature in Windows 10. It's a huge invasion of privacy concern. Prior to this addition, I never had a website just simply activate my non-existent microphone on my Desktop PC. I can disable the microphone option in Windows 10, but doing that also disables my Realtek Audio Line In jack. That's just plain crazy!My workaround was to locate a spare headphone with microphone jack and plug that microphone jack into my Realtek \"microphone\" input and mute it via the switch on the headphone cord. Windows 10 recognizes the headphone connection and I set it to \"Default Communications Device\" in the Sound settings. Meanwhile the audio \"Line In\" is also set as \"Default Device\". Now websites try to access my muted unused microphone rather than making Windows 10 break my audio \"line in\"."]},{"symptom":"Possible 1909 issue: Computer Freezing Up After Being Idle For A Certain Amount Of Time        Disclaimer: I'm not technically sure if this is due to 1909 or a program that installed.When i first upgraded to to 1909 last month, it was working perfectly fine and had no problem, however in recent days i've been deeling with a very annoying problem that that the computer would freeze up when its idle for a certain ammount of time (at first It only happened while being idle), but know sometimes even freezes up while you're working on it, or even trying to reinstall Windows 10 through the Media Creation Tool.Not sure what's causing this issue and not quite sure if its a issue due to the 1909 upgrade or due to a program, i installed. At first i thought it was due to the fact that i had both AVG and Avast installed so i uninstalled those programs, it was fine for a few days but then the freezing started up again.Not sure what i can do to resolve this issue, i'm trying everything i can do, but even when i'm trying to reinstall the Windows 10 1909 upgrade through the media creation tool it actually freezes up because it thinks its \"idle\" even though its actively doing something.It's quite annoying where once it freezes up you can't do anything, the only thing you can do is turn it off by pressing the power button. Has anyone else had a similar problem where after you upgraded to 1909 your computer constantly freezes up after being idle for a certain amount of time?Thanks in advance,Bryan","solutions":["Hi Bryan. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Guardian Moderator here to help you.1) The fact you had two of the worst AV's (recommended by no experts for ten years) installed makes it doubly important you run their uninstaller tools to make sure you got all of their mess out:http:\/\/www.avast.com\/en-us\/uninstall-utilityhttp:\/\/www.avg.com\/us-en\/utilitiesThen type Security in Start Search, open Windows Defender Settings, there and in Windows Defender Security Center fix anything that's flagged.If you want the best on-demand scanner download and install Malwarebytes from https:\/\/www.malwarebytes.com\/mwb-download\/ In it's Settings > Protection > Scan Options enable Scan for Rootkits. Then on Scan tab choose Threat Scan and Run Scan. Clean up anything found, restart PC and then run again until it comes up clean. If you want to keep Malwarebytes as an on-demand scanner then you can disable its Real Time trial version in it's Settings > Accounts tab.Next check for damaged System Files: https:\/\/www.lifewire.com\/how-to-use-sfc-scannow... If it cannot repair them see Step 10 here to continue: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... 2) Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.3) If problems persist go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. -------------------------------------------- But remember that in Windows 10 everything depends upon the quality of the install, and Factory or Upgrade installs are inferior installs which most enthusiasts won't even run because they'd expect endless issues. Consider now or later doing the Clean Install in this link which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... There is also an automated Fresh Start that reinstalls WIndows while shedding corrupting factory bloatware, saves your files, but doesn't clear the drive to get it cleanest:https:\/\/www.howtogeek.com\/265054\/how-to-easily-... I hope this helps. Feel free to ask back any questions and let us know how it goes. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Sorry, not quite sure im going to take your reply seriously when you start with negative answer by calling AVG and Avast \" the worst\".AVG and Avast are very good antivirusSeems like you so-called \"experts\" only endorse Windows Defender which in my opinion is too aggressive. When it comes to antivirus programs I always avoid Windows Defender and disable it.Now it seems like you didn't actually read my question fully, if you did you would know I had already uninstalled them due concerns that they might causing the problem. However, it seems that AVG and Avast have nothing to do with the problem because they are no longer on my computer at the moment and yet the freezing still persists. Hi Bryan. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Guardian Moderator here to help you.1) The fact you had two of the worst AV's (recommended by no experts for ten years) installed makes it doubly important you run their uninstaller tools to make sure you got all of their mess out:http:\/\/www.avast.com\/en-us\/uninstall-utilityhttp:\/\/www.avg.com\/us-en\/utilitiesThen type Security in Start Search, open Windows Defender Settings, there and in Windows Defender Security Center fix anything that's flagged.If you want the best on-demand scanner download and install Malwarebytes from https:\/\/www.malwarebytes.com\/mwb-download\/ In it's Settings > Protection > Scan Options enable Scan for Rootkits. Then on Scan tab choose Threat Scan and Run Scan. Clean up anything found, restart PC and then run again until it comes up clean. If you want to keep Malwarebytes as an on-demand scanner then you can disable its Real Time trial version in it's Settings > Accounts tab.Next check for damaged System Files: https:\/\/www.lifewire.com\/how-to-use-sfc-scannow... If it cannot repair them see Step 10 here to continue: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... 2) Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.3) If problems persist go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. -------------------------------------------- But remember that in Windows 10 everything depends upon the quality of the install, and Factory or Upgrade installs are inferior installs which most enthusiasts won't even run because they'd expect endless issues. Consider now or later doing the Clean Install in this link which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... There is also an automated Fresh Start that reinstalls WIndows while shedding corrupting factory bloatware, saves your files, but doesn't clear the drive to get it cleanest:https:\/\/www.howtogeek.com\/265054\/how-to-easily-... I hope this helps. Feel free to ask back any questions and let us know how it goes. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I will not debate you about the unanimous opinion of every expert in forums, where we see tens of thousands of cases so have a broader perspective than anyone else in tech support. The experts I'm referring to also have the highest award in the tech field, and are awarded this for our independence. I specifically stated that if you only uninstalled those Antiviruses that you still needed to run their removal tools which I provided. So I was clearly aware of what you had already done.I also gave you a series of other steps to try which would have found and fixed the problem if you had done the work.I will help anyone who is polite and cooperative for as long as it takes to get the problem fixed. If you want to work with me then proceed with the steps I gave. If not I'll release the thread from the elevated track. Let me know what you want to do,Greg Carmack Senior Moderator Senior Windows MVP","Bwahahahwa every \"unaminous opinion\" of so-called \"experts\" that are paid by Windows.Again, if you had read the the rest of my question you would know AVG and Avast are completely uninstalled from my computer, yet the freezing persists. So, i know the problem has nothing to do with either Avast or AVG.I will not debate you about the unanimous opinion of every expert in forums, where we see tens of thousands of cases so have a broader perspective than anyone else in tech support. The experts I'm referring to also have the highest award in the tech field, and are awarded this for our independence. I specifically stated that if you only uninstalled those Antiviruses that you still needed to run their removal tools which I provided. So I was clearly aware of what you had already done.I also gave you a series of other steps to try which would have found and fixed the problem if you had done the work.I will help anyone who is polite and cooperative for as long as it takes to get the problem fixed. If you want to work with me then proceed with the steps I gave. If not I'll release the thread from the elevated track. Let me know what you want to do,Greg Carmack Senior Moderator Senior Windows MVP","My response:  is to post the question again, free for your influence, because you aren't helping by the way.You're attitude was negative at the very beginning reply and then you threaten to \"release my question from thread from the elevate track\".https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-performance\/possible-1909-issue-computer-freezing-up-after\/0e26586e-b398-4778-8933-7717be55af30?tm=1576073899227I will not debate you about the unanimous opinion of every expert in forums, where we see tens of thousands of cases so have a broader perspective than anyone else in tech support. The experts I'm referring to also have the highest award in the tech field, and are awarded this for our independence. I specifically stated that if you only uninstalled those Antiviruses that you still needed to run their removal tools which I provided. So I was clearly aware of what you had already done.I also gave you a series of other steps to try which would have found and fixed the problem if you had done the work.I will help anyone who is polite and cooperative for as long as it takes to get the problem fixed. If you want to work with me then proceed with the steps I gave. If not I'll release the thread from the elevated track. Let me know what you want to do,Greg Carmack Senior Moderator Senior Windows MVP","I used to run with AVG and Avast....had serious lockup issues and slow downs...Removed them both and it's 100% better.  Still didn't fix my locking up issue with the newest 1909 build that came down on 12\/10\/19. Malwarebytes slows me down a bit but nothing like AVG had done in the past.Bwahahahwa every \"unaminous opinion\" of so-called \"experts\" that are paid by Windows.Again, if you had read the the rest of my question you would know AVG and Avast are completely uninstalled from my computer, yet the freezing persists. So, i know the problem has nothing to do with either Avast or AVG.I will not debate you about the unanimous opinion of every expert in forums, where we see tens of thousands of cases so have a broader perspective than anyone else in tech support. The experts I'm referring to also have the highest award in the tech field, and are awarded this for our independence. I specifically stated that if you only uninstalled those Antiviruses that you still needed to run their removal tools which I provided. So I was clearly aware of what you had already done.I also gave you a series of other steps to try which would have found and fixed the problem if you had done the work.I will help anyone who is polite and cooperative for as long as it takes to get the problem fixed. If you want to work with me then proceed with the steps I gave. If not I'll release the thread from the elevated track. Let me know what you want to do,Greg Carmack Senior Moderator Senior Windows MVP","Again, AVG and Avast have nothing to do with the problem, because they are completely removed from my computer, yet the freezing still persists.Please stop blaming AVG and Avast for computer, seems like when anyone who mentions anything about an antivirus program that isn't Windows Defender you so-called windows \"experts\" who are paid by Windows automatically blame the third party application. I used to run with AVG and Avast....had serious lockup issues and slow downs...Removed them both and it's 100% better.  Still didn't fix my locking up issue with the newest 1909 build that came down on 12\/10\/19. Malwarebytes slows me down a bit but nothing like AVG had done in the past.Bwahahahwa every \"unaminous opinion\" of so-called \"experts\" that are paid by Windows.Again, if you had read the the rest of my question you would know AVG and Avast are completely uninstalled from my computer, yet the freezing persists. So, i know the problem has nothing to do with either Avast or AVG.I will not debate you about the unanimous opinion of every expert in forums, where we see tens of thousands of cases so have a broader perspective than anyone else in tech support. The experts I'm referring to also have the highest award in the tech field, and are awarded this for our independence. I specifically stated that if you only uninstalled those Antiviruses that you still needed to run their removal tools which I provided. So I was clearly aware of what you had already done.I also gave you a series of other steps to try which would have found and fixed the problem if you had done the work.I will help anyone who is polite and cooperative for as long as it takes to get the problem fixed. If you want to work with me then proceed with the steps I gave. If not I'll release the thread from the elevated track. Let me know what you want to do,Greg Carmack Senior Moderator Senior Windows MVP","I'm really tired with thisWindows 1909 and 1903 High CPU Usage and freezes for 5 minutes and release the control for second, and then freezes again and release the control for seconds.First with HP15 now with Lenovo ThinkPad X230Double check and other Lenovo's does not have Realtek Hardware, but in booth cases Lenovo ThinkPad X230 and HP15 has Realtek Drivers.Booth do the same freezes and work for seconds.Try to download several images from Windows VLSC Center, nothing, same problemI do not know if is some kind of pressure to put old hardware in the garbage and push to acquire new ones.Is ridiculous but Lenovo ThinkPad X201 works flawless with Windows 10 1909. (1st Gen of Intel Core i5) but the ThinkPad X230 (3rd Gen of Intel Core i7) does NOT WORK AT ALL","By The WayI have not installed any kind of AVG or Karspersky or AVAST, or any other than Microsoft Defender","Were you able to find a solution to this issue? Or has anyone found a solution to this? I'm having the same issue where my laptop would freeze randomly. I just bought my laptop (MSI GS63) about 8 months ago and now I can't use it properly. Ever since I updated my laptop to Windows 1903 that's when I'm starting to have the freezing issue."]},{"symptom":"password change        I'm having trouble changing my password","solutions":["I'm having trouble changing my password Would you like to tell us what password you are trying to change and exactly what trouble you're having? Otherwise people will try to guess.","Hi Artis, Is this for Windows 10 Account? If yes, please follow this article: https:\/\/www.laptopmag.com\/articles\/change-passw...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"network sharing \/ access        I've clicked and searched folders, explorer, sharing, users, advanced etc. and all I know to look at for hours. I can't access Jason at all, see this message. I can see the third computer and can access the \\\\users\\public folder - on it. His computer name is -2019 why it shows up as 201 is a mystery. Any help would be great. ","solutions":["Hi Mark. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Windows sharing has been broken ever since they removed Homegroup, causing many to believe this was intentional to push us to OneDrive sharing. More about that option later.I'll give you everything possible to try for file sharing problems so at least something will work. If you need help performing any steps I am standing by here to help:See here for how to share files and printers over network after removal of HomeGroup in Version 1803:https:\/\/www.windowscentral.com\/how-share-files-...https:\/\/www.tenforums.com\/tutorials\/111783-shar...https:\/\/www.windowscentral.com\/how-access-files...To troubleshoot sharing problems: https:\/\/www.lifewire.com\/troubleshooting-window...https:\/\/windowsunplugged.blog\/2018\/03\/27\/networ...https:\/\/www.thewindowsclub.com\/network-computer...https:\/\/superuser.com\/questions\/1202441\/windows...If you cannot get past the password protected sharing prompt: https:\/\/www.isunshare.com\/windows-10\/fix-enter-...https:\/\/www.speedguide.net\/faq\/windows-is-askin...https:\/\/www.tenforums.com\/network-sharing\/61689...If Windows 7 is involved make sure if applicable you have the WIndows Update released to fix Windows 7 sharing issues here:https:\/\/www.bleepingcomputer.com\/news\/microsoft... Test if turning off Controlled Folder access helps: https:\/\/www.thewindowsclub.com\/controlled-folde... See these additional resources for when a PC does not show up on network: http:\/\/woshub.com\/network-computers-not-showing...https:\/\/www.thewindowsclub.com\/network-computer...https:\/\/social.technet.microsoft.com\/Forums\/en-...You may want to change to sharing via OneDrive: https:\/\/www.computerworld.com\/article\/3256907\/m... Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... If you want to express your opinion on this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems. If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thanks for the quick response. That's a ton of content and I've seen and worked through a lot of it already. We'll see what works and be back in touch. I'm sure its just one simple thing. "]},{"symptom":"File Explorer 1909        1. If you use File Explorer to Open a document whose application has an Auto-Save feature and you leave File Explorer minimized then when the Auto-Save runs File Explorer will be hung.  At that point if you use Task Manager to Restart the system will hang part way through.2. The Search Tools are Not available when you click in the Search Box, you must enter your search and press Enter before the Search Tools are displayed.  Then when you select Current Folder nothing happens, the Search Box is disabled but if you click on the Blue Arrow and then on Current Folder again the Search Results will be updated.File Explorer 1909 is Not Ready for use.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand that you are seeing the changes with the Search tool and the Search feature in File Explorer. We would like to inform you that there are slight changes to certain features in Windows Explorer in the latest version (1909) of Windows 10, which optimizes the performance of the operating system. The Search ribbon option highlights itself when you type in the keyword and press Enter.  Regarding that Auto-Save feature hangs file explorer, we would like you to check the same issue on a new user account. Follow the steps from the articleCreate a local user or administrator account in Windows 10. However, we certainly appreciate your valuable feedback and suggestions based on your user experience. Hence, I suggest you to leave your ideas and suggestions in theFeedback Hub, which gives our developer team the opportunity to hear our users’ voice and see if it can be implemented in the future updates. Regards, Aditya RoyMicrosoft Community – Moderator"]}]}