{"windows":[{"symptom":"windows updates        HiI have had this problem for many weeks i keep getting a error 0x80070424and some times after I have updated my computer it says restart computer and after it has restarted it tells me to trouble shoot or shut down the computer.I have tried so many things from the internet with no luck.• Security Update for Microsoft Visual C++ 2008 Service Pack 1 Redistributable Package (KB2538243). Security Update for Microsoft Visual C++ 2010 Service Pack 1 Redistributable Package (KB2565063).Some updates that I cannot do.","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command promptDISM \/Online \/Cleanup-Image \/RestoreHealthRun these commands on the command prompt to restart windows update servicesnet stop bitsnet stop cryptsvcnet stop wuauservnet stop msiserverRen C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.old net start bitsnet start cryptsvcnet start wuauservnet start msiserverAfter successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartThis should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)"]},{"symptom":"Windows 7: Updates not downloading nor installing        Hello, I've recently done a security check of my laptop, and one of the identified issues is that Windows wasn't updated since September 2018. 55 important updates were identified, along with 59 optional ones.When I try to download these updates in the \"Windows Update\" section of my control panel, the download never appears to start. Something's running (there's an animation of something downloading), but progress remains at 0%. The only option I have is to abort the process.How can I upgrade?I have Windows 7 Home Premium. Thank you in advance for your help. ","solutions":[]},{"symptom":"Windows One Drive        I am new to Windows 10.  What is Windows One Drive?  Is it a back-up storage place like \"The Cloud?\"  If so, what all goes in to One Drive?  Are there instructions on how to use this and how to recover your info if you do have a system failure?  I am not very computer savvy so this is all new to me.  Thanks.","solutions":["Hello LanaLuhm, The details of what one drive is and how to use it can be found here: https:\/\/support.microsoft.com\/en-us\/help\/17184\/...","You can use this link to learn more about One Drive.https:\/\/support.office.com\/en-us\/onedrive","Here are a couple of videos with articles that are helpful:https:\/\/support.office.com\/en-us\/article\/back-up-your-documents-pictures-and-desktop-folders-with-onedrive-d61a7930-a6fb-4b95-b28a-6552e77c3057https:\/\/support.office.com\/en-us\/article\/save-disk-space-with-onedrive-files-on-demand-for-windows-10-0e6860d3-d9f3-4971-b321-7092438fb38e"]},{"symptom":"10 install        trying to install 10 over 7  error codeox8007042b-ox2000d","solutions":["Hello stevesumner1, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemHow did you start the upgrade? did you use the windows media creation tool? Please provide more info on the method used for the upgrade Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolvedCheers! Farah"]},{"symptom":"Pc is laggy, HDMI no longer working and display is blurry after factory reset.        Very recently I factory reset my pc, not because it had any lag, or major issues but just because I wanted to reset everything. After reseting and reinstalling windows I found that my pc was very choppy with frames, and lagging a lot more than it did before. Additionally when changing my monitor setting from VGA\/DVI to HDMI(what i normally use) the HDMI mode doesnt work, my monitor pops up with HDMI no signal. Also, everything is slightly blurry, im not entirely sure how to describe it other than that. I have tried uninstalling display driver and restarting.My pc specs:GPU - Radeon RX 460CPU - AMD FX 8350Motherboard - Asus M5A78L-M LX3","solutions":["Hi nijwons After you reset Windows, did you install a full set of device drivers on your system?Open Device Manager (accessible by right clicking your Start Menu) Are there any devices listed there with an exclamation mark beside them? Open Task Manager (Ctrl + Shift + Esc) Choose the Processes Tab When your system is laggy, is your hard drive, CPU, GPU or RAM at a very high percentage?","I did not install a full set of drivers (at least not intentionally) when I reset Windows.There are no exclamation marks in device manager.There is nothing at a very high percentage, my system just feels very choppy.Also, my PC is at a low resolution, and when I go to change the resolution the highest option is 1600 x 1200 which is a lot worse than before, which I think is causing the blurryness.  ","Hi nijwons The symptoms you describe that the device driver on your Radeon RX 460 is not installed correctly . . .When you reset or re-install Windows 10 it is best to manually install a full set of device drivers . . .Install this driver on your PC for the Radeon RX 460, then restart your PC, to see if that resolves the 'blurryness' . . .https:\/\/www.amd.com\/en\/support\/graphics\/radeon-...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","I've downloaded that, but when I run it I get the error \"Error 182 - AMD Installer cannot properly identify the AMD graphics hardware\""]},{"symptom":"trying to set up echo dot        I want to set up my new 3rd generation echo dot","solutions":["Hi hazels, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.See if the instructions shared by a Windows MVP help you configure it, I hope the information will helphttps:\/\/www.windowscentral.com\/using-amazon-ech...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Windows 10 maintenace        I am new to Windows 10.  In Windows 7, there were several things recommended be done at least monthly for maintenance.  They were:Running Sisk CleanupRunning Disk DefragmenterChecking for Hard Disc Drive ErrorsDelete Cookies, Delete Cache, Delete History FilesCheck for UpdatesReview the Start Menu to launch only needed applicationsI am wondering what I should be doing in Windows 10 for maintenance.  Do I do all of these things like in Windows 7?  If so, where do I find these things on my laptop.  Are there other things I should be doing as well? ","solutions":["Hello LanaLuhm, I'm Didi, an independent advisor. For maintenance and optimizing performance of your Windows 10 system I highly recommend you to check this great guide written by Greg Carmack, Windows MVP : Windows 10 Performance and Install Integrity Checklisthttps:\/\/answers.microsoft.com\/en-us\/windows\/for... Regards, Didi"]},{"symptom":"permanent problem - after BIOS->WINDOWS 10 logo->blue screen appeared        I upgraded my sister's laptop from Windows 7 to Windows 10 Home 1909 - 02 Jan 2020A DELL INSPIRON 5005 2012 MODEL4GB RAMUSB 2DVD writerthe problem iswhen finished upgrade laptop was OK --- sometimes has some restart problems[after BIOS->WINDOWS 10 logo->blue screen appeared] but this bypassed by forcefully shutdown [power on pressed 5-secs] and startupafter a few usages [Windows 10] now has the permanent problem after BIOS->WINDOWS 10 logo->blue screen appeared [Not the error light blue of windows 10] but a dark blue - may sthg with screen driversin any condition...Do you have any idea what is wrong??? Can I try boot from Windows 10 DVD 1909 and try a repair or anything in Safe Mode???","solutions":["Hi, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Was the Device listed as safe to update model on Dell website? Let us try repairing the existing OS. On a working computer, create an Installation media of Windows 10 that allows you to repair existing Windows Installation.Create a USB Flash Drive https:\/\/www.tenforums.com\/tutorials\/2376-create...Boot from the USB Flash drive-Make sure you have disabled Secure boot\/Fast boot in BIOS Settings.https:\/\/www.tenforums.com\/tutorials\/21756-boot-...https:\/\/www.tenforums.com\/tutorials\/21284-enabl...Then open Advanced Startup options after the computer boots from USB. Click Repair your computer at the first screen that says Install now.https:\/\/www.tenforums.com\/tutorials\/2294-boot-a...Select Startup repair, let it finish the job and see if the computer can boot afterward.If that doesn't help, consider doing a clean install after rescuing your files. Rescue Files when Windows won't start https:\/\/answers.microsoft.com\/en-us\/windows\/for...How to do a clean install https:\/\/answers.microsoft.com\/en-us\/insider\/for...https:\/\/answers.microsoft.com\/en-us\/windows\/for...Disclaimer: Tenforums is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","thank you for replyingcan instead of USB stick try to create an Installation media of Windows 10 on DVDDL-R \/ ISO in media creators tool burn-in DVDDL disk on a working PC???","Yes, you can use a dual-layer disk. A single layer, however, won't work as the ISO is >5GB in size.","I have disk 1903 but I will create now a new 1909 Windows 10 ISO... is this the preferred action?","Yes, I recommend creating a 1909 ISO. If some files are corrupt 1903 ISO won't be able to replace the same.","repair failed booted from win 10 DVD 1909DELL Notebook 5050 Not in supported notebooks for win 10 at https:\/\/www.dell.com\/support\/article\/us\/en\/04\/sln297954\/dell-computers-tested-for-windows-10-november-2019-update-and-previous-versions-of-windows-10?lang=ensystem restored two days after the update to win 10 >>> but the same problemonly option now Linux...?"]},{"symptom":"BSOD crashes after installing AMD GPU        I have been getting a lot of BSOD crashes when playing games, but I never got any of these crashes until I got a Red Devil RX 5700 XT GPU. I have gotten:ATTEMPTED WRITE TO READONLY MEMORYkmode_exception_not_handledIRQL NOT LESS OR EQUALAll of my drivers are up to date as well as the games I am playing. I ran the Windows Memory Diagnostic app and it said that nothing was wrong. Ive used DDU to clean up my graphics drivers (as I went from NVIDIA to AMD), and even did a clean install on windows. Here are my specs:OS Name: Microsoft Windows 10 HomeSystem Model: Z370XP SLIProcessor: Intel(R) Core(TM) i7-8700K CPU @ 3.70GHz, 3696 Mhz, 6 Core(s), 12 Logical Processor(s)BIOS Version\/Date: American Megatrends Inc. F5, 11\/9\/2017Installed Physical Memory (RAM): 16.0 GBGPU: Red Devil AMD Radeon RX 5700 XTRADEON Driver: 20.1.1PSU: EVGA 750 BQI am also attaching the minidump fileshttps:\/\/drive.google.com\/open?id=1wglpX8U2pkXyegDNqa5LwmwFydaQkT2hplease let me know if you need any more information Thank you. ","solutions":["Hey Brandon Evan here an independent adviser hopefully this will be useful advice. What I would do if I were you to use a different video card if possible to test. If you no longer get blue screens your new you is bad.The new card I suggest should be returned as It’s most likely faulty"]},{"symptom":"Unable to log into computer.        Hope all is well. I'm unable to log onto my laptop. When I turn my computer on and click the internet Icon to connect so I can use my password for entry (Microsoft requirement) the only option is given is airplane mode. I've tried using an Ethernet plugging it directly into the modem but it goes back to airplane mode. I click on the airplane mode but nothing happens. I am totally blocked out and unable to log in. In advance thanks for your time. Have a great day!  ","solutions":["Hi WalterKahler, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Try to solve the problem by following these steps: Press the >> Shift key on your keyboard, while clicking on Restart, continue pressing the Shift key until >> Advanced Recovery Options Menu >> Click on Troubleshoot >> Click on Advanced Options >> Click on Startup Settings >> Click on Restart, now Press (F4 or the option indicated) to enable safe mode >> Wait while Windows 10 starts in safe mode.https:\/\/support.microsoft.com\/en-us\/help\/12376\/...If it does not work, verify and apply the following indications: https:\/\/support.microsoft.com\/en-us\/help\/402652...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M."]},{"symptom":"WIN 7 Pro does not see Device at boot post sequence?        When win10 device is installed with win7 running device is seen ok. I have new win10 pro kit that I want to install on a new drive but the boot post fails when it cannot see the device. When I go to the boot selector it sees the device but fails when the device is selected.","solutions":["When win10 device is installed with win7 running device is seen ok. I have new win10 pro kit that I want to install on a new drive but the boot post fails when it cannot see the device. When I go to the boot selector it sees the device but fails when the device is selected. What is this \"Win10 device\"?"]},{"symptom":"Two wifi adapter connection issue        Alright, so I have two wifi adapter, one that connects to the wifi, and the other I use as a hotspot so that my tablet can connect to and get a stronger signal than if I tried to connect directly to the wifi. lately however, when I connect the first one to the internet, after an amount of time, the computer has been forcefully giving the wifi password to the second adapter, disconnecting my first adapter and turning off my hotspot. It's been getting irritating because when I disconnect the second router from internet and the click forget. It not only forgets on the second router but on the first one as well. So I try ignoring it and letting both connect, but my first router gets a stronger connection, to I try to set that one as the main. But of course the computer has other plans and continually disconnects the first one and gives access to the second adapter. Ironically when the second one is connected, I get a stronger signal, but no internet access. Please help","solutions":[]},{"symptom":"What has happened to Windows?        I don't understand what is going on at Microsoft. I upgraded from Windows 8.1 to Windows 10 about 2 years ago and initially I thought all was great. Now, with each new Windows 10 update, my high end laptop becomes more like an expensive paperweight. I cannot permanently disable Windows 10 updates to prevent further damage. The drivers that were created for the hardware in my system have been usurped by \"Windows 10 drivers\" that aren't worth a hill of beans. I cannot delete the Windows 10 drivers because I \"lack permission\" to modify my own computer. My fingerprint reader no longer works, my NVidia card errors out and lacks it's once luster performance, my SSD drive is about as fast as an old HDD, and on and on. Windows security features have made it impossible to fix the f-ups caused by Windows 10. If I can't get back the control I once had with past versions of Windows XP or Windows 7 then I am going to have to write off Microsoft and jump ship to Mac.Microsoft does not seem to understand that it was the ability to modify and customize Windows that made it appealing. Does anyone have any insights as to how to delete the Windows drivers that have usurped my OEM drivers and how to disable the burdensome security features that prevent me from modifying Windows to suite my needs?By the way, I HATE this \"APP\" idea going on with Windows. I DON'T WANT YOUR APPS, I WANT MY PROGRAMS THAT I LOAD AND USE.","solutions":[]},{"symptom":"Suspicious behaviour regarding vmware workstation on win10 vs win7        We are in process of migrating from win7 to win10..our day-to-day work, involving using VMWare Workstation with a security product (DLP) to protect data from leaking through VMWare Workstation.The way the DLP works -in this context- is to prevent the sensitive data from going through these two executables related to VMWare:1- vmware.exe2- vmware-vmx.exeThe normal scenario is that any file copied from the host machine to the guest machine, will go through \"vmware-vmx.exe\" executable. But for the exact same version of VMWare workstation installed on Windows 10, this is not what it happens at all!I figure that when I traced it via ProcessMonitor (Windows Sysinternals)Now what is happening under the hood when copying a file from host to guest in Windows 10 or even 8.1 because it seems like something changed which causes this issue.I hope I made my self clear about this problem. If you need more clarification just ask.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern, as you thing the process of copying files from host to guest is different in Windows 10 from Windows 7, as it doesn’t go throughvmware-vmx.exe\" executable. Let me point you in the right direction, where you would get the appropriate help for this issue. I would suggest you to post your query inTechNet forums, where we have experts and support professionals who are well equipped with the knowledge on VMware to assist you with the appropriate troubleshooting steps. Regards, Aditya RoyMicrosoft Community – Moderator","Dear Mr Roy,Thank you for your reply.I followed your recommendation and post an inquiry on TechNet forums (link to my questionhttps:\/\/social.technet.microsoft.com\/Forums\/en-US\/509052a1-60e7-4da7-b3bb-a2466564c027\/suspicious-behaviour-regarding-vmware-workstation-on-win10-vs-win7 (forum=win10itprosecurity).. however they didn't answer my plain simple question..as u stated clearly that \"the process of copying files from host to guest is different in Windows 10 from Windows 7, as it doesn’t go throughvmware-vmx.exe\" executable\".. then all I wanted to know is what process other than \"vmware-vmx\" it goes through!What I get from TechNet forums is they asking me to open a ticket with \"Microsoft Support for Business\" (which I clearly don't have!).So am I asking a hard question?","Dear Mr Roy,Thank you for your reply.I followed your recommendation and post an inquiry on TechNet forums (link to my questionhttps:\/\/social.technet.microsoft.com\/Forums\/en-US\/509052a1-60e7-4da7-b3bb-a2466564c027\/suspicious-behaviour-regarding-vmware-workstation-on-win10-vs-win7 (forum=win10itprosecurity).. however they didn't answer my plain simple question..as u stated clearly that \"the process of copying files from host to guest is different in Windows 10 from Windows 7, as it doesn’t go throughvmware-vmx.exe\" executable\".. then all I wanted to know is what process other than \"vmware-vmx\" it goes through!What I get from TechNet forums is they asking me to open a ticket with \"Microsoft Support for Business\" (which I clearly don't have!).So am I asking a hard question?This is to confirm that I posted this reply."," This is to confirm that I posted this reply.-This may be a very uncommon problem that you won't get help with, but I'm escalating the thread to get the attention of other Agents and Moderators.Don"]},{"symptom":"PC keeps crashing with no error codes        hi my PC keeps crashing i lose all communication all inputs stop working but i can still here audio via Bluetooth headphones and i lose display and it randomly drops, it dropped Wednesday 8th January 2020, Friday 10th January and Saturday 11th January.  i used who crashed and it stated that there conflict of drivers with the kernel on Wednesday. but now i am not getting any error codes, i used another soft ware and it gives my events logs yet it seems to be missing 5 mins before my pc crashed please help thank you ","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Have you made any recent hardware changes which could have caused this to start happening?If you don't yet have the newest version of Windows 10 (which is version 1909) it would be worth updating as this may resolve a potential software corruption or conflict. You can do that easily from here:https:\/\/www.microsoft.com\/software-download\/win...Regards, David","thank you for the quick advice i will check what updates i have done and what updates needs doing and see if that fixes the situation thank you and if not is it alright to message you back thank you ","Yes of course - let me know how you get on.","Hi I'm afraid the update hasn't solved my problem ive got 2 further error reports from the crash DMPsOn Sun 12\/01\/2020 02:04:19 your computer crashed or a problem was reportedcrash dump file: C:\\WINDOWS\\LiveKernelReports\\WATCHDOG\\WATCHDOG-20200112-0204.dmpThis was probably caused by the following module: atikmpag.sys (0xFFFFF805395509F0)Bugcheck code: 0x141 (0xFFFF9A06D5CC8010, 0xFFFFF805395509F0, 0x0, 0x0)Error: VIDEO_ENGINE_TIMEOUT_DETECTEDfile path: C:\\WINDOWS\\System32\\DriverStore\\FileRepository\\u0350652.inf_amd64_18673f4bf2e5fe02\\B350656\\atikmpag.sysproduct: AMD drivercompany: Advanced Micro Devices, Inc.description: AMD multi-vendor Miniport DriverBug check description: This indicates that one of the display engines failed to respond in timely fashion.A third party driver was identified as the probable root cause of this system error. It is suggested you look for an update for the following driver: atikmpag.sys (AMD multi-vendor Miniport Driver, Advanced Micro Devices, Inc.).Google query: atikmpag.sys Advanced Micro Devices, Inc. VIDEO_ENGINE_TIMEOUT_DETECTEDi have a feeling that it could be hardware problem or i need to contact asus and amdthank you ","Hello Ineedhelpthx99, After reviewing your error codes it seems that you are correct in it being a hardware problem. Contacting your gpu manufacturer should be your next step in this process. I hope they are able to get it fixed for you.","I think i may have to as i thought it was a software problem But as many different drivers and other errors keep happening it must be a hardware problem but the problem is that i have Is the asus software which is the motherboard not responding in the event log and i have the graphic card which is a amd vega 56 and the radeon keeps crashing as well so i dont really know what i could do","You should try contacting AMD about the GPU first. If they are unable to assist you then contacting ASUS would be your next step, as we are unable to assist with hardware issues. I hope this has helped.","Thank you for the advise i felt kinda lost as i diddnt know what caused it but i will contact amd and asus thank you ","Not a problem. Glad i could help."]},{"symptom":"Windows Reset!        hey there , I want to reset my laptop from setting and I am confusing with will my data can be deleted or not ?so from below two option which one i have to choose, i am wanting to format only myC: drive  without any other drive . so it is good to go for a first option or not?thank u in adv.","solutions":["My pleasure Darshan! Happy to help. :)"]},{"symptom":"Something went wrong and your PIN isn't available (code: 0x80070006)        Recently, when I try to login, I get the following message (not always):Something went wrong and your PIN isn't available (code: 0x80070006).Then I have to login using my password instead. I have already tried to change my PIN (successfully), however, the message returns.","solutions":["Hi StijnBousard, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Please check the following steps on how to fix PIN not working. [Fix] Unable to Add and Use PIN Sign-in Option in Windows 10 https:\/\/www.askvg.com\/fix-unable-to-add-and-use...Looking forward to the results. Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads.","Hi Stjin, I see it did not resolve the issue. Did you correctly rename the NGC folder? Do a System File check and run DISM tool and post back the results in the next reply:http:\/\/www.yourwindowsguide.com\/2016\/06\/run-sys...Content on the above blog is written by a Microsoft MVP so it is safe.","Hi, my name is Ruth i tried loging into my account but they are asking me for PIN verification  but i dont have the PIN"]},{"symptom":"Windows Store Error Code 0x80073CFE        I have been getting this error even when I'm installing new apps and updating apps.I tried wsreset.exe and sfc \/scannow and DISM, but in vain.Any other ways to fix it.","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command prompt DISM \/Online \/Cleanup-Image \/RestoreHealth Run these commands on the command prompt to restart windows update services net stop bits net stop cryptsvc net stop wuauserv net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start bits net start cryptsvc net start wuauserv net start msiserver After successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig 2. On the system configuration window go to the services tab 3. Tick on hide all microsoft service so that this won't be affected 4. Choose to disable all services 5. Next, go to the startup tab and on the window choose to open task manager 6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok 8. A prompt to restart the computer will show up, choose to restart This should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update\/install apps again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo... 2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept. 4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)"]},{"symptom":"Fingerprint Sign-in Not Working        Hello!Yesterday my HP Envy laptop, which is only 6 months old, all of a sudden froze on a screen that I was working on and after about 5 minutes gave me a blue screen that said something like \"windows has encountered a problem and is gathering info and will restart soon :( \" My laptop restarted but since then my fingerprint sign-in will not work. When I go to Windows > Settings > Accounts > Sign In Options, 2 messages stand out to me:One message that says: This options is currently unavailable-click to learn more. We couldn't find a fingerprint scanner compatible with Windows Hello fingerprintWindows Hello is preventing some options from being shown","solutions":["Hello Tmarin1, Please try uninstalling the fingerprint sensor drivers in your hardware management. Then restart your pc and allow it to reinstall the drivers. It is possible if that doesn't work that your fingerprint scanner has failed and you will need to contact the manufacturer.","Thank you for responding!How do I uninstall the fingerprint sensor? When I walk through the previously mentioned steps,Windows > Settings > Accounts > Sign In Options, and I click on Windows Hello Fingerprint, the Add Another & Remove buttons are disabled so I cannot click on them?","You can easily remove drivers with the device manager. Follow the steps listed here:https:\/\/docs.microsoft.com\/en-us\/windows-hardwa... and look for fingerprint sensor in your device manager. Once found, uninstall the driver associated with it and restart your pc. When you log back in it should automatically reinstall the driver unless there is a hardware issue with your sensor.","Michael, you're a smarter man than me!... It worked!Thank you VERY much for your time and assistance!Blessings!","Anytime! I am glad i could help! Have a great day and thanks for choosing Microsoft Community Support!!!"]},{"symptom":"If I want to reinstall windows 10 from my repair disc will this delete my data?        I have a questions:1. first I want to repair my windows 10 for this do I need to use system image file from my usb or repair disc?2. While I reset my windows from repair disc will this delete all my computer data also of all partition like b,c,d drives?","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,To reinstall and repair windows, you'd need to create a bootable usb also known as a repair disk. By reinstalling windows on the bootable media, you'll be able to boot up the usb on the device and you will be directed to the windows set up. On windows set up, you'll be provided a window with your current partition. If you wish to have your other partitions untouched, do not choose to format or delete the other partitions but rather format the partition which consist of the windows installation file. By formatting the boot partition, all the files inside will be removed within the process. You may also choose to select the windows\/boot partition to reinstall windows whereas it will create a windows.old on the C drive which should consist of the user folder and your previous installation files. As for the reset this pc option, by choosing remove everything it will only remove the files where windows is currently installed and the files on the other partitions will remain on its default location.Hope this answers your question. :)","Thanks Gary.But here I have a doubt. So to reinstall and repair windows there are two options am confused with. One is create system image and other is system repair disc. What option I have to go for in order to make a bootable pendrive.While going for the option will this make usb directly a bootable or Ineed to make it by some other software after copying windows files?","A system image would be a copy of the current state of the windows operating system. If your intention is to repair windows as it may be malfunctioning, then your best bet is to create a bootable usb to perform a reinstallation of windows.Here are references on how to reinstall windows. https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/support.microsoft.com\/en-in\/help\/400073...","Thanks Gary for the help.I have another question during installation in 'chose to keep' option, what does 'Nothing' means.For example if I chose this will this delete all my data in other drives too such as D,F,G including C(where windows 10 is being installed?","Are you currently using the media creation tool to reinstall windows? If so, it will only remove the files on the C drive which normally has the windows installation. The other partitions will remain as it is.","I am using windows set up.","Yes. Choosing the keep nothing option will keep the other partition untouched while the partition which contains windows will be reinstalled."]}]}