{"windows":[{"symptom":"My current setting is English (UK). However, in the date the month appears in Gujarati language. How do I change this setting?        My current setting is English (UK). However, in the date the month appears in Gujarati language. How do I change this setting?","solutions":["Open control panel\/internet options,on 1st page,locate language tab,edit.And\/or go to Microsoft update catalog,in search type: language packshttp:\/\/catalog.update.microsoft.com\/v7\/site\/Home.aspx"]},{"symptom":"Windows 10 nearby sharing        When attempting to share files between my laptop and desktop always get the message \"the computer you are trying to share with did not respond\". I am running windows 10, 1903 one both machines.","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,Press and hold the Windows key and the R key. > appwiz.cpl > click OK > select “Turn Windows features on\/off” > look for SMB1.0 and expand it > make sure to check\/tick all SMB options > OK > wait for the feature to be installedAfter enabling smb1.0 1. Press and hold the Windows key and the R key. 2. At the command prompt, type services.msc and then press Enter. 3. Find each of the services in the list below. On each service, right-click, select Properties, and set Startup type to Automatic, then click Apply and OK. If the services were not started, start them up.a. Computer Browser (Browser) b. Function Discovery Provider Host (FDPHost) c. Function Discovery Resource Publication (FDResPub) d. Network Connections (NetMan) e. UPnP Device Host (UPnPHost) f. Peer Name Resolution Protocol (PNRPSvc) g. Peer Networking Grouping (P2PSvc) h. Peer Networking Identity Manager (P2PIMSvc) Open Control Panel > Go to Network Sharing > Change Advanced network sharing > make sure to Turn on network discovery on private\/public\/all networksTurn on media streaming as well on Change Advanced network sharing (Make sure to allow all media devices)After successfully applying the changes, check if the same behavior occurs. If it does, I'd recommend updating both devices to the latest 1909 version of windows 101. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo... 2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept. 4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","Hi BobbyDixon,try following here:https:\/\/support.microsoft.com\/en-us\/help\/4091344\/windows-10-share-things-with-nearby-devices"]},{"symptom":"BSOD Kernel Problems        Can you help please.  I am plagued with BSOD and particularly so this morning where I have had 4, 2 of which have been whilst trying to add this post.This has been going on for many weeks now.Dump files uploaded to One drive UPLOAD.Quick posting before it crashes again!Derek Reeves","solutions":["Hi,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.We need log files(called dump files) that tell us what lead to crash.Please share them with us for a better analysis of the problem. Instructions can be found here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Please let us know if you need any assistance about posting dump files.","Hi,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.We need log files(called dump files) that tell us what lead to crash.Please share them with us for a better analysis of the problem. Instructions can be found here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Please let us know if you need any assistance about posting dump files. Dump file uploaded to One drive UPLOADhttps:\/\/1drv.ms\/u\/s!AsKZX5oDjAcWg9dioi5uBOlG64j0EA?e=AmLCPK","I have removed Corel PaintShoPro X9 from the PC as this was causing a script problem.  PSP 2018 still exists.","Hi Derek, It looks like the Network driver is involved. Let us confirm the same. The next step, Let us try finding any misbehaving driver Enable Driver Verifier: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...(Must create a Restore point before) Upload the newer dumps when you get Driver_Verifier_detected_voilation. Please note that the system might crash before you reach the desktop-if it does please let us know so that we can guide you to disable Verifier.Technical Information: FAILURE_ID_HASH_STRING:  km:0x13a_11_bdrc_tcpip!aleredirectrecordfree","I have been through the process and uploaded the dump file.The process it went through was:BSODDriver Verifier ViolationPreparing Auto RepairDiagnosing your PCWindows couldn't load correctlyRestoreAttempting repairsLoaded.","Thank you. Driver verified and it looks like the backup utility from Paragon is causing the crashes.Please uninstall that and let us know if it crashes again. You may reinstall if the crashes stop.Unable to load image \\SystemRoot\\System32\\drivers\\UimFIO.SYS, Win32 error 0n2","Thanks.  Have removed the Paragon Hard Disk Manager 12.  Fingers crossed.","Great, let us know if it BSODs again.","Just had another BSOD this afternoon (BST).Had been working on an Excel spreadsheet and just save and exited.Derek","Please share the new crash dump file."]},{"symptom":"Small computer freezes        I am using a Gaming laptop that I have gotten for Christmas and late into the day occasionally my screen will freeze for about 1-3 seconds then resume and slowly it gets more repetative til I have to restart this error comes up everytimemy graphics card is updated and is a Nvidia GTX 1660SourceWindowsSummaryHardware errorDate‎08\/‎01\/‎2020 23:24StatusNot reportedDescriptionA problem with your hardware caused Windows to stop working correctly.Problem signatureProblem Event Name: LiveKernelEventCode: 141Parameter 1: ffffda0ef7e7f010Parameter 2: fffff8035ca6b9b4Parameter 3: 0Parameter 4: 21d4OS version: 10_0_18363Service Pack: 0_0Product: 768_1OS Version: 10.0.18363.2.0.0.768.101Locale ID: 2057","solutions":["Well, the same info, minus the mention of laptops, applies with the below additions. And I still DO NOT RECOMMEND you do anything without the system maker's support on a new computer with this possibly very serious error.----- This applies mainly to home built systems though can be used for reference on commercial system maker systemsWays to check the PSU : After checking determining the wattage of the power supply you will then need to check the requirements of the motherboard and devices. Usually the video card is one of the major power users.How do I determine how big my power supply is? http:\/\/www.computerhope.com\/issues\/ch000800.htmOther good sources of information are the device makers' sites and their forums. eXtreme Power Supply Calculator http:\/\/extreme.outervision.com\/psucalculatorlit...Power Supply Calculator https:\/\/www.newegg.com\/tools\/power-supply-calcu...Choosing the right power supply for your computer http:\/\/en.kioskea.net\/faq\/588-choosing-the-righ...How Do I Test the Power Supply in My Computer? http:\/\/pcsupport.about.com\/od\/toolsofthetrade\/f...--------- Ways to stress test a system to see if that helps determine fault (again not recommended in this case).PC Stress Test free software for Windows 10 https:\/\/www.thewindowsclub.com\/pc-stress-test-f...====== Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all."]},{"symptom":"Lockscreen wallpaper changes automatically        I use windows 10 home. I have my lockscreen wallpaper set to picture mode and i have no clue how this keeps changing to some other random picture which i never had on my device before. it keeps happening with two pictures only, i have not seen it change to any other than these two .This is so frustrating. Help please!","solutions":["H Arafath. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Try cleaning out the Lock Screen pictures hidden folder here: https:\/\/appuals.com\/fix-deleted-picture-appeari...(Don't click any ad links especially Reimage, just follow the written steps) Then reset the Picture you want in Settings > Personalization > Lock Screen I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hello All, Would you let me know why the picture stop changing? Since January 4, 2020 I have the same pictureRosette_NebulaThank you in advance. "]},{"symptom":"delete keboard languages        I have too many keyboard languages. How do I delete some?","solutions":["Hi Luz and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing thread that will help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","I followed all suggestions, but..., nothing gave!Tried removing the languages directly from the settings page too.Went into Control Panel, but I don't have a language setting, so I can't remove languages. Thanks anyway","Hi Luz, In this case, we should delete it in Registry. - Press the Windows key type in \"Regedit\" and press enter. - Navigate to. HKEY_USERS>.DEFAULT>Keyboard Layout>Preload REG_SZ 00003409 is a Filipino English Default keyboard language. REG_SZ 00000409 is an English Default keyboard language. [You can google yours.] - In my case, I leave REG_SZ 00000409 and REG_SZ 00003409 to remain because it is my default keyboard language. Other keyboard languages should be deleted.Additional info: Do not delete REG_SZ (value not set). I hope this helps. Feel free to ask back any questions and let me know how it goes.Thanks!"]},{"symptom":"windows10更新问题：我们无法更新系统保留的分区        我在调整mrs分区时，未备份分区内容，进行格式化扩容，然肉出现这种情况请问如何处理？（在不重装系统的情况下）。之前因为分区太小，进行扩容，目前已经由1G的内存。","solutions":["您好 欢迎咨询微软社区，我是独立顾问(Independent Advisor) Zhang 您能否尝试在WinPE下使用DiskGenius，在删除原分区之后重新建立一个新的MSR分区，之后您再修复一下Windows启动 您可以访问以下网页下载 http:\/\/www.diskgenius.cn\/download.php关于WinPE您可以自行搜索下载 以上均非微软官方软件，使用这些软件可能会造成不可预料的后果，请谨慎使用 如果您需要进一步的帮助请让我知道 This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. 这不是微软官方网站。该网页可能提供了准确，安全的信息。请小心网页上的广告，这些广告可能会被归类为PUP。在下载并安装这些网页上的广告宣传的产品前，请彻底的研究。","这里所有的工具只需要免费版的","你好，我的启动没有问题，我进入PE看过，启动引导放在system分区里面的。"]},{"symptom":"Cannot login as administrator account disabled        Wondering if anyone could help me please. I purchased a second hand compute stick STK1AW32SC when I try to boot up it says the administrator account has been disabled and cannot get any further. How can I get logged in? Thanks","solutions":["Hi Stacey It would be best to reset Windows 10 on that stick and you sill have a clean Windows 10 environment . ..Remove any Micro SD card, if installed You need to get into the Recovery Environment with either option 1 or 2, then continue with option 31 Press F8 when you see this prompt during boot 2 Start your PC, just as Windows attempts to load (spinning dots), press and hold Power Button for 5 - 10 seconds to perform a Hard Shut DownDo this twice On the third start Windows will boot into the Recovery Environment and from there you can access System Repair, Safe Mode, Command Prompt . . . etc.3 Go to Troubleshoot - Advanced Options - Reset this PC Choose to keep nothing Then start the Reset","Thank you. I did do a total reset last night but had no joy. Will have another go if I get the chance to tonight. Hopefully have some luck lol "]},{"symptom":"Camera Roll        Hello,I am trying to print multiple photos on one page.  This is not available through pictures and when I tried to look at camera roll the pictures were not there to choose but the ability to print multiple is...How do I get my photos on camera roll from pictures, or how can I print multiple on pictures??","solutions":["Hi Tassroll Are these image files stored on your PC and can you view them in the Photos App? If so, open File Explorer, then on the left, click Pictures You should find those Pictures in that folder and be able to select multiple images (Ctrl + Click) then right click and choose Print to bring up the multi-up print dialogIf you cannot find those photos in that folder, there should be a second Pictures library in the left pane, if you are using OneDrive, click that and you may find them there . ..When you mention Camera Roll, are those pictures you took with the web cam on your PC?","Hi,The photos are on my PC on the pictures tile.  I don't think I have a photos app, and I don't think I'm using one drive either!!All my current photographs are going to the pictures tile, and are not on file explorer.Camera roll, on file explorer, used to be where all the photographs taken were kept but it is not updating photos taken from my iPhone.Cheers"]},{"symptom":"how do i validate my hotmail account when the product key code is not accepted?        Ho do I validate my Hotmail account when the product key code is not accepted?","solutions":["Ho do I validate my Hotmail account when the product key code is not accepted?What has a Windows? Product Key got to do with your Hotmail Account?More information is required to assist you correctly.NB: Do NOT post product keys here.","Ho do I validate my Hotmail account when the product key code is not accepted?Is your Hotmail functioning OK ???If it is and you received a E-Mail to validate your account it was a possible Phishing attempt.Do not reply to it.Also : the product key code has nothing to do with it.","            Microsoft will send you a Security Code for your Account, not a product key."]},{"symptom":"Getting blue screen of death Errors Unexpected store exception followed by Critical Process Died        Been getting these blue screens for a long time, i've done numerous clean installs which usually solves the problem temporarily. I've run the check disk command and the sfc scannow command and ive checked my drivers in driver manager and attempted to update them all to which it tells me they are up to date. I saw another post of someone with a similar problem so I did what they had to do and i have the most recent dump files here. EDIT: Fixed link https:\/\/1drv.ms\/u\/s!An_n0EMkmwmdjzEBnlpmwHPAdNGm?e=O8tu8FI would appreciate any help i really wantt his problem solved","solutions":["Hi Matthew, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.No real help in the single dump you provided - the other one had a zero size. As a clean install has not resolved it: Looks like a Memory test is required. I suggest you to run a memory test for at least 8 passes, preferably overnight. https:\/\/www.tenforums.com\/tutorials\/14201-memte...When the test completes post back the Image(You can use your phone's camera). Disclaimer: There are links to non-Microsoft websites which would provide accurate and safe information. Watch out for ads on the sites which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","Alright thank you, I will run this tonight","Unfortunately, I ran the \"Memtest86+ USB Installer\" program and it did its thing to my USB flash drive i went into my BIOS and set the pc to boot from it and disabled all other options. I'm then presented with a black screen momentarily and it just proceeds to boot normally back into windows. I ran the Memtest86+ a second time on my flash drive in case it didnt do it correctly and went back into my BIOS a few times to no avail. It appears I cannot get it to work, any suggestions on how i can fix this problem?","https:\/\/1drv.ms\/u\/s!An_n0EMkmwmdjzSTF21c4w8J_OIE?e=pYWgJgin this link i provided a picture of the Memtest being installed as well as a picture of my BIOS boot settings and a short video of the boot process that follows just to make sure i've done everything correctly.  (excuse my beautiful reflection on the screen)The flashdrive i am using is a Sandisk 16 gb flash drive","Hi, Please try disabling Secure boot off in BIOS and then check. Also make sure the drive is formatted as Fat32.","Hello Sumit, I cannot find a secure boot option in my BIOS settings. Also the MemTest program said it formatted the flashdrive as fat32.","Okay, let us keep it aside for a while. I'll see if there is any replacement program.The next step, Let us try finding any misbehaving driver Enable Driver Verifier: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...(Must create a Restore point before) Upload the newer dumps when you get Driver_Verifier_detected_voilation. Please note that the system might crash before you reach the desktop-if it does please let us know so that we can guide you to disable Verifier.","So i followed the instructions on the link you gave me and now I don't get blue screens it just crashes without giving me a bluescreen and restarts sometimes even shuts down on its own","i managed to get the 2 most recent dmp files that didnt have a size of 0 https:\/\/1drv.ms\/u\/s!An_n0EMkmwmdjzdPSqxq9dH9iDx8?e=td8xhcHopefully this link works properlyit's hard for me to use my pc because it keeps crashing ","Yes, some insights are there in the crashes. Please post the Screenshots of disk check and HD Tune.Let us first check the disk. Download and run HDTune . http:\/\/www.hdtune.com\/ Select the Disk where OS is installed. Make screenshots of the following the health the error scan the benchmark Post back the screenshots. How to do a Disk check of System drive in Windows 10 and interpret the logs https:\/\/www.yourwindowsguide.com\/2018\/04\/how-to...Also, do you have a device connected beside Keyboard and mouse? ERROR_CODE: (NTSTATUS) 0xc000000e - A device which does not exist was specified.Disclaimer: There are links to non-Microsoft websites which would provide accurate and safe information. Watch out for ads on the websites which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"My computer would crash after roughly an hour of usage        I have an asus vivobook running on windows 10. it's fairly new and this issue started happening 2 weeks into using this laptop. no matter what software i was using the computer would start to behave strangely. when i use chrome after an hour the window would not respond and then the screen would start flashing. in other cases when i play games or open other programs they would freeze and force close after the same amount of time. i hope this is coherent enough.any idea what is happening?","solutions":["Hi, Have you tried to run the System file checker? To do that, go to CMD and run it as administrator, Then type sfc \/scannow You can also run these commands on CMD. dism \/online \/cleanup-image \/scanhealth dism \/online \/cleanup-image \/restorehealth"]},{"symptom":"Missing Microsoft Store - how to install it without reinstalling OS.        Hi,On my laptop (OS version - 1809; OS Build - 17763) Microsoft Store is missing so I can't install any app even when I have .appx file (also I don't have Windows Installer). Is it possible to install Microsoft Store from any .exe file? I've heard that file like that exist. I tried some command for PowerShell, and one was probably for CMD but it didn't helped.Thanks in advance for help","solutions":["Hi baremoto,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.I see you are on version 1809 - It goes out of support in 4 months. Any reason why you do not want to upgrade to a newer release?Upgrading would resolve your issue of Store as well.","Hi,Yes, I know that it will help, but case is a complicated. I can't reinstall OS now because my friend refuse it (I want to do it first). Can I do it from the something like package to update to e.g. version 1903, build xxxxxx?","I have same problem like that. Microsoft Store is missing and i tried to fix with command prompt and power shell but it isn't change anymore. My windows 10 version is 1909. Can u help us??","Hi baremoto, Reinstalling means removing everything and reinstalling Windows. Repair installing means reinstalling Windows keeping everything.Download an ISO file of 1903 from here if you want to do update to the same: https:\/\/tb.rg-adguard.net\/public.phpChoose Windows Final>1903>18362.X When the file download completes, Double click the file and run setup.exe. Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"Cara Pilih Instal Bluetooth Asus Windows 8, 64bit        Minta info dan bantuan cara download bluethooth pada asus x453M windows 8, 64bit yang tepat apa ya? Karena fitur pendukung laptop asus saya belum tersedia. Dari berbagai situs yang akan di unduh tidak didukung. ","solutions":["Did you read this?You obtain your Bluetooth software\/drivers, IF your machine is designed to use Bluetooth from your manufacturer's website if not installed by default."]},{"symptom":"right alt shift not working windows 10        I use Win 10 pro and right alt shift not working ","solutions":["Hello AliMostafa3, I'm Didi, an independent advisor. I suggest performing a System File Checker to scan and repair a possible missing or corrupted system file because this problem can be caused by that.Here's a tutorial on how to do that : https:\/\/support.microsoft.com\/en-us\/help\/929833... , refer to the \"Run the System File Checker tool (SFC.exe)\" paragraph.Regards, Didi"]},{"symptom":"Xbox One Passkey        I forgot Xbox One Passkey. Could you help me to restore it?","solutions":["Hello Erka, I'm Sam, an Independent Adviser. Glad to assist and help with your question.Try following the instructions on the thread below https:\/\/answers.microsoft.com\/en-us\/xbox\/forum\/...Do let me know if you have other questions or require further help."]},{"symptom":"System Restore        I want to restore my PC running Windows 10 to earlier date","solutions":["Hello Nicole, I'm Sam, an Independent Adviser. Glad to assist and help with your question.Try following the instructions on the link below, section Restore from a system restore point.https:\/\/support.microsoft.com\/en-in\/help\/12415\/...Do let me know if you have any more question or require further help."]},{"symptom":"OneDrive again!!        I have a continual problem with OneDriveon my Desktop computer. It works for a while and then suddenly the quick access icons disappear and the files stop synching.If you right click on file explorer and click \"pin to quick access\" it doesn't work.So in the past I have uninstalled OneDrive - re-installed and everything seems fine until it happens again. Now 3-4 times. Every time I uninstall- re-install it takes for ever to re-sync the files","solutions":[]},{"symptom":"Windows Update Troubleshhoter Keep Running But Do Not Show Any Solution        Hi, I had problems with Windows update I ran the troubleshooter and do not show any solutionor fix he problem that my pc  has to install some updates. Solution?Best regards,Jose Luis Martinez Castro","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,What version of windows 10 do you currently have?(Open the start menu and search for winver)__________________ Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command prompt DISM \/Online \/Cleanup-Image \/RestoreHealth Run these commands on the command prompt to restart windows update services net stop bits net stop cryptsvc net stop wuauserv net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start bits net start cryptsvc net start wuauserv net start msiserver After successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig 2. On the system configuration window go to the services tab 3. Tick on hide all microsoft service so that this won't be affected 4. Choose to disable all services 5. Next, go to the startup tab and on the window choose to open task manager 6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok 8. A prompt to restart the computer will show up, choose to restart This should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo... 2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept. 4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","Gary,thanks you for your prompt reply.I have Windows Version 1509 ( OS Build 18363.535)DISM tool show when I run Image Version 10.018365.535 and keep blinking. no results.Best regards,Jose Luis","Thank you for that information Jose. Please do proceed with the next step"]},{"symptom":"Read receipt in Windows 10        Help me to request Read Receipt. What are the steps to add read receipt requested? Thanks.","solutions":["Hello Jesus, I'm Sam, an Independent Adviser. Glad to assist and help with your question.If you are using Outlook.com, follow the next steps one by one. 1. Press Windows key+I on the keyboard to open Settings 2. Find Mail, then Read Receipts. If you are using Office 365, follow the instructions: https:\/\/support.office.com\/en-us\/article\/Add-an...If you are using Windows Mail App follow the next steps one by one. 1. Press Windows key+I on the keyboard to open Settings 2. Locate Reading Pane and Mark Item as Read options Do let me know if you have any more questions or require further help."]}]}