{"windows":[{"symptom":"An issue        All the browsers i have is crashing and i can't do anything beside restarting the pc so it works again and if i try to reload the pages in the browsers a few times the whole device freeze.please is there any solution to this issue HELP ME!!","solutions":["Hi MoeLian, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.The first thing I suggest to troubleshoot the browser crash is to identify if a 3rd party program is causing the crashes.Please put the computer in a clean boot state and tell us if the issue is there or not.https:\/\/support.microsoft.com\/en-in\/help\/929135...You may also show some crash info by opening the reliability monitor and paste in the next reply.Type View reliability history in Search bar>Click the Red cross>View Technical Information.Looking forward to the results.","so i tried what you said and it didn't work and this i tried to open games but the games is having the same issue so i don't really know what to do beside restarting the device because that is the only thing is getting apps to work again please anything else could i do in this kind of situation?? ","Hi MoeLian, Based on your concern, there's a lot of people experiencing this kind of issue as well.What I can suggest is to rollback and disable your windows update for the mean time.This actually worked for me, please follow this link for detailed guide: https:\/\/www.windowscentral.com\/how-stop-updates...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"DRIVER UPDATE NOT WORKING        I have an HP SPECTRE X360, and can not for the life of me figure out how to update the detection verifaction driver to update. i have tried to do the windows automatic update...which resulted in it not being able to find it. i then tried to do it manually with complete failer. Please send help!","solutions":["Hi Steven. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Update your drivers and BIOS\/UEFI firmware from HP Support Downloads web page here:http:\/\/support.hp.com\/us-en\/drivers, using the full model number or Serial Number on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page."]},{"symptom":"Windows Defender and Security Center Issues on Windows 10        Hello, I have had this issues for the last couple of weeks and I have tried multiple solutions that have all played out in vain. The issues can be summed as the following:Windows Defender cannot startWhen opening windows security from the settings on windows 10 its shows security at a glance as emptyWhen I search for \"Virus and Threat protection\" it shows that all settings are off and i cannot start Real time protectionWhen i open \"firewall and network protection\" it shows that \"windows defender is using settings that make your device unsafe\" so it gives me the choice to restore settings which does nothingWindows defender service and security service are greyed out so i cannot restartusing Cmd in admin mode to net stop and start the security center service gives me error code 5 access is denied. This issue has shown itself to me for the 3rd windows re-installation because of the software crash by windows defender.These issues reveal themselves suddenly and I have no idea why. Please help. ","solutions":["Any 3rd party anti virus, security, cleanup programs ever installed on the computer?","Yes, after my 2nd reinstallation of windows over this issue i installed avast free antivirus for extra protection as the first program everything works fine and windows defender works while avast is on until a few days later when suddenly i find that windows defender no longer shows any signs and avast antivirus is completely uninstalled...on my 2nd installation of windows i tried re adjusting the codes of the registry to re enable windows defender to no availi tried sfc scannnow and still nothingI trie Restarting service but its greyed out dism check online didnt fix ittime and date is synced correctlyi even installed malware bytes and scanned and removed plenty of things but still now i have a fresh windows install and the issue just came back again..group policy is okay and sfc scan now shows no issue..i have a feeling its an administrative issue","Hi Ziad, Do you have a third party Anti-Virus installed on your PC as well? Example (Norton, Avast, AVG etc.) Some of third party Anti-Viruses can disable your Windows Defender services and use their services instead.Please double check and come back to us. We will wait for your response. Thanks and regards,"]},{"symptom":"Unable to print to my network printer after upgrade to Windows 10        I have just upgraded my secondary desktop PC (Windows 7) to Windows 10 but can not print to the Samsung CLP-300 printer connected to the router on my network.My primary desktop PC (Windows 10) is connected to the same network and it prints as it should.I have tried removing the printer from the devices listed in Settings\/Printers & Scanners on the upgraded PC and then reinstalling the printer as follows:  Located the printer on my network using the Windows file manager.  Right click\/Open brought up a window stating \"Couldn't find a driver on the network\"  Clicked OK and opened the Add Printer Wizard window.  Selected the Samsung CLP-300 series Version 3.3.0.0. (22\/1\/2007) driver.  This opened a window labelled Samsung_PRT_1 on Sohonas (the router name).  Set the printer as default.  Settings\/Printers & Scanners now shows the printer in the list, as it did before.  Clicked Manage\/Print a test page - resulted in a test page printout with an error message \"SPL-C ERROR - Please use the proper driver\"  Ran the Troubleshooter resulted in message - Troubleshooting couldn't identify the problem.  Detailed information reports - Problem with printer - DetectedThe fact that my primary PC prints correctly and the fact that I can see the printer on the network with my secondary PC suggests there is nothing wrong with the network or printer.I've compared the printer settings for my primary and secondary PCs and the only difference I can see is in Settings\/Devices\/Printers & Scanners\/Manage\/Printer properties\/Ports.  Primary PC shows a checked box against \\\\SOHONAS\\Samsung_PRT_1      Local Port     Samsung_PRT_1  Secondary PC does not show this in the list and the Add Port   Delete Port and Configure Port buttons are greyed outI would appreciate advice on how to resolve this issue.Thanks","solutions":["In the computer use the disk that came with the printer and install the printer software following the instructions that came with the printer.","Hello Nomadic, I am Andrew an independent advisor. I seen the driver you are using is from 2007 and cannot possibly be compatible with Windows 10. This is why your printer is not working. Please go to Samsung website and download the appropriate driver for your printer, one certified for Windows 10. Take Care, Andrew","The CLP-300 predates Windows 10 and the disk that came with it offers a choice of WIN2KXP, WIN9X, WINNT and WINXP_64. Hence I selected CLP-300 Series from the drop down list offered by Win 10 when I tried reinstalling it. It tells me the driver has been installed but still throws up an error message when I try a test print.","Thanks Andrew, the driver is the later one of two offered by Win 10 when I reinstalled the printer. I just tried again and selected Windows update to see if a later one is offered. Again I selected CLP-300 series from the drop down box, got the indication that the driver had been installed successfully and still get the same error message when I tried a test print.","Hi Nomadic, It would be better if you revert back the updates and reinstall your Printer driver.This actually worked for me, please follow this link for detailed guide: https:\/\/www.windowscentral.com\/how-stop-updates...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Well, after spending all day uninstalling and reinstalling the printer several different ways, including connecting the printer via USB cable and installing the drivers supplied on the original CD I managed to get it to print in this way. However, connecting the printer back on the network I still couldn't get it to work. I got to a point where I could not even connect with the printer using the Windows File explorer. I also had an error message: Operation failed 0x00000002, siggesting there was a corruption on a driver file.Gave up and went for a walk on the treadmill.Returning to the problem I checked and noted all the settings on my working primary PC. Back on my secondary PC I located the printer on the network with Windows file explorer, right clicked and tried to connect, got a message that no driver was installed and opted to run the install driver wizard. I opted for the driver found by Windows Update and completed the installation. As if by magic it worked!!I'm left relieved and baffled because I'd been round that route probably three times during the day.Thanks for your suggestions.","Hi Nomadic, I'm glad that it worked. Please let us know if you need further assistance in the future. You have a good day!"]},{"symptom":"Downloading photos from iPhone onto desktop        I have an iPhone which I use to download photos onto my notebook.  When downloading photos it says that it’s downloading new photos. Is there a way of downloading new files to external hard drive or another file folder after downloading to the default folder?","solutions":["Hi Rbuckpi, You can only set one default folder for your synced files\/photos. What I can suggest is to move your photos on external hard drive once the sync is done.That would be better. Please let me know if you need to clarify further. Thanks and regards,","Richard,I appreciate your quick response for clarifying my question. I have another issue that you may help me up with. I’ve been unable to import new photos onto to my notebook. I set up another iPhone and was able to download new photos. Is there something that I am doing wrong? ","Hello,Try importing your photos using File Explorer method:https:\/\/www.kapilarya.com\/how-to-import-ipad-iphone-photos-to-windows-10Let us know if this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP. ","See if this assists you:Import photos and videos from your iPhone, iPad, or iPod touch ...Apple Support: Learn how to transfer photos and videos from your iPhone, iPad, or iPod touch to your Mac or PC. We'll also show you how to make your photos available on all your devices with iCloud Photo Library._____________________________________________And:Sync your iPhone, iPad, or iPod using iTunes on your computerThere is also a link at the end of the above to submit a question to the Apple CommunityCheers.","Hi Rbuckpi, Did you tried other ports? Or most likely, there's an authorization you need to do for \"file transfer\" on your iPhone I believe in order for you to import files into your notebook.Please let me know if you already did this. Thanks and regards,"]},{"symptom":"download photos from iphone to windows 10        I am having great difficulty downloading my photos from my iphone to my pc.  I would like to try disabling the automatic download in the photos app.  how do i do this?regards,alex","solutions":["Hi Alex, You can follow these steps: Connect iPhone to Windows. The device will sync, and iTunes will appear. On iTunes, click on your device tab. From left navigation panel, Click \"Summary\" tab. On the right side of the panel, under “Options”, uncheck “Automatically sync when this iPhone is connected”.Note: With this, the iTunes will not appear automatically when you connect your iPhone to WindowsIf this won't work, try these instead: Connect iDevice with Windows computer. The iTunes will appear with synchronization of the device. Click “iTunes” on Mac or “Edit” on Windows from upper menu bar. On drop-down Menu, Click “Preferences”. Then, Click on Devices. Check “Prevent iPods, iPhones, and iPads from syncing automatically” and hit OK to save the changes.Please let me know if these steps will help you solve your concern. Thanks and regards,","sorry, i think you misunderstood my issue.  i am unable to fully download my photos off of my iphone onto my windows 10 computer.  i am trying to copy all of my photos off of my iphone onto my computer.  however, after i connect my iphone Xr to my computer, it will transfer about 8 photos and then it will get disconnected somehow.  there appears to be a software glitch either on the phone or the windows pc.","Hi Alex, Most likely if you are doing manual transfer you need to consider the applications that are running on your windows PC as well.Do you have an anti-virus which offers Firewall or something like that? Also, you may try to use other ports as well. Check your connection. Check your power management features as well. As it might affect that some devices are set to sleep after few minutes. There's a lot of things to consider with your concern. By the way, did you experienced this issue after an update? I'll wait for your answer. Thanks and regards,"]},{"symptom":"Fujifilm E500 driver        Need a camera driver for a Fujifilm E500 Camera, from a source without viruses.","solutions":["H Vinnie. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.The downloads for that camera are very old: https:\/\/www.fujifilmusa.com\/support\/ServiceSupp... The newest one Fuji posts for USB is for XP. You can still try it in Compatibility Mode:https:\/\/www.groovypost.com\/howto\/run-old-softwa...https:\/\/social.technet.microsoft.com\/Forums\/win...Did you try plugging in by USB to see if Windows loads a stock driver? Is there perchance wireless or bluetooth on the camera? Let me know what happens. I'll be here to help until it's resolved. ______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Can't Launch Rocket League. Psyonix support didn't help.        Rocket League started up fine until the beginning of December, about a week before the Blueprint update came out. It would start and all I would get was a white screen, and then it would crash. I opened a ticket on Psyonix's support page and the only concrete answer I got was to run the System File Checker tool in CMD. Didn't work. I've wiped Windows and reinstalled it, that didn't help.I looked through the log and mini dump files, and found that vcredist140.dll would throw error 0xC0000005 saying that, 'The thread tried to read from or write to a virtual address for which it does not have the appropriate access.' I ran a debug on the mini dump, and it came up with, 'Unhandled exception at 0x74313610 (VCRUNTIME140.dll) in RL-v191206.41613.257139-2020.01.02-20.40.50.dmp: 0xC0000005: Access violation reading location 0x00000000.'(The reason is says 2020, is that RL started up once, I closed the game, and it wouldn't start up again.)Does anyone know what causes this and\/or how to fix this?","solutions":[]},{"symptom":"If I upgrade a Windows 8.1 computer to Windows 10 and get a digital entitlement\/digital license, can I reuse the Windows 8.1 product key on another pc?        I want to know if Its possible.","solutions":["No.  The license is for one and only one computer at a time.Yes,  if you remove if from the other computer","Hi Angel. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.The old OS Product Key is consumed by the Upgrade as long as you are using Windows 10 on the PC. You can go back to the old OS if you want, even go back and forth to Windows 10. But the old OS key is not available to migrate if it's retail as long as it's being used to qualify for Upgrade. A key that used for preinstalled Windows that comes from the factory is never able to move, nor can an Upgrade deriving from it move to another PC. They are locked to the same motherboard.I hope this helps. Feel free to ask back any questions and keep me posted. ________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Having Trouble Using Windows 10 Firewall        Whenever I block a program from accessing the internet using Windows 10 Firewall Advanced Settings (Inbound\/Outbound,it always shows up as checked in the Allowed Apps and Features firewall section. Doesn't a check mark next to a program mean that it has network access through the Windows Firewall? As you can see in the the 1st screenshot, I have blocked Evil Within in the Outbound Rules and in the Inbound Rules *Didn't include a screenshot from the inbound section, but the rule is there and it is active* However, it still appears in the Allowed Apps and Features section with a check mark next to it. It does this with any program that I try to block. Also, with certain programs (such as Steam) when I first install it and run it, it will tell me that it's blocked some features of the program, etc, and so I select Private..yet, when I check the Allowed Apps and Features along with the Advanced Settings it has created rules that allow it access for both private and public access. I've tried setting the Firewall to default settings, but the same thing still occurs.In the 2nd and 3rd screenshot you can see what happens when I remove the check mark from Evil Within, it disables the private and public blocking rule and for some reason keeps the domain rule active (I'm not in a domain) in the Inbound Rules, but if I check the Outbound Rules it shows that the blocked rule is just fine and is active. What am I doing wrong? Are you only supposed to block Outbound Connections and then leave the Inbound Rules section alone lol? ","solutions":["HI Nihil. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Make sure you're following the procedure given in Shawn's tutorial here to block the apps through Firewall:https:\/\/www.tenforums.com\/tutorials\/70903-add-r...Then if it still doesn't work I would ask Shawn in the tutorial Comments section since he is the ultimate expert on any subject one of his tutorials cover.I hope it helps. Let me know what happens. ______________________________________________ Note: Linked tutorial is from Shawn Brink who is a trusted Microsoft MVP."]},{"symptom":"USB 3.0 ports don't work at all. (Windows 10)        Today I was uninstalling some junks in control panel and found many driver packs that were probably installed by a previously removed random driver installer that i don't remember any name of.and then i uninstalled some of those driver packs, too. I thought maybe they are junks and don't do anything since their publisher's names were different and didn't seem to be genuine. (picture included)but, after I did this, the three usb 3.0 ports of my laptop didn't work anymore. but the usb 2.0 works as always.I may have tried every way of fixing the problem. like installing some other driver installers and they all installed the same drivers that they said are not updated, pretty funny of them tho. I tried reinstalling the chipset driver and a few other things downloaded from the manufacturers site. (Lenovo). I tried restoring my system to a backup from a month ago. And none worked.Device manager's pic included.When I click on show hidden drivers, the usb 3.0 shows up but doesn't happen to make any problem.If the problem persists on my pc, maybe i'm gonna do a clean windows install then.","solutions":["Hi, Right-click and select \"Uninstall device\" and uninstall all those grayed out entries under Universal Serial Bus controllers.Restart the computer."]},{"symptom":"Entered Incorrect Password too many times, but never entered password        Recently I have started receiving a message about entering an incorrect password and having to put A1B2C3 before trying again, but I never tried to put a password in to begin with. My computer will 'sleep' and then the message of \"too many incorrect tries\" appears, Does this mean I have a virus? How can I make it stop?","solutions":["Hi Jasmine. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Try powering off the PC twice by holding in the power button until the power cuts off, then the third time starting it should throw it into the Repair Mode explained here:https:\/\/www.tenforums.com\/tutorials\/2294-advanc...From the Advanced Troubleshoot options try System Restore, then Startup Repair, then if nothing else works do the Reset saving your files if they aren't backed up.It may be necessary to create bootable media to access Repair Mode or do the Clean install:To create Windows 10 Installation Media on another PC install Media Creation Tool and follow the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, on second screen choose Repair Your Computer, then Advanced Troubleshoot Options, then System Restore. If that fails go back to Troubleshoot Options to try a Reset.If that fails choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, click Next to let it create needed partitions and start install - this makes it foolproof. Everything needed to get the best possible Clean Install is here: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... It is a better install than any amount of money can buy and a great learning experience that will make you the master of your PC because you will learn what works best and how to apply it with your own hands. I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows 10 update        Windows 10 will not update on Dell desktop Get a failed message.","solutions":["Hi Jack. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything possible for fixing failed Windows Updates, so that at least something will work before you work through them all:Some Updates will sort themselves out in a few days so I'd wait to see. If not or they are bothering you then here are steps you can take:1) Run the Windows Update Troubleshooter from Windows Settings > Update & Security > Troubleshoot.2) There is a new guided walk-through from Microsoft for repairing Windows Update that leads up to resetting components if necessary:https:\/\/support.microsoft.com\/en-us\/help\/10164\/.... Try running that first. 3) If that fails try manually resetting Windows Update Service: Open administrative Command Prompt and type following commands one-by-one followed by Enter key.net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Close Command Prompt and see if Windows Updates works then 4) You can also install the Updates manually that fail to install, which are logged at Settings > Update & Security > Windows Update > Installed Update History, and then search for those to download and install from this Catalog:http:\/\/test.catalog.update.microsoft.com\/v7\/sit... 5) If they continue to fail and interfere, then you can block them using one of these methods:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... 6) If problems with Updates have become chronic and especially if you have other performance problems, go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 7) If nothing else works then do a Repair Install, by installing Media Creation Tool, open installed Tool and choose to Upgrade the PC Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version 1909. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... _____________________ Good news! There are major changes in Version 1903 giving back control over Updates to the consumer. Microsoft has heard us at the highest level who announced this here:https:\/\/blogs.windows.com\/windowsexperience\/201..._____________________ I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Windows 10 will not update on Dell desktop Get a failed message. Hello, Please run Windows Update troubleshooter from Settings app > Update & security > Troubleshoot. Let us know what it reports back. Regards.","Thanks for your tips,but iam throughly pissed at Windows. A person should not have to put up with this type of frustration.This has been going on for months.Im not about to spend $200.00 for online counseling.Im going to buy a new computer in the coming months and i doubt it will have Windows.So im sure you know what kind i will be purchasing.Thanks again for your assistance. Jack","i need help, i have windows 7 ultimate it was installed by someone who \"built\" my computer. i've been getting messages when i boot up my computer for a long time now saying optional update delivery is not working you may be a victim of software counterfeiting then there's a link saying go online and resolve now. i click the link and its a genuine microsoft page.. but it says sorry page you requested is no longer available.i really need to update to 10 but i worry about the existing O.S issue. can i still successfully update to 10 with a potentially counterfeit windows 7 install?","Jack, If you want to complain to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. But Microsoft will not even see it here because this is a tech forums where we are mostly volunteers trying to help solve your problems. Did you want my help? I gave you the step that work for most for Updates. They take about 20 minutes if you work right through them, unless it gets all the way to the Repair Install which may take another hour but then you have a fresh install with your apps, files and settings kept in place, are brought to the latest version by the most stable method, and it fixes most all problems.Sometimes frustration works against us. I learned to never approach fixing these things when I'm frustrated. So let me know if and when you're ready to tackle the problem and we WILL get it fixed.","Hi Greg,thanks for offering your help. I will gladly take you up on your offer.Will this be via phone? How about some afternoon? Thanks, Jack","Jack, this is a forums not Support. We do interactive help here in your thread. I can walk you through the steps I gave if you need. I also gave illustrated tutorials for most steps.If you want to contact Microsoft Support by one of these phone numbers: https:\/\/support.microsoft.com\/en-us\/help\/405170...You can also go here: https:\/\/partner.support.services.microsoft.com\/... choose the link for Browser help, interact briefly about your exact problem until it connects with an agent.Let me know what you want to do. I am here to h elp.","Hello Greg.Whenever you got some time,we can try to get this thing solved. I have tried the troubleshooting on the  Windows Update page.Nothing has worked so far. Thanks,Jack","Jack, please complete the steps I gave in my first post and report back the results. I am standing by here to help and have been waiting for you to complete the steps I already gave.","Hi Greg,i tried several steps and this is to hi tech for me as some steps didnt get me to where i was supposed to go. Doing it by forum is rediculous. Jack"]},{"symptom":"Can't install Windows 10        Split from this thread.hi greg please help me. i cant install windows 10 on my pc with a bootable stick. ","solutions":["I will give you all possible steps to troubleshoot installation failure which work in about 90% of cases.  If not we'll go from there:Follow the illustrated Clean Install steps in this tutorial which compiles the best possible install that will stay that way as long as you stick with the tools and methods given: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki\/windows_10-windows_install\/clean-reinstall-windows-10-upgradefactory-oem\/1c426bdf-79b1-4d42-be93-17378d93e587Make sure all other drives and peripherals are unplugged.  Update the BIOS or UEFI firmware to latest, or reset to Defaults, making sure SATA controller is set to AHCI, UEFI is enabled, CSM or Legacy BIOS disabled, Windows Boot Manager set first to boot, if necessary disable Secure and Fast Boot until after install:   https:\/\/www.mydigitallife.net\/comprehensive-list-of-how-key-to-press-to-access-bios-for-various-oem-and-computer-systems\/https:\/\/www.groovypost.com\/howto\/reset-pc-bios-defaults-nvram-macCreate the latest new Windows 10 Installation Media by installing Media Creation Tool and following the directions here:  http:\/\/windows.microsoft.com\/en-us\/windows-10\/media-creation-tool-install.  If you're using another PC to do this then uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only. Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutorials\/23010-bios-boot-menu-f-keys-hotkeys-system-manufacturer-oem.htmlIf the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.  If you can start Windows enter UEFI firmware here:  http:\/\/www.isunshare.com\/windows-password\/four-methods-to-access-uefi-bios-setup.htmlChoose the boot device as a UEFI device if offered,  on first screen press Shift + F10 to open a Command Prompt, type the following commands,  each followed by Enter key:DISKPARTLIST DISKSEL DIS # (replace # with the disk # of the Windows disk from list in previous command)CLEANEXITClose Command Box, on second screen choose  Install Now, then Custom Install, then at the drive selection screen choose Unallocated Space, click Next to let it create needed partitions and start install - this makes it foolproof.Make sure to follow the setup steps in the first link tutorial to complete your install.  Drivers are important enough that those steps are printed in red. You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the first linked tutorial.  It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC.I hope this helps.  Feel free to ask back any questions and let us know how it goes.  I will keep working with you until it's resolved.________________________________________________________Standard Disclaimer:   There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"How do you create an association in Control Panel\/Default Programs?           I wanted to e-mail a newspaper article. I got a warning that I needed to create an association in Control Panel\/Default Programswith my e-mail program. How is this done? I saw no how-to info in Control Panel\/Default Programs. My e-mail program was not listed there,","solutions":["You don't say what your email program is; as to whether it is webmail or what.https:\/\/support.microsoft.com\/en-au\/help\/2994411\/how-to-set-up-email-account-in-the-mail-app-in-windows-8-1"]},{"symptom":"Vanishing shadows under windows (Windows 10)        A problem many people have referred to is the white frame of the selected explorer window which makes it indistinguisheable from white backgrounds. The usually recommended solution is to specify a frame color. Unfortunately, this changes also the color of the title bar, which to me is not aesthetical and disturbing. Thus the shadows under the windows is my preferred way of still seeing where an explorer-window stops.For the past few weeks now, \"something\" in my computer has been constantly removing the selection \"Show shadows under windows\" in the Performance Options! I put the mark, and sure enough, after half an hour or so the box is unchecked again and gone are the shadows. I had to put a shortcut to the settings on the desktop, but this is not the way to go, and the problem is maddening. So: what is this? A bug in the latest Windows Update? A program that changes the setting without asking (maybe trying to enhance the performance)? I've seen one or two people having the same problem, but they don't seem to have gotten any solution to the mystery.Please HELP !(P.S.  If no solution is to be found, I would kindly ask Microsoft to disconnect frames from title bars, so as to make it possible to specify a frame color and leave the title bar alone.)","solutions":["Music to my ears Louis! I'm very glad to hear everything is sorted out and we got it resolved in no time. :)"]},{"symptom":"Windows 1909 update?        Hi everyone,This is the first I've heard of this update. I only found out about it because I went to purchase Outer Worlds and discovered that my OS is somehow out of date? My question is simple. Will I lose data from updating to this new version of windows? Specifically will I lose saved game data\/installs on other games I have on my computer? Also, some of my games are quite old (windows 95 era) but are currently functioning on my current Windows 10 build, will I need to re-patch them? Also my apologies if this is a stupid\/obvious question...","solutions":["1909 is almost a non-event compared with the tedious large version updates that came before.The chance of the update causing issues is also far smaller because of the small update. You would haveto be very unlucky for your game saves and settings to go missing.Regardless. You should backup all of your game files. Your SSD\\HDD could fail without warning at any time.Having said that, if you have updated to 1903 without issues updating to 1909 will be over and done before you know it.There shouldn't be any new problems with your old games, but there is no guarantee with Win10 version updates, and problemsfrom version updates are probably more common with disc based games.My few '90's games are still fine, and I don't know if it was v1909 for sure,  butDues Ex-Invisible War has a big problem (long story below)it didn't have a while back, and I think I fired it up after 1903 update. The original Deus Ex runs without any problems though.------------    ----------( the long story... )To run the Deus Ex-IW I have to jump through some hoops. I have to open Task Manager on another monitor becausethe game crashes when  loading the gameplay after the setup screens. The main screen locks on to a black screen and won't Alt\\TAB back to the desktop, but with Task Manager on monitor2 I canAlt\\TAB to monitor 2.Then I have to end one of the Deus Ex tasks, and the Task re-starts automatically and the game comes good.But only while in the same area. It also crashes between scenes which make the problem untenable because youchange areas a fair bit. I have a copy of Win7 on another SSD which still runs the game without a problem..","Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,The 1909 version has been released sometime in november, you may review the changes via this linkhttps:\/\/support.microsoft.com\/en-us\/help\/4524570Normally feature updates such as this one mostly includes improvements, and added features for the system. This will not have any effects with third party applications as they would have an entirely different source path. Games from the Microsoft store won't be affected as well unless there are any updates that came from the games itself from the Microsoft store.You may check the link provided above to learn more about the recent changes from this feature update. :)"]},{"symptom":"Black screen when video plays on Youtube or Facebook        Hi,Not sure if this is a Windows problem but this has been happening for a couple of months now.When I click on a youtube video all I get is a black screen with audio playing. Doesn't happen on all videos, but on most.It also happens on some Facebook videos and also on shopping channels that I sometimes watch live.The audio is fine.No idea why and tried everything that I could to find out the problem.I'm sure there must be a simple solution - any ideas??I have Windows 7 and Chrome is up to date.Annie","solutions":[]},{"symptom":"Install Afrikaans language on the computer        Unintelligent question :  In my case, being English and Afrikaans speaking, resident in South Africa:How do I go about to install Afrikaans on my PC .I have Office 365, with valid licence .  Thank youThomas E.***Modified title from: Language***","solutions":["Hi Thomas, Thank you for writing to Microsoft Community Forums. For better clarity, please let us know: When you say, “How do I go about to install Afrikaans on my PC” do you wish to install Afrikaans language pack on your computer? If you wish to install Afrikaans language pack on your computer, refer the steps mentioned below: Press Windows + I, to open Settings.Click on Time & language.Click on Language and click on Add a language.Type Afrikaans in the search bar, click on theAfrikaans language pack and click on Next.If you want to make Afrikaans as the Display Language, select the checkbox forDisplay Language and click on Install. Else, just click onInstall.  Additional information: Manage your input and display language settings in Windows 10.  Let us know if you need any further assistance, we will be glad to help you further. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"External Hard Drive Access Denied        I am not able to access my external HDD at all. It's a seagate 2TB 9SF2A8-500, if that helps?I keep getting this message saying \"Location is not available\" \"F:\\ is not accessible. Access Denied\".  I feel like I've tried everything!  This started happening with the absolute worst timing, as I recently did a full reboot of my PC with Windows 10 and backed up all my files on there. It was working for a couple of weeks.  The drive shows up in the side menu on windows explorer and appears in Disk Management, also.Does anyone know any methods to fixing this. I'm really hoping to avoid re-formatting the drive, if at all possible. During typing this I tried opening autoplay and clicking \"Configure storage settings\", and it comes up with another error message \"F:\\   The directory name is invalid.\".Here I've copy-pasted some methods I've already tried, but none have worked for me. I've also tried file recovery programs, and they will find the files, but won't recover them without a subscription\/payment of some sort (usually quite expensive for a one-time use).Method 1: Run the hardware troubleshooter and check if it helps.Press Windows and X key together and select Control Panel.Click on Troubleshooting.Click on View all option on the left side of the Windows.Click on Hardware and Devices option.Click on Next and follow the onscreen instructions to troubleshoot the issue.Method 2: Try connecting the external hard drive to a different USB port and check.Method 3: Let’s check the disk management and see if the hard drive is detected. If it is detected, change the drive letter and go back to the Windows Explorer and check if you can open it.Open Disk Manager by pressing Windows key + R, in the run prompt type diskmgmt.msc, hit Enter key, it will open the disk management that will list all the disks that are connected to the computer.Check if you can see the USB drive. If it is listed.Right-click the drive, and then click Change, click Assign the following drive letter, click the letter that you want to use, and then click OK.I'm really trying my best here, but I'm absolutely stumped. Please help me if you can.","solutions":["Hi SmoothDog75 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.Try \"Solution 1 & 2\" https:\/\/www.jiho.com\/en\/tips\/fix-hard-drive-acc...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]}]}