{"windows":[{"symptom":"WIndows Store and Windows Weather app have stopped working. They open, and shut immediately        I can no longer use the store nor the weather app. I tried deleting, i tried updating Windows. I have no idea how to fix them. I liked the weather App.","solutions":["Hi JoeD.Thomas, To address the Weather app: 1. On your keyboard, press Windows Key+I or go to Start > Settings (Gear icon). 2. Click Apps. 3. Go to the left-pane menu > Apps & Features. 4. Go to the right pane and look for the Weather app. 5. Select the Weather app then choose Advanced Options > Reset. 6. Restart your computer, then check if the Weather app is working. To address the Windows Store issue: 1. Reset the Windows Store cache: Press the Windows Logo Key + R to open the Run dialog box, type wsreset.exe, and then select OK.Note: A blank Command Prompt window will open, and after about ten seconds the window will close and Microsoft Store will open automatically.2. Restart the computer. 3. If issue persists, reset Windows Store. 4. Go to Start > Settings (Gear icon) > Apps > Apps & Features 5. Locate Microsoft Store > Advanced options > Reset Let us know if the above helps. Best,","I did all of that before I came here. I also made sure that Win10 was up to dateThanks","So, now, none of my Microsoft apps are working, they all just close. Everything else on the computer is fine.","Still, no Windows apps will open. I can't open the store App. If I go to the website store, and try to intall an app. I get this, then nothing:Thank you! We’re attempting to install on your selected device(s)"]},{"symptom":"How do I rename an Application on the Right Click \"Open With\"??        I have Excel 2019 (64 Bit) and Excel 2010 (32 Bit) installed on my Acer Laptop.  I wish to be able to right click on an Excel File and have it open with either Excel 2019 (64 Bit) or Excel 2010 (32 Bit), depending on which I select.  My issue is that BOTH Options are Named Excel 2010...see the Image below.  I need to rename the 1st item to Excel 2019.  It opens the proper version of Excel but it's mislabeled in the Menu.  How can I rename the First Item from Excel 2010 to Excel 2019?","solutions":["Try this:1. Open the Registry Editor in the following loaction:\"HKEY_Classes_Root\\Local Settings\\Software\\Microsoft\\Windows\\Shell\\MuiCache\"2. Lookout for a value similar to this:\"C:\\Program Files\\Microsoft Office\\Office17\\excel.exe.FriendlyAppName\"3. Change the above value data to something lile:Excel 2019"]},{"symptom":"Windows 10 version 1709 won't update.        My Computer currently runs Win 10 Enterprise, on version 1709I've tried Win 10 update assistant to no avail ( also I've tried every option on the assistant.)Updates try to be installed but always say failed to update.Thank you for you time.","solutions":["Hi Joe-mQZ, My name is Riccardo and I will be happy to assist. Are you part of a company or enterprise that possibly has a group policy setup which does not allow updates?Since you are on Windows 10 Enterprise, you may be part of a domain that does not allow updates of Windows without an IT Administrator sending out the updates via a third-party application (like Microsoft SCCM, LanDesk, etc).If you are part of a domain or enterprise that controls this via a group-policy you may have to discuss this with your IT Department...If you are not, you can use the steps below to assist... Step 1: Checking Integrity of File System \/ Updates Go to Start > type in cmd > right-click Command Prompt and run as administrator. Type in the following: sfc \/scannow Let the above process run and complete. After that is done, type in the following: dism \/online \/cleanup-image \/restorehealth Let the above process run and then restart your computer. Once logged into Windows 10, go to Start > type in: Check for UpdatesClick the Check for Updates icon Click the Check for Updates button Are you able to get the new Feature Build? Step 2: Are you receiving Windows 10 Update errors...go to the link below and follow the Wizard and it can assist you with these types of errorshttps:\/\/support.microsoft.com\/help\/10164\/fix-wi...Step 4: Do a Repair Upgrade If after doing all of the above, it is still not functioning properly, do a Windows 10 Repair Upgrade. Although your files should stay intact; we always suggest backing them up as a precaution.https:\/\/answers.microsoft.com\/en-us\/windows\/for...Let me know if this works for you as I will be here to assist with any further issues."]},{"symptom":"Gears of War 5 Crashes between multiplayer rounds        Gears of War 5mostly doing FFAIt freezes up between multiplayer roundsI can alt-tab out and close it.if I do close it sometimes I get a anti-cheat error.  I'm not running anything cheat related, turned off nVidia overlay and I don't have any RGB software.the only virus stuff is windows defender","solutions":[]},{"symptom":"May have merged user and desktop        I was moving my desktop, documents, music, etc. folders to another drive to free up space on my C drive. I may have merged these folders with the users folder at some point. At first every file when into the desktop. Also desktop, documents, music, etc. now all have the same name \"documents\". Plus the original \"desktop\" content is not on the desktop anymore. There are now multiple desktop folders.","solutions":["Hi David Please don't move any files around on your PC . . . This will require some registry editing to fix . . . Click your Start Button, type regedit and hit Enter to open the Registry Editor Click View and make sure 'Address Bar' is turned on Paste this into the Address Bar at the top and hit Enter HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell FoldersPlease provide a screenshot of that resulting Registry Editor window . . .","Please see reg.","Sorry sent under another account. Not sure what happened.","Ok sorry I got back onto the right account. ","Hi David Wow, that is a mess, there is a lot if editing to be done . . . We need to Automate some of this . . . Click the link below to download a zip file, extract that once it is downloaded That will give you a reg file, right click the reg file and choose 'Merge' then confirm the mergehttps:\/\/www.winhelponline.com\/blog\/wp-content\/u...Then, open the registry Editor again, it will still be on the same page, please provide another screenshot of that page . . .________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","Thanks,","Hi David, That is much better, open the Registry Editor again, it will still be on the same page . . .Double click {754AC886-DF64-4BCA-86B5-F7FBF4FBCEF5} then set its value to this and click OK%USERPROFILE%\\Desktop Close the Registry Editor and restart (not shut down) your PC That will have reset all folder locations back to their correct values . . .","Thank you. Still one issue. Looks like the documents folder is called desktop.","Hi David That is very strange, because all registry entries are now ad they should be . . .If you create a new file in the Documents folder (named wrongly) does that also appear on your actual Desktop?","No if I create the folder in the documents folder that also is called desktop it does not show up on the desktop. This file may have been the one that got messed up. The original desktop files and folders are in it two times.Any thoughts?David"]},{"symptom":"product key on second-hand laptop - can i use it?        I have purchased second-hand Lenovo laptop from ebay. There was no OS installed, but there is Windows 7 Pro COA sticker with product key. Can I legally use this product key? Can I install Windows 10 and activate it with this product key?Thanks. ","solutions":["Hi,Yes... you can use the COA key to reinstall Win 7.. The key belongs to the machine..You can not use the key to Activate Windows 10 directly, but if you do a Win 7 to 10 Upgrade it might activate Windows 10 automatically.. Sometimes that works, and sometimes not.. It recently worked for me..If you want to try the upgrade to Windows 10, you need to be quick about it.. Support for Windows 7 ends in a couple of weeks..Windows 7 requires a lot of Windows Updates.. There may be a good number of programs you are entitled to from the computer's manufacturer.. You might want to check..If I were doing this, I would save some images of your installation every now and then.. It is much easier than needing to start from scratch if you encounter problems..Windows 7 has a \"Backup and Restore\" feature that you can use, or maybe a 3rd party program..Macrium Reflect has a nice free one..","Thanks.Technically, I can activate Windows 10 with the license key from the sticker. I was just wondering if it is legal, or if I need to be an original laptop owner to use the license key. ","Hi,Most times it does not work when you install Windows 10 and then try to activate with a Win 7 key..Only if the Upgrade process is run... As long as it works..It is possible that the previous owner did the 7-10 upgrade already..","Wouldn't windows prevent me from using this license key again then? It seems that system got activated with this key with no issues. ","Hi,That key should work on that computer unless there is a major hardware change.. Usually a new motherboard will cause problems..If it says it is activated with a Digital License, it is activating off of the motherboard's hardware ID..My guess would be that the original owner may have accepted the free windows 7 to 10 upgrade..","@@@@@@@@@@@@@@@@@@@@@@You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:Lenovo devices tested for Windows 10 version 1809 (October 2018","As the hard drive has no OS on it here is how to reinstall 7:You can borrow the exact same edition of Windows 7 Retail DVD and use your Product Key on the COA sticker to reinstall the operating system.@@@@@@@@@@@@@@@@@@@@@@@@@Or you can use this for preinstalled OEM or Retail Licenses. This is on a first come, first served monthly basis.Download the correct ISO file and make your own disk and use the Product Key that is on the COA Sticker. This is on a first come, first served weekly basis.https:\/\/www.heidoc.net\/joomla\/technology-science\/microsoft\/67-microsoft-windows-and-office-iso-download-toolDownload: Windows ISO Downloader.exeAnd here are instructions on how to burn ISO images to disk:http:\/\/www.snapfiles.com\/get\/ISORecorder.htmlYou change the Boot Order in the BIOS to be able to boot from your installation media:How to Boot Your Computer From a Disc or USB DriveHow to access Boot Menu:https:\/\/neosmart.net\/wiki\/boot-usb-drive\/Then do a clean install:http:\/\/www.sevenforums.com\/tutorials\/1649-clean-install-windows-7-a.htmlThe COA sticker is either on the underside of the Laptop or in the Battery Compartment.With a Desktop it is either on the side, rear or top of the Computer Case.Using the downloaded ISO file Method may require phone Activation.It may require that you use phone Activation.\"How to Activate Windows 7 by Phone\"http:\/\/www.sevenforums.com\/tutorials\/18715-activate-windows-7-phone.htmlThe above method also will require you to go to your Computer Manufacturer's website > Support and Downloads Section > locate your Model Number and Operating System > then download and install the latest Drivers for it. ________________________________________________Using the USB method in conjunction with the above Windows 7 download:http:\/\/www.sevenforums.com\/tutorials\/2432-usb-windows-7-installation-key-drive-create.html\"How to Get and Use the Windows 7 USB\/DVD Download Tool\"http:\/\/www.sevenforums.com\/tutorials\/31541-windows-7-usb-dvd-download-tool.html________________________________________________And this is very good and easy to use:Rufus - Create bootable USB drives the easy wayCheers.","Thank you for your answer, but please read my question carefully. I have no technical issue with installing OS onto my machine. All I want to know is the legal aspect of it. Is it legal for me to use this product key? If the OS is activated with this product key without any errors, does it mean I'm good to go?","If you are referring to 7:I read your question, that why I included the information about the COA stickerAnd that is also why I included the phone activation information if you have problems reinstalling 7.If you are referring to 10, no one here can give you a guarantee the 7 key will work with 10.The free upgrade 10 is officially finished, but some still get it, some don't.Reinstall 7, then contact Microsoft about 10","And once again: The key from W7 does work for W10 activation. I'm asking about legal aspect of it. The fact that it works does not mean it is legal."]},{"symptom":"Resolving a display setting issue.        My laptop is connected to a larger separate monitor.  When I \"close\" (shut the laptop's lid), both the lap and the monitor \"go black\".  How do I set up my configuation to permit me to use the larger monitor?","solutions":["Hi Warren Right click the battery icon on your Taskbar, choose Power Options On the left of Control Panel, click 'Choose what happens when closing the lid' Set that to do nothing . . ."]},{"symptom":"windows 7 activation        I was trying to update my windows 7 pc to windows 10. I tried updating 2-3 times but always end up with an error. but suddenly a message got displayed in system properties->windows activation that '27 days activate'. I'm using this PC since 2013 and it never showed this message. After entering the key a message poped up ' a problem occured when windows tried to activate. ERROR CODE- 0xC004E0003'...please help me with this... ","solutions":["I was trying to update my windows 7 pc to windows 10. I tried updating 2-3 times but always end up with an error. but suddenly a message got displayed in system properties->windows activation that '27 days activate'. I'm using this PC since 2013 and it never showed this message. After entering the key a message poped up ' a problem occured when windows tried to activate. ERROR CODE-0xC004E0003'...please help me with this...  What were you trying to activate; the failed 10 upgrade or reverting to 7?And double check that error code.I think you have one too many 0 in it.https:\/\/support.microsoft.com\/en-us\/help\/931276\/error-message-when-you-try-to-activate-windows-7-or-windows-vista-an-eError codeDescription0xC004F027The Software Licensing Service reported that the license is tampered.0xC003E004The Software Licensing Service reported that the license has not been evaluated.0xC004E003The Software Licensing Service reported that license evaluation failed.If you received one of the error codes in this list, go to method C."]},{"symptom":"Used Laptop        Received used laptop from work that had been \"cleaned\". it does have MS edge & IE, but no windows. What do I need to get Windows 10 on my laptop?","solutions":["Hi MarkCPI can you explain a bit more, windows is an operating system, without an operating system you cannot have any programs such as edge or ie.which operating system is installed? assuming it does have windows 10, press winkey+I select system -> about, what does it say under windows specification what do you see when it first boots? a screenshot might help"]},{"symptom":"\"System Restore failed to extract the file (...\\OneDrive) from the restore point.\"        Since updating to Windows 1803, system protection does not work.  Restore will not restore from the restore point created during the update.  Nor will it restore from any new restore point I create.  I get the message: System Restore did not complete successfully.  Your computer's system files and settings were not changed.Details: System Restore failed to extract the file (<the path on my system>\\OneDrive) from the restore point.  An unspecified error occurred during the System Resotre. (0x8007018b)\"This is the same result if I attempt to restore to the point that the Windows 1803 upgrade occurred.  And if I attempt to restore to a point I created immediately after the upgrade.  And if I attempt to restore to a point created immediately before I attempt to restore to it.  In other words.  It is not possible for me to create a restore point and restore to it.On the rare occasions when I attempted a restore in the past, it worked okay.I tried this on another machine also recently updated to Windows 1803.  The restore point creation then restoration worked correctly.  The only obvious difference between the two is that the machine on which the restore worked had only a C:\\ drive.  The machine on which the restore fails uses a restore point that covers two drives and the OneDrive file that cannot be recovered is on the non-C: drive.","solutions":["Hi, jaygourley Check these links, I hope you can solve your problem https:\/\/www.intowindows.com\/how-to-reinstall-wi...Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thanks, Pedro.  That's a good suggestion.  I may wait to do a new in-place install in hopes a less drastic suggestion comes to this thread.","Ok that's fine, you can also check to see if you have some damaged Hard Disk sectors.Check this guide, I hope I can help you https:\/\/www.makeuseof.com\/tag\/hirens-boot-cd-al...https:\/\/www.hiren.info\/pages\/bootcdhttp:\/\/www.hirensbootcd.org\/download\/Process: 1. Enter your USB drive or CD 2. Enter Dos Programs 3. Enter Hard Disk tools 4. Enter HDAT2 4.53 (Test\/Repair Bad Sector) 5. Then auto & choose your keyboard United states (or wait it will do automatically here)6. Press Enter & Press Drive level tests menu 7. Enter Check and Repair bad sectors 8. And now it will start, it takes a lot of time, so wait until it finished. Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thanks, Pedro.  I don't understand the context in which the process you describe occurs.  What CD or USB drive are you referring to?","Hi, Pedro.  Am I correct that if restore cannot extract the same OneDrive file from any of a half-dozen restore points, then there must be corruption on the disk that contains the restore points.  Is that your reasoning?  I've done chkdsk on that drive with no errors found.  If a half-dozen restore points were all corrupted why would it just fail to extract that same file every time?  Please explain what you think is happening that leads to this error.Another observation, which appears related (either as a cause or an effect of the problem that causes system restore to fail) is that the OneDrive icon in the systray appears to be perpetually syncing.  If the local OneDrive file were corrupted during the upgrade to 1803, would that cause the observed problem with system restore?","What may be happening is that you have some corrupt Windows files, so I recommend a recovery of the same","Thanks, Pedro.  SFC shows no corruption.  What files could be corrupt that that SFC would not discover and that would cause system restore to fail to extract the same file from multiple restore points?","I am having the exact same problem. I need to go back to my 1709 version as the 1803 version does not work due to a graphics card problem.Microsoft updated the machine to 1803 this afternoon, now I try to do a restore previous version and does not work. Then tried to do a system restore and get the stupid that it could not restore due to a file on OneDrive.Booted in to safe mode and did a full HDD check, then opened a command line and remove all my OneDrive files\/folders to make sure that are no clashes.Tried System Restore again with the same error.System Restore should only touch OS\/System files and not my files on OneDrive. I think we have a serious bug in 1803.Raoul","Same problem.Tried all disk scans from here (https:\/\/troubleshooter.xyz\/wiki\/fix-restore-point-not-working-in-windows-10\/#Method_5_Perform_a_Clean_Boot) - there were no issues with restore points, disk, system etc.Tried different restore points. None can recover.In \"regular\" mode system restore always shows an error with Sharepoint or OneDrive files.In \"safe mode\" shows error in some system files on C drive.I see 30 people have the same question and no one from MSFT replied since July?","I had the same problem, also on v 1803.  So as a test I created another restore point, but this time I first went to onedrive, settings, account and \"unlinked this pc\", ie., logged out from Microsoft.  I then did a restore and it worked just fine.  My reasoning was that if I unlinked my onedrive folder, that folder would then be nothing special, just another folder on the  computer.  Seems to have worked."]},{"symptom":"Windows 10 $200 firm??        Happy new year everyone. Was just curious if anyone got a good Christmas or new year deal off of this product. It seems to be the only thing not on sale. I love payment options as well. I didn't realize software was still that much....2020 was back to the future ","solutions":["Hi ANDROG, My name is Riccardo and I would be happy to assist you with this question today. You are correct Windows 10 Pro is $199.99US. There is a cheaper option Windows 10 Home which is only $139 located here:https:\/\/www.microsoft.com\/en-us\/p\/windows-10-ho...Generally you won’t see sales on this as the above is a retail copy and can be used on any computer you get afterwards. I would be Leary of any prices below that cost because they could be providing you an illegal product key or illegal product filled with viruses. I’ve included some additional information about Windows 10 Pro below:Windows 10 Pro is generally reserved for Enterprise-level clients that have a domain they want to connect to (for active directory). The Pro edition of Windows 10, in addition to all of Home edition's features, offers sophisticated connectivity and privacy tools such as Domain Join, Group Policy Management, Bitlocker, Enterprise Mode Internet Explorer (EMIE), Assigned Access 8.1, Remote Desktop, Client Hyper-V, and Direct Access.*For a comparison between Windows 10 Home vs. Windows 10 Pro check out the link below:https:\/\/www.microsoft.com\/en-ca\/windows\/compare...The cost of Windows 10 Pro is $199.99US listed on the Microsoft Store \/ Website. Please go here:https:\/\/www.microsoft.com\/en-us\/p\/windows-10-pr...I hope this answers your question. Please let me know if you need anything further.*sourced from (https:\/\/gadgets.ndtv.com\/laptops\/features\/windo...)DISCLAIMER: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Look on Amazon.com. You'll find much lower prices.","Look on Amazon.com. You'll find much lower prices.For legitimate licences?","I can't be sure, of course, but  as far as I know, everything Amazon sells is legitimate. They're very different from someplace like eBay.Ken","Microsoft tightly controls the price of Windows (and Office.) I guess they figure \"If Apple can do it, why not us too?\"You'll rarely see Windows selling for less than $10 or $20 off the full price. That's from a legitimate, authorized reseller.On the other hand, if you're not too picky, I might know a guy, who knows, a guy, who might be able to give you a break ... if you don't ask too many questions."]},{"symptom":"Netflix app black screen        When selectin user on netflix windows 10 app, one user gets black screen bug (loads for a second and then nothing but black screen). Selecting any other user will work just fine.On browser that user works just fine.Any ideas?","solutions":["Hi LasseAvovaara, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.I suggest to consult and apply the steps of these links that share some of the Windows MVPs, in both coincide some indications, but each contains their own information.1.- Fix Netflix black screen on your computer now https:\/\/windowsreport.com\/fix-netflix-black-scr...2.- Fix Netflix app not working on Windows 10 https:\/\/www.thewindowsclub.com\/fix-netflix-app-...Let me know if you have something else that I can help you with, I'd be happy to help.Happy holidays Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Upgrading        I had upgraded to windows 10when it was offered free then went back to windows 7. Can I still upgrade to windows 10 if I have the setup file on my computer?","solutions":["I had upgraded to windows 10when it was offered free then went back to windows 7. Can I still upgrade to windows 10 if I have the setup file on my computer?Yes, you can, independently of any setup file. Since your machine once ran Win10 it is now digitally registered for Win10.","The free upgrade to 10 is yours for the life of that device.The best method to upgrade back to 10 is to clean install it.Use the Windows 10 media creation tool on the Software download page \"Start fresh with a clean installation of Windows 10\"https:\/\/www.microsoft.com\/en-us\/software-download\/windows10startfreshReinstall Windows 10:https:\/\/support.microsoft.com\/en-us\/help\/4000735\/windows-10-reinstall\"How to Clean Install Windows 10\"http:\/\/www.tenforums.com\/tutorials\/1950-windows-10-clean-install.html_______________________________________________How to Create Bootable USB Flash Drive to Install Windows 10 fromThis tutorial will show you how to create a bootable USB flash drive that can be used to installWindows 10 with or without UEFI.________________________________________________To access BIOS\/UEFI - UEFI\/EFI configuration:https:\/\/neosmart.net\/wiki\/boot-usb-drive\/_____________________________________When your free upgrade to 10 was  originally activated Microsoft will have kept the Hardware Configuration details of your device on their Servers for recognition purposes if you have to reinstall 10.\"Activation in Windows 10\" (Digital entitlement)https:\/\/support.microsoft.com\/en-au\/help\/12440\/windows-10-activationCheers."]},{"symptom":"\"no audio device output is installed\", i have no sound        I cannot get sound from my laptop. It is saying that there is no audio output device I stalled which I've never seen before. I was just watching Netflix and it just stopped. No idea what happened. The diagnostic tests say nothing is there and its frustrating now. I've tried all the HP services available to me and yet nothing. Can someone please help me with this. Many thanks.","solutions":["Hi Bellls My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.1. Try running the audio troubleshooter Type Troubleshoot in the search box, and it will open the Settings. Go to Playing Audio and click on Run Troubleshooter. Follow the given instructions, and normally the Troubleshooter solves the issue, but in my case, it didn’t.2. Try uninstalling the audio driver Press Win+X and select Device Manager. Expand Sound, Video and game controllers Right click the sound device > Uninstall Uninstall Restart PC 3. Update audio driver Press Win+X and select Device Manager. Scroll down and click on “Sound, video and game controllers“, and see your audio devices here.Select your audio device, right-click, and click on Update Driver. Select ‘Search automatically for updated software’ and Windows will automatically scan your system to look for the suitable updated driver.Hope this helps."]},{"symptom":"Win7 Pro to Win 10 Pro Upgrade stuck        Hi - Trying to update Windows 7 Pro to Windows 10 Pro - using a full retail USB version of Win 10. Follow the instructions to boot from USB - typed in the Windows Key supplied - Chose the Upgrade keeping exisiting files option. Then get a message stating that update cannot be actioned using a boot from Windows media (the media supplied with the retail version of Win10 on it) It then adds remove the media and start Windows (7) normally, then use Windows Update. Followed these instructions but nothing happens. So still on Windows 7 and stuck - any ideas?","solutions":["Hi BrianCox4B and thanks for reaching out. My name is Joseph. I'm an independent adviser. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this helps. Feel free to ask back any questions and let me know how it goes. I will keep working with you until it's resolved.Thank you!","Hi Joseph, Thanks for the speedy reply - however the link to the article states that the thread is not currently available.CheersBrian","Hi BrianCox4B, Can you please provide some screenshot of an error that you have encountered? Thank you!","Hi,The deal with an upgrade is that it needs to be run from within Windows.. Just run the setup on the flash drive from within Windows 7.. You might actually be better off to download the most current version of Windows 10..The flash drive may be outdates by a couple of versions..You may not even need your purchased Windows 10 license to do so.. Some people are still getting the free upgrade from 7 to 10.. Providing you are going from Home to Home, or Pro to Pro.. Windows 7 Ultimate will upgrade to Windows 10 Pro..The upgrade will most likely not even ask for your key.. If it does, select \"I Don't have A Key\"..You can always add it later if necessary..","Try doing the update without entering any key.  I had a retail version of Win 7 and it upgraded and activated fine.  Basically, if your Win 7 is activated, it should upgrade to Win 10.  Whether or not it activates can be dealt with after the upgrade has completed..","Hi,The deal with an upgrade is that it needs to be run from within Windows.. Just run the setup on the flash drive from within Windows 7.. You might actually be better off to download the most current version of Windows 10..The flash drive may be outdates by a couple of versions..You may not even need your purchased Windows 10 license to do so.. Some people are still getting the free upgrade from 7 to 10.. Providing you are going from Home to Home, or Pro to Pro.. Windows 7 Ultimate will upgrade to Windows 10 Pro..The upgrade will most likely not even ask for your key.. If it does, select \"I Don't have A Key\"..You can always add it later if necessary..Thanks Slance, Tried the download option and all went well until after the download and checking system. It then failed with \"Unable to access the System Reserved Partition\" The support sites states this couldbe caused by a lack of space but the discmanager program shows about 80 mb free. It did not give an error code. So stuck again!Cheers Brian","Hi,You will need a lot more than 80MB of free space..You might try a Disk Cleanup..You might also have better luck if you create a Flash Drive, or download as a ISO..You can burn the ISO to DVD or Flash Drive, or run directly from the ISO with a \"Virtual Drive\".. You may see this option when right clicking on the ISO.. The ISO can not be on the OS drive when running with a Virtual Drive though..Things seem to go more smoothly when installing from the downloaded media, as opposed to installing directly from the create media website..","Hi,You will need a lot more than 80MB of free space..You might try a Disk Cleanup..You might also have better luck if you create a Flash Drive, or download as a ISO..You can burn the ISO to DVD or Flash Drive, or run directly from the ISO with a \"Virtual Drive\".. You may see this option when right clicking on the ISO.. The ISO can not be on the OS drive when running with a Virtual Drive though..Things seem to go more smoothly when installing from the downloaded media, as opposed to installing directly from the create media website..Hi,Overall I have 100s of Gb of spare disc - the support site says you need about 20mb free for the System Reserved Partition - I have run disk cleanup and have already tried to upgrade from a Flash Drive","Hi,I would still suggest downloading another ISO from the create media site or HeiDoc.net's download tool..The Microsoft furnished flash drives like you purchased are notorious for being bad in some fashion, and upgrading directly from Microsoft's website frequently has issues as well..You might want to disable any 3rd party security program and any type of automatic backup type program..BTW...  Did you run the flash drive from within Windows 7 ?","You can look at this site.  It does expect to know if your install is UEFI or MBR..https:\/\/support.microsoft.com\/en-us\/help\/3086249\/we-couldn-t-update-system-reserved-partition-error-installing-windows"]},{"symptom":"Bluetooth headphones won't connect audio        I bought a new pair of Sony WF-1000XM3 headphones and have been trying to connect them to my computer but the audio wont connect. I already scoured the internet for a solution and tried every solution listed in this thread https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/bluetooth-headset-will-only-connect-as-voice\/bf4bc6e8-a197-4a6a-b1dd-d529434b9b04Nothing has worked and I've tried every solution I can possibly find. The headphones connect to my phone and work fine there, but on my laptop (Windows 10) they will only connect voice. ","solutions":["Hi Lennoxxx, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved. Do other BT device work on that computer? Since you did all on that link? 1. Turn Phone and headphones OFF. (leave phone off while trying to connect). 2. Then restart computer. Wait a few for computer to stabilize. Try to connect headphones as Sony says. Does the headset connect to other Windows 10 computers? Only after trying all - turn phone on. ====== ====== Please review ALL of these if the above did not help (if you skip any that is likely to be what needed to be done).Here is my usual troubleshooting guide : Check with the Sony's support. <---- this is key for known issues. Try this : Turn OFF the Bluetooth device. On Computer Start Menu -> Settings -> Devices -> Connected Devices - Add a DeviceHOLD the Power Button on the device for 8+ seconds until the BLUE light starts to flash.Device has entered pairing mode - on computer click \"Search for Devices\" Install or update drivers if needed though Windows 10 will have many. If paired -> Right Click little speaker near clock on lower right -> Playback Devices - set as Default if desired. (You may need to right-click in the box to check Show Disabled and Disconnected devices.)Or Start - type in --> Sound ...... find at top and click on to get to the same Playback tab================================ Start - Settings - Update & Security - Troubleshoot - \"Bluetooth\" and \"Hardware and Devices\" troubleshooters.Check with your System\/Motherboard maker and install the latest Bluetooth Drivers. Ask their support and in their forums about any known issues.Also update the BIOS and chipset drivers while there as they can also affect the Bluetooth operation.=========================== Good idea to update all the major drivers : Check with System Maker (Motherboard Maker for custom systems) for updates to the BIOS, low level chipset drivers, and the major on-board and separate device drivers. Run DriverView - set VIEW to Hide Microsoft drivers - update those without Dump in their name.DriverView - Free - utility displays the list of all device drivers currently loaded on your system. For each driver in the list, additional useful information is displayed: load address of the driver, description, version, product name, company that created the driver, and more. http:\/\/www.nirsoft.net\/utils\/driverview.htmlFor Drivers check System Maker as fallbacks and Device Maker's which are the most current. Right Click Start Button - Device Manager - Display Adapter - write down the make and complete model of your video adapter - double click - Driver's tab - write down the version info. Now click UPdate Driver (this may not do anything as MS is far behind certifying drivers) - then Right Click - Uninstall - REBOOT this will refresh the driver stack.Repeat that for Network - Network Card (NIC), Wifi, Sound, Mouse and Keyboard if 3rd party with their own software and drivers and any other major device drivers you have.Now go to System Maker's site (Dell, HP, Toshiba as examples) (as rollback) and then Device Maker's site (Realtek, Intel, Nvidia, ATI as examples) and get their latest versions. (Look for BIOS, Chipset, and software updates at System Maker's site while there.)Download - SAVE - go to where you put them - Right Click - RUN AD ADMIN - REBOOT after each installation.Repeat at Device Makers - BTW at Device Makers DO NOT RUN THEIR SCANNER - check manually by model.Manually look at manufacturer's sites for drivers - and Device Maker's sites. http:\/\/pcsupport.about.com\/od\/driverssupport\/ht...========================================= If the computer currently supports Bluetooth AND the drivers have been updated as indicated above. Some troubleshooting methods : ALL apply to Windows 10. Start - Settings - Update & Security - Troubleshoot - \"Bluetooth\" Fix Bluetooth problems in Windows 10: FAQ https:\/\/support.microsoft.com\/en-us\/help\/14169\/...Connect to Bluetooth devices http:\/\/windows.microsoft.com\/en-us\/windows-10\/g...Fix connections to Bluetooth audio devices and wireless displays http:\/\/windows.microsoft.com\/en-us\/windows-10\/f...Read these : Why isn't Windows finding my Bluetooth or other wireless device (8.1 applies to Windows 10)http:\/\/windows.microsoft.com\/en-au\/windows-8\/wh...BluetoothView is a small utility that runs in the background, and monitor the activity of Bluetooth devices around you. For each detected Bluetooth device, it displays the following information: Device Name, Bluetooth Address, Major Device Type, Minor Device Type, First Detection Time, Last Detection Time, and more. BluetoothView can also notify you when a new Bluetooth device is detected, by displaying a balloon in your taskbar or by playing a small beep sound. - FREEhttp:\/\/www.nirsoft.net\/utils\/bluetooth_viewer.htmlBluetoothCL is a small console application that dumps all current detected bluetooth devices into the standard output. For each Bluetooth device, the following information is displayed: MAC Address, Name, Major Device Type, Minor Device Type, and optionally the company name of the device (if external file of MAC addresses - oui.txt is provided) - FREEhttp:\/\/www.nirsoft.net\/utils\/bluetoothcl.htmlBluetoothLogView is a small utility that monitors the activity of Bluetooth devices around you, and displays a log of Bluetooth devices on the main window. Every time that a new Bluetooth device arrives to your area and when the device leaves your area, a new log line is added with the following information: Device Name, Device Address, Event Time, Event Type ('Device Arrival' or 'Device Left'), Device Type, and the company that created the device.BluetoothLogView also allows you to specify a description for every device (according to its MAC address) that will appear under the 'Description' column. - FREEhttp:\/\/www.nirsoft.net\/utils\/bluetooth_log_view...Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all."]},{"symptom":"Administrator Permissions           I am signed in to a Microsoft account on my PC in which I had administrator privileges but they were lost and anything i try to do asks me for the admin and password to have that access. I wanted to make another account on my PC but there is no family tab to let me add another account and when i try to add one through the windows Run bar, i still dont have that access and require the admin name and password to do anything. PLEASE HELP! ","solutions":["I'm unable to access ADMINISTRATOR and I a unsuccessful in resetting a password.Please helpJerry","Hi YungBlinkz, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.These are recommendations of websites that belong to Windows MVP, check if the instructions help you find the solution to the problem.https:\/\/www.thewindowsclub.com\/lost-administrat...https:\/\/www.tenforums.com\/tutorials\/2969-enable...Let me know if you have something else that I can help you with, I'd be happy to help.Happy holidays Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","This did not resolve my problem, i dont have any access to the admin when i try to run the command prompt, it'll ask for the admin name and password but dont give me a box to type it in nor do i know the name and password.","Hi, I understand, start in safe mode, you must press and hold the Shift key while restarting the computer, in this way you will observe the advanced recovery screen. Follow this route:https:\/\/support.microsoft.com\/en-us\/help\/12376\/...Click on option >> Troubleshoot >> Advanced options >> Click on Command Prompt >> At the command prompt, type:net user administrator \/active:yes + Enter, then close the command prompt, restart, then try to log in to the administrator account.Regards"]},{"symptom":"WiFi problem        I've recently updated to windows 10 on my acer aspire computer and now I can't connect to WiFi. The option won't show up on network and internet settings. I've checked Device Manager and I don't see anything under Network adapter that say wireless the only time I do is when I check to check Hidden Device. I've tried troubleshooting ( it didn't work) and when I check Network adapters Properties I only get the tab for general nothing else. I don't get the option to expand network.","solutions":["Hi Marika97 it sounds like that update has removed your WiFi card device driver . . . Go to the support page fro your laptop on the Acer website, then from there, download and install the WiFi device river they recommend . . .if you have any trouble locating that support page, what is the exact Model No. of your Acer Aspire - that will be printed on a sticker on the bottom casing . . .","The model is AZ1620-UR13P","Hi Marika97 You should find the Wireless LAN driver for your system on this page: https:\/\/www.acer.com\/ac\/en\/ID\/content\/support-p...;________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","I’ve checked the site and sadly those drivers won’t run on my computer since it’s been updated to Windows 10. Do you think buying a wireless adapter would work? Like Logitech","Hi Marika97 Yes, you can get one of those Wireless USB dongles from $5+ on the Internet, I use a Laplink USB dongle to hook into my home WiFI, they are very good and very fast . . .https:\/\/www.amazon.co.uk\/Wireless-USB-Adapters\/...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]},{"symptom":"refund        hi I brought the game ark on my laptop but I don't have enough storage a would like a refund please","solutions":["I don't know how to get the refund","We don't work for Microsoft.We are mainly volunteers here.Due to privacy restrictions we have no access to your private details to be able to assist you here.I suggest that you contact the Microsoft Store:Returning items you bought from Microsoft for exchange or refundStore help - Microsoft SupportCheers."]},{"symptom":"how can change shortcut Win+Shift+ S to other shortcut combination?        how can change shortcut Win+Shift+S to another shortcut combination?","solutions":["Hi RXaverius I am sorry, there is no setting or registry edit to change that screen snipping shortcut in Windows 10, is that shortcut interfering with other functionality on your PC?","I was wonderingI do find it difficult to press Win Shift S and I would like to change to another Win option without Shift"]}]}