{"windows":[{"symptom":"I installed windows 10        I installed Windows 10 on my 8.1 computer several months ago. I just hate it, but I thought I would try to like it  but I hate it! Now windows will not let me get my windows 8.1 back!I will delete every thing on my computer if I have to!  I want my Windows 8.1 back!How do I ever get it back?","solutions":["You can download the Windows 8.1 ISO from Microsoft. You can create a bootable DVD or USB in which to reinstall Windows 8.1 from scratch. I suggest you backup your existing data prior to doing so.","Hi KittyCatBluez How long has it been since you upgraded to Windows 10, is that more than 10 days?If not, then go to Settings - Update and Security - Recovery You should be able to roll back that upgrade from there If not, then your only option would be to backup your data and clean install Windows 8.1 . . .You can reinstall Windows 8.1 at any time, you will not need a product key and it will not cost you anything !Since you previously had Windows 8.1 installed and activated on that PC during the installation process skip the steps which ask for a product key and select the option 'I am Reinstalling Windows 8.1 on this PC', and activation will not be an issue, your PC will have a digital entitlement stored on the Microsoft Activation Servers Make sure you install the same Edition of Windows 8.1 (Home, Pro . . . etc.) you previously had installed to avoid Activation issuesClick this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Windows 8.1 ISO file Then click this link to download a tool from Microsoft to create the Windows 8.1 Installation media on a DVD or USB flash Drivehttps:\/\/www.microsoft.com\/en-us\/download\/detail...Then, Boot your PC from the Installation Media you just created (change Boot Order in your BIOS) to begin installing Windows 8.1"]},{"symptom":"Download second install on a desktop PC?        I have Office on my Surface laptop but I would l like to use my second install to load it on my desktop PC","solutions":["Hi Pat Do you have an Office 365 subscription or the standalone Office 2016 or 2019 version of Office?1 If you have Office 365, this will be no problem, you can install Office on a ll your devices, your account is now managed online and there will be no need for a product key:Go to http:\/\/www.office.com and if you're not already signed in, select Sign inOn that page, find your subscription and click Install . . . 2 If you have Office 216 or 2019, I am sorry, you can only install that on one PC or Mac at a time. You can move your licence to the PC using the same steps as above, that will however deactivate the install on the Surface . ."]},{"symptom":"Why Windows Update reinstall previously uninstalled Windows product key?        Hi,I moved to new PC, so I removed windows product key from old PC via \"slmgr.vbs \/upk\", then installed windows10 on new PC with product key from my Win7 Ultimate BOX. Everything was OK. Windows was activated on new PC and on old PC windows was without a license. After six months I wanted copy something from old PC so I started it and Windows asked to install critical updates, installed version 1903. After this and reset nothing strange happen but after some time when I was digging into system I found that this windows have again product key. ****? Why? How to prevent windows updates from reinstalling previously uninstalled Windows product key?","solutions":["Hi Szyy, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Because Windows 10 uses a digital license, you are shown a generic key in the Settings. A digital license allows a transfer of a license without a product key and a reinstall. You may share the last 5 characters to confirm the same - no worries."]},{"symptom":"Is there a deference between (Uninstall) & (remove)?        HiDo the following tracks give the same results? 1-Settings ===> System ===> Apps & features ===> Microsoft Office ===> \"Uninstall\"2-Settings ===> System ===> Apps & features ===> Microsoft Office ===> Modify ===> \"Remove\" Thanks ","solutions":["Hi Alaa Yes, both those options will have the same outcome, your Office installation will be uninstalled . . ."]},{"symptom":"On screen appearance        I have a brand new Dell desktop computer with Windows 10. The \"windows\" all look very industrial...nothing like they do on my laptop with Windows 10. What causes that? It really messes up my softwares that open in windows. ","solutions":["Hi RGHuff please do NOT call the number the scammer has left, the moderators will remove the post shortly.i suspect this is down to some personalisation settings, could you post some screenshots, so that we can see the issue. (and perhaps one from your laptop so that we can see how you like it set)"]},{"symptom":"unable to print full page from email.        Unable  to print full page from email.  Tried moving L and R borders removing list from LHS, using both print icons (1 from the page it's self and 1 from the task bar at top of window), there isn't many commands\/options available on these two shortcuts.  As far as I can tell all drivers are up to date as is the email system (bt.internet.com), have run the diagnostic program for the printer and that's OK. I am using my router to connect to printer and that connection appears good.  And , of course I want his email printer yesterday -- it's driving me up the wall.Can any one out in the cyber help, please ??      DaveFrance623","solutions":["Hey Dave, Evan here an independent adviser hopefully I can assist you. Is this a link in your email you're trying to fully print out or is it the email itself? Also, which email program are you using, Window's Mail app or...something else?Please let me know some more information before I can assist you further. Sometimes when something is being incredibly stubborn I use the Snipping tool function in Windows to copy and past my screen to a file that generally prints phenomenally well. It's a little out of the box thinking that I think may help you in this New Year :) Also, what model printer are you using? There may be a setting we can tweak."]},{"symptom":"Someone Keeps Joining My Microsoft Family        A complete stranger keeps adding themself to my Microsoft Family. I've removed them each time. Should I be concerned?","solutions":["Only parents could add new member, is there anyone else has admin or parent administrator?Try change your password and ask other parent (if any) t change password.","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. 1. Please refer to this page and perform the steps to remove someone from the Family Group.https:\/\/support.microsoft.com\/en-in\/help\/402770...2. Change the password of the Admin account."]},{"symptom":"Windows 11 in 2020?        hello dearFree Windows 11 beta in 2019 \/ 2020?your pc windows 10?you want windows 11?goodbye windows 7 2009 - 2020","solutions":["Hi Seifeddine1 there will be no windows 11, as part of windows as a service, windows 10 will be upgraded twice yearly.windows 10 may be renamed to just Windows after the end of windows 8.1. we will have to wait and see.windows 7 is reaching the end of its supported life, this does not mean it will stop working, just that it will no longer get security updates and fixes.","windows 11 year 2020","hello dearFree Windows 11 beta in 2019 \/ 2020?your pc windows 10?you want windows 11?goodbye windows 7 2009 - 2020","My PC is windows 10"]},{"symptom":"When I start computer I get this message:  Not provisioned?        When I start computer I get this message:  Not provisioned???  Help * Original title: windows 10","solutions":["Hi, MargaretAshley My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Check this link, I hope it helps https:\/\/www.tenforums.com\/software-apps\/112888-...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I'm very sure you see more than the two words \"not provisioned.\"Based on the very limited information you provided, I'm going to guess that you need to contact your ISP and ask them to connect you to the internet."]},{"symptom":"Updating Display adapters causes windows to stutter        So, recently I've been facing quite a strange issue with my HP all-in-one 18 5201ix. Now my PC is a potato on it's own but at least I was able to play some great game titles on decent settings but recently my display adapter is behaving in an odd manner.My PC has an AMD radeon R2 with integrated graphics but when I have the proper drivers for it installed, my pc starts randomly stuttering and freezing (freezes for a little bit and then continues as normal before freezing again) but when I uninstall the drivers and run on Microsoft Basic Display adapters, My PC works just fine but the only problem is Basic Adapters can't run anything even Minecraft doesn't start, just says OpenGL rendering not supported.So, Great folks at Hovatek, I really need your help in dealing with this issue, How can I install the drivers for my chipset without my PC just freezing every other second.Thanks in advanceP.S- My PC used to work just fine like 6 months ago with proper drivers installed, the issue has started only recently, I also tried installing old drivers but that didn't help either. Also, Even with the drivers installed, My PC runs fine if it's on safe mode.","solutions":[]},{"symptom":"Sierra Wireless Cellular Modem not working        Recent updates have caused my cellular modem to stop functioning. All drivers are up to date. The modem functions perfectly on an older Win 8.1 machine. Have tried using the modem on three other systems that are all operating Win10 and all previously worked. All have the same issue. Modem software shows a strong signal, but no network activity. Uninstall, reinstall, all have no impact. Two systems are Win 10 Home, and one is Win 10 Pro. Same issues. Diagnostic is a joke, produces no faults, and no information. I think there is a conflict between Win and the modem software. I am unable to turn off the \"Let windows manage this connection\" check box that shows up under the connection indicator in the notification view.Do I need to revert to 1803? That sucks.Similar issues have been reported since September. When will it get fixed?","solutions":["Hi Blaise. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Consult the modem's manufacturer for newer firmware or how to do a hard reset and optimize it's settings.  Also ask if it is supporting the recent Windows 10 version Updates and if not whether they plan to have patches or a newer version.The Support for Sierra is here: https:\/\/www.sierrawireless.com\/If it's within the first year they must get it working or replace it. If nothing else works I'd replace it. Update your network adapter drivers from the PC maker's Support Downloads web page using the full model number, HP Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.If you have the latest network driver then try on it's Driver tab also to Roll Back, or Uninstall and then restart PC to reinstall the driver. Try also all older drivers from Update Driver > Browse > Let Me Pick list working backwards.Go to Device Manager > Network Adapters, select modem adapter, then Power Management tab, clear the check box to \"Allow the computer to turn off the device to save energy.\" Then on the Advanced tab disable any energy-saving options.If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool explained here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them.If this was caused by Version update then you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool. Enable IPv6 in the network adapter settings: https:\/\/www.tenforums.com\/tutorials\/90033-enabl...Run the fixit from https:\/\/support.microsoft.com\/help\/929852 (Re-enable IPv6 on all nontunnel interfaces) and reboot.Right click the network icon in System Tray at bottom right end of task bar to Troubleshoot Problems.Try all of these steps: https:\/\/support.microsoft.com\/tr-tr\/help\/10741\/... https:\/\/www.kapilarya.com\/how-to-reset-network-...Go to Settings > Network & Internet > WIfi > Manage Known Networks, highlight and remove the network having problems, restart PC to see if it shows up again.Try plugging in by ethernet cable to the router to compare, then plug the ethernet cable into the modem (if separate) to see if this might be an issue with the router.Try powering off modem and PC and then restarting in that order with 1 minute in between each. You also are entitled to Support from your internet provider to get online on all devices. This is always included in the monthly bill. If your router is less than a year old they will also Support getting it connected and optimized.Another option is you could replace the wireless adapter with an inexpensive USB nano adapter like this one:https:\/\/www.amazon.com\/OURLiNK-600Mbps-Wireless...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it. ","Hi Greg,Thanks for your response -  as comprehensive as it was, it is not appropriate to the problem. My problem is not WiFi, that works fine. It is not a network issue. When connected by cable or WiFi, everything works as expected. It is not a router issue either.The problem is a piece of hardware - a modem that plugs into a USB port and provides data access via cellular service. AT&T in this case.I have been using Windows since version 3 and am broadly familiar with installing and troubleshooting. I'll walk you through some of my efforts to see if there is something that I missed.Unplug. Re-start. Plug back in. Verify updated drivers. Check network is recognized. Check properties. Uninstall modem software and drivers. Reinstall. Uninstall and install older drivers and software. Confirm correct FW for the modem. Try it on another machine. Try it on a 3rd machine. Install software from manufacturer (Sierra Wireless). Same results, appears connected, recognized, strong signal reception, no data transmitted or received. Uninstalled all associated drivers and supporting software, uninstalled the device, suppressed the embedded installation software in the modem in hopes that windows update would find and load a driver. I also tried switching to airplane mode, then turning that off to act like a switch. That did nothing either. I tried switching from a USB port on the machine to a tethered\/powered USB port. I also tried using the compatibility switch on the driver. As far as the computer knows the device is working. I just can't figure out why it does not xfer data.Ran diagnostics software multiple times. In all cases informed that there are no issues - and yet still cannot access the internet. Got a new SIM card, no change.On the chance the modem itself was failing I tested it on an older laptop with Windows 8.1 installed. And it worked exactly like it is supposed to. The modem itself is fully functional.I think the conclusion is clear. Something in Win 10 build 1909 18363.535 (or more likely a periodic quality updates) might be the problem. As the last time the modem was working was 11 December - the same day that some updates were installed.The modem has good error reporting tools. My problem is I'm not sure what all of it means.One more option I am going to explore is I have another machine with the same Win10 build but has not been updated (or used) in several months. I'll put the modem in that machine and see if the issue replicates.Hopefully this more granular background will give you a better understanding of the problem.","Thanks for clarifying. If this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Update History, then uninstall them from the link there, and immediately check for these again and hide with the Hide Updates tool explained here: https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... You can also use System Restore from within Windows to get back before the problem began, then check for Updates with the Hide Update tool and hide them:https:\/\/www.windowscentral.com\/how-use-system-r... You can also contact the modem manufacturer (I provided a link earlier to their company) to find out if there are known issues after recent Updates and if they plan to patch them or want to provide another modem that works with recent updates.If you want to report this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems.If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it. If you are an Insider I can also vote it up with my MVP badge and track the issue for you.","Hello again Greg,An update. I installed the cellular modem on another Win 10 laptop (same configuration as my main LT) but that had not been updated since August. Version 1903 18362.295. Same conditions, the modem works fine as a wireless receiver, but although showing a connection and robust signal from the cellular network, will not allow an internet connection.On a hunch, I forced an IPv4 IP address (a known AT&T private address) and a generic DNS (8.8.8.8). That worked, sort of. There now appeared to be an internet connection indicated, and there was actually data passed (uplink and downlink). However, web pages still would not connect and open.Not sure what this indicates, as generically internet connections are supposed to be dynamic and select IP and DNS addresses automatically.Any thoughts?","I'm sorry I'm not that familiar with the modem. I would ask their Support or Forums.You could also try Google Public DNS to test it: https:\/\/developers.google.com\/speed\/public-dns\/..."]},{"symptom":"Microsoft Update Best Practices - Windows 10        I have a classroom of 30 laptop computers running Windows 10.  I am constantly having to run \"Check for Updates\" and \"Check online for updates from Microsoft Update\" to keep all my laptops running and updated.  What are thebest practices to keep my laptops updated automatically without having me to manually run updates myself?","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Windows 10 will keep the PC updated automatically without intervention, you will have to keep them switched on during the maintenance window however which can be set by following these steps:https:\/\/www.windowscentral.com\/how-manage-autom...The only additional steps which might need taken are periodic restarts but each PC will prompt the user for that if needed.Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"TWO WindowsImageBackups...only ONE shows up to restore from        I created a system image of my pc on 12\/7\/19  after i ran all of my scans, I saved it to an external hard drive. Later my pc started acting very odd, so odd that it would not even reset!, After many days of frustration, i finally got it to reset with some files intact, using Support Assist.. after adding browsers apps etc, my pc still felt 'odd' to me.  so i decided to once again create a newer system image and stored it on the same external hard drive as the first one. 1TBIn my external hard drive under the tab named WindowsImageBackup, there are TWO files one named DESKTOP, and the other is LINDA, so i changed the name of Linda to WindowsImageBackup1 since its from 12\/7 and was the FIRST, i went to system restore, did not see either of those names, just 'System Image Restore Point' and Automatic Restore Point both made 1\/2\/20...(DESKTOP) there was no sign of my first windows image even when i checked \"show more restore points\"... so after all that over explaining (sorry), im wondering why I cant restore my pc back to 12\/7??I thought about replacing the numbers from Backup 1\/2\/20 with the numbers from Backup 12\/7\/19  pasting the original numbers elsewhere so i can put things back as they were...so can you please assist me with this issue?...I want to make this REset as close to the PREset as i can.  any ideas??","solutions":[]},{"symptom":"Microsoft mail        I dont use Microsoft mail. Can I uninstall it without any impact on other programs?","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.If you don’t use it you can safely uninstall and it won’t cause any issues. Regards, Ross","thank you, but the uninstall button is gray, won't allow me to uninstall. is there another way?","It's safe to uninstall the Mail app. You'll need to do the uninstall with a command line that's widely available on the internet.With that said, there's no need to uninstall Mail. If you don't want to use it, don't use it. Mail is doing no harm to your computer through the mere act of being there, and it consumes a minuscule amount of system resources.","Hi, It’s a little more involved to remove then other apps, but here is a guide that explains it:https:\/\/www.windowscentral.com\/how-remove-mail-...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","i don't like that it has scraped or migrated all my go daddy messages. I usually give this app no attention so I don't know how, why it is all of sudden showing and using my email from an on line account.  And it pops them them up on the lower corner of my screen.  ","Do you sign-in to windows with your Microsoft account, if you do it becomes the default account in the Mail app. If you don't want the Mail app to display your mail then open the app and select Settings (the gear icon) and delete the mail account.All your mail is safe on the email server.","It’s likely that account has been registered in Windows at some point, you can remove that account from mail, or just uninstall the app altogether as I gave details of before,Regards, Ross"]},{"symptom":"Win10 Pro Remote Desktop WoL Login        I'm buying a full version of Windows 10 and am not sure if Pro will solve my issue with remote desktoping. In short, I need to be able to turn my computer on and login when I need to. I have no problem using WoL, but I can't login. Some services like Teamviewer will load using the app, when coming out of sleep, but if the pc was off that doesn't help. Will remote desktop login after WoL. I'd rather not waste $100 on a feature that doesn't exist.","solutions":["Hi X. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.You'd need to Wake on LAN with a Magic Packet as shown here: https:\/\/www.groovypost.com\/howto\/enable-wake-on...It's still basically the same as here in WIndows 8: https:\/\/superuser.com\/questions\/696894\/rdp-wake...I recommend TeamViewer and AnyDesk which are free and much more reliable: https:\/\/www.gb-advisors.com\/teamviewer-vs-anyde...Wake On Lan with Teamviewer: https:\/\/community.teamviewer.com\/t5\/Knowledge-B...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Well the real answer to the question was why did I ever turn off load Teamviewer on Windows in the first place. Also answering the question can any other RDP log in to Windows. Where the moot question can Win 10 Remote Desktop log in to the lockscreen remains unimportant. Prolly why nobodies asked the question. Guess I'm not going pro. Save my money and get Server.","Glad to help. Let me know if there's anything else. Also when ready please mark the post which helped most as the Answer, to help others.Happy New Year!"]},{"symptom":"printer only prints in landscape ?        i have Brother HL- 2170W printer and downloaded printable fax cover sheet from internet . but when printing it always prints in landscape even though i changed it to print in portrait mode, why does not print in portrait mode ?","solutions":[]},{"symptom":"Is there a deference between (Uninstall) and (remove)?        HiDo the following tracks give the same results?1-Settings ===> System ===> Apps & features ===> Microsoft Office ===> \"Uninstall\"2-Settings ===> System ===> Apps & features ===> Microsoft Office ===> Modify ===> \"Remove\"Thanks ","solutions":["Basically no, Uninstall is just a quick way to get to uninstall but is the same as Remove from the app\/program itself."]},{"symptom":"changing User Profile on Laptop        Dear all,thanking you in advance for reading this post.I got my laptop a year ago.  At the time, I had a Yahoo! e-mail address.  I used this e-mail address to get started on the laptop.   I closed this e-mail account with yahoo! a few months back.  But, sadly,  my laptop still thinks address is valid. I now have an Outlook e-mail address.  How could I change my sign-in details, so that this is now reflected? YoursMarek","solutions":["Hi Marek Log into your Microsoft Account online: https:\/\/account.microsoft.com\/ Go to Your info at the top of the page Select Manage how you sign in to Microsoft You may be asked to verify your account before changes can be made. Follow the instructions provided to select your alias: Select Add Email and follow the prompts . . ."]},{"symptom":"Problem Printing Multiple Copies in MS Word 365        I'm running MS Word 365 MSO (16.0.12228.20322) 64-bit.When I try to print multiple copies of the \"current page\", I get multiple copies of the preceding page. Likewise, the same thing occurs when I specify the \"page number\". If I specify 4-copies of page 53, I get 4-copies of page 52. What am I doing wrong? I used this same procedure many, many times without any problems.","solutions":["Hi Heavy-Duty, My name is Riccardo and I will be happy to assist. We are going to do this a few different ways to ensure we fix this at the end of the day for you.First, can I get you to print something (like a PDF) in current page and does that work? This will isolate if it is a print driver problem or Office 365 issue...If it is a Office 365 issue go to Start > type in Add or remove programs > go down to Office 365Click this and click Modify and do a repair install to see if this fixes the issue. Alternatively, we can reinstall your printer drivers...what is your printer manufacturer and model?Let me know I will be here to assist.","Hi Heavy-Duty, My name is Riccardo and I will be happy to assist. We are going to do this a few different ways to ensure we fix this at the end of the day for you.First, can I get you to print something (like a PDF) in current page and does that work? This will isolate if it is a print driver problem or Office 365 issue...If it is a Office 365 issue go to Start > type in Add or remove programs > go down to Office 365Click this and click Modify and do a repair install to see if this fixes the issue. Alternatively, we can reinstall your printer drivers...what is your printer manufacturer and model?Let me know I will be here to assist. Printing the PDF - current page - 2 copies WORKED FINE.After modifying Office 365 both offline and online:Printing the Word Document - current page - 2 copies DID NOT WORK AS SPECIFIED. The preceding page printed twice.Also, printing - custom page 4 - 2 copies DID NOT WORK AS SPECIFIED. Part of page 3 printed twice.I am using a HP ENVY Photo 7855 all-in-one printer.Something has happened in the past couple of weeks. Prior to this time period, I had no problem like this.","Ok so it looks like your print driver is good. Can you try two things: Print multiple pages choose the page that you want and see if it only prints that.Then try printing current page in safe mode. https:\/\/support.office.com\/en-us\/article\/Open-O...","Ok so it looks like your print driver is good. Can you try two things: Print multiple pages choose the page that you want and see if it only prints that.Then try printing current page in safe mode. https:\/\/support.office.com\/en-us\/article\/Open-O...My grandson suggested printing a multi-page document other than the one I was having the problem with. The other document printed as expected in normal mode.The problem document was unique in that I was using the Table of Contents feature. It still erred in Word Safe Mode. Perhaps the print problem is unique to documents that have TOC's?","It may be tied to that. I will run some tests on some of my documents and let you know. It may also be just that particular document.","It may be tied to that. I will run some tests on some of my documents and let you know. It may also be just that particular document.Thanks for all your time. I truly believe that documents with a table of contents is the key to that particular printing problem since they are internally page oriented.","No problem. Have a great day!"]},{"symptom":"Enabling AMD AMF Causing Black Screen Recording In Mirillis Action! 4.0.3        Hi Community,                       Recently I updated Mirillis's screen recording software Mirillis Action! from version 3.10.2 to 4.0.3. In my case the previous version works fine. I can use the feature \"Hardware Acceleration\" by selecting AMD AMF (Advanced Media Framework) from the options. But in recent updates, by enabling this feature causes black screen recordings. If I disable it and record my screen it works fine. So, I updated my graphics driver and reinstall mirillis action. But the problem remains same. Any help appreciated. Thanks.","solutions":[]}]}