{"windows":[{"symptom":"Microsoft Family Features        Every 5 minutes a pop up will come up asking for me to sign back into my Microsoft account so I can send requests when I need more time on the computer. There is a button to sign in, but whenever I click it, it just goes to a loading \"Just a moment\" screen, which disables me from logging in, causing the pop up to continue appearing. It is very annoying and I would like it fixed because it kicks you out of whatever you were doing at the moment to give you that stupid message. Please help","solutions":["Hi Compuuter, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Try the following: https:\/\/support.microsoft.com\/en-us\/help\/402770...Let me know if you have something else that I can help you with, I'd be happy to help.Happy nice day Regards, Marc M."]},{"symptom":"BugCheck 1001 Memory Dump        Hi,A user's laptop recently got the BsoD, but I haven't been able to figure out the root cause.Checking in Event Viewer showed the following BugCheck event:The computer has rebooted from a bugcheck.  The bugcheck was: 0x0000010d (0x0000000000000005, 0x00007bfadff1c978, 0x0000000000001018, 0xffff84051dfeadf0). A dump was saved in: C:\\WINDOWS\\MEMORY.DMP. Report Id: 7c8a110f-3271-4dd4-afda-645907459133.I do have the DMP file in OneDrive, but the link shows my company username so I won't be posting it publicly. If this is required, please let me know and I'll share the link via other means. Thanks in advance!","solutions":["Hi Daryl Rather than that Memory Dump, can you please check to see if the PC created any minidump files, and if so, upload those as a separate download . ..Open Windows File Explorer Navigate to C:\\Windows\\Minidump Copy any minidump files onto your Desktop, then zip those up Upload the zip file to the Cloud (OneDrive, DropBox . . . etc.), then choose to share those and get a share linkThen post the link here to the zip file, so we can take a look for you . . .","Thanks for the minidump suggestion Dave. Here is the ZIP file:https:\/\/drive.google.com\/open?id=1_LlKm8cy02jhclYxd7iXSIBehIO7wdB7","Hi Daryl The minidump file indicates TeeDriverW8x64.sys as the root cause of the system crashes, that driver is associated with the Intel Management Engine InterfaceThere is a version of that driver available for download form the Intel website, though the best version of that will be available from the support page for your PC on the manufacturers website . .https:\/\/downloadcenter.intel.com\/download\/28679...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","Hi Dave,Thank you for your help! I'll try updating the IMEI driver to see if it resolves the issue.","Hey Dave,Looks like the drivers are up to date.. do you think it's worth it to uninstall\/re-install the IMEI driver completely? I was hesitant as I'm not sure about the repercussions of uninstalling the driver. Event Viewer also showed the following message:\"The computer has rebooted from a bugcheck.  The bugcheck was: 0x0000010d (0x0000000000000005, 0x00007bfadff1c978, 0x0000000000001018, 0xffff84051dfeadf0). A dump was saved in: C:\\WINDOWS\\MEMORY.DMP. Report Id: 7c8a110f-3271-4dd4-afda-645907459133.\"Any ideas?","Hi, Try to disable the Intel Management Engine in Device Manager."]},{"symptom":"*** Email address is removed for privacy ***        hello then, I am trying to enter my word and I made a free pre-registration. but I can not open it what's going on?What should I do already tried to correct the error thousands of times. I really need help !!one dri","solutions":["one drive","Don't call that number above, it's spam.","Hello, iazinhamaro,Would you please be more specific?Where are you trying to enter a word?Where did you pre-register?"]},{"symptom":"Minecraft launcher wont open        Hello, I bought minecraft java a while ago, two days ago i updated my pc to the new windows, after doing this, i can no longer open the minecraft java launcher so i am not able to play. please help thanks","solutions":["Hi Hawk680, I'm Roshan V S, Windows expert and a Windows user like you. I appreciate you for providing details about the issue and we are happy to help you.1. Run Minecraft as administrator 1. The privilege issue might be the reason for this problem. With high integrity access, Minecraft can make full use of its features, so run Minecraft as an administrator to see if this fixes your issue.2. Right-click on Minecraft and from properties choose Run as administrator. 2. Use the Compatibility mode 1. Right-click on your Minecraft and choose Properties. 2. In the Compatibility tab check the box Run this program in compatibility mode for.3. Choose the operating system on the drop-down menu. 4. Click Apply > OK. 3. Update your video card driver The “Minecraft won’t launch” problem is probably being caused by driver issues after the windows update.4. Re- install Minecraft 1. Navigate to C:\\Program Files (x86)\\Minecraft. 2. Double click uninstall to uninstall Minecraft. 3. Download and install the latest version of Minecraft. Do get back to us with the result. We will be glad to help if you need further assistance.Best Regards Roshan V S Indepedent Advisor","My minecraft game is updated to the latest version, i have tried both compatibility mode and running as administrator, and i have updated my video card drivers, but the launcher still won't launch please help","I have the same problem! \"New challenge for new year\"... minecraft -__-","I found a fix for why \"my\" Minecraft desktop app won't open. It's because my launcher profiles are corrupted. So it works again after I deleted them. Search in Windows for %appdata% then open the \".minecraft\" folder. Find the file called \"launcher_profiles.json\" and delete it. After this, you need to install all your previous profiles manually.I hope this helps you! If not, try this: go to programs and uninstall Minecraft from there. Then delete the \".minecraft\" folder. Lastly, download Minecraft from minecraft.net and install it again. This guarantee a fresh Minecraft game installation.If this still doesn't help, try updating your java.","Thank you very much! It works perfectly after deleting the launcher_profiles.json folder. Seriously can't thank you enough.","You're welcome! I was having a big headache from this problem myself! Glad to relieve everyone of the same problem!"]},{"symptom":"1909 updat frozen        I clicked update windows 10 1909. It is frozen at 99%. According to microsoft :Open file explorer - type C:\\$GerCurrent press enter. Nothing comes up when doing that. It just endlessly says \"searching\". I also went to view and checked \"hidden items\". I do not see $GetCurrent. Kinnda weird instructions anyway, it says. Copy and paste media folder fro getcurrent to desktop restart PC, copy and paste media folder on desktop to toC:\\GetCurrent. That doesn't seem to make sence. Last time I tried updating same thing stuck at 995 and ended up with a black screen and $150.00 teck support bill.","solutions":["You did not go to Microsoft but one of the scammer.  Microsoft support does not charge you.","Hi Todd. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I would manually upgrade to the latest version 1909 by opening the Media Creation Tool from this link:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m..., choose Download Tool Now, then open the tool and choose Upgrade This PC Now. This saves your files, apps and most settings in place, is the most stable method to change versions, brings your Updates current, resolves most problems. If any problems report back the verbatim error and number, then continue with these steps for overcoming Version Upgrade problems:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If the Version has problems I will work with you to try to resolve them. If the problems are unfixable for now, you have ten days to roll it back in Recovery settings. You can then hide it so it doesn't try to reinstall following this same method:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... Most problems are resolved by doing this gold standard Clean Install which should get you past all difficulties as it has millions of others who have followed the steps in this link and never come back to report another problem:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... . So read it over and see if its something you want to learn to do.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to rate my post, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Onenote        On the OneNote screen: I cannot see the far left side of the screen. For instance, the \"+Add Notebook\" option is not visible. Tried adjusting width by dragging the borders, tried \"Full Screen\" option, tried everything. What about re-installing? Any ideas? ","solutions":[]},{"symptom":"System freeze every 26 hours, Windows Defender causes system freezing        Hi Guys,This really hit me badly. Hope I can get some ideas from all of you!I had this mystery for several months now. a production server appears to be freezing every 26 hours. during the freezing, I can not RD to it, IIS sites hosted on it are not responding. the freeze lasts around several minutes then everything back to normal. The server is not on heavy load, has plenty available memory and disk space, up to date.Yes, it's every 26 hours. (I can't figure out why)Say it happened at 1AM on day 1, then 3AM on day 2, and 5AM on day 3 then keeps going till 11PM, then 1AM  again.It's Windows Server 2019 Standard 1809, OS build 17763.914After trying quite long time, I was able to locate the cause to be related to Windows Defender scheduled tasks. But how to I 'fix' it?In Task Scheduler, (Task Scheduler Library, Microsoft, Windows, Windows Defender), there are 4 tasks listed.1. Windows Defender Scheduled Scan2. Windows Defender Cache Maintenance3. Windows Defender Cleanup4. Windows Defender Verification#1 is ok. It has one trigger defined to run at 2:30am everyday, and always run at scheduled time (at around 2:30~2:50am everyday)#2,#3 and #4 are the tasks that run every 26 hours(none of them has trigger).  Task history shows they were running 5:02am on day 1, then 7:02am on day 2, 9:02am on day 3. Yesterday they run at 8:10pm. These time match system freezing time. This results in trouble especially when they are on their 'day shift'.Could anyone share thoughts on how to change the every-26-hour behavior, so that at least I can schedule them (task 2,3, and 4) to run during night time?Or even better, to make them not cause system freezing, but seems that would be even more complicated.Appreciate your help!          ","solutions":[]},{"symptom":"Windows 10. I have stuff to do. Where are my files?        Will try not to swear... like ****. Everything used to be OK, I have video files on laptop and USB, using Wondershare Filmora9 video editor I could import with ease. Now I am on Windows 10 and when I try to import files they are not there, if I switch off Filmora9 then the files are there, switch on Filmora9 and they are not. Trying to use the Windows Video Editor I get the same results even if I specifically copy the and move the files to a place like desk top Where they should be easy to find...when I try to import them they are not to be found. Windows 10 and Microsoft, I would like to offer you a four letter word four you to keep some dark and warm for every minute I have already and doubtless will waste in the future with you. ","solutions":["Go Settings, Apps, Default apps, Choose default apps by file type.  Scroll down to the file type. click on it and see if Filmora9 is there.  If so click on Filmora9 and the files should show there."]},{"symptom":"My GMail stopped receiving e-mails?        As of January 6th my gmail acct. stopped receiving mail! Was working fine before that!","solutions":["have you asked Google as Gmail is their program.https:\/\/support.microsoft.com\/en-au\/help\/2994411\/how-to-set-up-email-account-in-the-mail-app-in-windows-8-1To add an account to the Mail appIf the email address for your Microsoft account ends in outlook.com, live.com, hotmail.com or msn.com, just sign in to your PC. Go to the Start screen, and open the Mail app—your email is waiting for you.If your email address ends in a different domain, like gmail.com, yahoo.com, or comcast.net, here's how to add it.On the Start screen, tap or click Mail. Swipe in from the right edge of the screen, and then tap Settings.(If you're using a mouse, point to the lower-right corner of the screen, move the mouse pointer up, and then click Settings.)Tap or click Accounts, tap or click Add an account, and then tap or click the type of account you'd like to add.Enter your email address and password for the account, and then tap or click Connect. "]},{"symptom":"How to hide text in a DOC or RTF document?        Is there an easy way of hiding small amounts of text in a document?  It shouldn't take up any room and shouldn't be visible if the Select All option is used and it should be able to be used with simple word processors like Wordpad and Jarte.  If that's not possible could it be done with more advanced word processors like Word or Libre Office?","solutions":["Hi, Bob,It can be done using Word. If you don't have Office use the free Web App in your OneDrive menu or go to MSN.com and click on the Office icon.https:\/\/www.howtogeek.com\/363893\/how-and-why-to-use-hidden-text-in-a-word-document\/Edit: I just came across this document on hiding text in Notepad. I do not see a date for when the article was written so it may be obsolete.https:\/\/www.finetrick.com\/2014\/03\/hide-text-in-notepad.htmlThen this document by Andre Da Costa, MVP shows how to Hide Text in an Image File. It too uses Notepad.https:\/\/www.groovypost.com\/howto\/hide-text-inside-image-files\/"]},{"symptom":"Windows 10 can't locate drivers for USB drives as well as new Internal drives        I have 4 Western Digital Elements portable drives. It see's one of those drives. When I plug in one of the other's, the drive appears in device manager with a \"?\" . When I look in \"Bluetooth and other devices\" it shows\" Elements 107C\" driver is unavailable.I purchased a new WD 6TB internal drive to replace an existing WD internal 500gb drive. It's a WD60EZAZ WD BLUE. When I disconnect the 500GB and install this one in it's place, windows see it by the correct name but can't locate a driver for it. I pull all the drives minus the 6TB drive, boot a windows 10 Install CD and can partition the drive. Re-install the other drives and boot from windows 10 and same issue. Both drives have tested good. It seams like something got corrupted in windows 10 but can't figure it out. I even tried de-installing Acronis True Image, rebooting and same. I booted windows into safe mode with networking and same issue.To prove the 107C drive is good, connected to a laptop works fine plus when I boot using the true image boot CD, the drive can be accessed. ","solutions":["If you leave the drives installed in separate USB ports you can go to Disk Management (win + X) and it will give them a letter or if partitioned it may give more letters.","Thanks , Yeah no it's not a drive letter issue, I have experienced that problem in the past. Windows can't locate a driver for it, shows that in device manager. Does the same for a new drive attached to a SATA port.","In Device Manager did you go to the top and Scan for hardware changes?"]},{"symptom":"Windows XP 32 bit on Hyper-v windows 10 has no Integration Services        Happy New Year.I installed  clean Windows XP 32 bit professional on Hyper-v Virtual machine in windows 10. In Hyper-v management, I check mark all the boxes. The mouse arrow stays in XP window till I hit Ctrl+ ALT+ Left arrow key. Then I can go to Desktop. Also, I can not access Thispc's  C:\\ drive and all the USB data drives.  Only things are accessible is ROM drives. Also, I can't connect to Internet. I am lost.Thank you in advance.Please guide me ","solutions":["Yes, there are no integration services unfortunately because Windows XP is not supported in Hyper-V.Questions about servers is more effective to ask at TechNet forum https:\/\/social.technet.microsoft.com\/Forums\/en-... It is oriented to admins and corporate users, and this forum - to home users."]},{"symptom":"I brought windows 10 home on the internet from microsoft but got got windows 10 Pro do I owe more money        I brought windows 10 home on the internet from microsoft but got got windows 10 Pro do I owe more money","solutions":["Hi Noel. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.What is telling you that you got Pro instead of Home? Did you install Pro and it activated with the Product Key provided?Keep in mind that most installation media has both Pro and Home and requires choosing the correct licensed version. So what matters here is whether the installed Pro version activates with the key provided. If so then you are good to go.If you'll clarify the above I can help you better. You can also contact Microsoft Support by one of these phone numbers: https:\/\/support.microsoft.com\/en-us\/help\/405170...You can also go here: https:\/\/partner.support.services.microsoft.com\/... choose the link for Browser help, interact briefly about your exact problem, keep replying agent until it connects with an agent.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"games        Is there any way to make Microsoft Store games Moddable","solutions":["Did it answer your question? Modding Store games does not exist. I gave you three references about when and how it starts. If that answered your question then please mark the post which helped most as the Answer. Thanks.","Don, I gave you all I have on this so why did you rate my post unhelpful?"]},{"symptom":"hard drive crash, lost access to all files.        If my hard drive crashed on my Inspiron 15 3521, and I buy a new hard drive to replace it, do I have to buy another copy of Windows 10 that was installed on my OS?","solutions":["Hi dwl814 You do not need to purchase windows 10, because you have previously had windows 10 installed and activated on that device, you can reinstall windows 10 anytime you wish.to get the best install, with fewest issues, use the media creation tool to create bootable media and clean install windows 10.make sure to install the same edition of windows 10 (home, pro, etc) that was previously installedduring install, skip the pages that ask for a key, it will activate automatically when you go online.Greg Carmack's article can help in guiding you through a clean install https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"Is it possible to change the keybind to initiate dictation on Windows 10?        If possible, I would even like to use one of my mouse buttons.","solutions":[]},{"symptom":"Windows 10 error 0x8007003B after Definition Update on 1\/7\/2020        I'm getting an error 0x8007003B when copying any files to networked drives that previously had no issues.Even on very small files (<MB) explorer will freeze on transfer, and show this error, but the file will eventually transfer. this makes moving files very slow and its impossible to save files from within programs (like photoshop or word) directly to the networked drive.The odd thing is ive never had this issue before and the only software change is windows installed a Definition Update on 1\/7\/2020 in the middle of the night updating Windows Defender Antivirus - KB2267602 to version 1.307.1908.0things I have done to try and fix this- Network Reset- Reinstall network adapter drivers (I have an Aquantia® AQC107 10G Ethernet Controller)- disable Windows Search Service- disable all Windows Firewalls - remap network drives- new Ethernet cable","solutions":["Hi eliwoo, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Again try to disable your network Firewall in Windows while you are transferring these files, the cause this error is related to the Firewall.https:\/\/support.microsoft.com\/en-us\/help\/402854...If the previous step did not work, try the following https:\/\/www.thewindowsclub.com\/search-indexing-...If the error persists, try to start Windows through a clean boot, it is an error-proof process, which helps us to detect if the problem is generated by third-party drivers or programs, if the error does not happen after executing it, go to >> How to determine what is causing the problem after you do a clean boot https:\/\/support.microsoft.com\/en-us\/help\/929135...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","The Q & A I am responding to is not exactly what I am experiencing, but his and mine have common threads...I was doing a copy & paste from my shopping cart in Amazon Prime and I received a pop-up telliing me my files will delete soon- the cause was somethng to do with a Firewall threat and Windows 10 now corrupt. I closed that pop-up as qickly as it would allow and it has not returned; that was possibly 1 hour ago. This is a new place of business and our tenant database is growing. I wish for no loss of productivity on my end; most importantly, all the banking, DL images, addresses, DOB... the amount of personal data I am beginning to collect would severly paralyze personal normalcy and shred a person's identity and all the abilities that goes with your personal information... Please let me know if I am being ridiculously paranoid and what are my 1st simple steps to take when looking for signs of compromise? ","Hi Marc, thanks for your response.unfortunately I have tried all three and the problem persists.is there anyway to rollback Definition Updates?","Hi eliwoo My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.I would suggest the following 1. Run an anti malware scan 2. Disable anti virus and try copying the files again 3. Run the system file check utility Press Windows Key + X then click on Command Prompt(Admin). Now type the following in the cmd and hit enter: Sfc \/scannow sfc \/scannow \/offbootdir=c:\\ \/offwindir=c:\\windows Wait for the above process to finish and once done restart your PC. 4. Run chkdsk utility Click on windows button, type cmd and right-click “Command Prompt” and choose run as administratorIn the cmd windows type CHKDSK \/f \/r and hit enter. It will ask to schedule the scan in the next system reboot, type Y and hit enter.Hope this helps."]},{"symptom":"Xbox Game Transfer to PC        if I bought a game on my xbox is there a way I can get the same game on my pc and play it the same way I would any other game on my pc? I know you can stream your xbox to your computer and play like that but I want to get the good frames and graphics and play with my mouse and keyboard but i cant do that when I just stream the xbox to the computer","solutions":["Hi Chris. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.To play Xbox games in Windows 10 see here: https:\/\/www.thewindowsclub.com\/play-any-xbox-ga...https:\/\/www.xbox.com\/en-US\/games\/xbox-play-anyw...https:\/\/www.groovypost.com\/howto\/play-xbox-one-...For further information you can post in the Xbox forums here: https:\/\/forums.xbox.com\/en-US\/homeI hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Importing from windows 7 to windows10        How do I easily import my pictures, files, favorites from Windows7 to Windows10?","solutions":["Hi TomDavis101 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-us\/help\/422982...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"Battery charging failure on new laptop, Azus Vivo Book, windows 10        My laptop using windows 10 will not charge the battery beyond 59? It is set on factory default settings. what's up?\":","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.This might be because of the Asus Battery Health config. Asus laptops include this additional app to help preserve battery health. Asus explains its functions and options here:https:\/\/www.asus.com\/support\/FAQ\/1032726\/Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Regards, David"]}]}