{"windows":[{"symptom":"Bought new laptop, Lenovo V130. No sound        I bought a new Lenovo V130 laptop.  We transferred all from the previous laptop, but no sound on the new one.","solutions":["Hi, JohannGroble My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps. - Press ‘Windows key + I’ together to open ‘Settings’. - Click on ‘Update & Security’. - Click on ‘Troubleshoot’. - Click on ‘Playing audio’. - Click on ‘Run the troubleshooter’. You can also update the audio drivers. https:\/\/support.microsoft.com\/en-us\/help\/402844..."]},{"symptom":"dell OptiPlex 380 not able to boot                   my OptiPlex 380 is unable to boot unless I press a small button at the back of power supply. Also, the power dose not come on to the mother board.","solutions":["Hi Oscar As far as I can tell that is the PSU BIST (Built In Self-Test) button you are pressingBoot up your PC, then on the Dell Logo screen, repeatedly press F12 to bring up the Temporary Boot MenuChoose to run Diagnostics from that menu and if asked, do not perform the extended memory testDoes that diagnostics test indicate there is an error with your PSU?","Thanks, but when I press the power button there is response.","Hi Oscar I am sorry, in that case, most likely your PSU is faulty, your best option is to bring that to a PC shop, so they can put a meter on that to see if it working and also if is outputting the correct voltage"]},{"symptom":"how do i change the color of the search window (not the search box) to back in windows 10?        Hello, when I use the search bar in Windows 10 (which is black) the window that pops up above it is white and always hurts my eyes. How can I change it to black?","solutions":["Hello MrEpic9000, I am Sai, a Microsoft Community Independent Advisor. I would suggest checking that the color option in Settings --> Personalization --> Colors is set to dark.","It is already set to dark, as you can see in this screenshot. (I don't mean to be rude, I'm just showing the issue)","Okay, are you comfortable working with registry editor?","If so, in the Run prompt (WIN +R), type \"regedit\". If you get a UAC prompt, click yes. This will launch the registry editor. Then navigate to Computer\\HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Search\\Flighting\\0\\WhiteSearchBox and set \"Value\" to \"0\" instead of \"1\".","For some reason, I can't find WhiteSearchBox in Registry Editor, as shown in this video clip.So, am I supposed to create it or something?","Sorry about that. This registry entry does not seem to exist in the newer versions of Windows. You can try to go to Settings --> Apps --> Cortana --> Advanced Options and Reset Cortana."]},{"symptom":"Windows 10 Network        I have a laptop and a desktop networked together. I changed the name on my desktop and can no longer see it from My laptop. I changed the name back to what windows assigned it when I installed windows a week ago and I can access the files again. Was wanting to know what setting I need to find to allow me to change the name and still access my files from my laptop. Thanks","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please disconnect the computers from the Network and connect them again and set up a new Network.You may need to Enter a new Local IP Address."]},{"symptom":"windows won't load        screen says x:\\widowa\\system32>what do I type next?","solutions":["* Mergedscreen says x:\\windows\\system32>what do I type next?","Hi,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.The following steps outline the steps to fix Windows failing to boot and you can boot to the advanced startup options.http:\/\/www.yourwindowsguide.com\/2017\/05\/fix-win...\\Please let us know if you need any other assistance.","How did you get to this prompt, are you booting normally or have you inserted USB boot media, The fact ti shows X:\\ at the beginning suggest you are using the recovery environment.If you type exit and press return what happens.You should be able to power off using the power button but it's best to understand how you got there in the first place."]},{"symptom":"PC randomly, infrequently crashes.        I used to have crashing problems a while ago, but i seemed to have fixed them up until recently. Every now and then, very infrequently (happens maybe once a month with everyday use) my PC will lock up and freeze. There will be a small blue rectangle in the top left corner of the screen, the audio will freeze and repeat a single sound until i force my pc to turn off through the power button. Below is the windows reliability report, and here is the windows minidump:https:\/\/1drv.ms\/u\/s!Auj5-2Kp5dldceJTmNmqLAoh9L4?e=lfDoEhSourceWindowsSummaryShut down unexpectedlyDate‎04-‎Jan-‎20 1:19 PMStatusNot reportedProblem signatureProblem Event Name: BlueScreenCode: d1Parameter 1: 0Parameter 2: 2Parameter 3: 1Parameter 4: fffff8076d59828aOS version: 10_0_18362Service Pack: 0_0Product: 768_1OS Version: 10.0.18362.2.0.0.768.101Locale ID: 1033","solutions":["Hello FallenPixelz, I am Andrew an independent advisor. Thank you for all the info, most system crashes are caused by bad drivers or system files. To fix these I have some scans for you to run. They work best when your system is connected to the internet. Please follow: In the search bar, type cmd. Right-click on cmd.exe and select Run as Administrator. Type SFC \/scannow and press the Enter key. Re-enter Command Prompt as Administrator and run these: dism.exe \/online \/cleanup-image \/scanhealth dism.exe \/online \/cleanup-image \/restorehealth dism.exe \/online \/cleanup-image \/startcomponentcleanup Once you've done these scans go to your computer makers website and update all hardware drivers they provide. Both these actions should stop those blue screens for good.Take Care, Andrew"]},{"symptom":"What is Vulkan Runtime Libraries and how did it get on my computer        Vulkan Runtime Libraries  showed up on my Win 10 computer. How did it get there? is it safe? should I uninstall it?FRED","solutions":["Hi Fred Vulkan Runtime Libraries is a graphical render engine and that is normally installed on your system when you install or upgrade your video card device driver, if your video card supports the Vulkan RuntimeIf you have an Nvidia graphics card that supports Vulcan, you can download that form this link:https:\/\/developer.nvidia.com\/vulkan-driverIf you have a different video card, what is the Make and exact Model of you video card . . .________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]},{"symptom":"Your Phone Companion Not Sending SMS or many other notifications        The app really has not been working for me since release.  I have a new S10 which is hooked up to my computer with no issue.My primary problem is notifications are not working.I am not \"an idiot\", I am just not smart - I have notifications turned on.  I have tried most of these steps:https:\/\/www.windowscentral.com\/how-fix-common-problems-your-phone-app-windows-10If you reply please check back to see if I respond.  Making a single drive by post  then leaving me to rot in the dirt does not help. I really need this app to work.  I might be doing something silly.  While I have many complaints my primary is:NOTIFICATIONS FROM SMS & OTHER FEATURES ARE NOT BEING DISPLAYED ON MY COMPUTER SCREEN--   If I just paid you $500 what would you suggest, yes notifications are turned on, the phone and computer work - notifications work for other stuff.","solutions":["Was having same problem. I think it may be a win update issue,with a simple fix in my case. Go to start menu,scrol to the bottom yo your phone, open and sign in and sync.Hope this helps."]},{"symptom":"Optimum Wifi Connectivity Issue        I have looked online in forums and YT for an answer to this. I am am Optimum Online customer, and used to see 'optimumwifi' in my list of available networks. As of late, I am not seeing it. I went to a friend's recently, who also has Optimum Online. I could not see it in their network list either, even though I've seen it many times before at their home and was able to login with my credentials. I went to a local Panera Bread to see if it was an issue related to my wifi where other networks I could login to were not showing, and it wasn't. I saw the Panera wifi listed in my networks, and was able to hop on. I am updated to the most recent Windows, ran driver updates, and neither worked. The strange thing is, a relatives's Macbook, their Samsung galaxy tablet and phone can see the 'optimumwifi' and log on with all their devices.  The main Optimum network I use at home shows in my network list and I can connect as usual.This has been driving me crazy as I used to be see and use 'optimumwifi' when I am outside my home on my laptop, and now I can't even see the network to login. I have even tried to enter the MAC address at the Optimum website, and that didn't work, BTW,  these are the details...any help is appreciated.Dell Inspiron 17R 5737. (Windows 8 came installed but upgraded to Windows 10.) 8 GB Ram (7.88 GB usable) Intel (R) Core (TM) i5-4200 CPU @ 1.60 GHz 2.30 GHz64 bit operating system, x64 based processor","solutions":["Hi Geek, Based on your concern, there's a lot of people experiencing this kind of issue as well.What I can suggest is to rollback and disable your windows update for the mean time.This actually worked for me, please follow this link for detailed guide: https:\/\/www.windowscentral.com\/how-stop-updates...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","I've tried but the suggestion multiple times with all the steps mentioned....but it's not working for me...Thanks anyway.."]},{"symptom":"Screen recording half black screen issue        I have recorded some gameplay from assetto corsa with the xbox game bar, everything was looking fine during the record, but when i watched the video it was half normal and half dark, i checked other videos recorded with the game bar and they all were with the same issue.i have windows 10 with probably the lastest version because i booted the pc on 1 week ago.","solutions":["Hi VeirwenBlitzz and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.Have you tried reinstalling the recorder? I hope this helps. Feel free to ask back any questions and let me know how it goes. I will keep working with you until it's resolved.Thank you!","Hello, thanks for replying.I would like to know how to reinstall the recorder, since it was already installed in the device.","Hi VeirwenBlitzz, 1. Press the \"Windows key\" and type \"Game Bar\" press Enter key. 2. Select \"Repair\". Please see the attached picture below for your reference. Thank you!","HowdyI Tried the procedure above, but the problem persists.","I tried to view a sample video i recorded with another program, seems like the problem persists too, so i think the issue is with the media player maybe, as i enabled it as default video player, but i can't find in the settings to reinstall or fix, any help?"]},{"symptom":"Bluetooth Headset cannot be used as both headphones and speakers        I have a bluetooth headset that does not allow me to use it as both a microphone and a headset.I have determined that audio will play through the Bluetooth headset as long as the recording device is set to Conexant ISST Audio.  If I set the recording device to BHS-530 Hands-Free then no sound will play through either BHS-530 Playback device.I can get audio to play while the BHS-530 Handsfree is setup as the Recording device but not while it is actively listening.  As an example my BHS-530 Stereo is selected for both my default audio and default communication device.  I start playing a YouTube video and audio works with the Playback menu is up in the Sound dialog (first screenshot), as soon as I select the recording menu (second screenshot) the audio stops.  If I switch the recording device back to Conexant ISST Audio the youtube video will continue to send sound regardless of which menu I am on.What do I need to set so that I can use the headset for both audio and microphone (Microsoft Teams Calls)The headset comes up as two separate devices once it connects to windows:Playback DeviceType: HeadsetName: BHS-530 Hands-FreeandType: HeadphonesName: BHS-530 StereoRecording DeviceType: HeadsetName: BHS-530 Hands-FreeType: Internal MicrophoneName: Conexant ISST Audio(this is my laptop's internal mic)","solutions":["Hi David. I'm Greg, an installation specialist and 10 year Windows MVP here to help you.I will give you everything that's working for others with the known issues with Bluetooth and headsets:First HEADSET: Right click Volume icon in System Tray at right end of task bar, Open Sound Settings, in dropdown menus at top make sure Headphones are selected.If not choose Troubleshoot. Also try the Hardware Troubleshooter at Settings > Update & Security > Troubleshoot.Go to the Device Manager reached by right clicking the Start button, choose Sound controller device, on Driver tab choose Roll back or Uninstall, restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver. Do the same for the headset device and\/or it's microphone. Update the Sound driver from the PC or Device maker's Support downloads web page. While there also check that the Chipset, BIOS, Display, USB, Network and all other drivers are the most current.BLUETOOTH Troubleshooting: See Fixes here: https:\/\/support.microsoft.com\/en-us\/help\/14169\/...http:\/\/superuser.com\/questions\/823894\/how-to-ma...Try the Bluetooth troubleshooter at Settings > Update & Security > Troubleshoot. Try turning off Fast Startup at Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change settings that are unavailable > uncheck Fast Startup.Try Updating the Bluetooth driver from the PC maker's Support Downloads webpage for your exact model. Install it even if it's the same or newer than the one in Device Manager reached by right clicking the Start button.Right click Start button to access Device Manager, locate Bluetooth device (if necessary from View tab Show Hidden Devices), on Driver tab see if Roll Back is available, if not try Update Driver, first automatically, then Browse, then Let Me Pick to try all previously installed Drivers. If these fail try to Uninstall the Driver, restart PC to reinstall. Then try pairing again, if necessary run the Bluetooth Troubleshooter again. If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1903 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Greg,Unfortunately none of your suggestions resolved the issue.  Audio still plays when my internal mic is selected however audio does not play when the Headset's Mic is selected.  Please see my inline responses below in red to each of your suggestions Right click Volume icon in System Tray at right end of task bar, Open Sound Settings, in dropdown menus at top make sure Headphones are selected.As per the original post this was completed.If not choose Troubleshoot. Asked if I wanted to turn off sound effects and enhancements (I have tried both settings)No issues foundAlso try the Hardware Troubleshooter at Settings > Update & Security > Troubleshoot.Ran this for Playing Audio, Bluetooth, and Recording AudioPlaying Audio: No issues FoundRecording Audio: No issues foundGo to the Device Manager reached by right clicking the Start button, choose Sound controller device, on Driver tab choose Roll back or Uninstall, restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver. This is a work managed PC and I am not able to go into Device Manager to make changes, however I was able to go through Settings-System-Sound-Device Properties-Properties-Driver to uninstall the drivers for both the BHS-530 Hands-Free and the BHS-530 Stereo devices (the issue is still present) Do the same for the headset device and\/or it's microphone. This is a work managed PC and I am not able to go into Device Manager to make changes, however I was able to go through Settings-System-Sound-Device Properties-Properties-Driver to uninstall the drivers for both the BHS-530 Hands-Free and the BHS-530 Stereo devices (the issue is still present) Update the Sound driver from the PC or Device maker's Support downloads web page. While there also check that the Chipset, BIOS, Display, USB, Network and all other drivers are the most current. All drivers are current via manufactures website BLUETOOTH Troubleshooting: (This does not appear to be an issue with \"Bluetooth\" as both the mic and headphone portion of the headset work independently through Bluetooth, windows just won't allow both to be active at the same time)  See Fixes here: https:\/\/support.microsoft.com\/en-us\/help\/14169\/...None of the described issues are relevant to my problemhttp:\/\/superuser.com\/questions\/823894\/how-to-ma...This is about a mouse and connection issues, this is not relevant to my problemTry the Bluetooth troubleshooter at Settings > Update & Security > Troubleshoot.Bluetooth: Check Bluetooth radio status: Fixed (the issue is still present)Try turning off Fast Startup at Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change settings that are unavailable > uncheck Fast Startup.The issue is still present Try Updating the Bluetooth driver from the PC maker's Support Downloads webpage for your exact model. Install it even if it's the same or newer than the one in Device Manager reached by right clicking the Start button.All drivers are current via manufactures websiteRight click Start button to access Device Manager, locate Bluetooth device (if necessary from View tab Show Hidden Devices), on Driver tab see if Roll Back is available, if not try Update Driver, first automatically, then Browse, then Let Me Pick to try all previously installed Drivers. The issue is still present If these fail try to Uninstall the Driver, restart PC to reinstall. The issue is still present Then try pairing again, if necessary run the Bluetooth Troubleshooter again. If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2...Not caused by a windows updateYou can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t...Link doesn’t workGo over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...Link doesn’t workStart with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly.  If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1903 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... This is a work managed PC, currently on Windows 1803.I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.","David,I am having the same issue with multiple microphones on Win10 Pro Version 1903 OS build 18362.388.   For me, this happens with multiple bluetooth headsets.Did you ever resolve your issue?Michael","Hi, I am Shreyas I have faced similar problems I have tried every possible solution but it does not work. Please Help me.You can write to *** Email address is removed for privacy ***","I was thinking if the problem is in the bandwidth of BT. It may change to HSP\/HFP to be able to stream the audio in and out at the same time.BUT I don't get the point why..how is it possible it works great with phones but not with Windows devices (computers)?It always switches to the low audio quality profile (as I mentioned above) after application access microphone.Tried on my Xiaomi Neckband, Huawei Freelace and Bose NCH 700, same results for all of them.So, it is pretty obvious non of those helped. However, sometimes audio stops playing from \"Stereo\" postfixed audio devices even when I use internal microphone and not the Bluetooth headphones' one.Best regardSimon","So, if it is not so important for the usage you can try thisbad-sound-through-bluetooth-headphones"]},{"symptom":"TPM no keyboard on start up        Ive reset my pc but now everytime it boots up i get the screen TPM press escape to clear but my keyboard doesnt work until the desktop screen loads.Its just on a loop constantly.I cant clear the TPM as it just wants to restart and loop again","solutions":["Hi, dupxxxxxxxx My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi,thanks for the quick reply.i tries the solutions you gave me but they did not work.The problem started when i reset my pc factory settings.The pc boots up but i cannot access the bios screen as the keyboard does not work.The issue is with clearing the TPM which i cannot do as ive not got the keyboard.After 5 minutes the desktop loads up.I have tried to clear the TPM through the security centre and also through cmd but as soon as it restarts the same issue appears as the keyboard does not work until the desktop starts.Thanks again for the quick reply","You will have to borrow or buy a keyboard to try to do the steps that you indicate","Ive got 2 keyboards but they only work after windows starts up.On the load screen i’ve got no usb keyboards working so i cant press any key to start the process of the tpm","Nor do they work to enter the BIOS? If so, you will have to remove the internal battery from the PC for about 15 minutes."]},{"symptom":"Unable to log in into my windows account on my computer         This heppends when i try to add my microsoft account on my computer, error 0x800704cf. occurs. It heppends with any account i try to log in with. And nothing that i found so far has helped me.","solutions":["Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.I found an article that might help you resolve the error code you're getting. You can check and see if the instructions provided can help you.https:\/\/www.howtoedge.com\/how-to-fix-the-error-...(Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.)I hope this helps resolve your concern! Please let me know if you have further questions."]},{"symptom":"Apps running when PC starts, windows 10.        Hi,Firstly, I shall apologise in advance. I'm a bit of a tech head but the terminology I'll be using will be main descriptive and probably annoy those whom actually knows what they are talking about.I have an issue with apps running when the PC starts. I have told the apps via there settings not to start on start up and via windows start up manager, however, some of the apps in question are not listed in the start up manager. Despite this when I start windows there they are running. they also run before I log into windows.I always close the apps before shut down but I believe windows is simple running apps that where recently active when I shut the PC down. Similar to the internet browser loading the last page I was on rather than the home page.This is the first time I've posted a question as I am normally able to find a solution but I am unable to find any information, likely due to a lack of correct terminology.Can anyone shed some light in this issue? Is there setting hidden somewhere I'm not aware of? Is there a way to block apps from running without my permission?RegardsCarney","solutions":["Hi Carney If there are full apps starting with Windows and displaying a window, turn off this setting:Go to Settings - Accounts - Sign-in options At the bottom of that page, in the Privacy section Turn off the setting to “Use my sign-in info to automatically finish settings up my device after an update or restart”Also, if you would like to trim down your Windows Startup further: Task Manager and indeed Msconfig offer only limited control over Startup items . . .Click the link below to download a small free utility that does not require installationWhen the file downloads, unzip it. Depending on your system, run Autoruns or Autoruns64 as Administrator With that utility, you can right click and delete any startup item in Windows Just be careful not to delete any required process . . . https:\/\/docs.microsoft.com\/en-us\/sysinternals\/d..."]},{"symptom":"Windows keeps automatically adding EN-US keyboard layout        For some reason, Windows seems to regularly check to see if I'm using the EN-US keyboard layout, and adds it if I'm not. (Normally, I use a variety of other layouts.) This ends up adding another entry to my already long list of layouts to cycle through.It appears without an entry in the add\/remove keyboards settings screen. In order to delete it, I have to first add it via the normal method - then, if I delete the normally-added keyboard, the erroneous entry goes away. It then reappears sometime later, requiring me to go through the process again.I might have thought that it's being added because I'm not using the 'default' layout, but my system language is not English (it's Japanese). It's not the 'default' anything unless Windows as a whole treats it as somehow more default than all other things. Windows seems quite fine with me not using the default Japanese layout (I use Google's, not Microsoft's) - the Microsoft one reappeared after the Anniversary Update, but hasn't come back after having been sent away.This seems like an odd bug. Any workarounds, so my layout list doesn't keep having a useless entry taking up space?","solutions":["Hi,To disable windows from automatically adding EN-US keyboard layout, we suggest you todisable automatic keyboard layout change. To do so, please follow these steps:Go to Control Panel.Click Language and select Advanced settings.Under Switching input methods, uncheck Let me set a different input method for each app window.Let us know how it goes.Regards.","Thank you for your reply! It seems that that option is already unchecked, though.","If you would like too you can do system restore to restore some settings on your PC.","That seems rather drastic compared to the scale of the problem, and if this isn't the result of a setting being changed badly in the past, I doubt that would solve the problem. If the problem is a wrong setting or bug that's been here the whole time, restoring will just restore back to an earlier point that still had the bug\/setting.","Now, after having tried the Vietnamese Black Ci keyboard (which seems pretty buggy in general), Vietnamese now also continually gets its own entry, also with the EN-US layout. I now have two automatically returning entries in my keyboard switcher list.","Hi,To resolve your concern regarding keyboard layout, follow the steps below: Go to Control Panel. Click on Clock, Language, and Region. Select Region. Click on the Location tab. Under Home location, select Japan so that it won't add any English keyboard layout. Click Apply, and then OK. Restart your computer.Let us know how it goes.","Thanks for the reply! Unfortunately, it seems my location is already set to Japan. I could change it and then change it back, but that might well not solve the problem.Also, now it seems I have two duplicate entries in my switcher for the EN-US keyboard, one grouped with the other two English keyboards and one at the end. Adding and removing English (US) deletes the one at the end, but not the one in the group.","Here is another set of steps that you could follow: Go to Settings. Click on Privacy.         3. Select Location.     4. Make sure that Location is Off.Keep us updated.","sjiveru wrote on 29 Sep 2016:« For some reason, Windows seems to regularly check to see if I'm using the EN-US keyboard layout, and adds it if I'm not »Actually Microsoft in 2008 added to Windows an \"improvement\" where a PC when booting, changes the Language and Keyboard Layout set on this PC, to the one of a nearby other PC on the network, which of course is often US, but also can be US-International, French, German, or any of the ~150 others. Of course this behavior, being full unexpected and full hidden, puts the user in a long period of doubt and fruitless search for solution.Diego gave on 07 Oct 2012 aTotal protection against these Keyboard Layout changes from nearby computers, which is immediately, totally, and reliably effective:In RegEdit, navigate to HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Keyboard Layout, in right pane right-click and choose \"New\" then \"DWORD Value\", name it \"IgnoreRemoteKeyboardLayout\", then double-click it and under \"Value data\" type \"1\" (don't mind \"Hexadecimal\" or \"Decimal\", either will do).Versailles, Thu 29 Jun 2017 17:42:10 +0200","I tried  Michel method by adding the DWORD in the regedit, as well as check the Preload in HKEY_CURRENT_USERS, but I still have Vietnamese Keyboard automatically adding to my language bar, even though in my language or keyboard setting there is no Vietnamese added. The only way to get rid of it temporally is adding Vietnamese Language and then remove it, the Vietnamese Keyboard Layout come out with it. Is there anyway to solve my problems? Thanks a lot."]},{"symptom":"Windows 10 MAIL - how do you create group contacts?        I have recently migrated to Windows 10 Mail.  Some Group contacts are not showing on the \"people\" contacts list.How do I create a new GROUP contact list as I can see no way of doing it?Thanks.","solutions":["Hi everyone,               I am a Microsoft support engineer and I want to gather more feedback from you in regards to the issue that users cannot send emails to multiple contacts in People App, so I can drive a feature request with Windows engineering group.                I have submitted a Feedback Hub post with the issue description here: https:\/\/aka.ms\/AA21cea                If you couldupvote the issue and leave a detailed comment about your frustration with the absence of this feature, that would help me make a strong business case for the request.               Thank you very much and please comment below if you have any more questions!"]},{"symptom":"Disk Running at 100% Even after I started up a CLEAN BOOT        Hi everyone, Happy New Year! I hope you are all wellI have a HP Envy Laptop. 2.40 GHZ with i7 Processor and 12GB Ram. I would have thought that this Laptop would be reasonably fast (i don’t play games or anything, i sometimes use it for Coursework \/ Assignments etc)but for some reason my disk is always running at 100%I recently followed some steps online to be able to start my laptop in clean boots mode to be able to identify the problem of why my desk is running at 100%but when i started in clean boot mode i still am using 100% of my disk. I really don’t know what to suggest. I have already tried disabling Super Fetch but it tells me an error code: Error 87: The Parameter is incorrect. i have performed the ‘delay start’ for windows search. i believe only a true PC guru \/ wizard can help me fix this problem. Any ideas would be greatly appreciated. By the way i have had the laptop for about 4 years now , i dont know if this helpsand i have updated my PC to latest updates etckind regards,michael","solutions":["Hi Michael, How long this 100% load lasts? Do you have SSD or HDD? Please, check a disk SMART using third-party tool such as CrystalDiskInfo. Check hard drive for errors. Please, show the Disk tab of Resmon with top and middle tables sorted by Total during 100% load.","Hey Igor, thanks for getting back to mei will give this a try and get back to you once i have completed the stepscheers","OK. I'll wait for results.","Good morning,i am back with some results (i hope this is what you are looking for)when i clicked on the Disk Tab, this was the only driver is displayedcheers","When you click on the Disk tab it will sort high to low or low to high. Anything displayed much higher than zero would be a possible culprit. Your screenshot only display 0 values.  You would want to click on the Disk tab to display the highest consumption of resources rather than the lowest.  A screenshot of those services would be a start pointing to  the possible problem. In most cases when the issue is not hardware-related, it is problematic service\/drivers. Sometimes malicious, other times merely a compatibility issue.","Hi everyone, Happy New Year! I hope you are all wellI have a HP Envy Laptop. 2.40 GHZ with i7 Processor and 12GB Ram. I would have thought that this Laptop would be reasonably fast (i don’t play games or anything, i sometimes use it for Coursework \/ Assignments etc)but for some reason my disk is always running at 100%I recently followed some steps online to be able to start my laptop in clean boots mode to be able to identify the problem of why my desk is running at 100%but when i started in clean boot mode i still am using 100% of my disk. I really don’t know what to suggest. I have already tried disabling Super Fetch but it tells me an error code: Error 87: The Parameter is incorrect. i have performed the ‘delay start’ for windows search. i believe only a true PC guru \/ wizard can help me fix this problem. Any ideas would be greatly appreciated. By the way i have had the laptop for about 4 years now , i dont know if this helpsand i have updated my PC to latest updates etckind regards,michaelHello,See if this fix helps you:https:\/\/www.kapilarya.com\/fix-windows-10-100-percent-disk-usage-problemLet us know if this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP.","Disk is in a good condition but it itself is not fast. Please, show the Disk tab of resmon tool with top and middle tables sorted by Total during 100% load."]},{"symptom":"no wifi networks and no nvidia graphic card        HiI recently upgraded to windows 10 pro from windows 7.and i am facing driver related issues since I have upgraded to windows 10. It is really a worst experience of upgrade.I am using:windows 10 pro 64 bitversion:   1909OS build:  18363.535i got some updates after installing windows 10.and it automatically detected my Nvidia graphic card(Nvidia  GeForce GT 630M - 2gb)windows downloaded and installed related drivers from updates but windows stopped this hardware with error code 43.I tried all solutions available on the internet (web articles and youtube videos)but none of them seems working, the condition is still the same.at this time driver version is: 23.21.13.9135driver date: 23-march-2018(i downloaded this from Nvidia website)2nd problem is with my Broadcom 4313 wireless network adaptor.Windows has automatically installed drivers for this, seems okay in the Device Manager, but it is not able to detect any available wifi networks. (I tried to install drivers for this manually also, but no luck)Please help.","solutions":["Do you have a router?  If not, where do you get your network connection from?","Yes I do.D-link Access point. ","Please, run the DirectX diagnostics tool. Run dxdiag.exe (Start - Run or Win key +R) then press enter or click \"OK\". Once the diagnostics completes, \"Save All information...\" to a text file. Since there is no place to upload in this Community, upload this text file to a file sharing\/storage site like Onedrive.Please provide a link to this shared file in your reply.If using Onedrive, you can use the following guidance on how to Share OneDrive files and folders.  If not using Onedrive, simply provide the link issued by the file sharing site.","hi Techfreak_here is the link:https:\/\/1drv.ms\/t\/s!AmsidZLBZkkvhdEcp9i3OEyQqXMpxQ?e=Okaz3s","Hi UmeshDhiman and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.May I know what is the specification of your PC? Thank you!","Your issue is probably going to be BIOS and\/or driver-related. Since you are running an OS the system was never designed for, the best thing you can do isupdate your BIOS - F.2E [hp.com]. If that does not resolve the issue, you need to find a compatible mix of Intel and Nvidia graphics drivers that will work together. I believe you have attempted the latest drivers you could find. You could also try utilizing only the latest Windows 8.x drivers from HP's site for the 4000 and GT630m to see if that combination works. Ultimately the Microsoft generic display adapter might be the only driver that is stable in your configuration. You might check in your BIOS to see if any graphics adapter toggles exist that might change how the on board graphics operates or is detected. You may also want to reach out to HP to see if they have a known-driver combination available for that model for Windows 10.In regards to your wireless issue, make sure that wireless is not disabled where it is running in an airplane type mode, not picking up any access points. You can also try updating your drivers. I believe theseLenovo ones [lenovo.com] are a copy of the latest 7.x series of driver compatible with your Broadcom hardware.","Hi Techfreak_I appreciate your help in both the issues.I will post again after checking if it works or not. at this time I wanted to add to the Wlan adapter issue:i used the windows troubleshooter, it told me that wifi cabability is not enabled. it also suggested to use the on\/off button on the keyboard.I can see the wifi on\/off button in amber color, when i press it, I see airplane mode on\/off notification on screen but not for wifi.the button led never come up in white color.","Hi Techfreak_it worked.it worked for my WLAN.i used the bios setup that you shared above. but i used my own drivers.here is the link to the drivers that worked.https:\/\/1drv.ms\/u\/s!AmsidZLBZkkvhdEdkyidy87_dNQ6sg?e=HNZYBFyour efforts really helped me.now I need to fix my NVIDIA card. i will follow what you suggested and update the result.thank you for helping me out for WLAN issue. ","Dear Techfreak_This post is to thank you as you helped me solve both the issues I was having after upgrading to windows 10 Pro 64 bit.You suggested to update the BIOS and then use the windows 8 drivers from HP (as I have HP notebook).you also suggested to use Intel HD drivers and NVIDIA drivers from same site, as there is chance of both being compatible.And YES they both are compatible. I have un-installed the drivers first and installed after reboot.My WLAN and NVIDIA graphic card both are working fine now.At last, I would like to thank you to guide me fixing the issue (more like a nightmare for me).Many Thanks!"]},{"symptom":"about microsoft store        my microsoft store  doesnot  download anything ","solutions":["* Merged my microsoft store doesnot download anything","Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.Please try to reset Microsoft Store cache by following the steps under \"If you're still having problems finding or installing an app\".https:\/\/support.microsoft.com\/help\/13765If you are still having trouble thereafter, please post any error messages or code you see, or the Microsoft Store download screen itself.Please let me know if I can help you further!","Hi, Anishdhakal 59 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"The link to the latest SQL Server developer edition compatible with Windows 7        Hello,I would like to install SQL Server developer edition on my Windows 7 machine. SQL Server 2019 is not compatible. I would like to try earlier versions but cannot find download links for them.There is some information on previous SQL Server versions on microsoft site in Products\/Previous Versions section, but no download links to developer editions, only evaluation downloads.So the question is: What is the latest version of SQL Server developer edition that works on Windows 7 and how can I download it? Thanks!","solutions":["Your question is outside the scope of this Community.Kindly repost your question in the TechNet SQL Server Forums.https:\/\/social.technet.microsoft.com\/Forums\/sqlserver\/en-US\/home?category=sqlserver\"MSDN SQL Server Forums\"https:\/\/social.msdn.microsoft.com\/Forums\/sqlserver\/en-US\/home?category=sqlserverTechNet Forums: https:\/\/social.technet.microsoft.com\/Forums\/en-US\/homeMSDN Forums:https:\/\/social.msdn.microsoft.com\/Forums\/en-US\/homeCheers.","Thank you, done!","They should be able to help you there.Cheers."]}]}