{"windows":[{"symptom":"Windows 2008 R2 Foundation recovrey        Hi,How can we restore\/recover Windows 2008 R2 foundation. Even F8 key is not working. We don't a installation media for the recovery.Can we get instillation iso file ?Windows 2008 R2 foundation is installed, can we use windows 2008 r2 standard for the recovery\/restore ?Best Regards","solutions":["H Hadi110 I am sorry, Community is just a consumer forum, due to the scope of your question (Server 2008) can you please post this question to our sister forum on TechNet in the Server 2008 section (linked below)Over there you will have access to a host of Server 2008 experts and will get a knowledgeable and quick answer to this question . ..https:\/\/social.technet.microsoft.com\/Forums\/Win...","Your question is beyond the scope of these ForumsThis Community is mainly for home users and their computer problems, not business systems.Kindly post your question in the TechNet Server Forums.http:\/\/social.technet.microsoft.com\/Forums\/windowsserver\/en-US\/home?category=windowsserverTechNet Forums: https:\/\/social.technet.microsoft.com\/Forums\/en-US\/homeMSDN Forums:https:\/\/social.msdn.microsoft.com\/Forums\/en-US\/homeCheers."]},{"symptom":"How do I create a non Admin A\/C?        How do I create a non Admin A\/C?","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.When you create an account it's by default created as what Windows calls a \"Standard\" account, which is a non-admin account.To do that - go to START > Settings (the cog) > Accounts > Other Users. Then choose \"Add someone else to this PC\". Windows will then prompt you to add a new user by email address (which requires a Microsoft account), however by choosing \"I don't have this person's sign-in information\" and then \"Add a user without a Microsoft account\" you can add a local account without doing that if you prefer.Regards, David"]},{"symptom":"Orchestrator Console after IE 11 goes away        I have recently spun up a new System Center Orchestrator 2019 server and noticed an upcoming issue.The Orchestrator Console still uses Silverlight, which is only supported in IE 11.IE 11 is going EoL in the next couple of weeks, which means it will be disabled in our machines here.Does anyone know of a way to keep using the console?  Is Microsoft going to update the console to HTML 5, or just let it die?Thanks.","solutions":["Your question is outside the scope of this Community..Kindly repost in the TechNet Forums:https:\/\/social.technet.microsoft.com\/Forums\/en-US\/homeCheers."]},{"symptom":"Can I download and use Edge browser?        I am running Windows 7 on my Lenovo G500 laptop, I watched some videos and reviews of Microsoft Edge browser on internet. Now i am willing to use it on Windows 7, Is there a way to download and install it in Win 7?","solutions":["Support for Windows 7 will ended in few days and it is recommended to upgrade to supported version of Windows like Windows 10.Are you sure, Microsoft is ending the support of Windows 7?. Your comment shocked me again because I can't imagine it. I think Windows 7 is currently mostly used OS than even from earlier versions. If they listen to me, I request them to do not end it up for next few years.Yes, Microsoft support for Windows 7 will end next Tuesday, January 14, 2020.  See the thread pinned at the top of the Windows 7 section of these forums or these direct links:https:\/\/support.microsoft.com\/en-us\/help\/4057281\/windows-7-support-will-end-on-january-14-2020https:\/\/support.microsoft.com\/en-us\/help\/4527878\/faq-about-extended-security-updates-for-windows-7https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/end-of-support-for-microsoft-security-essentials\/a12db506-9278-4fbb-8ac9-061c09499a40"]},{"symptom":"email won't connect        aol email won't connect. I'm sure about using correct email and password. can't find place to delete the account to start over. ","solutions":["Your questions are for AOL.https:\/\/help.aol.com\/articles\/fFix-problems-reading-or-receiving-aol-mailhttps:\/\/help.aol.com\/articles\/why-cant-i-access-my-aol-mail-using-other-email-applicationsCheers."]},{"symptom":"Desktop Logins As New User        Have an issue where my desktop logins act like we're a new user. All document \/ file directories are gone, etc.Login this morning was fine. Ran a folder scan prior to installing a new app. Encountered a \"Can't open …\" message for windows defender so rebooted.On logging in, observed \"welcome to windows\" text and something about updates. Then an edge browser page for \"Welcome to windows\". Desktop is the blue windows image with app icons; not my folders \/ documents I was expecting.Checked recovery options and there's a message stating \"this option is no longer available because you PC was updated more than 10 days ago.\" Odd, because the update history shows windows defender security update KB4052623 (Version 3.18.1911.3)occurred this morning 1\/8\/20. I have a backup connected that requires me to activate when I login. I'm hesitant to do that in case the new login overwrites (it's setup on continuous backup) my old files with this new profile.Any recommendations on how I can restore my original desktop documents?Thank you.Jon","solutions":[]},{"symptom":"Windows Resource Protection found corrupt files but was unable to fix some of them        This problem came up while trying to update VS2019 and one of the MSFTs for the developer community told me to post this here.Here is a review of the steps that were taken.   First post is from the MSFT.From looking at logs, your machine is having problems with DISM command. The following is a series of trouble shooting steps to help resolve the underlying DISM issue. When that issue is corrected, users can then return to the VS Installer and repair their installs.Let's try fixing DISM:Run the following command: DISM.exe \/Online \/Cleanup-image \/RestorehealthNote: It might take several minutes for the command to completeRun the following command: DISM.exe \/Online \/Cleanup-image \/startcomponentcleanupRun the following command: sfc \/scannowNote: It might take several minutes for the command to completeEnable TrustedInstallersc config trustedinstaller start=autoreboot the system.Repair the install from the VS InstallerCan you tell us if this works for you? Also, it would be good to know if you have a program called Connected Backup installed? Here is my response.Followed the steps above and got this error when running sfc \/scannow:Windows Resource Protection found corrupt files but was unable to fix someof them. Details are included in the CBS.Log windir\\Logs\\CBS\\CBS.log. Forexample C:\\Windows\\Logs\\CBS\\CBS.log. Note that logging is currently notsupported in offline servicing scenarios.I have the cbs.log file that I can also upload.","solutions":["Your question is outside the scope of this Community.Kindly post your question to the MSDN Visual Studio Forums.https:\/\/social.msdn.microsoft.com\/Forums\/vstudio\/en-US\/home?category=visualstudioTechNet Forums: https:\/\/social.technet.microsoft.com\/Forums\/en-US\/homeMSDN Forums:https:\/\/social.msdn.microsoft.com\/Forums\/en-US\/home@@@@@@@@@@@@@@@@@@@@@@@@@@@@@These are the Windows 8.1 forums.If the problem had been with Windows 8.1:Each Method\/step below progresses to the next if the first does not fix any corrupted files that are found, etc.Have you read this Microsoft information about repairing corrupt system files and errors?\"Use the System File Checker tool to repair missing or corrupted system files\"https:\/\/support.microsoft.com\/en-us\/kb\/929833_________________________________________________And these eightforums.com Tutorials are very detailed for problems resulting from SFC Scan:\"How to Run \"SFC \/SCANNOW\" Command at Boot or in Windows 8 and 8.1\"http:\/\/www.eightforums.com\/tutorials\/3047-sfc-scannow-command-run-windows-8-a.htmlRead this Section there in conjunction with the rest of the information they give in above link.   NoteIf SFC could not fix something, then run the command again to see if it may be able to the next time. Sometimes it may take running thesfc \/scannow command 3 times restarting the PC after each time to completely fix everything that it's able to.If not, then run the Dism \/Online \/Cleanup-Image \/RestoreHealth command to repair any component store corruption, Repair-WindowsImage -Online -CheckHealthRepair-WindowsImage -Online -ScanHealthRepair-WindowsImage -Online -RestoreHealthRestart the PC afterwards, and try the sfc \/scannow command again.If still not, then try using OPTION ONE above to run the sfc \/scannow command at bootIf still not, then you could do a refresh of Windows 8, or run aSystem Restore using a restore point dated before the bad file occured to fix it. You may need to repeat doing a System Restore until you find a older restore point that may work.If still not, then you can use the steps in the TIP box in the OPTION THREE section to manually replace the files that SFC could not fix.__________________________________________________\"How to Refresh Windows 8 and Windows 8.1\"http:\/\/www.eightforums.com\/tutorials\/2293-refresh-windows-8-a.htmlRefreshing your PC goes like this:The PC boots into Windows RE (RecoveryEnvironment).Windows RE scans the hard drive for your data, settings, and apps, and puts them aside (on the same drive).Windows RE installs a fresh copy of Windows.Windows RE restores the data, settings, and apps it has set aside into the newly installed copy of Windows.The PC restarts into the newly installed copy of Windows._________________________________________________\"How to Reset Windows 8 and Windows 8.1\"http:\/\/www.eightforums.com\/tutorials\/2302-reset-windows-8-a.html\"When you reset your PC, the drive will be completely reset, and all your apps and files will be removed from it. Windows 8 will be reinstalled, and you'll need to change any settings and reinstall any apps that you want to get back after resetting. If you know if any files that you don't want to lose, then you should back those files up before starting the reset\"Cheers."]},{"symptom":"Microsoft Account Login        I cannot login using my microsoft account on my tablet. It does not recognise the password.I can login on my laptop using the same account and password. I have changed the password and still no login on tablet.I did not use microsoft login on  my tablet. During an automatic update the update failed. It the removed the update and restarted. the tablet. After this there was only the Microsoft login available.Microsoft technical support could not provide any solution other than re-install the operating system. However they continually avoided telling me how to do this. Their suggestions were to download the software on another device. Fair enough but could provide me with no information on how I put it onto a locked tablet pc.Hopefully somebody out there can provide help that three hours of Microsoft online help support avoiding the issue that their software has locked my pc.RegardsRobert","solutions":["You say \"tablet pc\"Normally the manufacturer has a method on how to reinstall the operating system for their devices.What is the Brand Name and Model Number?@@@@@@@@@@@@@@@@@@@@@@We can't help you with passwords expect for this due to Microsodt's Policy.:\"What to do if you forget your Windows 8\/8.1 password\"http:\/\/windows.microsoft.com\/en-us\/windows\/what-do-forget-windows-password#1TC=windows-8If you've forgotten your Windows password, there are several ways to retrieve or reset it:If your PC is on a domain, your system administrator must reset your password.If you're using a Microsoft account, you can reset your password online. For more info, go to theReset your password webpage. If you're using a local account, use your password hint as a reminder.If you've tried these suggestions and still can't sign in:If you have Windows 8.1, you'll need to reinstall Windows. If you have Windows RT 8.1, you'll need to contact your PC manufacturer.@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Microsoft forbids any assistance being given in these Forums to help you bypass or \"crack\" lost or forgotten Passwords.Here is the Microsoft Information outlining that Policy:http:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_7-security\/keeping-passwords-secure-microsoft-policy-on\/39f56ef0-5d68-41ad-9daa-6e6019c25d37","Hi  It's an HP Stream 7.Tried the HP site but cannot get real person to chat to only pre-programmed answers.Cheers","This HP information should assist you in how to reinstall.You will have to scroll down a bit.HP Stream 7 and HP Stream 8 Tablet PCs - Performing an HP System Recoveryhttps:\/\/support.hp.com\/au-en\/document\/c04576841Cheers.","HiI persevered with going back through old passwords and finally one of them let me in. This was despite microsoft support telling me the only possible outcome was to re-install windows. Co-incidentally recommending upgrading to windows 10 which I would have to pay for. So by leaving the tablet offline I was able to get an old password to work. For some reason putting it online and using my current microsoft password would not let me login.Only reason I can see is far from my the software on my hardware being corrupt or damaged the only problem was with the micrsoft login.Microsoft of course would not admit that their software was to fault.It goes without saying I have removed the microsoft login option from all pcs. Not that I had chosen it in the first place.The promised information on actually re-installling windows 8.1 was never sent to me. Neither was a working link to download the windows 8.1 for re-install as the tablet came preloaded.Usual lack of useful help and advice from microsoft for this. Suppose you cannot blame the online staff for not being able to answer a question not on their tick list.Very large shame my clients have to use microsoft products.","No one here in the Windows 8.1 forums works for Microsoft.We are all computer users that come here to help each other.Something for you to maybe use in the future, including how t download 8.1:Here are the Key\/s to press at Boot to start the Recovery Process back to Factory Settings (new condition). Under each Manufacturer in the list below are the instructions in the respective links for you to follow on how to use their Recovery PartitionAcer – Press Left Alt + F10 Keys.\"Use Acer eRecovery application to restore your system or create recovery media\"http:\/\/acer.custhelp.com\/app\/answers\/detail\/a_id\/29934\/~\/use-acer-erecovery-application-to-restore-your-system-or-create-recovery-mediaAsus – Press F9This is how to use the Asus Recovery process.http:\/\/www.asus.com\/support\/FAQ\/1006133\/Dell – Press F8 which will bring up Advanced Boot Options \"Restore Windows 8 using the Factory image restore method in Dell Backup and Recovery\"http:\/\/www.dell.com\/support\/article\/us\/en\/19\/SLN155115\/ENDell Alienware:What is and How to use AlienRespawneMachines: Press Left Alt Key + F10eMachines Support - Answers, E-Mail, Chat - Restore Windows with a ...Fujitsu – Press F8restore to factory setting. - Fujitsu Support ForumGateway: Press Alt + F10 Keys - As Acer owns them: press Left Alt + F10 Keys as per Acer eRecoveryUsing Gateway Recovery Management to Restore Windows 8HP – Press F11 repeatedly at Boot.Follow these HP steps to do a Recovery to Factory Settings (new condition).HP PCs - Performing an HP System Recovery (Windows 8) | HP ...HP PCs - Resetting Your PC to Resolve Problems (Windows 8) | HP ...Lenovo – Press F11https:\/\/support.lenovo.com\/us\/en\/documents\/ht077084#restoreLG – Press F11 at BootPackard Bell: Press and hold the ALT key while pressing repeatedly the F10 key. Release the keys when a message displays that Windows is loading files.““Using Packard Bell Recovery Management to Restore Windows 8”http:\/\/packard-bell-scandic.custhelp.com\/app\/answers\/detail\/a_id\/26280\/~\/using-packard-bell-recovery-management-to-restore-windows-8Samsung – Press F4 at Boothttps:\/\/www.youtube.com\/watch?v=X0CiBXuMVGoSony Vaio – Tap F10 until the Edit Boot Options screen is displayedhttps:\/\/us.en.kb.sony.com\/app\/answers\/detail\/a_id\/36806\/c\/65,66\/kw\/windows 8 assist\/Toshiba – Press 12http:\/\/www.mytoshiba.com.au\/support\/items\/faq\/776@@@@@@@@@@@@@@@@@@@@@@@@Or:Windows 8.1: Reset To Factory Settings and Remove Personal Data@@@@@@@@@@@@@@@@@@@@@@@You can contact the Laptop\/Computer Manufacturer and order Recovery Media from them for a small cost.You can download and create your own Windows 8.1 Installation Media to reinstall the Operating System with..\"Create installation media for Windows 8.1\"http:\/\/windows.microsoft.com\/en-us\/windows-8\/create-reset-refresh-media\"Download Windows 8.1\"https:\/\/www.microsoft.com\/en-us\/software-download\/windows8A similar Tutorial which may also assist you\"Create Installation Media for Windows 8.1\"http:\/\/winsupersite.com\/windows-8\/create-installation-media-windows-81In the first screen of this very simple wizard, you need to choose the following:Language. English – en-us if you're in the United States.Edition. Windows 8.1 (Core), Windows 8.1 N, Windows 8.1 Pro, Windows 8.1 Pro N, or Windows 8.1 Single Language.Architecture. 64-bit (x64 ) or 32-bit (x86)._______________________________________\"How to Create a Bootable USB or DVD with a Windows 8 or 8.1 ISO\"http:\/\/www.eightforums.com\/tutorials\/2227-create-bootable-usb-dvd-windows-8-iso.html   WarningThis will not work to install Windows 8 or 8.1 for UEFI. For that, see this tutorial below instead.UEFI Bootable USB Flash Drive - Create in Windows_____________________________________To access BIOS\/UEFI - UEFI\/EFI configuration:https:\/\/neosmart.net\/wiki\/boot-usb-drive\/_____________________________________How to clean install:\"How to Do a Clean Install of Windows 8 or Windows 8.1\"http:\/\/www.eightforums.com\/tutorials\/2299-clean-install-windows-8-a.html_____________________________________With Windows 8\/8.1 The Product Key on preinstalled Operating Systems (HP, Acer, etc) is embedded in the BIOS in the Motherboard, so that the lost and\/or worn C.O.A. Sticker problem is no more.When you reinstall it will pick up the Product Key and activate the system automatically.If it does not, follow these steps:\"How to Activate Windows 8 and 8.1 by Phone\"http:\/\/www.eightforums.com\/tutorials\/24636-activate-windows-8-phone.html\"Get help with activation errors\"http:\/\/windows.microsoft.com\/en-us\/windows-8\/activation-errors\"How to activate a Microsoft product by using Microsoft Product Activation Center\"http:\/\/support.microsoft.com\/kb\/950929\/en-us_______________________________________________If you do wish to\/need to keep a record of it:\"Windows 10 Embedded Product Key Tool\"https:\/\/neosmart.net\/blog\/2014\/windows-10-embedded-product-key-tool\/\"We’re proud to introduce the immediate release of our newest utility for Windows users: the NeoSmart Technologies Embedded Product Key Tool. Designed for users of Windows 7, Windows 8, and Windows 10, our embedded product key tool will retrieve and display the Windows setup product key embedded in the BIOS or EFI, allowing you to store it for safe-keeping or use it to reinstall Windows with an official Windows setup image.\"You can also use:\"Belarc Advisor - Free Personal PC Audit (Version 8.5c)\"http:\/\/www.belarc.com\/free_download.htmlOr:\"Product KeyFinder\"https:\/\/www.magicaljellybean.com\/keyfinder\/Cheers."]},{"symptom":"BSOD and I can't figure if it's hardware, driver, or third party software        I have recently upgraded my computer.My graphics card was working flawlessly until I upgrade the rest (motherboard, ram, and CPU).I have already updated all the drivers I could find, and have run the Windows memory check 2 passes.My hardware is as follow:CPU: AMD Ryzen 7 3800X, 3900 MhzGPU: Geforce RTX 2060RAM: DDR4 G Skill Flare X 2x8GBBoard: Gigabyte GA-AB350M-DS3H V2PSU: Corsair VS 550Windows Version: 10.0.18362 Build 18362I'm getting BSOD every day at least once.The file dump gives me this info:********************************************************************************                                                                             **                        Bugcheck Analysis                                    **                                                                             ********************************************************************************WHEA_UNCORRECTABLE_ERROR (124)A fatal hardware error has occurred. Parameter 1 identifies the type of errorsource that reported the error. Parameter 2 holds the address of theWHEA_ERROR_RECORD structure that describes the error conditon.Arguments:Arg1: 0000000000000004, PCI Express ErrorArg2: ffffe68b5f12a038, Address of the WHEA_ERROR_RECORD structure.Arg3: 0000000000000000Arg4: 0000000000000000Debugging Details:------------------BUGCHECK_STR:  0x124_AuthenticAMDCUSTOMER_CRASH_COUNT:  1DEFAULT_BUCKET_ID:  CODE_CORRUPTIONPROCESS_NAME:  audiodg.exeCURRENT_IRQL:  bANALYSIS_VERSION: 6.3.9600.17298 (debuggers(dbg).141024-1500) amd64freSTACK_TEXT:  fffff802`16098ce8 fffff802`135a4fe8 : 00000000`00000124 00000000`00000004 ffffe68b`5f12a038 00000000`00000000 : nt!KeBugCheckExfffff802`16098cf0 fffff802`143a1920 : ffffe68b`5f193800 00000000`00000000 ffffe68b`5f12a038 00000000`00000000 : hal!HalBugCheckSystem+0xd8fffff802`16098d30 fffff802`13940952 : ffffe68b`5f193800 fffff802`16098db9 00000000`00000000 ffffe68b`5f12a038 : PSHED!PshedBugCheckSystem+0x10fffff802`16098d60 fffff802`14ace474 : 00000000`00000000 00000000`00000000 ffffe68b`5f1941b0 ffffe68b`5f129010 : nt!WheaReportHwError+0x382fffff802`16098e20 fffff802`14acebf2 : ffffaf01`d2503a00 fffff802`16098ec0 ffffaf01`d2503ab0 fffff802`16098ee0 : pci!ExpressRootPortAerInterruptRoutine+0x270fffff802`16098e80 fffff802`14aceca9 : ffffaf01`d2503a00 00000000`00000001 ffff0138`68246259 00006d59`f59cd2d0 : pci!ExpressRootPortInterruptRoutine+0x22fffff802`16098ee0 fffff802`13714081 : 00006d59`f59d3894 fffff802`0d583180 00000000`00000286 fffff802`135601e1 : pci!ExpressRootPortMessageRoutine+0x9fffff802`16098f10 fffff802`13602a25 : ffff8401`4243e240 fffff802`135cc090 fffff802`0d583180 fffff802`13602a25 : nt!KiInterruptMessageDispatch+0x11fffff802`16098f40 fffff802`137c2cff : ffff8401`4243e240 ffffaf01`d2503a00 fffff802`234b4df8 ffffaf01`d2503a00 : nt!KiCallInterruptServiceRoutine+0xa5fffff802`16098f90 fffff802`137c2fc7 : ffffe68b`7a3ca0c0 ffff8401`4243e240 fffff802`135cbfe0 ffff8401`4243e2b9 : nt!KiInterruptSubDispatch+0x11fffff8401`4243e1c0 fffff802`212b4476 : 00000000`00000000 0000ffff`f802212b ffff9efa`64c00000 fffff802`212b442d : nt!KiInterruptDispatch+0x37ffff8401`4243e350 00000000`00000000 : 0000ffff`f802212b ffff9efa`64c00000 fffff802`212b442d ffffe68b`6e3fdbf0 : nvhda64v+0x4476STACK_COMMAND:  kbCHKIMG_EXTENSION: !chkimg -lo 50 -d !win32kbase    ffff96c12d443f99-ffff96c12d443f9e  6 bytes - win32kbase!DirectComposition::CAnimationMarshaler::SetReferenceProperty+49[ ff 15 11 28 1a 00:e8 02 13 21 00 90 ]    ffff96c12d444009-ffff96c12d44400a  2 bytes - win32kbase!SfmSignalTokenEvent+19 (+0x70)[ 48 ff:4c 8b ]    ffff96c12d444010-ffff96c12d444013  4 bytes - win32kbase!SfmSignalTokenEvent+20 (+0x07)[ 0f 1f 44 00:e8 0b 14 21 ]    ffff96c12d445195-ffff96c12d445196  2 bytes - win32kbase!GreSfmDwmShutdown+35 (+0x1185)[ 48 ff:4c 8b ]    ffff96c12d44519c-ffff96c12d44519f  4 bytes - win32kbase!GreSfmDwmShutdown+3c (+0x07)[ 0f 1f 44 00:e8 7f 02 21 ]    ffff96c12d4451a5-ffff96c12d4451a6  2 bytes - win32kbase!GreSfmDwmShutdown+45 (+0x09)[ 48 ff:4c 8b ]    ffff96c12d4451ac-ffff96c12d4451af  4 bytes - win32kbase!GreSfmDwmShutdown+4c (+0x07)[ 0f 1f 44 00:e8 6f 02 21 ]24 errors : !win32kbase (ffff96c12d443f99-ffff96c12d4451af)MODULE_NAME: memory_corruptionIMAGE_NAME:  memory_corruptionFOLLOWUP_NAME:  memory_corruptionDEBUG_FLR_IMAGE_TIMESTAMP:  0MEMORY_CORRUPTOR:  LARGEFAILURE_BUCKET_ID:  MEMORY_CORRUPTION_LARGEBUCKET_ID:  MEMORY_CORRUPTION_LARGEANALYSIS_SOURCE:  KMFAILURE_ID_HASH_STRING:  km:memory_corruption_largeFAILURE_ID_HASH:  {e29154ac-69a4-0eb8-172a-a860f73c0a3c}Followup: memory_corruption","solutions":["Hi Alexandre, This bugcheck indicates that a fatal hardware error has occurred. https:\/\/docs.microsoft.com\/en-us\/windows-hardwa...Please check system journal (Event Viewer) for possible errors, especially Kernel-Power errors. DistributedCOM errors should be ignored."]},{"symptom":"Windows 10 Activation after motherboard change        Recently I changed motherboard and  processor in the system .Before the changed I used \"show key Plus\" to get the Windows 10 Pro product key.Did not changed the hard drive.After the update when I boot , everything worked fine except I got error to activated windows.Went into settings use changed product key- setting entered the product ID.After that I was asked to use trouble shooter, which I did , then I got error message such as\" We can't activate Windows on this device because you don't have a valid digital licence or product key. If you think you do have a valid licence or key, select Troubleshoot below. (0x803fa067)\"There was no link for troubleshoot.I repeated the process couple of times but no success.Help me to activate the windows.","solutions":["I've got the same issue. It looks like whenever you upgrade the motherboard, it requires you to buy a new license. Every other component is fine to upgrade and reactivate the same windows key. But for some reason motherboards are not allowed. I'm in the same boat now, I want to upgrade my mobo again but don't want to get another copy of Windows. Even now my settings show it's linked to my digital account but I'm pretty sure when I install a new mobo, it won't allow me to reactivate the Windows 10 Pro I'm on. ","Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Try the steps in this article: https:\/\/support.microsoft.com\/en-gb\/help\/20530\/...Regards, Ross","Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Try the steps in this article: https:\/\/support.microsoft.com\/en-gb\/help\/20530\/...Regards, Ross Hi RossThanks for quick response.Yes I have followed all the steps in that article , before posting in this forumI still cannot activate the windows 10Thanks","Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Try the steps in this article: https:\/\/support.microsoft.com\/en-gb\/help\/20530\/...Regards, Ross Hi RossThanks for quick response.Yes I have followed all the steps in that article , before posting in this forumI still cannot activate the windows 10ThanksDid you try activation by phone?","Hi Jay,Did your copy of Windows 10 come preinstalled with your PC or did you purchase it separately?Regards,Ross","Hi Jay,Did your copy of Windows 10 come preinstalled with your PC or did you purchase it separately?Regards,Ross I had windows 7 DVD, which I upgraded to Windows 10 Pro, when Microsoft was offering free.I did find my product key using show key Plus , which is freeware, to find product key.I did find the key before changing the motherboard,Thanks","Hello Jay, i'm Timon and i'm glad to help you. Activation depends on what type of license you have. As you have upgraded Windows 7 to Windows 10, your Windows 10 inherits the status of the Windows 7 license.If Windows 7 came preinstalled with the computer, this is called an OEM license: the license is linked to the motherboard and is non-transferable.If you are in this case, you need to get a new license. The story is different for retail licenses, but it requires the licence to be linked to a Microsoft Account.The Activation troubleshooter rarely if ever resolves this, you best option is to contact Microsoft Support and ask them to help you re-activate your Windows 10https:\/\/support.microsoft.com\/en-us\/help\/405170...or Call\/Chat\/Schedule a Call https:\/\/partner.support.services.microsoft.com\/...","Thanks for everyone help.Today I called Microsoft support and was able to activate Windows 10This was activated using product key on the windows 7 retail disk.I have tried several options before unfortunately none worked.Calling Microsoft help was easy and quick."]},{"symptom":"Bluescreens when playing after updating to 1909        So I just updated to 1909 and I've already had 2 bluescreens, DRIVER_IRQL_NOT_LESS_OR_EQUAL and KMODE_EXCEPTION_NOT_HANDLED. My games also randomly shuts downHere's the bluescreen dmp filehttps:\/\/gofile.io\/?c=iAFmKA","solutions":["Hi Anton, Unfortunately link opens not a dump but a suggestion to buy VPN, Can you share dump on OneDrive? Meanwhile please check PC (motherboard) manufacturer's site for updated BIOS and drivers. Update video drivers.","Oh. I failed to mentioned that I also updated my BIOS to the latest oneHere's the DMP files: https:\/\/1drv.ms\/u\/s!AuZl7KfnTWVThw8VzBRSe1Mrkuy8?e=kJpAje","The second dump says problem is network related. Please reinstall all network drivers, turn off or uninstall third-party network related tools including antiviruses. Check system files by sfc \/scannow command.The first dump does not contain useful information."]},{"symptom":"What will be the next OS name after Windows 10?        I just read an official comment that Microsoft will end support for Windows 7 in next few days. I'm in shock since I read that comment. Now i am trying to thought about upcoming operating system. Previously they stopped support for XP and they release Windows 10. Now if they end support for Windows 7 than what is the name of newer operating system?","solutions":[]},{"symptom":"Start Menu stopped working Windows 10 1909        The start menu has stopped working, when I click on the start button it makes the search box disappear and the menu doesn't open. Restarting my computer fixes it for a little bit but then goes back to not working again.","solutions":["Hello, Try to re-register Start Menu using these steps: 1. Open Task Manager, click File > Run new task. 2. Type powershell in the Create new task box. Check the option 'Create this task with administrative privileges'. Click OK. 3. In the administrative Windows PowerShell window, type\/paste following and press Enter key: Get-appxpackage -all *shellexperience* -packagetype bundle |% {add-appxpackage -register -disabledevelopmentmode ($_.installlocation + “\\appxmetadata\\appxbundlemanifest.xml”)} 4. Let it complete and then restart your system. Reference: https:\/\/www.kapilarya.com\/re-register-start-menu-windows-10Let us know if this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP.","This solution did not correct the problem.","Same here. Update was applied on a fully update 1809 Enterprise x64 as a test PC. This update is gonna deployed by WSUS and in another domain by SCCM to over 500 PCs; it would be great to hear if other businesses have the same problem...","Has anyone found a fix for this?  I just had several of my computers do this when they got 1909 a week or so ago."]},{"symptom":"usb camera        i have no sound and no video on skype its about this camera Omega Vimicro USB2.0 UVC PC Camera can somebody help me im useing windows 10","solutions":["Hello tiwadarlacko, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemIf you open the Windows 10 Camera App, do you see a photo? does it work? If no, Type in Start menu \"Device manager\" and open it Check if the camera is detected, if there was any yellow signs, send me a screenshotFeel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolvedCheers! Farah","Hello Farah , so yes i opened it in windows camera and its working but when i try to open in skype and go to settings and the screen is green and plus have no sound i will take a screenshot to show you.","And i even tried on another computer that has windows 7 and there works good the image but still no sound ","Is this a laptop or a desktop? The camera driver should be detected by windows automatically. but Skype green screen could be a conflict in Display driver or Camera Driver.Do you know what is your Display adapter? or the laptop model if it's a laptop? Farah","its a desktop , and i just updated the drivers for the display and its the same  ","it detected automatically here it is , I even instaled the cd that is coming with the camera but still the same  ","Can you check the Intel driver date? Click on properties and go to driver tab, check the date.You can check this link From Intel, which will detect your display drivers for updates and provide the last versionhttp:\/\/www.intel.com\/content\/www\/us\/en\/support\/...Can you provide Skype version as well?","so here it is the intel ","and here is the skype date ","and here is the date for graphic "]},{"symptom":"I2C HID        I am having a dell inspiron 5575 laptop .Today it encountered an error i.e the touch pad is not working properly although i had tried to update and reinstall the compatable mouse driver.The second one is the I2C HID interface is showing a yellow mark andcode 10,device can not start.A request for the descriptor failed.  What should i do now? What are the solutions? Please help me out from this problem.        THANK YOU!","solutions":["Hi, Try this, Go to Device Manager then expand the \"Human Interface Devices\" then right click on the \"I2C HID device\" then click \"Uninstall\", then restart your Computer."]},{"symptom":"\"HID Compliant Mouse\" Driver Duplicate and Error 10        **I have performed an in place upgrade of Windows 10 (1903) along with multiple runs of the system file checker and DISM. I have also attempted to reinstall the drivers from the device manager**I have had an issue with my device (pictures above) as you can see, I have duplicate drivers, with one giving me an error. I have attempted to uninstall both of these, and reinstall one. However, whenever I do so they all come back. I am not sure what is going on. It does not seem to be a hardware issue as all of the USB ports work fine. I have also attempted troubleshooting but this has done no good.","solutions":["Hi Zac, I'm Roshan V S, Independent advisor and a Windows user like you. I appreciate you for providing details about the issue and we are happy to help you.So you tried all the troubleshooting methods and you are sure it is not a failed hardware issue.And you recently upgraded to a new version of Windows 10, there might be a compatibility issue.As future Windows 10 feature updates are released it will introduce incompatibility with older devices and PC's. Certain components will not support these changes as observed by some users not seeing transparency anymore. Recommendations include, rollback, block the upgrade or consider upgrading components in your system such as graphics, storage, BIOS, motherboard or purchase a new Windows 10 PC.Best Regards Roshan V S Indepedent Advisor","what in the world are you talking about???????????????????"]},{"symptom":"Visual Basic editor        where do i find Help using Visual Basic editor","solutions":["Hi Peternosmas There is no in-built help in the VBE, you can click the small blue question mark and that will bring you to the online help pages for the Visual Basic Editor, though that can be a confusing website to navigate . . .Do you have any specific questions or problems with the VBE that we can help you with here?","Hi DaveM121Thank you for your reply and my apologies for not getting back sooner.  However I have now solved my VBE problem but have another problem which I will post on here.RegardsPeternosmas"]},{"symptom":"Windows Legacy Backup Error Message - Skipped Files at Mapped Drive                       THE SOLUTIONIf you navigate to and left-click on the main \"Libraries\" folder in Windows File Explorer, and then right-click on the individual library component categories (such as \"Documents\" or \"Pictures\" or \"Videos\") and then left-click on properties, you will see some network drives or other invalid \"library locations\" listed in the top section of the dialogue box.  If you right-click on each of the invalid library locations and then left-click on \"remove\" this will delete the invalid library location that is causing the error when running the legacy Windows 7 backup program in all versions of Windows, including Windows 10.  If this error was occurring before you upgraded to Windows 10, it will carry over to Windows 10.  I have no way of knowing how the network drive (in my case) became added to the library locations under the \"Documents\" category on my PC, however this is exactly what happened and was causing the \"skipped files\" error message 80070002. If you have any questions let me know.","solutions":[]},{"symptom":"What is the cost for Windows Compact Edition 7, 8 and IOT core 10 for OEM license ? How can I procure them ?        I am looking for OEM license prices for Microsoft Windows Compact Editions (evaluating 7 , 2013 and win 10 IOT core).Can someone please help me on how to procure the license as well ?","solutions":["https:\/\/www.microsoft.com\/en-au\/download\/details.aspx?id=38794Windows Embedded Compact 7 Evaluation Edition You are referring to Windows Embedded Compact.Wrong forums.Get answers in the Windows Embedded forumsAnd we don't work for Microsoft"]},{"symptom":"Reactivating Windows        Hi there. So I changed my whole hardware setup recently and cloned my system with a easyUS utility to a new ssd and it was working fine for a while. My email was tied to my PC for almost 3 years. When troubleshooting and reactivating didn't work for me ( I kept getting \"try later\" thing ), I was just wondering if I can still get it activated since I used Windows only on 1 system and my outlook was tied to it since the day I got the product. That would be a huge waste for me. ","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? Is Windows OEM (came with the PC) or Retail (purchased separately)? Did you just change the hard drive or did you also change the Motherboard? Also run this to see what is currently installed & post a screenshot: Right click on start & choose powershell with admin & enter: slmgr.vbs \/dlv Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hello, so I'm using 1903, OEM, I did change everything. Motherboard, video card, the whole system. Thank you for your time.","Unfortunately as you have OEM license this ‘died’ with the original Motherboard.Your options are to either phone Microsoft & plead your case & hope they offer a one-time activation or if this fails you’ll be required to purchase a new license.https:\/\/support.microsoft.com\/\/help\/4051701\/https:\/\/support.microsoft.com\/contactUshttps:\/\/partner.support.services.microsoft.com\/...","Thank you!","If you don’t have any further questions please feel free to mark one of the replies as the answer &\/or rate my help: 1 star means you are very unsatisfied with my help and 5 stars means you are very satisfied with the help I gave you."]}]}