{"windows":[{"symptom":"Windows 10 Calendar: We couldn't search the account \"Gmail\"        I have my google calendar integrated with Windows 10 calendar. When I'm in Calendar and try to search a google calendar I get the error \"We couldn't search the account \"gmail\", choose another calendar to search error.Why am I getting this error? Can I not search gmail calendars via this app?","solutions":[]},{"symptom":"Can't set Windows 10 Mail app as default mail client        If I right click a file and select Send To I get a dialog stating that no default mail client has been installed. I have set Mail as the default client in Settings\/System\/Default Apps but that has no effect. I've checked the registry key HKEY_LOCAL_MACHINE\/SOFTWARE\/CLIENTS\/MAIL and the key (Default) remains unchanged with the value (value not set). Am I missing something?","solutions":["The Mail app is not a mail client. It's an interface for webmail providers like GMail and Yahoo! Mail. A mail client is an installed program like Office Outlook or Mozilla Thunderbird.","Hi Marter1369 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.Choose Windows Mail as the default e-mail program. http:\/\/www.winmail10.com\/winmaildefaults.htmI hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Strange that all of the settings for default mail app list MAIL as recommended for Windows 10. Whatever, the only problem I've encountered with Windows 10 Mail app is the inability to get Send To working, that and the absence of a method of importing contacts or blocking senders. It seems it's a very rudimentary app. Thanks for the response.","Thanks for the reply Joseph. I've already tried all of the steps in the article. This isn't a major issue since it the only problem I've encountered is the inability of being able to \"Send To\" when selected from an explorer context menu."]},{"symptom":"how to restore my system        sir\/madam      my system is c drive occupies so much space with old version, so now I want erase old version and copy new version only","solutions":["Hi HusainClick your Start button, then just type disk Cleanup. Open that utility from the resulting list.When the window appears, cjoose to Cleanup system files. Select everything in the list and run the Cleanup. That should remove the Windows. Old folder along with other data from previous versions of Windows safely...","its windows old, programme file and programme data 30gb so kindly how to install fresh windows 10 restore with latest version and erase old version files everything","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. There are couple ways to install fresh Windows 10. You can Reset the PC with selecting the option \"Remove Everything\" You can use the following tool to install fresh Windows 10. https:\/\/www.microsoft.com\/en-in\/software-downlo...You can also delete the Windows.old folder: Here are the steps in the following page: https:\/\/www.windowscentral.com\/how-properly-rem..."]},{"symptom":"User folder gone?        Well i have an issue. I was trying to unhide the appdata folder in my C drive and i went into the properties. I remember seeing something about unhiding folders so i checked it, then hit apply and ok. when it was done my user was gone... When i log in I still see my username so i'm still logging into my account, i just don't see any folders. In C:Users I only see Public. I do not have a system restore\/backup of any sorts. How can i fix this? Please help..Also most of the stuff i had in my C drive is gone now","solutions":["Hi InDanger223 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.What happens when you type %appdata% in the Start Search box and press Enter? I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"Smartswitch requires USB driver which doe not seem to exist        Trying to use Samsung Smartswitch and it will not recognise when S3 connected. It suggests new USB driver needed but cannotfind.Help required please.","solutions":["Can't do that 'cos i am not in the USA but in the UK SO that number will not work thanks for trying."]},{"symptom":"Unable to signin to WLM        I cannot singin to my Windows Live Mail .  I continue to get a popup that readsTo help protect your Online Id account you must signin again.Regardless of the times I attempt, this continues to block me out.","solutions":["When you say \"Windows Live Mail\" are you speaking about the program that's part of the Windows Live Essentials suite or are you really talking about the web-based Outlook.com mail service?"]},{"symptom":"Access Violation at Address Error when Printing        Hi, I just replaced the drum unit of my HL-L2300D Brother printer, but now I keep getting the error, \"Access violation at address 76EF3CB3 in module 'ntdll.dll'. Write of address AA00E51B\" whenever I try printing.From what little I could find online about it, it seems like it may be a system error?","solutions":["Hi PaigeStewart and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"Windows 10 licence        I am getting an unused pc from a friend with Windows 10 installed with the licence linked to his account, is there any way to link the licence to my account as he no longer has a need for it as I have the machine (no changes to hardware are made)","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,To unsync the PC from a Microsoft account, go to https:\/\/account.microsoft.com\/devices\/ and locate the device which has the same license and choose to remove the account.In order to sync the device to your Microsoft account, 1. Go to settings and choose accounts 2. Under your info, choose to sign in with your Microsoft account. Upon signing in your Microsoft account on the device, the device's information will then be added to your Microsoft account.As for the license, it will recognize the synchronization of the Microsoft account and the hardware information on the device to re-activate itself by the Microsoft servers."]},{"symptom":"Cannot change storage quota        I have an issue with changing storage quota. One of our users changed license from Office 365 F1 to Office 365 E3.Then the storage quota got stuck at 2gb. In nutshell, the license was changed but OneDrive storage quota is stuck","solutions":["Hi Jordan, my name is Martin and I'm an Independent Advisor. I'll try to help you here.I suggest that you follow the methods provided below. Check if the user has the SharePoint Online license.1. Follow the link and move to Microsoft 365 admin center as administrator (find Active users, find the user)https:\/\/admin.microsoft.com\/Adminportal\/Home?so... 2. Check Licenses and Apps tab on this account. You mentioned that Office 365 E3 license is assigned to the user so Office 365 E3 should be checked in Licenses.3. Move to Apps, to SharePoint Online. It should be checked as well. In other cases you should check this option and click Save changes.4. Ask the user to sign out and sign in again to Office 365, move to his OneDrive settings page and check the storage result. Sometimes this easy procedure helps to fix the issue."]},{"symptom":"Black Screen with sounds        Hello everyoneThree days ago I started having some issues, my laptop will turn on but, after posting, nothing will appear in my screen. Just the black screen with white light in the background indicating that the screen is on.what i have done to remedy this issue is:1. from the BIOS I performed a diagnostic of the whole system with positive results. 2. I have tried to start windows in safe mode and didn't work3. I decided to do a clean install. My windows key only allowed me to do this and not to repair windows. This attempt was unsuccessful at the end because it didn't allow me to use a new partition to install windows.4. I used my OEM software to start a clean installation. This process is successful and delivers a working computer. 5. Nevertheless, after some short amount of time, I am in the process of recovering my configuration and files and putting everything together, the computer comes back to the same state. black screen. I though that there may be some software issues.6. The second time and repeated the recovery. I got the same results. i stopped windows updates as soon as I was able to and when to look for the latest BIOS update from my OEM update client. when the files were downloading i saw the black screen. I must say that for the first and second time that i have performed the update, the black screen appear within minutes of the recovery.7. For the third time, I didn't allow windows to connect to the internet. I went to disable automatic updates from the device manager but forgot to do it for windows. Then I connected the machine to the internet and when to my OEM client to update the BIOS. the process was done successfully. I restarted my computer on purpose to see if the machine will continue through the process. This step was successful as well. I left the computer idle for a minute while I thought my next step. I saw then the first indication of what is going on. I saw three different cmd windows pop up and disappear very quickly, after that the screen goes black. Then i heard the sound that windows make when you plug in a new device. suffice to say, i didn't plug anything new. After this, I remembered that the same thing, the sound, played in the other two installations. I am going to repeat the process for my next try. I am not going to connect to the internet until I disable automatic updates for drivers and windows update. Let´s see what happens next. And now, my question. does anyone else has a similar issue? I have been looking through the forums and although i have found plenty of advice on fixing the black screen, most relate to hardware issues. I have performed several test and this does not seems to be the case for my device. any idea of what is going on? any clues that the community can provide me to fix this issue will be greatly appreciated.bestJulian","solutions":[]},{"symptom":"Team Viewer & Mouse without Borders        Tech Community:I am using Mouse without Borders on two remote devices.  I am able to connect to those devices via Team Viewer.  The problem I have is once I connect to them using Team Viewer, I can not control the second PC if the mouse is on the 1st PCs screen.  Has anyone had this problem?  How did you solve it?  Thank you for your help.Sincerely,Jbreedlo","solutions":["Don't call the number. It's spam","Hi jbreedlo, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Try the following, once what you said happened to me, and these steps worked for me, and I had control of the other computer with my mouse.Open Team Viewer >> Extras >> Options >> Advanced >> Show advanced options >> Section: Advanced settings for connection to other computers >> Access Control >> Select: Full access + OkIf they don't work for you, you could uninstall it and reinstall it Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M."]},{"symptom":"\"Show shadows under windows\" option keeps getting unchecked        I need to have the shadows under windows. In Systems Properties-> Advanced Tab -> Performance -> settings -> there is a checkbox \"Show shadows under windows\".  Whenever I check this option (under Custom), the shadows appears as intended but after a few minutes they are gone and I had to go over again and check the above option. Why it gets unchecked by itself? I have tried re-installing the windows (with keep apps and data option) but it did not help.It is a Surface Pro 2017, Windows 10 Pro, Version 1903, OS Build 18362.418","solutions":["Hi MJK_711,Thank you for posting in Microsoft Community.It is very usual that the custom visual settings revert while working on the computer. We will certainly look into this for you.To get better clarity on the issue, please let us know:1)    Does this happen even when you set the option for “Adjust for best appearance”?2)    Does the setting revert after logoff\/restart or while you are still working on the computer?Let us try a few steps and check.Method 1: Update Windows and Drivers.Make sure your computer has the latest updates for Windows 10. To check you can referUpdate Windows 10You can also check Download drivers and firmware for SurfaceMethod 2: Check Ease of Access SettingsPress Windows key + R to open RunType control and press OK. This should openControl Panel.Double click on Ease of Access Center and select the option “Make the computer easier to see”Look for the option “Turn off all unnecessary animations(when possible)” anduncheck the box next to it.Click on Apply and OK.Check if the visual settings revert. Method 3: Check in a new user account.Create a local user accountSelect the Start  button, selectSettings  > Accounts  and then select Family & other users. (In some editions of Windows you'll see Other users.) Select Add someone else to this PC.Select I don't have this person's sign-in information, and on the next page, selectAdd a user without a Microsoft account. Enter a user name, password, password hint or choose security questions, and then select Next.Change a local user account to an administrator accountUnder Settings  > Accounts  > Family & other users, select the account owner name, then selectChange account type. Under Account type, select Administrator and OK. Sign in with the new administrator account.You can refer the video forCreate a Local Account.Customize the visual settings in this account and check if the settings revert. If the setting stays then we can try to make this as your Microsoft account.However, let us know the results. If issue persists, we will certainly assist you further.Regards,Vivian S"]},{"symptom":"I can not set up my windows 10 laptop        I can not set up my windows 10 laptop* Original title: windowss 10","solutions":["Hi Malissa Can you please provide us with as much detail as possible so we may understand the problem. . .Is this a new laptop and are you setting it up for the first time, or are you re-installing or resetting WIndows 10?What is the exact difficulty you are encountering, and if possible a screenshot would really help, if that's not possible, if you are seeing an error, what is the exact text on that error . .."]},{"symptom":"Showing a notification or icon badge of how many virtual desktops are open?        Is there a way of knowing how many virtual desktops are active without actually going into the \"task view\" button?If not can you look into creating some sort of active badge that tells you that you have multiple virtual desktops. The reason is i dont want shut down if there is something important going on in one desktop that i cant see on my current desktop. In which case i might just shut down without checking...","solutions":["Hi Cherian I'm afraid there isn't anything like that at the moment, you can check with winkey+tab but that simply opens task view.i guess a simple thing like a number on the task view icon (like notifications) would work?it could be a useful idea, you can make the suggestion to the development team using the feedback hub (winkey+F).when you have left the feedback use the share option and post a link back here so that others may find it and vote on it.","Yep a number on the task view is more than enough. Email app does it...I thought Windows added it to task view.Ahh well....I'll forward it to the dev team. ","\"I thought Windows added it to task view\" It is not in the latest insider preview (19536), but that does not mean that they are not looking into it,with luck they will like your suggestion and add it shortly."]},{"symptom":"Surface Book Wifi problem        I have recently purchased a Surface book and in the process of setting up updated to the latest version of Windows 10. (1909). This appears to have killed the WIFI and Blue tooth. In Device Manager I can see the Marvell AVASTAR Wireless-AC Network Controller, but it is disabled. When I try to enable it automatically disables again after about 2 seconds. I have uninstalled and tried updating the drivers, but I get the same problem. Anyone have any ideas.","solutions":["Hi, FalconPG My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps to repair your Internet connections: Enter the Start menu or by pressing the Win + I key combination, open the Settings and click on the Network and Internet option. Once there, we select the Status option from the menu on the left side and, within the configurations and options that are loaded in the right panel, we have to look for the restoration of the network. When you click on this option, it will show us a new window from where we can restore the network in Windows 10. In this way, all network adapters will be removed and reinstalled, and the original configuration of other network components will be restored. net. This implies that if we were using some software, such as a VPN client or virtual switches, we will have to reinstall them.A process that the system performs automatically by clicking on the Reset button that is now displayed in Network Reset in Windows 10 settings. It is normal for the process to not take long, although we must wait until the end completely and restart the computer to continue with the network configuration in Windows 10 as we have done so far.https:\/\/www.kapilarya.com\/how-to-reset-network-...https:\/\/support.microsoft.com\/en-us\/help\/10741\/...You can also check that your drivers are updated. https:\/\/support.microsoft.com\/en-us\/help\/402844...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Problems with Visual C++        Hi all! I`ve been tryingo run an aplication (Microsoft Flight Simulator X Steam Edition). When I click on the icon to execute it, there comes a message where says \"Can´t run the game, paralel setup is not OK\" (or something like that). I've been recovering information and i got to the idea that I need to install a Visual C++ Library on my computer. The one I need is:MicrosoftVC80.MFC,processorArchitecture=\"x86\"publicKeyToken=\"1fc8b3b9a1e18e3b\",type=win32,version=\"8.0.50608.0\"What can I do to download the Visual C++ Library? Thanks","solutions":["Hi, thanks for sharing your question in the community! My name is David an independent advisor and I am here to help you.In order to properly guide you in your question, I would like you to please attach a screenshot of the specific error message that appears on your screen.However, please try downloading and installing the following update packages for Visual C ++ 2005 and 2008https:\/\/www.microsoft.com\/en-us\/download\/detail... Visual C++ 2005https:\/\/www.microsoft.com\/en-us\/download\/detail... Visual C++ 2008Remember to download both files in the X86 architecture, which refers to the library you identified is necessary.Let me know if the information has been helpful or you still need more help, I will be waiting for your response.","Thank you very much!! I solved the problem just downloading the first visual C++ Library. Now the problem is over and everything is fixed, I am very pleased with your help. Thank you very much, cheers, and have a nice day :)!!!","Hi! Thanks for keeping in touch. I am very glad that your incident was solved.It has been a pleasure to have been able to help you, remember that if you have more questions you can contact again. Have an excellent day, regards."]},{"symptom":"FIle Browser and others having trouble rendering menu bar        This issue has happened on multiple programs (Photos, Chrome, File Explorer and others).  The menu bar when the window is maximized does not display and is not functional.  If i adjust the size to full but not maximized it will display just fine.  Its not a display thing and seems to be linked to the Maximize feature.","solutions":["Don't call this number, it's spam.","Hi Koonsie and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.Use the System File Checker tool to repair missing or corrupted system files https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"PHOTOS uploading        All of my pictures are on PHOTOS.  I want to transfer them to another folder.  How do I do this?","solutions":["Hi , EdnaWhitehurst My name is Dennis, I'm an independent advisor and I'll do my best to help today. in that case you need to select all the photos and right click on them and select copy or cut, copy will create copies of the photos and cut the movera from the current folder to the new one you want to move the photos.in the following link they explain how to move files in windows 10 which can be done with the photoshttps:\/\/www.dummies.com\/computers\/operating-sys...hope this helps you Regards, Dennis. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Device Sleep problem        When i tried to sleep my computer,Instead of sleep it's shutting down.","solutions":["Hi Linus, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Sleep is likely related to the display driver. Please see the below options: Option 1.Try Rolling back if you have an option: Go to Device Manager by typing in Devmgmt.msc in Run dialog box. Navigate to Display devices and right click ATI Radeon HD or Similar device you have. Choose Properties.On the Driver tab, hit rollback Driver to go back to the previous version. Option 2. Remove drivers completely and Install the the newest ones available from the OEM or the maker.What you need to do: 1. Uninstall everything of Display driver using DDU http:\/\/www.guru3d.com\/files-details\/display-dri...2. Reboot. 3. Make sure your device manager shows Microsoft Basic Display adapter. 4. Download the driver from the OEM or the maker like AMD 5.Run the Setup and you should be good to go. Disclaimer: Guru3d.com is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"Folders-windows10        Is it possible to add a new folder in the this pc area. The folders that are already there are desktop,downloads,documents,  images, videos","solutions":["Hi User,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Are you talking about adding a folder in the left sidebar under quick access?","Hi User,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Are you talking about adding a folder in the left sidebar under quick access? Yes its under quick access When you open quick access you will see a folder nammed This pcWith a computer icon next to it","I understand. unfortunately, you cannot add a folder in the navigation pane in any easy way except for under quick access.Right click the folder and choose Pin to quick access.","I understand. unfortunately, you cannot add a folder in the navigation pane in any easy way except for under quick access.Right click the folder and choose Pin to quick access. But is there away to convince Microsoft to add that function in the future updates?","Yes, please add a feedback in the hub so that devs can look into this: https:\/\/support.microsoft.com\/en-in\/help\/402156...","Yes, it's possible. But if you only need one folder, and you don't use 3D Objects (does anyone know anyone who does???), You can repurpose that.Post more details on what you want to do.There are actually 12 folder shortcuts already there, but 5 are normally hidden and duplicating their visible counerparts, but all this can be changed. Here, all are visible with3D Objcects remaned to Sandbox:"]}]}