{"windows":[{"symptom":"Windows 10 update travado versao 1903 x64 e windows defender sumiu        Já realizei os procedimentos aqui descritos na ajuda, porém ate agora sem sucesso.Além de gerar o erro  quando rodo a aplicação de verificação, é detectado o erro mas sem opção de conserto.Meu Windows Defender também não está ativo depois da ultima atualização.Abaixo as informações da ferramenta de diagnostico.Imprimir Windows Update Detalhes do fornecedor Problemas detectados Procurar problemas do Windows Update Procurar problemas do Windows UpdateDetecta problemas relacionados ao Windows Update. Detectado Detectado Resolver problemas do Windows Update Concluído  Possíveis problemas verificados Algumas configurações de segurança estão ausentes ou foram alteradasAlgumas configurações de segurança estão ausentes ou foram alteradas Problema ausente Verificar se há arquivos ausentes ou corrompidos Verificar se há arquivos ausentes ou corrompidos Problema ausente Registro de serviço ausente ou corrompido Registro de serviço ausente ou corrompido Problema ausente Problemas detectados Detalhes de detecção 6 Procurar problemas do Windows Update Detectado Detectado  Detecta problemas relacionados ao Windows Update. Resolver problemas do Windows Update Concluído  Resolve problemas comuns do Windows Update. InformativoWaaSMedicService Problemas corrigidos por:NoUsoScanPlugin    Possíveis problemas verificados Detalhes de detecção  Algumas configurações de segurança estão ausentes ou foram alteradas Problema ausente    Verificar se há arquivos ausentes ou corrompidos Problema ausente     Registro de serviço ausente ou corrompido Problema ausente    Detalhes de detecção Expandir InformativoIsPostback_RC_PendingUpdates IsPostback: False  InformativoWaaSMedicService Problema encontrado por:NoUsoScanPlugin  InformativoIsPostback_RC_PendingUpdates IsPostback: True  InformativoService Status Problema com o serviço BITS: O serviço solicitado já foi iniciado. Para obter mais ajuda, digite NET HELPMSG 2182.  InformativoService Status Problema com o serviço BITS: O serviço solicitado já foi iniciado. Para obter mais ajuda, digite NET HELPMSG 2182.  Informações sobre coleção Nome do computador:  LAPTOP-1E7RDIFF Versão do Windows: 10.0 Arquitetura: x64 Hora: sexta-feira, 3 de janeiro de 2020 11:06:06 Detalhes do fornecedor Expandir Serviço de Transferência Inteligente em Segundo Plano Localizar e corrigir problemas que possam impedir downloads em segundo plano Versão do Pacote: 3.5 Fornecedor: Microsoft Windows Diagnósticos de Rede do Windows Detecta problemas na conectividade de rede. Versão do Pacote: 4.0 Fornecedor: Microsoft Windows Windows Update Resolva os problemas que o impedem de atualizar o Windows. Versão do Pacote: 9.3 Fornecedor: Microsoft Windows","solutions":["Saudações WalkerRamon ! Sua postagem é muito bem vinda em nossa Comunidade Microsoft. O link abaixo de outro membro da comunidade ajudou outras pessoas com as orientações e\/ou procedimento para o mesmo erro ativando o windows defender no registro do windowshttps:\/\/answers.microsoft.com\/pt-br\/windows\/for...Atenciosamente. Rubens Junqueira Consultor especialista independente e membro da Comunidade Microsoft","Saudações WalkerRamon ! Sua postagem é muito bem vinda em nossa Comunidade Microsoft. O link abaixo de outro membro da comunidade ajudou outras pessoas com as orientações e\/ou procedimento para o mesmo erro ativando o windows defender no registro do windowshttps:\/\/answers.microsoft.com\/pt-br\/windows\/for...Atenciosamente. Rubens Junqueira Consultor especialista independente e membro da Comunidade Microsoft Vou tentar realizar esta solução para ver se obtenho sucesso.Mas preciso de uma solução para o windows update que não funciona conforme as informações postadas.Obrigado","Em resposta,Sem sucesso, no menu Proteção contra vírus e ameaças nenhum dos botões realiza a função.Verificação rápida - sem funcionarVerificar se há atualizações - sem funcionarNa janela Provedores de Segurança, o item antivirus fica com nenhum provedor, o unico link ativo nestas é o encontrar apps de segurança na Microsoft Store.","Olá walkerRamon! Tudo bem? Seja Bem vindo ao fórum da Microsoft! Muito obrigado por colocar a sua questão à comunidade. Em continuação da ajuda prestada anteriormente pelo meu colega sugiro que realize alguns passos antes de tentar novamente o update do windows.Realizar limpeza de temporários: Digitar no menu pesquisa do seu windows \"Limpeza de disco\". Seleccionar todas as pastas menos a pasta \"Transferencias\" Pressionar botão \"limpar\" Verificar de novo o erro que nos relata Etapa 2 Limpar temporários através do sensor de armazenamento: Aceder através do Painel de Controlo; Seleccionar Sistema Seleccionar Armazenamento Seleccionar todas as opções excepto \"transferências\" Executar o processo duas vezes para certificar que limpa correctamente o sistema.Realizar reset às definições do Windows Update: Siga os passos constantes no link que coloco em baixo: http:\/\/moontera.com\/tutoriais\/windows\/forcar-a-...Nota: Este é um site não-Microsoft. A página parece estar fornecendo informações precisas e seguras. Fique atento aos anúncios no site que podem anunciar produtos frequentemente classificados como PUP (Produtos Potencialmente Indesejados). Pesquise cuidadosamente qualquer produto anunciado no site antes de decidir baixá-lo e instalá-lo. Devolva nos um resultado destes passos SEM EXECUTAR O UPDATE ainda. Diga nos se ocorreu algum tipo de erro para que se compreenda onde o sistema bloqueia.Aguardaremos...."]},{"symptom":"Alarm clock does not work        My alarm clock would not sound. I tried changing the time and it does not allow me to make changes. troubleshooter does not resolve. uninstalled and reinstalled, removed and reinstalled via powershell, issue persists. Tried a third party alarm, alarm does not sound, nor notify. Able to set alarms in 3rd party app, but otherwise does not work. Created another user account to test, issue persists. does not launch in safe mode.","solutions":["Hi X, You might want to check this article for possible solution regarding your issue: https:\/\/windowsreport.com\/alarm-sound-not-worki...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","The only thing I hadn't tried in that was the media feature pack. It didn't resolve the issue. Additionally, when I ran the third party app, I show a background task host error in event viewer associated with ntdll.dll and biwinrt.dll. When attempting to unregister and reregister the associated dll, I'm getting an error to \"make sure that \"ntdll(and biwinrt).dll\" is a valid DLL or OCX file then try again.\"I've also tried repairing via dism, issue persists.","Hi X, If all else fails, it would be better to restore these services\/default system features by Refreshing your Windows OS.Please let me know if you need further assistance. Thanks and regards,"]},{"symptom":"Windows 10 tasks ending constantly        Hello, i recently tried to install filmora 9 but during installation, it began to restart. So i forced shutdown. When i booted it back up it started normally. i entered My password and it took 5 minutes to complete. But when windows loaded, windows explorer was constantly starting up and ending a couple of seconds later, even in safe mode. I tried task manager but it could never load either.any help is appreciated.","solutions":["Hi Rad, Based on your concern, there's a lot of people experiencing this kind of issue as well.What I can suggest is to rollback and disable your windows update for the mean time.This actually worked for me, please follow this link for detailed guide: https:\/\/www.windowscentral.com\/how-stop-updates...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Hi, thank you for the reply, but the page that you linked is not found.","Hi Rad, I do apologize for the missing link. Please try this one instead: https:\/\/www.cleverfiles.com\/howto\/disable-updat...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Thank you, but this does not fit my problem, i am unable to access anything except the task manager. My desktop will show for half a second then go off. I think this problem is a little different.","Hi RaD, Can you remember any changes before this happened? Please let us know to further identify this issue. Thanks and regards,","Well i believe it was updating and restarted which was when i forced shut down.","I think the problem may be that explorer.exe is corrupt","Hi RaD, Most likely, yes. However, if all else fails. You need to do a Reset\/Refresh on your Windows 10. To restore corrupted sectors in your system. Please refer to this link for guide: https:\/\/pureinfotech.com\/refresh-windows-10-cle...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","I attempted to do a reset and keep personal files but it will not work. Before i attempt a compete reset, is there any way to run a virus scan from the command prompt?","Hi Rad, Yes, there's a way for you to do that. Please check this article: https:\/\/www.instructables.com\/id\/Removing-virus...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"Windows 10 Upgrade        I just installed Windows 10.  Upon restart I get a flickering screen with the wait circle continually circling.  Cannot use any of the Hotkeys to access anything. ","solutions":["Hi, Don My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"windows store        hello,I cant open the windows store. or any windows related apps. my windows is verified but still it wont open the windows store.I get no errors. it just wont open","solutions":["Hi, Brian0075NL My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hello, Try re-registering Store app. Perform these steps: 1. Search for Windows PowerShell using Cortana or Windows Search. 2. From results, right click on Windows PowerShell and select Run as administrator. 3. Then type following command and press Enter key: Get-AppXPackage *WindowsStore* -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"} Let the command complete. 4. Close Windows PowerShell. Let me know if issue still persists!","I cant select the Yes to all i paste Set-ExecutionPolicy Unrestrictedthen i get that messge then i tried to set it to Adidnt work","Add-AppxPackage : Deployment failed with HRESULT: 0x80073CF9, De installatie is mislukt. Neem contact op met de softwareleverancier.Windows cannot install package Microsoft.WindowsStore_11811.1001.1813.0_neutral_~_8wekyb3d8bbwe because the package iscurrently paused. The package must be Staged in order to proceed.NOTE: For additional information, look for [ActivityId] 2b90f197-c237-0002-1e16-912b37c2d501 in the Event Log or use the command line Get-AppPackageLog -ActivityID 2b90f197-c237-0002-1e16-912b37c2d501At line:1 char:53+ ...  | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.I ...+                 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~    + CategoryInfo          : WriteError: (C:\\Program File...ppXManifest.xml:String) [Add-AppxPackage], IOException    + FullyQualifiedErrorId : DeploymentError,Microsoft.Windows.Appx.PackageManager.Commands.AddAppxPackageCommandI recieve this error","Did you make sure to enter Powershell as Administrator?","I reinstalles windows. And that fixed it","I'm glad you could solve the problem"]},{"symptom":"After Windows 10 Update Hp pen doesn't work        Dear all,I update Windows 10 yesterday and today my HP pen doesn't work! I have to draw with my laptop for work, please help me!!Here system information:Manufacturer  HP  Model HP Spectre x360 Convertible 15-bl1XX  System ID 827F  Product ID 2PG90EA#ABU  Memory Size 16384 MB RAM BIOS Date 10\/15\/2018  BIOS Revision F.38  Serial Number 5CD7464X3K  Operating System Image 17WW3KBT601#SABU#DABU  Installed OS version 1903 (10.0.18362)Processor Type Intel(R) Core(TM) i7-8550U CPU @ 1.80GHz Current Processor Speed 3700 MHzMemory 1 Bank Locator BANK 0  Device Locator Bottom - Slot 1 (left)  Manufacturer Kingston Serial Number  031278F5  Part Number HP26D4S9S8MHF-8  Memory Size 8192 MB Maximum Memory Speed 2667 MHz Memory Type DDR4  Type Detail Synchronous, Unregistered, Unbuffered   Memory 2 Bank Locator BANK 2  Device Locator Bottom - Slot 2 (right)  Manufacturer Kingston  Serial Number 021276F5  Part Number HP26D4S9S8MHF-8  Memory Size 8192 MB Maximum Memory Speed 2667 MHz Memory Type DDR4  Type Detail Synchronous, Unregistered, Unbuffered     Hard Drive \/ Solid State Drive 1 Model THNSN51T02DUK TOSHIBA  Firmware version 5KHA4102  Serial Number 0008_0D02_0025_4344.  Capacity 953.86 GB SMART Support False Bytes per Sector 512  Drive Letter C:  Volume Label WINDOWS Battery 1Location Primary  Device Name Primary  Manufacturer 333-2C-10-A  Serial Number 2934  Capacity 79230 mW.HourVoltage 11550 mV Chemistry LION Best,Martina Pani","solutions":["Hello, I am Andrew a Windows expert. Are you able to use the touchscreen with your finger?Let's have a look at your Device Manager, your current driver for the touchscreen may not be working properly. To find this please right click on your start menu and select Device Manager.In the window it opened click the arrow beside Display Adapters, then open the setting inside by double clicking it.In the window that pops up check the Driver tab, then click Update Driver. It will automatically search for a new one.Once finished click ok and restart your computer. Try using your touchscreen again.If you still cannot use your touchscreen I recommend using HP's diagnostic utility found herehttps:\/\/support.hp.com\/ca-en\/topic\/diagnostics?...It's quite good at finding issues. Please get back to me if this does not work Best Regards, Andrew Disclaimer: Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","still not working i have the same problem as her.The operator system doenst provide my hp pen The pen is working on other device but on this hp laptop.İ tried almost everything"]},{"symptom":"After clicking Google Chrome (short cut), and typing URL on address bar, I get message Aw snap.  What could be the solution?        After clicking Google Chrome (short cut), and typing URL on address bar, I get message Aw snap. What could be the solution?","solutions":["Hi shankarpoojary is this happening with every URL or just one? try clearing the cache in chrome press Ctrl+Shift+Del in time range select \"all time|\" select \"cached images and files\" and \"cookies and other site data\" and click \"clear data\"restart chrome and try the URL again","After clicking Google Chrome (short cut), and typing URL on address bar, I get message Aw snap. What could be the solution?-Look for Fix \"Aw Snap!\" at https:\/\/support.google.com\/chrome\/?hl=en Don"]},{"symptom":"import outlook ost file into outlook 365        import outlook ost file into outlook 365","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.It’s a bit of a complex process if you’ve not done this before but here is a guide which runs through the steps:https:\/\/www.nucleustechnologies.com\/blog\/ost-to...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"File explorer on dark mode illegible bug        Dark mode works beautifully on everything, except File Explorer.A highlighted selected item is legible, but becomes stark white with white text once the selected item's window is deselected (still keeping the selected item selected), causing a light grey\/white illegible block.When using the details view, the titles 'Name, Date modified, Type and Size' are illegible light grey text on another light grey block. Illegible and not very aesthetic either.The folder's breadcrumb is completely illegible with stark white text on a stark white background.As you can imagine, this issue makes using windows 10, very difficult. Everything is a 'mix' between light mode and dark mode:I'm not really sure what to do anymore;I have tried turning contrast settings off and on again.I have tried changing the accent colour in Settings > Personalisation (automatic and manual selection).I have done several fresh installs, including a whole new install on a new SSD(C:) instead of my old HDD(D:) and this issue persistsHas anyone come across this issue before and know how to solve it? I'm on the verge of just never using Dark mode on Windows.","solutions":["> Resolved.Embarrassingly, after struggling with this issue for too long. I decided to post on this forum out of desperation.As a random thought, I went into Settings > Personalisation > Themes. Selected the default windows theme. Went back toSettings > Personalisation > Colours. Turned on Dark mode and Voila.Cheers!","Hi Jay, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Yes, indeed it was an actual solution - we also ask the users to do it as a first step.The other cause of it is a 3rd party Explorer modifier like Winaerotweaker - even if it was installed\/uninstalled way back it still affects Dark mode.Let us know if you need any other help!"]},{"symptom":"Explorer window stops responding for Network after viewing This PC        On my Windows 10 desktop, I have two icons, \"Network\" and \"This PC\". If I click on \"Network\", it brings up an Explorer window with a list of all devices found on my local network (NAS, TV, printers, etc.). If I right-click and choose Refresh, this list will refresh. If I then open up \"This PC\", it brings up an Explorer window with the hard drives, etc. on my local PC. Included in this list is my NAS, which is not a mountable drive, but a separate host altogether.After I load the \"This PC\" Explorer window, any subsequent attempt to open or refresh the \"Network\" Explorer window will hang indefinitely (at least 24 hours). This only happens after opening \"This PC\", never before. It is 100% reproducible. The \"This PC\" and other Explorer windows will continue to function just fine, as long as they do not display anything from the \"Network\" hierarchy (for example, in the sidebar). The only recourse to the unresponsive window is to kill and restart explorer.exe in the Task Manager.Any ideas what is causing this? Rebooting the computer does not fix the issue -- the behavior happens after reboots. Disks are not corrupt -- disk scans do not find any problems, and it works 100% of the time before opening \"This PC\".","solutions":["Hi Hrunting. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) First let's try some of the fixes working recently for Explorer issues reported here. I'll include crashes as well as hangs as they seem to be related with most of these, and can be caused by Updates:https:\/\/www.easeus.com\/resource\/how-to-fix-wind...https:\/\/www.bing.com\/videos\/search?q=windows+10...https:\/\/www.kapilarya.com\/fix-file-explorer-not...https:\/\/superuser.com\/questions\/1274763\/windows...https:\/\/www.theinquirer.net\/inquirer\/news\/30842...https:\/\/community.spiceworks.com\/topic\/2191691-...2) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 3) Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.4) If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... -------------------------------------------- But remember that in Windows 10 everything depends upon the quality of the install, and Factory or Upgrade installs are inferior installs which most enthusiasts won't even run because they'd expect endless issues. Consider now or later doing the Clean Install in this link which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... There is also an automated Fresh Start that reinstalls WIndows while shedding corrupting factory bloatware, saves your files, but doesn't clear the drive to get it cleanest:https:\/\/www.howtogeek.com\/265054\/how-to-easily-... I hope this helps. Feel free to ask back any questions and let us know how it goes. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","So this is pretty much the standard response to any sort of Explorer issue, and none of it fixes my case, short of a full wipe of the system, which frankly, is not a solution. My system was originally a fresh, clean install of Windows 10, but after the March 2019 update, this problem appeared. Hopefully, the solution to Windows Explorer issues is not to clean install Windows every time a major update comes out.Is there any way to actually troubleshoot the problem? To see what the Explorer window is actually hanging on? Any process debug tools or tracing tools that can actually give insight into what is happening?"]},{"symptom":"Windows Proffesional 10 freezes durin driver update (as I suppose)        Hello,Not so long time ago I decided to change my Windows 7 to Windows 10. I did not do update, but reinstall system with deleting all data from my drive (format). After installing Win10 on my PC i tried to install drivers and all programs to use this PC normally.During installation of Graphic drivers my computer freezes and there is nothing to do, only power cycle can help to bring it up. I found it as common issue on the Internet, but none of tips did not helped me. What is more, today I decided to install Windows once again, from very beginning, and this issue still occurs. Windows does not see my graphic card, and i am not able to install drivers.Some details about my PC:System: Windows 10 ProfessionalGraphic card: Gigabyte Radeon HD 7970 OCMotherboard: Asrock z77 extreme4Processor: Intel 3570kWhat is worth to notice, on Windows7 i had all drivers and everything worked fine. Could anyone help me?Thanks in advance,Kamil","solutions":["Hi Kamil This seems to be a known issue with the Radeon HD 7970 OC, there are a lot of threads over on the AMD forum regarding this, please see this thread on the AND forum for a possible solution:https:\/\/community.amd.com\/thread\/184731________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","Thank you Dave,Actually I managed to install drivers as in tutorial you provided, and my GPU can be seen now by windows:but still, i do not know how to use this GPU.  My system still uses Intel Graphic Card, not AMD. I do not have (and can not install) AMD software to pick up my GPU. Do anyone have an idea how to fix that? Kamil"]},{"symptom":"problems with bluetooth headphones        I want to configure my new headphones but these have problems with windows I don't know much about these things.","solutions":["Hi ,RACC1 my name is Dennis, I'm an independent advisor and I'll do my best to help today. Run the Windows 10 Bluetooth troubleshooter. Windows 10 has built-in troubleshooter programs that can scan your computer for specific problems and fix them.To begin the Bluetooth troubleshooter, open your Start Menu and click Settings > Update & Security > Troubleshoot > Bluetooth.here more ways to repair work bluetooth devices https:\/\/www.lifewire.com\/fix-windows-10-bluetoo...hope this help you. Regards, Dennis. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"cant make my printer default printer        i have a new printer but can't make it the default printer could use the drop down box but thats not working now either tried to make it default said try this site ","solutions":["Do you have administrator rights for that computer?","Please describe step-by-step how you're attempting to set your new printer as the default printer and describe exactly what happens (you shouldn't need to be logged in to an \"administrator\" account).Please open Devices and Printers and list all of the icons in the \"Printers and Faxes\" section.  Do any of these items show a warning icon?  Right-click on the icon for your new printer, select \"Printer properties\" and click \"Print Test Page.\"  What happens?What is the make and specific model of your new printer?","This is one of the screen shots i took The printer is printing again not but goes to dymo label first now I have to change the printer options with the drop down box but a least it has started printing again that your for replying Patricia ","How do I check for that please it is a desktop and i am the only user  thank you for replying PatriciaI searched the computer and found this info I do get message when a change is made  changes made to your computer that require administrator-level permission. The default UAC setting notifies you when programs try to make changes to your computer, but you can control how often you are notified by UAC by adjusting the settings.The following table provides a description of the UAC settings and the potential impact of each setting to the security of your computer.","Start button (bottom left)Control PanelUser AccountsUser AccountsThere you will see your user account.  What does it say under the icon?  Standard user or AdministratorAlso, was this computer previously used in an enterprise?","You right clicked on \"Properties\" rather than \"Printer properties.\"  These are two different things.  You'll find the \"Print Test Page\" button on the \"Printer properties\" screen.Please either post a screenshot of Devices and Printers without any other windows covering up things or report which printer icon (if any) in the \"Printers and Faxes\" section shows a green circle with a white check:","it says administrator the computer has only been used by me thank you for replying Patricia ","I use the Dymo labeller that has an image on it and the printer has an image on it but no tick ","Is the HP DJ 5200 connected to your computer by USB or wi-fi?Is the DYMO labeler connected to  your computer by USB or wi-fi?Both the DYMO labeler and the HP DJ 5200 are indicated as \"shared\" printers.  Do you have one or more additional computers connected to your local network?  And if so, are either or both of the labeler and printer physically connected to some computer other than the one that has the problem?Right-click on the icon for the HP DJ 5200 and select \"Set as default printer.\"  What happens?  If you get an error, please provide the complete text of the error message.Right-click on the icon for the HP DJ 5200 and select \"Printer properties\" (NOT \"Properties\").  You should see the \"Print Test Page\" button on the \"General\" tab.  What happens when you click \"Print Test Page\"?"]},{"symptom":"Security warning, some content is blocked when opening one of my rtf files        When I open one of my rtf files a popup displays:Security warning, some content is blockedSome content of this document has been blocked because the source of this document might not be trusted...I did a search on this & tried a number of things but can't get rid of this popup. The file is a file of my creation that I use all the time & this popup just started a few days ago. Any ideas on how to get rid of it or why it suddenly started doing this.","solutions":["Hi George, Microsoft released an emergency security alert noting a vulnerability in Microsoft Word that would allow hackers to take over users' computers.Their way in: RTF files, a widely used word-processing format. It can even affect users when the files are seen in preview mode, such as through Microsoft Outlook.Regardless that you know this files, these protocols had been applied already to prevent further damages for all customers.To further clarify this concern, please check this article: https:\/\/www.scpr.org\/news\/2014\/03\/25\/43036\/micr...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","My rtf file was of my own creation & I've been using & adding to it for many years. I had inserted an image into the file & that's when I started receiving the security warning. When I removed the image the popup went away."]},{"symptom":"popups        how to discontinue continuous popups","solutions":["Hi David,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Can you tell us the nature of popups - some unwanted websites open or something else?Assuming they are malicious, execute the guide:https:\/\/malwaretips.com\/blogs\/remove-adware-pop...Disclaimer:This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","What kind of pop ups? Ads?A good ad blocker definitely helps..Tracking blockers are great as well.Personally I use uBlock Origin and Ghostery browser extensions\/add-ons.Also go through your browser's settings and adjust them to your wishes. For example, block 3rd party cookies etc.In addition I suggest reading:How to tighten security and increase privacy on your browser - Malwarebytes Labs | Malwarebytes Labs and Answers to common security questions - Best Practices which includes Resources to protect your browser, privacy & help prevent browser pop-up ads and scamsIf needed:  How to Remove Adware from a PCHope this helps."]},{"symptom":"Program closes when inserting graphics from file in Print Artist 25        I see that many people have the same problem with this issue as I do. For whatever reason, when I connect my digital camera to my computer and turn it on and it is recognized by my computer Print Artist will all of a sudden allow graphics from file. Not sure why but this may help some figure it out or at least use graphics from file in PA25.","solutions":[]},{"symptom":"Can't get rid of S mode on HP notebook        I am not sure I am explaining this correctly however I recently bought an HP notebook and am trying to turn of the S mode so I can use other programs.  It initially removed the S mode so I can add Mcaffee however every time I try to open a document, or add something from outside the Microsoft store it says I need to disable S mode.  I followed the instructions and every time it say there is a problem on this end.  Is it a Microsoft issue or a PC issue?","solutions":["HI Amanda. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Did you follow this procedure to Switch out of S mode: https:\/\/support.microsoft.com\/en-us\/help\/445606... ?If so and it still is in S mode contact Microsoft Support by one of these phone numbers:https:\/\/support.microsoft.com\/en-us\/help\/405170...You can also go here: https:\/\/partner.support.services.microsoft.com\/... choose the link for Browser help, interact briefly about your exact problem, keep replying agent until it connects with an agent.I would NOT install McAfee which is one of the worst things you can install on Windows. I would use built-in Defender which gives adequate protection, best Windows performance, least issues, and is from Microsoft who knows how to protect their OS best.If you want the best on-demand scanner install and run Malwarebytes free scanner.https:\/\/www.malwarebytes.com\/mwb-download\/. You can turn off the free trial in Account Settings to keep it only as a free scanner.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","FWIW:Microsoft created Windows 10 S mode for a reason: Security....> Windows 10 in S mode FAQ - Windows Help If you want to switch out of it: Since some weeks many users are not able to switch out of S mode. Seems that there are some problems on the Microsoft's servers side..Users are advised to try again in a few days or even weeks.... === In case you decide (and have been successful in) switching out of S mode: Windows 10 comes with in-built AV Windows Defender.Whether you want to use Windows Defender or want to install another AV: that depends on your own preferences and habits.No matter which AV you want to use, there might be situations in which you want to use other Anti-Malware programs for occasional, on-demand scans.Suggestion to read:Choosing an Anti-Virus ProgramSafe Steps for Replacing your Anti-virus - Why should you use Antivirus software?Supplementing your Anti-Virus Program with Anti-Malware Tools"]},{"symptom":"I am not able to sign onto AOLMail.        I have tried to sign in using both the aol.com site and aolmail.com.  I am getting this address in the email address bar when I try\"https:\/\/guce.aol.com\/consent?brandType=nonEu&gcrumb=X0AIZOU&lang=en-US&done=https%3A%2F%2Fwww.aol.com%2Fand then get a page that says:  \"Can't reach the page\" .  Then it says to search for \"https\/\/guce .advertising on bing.I have been trying to solve this for four days.  Please help!","solutions":["Hi Brenda. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Guce Advertising is used by AOL to display their ads. There is more about it here:https:\/\/aol.uservoice.com\/forums\/912886-aol-mai...To avoid it I would read NOT open AOL in a browser where the ads can propagate, but instead open AOL mail in the WIndows 10 Mail app which is an easier way to access your mail with a huge inbox that lets you merge all of your Office and Web Mail accounts, and an even larger ad-free reading pane. See here how to get started: https:\/\/www.windowscentral.com\/how-get-started-... In addition Download, install and run a full scan with the most powerful on-demand free scanner Malwarebytes:https:\/\/www.malwarebytes.com\/mwb-download\/.In the Scan Settings first set it to include scanning for Rootkits. If necessary run it in Safe Mode with Networking, or Safe Mode accessed by one of these methods:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... Clean up anything found, restart PC and then run again until it comes up clean. Check for any remainders in Settings > Apps > Apps & Features, and also in each of your browser's Extensions, Home Page settings, Search service or Add-On's as shown here:https:\/\/community.box.com\/t5\/How-to-Guides-for-... Then check for damaged System Files: https:\/\/www.lifewire.com\/how-to-use-sfc-scannow... If it cannot repair them see Step 10 here to continue: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If you want to keep Malwarebytes as an on-demand scanner then you can turn off its Real Time trial version in it's Settings > Account Details tab.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Try this:Edge directs to: https:\/\/guce.advertising.com for AOL Mail (Ron Baker o_0 Replied on December 22, 2019) "]},{"symptom":"snip & sketch        Any advice on how to save a screen shot is appreciated. Key logging protection software blocks use of the print screen key on my computer. Snip & Sketch does not have provisions for saving the selected portion of the screen by any other means than the print screen function. The old snipping program worked with the protection software. Please add this capability to Snip & Sketch or provide some means for me to produce a screen save picture.","solutions":["I have no SAVE option on my snipping tool","Hi CJ_571 when you use snip and sketch, the snip will appear in the action centre (winkey+A)you can draw on it, highlight items and save it by clicking on the floppy disk icon in the top right corner.","It is blank, no image. ","strange, is the saved file blank or is it not taking a snip? if the saved file is blank, try saving in a different format. if it is not taking a snip, try selecting a larger piece of the screen. Windows 10 Tip: Snip & Sketch https:\/\/blogs.windows.com\/windowsexperience\/201...","The file is blank. All three alternatives for formats yield a blank file. I am using datamask  program for key logger protection. It seems to be blocking the save.  I am concerned that MS will remove the original snipping program, which is working, and leave me without that function.","not much of a solution but you could paste the snip into paint then save it.microsoft have stopped development of the snipping tool, in favour of snip & sketch but i have not seen any mention of when it will be removed.have you tried turning off the \"prevent screen capture\" in datamask options? https:\/\/help.aol.com\/articles\/using-datamask-by..."]},{"symptom":"Bluetooth not working - error code 45        Hi there, I have this issue with bluetooth. It has always been working fine, more or less: it was only hard to turn on every time i needed it, but it worked.Until last week (I guess), it stopped showing. At all. Today I went searching all over internet for some help, but nothing worked. I tried installing drivers from the Acer site (I have an acer travelmate). The driver can't install because something is not updated.So I tried to check on windows update but everything is updated...Then I went to device management and I saw that there wasn't any bluetooth voice. I had to click on Show hidden devices to see all the bluetooth entries...I realised I had the Generic bluetooth adapter, and if I right click on it there's no update voice, it will only let me uninstall it.Since i'm not an expert, i didn't uninstall it. I went to proprieties and I saw this 45 error code: the hardware device is not connected.Since the bluetooth hardware is all inside, i don't thing it is possible for it to disconnect in any kind of way. I haven't even dropped my PC lately because it is always in the same exact place, on my desk...I'm getting a bit desperate. I just bought airpods and its annoying me a loooot because i can't use them hahaha.Anyway I'll be truly grateful to anyone who will help me. [side note: sorry if my english is not perfect. I hope everyone understood the general concept]","solutions":["Hi, Gaia My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Check this link, I hope it helps https:\/\/www.thewindowsclub.com\/hardware-device-...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi,Thank you for your answer. But the fact is that it didn't help sadly. The site tells to search for a troubleshooting page inside settings - and I can't find it. It shows a lot of other troubleshooting utilities, but not the one requested.If someone knows another way to access that page\/solve my problem, thanks in advance","Hi Gaia, thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.I'll need some details before I can do more research on your issue. 1. Exact Model of your Acer Travelmate (i.e P2, X5 or B1 and so on). 2. Windows Edition and Version. You can find this by following the steps in this article:https:\/\/support.microsoft.com\/help\/13443\/"]}]}