{"windows":[{"symptom":"My program cannot launch after upgrade to Windows 10 1909        My program works well on any windows before Windows 10 1909.after I upgrade to 1909, on a Windows 10 Pro Acer PC, my program works well. But on two Acer Window 10 Home edition , my program cannot launch.Can anybody give some advice?thanks","solutions":["You need to post more details, e.g.The name of the problem programYear of releaseWhat happens when you try to launch it","Hello DW-695, I'm Didi, an independent advisor. Please give us the name of the program you try to launch and tell us what happens exactly when you try to launch it : does anything appear on screen ?Do you see any error ? Regards, Didi"]},{"symptom":"Recently been getting a repeated BSOD and wasn't sure where to post dmps        As the title says, I've been havign issues with the IRQL_NOT_LESS_OR_EQUAL BSOD as of late, it only started popping up when i got my Oculus Rift S and I'm not sure if it's the cause as I have uninstalled and reinstalled the drivers a couple times so yeah, any help is appreciated Logs and specs here https:\/\/drive.google.com\/open?id=1Kv6jBWIR_UqxBuf-XXVxFq-IbpcFOvCD","solutions":["Still, the same. Please boot into Safe mode and rename the cpuz148_x64.sys in C:\/Windows\/System32\/drivers folder to cpuz148_x64.sys.bak. If the file isn't present let us know.Detailed steps: https:\/\/www.tenforums.com\/tutorials\/2304-boot-i...Please let us know if you need any assistance. Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes. Technical Information: *** WARNING: Unable to verify timestamp for cpuz148_x64.sys"]},{"symptom":"Microsoft Office Disappeared after last Windows 10 update happened        After the last Windows 10 update the Microsoft Office Word\/Excel\/PowerPoint 2016 program has disappeared from my computer. The 2010 version is still there but not the 2016. Why","solutions":["Did that and thank you.","My Office suite disappeared after doing Windows 10 update yesterday.  I went to the link you gave - office.co\/myaccount - and it changed to say it was account.live.com.  I logged in, & there is no button to click on that says \"Install Office\".  Where else can I go to reinstall Office?","You never answered the question. Why did it disappear in the first place?","The exact same thing happened to me. Entire 2016 Office Suite including Outlook all gone, shortcuts give corrupted file messages, or file not found. What the hell are Microsoft doing with INSTALLED software on my machine in use for 3 years without issue? Do I have to re-load the whole lot? And why are Windows updates so huge that they fill up you drive with cummulative updates to such an extent there is no space for any major updates. What's going on? We don't all have endlessly expansive C drives!","When I tried to sign in I got this message \"That Microsoft account doesn't exist. Enter a different account or get a new one\" When I clicked \"get a new one\" I got this message \"t looks like there's already an account with MY CORRECT EMAIL ADDRESS . If it's you, go back and sign in. Otherwise, choose another username.How do I sign in? I need the reinstall because the office suite is missing from my computer","Correction: THIS link looks promising:https:\/\/www.office.com\/login?ru=%2f&es=bing-ia","There is no \"Install Office\" link in office.com\/myaccount.","Opps Hope this Helps https:\/\/support.office.com\/en-us\/article\/can-t-find-office-applications-in-windows-10-windows-8-or-windows-7-907ce545-6ae8-459b-8d9d-de6764a635d6Hm","only  bought office suite from Microsoft site, then only available in  below sitewww.office.com\/myaccount .go Go to below site,https:\/\/setup.office.com\/?ms.officeurl=setuplogin with Microsoft account, click next, enter the product keyChoose country,choose your languageclick nextdownload setup file , save  to a local diskdisable antivirus softwarerun setup.exe with admin right","Last November I purchased a copy of Microsoft Office for my computer. I've been using it happily ever since. On April 6th, the program appears to have been replaced by an online version that I cannot access and don't want. I can still access the programs I created shortcuts for, but, unfortunately I didn't create shortcuts for every program I use. So where did my software go and how do I get it back???? I absolutely do NOT want to use 365 or another online version!!"]},{"symptom":"keyboard not working on some windows 10 applications        i recently bought a new monitor so i can have duel monitors for my computer to make streaming easier. ever since then on some applications on my pc the keyboard wont work. on minecraft my mouse works fine, but my keyboard doesnt work at all. and on netflix i cant search in the search bar, i cant type in cortana. is there a reason for that?","solutions":["Hi! deathsk8er I'm Marvin an Independent Advisor, and I will help you with your issue. Try with this. 1. Press Win + R 2. Paste and press enter to run this program. C:\\Windows\\system32\\ctfmon.exe Also, you can try this. 1. Press Win+R 2. Enter this taskschd.msc 3. Go to Task Scheduler Library > Microsoft > Windows > TextServicesFramework. Right-click MsCtfMonitor and choose Enable. Reboot your PC.If you still having problems with this, I will be around to help you. Regards. Source https:\/\/superuser.com\/questions\/1125367\/keyboar... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","You saved my life. C:\\Windows\\system32\\ctfmon.exe is worked for me. Thanks alot."]},{"symptom":"WIndows 10 wont update, add user or login to Microsoft account locally.        It started with updating Windows 10 1903.  Would get to the end of installation and restart with unable to install.  No error codes.  Then progressed to login to Microsoft account the screen would flash and never load.  Also unable to add users, same problem.  Seems to be a problem with the group policy or account corruption.  Any ideas?","solutions":["Hi, DSmithinatl My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.If you have problems updating Windows, follow these steps: If you have a third-party antivirus, you must disable or uninstall it. Try reset Windows update components: Right click on the start button and select Powershell (admin) or Command Prompt (admin)Write the next hit enter after each line. net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Restart and try again. You can also download the Windows Error Solver: https:\/\/support.microsoft.com\/en-us\/help\/10164\/...https:\/\/aka.ms\/wudiag You can do it manually by downloading the Windows ISO. When updating with the ISO, disconnect the Internet. https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/answers.microsoft.com\/en-us\/windows\/for...","Hi Jeffery, Thanks for the reply.  I tried all of your recommendations to no avail.  I believe there is some file corruption  involved but not due to any virus or attack.  I've eliminated those possibilities.  For instance, I can't even open a cmd window with a right click on the windows start.  Nothing comes up.  The inability to load an update is secondary to some other issues.  For instance, when I try and add a user, the popup window to create one disappears.  Same if I try and log in to my Microsoft account in settings\/accounts\/your info.  Ditto with logging into Microsoft account in the Microsoft Store.I've run the microsoftaccounts.dagcab, Windows Update Asst., wu10.diagcab, all of the troubleshooters and no luck.Thanks for your help.David","I recommend you look for another computer to create a USB and repair Windowshttps:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Unable to boot into a dual boot windows        It was working, but when I changed the size of one of the partitions and one of the partitioned is now unbootable after the size chnaged, then I can get access to the partition files but can't boot into it.","solutions":[]},{"symptom":"How to obtain and install Windows 7 SP2        Since the release of Windows 7 back in 2009, hundreds of updates have been issued for the aging OS, and anyone who has done a clean install of Windows 7 knows how painful the updating process can be.Officially, Microsoft only released a single service pack for Windows 7 - Service Pack 1 was released to the public on February 22, 2011. However, despite promising that Windows 7 would only have one service pack, Microsoft decided to release a \"convenience rollup\" for Windows 7 in May 2016. This single package combines all previously released updates from the release of SP1 to April 2016. So even though Microsoft isn't calling this a service pack, for all intents and purposes, it serves as one.This article will show you how to install the convenience update (SP2 for Windows 7). Note: System Administrators can use DISM to integrate this package into their installation media to simplify future Windows 7 installations.1. PrerequistesBefore installing the convenience update, make sure:You are running Windows 7 SP1You have at least 5 GB of free space available on your system diskYou have installed KB3020369 (download links below)KB3020369 for x64 systemsKB3020369 for x32 systems2. DownloadOnce the prerequisites are met, you can download the convenience update from the links below.Update for x64 systems (477 MB)Update for x32 systems (316 MB)3. InstallWhen the download has finished, double-click the file, and follow the on-screen instructions. This is a large update, so the searching and installation process may take a while. Please be patient.Note: Remember, since Microsoft isn't calling this update a service pack, the version number listed in System Properties will remain Windows 7 SP1.4. Install other Windows UpdatesThe convenience rollup only contains the updates released after Service Pack 1 and before April 2016. Any updates for Windows 7 that Microsoft has released since then will not be installed, so you should run Windows Update to install any other available updates.Also, the convenience update does not include Internet Explorer 11 or the latest .NET Framework Updates. You should install those packages manually or from Windows Update if you need them. Happy Patching!Related ArticlesFix: Windows 7 Update stuck on \"Checking for updates\"","solutions":["Ensure is that you are using the latest edition of Internet Explorer which for win 7 is now ie11.","Good. I added this to the article. ","I have done a clean install of Windows 7 Pro SP1 (32bit), on a clean disk.WU fails to identify any update, regardless of how long it runs.After the 1st restart, WU shows 13 updates installed, evidently included on the install disk.WU reports that it has \"never\" checked nor updated. It doesn't report any error. Just runs on and on, getting nowhere.I have set WU to \"Download but let me decide what\/when to install\".  Never has downloaded anything.I downloaded:WindowsUpdateAgent-7.6-x86 to replace the original.  It did install itself. Makes no difference. Endlessly searches for updates.I've read all the advice about how to obtain the Update Rollup from the Microsoft Update Catalog, using IE.  I've separately updated to IE11. I've looked at the custom IE settings and found that they are already correctly set. When I try to obtain the Update Rollup, IE warns that the site wants to install a program.  I approve.  Seems to do that. Then when I proceed a message displays that that program will not run.  So I cannot obtain the Catalog item 3125574 that I need.Meanwhile I have downloaded these two updates as separately recommended, to prepare for the Rollup:Windows6.1-KB947821-v34-x86Windows6.1-KB3020369-x86Neither one will install.  Each searches endlessly for \"Updates installed on this machine.\"  Never finish searching, never find anything, no errors, no installation.Pretty much a complete failure.Any advice?Thanks.","About how long should it take after launching the KB3125574 MSU before Windows Update starts telling me it's being processed? I have applied KB3020369 successfully, but when I launch KB3125574, Windows Update just says \"Searching for updates on this computer\" and the progress bar never moves. Is there something else I forgot to do?Thanks in advance.","About how long should it take after launching the KB3125574 MSU before Windows Update starts telling me it's being processed? I have applied KB3020369 successfully, but when I launch KB3125574, Windows Update just says \"Searching for updates on this computer\" and the progress bar never moves. Is there something else I forgot to do?Thanks in advance.The installer can sometimes take up to 30 minutes to begin processing the update, but no more than that.Watch the progress bar very closely and you can see it moving; if you're using an Aero glass theme, progress bars look very faint.If you're sure that it's stuck, post back and we can work from there.","What's going on with the Microsoft Download Center servers today, August 25, 2016?Every download I try to click on returns a page with the message, \"We are sorry, the page you requested cannot be found.\"","What's going on with the Microsoft Download Center servers today, August 25, 2016?Every download I try to click on returns a page with the message, \"We are sorry, the page you requested cannot be found.\"Microsoft websites are notoriously unreliable, however, it's working just fine for me. Maybe try after a couple hours?","What's going on with the Microsoft Download Center servers today, August 25, 2016?Every download I try to click on returns a page with the message, \"We are sorry, the page you requested cannot be found.\"Microsoft websites are notoriously unreliable, however, it's working just fine for me. Maybe try after a couple hours?Yep, waited an hour or so, and it's working again.","Same prolem. NOTHING WORKS! And to think that only a year ago it still worked :(Windows 7 is dying and we all know it. RIP Windows 7 :(Also, the addon required for the update center int working. It keeps saying \"An Add-on for this site has failed.\"","The active x won't install. I have the latest version of IE11 but when I click yes to allow the install to happen it comes back with the message that it failed to run. I have been trying to get this computer updated for 5 days now and have even tried reinstalling Win7 Pro for a second time but the searching for updates window just stays there and never finds updates. The customer who this computer is for is getting very frustrated obviously. ****!!! is going on?"]},{"symptom":"Cannot run powercfg \/batteryreport. Error 0x408        Hi,Windows 10 x64 1903I cannot run powercfg \/batteryreport from an elevated command prompt. The error:\"C:\\WINDOWS\\system32>powercfg \/batteryreportUnable to perform operation.  An unexpected error (0x408) has occurred:  (null)\"Diagnostic Policy Service is running.Power service is running.Ran:\"DISM \/Online \/Cleanup-Image \/CheckHealthDISM \/Online \/Cleanup-Image \/ScanHealthDISM \/Online \/Cleanup-Image \/RestoreHealth\"To no avail. Ran:\"sfc \/scannow\"To no avail.Tried running \"powercfg \/batteryreport\" command from another admin profile, to no avail.\"Powercfg \/?\" returns the list of commands. Some commands produce the same error, others do not.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Pleas reset the Battery Drivers from Device Manager and try again. Go to Device Manager Locate and expand \"Batteries\" Right click on each Battery driver and select Uninstall. Restart the PC. Run the Battery report command","Hi,Thanks for your reply. This also did not have an effect."]},{"symptom":"one drive        i have two different companies that i bought two office 365 subscriptions for and would like to use one drive for each company and have them separately on my Surface pro 7","solutions":["Hi Sam Thanks for participating in Microsoft Community, I'm Skypper G. I'm Independent advisor, let me help you with thisYou can achieve this only if you have two OneDrive for Business accounts. If you are using OneDrive Personal account you can sync only one, and this is by design.To get more info about how to set up your OneDrive Account on your Surface pro 7, please follow the link below:https:\/\/support.office.com\/en-us\/article\/sync-f...","so instead of office 365 for home, i need office 365 for business?","I don't understand why you needed to buy two separate copies of Office 365 just because you have two companies. A single copy of Office 365 can work with an unlimited number of companies.","If you have the Office 365 Home and want to use separate OneDrives then you will need to have two Microsoft accounts and you will need to create two user accounts on your PC.  Then you can sign out of one account and sign into the other account on your PC.  Each account will have it's own separate OneDrive.  But with file sharing you can have all the files from both Microsoft accounts on a single OneDrive.  So you don't need to create two user accounts on your PC. With Office 365 Home you can have 6 accounts within your family, 1TB cloud storage for each account for a total of 6TB.","If you have the Office 365 Home and want to use separate OneDrives then create two accounts.  Sign out of one account and sign into the other account on your computer.  Each account will have it's own OneDrive.  But with file sharing you can have all the files from both account on a single OneDrive. i was just trying to get the extra terabyte of storage, which i may never consume, that was my train of thought ","Craig, yes your correct, just not sure how to do that","Great idea!  I'm thinking about creating my third account for myself.  But you don't need a separate OneDrive.  You just need separate Microsoft accounts.  I have 2TB of local OneDrive data on a single OneDrive due to file sharing.","The way I do it and my suggested method is:Create a second Microsoft account online.  Then go to that new secondary account and share an empty folder with full editing rights to your primary account.   Then while logged in on your primary account add that shared folder to your primary account's OneDrive.  Now anything that you put in that folder from either account really belongs to your new secondary account and only uses the secondary account's separate OneDrive quota.I only use a single OneDrive client on my PC.  Thanks to file sharing I have the files from both accounts in that OneDrive client.","Do you have Office 365 Home or Office 365 Personal?  If you want to expand beyond 1TB then you need the Office 365 Home or move up to a Business account.   Office 365 Personal only gives you 1TB of cloud storage. I hope you didn't buy two Office 365 Personal subscriptions.   "]},{"symptom":"windows 10 pro 64 bit address bar file explorer        hello there i updated to windows 10 pro November update and i saw that the thickness of the address bar and width increased as shown in image below how can i do to reduce the thickness and width of the address bar of the file explorer ?? \"note i cant jut go with the mouse pointer on the address bar and adjust it\"","solutions":["I believe this is behavior by design and you couldn't change it.You may try change screen resolution and that affects your entire screen.If you really looking for feature to manage the size, the share it as feedback onFeedback Hub app and also explain why you want to customize it?","Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.I'm not sure but I think it depends on the size of the font. To adjust this, right click on the desktop and select Display settings. Now under \"Change the size of text, apps ...\", you can adjust font size, but probably it will change for everything and not just the address bar.","the text size is in the smallest value 100% and the same thing ","I do not think we can change the size ... This is the default format. If you change your resolution or make it size, everything else changes too.","I don't think this is by design. I guess it is some kind of Tablet-Mode or scaling bug. My coworker has the same windows version, same pc, same monitor and his address bar is smaller like before the update.","I don't think this is by design. I guess it is some kind of Tablet-Mode or scaling bug. My coworker has the same windows version, same pc, same monitor and his address bar is smaller like before the update.Well, never mind. Just changed today.","Hi Sebastian,How did you fix this? I'm having the same issue!Thanks","Hello Robert Litvack,I actually didn't fix this problem. But all of my coworker are now slowing getting this thick address bar, after some windows updates. Now, I really think this is by design. I hope there is some registry setting or something to change this back to normal.","Hi Sebastian,Yes, it appears to be either by design or a bug. Seems like Microsoft is having issues with their latest update and File Explorer.Check out this article: https:\/\/www.forbes.com\/sites\/gordonkelly\/2020\/01\/05\/microsoft-windows-10-warning-file-explorer-crash-search-upgrade-windows-10\/Let's hope they come out with a fix \/ setting in the next update!"]},{"symptom":"WLAN service is stuck on task \"Starting\"        One of my laptops randomly just started having internet problems. (Won't show WI-FI list or connect to anything bla bla) From what I know it's WLAN, it's not up and I go in services and it's just on \"Starting\" I've restarted the laptop multiple times and disabled my anti-virus. Help please","solutions":["Hi FoxOfJulye Your best option is to go to the support page for your PC on the manufacturers website, then from there, download and install the Wireless device driver they recommend . . .If you have any difficult locating that support page, what is the Make and exact Model No. of your PC - that will be printed on a sticker on the bottom casing of your PC . . .","That didn't work sadly.","Hi FoxOfJulye and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.1. Press the Windows key, type in \"Run\" then press Enter key. 2. In \"Run\" dialog box copy-paste. ncpa.cpl 3. Select and right-click Wifi adapter then click \"Properties\". 4. In Wifi Properties click \"Configure\". 5. Go to \"Advanced\". 6. Click \"802.11a\/b\/g Wireless Mode. 7. On the right corner \"Value\" select \"6. Dual-Band 802.11.a\/b\/g. 8. Click Ok and Restart PC. I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","There isn't any option for 80.211 a\/b\/g sadly, also extra info: In the settings panel instead of WI-FI, there's a tab for \"Ethernet\".","Hi FoxOfJulye, Can you please attach a screenshot of the list of wireless mode and the value list?Please check the attached image below for your reference. Thank you","Oh nevermind, got it. Problem here is that it'll reset back to whatever it was on.","Hi FoxOfJulye, Have you already tried? If the problem persists we'll proceed to another troubleshooting method.Let me know how it goes. Thanks!"]},{"symptom":"Mensaje de error        Buen día manejo Windows, voy a instalar el programa Cype y no me deja me presenta un mensaje de error, el siguiente mensaje. Microsoft.VC80.OpenMP,language=\"&#x2a;\",processorArchitecture=\"&#x2a;\",publicKeyToken=\"1fc8b3b9a1e18e3b\",type=\"win32\",version=\"8.0.50727.762\".Espero pronta respuesta, gracias.","solutions":["Hola , mi nombre es Angelica, soy una asesora independiente y tratare de ayudarte el día de hoy.Lamento que tengas este inconveniente con tu aplicacion, pero juntos lograremos resolverlo.Para ello - Verifica que no tengas una version anterior de Cype en tu equipo. - Verifica que la version de Cype a instalar este acorde a la arquitectura de tu Sistema- Deshabilita el antivirus y prueba reinstalar. Espero que esta información te sea de utilidad. Quedo atenta a tu respuesta Saludos, espero que tengas un excelente día. Angelica."]},{"symptom":"Window 8.1 is corrupted can't install window 10 in dell inspiron 15 3000 series 3542 laptop        Hi,I am facing a problem in installing windows 10  after window 8.1 is crashed in my dell Inspiron laptop 15 3542.  I also formatted my hard drive and try to install the windows 10. The problem is \"window setup couldn't configure windows to run on this computer hardware\" after this my laptop gets shut down. I tried many ways but nothing work. ","solutions":["Hi, Have you tried the instructions on this Link? How to: Perform a Clean Install or Reinstall of Windows 10. Link: https:\/\/answers.microsoft.com\/en-us\/insider\/for...","Hi, Have you tried the instructions on this Link? How to: Perform a Clean Install or Reinstall of Windows 10. Link: https:\/\/answers.microsoft.com\/en-us\/insider\/for... YES, every time I tried to install, I followed the same steps as mentioned. The problem is when Laptop gets restart after window installation.","Hi NikhilTyagi1 I'll try to help you out. I think the issue comes from the BIOS of the computer. In order to run Windows 10, you need to activate the UEFI mode.It should, then, allow you to make a clean installation of Windows, using this tool here :https:\/\/www.microsoft.com\/en-us\/software-downlo...I hope this helps Regards","Hi Jay#222Thank you so much for your help.I tried to install windows 10 in UEFI mode. But unfortunately, the condition remained the same. I'm still getting the same message \"window setup couldn't configure windows to run on this computer hardware\".  "]},{"symptom":"Windows 10 Pro, activated suddenly deactivated        Hello, I have an issue where my Windows 10 Pro suddenly got deactivated yesterday night. Upgraded to Pro on 06 October 2019 until yesterday was fine, but at the night I noticed on the left bottom screen there is watermark about \"Activate Windows, Go to Settings to activate Windows\"I've tried troubleshoot and what I got is this And I still have the key, but also I got an error message like this :Then trying to type this on CMD : slmgr.vbs \/dlv , the result is the sameAgain, run Slui.exe --Error Code-- , no worksSo, any suggestion? Also, I've searched some info IF you suddenly get Windows deactivated probably Microsoft has an error with the Server causing the activated Windows to become deactivated.Thank you,","solutions":["Hi Muhammad Where did you purchase that Windows Pro upgrade licence, was that from Microsoft or some 3rd party retailer?Open the Settings App (gear icon on your Start Menu) Go to System - About What edition of Windows 10 is listed there,it is Home, Pro or Enterprise?","Hi Muhammad Where did you purchase that Windows Pro upgrade licence, was that from Microsoft or some 3rd party retailer?Open the Settings App (gear icon on your Start Menu) Go to System - About What edition of Windows 10 is listed there,it is Home, Pro or Enterprise? To be honest bought from 3rd Party Retailer. Well, it's Windows 10 Pro","Hi Muhammad Your best option will be to contact Microsoft Support and ask them to help you re-activate your Windows 10 Pro, they can check that Windows 10 Pro licence and also if this is caused by a fault in the activation server, they can also resolve that for you . . . Choose a local Phone Number: https:\/\/support.microsoft.com\/en-us\/help\/13948\/...","Unfortunately, I can't use my phone to contact Microsoft Support.  If I change my product key, will it work?  If i have to do that","Hi Muhammad Yes, certainly, if you change your product key, then Windows 10 Pro will self activate . . .","Okay, thank you for your answer and help. I'm still positive with Server causing the Windows 10 gets deactivated, because some information on the internet there is something like that."]},{"symptom":"multiple monitors        will Microsoft flight simulator 2020 support the use of multiple monitors","solutions":["Hi John, I'm an Independent Advisor here to help you out, If you mean being able to stretch the game over both monitors then yes Microsoft Flight Simulator 2020 will support this.Thanks, Nick","Hi John, I'm an Independent Advisor here to help you out, If you mean being able to stretch the game over both monitors then yes Microsoft Flight Simulator 2020 will support this.Thanks, Nick Will I be able to have one monitor display the panel , while another has an outside view or  windscreen view .  How many monitors will it support .  I am a real pilot so I would want to be able to look outside , while keeping an eye on my instruments , and have another showing my navigational equipment view for example "]},{"symptom":"Preview Pane in Windows Explorer        My preview pane in Windows Explorer is not displaying the preview of contents of Microsoft office documents such as Word, Excel or Power point. It however displays the contents of PDF and Jpeg documents. What can I do so that the Microsoft office documents would also be displayed in the preview pane?","solutions":[]},{"symptom":"Unable to enable speech recognition under any conditions.        Hey there everyone,I'm trying to install Voice Attack on my Lenovo Legion Y720 (Core i7-7700K \/ 16GB RAM \/ GTX 1060 6GB etc.), and one of the prerequisites to enabling the proper running of the program is that Windows Speech Recognition is up and running on my system beforehand.  To the best of my knowledge I have done everything in my power to get this service up and running, however my  system completely refuses to set the microphone up in the first place.I'm running Windows 10 Home (Build 18362.19h1_release.190318-1202), with all updates installed and Windows set to auto-update everything as it comes along, and to make sure I manually checked for updates prior to starting this post.My language and region settings are as follows:Country or Region: AustraliaRegional Format: English (Australia)Windows Display Language: English (Australia)Preferred Language: English (Australia)Speech Language: English (Australia)Option to recognise non-native accents to this language is on.When I then click on the Get Started button to commence set-up of the microphone I am immediately launched into the theSpeech application as it goes into trouble detection mode.  I am presented with the options to state that I am unable to hear Cortana (which is false, my headset and laptop speakers both output without issue), or to state that Cortana is unable to hear me (which is also false as both my headset and laptop microphone array are both in working condition).  This problem is persistent, even when I change all my regional and language settings over to English (United States) by way of troubleshooting this issue.Furthermore, when I launch into Speech Recognition via the Control Panel, I am advised that \"Windows Speech Recognition is not available for the current display language\".  Is there something unusually cryptic and\/or arcane that I have managed to trigger with all of this, or is there an as yet unresolved software glitch giving me grief?Many thanks in advance for assistance rendered.Doug","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand the difficulties, you are facing while enabling speech recognition in Windows 10. It’s very unusual that speech recognition is available for English Australia but still you are unable to configure. However, we would like you to perform these steps and let us know the end result.Press Windows + R key to launch Run command and type control panel, then click Ok.Change the category to large from the top right corner and select Speech Recognition.Click on Advanced Speech Options. Under Microphone click on Audio InputSelect the Playback tab and right click on the headset you use and selectSet as Default Device & Set as Default Communication Device.Now, select the Recording tab and right click on the headset you use and selectSet as Default Device & Set as Default Communication Device.Click Ok.Now, click on Configure Microphone under microphone and set the microphone.If in case you get any error, please provide us the screenshot. If the issue still persist, then try creating a new user account as this issue may be due to a profile corruption. Hence, in order to eliminate possibilities, we would suggest you to create a new user account and check. Follow the steps from the articleCreate a local user or administrator account in Windows 10 to create a new user account. We await your response. Aditya RoyMicrosoft Community – Moderator","If the issue still persist, then try creating a new user account as this issue may be due to a profile corruption. Hence, in order to eliminate possibilities, we would suggest you to create a new user account and check. Follow the steps from the articleCreate a local user or administrator account in Windows 10 to create a new user account.We await your response.Aditya RoyMicrosoft Community – ModeratorHey there Aditya,I tried both of the courses of actions you suggested.  Starting up Speech Recognition from within the Control Panel left me with the results as per my original post (see screen grab below):The notion of creating a brand new profile (with Administrator level access) was a new one, so I was eager to try it out and see were it got me.  A pictorial representation of the results are detailed below:The problem, even under the newly minted profile, persists.Any notion as to how to proceed from here?Regards,Doug","Hey there everyone,Does someone, anyone, have a possible solution to my issues with Speech Recognition?  I've done everything I can to try and fix this thing, and it's stubborn beyond all measure.Regards,Doug","Good morning everyone,An update about this issue, my son has a near identical model Lenovo Legion Y720 laptop to mine and I just confirmed that he has the same issues with respect to being unable to activate voice recognition on it.  Could this issue be a platform-related problem?Regards,Doug","Good afternoon everyone,I've just reformatted a Lenovo T530 laptop with Windows 10 (1903, with all available updates) and the problem with being unable to enable speech recognition from a fresh install is evident here as well.  Is there something inherent to the English (Australia) language options that is kicking speech recognition in the teeth, and if there is then how do I go about fixing it?Regards,Doug","Hi DougI have an HP desktop with Windows 10 and have the same problem as you with Speech Recognition.  It is a pity Aditya_Roy above did not follow-up this problem.  I'm in Australia and I cannot find a solution anywhere.Trevor","Hey there Trevor,Posting a solution provided to me by (IIRC) the Facebook group Gaming Dads:Set your language and region to the US, then enable speech recognition.  Once you've done that flip your language and region back to Australia and it should work.  If it doesn't, download the UK English language pack and try enabling speech recognition and then flipping back to Australian English.The trick is to get Speech Recognition enabled, and then after that you can switch it to whatever language you want.Hope this is as successful for you as it was for me,Doug"]},{"symptom":"I have a problem. I have uninstalled McAfee however McAfee Webadvisor refuses to be unistalled. Please advise. Thanks.        I have a problem. I have uninstalled McAfee however McAfee Webadvisor refuses to be unistalled. Please advise. Thanks.","solutions":["In case you haven't used the specific removal tool, please do so now:>  McAfee KB - How to remove McAfee products from a PC running Windows (TS101331)> McAfee Removal Tool - McAfee Uninstaller"]},{"symptom":"BUG: Start menu invalid item ms-resource:AppName\/Text        Thousands of people including me have this ms-resource:AppName\/Text item on the start menu since upgrading to win 10 version 1903.I have it on one laptop and not on the other, both updated via windows update.When you look into it more by creating a desktop shortcut to find out what it is, it mentions \"Microsoft.HolographicFirstRun\" in the detailsAre Microsoft working on fixing this? Yes I have reported it via feedback hub as have lots of others. There are tons of posts on here and the internet about it since the end of last year yet no fix from Microsoft as yet?People have posted scripts and workarounds but I am waiting for a proper Microsoft fix. Can someone tell me if they are working on it as it clearly has been reported numerous times so it is not like Microsoft aren't aware..My post on feedback hub for upvotes maybe if that is the only way they fix anything?:https:\/\/aka.ms\/AA5x9mbUPDATE: (still unfixed with new update)KB4512941 does NOT fix the ms-resource:AppName\/Text issue at all. Still have ms-resource:AppName\/Text as do others on other threads.2020 now and this is still not fixed in Win 10 1909Numerous reports here and on the feedback hub too","solutions":["Hi ukheather Greetings! I am Vijay, an Independent Advisor. Microsoft doesn't publish a roadmap for the features \/ fixes. So, it is not possible to say when. Only thing, I can tell that they are definitely working on this as it has been reported by many persons.","Thank you for the reply.So they are definitely working on it?","They keep on fixing issues received through Feedback hub and other sources. Question will always be about when.","But that isn't confirmation they are actually working on it, just that they do fix issues reported?","Hi Heather My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.Send me the short link to the report you sent in so I can vote on it and bring it to the attention of the engineers and get an update for you on the progress for a fix.It seems like a issue with the Start menu tile database might be broken. I saw it in mine recently, but it automatically was resolved.Here are steps to send me the short link:","Well mine has just me voting on it as I only posted it the other day but there are so many other posts about it on there too. No idea how many votes they need before Microsoft look seeing as this has been going on months and it hasn't been fixed.Mine:https:\/\/aka.ms\/AA5x9mbA couple of others from the many on there with the exact same issue:https:\/\/aka.ms\/AA5x9mfhttps:\/\/aka.ms\/AA5x1wqhttps:\/\/aka.ms\/AA5x1wthttps:\/\/aka.ms\/AA5x1wu","Thanks for your help Heather. In the mean time, keep trying the following. Option 1: Press Windows key + X Click Windows PowerShell (Admin). At the command prompt, type the following, hit Enter the restart. Type in at the prompt OR Copy and Paste these one at a time : (Hit enter after each)Get-appxpackage -all *shellexperience* -packagetype bundle |% {add-appxpackage -register -disabledevelopmentmode ($_.installlocation + “\\appxmetadata\\appxbundlemanifest.xml”)}Option 2: Press Windows key + X Click Task Manager Select the Processes tab Scroll down to Windows Explorer then select it Click Restart If that does not work: Option 3: uninstall your display driver: Press Windows key + X Click Device Manager Expand Display adapters Right click the current display adapter Click Uninstall Exit Device Manager Restart Option 4 1. Open Notepad. 2. Copy the following text into Notepad: @echo off taskkill \/f \/im explorer.exe taskkill \/f \/im shellexperiencehost.exe timeout \/t 3 \/NOBREAK > nul del %localappdata%\\Packages\\Microsoft.Windows.ShellExperienceHost_cw5n1h2txyewy\\TempState\\* \/qtimeout \/t 2 \/NOBREAK > nul start explorer @echo on 3. Click File and Save. 4. Choose a location to save the file. Enter a File name of ClearTileCache.bat and select Save as type of All files (*.*). Click Save.5. Open File Explorer and navigate to the location that you chose to save the file to. Double-click ClearTileCache.bat to run the file.","yeah as I said in the first post I do not want to do commands or work arounds, I would rather wait for them to fix it properly","Ok then, we will just have to wait. I will update you when I get feedback. Thanks for your patience and understanding.","As an update, KB4512941 does NOT fix the ms-resource:AppName\/Text issue at all. Still have ms-resource:AppName\/Text as do others on other threads."]},{"symptom":"Removing phone number from mircosoft aaccount ....because i no longer have any phone at all.        Remove phone number from my Microsoft account because i don't. Havany phone at all ","solutions":["Hi hippilessrich Log into your Microsoft Account: https:\/\/go.microsoft.com\/fwlink\/?LinkId=529489 Select Your info, and then select Manage how you sign in to Microsoft Make sure you have one verified option that you can continue to use, such as an Email AddressUnder the Account aliases section, select Remove next to the phone number you want to remove"]}]}