{"windows":[{"symptom":"Another win10 genuine check        Hello all!Situation: Personal computer. Had win 10 Home (key is in the bios). Bought Win 10 Pro from Amazon. Key upgraded me to win 10 Enterprise. Reason: need to run Docker at home.Issue: I don't really care if its Enterprise or Pro - Docker accepts both. However I got the \"Activate Windows\" alert at the bottom right corner of the laptop and I have the0xC004F025 error in Activation Tab -> Update and Security and I would like for my Windows to be activated.Disclaimer: I already sent an email to the seller about this issue because I didn't get what I paid for. However I need to work on a project asap.If this is an easy solution, I don't mind having Enterprise over Pro. If not, I'll go ask for a refund :) Attachment:","solutions":["Hi GlebD There is a known bug in the Home to Pro upgrade process, which causes Windows 10 to upgrade to the Enterprise editionThere is an easy fix for this, click the link below, then follow the steps provided by trusted MVP Sumit Dhiman and you will be reverted to a fully activated Windows 10 Pro in a minute . . .https:\/\/www.yourwindowsguide.com\/2019\/07\/fix-pu...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]},{"symptom":"New build, dx11 crashes in games and BSOD        Brand new parts, everything brand new.boots fine, stays on all night, passes several gpu benchmark tests with flying colors.just testing on FFxiv atm, plays great, randomly crashes with a common dx11 crash code, running in dx9 BSOD's my pc, and occasionally the dx11 one with BSOD. I have only 2 minidump files I have after running cmd> verifier. (I had to verifier \/reset in safe mode after BSODing a few times and only staying loaded into windows for at most a minute before BSOD)msinfo32 output is included in each 7zip file linked here: https:\/\/1drv.ms\/u\/s!Anzc3Bb-pau7imHjHnl6JT6EUUI-?e=VyQR38if any more info can help I will gladly give it.","solutions":["Hi MatthewDonaldson1 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.Have you recently update your NVIDIA graphic driver? try to rollback your NVIDIA graphic driver. let me know how it goes. Thank you! Details of BSOD: Unable to load image \\SystemRoot\\System32\\DriverStore\\FileRepository\\nv_dispi.inf_amd64_a3efb8aa9e9e249a\\nvlddmkm.sys, Win32 error 0n2*** WARNING: Unable to verify timestamp for nvlddmkm.sys nvlddmkm+0xaf0c45 Loaded symbol image file: nvlddmkm.sys Image path: \\SystemRoot\\System32\\DriverStore\\FileRepository\\nv_dispi.inf_amd64_a3efb8aa9e9e249a\\nvlddmkm.sysImage name: nvlddmkm.sys Browse all global symbols functions data Timestamp: Sat Dec 7 09:28:35 2019 (5DEB0043) CheckSum: 01634AED ImageSize: 01691000 Translations: 0000.04b0 0000.04e4 0409.04b0 0409.04e4 Information from resource tables: DEFAULT_BUCKET_ID: FAIL_FAST_CORRUPT_LIST_ENTRY ERROR_CODE: (NTSTATUS) 0xc0000409 - The system detected an overrun of a stack-based buffer in this application. This overrun could potentially allow a malicious user to gain control of this application.EXCEPTION_CODE: (NTSTATUS) 0xc0000409 - The system detected an overrun of a stack-based buffer in this application. This overrun could potentially allow a malicious user to gain control of this application.EXCEPTION_CODE_STR: c0000409 EXCEPTION_PARAMETER1: 0000000000000003 ANALYSIS_SESSION_HOST: LAPTOP-B1I5QV70 ANALYSIS_SESSION_TIME: 01-04-2020 17:10:18.0728 ANALYSIS_VERSION: 10.0.18362.1 amd64fre DPC_STACK_BASE: FFFFFE8EC5A76FB0 LAST_CONTROL_TRANSFER: from fffff802053d30e9 to fffff802053c1220","It was a fresh driver install from a fresh install of windows. I download DDU to uninstall the drivers and reinstalled a fresh downloaded one from the nvidia website directly and these are the errors I'm getting.I am currently attempting to install an older driver to see if it's something with the new ones that's causing the issue.","441.66: crash440.97: crash436.48: crashincrease power limit in msi afterburner by 3%: BSODdecrease power limit, core clock, memory clock (each individually): no change, still crashes.","Hi MatthewDonaldson1, May I know how many hard drives you are using? is there SSD in your system? Where did you install the OS? Thanks!","2 m.2 drives.1 drive is currently partitioned the other drive is installed but i am not using it yet until i get everything figured out. Both m.2 installed directly on the mobo. OS is installed on the main m.2 I have an external hdd plugged in but i was crashing before it was plugged in.","Hi MatthewDonaldson1, Set 1 SSD on your PC, clean install Windows again. Return other drives after a successful installation. Let me know how it goes. Thank you!","If I may ask, what would having an unformatted drive in the system do? I don't see how that could cause driver issues since it doesn't even show up under my pc","Its quite the hassle to get the m.2 drives out of my system, i have to remove my capture card and graphics card from the pcie slots and a heat sink from the board. ","Hi MatthewDonaldson1, What I mean is try another 1 SSD in your system. Thanks!","Ah ok. I'll try that and get back to you when i get back home."]},{"symptom":"Game        I cont get my game to work I have windows ten my game is theme park inc and a nother game is there a way I can get them to work","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? What OS is recommended for the game? You can try running the game’s .exe file using compatibility mode, right click on the .exe & choose the compatibility tab, you can then choose to allow Windows to choose the mode which works or choose your own.If nothing works then the game is too old to run on Win 10.","How do I do that","Please login with administrator privileges and try again","Are you logged in as an administrator or are you using a local account?","I'm logged in as administrator bug when I try play 2 of my games it says this Please login with administrator privileges and try again I'm trying to play theme park inc and a nother game which is medal of honor allied assault war chest im running windows ten and the wont work","Have yo tried my suggestion? You can also try right clicking the game’s .exe & choose run as administrator.","I tryed that ","I wont to go back to windows 8.1 I dont like ten can you help with that","How long is it since you upgraded? If it’s within 30 days then you can easily return using the setting under recovery.If over 30 days then the only way to return to Win 8.1 is to save all your personal files, gather all your program’s installer files & clean install Windows 8.1.","Do you require any further help?"]},{"symptom":"Windows 10 will NOT update         It always says \"We couldn't complete the updates, undoing the changes.\"I've done a multitude of things such as: net stop wuauserv net stop bits, etc, etc.I've even tried reset my PC but it won't let me either.I'm at a loss on what to do at this point. I am worried because there seems to be a huge population of people that have experienced this and found no solutions to it.Really regretting purchasing windows  :\\","solutions":["Hi, Situpc My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.If you have problems updating Windows, follow these steps: If you have a third-party antivirus, you must disable or uninstall it. You can also download the Windows Error Solver: https:\/\/support.microsoft.com\/en-us\/help\/10164\/...https:\/\/aka.ms\/wudiag You can do it manually by downloading the Windows ISO. When updating with the ISO, disconnect the Internet. https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/answers.microsoft.com\/en-us\/windows\/for...","When I tried opening the \"windows update troubleshooter\", I get an error that prevents it from running.Error code: 0x80070003","Try updating manually by downloading the Windows 10 ISO"," It always says \"We couldn't complete the updates, undoing the changes.\"I've done a multitude of things such as: net stop wuauserv net stop bits, etc, etc.I've even tried reset my PC but it won't let me either.I'm at a loss on what to do at this point. I am worried because there seems to be a huge population of people that have experienced this and found no solutions to it.Really regretting purchasing windows  :\\Hello,What is the current Windows 10 version you're running?Regards."]},{"symptom":"Your Virus & threat protection is managed by our organization.        Hi,I'm facing issue with windows security in windows 10. In virus & threat protection showing that your Virus & threat protection is managed by our organization. pls help how to clear it. I tried with registry Editor but after the reboot again same issue.","solutions":["Hi Arun, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.First of all, have you checked your device for malware? If the reboot did not solve it likely a malware is involved.Please use an offline scanner like Sysrescue. https:\/\/www.eset.com\/in\/support\/sysrescue\/Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","type “cmd” in the search box; right-click on Command Prompt, and select Run as administrator; and then copy, paste, and enter this command: REG DELETE \"HKLM\\SOFTWARE\\Policies\\Microsoft\\Windows Defender\" \/v DisableAntiSpyware Now restart the computer and verify. ","Hi,I'm facing issue with windows security in windows 10. In virus & threat protection showing that your Virus & threat protection is managed by our organization. pls help how to clear it. I tried with registry Editor but after the reboot again same issue.Hello, Open Group Policy snap-in by running gpedit.msc command. Go to Computer Configuration > Administrative Templates > Windows Defender Security Center > Virus and threat protection. Set 'Hide the Virus and threat protection area' setting to Not Configured. Also refer this fix: https:\/\/www.kapilarya.com\/fix-your-virus-threat-protection-is-managed-by-your-organizationLet us know if this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP."]},{"symptom":"Using Windows 10        I am still unsure about using windows 10 after spending so much time on windows 7. Is there a trial version I can use.Thank you***Modified title from: Windows 10***","solutions":["Hi JuneChan, Thank you for writing to Microsoft Community Forums. I appreciate your interest in Windows. I understand that you are unsure about using Windows 10. I’ll help you all the details about Windows 10 that will help you in understanding Windows 10 more clearly. Windows 10 is the latest version of Windows released in 2015 it with features like,Cortana (Virtual assistance),Windows Hello,Microsoft Edge,Windows Security,Microsoft Tips and many more. Getting help in Windows 10 has become easier. There are few different ways to find help for Windows 10. Refer the article onHow to get help in Windows 10.  To know more about the features, I would suggest you to refer the article onWindows 10 Features. To know about the features in the recent update, refer What's new in recent Windows 10 updates.  We can install Windows 10 on the computer without activating it. However, you might not be able to use the full features of Windows in a non-activated version. You can download Windows 10 from https:\/\/www.microsoft.com\/en-in\/software-download\/windows10 and install it on a different partition. You may want to refer the steps mentioned in the article byAndre Da Costa https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-windows_install-winpc\/how-to-perform-a-custom-installation-of-windows\/38adfa8c-32f8-4354-8c53-13b5f2cf7e44. If prompted for a product key select the optionI do not have a product key. Note: Do not perform an Upgrade on the computer. Once you are comfortable in using Windows 10, you can purchase it from theMicrosoft Store.  Let us know if you need any further assistance, we will be glad to help you further. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"How do i connect my microsoft again to ny student accOUNT        I want all my files saved to my be on my student OneDrive.","solutions":["Hi Rent. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.If you want to change OneDrive accounts at any time, follow this tutorial to unlink your present OneDrive account:https:\/\/www.tenforums.com\/tutorials\/36246-link-... Then open OneDrive from the Start Menu and sign in again with your desired account.If you want to merge your personal OneDrive with your work or school Onedrive see here:https:\/\/support.office.com\/en-us\/article\/how-do...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I want all my files saved to my be on my student OneDrive. Hello,You can sign out from current account and sign in back with student account:https:\/\/www.kapilarya.com\/how-to-sign-out-from-onedrive-in-windows-10Hope this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP. "]},{"symptom":"Windows 10 Pro Keeps on Resetting        Windows 10 Pro OS keeps on resetting. Even though I have reinstalled the OS within a day itself it starts to reset everything. Even I tried disassembling my PC, formatted my hardisk completely, scanned my files for virus (not affected any files using Anti-virus software Provider) but the problem is still encountered. Earlier I addressed the same issue with Microsoft and they provided certain ways to address the issue that didn't worked well and it started again. I am really frustrated with Windows 10 OS.Kinda annoying OS after Windows 8.1Even I tried Windows 10 Enterprise Evaluation. After installing the OS it was normal but very next the issue started just like in Windows 10 Pro I dont whether to curse myself or OS. In whatever way I've tried the problem doesn't seems to solve.","solutions":["Hi Adithya. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.When you say it's trying to Reset, is it an actual Reset which reinstalls Windows like in this tutorial:https:\/\/www.zdnet.com\/article\/windows-10-tip-re... ? Please explain the difference if not.You said you reinstalled, including an Enterprise version which is legally only to be used by businesses which activate via a on-site server. How is this WIndows 10 activated?If you'll clarify exactly what type of \"Reset\" this is that it's doing, or trying to do, I'll be able to help you better. An OS cannot possibly start reinstalling itself on it's own.Waiting for your reply so we can continue. ______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Windows 10 Pro OS keeps on resetting. Even though I have reinstalled the OS within a day itself it starts to reset everything. Even I tried disassembling my PC, formatted my hardisk completely, scanned my files for virus (not affected any files using Anti-virus software Provider) but the problem is still encountered. Earlier I addressed the same issue with Microsoft and they provided certain ways to address the issue that didn't worked well and it started again. I am really frustrated with Windows 10 OS.Kinda annoying OS after Windows 8.1Even I tried Windows 10 Enterprise Evaluation. After installing the OS it was normal but very next the issue started just like in Windows 10 Pro I dont whether to curse myself or OS. In whatever way I've tried the problem doesn't seems to solve.Hello,What do you exactly mean by 'Windows 10 Pro OS keeps on resetting' ?What steps you tried already?Are you logged in to temporary profile?Regards."]},{"symptom":"Stop OneDrive sync        Hi, I have a laptop thats linked to onedrive and I synced it to my mobile ~ I'd like to unsync it. Anyone know how please?* Moved from Community Participation Center***Modified title from: Onedrive***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you want to stop syncing of OneDrive. I’ll help you with the details.  If you wish to stop syncing on your Windows PC, I would suggest you to refer the steps mentioned in the articleTurn off, disable, or uninstall OneDrive.  However, we do have dedicated support team for OneDrive and you can get in touch with them for further assistance. Follow the below steps to contact the OneDrive support team. Sign in to OneDrive.com from any browser or Open OneDrive App, click the ‘?’ help icon on the top banner of the page and selectEmail OneDrive support. Submit your question and follow the prompts to request support. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Remove Windows XP Embedded and install Windows 10        Hi sir\/ma'am,My name is Kuldeep and I bought an old pc which has windows xp embedded operating system. According to my needs I want to remove it and installWindows 10 operating system. I have bootable pen drive of windows 10. I don't know how to remove windows xp embedded  and also want to knowHow to install windows 10. Then please tell me about How to remove Windows XP embedded and how to install Windows 10 step by step.***Modified title from: About removing windows xp embedded and install windows 10.***","solutions":["Hi Kuldeep, Thank you for writing to Microsoft Community Forums. I appreciate your interest in Windows 10. I understand that you want to install Windows 10 on a computer running Windows XP Embedded. I’ll certainly help you with the issue. We would like to know the make and model of the computer that you are using. However, to ensure smooth running of Windows 10 we need to make sure that the computer is fully compatible. To check the compatibility, you can navigate to the computer manufacturer’s website and check if there are drivers available for Windows 10. You can also get in touch with the computer manufacturer and check for the available drivers. For more information, see Windows 10 system requirements.  We will also need a valid license for Windows 10 to activate it.  Since you want to remove Windows XP Embedded from the computer, we can perform a clean installation of Windows. Performing a clean installation, will remove all the data and applications from the computer, you will need to reinstall the applications. Note: It is strongly recommended to take a backup of data before performing a clean installation. To install Windows 10 on the computer, refer the Step-by-Step Guide by PaulSey… https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-windows_install\/how-to-clean-install-windows-10-on-a-pc-step-by\/854fd140-385f-452c-ad52-548f2acb0d0a Additional information: Moving to a Windows 10 PC.  Let us know if you need any further assistance, we will be glad to help you. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"copying a file when i'm not recognized as administrator        I'm trying to copy a configuration file from one drive to another.  I get the message that I don't have priveleges to copy even though I am the owner\/administrator on the computer.  What can I do to copy this file?","solutions":["Hi Douglas. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.If this is isolated to only a few files or folders, then you can try using the Take Ownership shortcut which is a handy tool to add to your right click mouse menu, but should never be used on the WIndows folder for Security reasons:https:\/\/www.askvg.com\/add-take-ownership-option... If you have lost Admin rights more broadly then try these steps leading up to if necessary testing a new Local Account which sometimes is the only way to escape Account Corruption in Windows 10:Right click Start button to open Run box, copy and paste in netplwiz, press Enter.Highlight your account, then click Properties, then Group Membership tab. click on Administrator, then Apply, OK, restart PC.If that doesn't help then try this: https:\/\/www.kapilarya.com\/fix-lost-administrati... If nothing helps try creating a new Local Admin Account to sign into to see if it works:http:\/\/www.howtogeek.com\/226540\/how-to-create-a... If you can't get the rights to do this then use whichever method works here to enable the hidden Built-in Administrator to be used only in emergencies:https:\/\/www.isumsoft.com\/it\/enable-hidden-admin...https:\/\/www.tenforums.com\/tutorials\/2969-enable...It may be necessary to create Windows 10 Installation Media on another PC to access the Command Prompt without needing a password:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... Choose the boot device as a UEFI device if offered. If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.After it loads, on second screen, choose Repair Your Computer, then Advanced Startup Options, first try System Restore to a point before this. If that fails then choose Command Prompt to follow the step above to access Built-in Admin Account.Sign into Built-in Admin account, see if you can use netplwiz now to elevate the account. If not try another of these methods:https:\/\/www.windowscentral.com\/how-change-user-... If not then set up a new Local Admin Account, sign into it, move your files over, set it up, hide the Hidden Admin Account, when ready delete the old account in Settings > Accounts > Family and Other Users.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it. See here for how to try to recover Admin rights:","I'm trying to copy a configuration file from one drive to another.  I get the message that I don't have priveleges to copy even though I am the owner\/administrator on the computer.  What can I do to copy this file?Hello,Can you please share the verbatim for the error message or its screenshot. Note if you're moving the Windows config file in root directory, such messages are expected.Regards."]},{"symptom":"Cortana keeps on crashing in Windows 10.        (Windows 10 1909)When I try to open Cortana it stops after 1 second and CPU Usage goes up to 100%.I recently upgraded to 1909 because my pc was old and some apps were not available.I have tried even to restart, switch languages, speech input\/output but no. Nothing works. I just need Cortana to work on Windows 10 1909 because it worked on Windows 1809. The only fault is that it said that this microphone is not designed to work with Cortana.","solutions":["Hi Mihai, Based on your concern, there's a lot of people experiencing this kind of issue as well.What I can suggest is to rollback the updates: https:\/\/lifehacker.com\/how-to-undo-and-prevent-...And disable your windows update for the mean time, please follow this link for detailed guide:https:\/\/www.cleverfiles.com\/howto\/disable-updat...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Hello,Try re-registering Cortana. Perform these steps:1. Open Windows PowerShell as administrator.2. Then type following command and press Enter key:Get-AppXPackage -Name Microsoft.Windows.Cortana | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Let the command complete.3. Close Windows PowerShell and see if the issue is resolved now.Reference: https:\/\/www.kapilarya.com\/how-to-reinstall-or-re-register-cortana-in-windows-10Let us know if this helps! Note: Included link in this reply refers to blog post by a trusted Microsoft MVP.","Thanks man.","Glad to help!"]},{"symptom":"Photos        I can't open my pictures. All I get is \"package could not be registered\". What?","solutions":["Considering all that we know about your pictures, the best help you'll find here is a lucky guess.I can tell you that all common picture formats - JPG, JPEG, PNG, TIFF - open without trouble on my copy of Windows 10.","Hi Tim Open the Settings App (gear icon on your Start Menu) Go to Apps and locate the Photos App in the list of installed applications Select that then choose Advanced Options - Reset Then check to see if your can open your pictures If not, right click your Start Button and choose Powershell (admin) Paste this command into Powershell and hit Enter: Get-AppxPackage Microsoft.Windows.Photos | Remove-AppxPackage Wait for that command to complete, then paste this command into Powershell and hit Enter:Get-AppxPackage -allusers Microsoft.Windows.Photos | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}When that completes, close Powershell and restart (not shut down) your PC . . .","There is something wrong with MSEdge browser. I changed to GChrome  browser and I could add my pictures to my Ebay listing. Thanks.Tim","Hi Tim, I am glad you were able to troubleshoot this, well done . . ."]},{"symptom":"black background and white text        brand new HP laptop trying to print on a Brother printer that works from my PC.  why is it printing a black background and white text from whatever application I print from?","solutions":["Hi Alicia. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.For Brother printer printing inverted text see this fix: https:\/\/help.brother-usa.com\/app\/answers\/detail...https:\/\/www.youtube.com\/watch?v=03CATYv-2rURather than spending too much more time fiddling I'd simply Clean Install the printer which always works, lasts longer and actually saves time:1) Power up the printer, if wired unplug it's USB cable from PC. 2) Go to Settings>Apps>Apps and Features to find and Uninstall any printer software.3) Use one of these methods to remove all of the old printer drivers: https:\/\/www.tenforums.com\/tutorials\/101274-unin...https:\/\/helpdeskgeek.com\/how-to\/remove-uninstal...4) Now type Control Panel in Start Search, open CP, choose Icon View. In Control Panel open Devices and Printers, right click printer to delete Printer and any scanner or fax of the same name. Restart PC.5) Go to the Brother Support Downloads webpage here https:\/\/www.brother-usa.com\/brother-support\/dri... to download and install the latest full software package. Now is also the time to check for any newer printer firmware to install which matters a lot.6) Extract Printer software, right click Setup file to Run as Administrator. Follow the setup screens closely as you install the software. For USB it should prompt when to plug in the printer.Older software may need to be installed in Compatibility Mode to run correctly: https:\/\/www.groovypost.com\/howto\/run-old-softwa... If you have further problems reply back with results of each step. Once it's installed and you've run a test print, then scanned it to see that it opens on the desktop, open the Printer software and go into its Settings to set the scan-to file location you prefer, also the email app you want opened for Scan to Email, if applicable.I hope this helps. Feel free to ask back any questions and let us know how it goes. If you will wait to rate my post until we are done, I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Upgrade to Windows 10        Can you still upgrade to Windows 10 or do you have to do a clean boot and reinstall apps","solutions":["You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700Cheers."]},{"symptom":".NET Framework 3.5 stuck on Downloading required files (Windows 10 1903)        I am unable to download .NET Framework 3.5 on my computer. The installer is taking forever on the downloading required filespage. I have tried all the possible methods, from running it manually from control panel to downloading the installer file from Microsoft site, nothing worked out.Also tried the Dism.exe \/online \/enable-feature \/featurename:NetFX3 \/source:C:\\ \/LimitAccess command, still nothing. I cant play Control which I just got due to .NET Framework 3.5. Would be glad if found a fix soon, Thanks in advance.","solutions":["Hi SounabMitra I am Vijay, an Independent Advisor. Refer to following help to install .Net 3.5 https:\/\/docs.microsoft.com\/en-us\/dotnet\/framewo...In case of error, refer to last section - Troubleshoot the installation of the .NET Framework 3.5Do let me know if you require any further help on this. Will be glad to help you.","Right click Start, click Apps & features, click on Programs and features in the upper right, click on Turn Windows features on or off,  there you will find if .Net Framework items are active.","Yes, I tried this earlier too and did now once again, but it's stuck on the searching for required files. Sometimes it finds the required files but gets stuck whiledownloading required files.","Yes, I have tried that. But it is still stuck on searching for required files.","Windows Key+X > Windows Powershell (Admin) Type following (or copy and paste following) Enter Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old Now copy the below line and paste into Powershell(Admin) and Enter Dism \/Online \/Cleanup-Image \/StartComponentCleanup Now, enable .NET 3.5. Source (reply of SFARPak) - https:\/\/answers.microsoft.com\/en-us\/windows\/for...","Wow, after performing as you said, it is stuck on please wait in Windows Feature ","I do not see that you clicked .NET Framework 3.5.","Put a glance on the main post, that is what comes all the time and gets in a loop when I click on .NET Framework and click OK.","Well I restarted the Computer and as I said, now it's stuck on downloading required files. And every time it gets stuck at this position. At this point it stops using resources from computer like Network.","Have you already followed this - https:\/\/www.kapilarya.com\/how-to-enable-net-fra... Disclaimer - This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Windows not updating, getting error 0x80240fff        Hi ! Yesterday i bought my new windows lisence, everything working good, bt my reccent window is old, and i want to update it, when i am trying to update , i am getting this error :  \"There were some problems installing updates, but we'll try again later. If you keep seeing this and want to search the web or contact support for information, this may help: (0x80240fff\"How to fix this, please help me !","solutions":["Hi VJ. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.If you have less than Version 1909 (check at Settings > System > About) then install the Media Creation Tool from this linkhttp:\/\/windows.microsoft.com\/en-us\/windows-10\/m... choosing Download Tool Now, install the tool, open it and choose Upgrade this PC Now. This will save your files and apps while bringing you up to the latest version by the most stable method. It will also bring all of your Updates current and solve most problems since it reinstalls Windows.Otherwise I'll give you everything possible for fixing failed Windows Updates, so that at least something will work before you work through them all. Even if you've tried a step, please do it over in sequence:Some Updates will sort themselves out in a few days so I'd wait to see. If not or they are bothering you then here are steps you can take:1) Run the Windows Update Troubleshooter from Windows Settings > Update & Security > Troubleshoot.2) There is a new guided walk-through from Microsoft for repairing Windows Update that leads up to resetting components if necessary:https:\/\/support.microsoft.com\/en-us\/help\/10164\/.... Try running that first. 3) If that fails try manually resetting Windows Update Service: Open administrative Command Prompt and type following commands one-by-one followed by Enter key.net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Close Command Prompt and see if Windows Updates works then 4) You can also install the Updates manually that fail to install, which are logged at Settings > Update & Security > Windows Update > Installed Update History, and then search for those to download and install from this Catalog:http:\/\/test.catalog.update.microsoft.com\/v7\/sit... 5) If they continue to fail and interfere, then you can block them using one of these methods:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... 6) If problems with Updates have become chronic and especially if you have other performance problems, go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 7) If nothing else works then do a Repair Install, by installing Media Creation Tool, open installed Tool and choose to Upgrade the PC Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version 1909. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... _____________________ Good news! There are major changes in Version 1903 giving back control over Updates to the consumer. Microsoft has heard us at the highest level who announced this here:https:\/\/blogs.windows.com\/windowsexperience\/201..._____________________ I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"problems with printer setup        After updating windows 10, my HP printer refuses to print from my PC. I have tried all recommended troubleshooting, but still get the message unable to print due to\" problem with printer setup\". The copier works on its own and the HP troubleshooter failed to find anything to fix except the spooler - whatever that is. I have restarted everything a few times. Any suggestions, please?","solutions":["Have you installed the printer using the software that came with the printer?Then go Settings, Devices, Printers & scanners, Add a printer.","Hi Jud1. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Guardian Moderator here to help you.Rather than spending too much more time fiddling I'd simply Clean Install the printer which always works, lasts longer and actually saves time. This software is required for many printer features to be interactive from the PC including scanning. There are no Store apps or generic print drivers that can do this reliably and permanently yet:1) Power up the printer, if wired unplug it's USB cable from PC. 2) Go to Settings>Apps>Apps and Features to find and Uninstall any printer software.3) Go into Device Manager reached by right clicking the Start button, from View tab Show Hidden Devices, open Printer, on Driver tab if present Uninstall the driver. If prompted include the full software package as well. Then do the same for any other printers listed that you do not regularly use. 4) Now type Control Panel in Start Search, open CP, choose Icon View. In Control Panel open Devices and Printers, right click printer to delete Printer and any scanner or fax of the same name. Restart PC.5) Delete old printer drivers for unused printers that can interfere: https:\/\/www.tenforums.com\/tutorials\/101274-unin...https:\/\/techjourney.net\/failure-unable-to-delet...6) Go to the printer model’s Support Downloads webpage to download and install the latest full software package. Now is also the time to check for any newer printer firmware to install which matters a lot.7) Extract Printer software, right click Setup file to Run as Administrator. Follow the setup screens closely as you install the software. For USB it should prompt when to plug in the printer.Older software may need to be installed in Compatibility Mode to run correctly: https:\/\/www.windowscentral.com\/how-install-non-... If you have further problems reply back with results of each step. I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thanks Greg, I have done all steps you suggested a couple of times and seem to be going in circles.The printer seems to be ready and works as a copier unconnected, but messages keep telling me it is not connected or has no driver. Two messages keep reappearing windows system 32\\rundll32.exe : function address caused a protection fault error 0x00007FFD9173E606.Also exception code 0xc0000005.I am ready to throw printer in tip but I feel it is some simple thing I am not doing. When I try to print  doc from PC it tells me unable as problem with printer setup, even though in the print options screen it is ticked and \"ready'","If you tried every step I gave including deleting old printer drivers, installing latest firmware and full software package, then try creating a new Local Admin account in Settings > Accounts > Family & Other People > Other, as shown here:http:\/\/www.howtogeek.com\/226540\/how-to-create-a... Sign into the new account, see if printer will work from the new account, if so then move your files over, test that all programs work or else reinstall them, then when ready delete the old account in the same place.You can then change it to your Microsoft account if desired: https:\/\/www.tenforums.com\/tutorials\/5375-switch...","Try Windows Fax and Scan which is found in All apps under Windows Accessories.","Try Windows Fax and Scan which is found in All apps under Windows Accessories.Which option do I then take ? It offers Open new window. Run as administrator. or Open file location","That depends on what you are doing.","Thanks Greg, I have done all steps you suggested a couple of times and seem to be going in circles.The printer seems to be ready and works as a copier unconnected, but messages keep telling me it is not connected or has no driver. Two messages keep reappearing windows system 32\\rundll32.exe : function address caused a protection fault error 0x00007FFD9173E606.Also exception code 0xc0000005.I am ready to throw printer in tip but I feel it is some simple thing I am not doing. When I try to print  doc from PC it tells me unable as problem with printer setup, even though in the print options screen it is ticked and \"ready'my printer won\"t work it goes directly to fax and says ready, will not print anything. I have pushed so many buttons. Should I just buy a new printer? The print out says wireless is on as wireless working but signal quality no run, no connectivity Network fail settings say not run no chanel, no security no filtering. What the heck?","Thanks Greg, I have done all steps you suggested a couple of times and seem to be going in circles.The printer seems to be ready and works as a copier unconnected, but messages keep telling me it is not connected or has no driver. Two messages keep reappearing windows system 32\\rundll32.exe : function address caused a protection fault error 0x00007FFD9173E606.Also exception code 0xc0000005.I am ready to throw printer in tip but I feel it is some simple thing I am not doing. When I try to print  doc from PC it tells me unable as problem with printer setup, even though in the print options screen it is ticked and \"ready'my printer won\"t work it goes directly to fax and says ready, will not print anything. I have pushed so many buttons. Should I just buy a new printer? The print out says wireless is on as wireless working but signal quality no run, no connectivity Network fail settings say not run no chanel, no security no filtering. What the heck?"]},{"symptom":"jpegs are color altered using Windows 10        There are 2 very recent problems possibly related.   Windows 10 will not display a Photoshop default option where other default options are listed, nor do I find another way to default or even open a photo to Photoshop either with an individual file or as a system default setting.  The second issue is all jpegs are color altered when opened with any program but Paint which does not meet my needs.  When I use Photoshop or the Adobe Bridge directly from the app to open photos, they appear color altered (too red) and rendered useless for any purpose.  Photos display normal colors in Paint and on my wallpaper selections.  Help would be greatly appreciated.","solutions":["Hi BeckyDX, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.To change the default program that .jpg and .jpeg files open with in Windows 10, you can go to:Start > select Settings > Apps > Default apps Then, scroll down and select \"Choose default apps by file type\". You can then specify the application (eg. Adobe Photoshop) to open by default when you open these types of files.--- In regards to the odd red color, it sounds like this is related to Adobe products specifically. If you open the JPGs in a web browser (such as Microsoft Edge or Google Chrome), do they display properly?A different default color profile \/ color setting in Adobe products may be causing the red color. You may wish to check within Photoshop through Edit > Color Settings to see what this is set as.This post has the defaults which you may try to match: https:\/\/community.adobe.com\/t5\/illustrator\/defa...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions! If you can include some screenshots that would assist us as well.Regards, -Ashton","Thank you for your assistance, Ashton.  I have followed you directions as to setting the default to Photoshop including \"more apps\" and \"look for another app\" options that appear on the bottom of the lists when altering the individual files, and going to settings, file type, and looking for Photoshop.  No luck.  \"Adobe\" appears with 3 files under it, but none of them apply.  jpegs are not read by the pdf program and will not open there so this issue is unresolved. So far photos in the paint program and in the file finder seem to be unaltered in color. Photos on the browsers and sent via email are also OK, so the colors are probably a PS problem. The color settings in Photoshop are exactly as pictured on the screen shot you sent.  The site link you sent will be contacted.  All active program apps, tiles or in use icons or highlights on the monitor are now showing up as pink and the entire screen turned pink for a time and a gridded grey another time.  The nightlight settings are turned off for this system.  Did MSFT just change the colors on the system?Again, thank you so much for your help with these frustrating issues.  ","Hi Becky, Sorry to hear that didn't resolve things. In regards to the file types, it should look like this under the \"Changing any and all\" section:https:\/\/www.digitaltrends.com\/computing\/how-to-...(Hopefully .jpg and .jpeg are listed there in the \"Choose default apps by file type\")Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I'm out of ideas for the change in colors, and am glad you checked the nightlight mode. I will see if any other experts have ideas on what to check here.Thanks, -Ashton","Hello BeckyDX! My name is Marco, I am an Independent Advisor. I will do my best to help you.For your first problem let's try this. - Right click on your .jpeg file - Click on Properties - On \"opens with\" click on \"change ..\" - Scroll down the page and click on \"More apps\" - Unroll the page again and click on \"Look for another app on this pc\" Now get your photoshop .exe file If it is in the default directory the path is C: \\ program files \\ adobe \\ Adobe photoshop CC 2019 (or other version if this is the case)- And double clic on photshop.exe , \"apply\" then \" ok \" It is supposed to work For the color in your last message you seem to say that this occurs on the applications? and other than photoshop? Checked if your screen is not defective. If you have a desktop PC try another screen. If you have a laptop with an HMDI socket, try to connect it to another screen or TV via this hdmi socket. And see if the problem recurs. I expect from you :) Marco"]},{"symptom":"Windows Sandbox Does Nothing (1909 Build 18363)        I just upgraded from Windows 10 home to Win10 Education. It seems to be very similar to enterprise, and I got to upgrade for free. I just want to use the sandbox and I've spent hours trying to get it running.Virtualization is enabled in Bios, sandbox, Hyper-V, VM platform, and Hypervisor platform all enabled in features. I have already tried going through the processes in order and restarting them (virtual disk, virtualization, hyper-v, cm services, etc.) I've tried uninstalling, reinstalling, restarting, and everything you can find on youtube and these forums. When I run the sandbox, it opens the admin window to allow sandbox to make changes on this computer, I hit yes and the window closes and nothing happens. I have tried so much and don't even get an error message, just nothing. All I want to do is use this sandbox. Any ideas?","solutions":["Try repairing the OS. 1. Visit the site below to start downloading the Media Creation Tool. We will use Internet Explorer to download in this guide. http:\/\/aka.ms\/DownloadW10ISO2. Watch the video below to perform an in-place upgrade.https:\/\/www.microsoft.com\/en-us\/videoplayer\/embed\/RE201WL","Hi mwl675, I suggest that you rollback first to 1903 using this article: https:\/\/pureinfotech.com\/uninstall-windows-10-1...Then follow this guide on how to use Sandbox on 1903: https:\/\/www.windowscentral.com\/how-use-windows-...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]}]}