{"windows":[{"symptom":"System freeze during file transfer left volume bitmap error on secondary exFAT HDD        So, I've searched Google and various Windows 10 forums & support sites regarding this issue. Nothing I've read so far has answered my question so I figured I'd try to explain the issue here. My undying gratitude ahead of time if anyone can give me an answer other than \"reformat it\". I'll add as much info as I can but if anyone needs to know something specific, ask and I'll get it!TL;DRRunning chkdsk D: \/f \/r \/x from an Admin cmd results in \"could not repair disk. An error was encountered while examining the volume bitmap.\" Running from Disk Management results in \"found disk errors it can't repair. Select 'OK' then try repair again.\" FSUtils reports the drive flagged as dirty but if chkdsk can't complete\/repair the drive, how do I fix the volume bitmap?QUESTIONS1. Will manually clearing the dirty bit with a HEX editor make the drive usable again?2. If Windows 10 still has File Explorer issues, will the same thing happen again as soon as I try to move a new MKV file to the drive?------------------------------OS & SYSTEM INFOWindows 10 Home 64-bit v1909OS Build 18363.535ASUS P8Z77-V Pro, BIOS v2104Intel i5 3.4GHz 16gb RAMNvidia GTX 1060 w\/ latest driversBoot Disk: Samsung SSD 860 EVO 1TB, Single NTFS partitionSecondary Disk: Western Digital Blue 4TB, Single exFAT partitionBACKSTORYThe HDD in question is the Western Digital Blue 4TB. I only use it for movie storage accessed via PLEX on our home network.Prior to the Windows 10 1903 update, File Explorer had an issue transferring large files (like an MKV BluRay rip from our movie collection). I had a different drive at that point (2TB Seagate from  2012 w\/ 2 NTFS partitions), but the same issue as this one: While moving an MKV file, transfer status would slowly drop to 0Kb\/sec and stall, then the system would freeze\/become unusable forcing me to reboot which made the drive report as read-only. That brought my PLEX media center project to a halt. Soon after, the Windows 10 1903 update was released which I read \"fixed the file transfer problem\", so I installed the update, backed up my movie collection, reformatted the drive, and all was fine until the Seagate died (7 years, RIP) at which point I bought the WD Blue 4TB.Everything was great until the Windows 10 1909 update and suddenly, the exact same scenario happened. MKV transfer stalls, system freezes, I hit reset, and the drive is read-only.After searching Google for help, everything I read said \"use chkdsk D: and some combo of \/f, \/r, or \/x to fix and recover after un-mounting the drive, however running chkdsk via Admin cmd came back with \"could not repair disk. An error was encountered while examining the volume bitmap.\" I think I read that the volume bitmap (allocation bitmap\/table) is an exFAT specific thing which helps in getting more space out of a drive. Exactly why I formatted the drive exFAT when I bought it.I ran an \"is dirty\" check and yes, it has a dirty bit. At this point I check the Event View and it's logging an Event ID 153 warning every 1-2 minutes which reads \"The IO operation at logical block address 0x10140 for Disk 1 (PDO name: \\Device\\0000035) was retired\". Following the Event Log Online Help link gets me to info about drive failure which the chkdsk error would seem to confirm, but running the WD SMART scan on the drive, everything returned says the drive is 100% healthy. I then find a comment in another post which says a hard reset while the drive was performing an operation could also result a volume bitmap error. Exactly my scenario.I fixed the read-only lock, but I get the same chkdsk error when I try to repair it, even running it in safe mode and for some reason chkdsk won't run a disk scan on boot-up no matter how I try it. I read that you can manually clear a dirty bit on a drive, using WinHex or a tool called DMDE  but will that clear the error and return the drive to its \"pre-transfer freeze\" usable state? I also read that File Explorer in Windows 10 is still jacked up so will getting the drive back up even matter or will the same thing happen as soon as I attempt a 2GB file transfer?I hope someone gets this and can offer an answer other than a LONG backup process and drive format!","solutions":[]},{"symptom":"CAN I SWITCH WINDOWS 7 TO WINDOWS 10?          I HAVE A WINDOWS 7 AND CANNOT AFFORD A NEW COMPUTER. CAN I JUST PURCHASE A WINDOWS 10 DISC?","solutions":["All caps is considered yelling.  Please do not yell at the other users that make up this forum.","You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700Cheers.","Hi Thomas !Before proceeding make sure your PC has enough System Requirementsfor installing or upgrading from Windows 7 to Windows 10.Windows 10 System RequirementsIf Yes,•  Then check which version are you running. For Example, if your PC is running on Windows 7 Professional or Ultimate your PC will get Windows 10 Pro otherwise other editions like Windows 7 Starter, Home, Home basic, Home Premium will be upgraded to Windows 10 Home.• Make sure you have a genuine license with that your PC is activated. If your PC was pre-shipped with Windows 7 then it is an OEM key.• If your PC is running on a pirated edition of Windows 7, then Windows 10 will be installed but it will not be activated with the existing Windows 7 license.•  If you have a valid Windows 7 license or if your PC has an OEM license of Windows 7, then you can install Windows 10 on your PC. ","As I have already advised you:If you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.","Bill Smithers is absolutely right.  It is better to have more than least. And as I have said to check whether if you have at least requirement on you PC because if it does not meet the requirements Windows 10 installation will not proceed. You may install Windows 10 right now. You can try out Windows 10 Later upgrading  is up to you.However it should be checked that the current license of Windows 7 is genuine or not. Otherwise after upgrading to Windows 10, if the license of Windows 7 is not genuine then Windows 10 will not be activated. And you have to purchase Windows 10 either from Microsoft Store or from any nearby retail store.","As I said:You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700Cheers."]},{"symptom":"where do i find my product key        where do i find my product key","solutions":["With Windows 8\/8.1 The Product Key on preinstalled Operating Systems (HP, Acer, etc) is embedded in the BIOS in the Motherboard, so that the lost and\/or worn C.O.A. Sticker problem is no more.To find it:\"Windows 10 Embedded Product Key Tool\"https:\/\/neosmart.net\/blog\/2014\/windows-10-embedded-product-key-tool\/\"We’re proud to introduce the immediate release of our newest utility for Windows users: the NeoSmart Technologies Embedded Product Key Tool. Designed for users of Windows 7, Windows 8, and Windows 10, our embedded product key tool will retrieve and display the Windows setup product key embedded in the BIOS or EFI, allowing you to store it for safe-keeping or use it to reinstall Windows with an official Windows setup image.\"You can also use:\"Belarc Advisor - Free Personal PC Audit (Version 8.5c)\"http:\/\/www.belarc.com\/free_download.htmlOr:\"Product KeyFinder\"https:\/\/www.magicaljellybean.com\/keyfinder\/Cheers.","where do i find my product key Hello,Refer Windows 8.1 section here: https:\/\/support.microsoft.com\/en-in\/help\/10749\/windows-find-product-keyRegards.","That's all that link says:Locate your product key for Windows 7 or Windows 8.1 A product key is usually required when uninstalling or reinstalling Windows 7 or Windows 8.1.Generally, if you bought a physical copy of Windows, the product key should be on a label or card inside the box that Windows came in. If Windows came preinstalled on your PC,the product key should appear on a sticker on your device. If you’ve lost or can’t find the product key, contact the manufacturer.@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@It says it should be on a Sticker.True for 7, NOT true for 8\/8.1.@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@As I advised you:With Windows 8\/8.1 The Product Key on preinstalled Operating Systems (HP, Acer, etc) is embedded in the BIOS in the Motherboard,so that the lost and\/or worn C.O.A. Sticker problem is no more."]},{"symptom":"ERROR ! The computer has rebooted from a bugcheck.  The bugcheck was: 0x000000d1 (0x0000000000000008, 0x0000000000000002, 0x0000000000000000, 0xfffff8062072bdb2)        Hello,I'm facing this restart problem ! sudden death of blue screen uploaded here the dumphttps:\/\/1drv.ms\/f\/s!Airzeor1BDnaiUthv5iBwU0FHvVZCould anyone know what be cause of this problem. Event: \"The computer has rebooted from a bugcheck.  The bugcheck was: 0x000000d1 (0x0000000000000008, 0x0000000000000002, 0x0000000000000000, 0xfffff8062072bdb2). A dump was saved in: C:\\Windows\\MEMORY.DMP. Report Id: 75387568-7d63-4bf9-86d1-d8f0855b13e7.\"","solutions":["Hi Tayya, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Likely caused by the network driver as indicated in the crash dump however no direct reference was there.The next step, Let us try finding any misbehaving driver Enable Driver Verifier: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...(Must create a Restore point before) Upload the newer dumps when you get Driver_Verifier_detected_voilation. Please note that the system might crash before you reach the desktop-if it does please let us know so that we can guide you to disable Verifier."]},{"symptom":"Apps not working        my game apps, calculator and other start to open by snap shut. Any solutions? ","solutions":["Hi, FrankMoroney1 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","my game apps, calculator and other start to open by snap shut. Any solutions? Hello,Try to re-register apps. Perform these steps:1. Search for Windows PowerShell using Cortana or Windows Search.2. From results, right click on Windows PowerShell and select Run as administrator.3. Then type following command and press Enter key:Get-AppXPackage | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Let the command complete.4. Close Windows PowerShell and see if the issue is resolved now.Let us know if this helps! "]},{"symptom":"Windows license expiration        I have a laptop that has ben running Window10 Pro for the last 10 months, and I'm now constantly getting a pop up telling me that my Windows license is about to expire, and that I need to activate Windows in my settings.  When I bring up my settings window, it says that my Windows has already been activated.  Is anybody else getting this?  Or is it a malware of some kind?","solutions":["Hi That. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.That message normally means that someone has activated Windows with a Volume License Key meant only for business or organizations that activate a large number of PC's, which need to check in with the organization's server regularly to reactivate.Sometimes this is done by shops or others reinstalling Windows unnecessarily because the PC either came with a Windows Product Key embedded in the BIOS\/UEFI firmware, or it was already activated by free Upgrade or a retail Product Key, and would have reactivated after a reinstall had they given it the chance and not interrupted this by installing the illegal key.If you know Windows was originally activated legitimately by one of these methods then to fix the problem what I would do is go offline to remove the Volume License key and then restore the Generic Product Key that is used to activate with the Digital License issued by Upgrade or Factory install, the factory key embedded in the UEFI\/BIOS firmware chip, or the retail key you used. Then we'll see if it activates:1) Go offline by opening Action center at the right end of Task Bar, then clicking on Airplane mode to turn off internet.2) Next type CMD in Start Search, right click to Run as Administrator, then right click to copy and paste this command in and press Enter: slmgr -upk3) Restart PC and then insert Generic Product Key for your licensed version from here:http:\/\/winaero.com\/blog\/generic-key-to-install-...This sets everything back to default so that if there is a Digital License issued during a proper Upgrade it should reactivate within a few days. If not we will need to try something else:If it doesn't activate after going online and you originally had factory installed Windows, read the Product Key embedded in the UEFI firmware chip at the factory by running ProducKey:http:\/\/www.nirsoft.net\/utils\/produkey-x64.zip, copy and paste the OEM-BIOS key (only) into Settings> Update & Security > Activation.If you were sold a Volume license product key or the PC came from seller activated with one, then It is piracy when someone resells Windows with no way to legally activate it. You can report this to Microsoft here:https:\/\/www.microsoft.com\/en-us\/howtotell\/cfr\/r.... In the past when victims cooperated with an investigation they would sometimes give them a free copy as thanks.You can also contact the seller and let him\/her know you are taking these actions and that they need to make the activation good. Many will comply rather than risk investigation or prosecution.For further assistance restoring the original legal activation you can contact Microsoft Support phone or chat options here:https:\/\/partner.support.services.microsoft.com\/... I hope having all possible options helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","In the settings activation screen, it reads \"Windows is activated using you organization's activation service.\"All I know that this PC was originally sold with  Windows 8, and I have the key code sticker for that on the bottom of the laptop.  The person that I bought it from said it had the Windows 10 upgrade done already.  Does this make any sense to you?   ","Windows 8 did not have stickers on the PC for the Product Key, that was Windows 7. If you know the PC came with WIndows 8\/8.1 then you can check if it has an embedded Product Key exactly as I said in my first post.Your Windows 10 Pro is illegally activated with a Volume License key meant only for businesses. If someone sold you it this way or upgraded it by doing this, they committed felony piracy you can report to Microsoft here:https:\/\/www.microsoft.com\/en-us\/howtotell\/cfr\/r.... It is illegal to sell or resell Windows without the buyer having a legal way to activate it.Just letting them know that you intend to report this can often get a shop or seller to make it right.If there is an embedded key you can follow the steps in my first post to remove the Volume License Key and then insert the OEM-BIOS key detected by ProducKey to see if it will activate. If not restore the Generic Version Key fromhttp:\/\/winaero.com\/blog\/generic-key-to-install-... which is all that can be present if it's already been activated legally with a Digital License.If neither of those work then it's likely Home so you can downgrade to Home using the workaround method here to do that:https:\/\/answers.microsoft.com\/en-us\/windows\/for... then try the OEM-BIOS key again, and the Generic Home key next. If neither of those work you'll have to buy a Home Product Key to activate it, if you can't get the seller or upgrader to make it right.. The illegal Volume Key will expire soon.","I have a laptop that has ben running Window10 Pro for the last 10 months, and I'm now constantlygetting a pop up telling me that my Windows license is about to expire, and that I need to activate Windows in my settings.  When I bring up my settings window, it says that my Windows has already been activated.  Is anybody else getting this?  Or is it a malware of some kind? Hello,See if this fix helps you:https:\/\/www.kapilarya.com\/your-windows-license-will-expire-soon-for-windows-10Hope this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP. "]},{"symptom":"my battery icon often disappears        is there any solution i can do other than disabling and re-enabling it through the device manager? like through the registry or something. im so sick of doing so over and over again.","solutions":["Hi,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Battery icon disappearing once in a while(long time) is often seen. However, if you are frequently hitting the bug the issue might be something else. What is the version of Windows 10 currently installed?You may use the batch file to Restart explorer that often fixes it. https:\/\/www.windowscentral.com\/how-restart-expl...Disclaimer:This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","is there any solution i can do other than disabling and re-enabling it through the device manager? like through the registry or something. im so sick of doing so over and over again.Hello, Please run Power troubleshooter from Settings app > Update & security > Troubleshoot. See if it helps you.Hope this helps!"]},{"symptom":"The lastest version of windows 10 is broken        Getting system freezes, blue screens and application crashes on this version of windows 10. Can it be fixed in the next update.","solutions":["Hi,To better understand the issue, Please see the article below on how to share System logs.http:\/\/www.yourwindowsguide.com\/2017\/12\/how-to-share-event-logs-in-case-of.html","Hello,Try to perform clean boot:https:\/\/support.microsoft.com\/en-in\/help\/929135\/how-to-perform-a-clean-boot-in-windowsLet me know if this helps!"]},{"symptom":"Upgrade from Windows 8.1 to Windows 10        My Laptop was having Windows OEM 8.1 version. It received upgrade of Windows 10 in the second week of Dec19. However, after downloading the upgrade, my Hard drive crashed. (which was having some bad sectors) Hard drive could not load the entire contents of new Operation System, Windows 10.Then I have changed the HDD. As my Microsoft accounts was showing that my Laptop was upgraded to Win10, I have downloaded and installed the Windows 10 on to it. Now problem is that this Win10 is not getting activated !!My W 8.1 product key was stored on Hard drive and now that is also not accessible.What is the solution ?","solutions":["Hi ATULKUL123 When you say you 'received' an upgrade to Windows 10 in Dec 2019, did you purchase a Windows 10 licence or did you just upgrade yourself using the Windows 10 ISO or some other method?And after upgrading to Windows 10, was that successfully activated? Can you please check to make sure you re-installed the exact same Edition (Home, Pro . . etc.) as was previously installed and activated on your PC (Settings - System - About)","My Laptop was having Windows OEM 8.1 version. It received upgrade of Windows 10 in the second week of Dec19. However, after downloading the upgrade, my Hard drive crashed. (which was having some bad sectors) Hard drive could not load the entire contents of new Operation System, Windows 10.Then I have changed the HDD. As my Microsoft accounts was showing that my Laptop was upgraded to Win10, I have downloaded and installed the Windows 10 on to it. Now problem is that this Win10 is not getting activated !!My W 8.1 product key was stored on Hard drive and now that is also not accessible.What is the solution ?Hello,Information required to assist you.Have you download and opted for upgraded to Windows 10 yourself?Have you tried signing in with same Microsoft account on Windows 10?What activation error you get?Regards.","Thank you for your support. The error code was OXCOO4F213.Fortunately, I could recover some important data from the old hard drive, which was gone bad. I could found the product ID and key of Windows 10 on it. I helped me to reactivate on my Laptop.  ","Thank you for your support. I did not purchase the W 10, but the W 8.1 OEM earlier. Fortunately, I could recover some important data (poste upgrade) from my old hard drive, (which was earlier connected to Laptop and gone bad due to bad sectors)I could found the product ID and key of Windows 10 on it.It helped me to reactivate on my Laptop.  Thank you once again. ","Thank you for your support. The error code was OXCOO4F213.Fortunately, I could recover some important data from the old hard drive, which was gone bad. I could found the product ID and key of Windows 10 on it. I helped me to reactivate on my Laptop.  Glad the issue is resolved. Thanks for the update!Regards."]},{"symptom":"pdf file        I am trying to open a pdf in my laptop, but it does not come up online.","solutions":["I am trying to open a pdf in my laptop, but it does not come up online.Does your Browser support opening pdf files on-line ???Read up on your Browser FAQ if this is supported.","Chrome should have no problem opening the PDF file."]},{"symptom":"Can't login to my account with my Pin        Since I reset my computer the next message shows up \"you can't sign in with this account. try a different account\" every time I try to login with my pin.I tried restarting in safe mode but it asks for my password which unfortunately I don't remember since I set up when I bought the computer 2 years ago, and it seems it's not the same as the Microsoft password since it's a local password.Another problem is I can't select any other option when troubleshooting because it says I'm not the administrator of my own PC?? This is driving me crazy!! Any help will be appreciated. Thank you. ","solutions":["Since I reset my computer the next message shows up \"you can't sign in with this account. try a different account\" every time I try to login with my pin.I tried restarting in safe mode but it asks for my password which unfortunately I don't remember since I set up when I bought the computer 2 years ago, and it seems it's not the same as the Microsoft password since it's a local password.Another problem is I can't select any other option when troubleshooting because it says I'm not the administrator of my own PC?? This is driving me crazy!! Any help will be appreciated. Thank you. Hello,It seems you tried resetting by keeping your data. Additionally, it looks like you lost admin rights. See if this fix helps you:https:\/\/www.kapilarya.com\/fix-lost-administrative-rights-in-windows-10Let us know if this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP. ","Hello, unfortunately I can't start the command prompt because the same message shows up about me not being an administrator. :\/","Hello, unfortunately I can't start the command prompt because the same message shows up about me not being an administrator. :\/You need to plug in Windows 10 bootable USB and then use recovery mode Command Prompt.Regards."]},{"symptom":"Windows 7 does not start up.        I run windows 7 in my laptop. When I power on the laptop It asks me to choose windows 7 to start up and then it shows the microsoft logo as well. Suddenly some words on a blue screen appears and automatically shut down the laptop and it restart automatically. I can not go more than that. Even I tries to install windows again but as it does not boot up from my USB, I tried to go through the set up that can be accessed by pressing F2 when the system start. Then it ask me for a password and when I enter something on it after 3 attempts it says System Disabled. I tried to repair windows. But when I tried it asked me to log in as a user. When I entered my log in password it says that it is incorrect. How can I get my laptop back to work normally.? Please help me with this.","solutions":["I run windows 7 in my laptop. When I power on the laptop It asks me to choose windows 7 to start up and then it shows the microsoft logo as well. Suddenly some words on a blue screen appears and automatically shut down the laptop and it restart automatically. I can not go more than that. Even I tries to install windows again but as it does not boot up from my USB, I tried to go through the set up that can be accessed by pressing F2 when the system start. Then it ask me for a password and when I enter something on it after 3 attempts it says System Disabled. I tried to repair windows. But when I tried it asked me to log in as a user. When I entered my log in password it says that it is incorrect. How can I get my laptop back to work normally.? Please help me with this. You are trying to access BIOS when it asks for that password at setup.We can't help you with changing the Boot Order if the BIOS is password protected and you don't know the password.We can't help you due to Microsoft's policy about BIOS\/etc. Passwords.Contact your laptop, computer or motherboard manufacturer.@@@@@@@@@@@@@@@@@@@@@@Microsoft forbids any assistance being given in these Forums to help you bypass or \"crack\" lost or forgotten Passwords.Here is the Microsoft Information outlining that Policy:http:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_7-security\/keeping-passwords-secure-microsoft-policy-on\/39f56ef0-5d68-41ad-9daa-6e6019c25d37________________________________________Regarding questions with respect to resetting hardware BIOS passwords we would request that you direct customers to the appropriate resources on the Hardware manufacturers sites for the correct procedure.If you see a post that seems to offer password cracking advise, please click the “report abuse” link to help us find and deal with it"]},{"symptom":"My hz being weird        So I got my computer a couple weeks ago and when I finished setting it up it was on 30hz, so I went into my GeForce settings and changed it to 60hz. But today for some reason I booted it up and noticed it was choppy and sure enough it was on 30hz but when I go to change it back it doesn't even give me the option to change it back to 60. Can anyone help please?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please download the Display Driver from NVIDIA and install the same and check if the refresh rate settings is unlocked.Here is the link from where you can download the driver. https:\/\/www.geforce.com\/drivers"]},{"symptom":"app won't download        I WAS PLAYING INFINITY SLOTS WHEN WE HAD A POWER OUTAGE.  WHEN I LATER TRIED TO GET BACK ON, IT WOULDN'T DOWNLOAD.  WHAT CAN I DO?  THE APP CAME WITH MY LAPTOP AND I HAVE MICROSOFT 10.  ONE SUGGESTION HAS BEEN TO UNINSTALL THE APP THEN REINSTALL IT.  WILL I LOSE MY DATA?","solutions":["Hi LindaLeonard3 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.Restore from a system restore point. https:\/\/support.microsoft.com\/en-ph\/help\/12415\/...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"pop-up on bottem of screen        I AM HAVING PROBLEM WITH POP-UP ON BOTTEM RIGHT ON MY SCREEN, TRYING TO SELL ME SOMETHING","solutions":["POP-UP AD RIGHT BOTTEM RIGHT SIDE OF SCREEN","Download, install, update and scan your System with the free version of Malwarebytes AntiMalware:http:\/\/www.malwarebytes.org\/products\/malwarebytes_freeThis is a very good Program to scan your System to remove Adware, etc:http:\/\/www.bleepingcomputer.com\/download\/adwcleaner\/AdwCleaner is a program that searches for and deletes Adware, Toolbars, Potentially Unwanted Programs (PUP), and browser Hijackers from your computer.  By using AdwCleaner you can easily remove many of these types of programs for a better user experience on your computer and while browsing the web"]},{"symptom":"New HP computer not recognising any passwords or face recognition        I have a brand new HP all in one desktop. Went to use it on the second day and it says it needs a Windows Hello needs a pin. Asked for password. Not sure if I set up face recognition the night before but its not recognising that. I changed my Microsoft password 3 times and it keeps saying incorrect. I can not get into this computer!","solutions":["Hi Michele. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I will give you everything possible to fix sign in failure so that at least something will work, based on helping with this issue several times a day for years. I'll also be standing by to guide you as needed:Try restarting the PC to see if anything changes. Then see the various troubleshooting steps here: https:\/\/www.groovypost.com\/howto\/reset-windows-...https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/www.groovypost.com\/howto\/recover-lost-w...This could also be due to account corruption so see the fixes here: https:\/\/www.techbout.com\/fix-corrupt-user-profi...If you cannot sign in then it will save time to create a new Admin account to replace the old one.Follow this tutorial to enable the hidden Built-in Administrator from the Sign In screen:https:\/\/www.isumsoft.com\/it\/enable-hidden-admin..., sign into it, create a new Local or Microsoft Admin account in Settings > Accounts > Family & Other People, sign into it, move your files over, test all programs run correctly, then when ready delete the old account and hide the built-in Admin again. You can then change to your MS Account.You can also run the Repair Install from the Admin account to see if it fixes the old account first, by install the Media Creation Tool from this linkhttp:\/\/windows.microsoft.com\/en-us\/windows-10\/m... choosing Download Tool Now, install the tool, open it and choose Upgrade this PC Now. This will save your files and apps while bringing you up to the latest version by the most stable method. It will also bring all of your Updates current and solve most problems since it reinstalls Windows.If none of the above work You may need to create bootable media to access Repair Mode or do the Clean install:To create Windows 10 Installation Media on another PC install Media Creation Tool and follow the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, on second screen choose Repair Your Computer, then Advanced Troubleshoot Options, then Command Prompt to try the steps here to enable Built-in Admin to do the above steps to create a new account and move into it: https:\/\/www.tenforums.com\/tutorials\/2969-enable...If that fails go back to Troubleshoot Options to try a Reset. If that fails choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, click Next to let it create needed partitions and start install - this makes it foolproof. Everything needed to get the best possible Clean Install is here: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... It is a better install than any amount of money can buy and a great learning experience that will make you the master of your PC because you will learn what works best and how to apply it with your own hands. If you have files that aren't backed up you can use the same bootable media to try to rescue your files using this method:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Can't host or join a game withe the Game Pass        Hi,My friend can't host or join a game when we want to play games like Astroneer or Zoo Tycoon.But he can join or host when it's Age of empire or Worms.So the problem is obviously from Windows, we did everything on this page (https:\/\/beta.support.xbox.com\/help\/Hardware-Network\/connect-network\/server-connectivity-xbox-app-displays-blocked)  but nothing resolved the issue.Hope someone can help.Thanks :)","solutions":["So no one can help us ?","Not sure why its \"obviously windows\" if it works fine with some games but not others, I feel like it would be a per game issue no?I have no issues with crossplay on deep rock but since the last update to astroneer I cant do crossplay."]},{"symptom":"Windows 10 Home, Laptop (HP)....Backlit keyboard off timing adjustment....        THERE ISN'T ONE> There has got to be a way.... Command line, power shell, something.....Everything can be done with programming, right?  PLEASE....haha, this keyboard light turns off While I;m typing! I mean come on...enough is enough... :-)","solutions":["Hi Larry. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.That's an HP issue so see similar issues in HP forums for possible solutions: https:\/\/h30434.www3.hp.com\/t5\/Notebook-Hardware...https:\/\/h30434.www3.hp.com\/t5\/Notebook-Hardware...HP Keyboard backlight troubleshooting: https:\/\/support.hp.com\/us-en\/document\/c01612362If these don't help start a new thread in the HP forums for your problem. https:\/\/h30434.www3.hp.com\/If you're within a year of purchase you still have HP support, repair and replacement warranty so contact them here:https:\/\/support.hp.com\/us-en\/contact-hpI hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Games and applications are using iGPU instead of Dedicated GPU        Helloo, I have been facing this issue from 2 weeks now, I usually run games and editing software with Dedicated GPU (Nvidia)Brand-> Laptop - HPModel-> cx0140txBut now even if I force an application to use this gpu it works on Integrated GPU (Intel® UHD Graphics 630). I dont know if GPU is giving output on low power, but PhysX Indicator never shows on apps if its turned on, tried reinstalling graphics driver, updating iGPU Driver, forcing apps to use it, nothing worked. Please help","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please refer to the following page and confirm if you performed those steps. https:\/\/www.tenforums.com\/tutorials\/103965-set-...Note: This is a non-Microsoft website. However, it is potentially safe to use. (User's discretion required.)"]},{"symptom":"Minecraft Windows 10 Code already redeemed        I purchased minecraft in 2012(Java Obviously) and me and some friends wanted to play realms. Only problem was that they have bedrock and I do not. So I figured out that you can redeem a free code from your mojang account if you owned java before such and such date. So i went to redeem it but it has already been redeemed. It is not in my order history for any of my microsoft accounts and my guesses are someone either guessed it (highly unlikely) or someone has gotten in my account. I see this unfair as I don't get a chance that I deserve to play Minecraft W10. I wish to receive some help or maybe another code.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand the difficulties you are facing with the redemption of Minecraft game. In order to get clarity, we would like to know from where you received the redemption code. We would like you to sign-in using the Mojang account that you used to purchase the Minecraft Java Edition:https:\/\/my.minecraft.net\/redeem\/minecraft\/ If you see the message 'You already own Minecraft!' the code to claim a free Windows version has been redeemed. Then we will suggest you to contactMojang support to discuss any options that may be available. Regards, Aditya RoyMicrosoft Community – Moderator"]}]}