{"windows":[{"symptom":"CPU at 100% that goes away when opening Task Manager        Hi,So I have had this issue for a while but I was curious if there was a reason for this and if it is possible to stop it. This is Windows 10 on my Lenovo Yoga 910. Occassionally, my CPU will be working very hard and is generally at 100% usage. I can tell because my fan will be working hard for some time. Once I open Task Manager to see what is causing the problem, I will see a dramatic drop in my CPU usage. Below is a screenshot. This seems very odd to me that opening the Task Manager would decrease CPU usage. For a short bit I noticed that \"System Interrupts\" was at the top of the Processes organized by CPU usage in this instance. This isn't a terrible issue but it would be nice to not have these random CPU spikes.","solutions":["Hi Warpstar22 I'll try to answer your question. When idling, your computer is still doing a lot of things. For example preparing files for a further update, or rearanging files, or scanning for virus, etc.When you open the task manager, Windows stops the work that he was doing on hiw own because you're asking him to do something else.Also, system interrupts is a container that gets a lot of instructions from software \/ hardware. it handles a lot of interactions.I hope this answers your question Regards"]},{"symptom":"How do I change my windows password?        This used to be easy. Now , I can find no option for this in  accounts: your info, email & accounts, etc...How do I do this?When i click on \"resetting local password\" it tries to open a browser. What is going on with this and why is changing a password for windows10 so confusing now?","solutions":["Hi, alan93 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.You can change the password from another device, if it is a Microsoft account, click on the link below to reset your password and follow the instructions:https:\/\/account.live.com\/password\/reset","As I stated it was \"local\" not the account. I found it on Ctrl+Alt+Delete. Did not remember it being there. Not a good place imo."]},{"symptom":"System wide stuttering in latest install of windows after a fresh install        Hello,I recently built a new computer and installed windows 10 on it. After I the first hour or so I started experiencing a system-wide stuttering. It happens while I play games, it happens while I watch Netflix, and it is happening while I type this. It makes any kind of media playback worthless. The audio and video are both effected during the stutters which last less than a second but occur about every 1-2 seconds. I have fully updated all my drivers including the bios, altered power settings, and other things mentioned in some of the older posts on this topic. I've included this snapshot of my setup since it seems to be a popular request on the older forums at least. I am wondering if there are new solutions since none of the ones that have been mentioned in the past have been helpful. Thanks in advance!","solutions":["Hi Zachary, My name is Riccardo and I will be happy to help! Since you have updated the drivers \/ BIOS this is a good first step. My next phase would be to go in to Clean Boot (follow instructions below) and report back if the issues resolve themselves;https:\/\/support.microsoft.com\/en-ca\/help\/929135...In some cases some services cause the issue. When you say shuttering, does that mean it freezes up momentarily and then gets back to normal?Let me know.","So, everything is back to normal... I guess that means its one of my programs? Although, sometimes when I restart it the problem goes away until I turn it off and turn it back on. Also, I restarted it once without making any of the changes that you recommended and it crashed during restart. This has happened once before. I think the error was driver_power_state_error. This has happened once since the fresh install. Do I need to revert the setting to undo a clean install or does it only happen once and revert automatically?Thank you for the help! I did not see that solution on any of the other forums. I bet other may benefit from this a lot!Thanks!","That's good information to know...this may tell us what is going on... We could run driver verifier... see here: https:\/\/docs.microsoft.com\/en-us\/windows-hardwa...Go to Start > type in verifier > click verifier icon > click Create Standard sending > Automatically select all drivers on this computerTHis will help us find what is causing the issues...","I ran the driver verifier twice using the settings you mentioned and restarted the computer twice but nothing happened? Nothing is enabled in the startup tab in the task manager. The stuttering is back and it comes and goes it seems. Some restarts are normal some take longer than others, but I have not had it crash again. ","The stutter, is it just your display or does sound also get affected? For instance, you are watching a movie and it freezes, repeats sounds and then goes on?","The stutter effects everything as far as I can tell: audio, video, simple windows animations, in every program. Im away from my computer but i can post a video when i get back. I have seen a few other videos of people having the same problem. Nothing ever crashes or stops running, the whole computer stutters also, not just the program that is open.","Sure I would love to see a video.","https:\/\/photos.app.goo.gl\/BTizNXJ1LRopoTfA7I couldnt find a way to upload the video itself, but here is a link to the video. There is a continuous lag and thats not what im having troubles with. If you listen carefully you can hear the stuttering which is a bit more random. The video is also effected a little bit i may be hard to see since there isnt much movement. I hope this helps.","Just to confirm, you've downloaded the latest BIOS: https:\/\/www.msi.com\/Motherboard\/support\/MPG-X57...Even NVIDIA came out with a new one... https:\/\/www.geforce.com\/driversAnother thing I was thinking was a bad SATA cable...this can sometimes cause that exact issue","I double checked that I have updated all of my drivers multiple times as recently as yesterday. Also windows is installed on a M.2 NVMe drive, which (as you know) doesn't use a SATA cable. The only things I have on my other drives are my game library (SSD) and a few things for backup (HDD). I think that I am going to try to reinstall windows again and carefully add programs instead of dumping information onto windows all at the same time. Do you have any suggestions for better ways to do that than the default way?"]},{"symptom":"I didn't encrypted any volume, but after a blue screen,  it requires me to provide recovery key.        Two days ago, my computer suddenly encounter a blue screen, then I can no longer enter the system.There was very important document on C volume, so I developed a windows installation U disk. But before I could retrieve my documents(my graduate thesis), it told me to enter the recovery key!! Sincerely, I didn't deliberately encrypted my computer! Anyway, when I login my microsoft account on the website, I found one! it is for OSV drive(what's OSV?) . Then, I entered the recovery key into my broken computer, it indicated that the key was not right. What's happening ? How can I retrieve my documents back ?  How to use cmd to unlock my volume? thanks.","solutions":["Hi 志贤陈 I'll try to help you out. Depending on the computer you have, the encryption may be activated by default. Most Windows 10 Pro computer have it. If you don't have the bitlocker key, you won't be able to retrieve the data. Here is some informations about how to retrieve it : https:\/\/support.microsoft.com\/en-us\/help\/453047...Regards Jay","Thanks Jay,I am running windows home 10 edition, The link you posted me indicates that 'Note BitLocker is not available on Windows 10 Home edition.'which contradicts with my bitlocker encryption, another independent advicer told me that my surface pro 5 is using TPM encryption, the day when the factory made my computer, it was encrypted.Here are some information I got from cmd(as shown in pic below): By the way,  I have tried using a usb stick to retrieve my documents, but without a right recovery key, I couldn't operate on any of my locked volume.","Here is the page that stops me from retrieving documents from notepad.","this is the page that shows my bitlocker recovery key. The date is not in consistent with the date shown in the blue screen page. But the key ID FA330B6 is matching.","Yes, most of \"Windows 10 pro\" machines got a TPM chip (which enable bitlocker).Also, the surface pro lineup is also equiped with a TPM chip, even with Windows 10 home.I'm a little bit stuck over your issue, as I can't read\/understand any of your screenshots :(Can you access your Microsoft account, from another computer ? By doing so you should be able to check all the datas related to your account (and the bitlocker key should be there also).","Thanks for your reply.I can access my microsoft account from another computer , from there I saw my bitlock recovery key, there was only one there.However, when I entered the recovery key, it showed that the key was not the right one.Thanks again.","Well, without the right key, I see no solution to get the access back."]},{"symptom":"Webcam        HP Windows 10 Built in Webcam has stopped working . Please help.  Thankyou.","solutions":["Hi DominicSwales and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps on how to troubleshoot HP PC's built-in webcam. Check this article for detailed instructions. It is written by HP Support, so it is safe.https:\/\/support.hp.com\/ph-en\/document\/c03430151I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"My WMR left motion controller still vibrating \/ buzzing        My WMR left motion controller still vibrating \/ buzzing. Hard reset is not the solution, only repeat problem. I've tried MANY times. At last - always vibrates at intervals (with blinkig LEDs) - this kind of behavior is not documented in the controller error list. The windows button dont turned controller off, only when the batteries are removed. The second controller is fine. I used WMR Acer for two years, there was no problem yet. ","solutions":[]},{"symptom":"Minecraft coins gift card        My sons bought a minecoins card from best buy for 19.99 that cant be taken back.  The card says compatible with Nintendo switch and two other systems, yet the password code we got in email and receipt only works for an xbox 1.  How can they redeem the coins or do they just loose their leaf raking money theybspent on the card?monica A","solutions":[]},{"symptom":"PDF's and Windows 10        After a recent Windows 10 update whenever I now attempt to open a .pdf I get a pop-up telling me that Edge is now the home of .pdfs, effectively forcing me to open them with Edge.   The pop-up gives no other alternative.1.  I already have a .pdf reader or two2.  I have no need to go through this window - it is just a time wasting inconvenience.3.  I am comfortable with my existing .pdf reader.4.  I prefer to make my own decisions.  Ask once if I wish to change my .pdf reader - then leave me alone.Windows 10 PC is at present forcing me to use Edge to read my .pdf's after each time throwing me a pop-up that I need to click - and overwhelming my choice in \"default apps by file type\" in settings.Please help.  How can I stop this pop-up?  and use what I decide.","solutions":["Hi, My name is Will i'm an independent adviser. You should be able to have Windows open it directly in a program of your choosing by changing the default program associated with .pdf files. To do this go to the Settings app > Apps > Default Apps > choose default applications by file type (this may take some time to load as it's looking up all known file extensions and their associated programs) > find .pdf and select your preferred program. A reboot may be required for this to take effect. After which .pdf files should only open in your program you chose.I hope that helps."]},{"symptom":"Videos Folder is now D Drive        I wanted to move my Videos folder from my C drive to my D drive. I set the new location to \"D:\/\" instead of an actual folder, as I wasn't paying attention to what i was doing. This renamed the Videos folder to \"D:\/\", and when i click on it. it just redirects me to the D drive. The videos folder itself is now my D drive. I can't undo this, as I don't have any system restore points. Is there any way to fix this?","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.First option is you might be able to move it back by opening \"This PC\", right-click on the Videos folder, choose Properties, in that window go to the Location tab and click \"Restore Default\" to get back to the original Videos folder.If that doesn't work you may need to edit the registry to reset the folder location manually.Using Regedit (right-click START, choose Run, enter regedit, click OK) navigate down the tree to the path:HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell FoldersWithin that list find the item which references \"My Videos\", double-click it so you can edit the value and change it back to the default which is: %USERPROFILE%\\VideosThe screenshot I'm including shows where you need to edit. Be careful making changes in the registry as changing the wrong thing can cause serious problems.Once you've changed that you'll need to log off\/on (or restart) for the change to take.Regards, David"]},{"symptom":"System icons do not appear in tray even though they are enabled.        System icons do not appear in tray even though they are enabled.Does anyone know how to fix this?","solutions":["Hi MatthewCastrigno and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.1. Go to this location. C:\\Users\\Username\\AppData\\Local [if the app data folder is not visible you need to select the \"view\" tab and then checkmark where it says hidden items]2. Look for \"IconCache\" and delete it. 3. Restart your PC. I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Thank you for your suggestion but there is no change after deleting the file and restarting. ","Hi MatthewCastrigno, You may try following these steps on how to fix system icons not showing in the taskbar. Check this article for detailed instructions.https:\/\/www.thewindowsclub.com\/notification-are...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Hide\/disable local account        When I boot up my machine, I am prompted with a failed login attempt to what I think is a local account, as pictured below:After clicking \"OK\", or waiting about 5-10 minutes, this will disappear, leaving me with the screen below:At this point, I can tap the fingerprint sensor and login.I would like to skip the local login, and hide or disable that account, so I can login to my Microsoft account directly. In other words, the machine boots directly to the second image. How can I do this?","solutions":["Hi Tomas Click your Start Button, then just type netplwiz and hit Enter On the resulting dialog, do you see both accounts listed, and if so, can you click 'Remove' on that other local account?","Ran netplwiz and checked the box labelled \"Users must enter a username and password...\" and I can now login as I wanted. Thanks."]},{"symptom":"Overcoming Windows 10 Upgrade and Version Update Failures        Technical Level : Basic SummaryCompiled from helping in thousands of Upgrade failure cases, these steps work for everyone who tries them all for Upgrade from Windows 7, 8 or 8.1 and for version Updates of Windows 10 which are failing.   DetailsIf confident your PC meets the Windows 10 Specifications and are aware of any listed unsupported OS features, then you canInstall  Windows 10 using the media creation toolby installing the tool and then choosing it's first option to Upgrade this PC Now.  However in the same amount of time it takes to download that option, you can choose the second option \"Create Media for another PC\" to make a bootable flash stick, or download an ISO to mount and run or burn DVD media, to keep for any needed repairs or reinstall, or can be run from Desktop to Upgrade.  This media also gives an extra option to save nothing during the Upgrade which overcomes the Upgrade choking on corruption or bloated factory installs and gets as close to a superior Clean Install as an Upgrade can get.  If Media Creation Tool causes problems use the alternate download site at Microsoft TechBench.   Make sure to download the correct version and bit-rate.  Burn to DVD using WIndows Image Burner or create bootable flash using one of the options here:  Create Bootable USB Flash Drive to Install Windows 10 Installation & Upgrade TutorialsWith bootable media you can even do the superior Clean Install Windows 10 which has zero complaints or reported issues in hundreds of thousands of uses and is the very best install of Windows one can have.  Most tech enthusiasts will not even run a factory or Upgrade install but prefer this option for best performance. To improve the Upgrade's chances turn off everything at Startup:Type msconfig in Start Search box, right click System Configuration Utility to Run as Administrator.  On tabs for Startup (via Task Manager) and Services(making sure to tick the box to Hide all MS Services ) disable everything.  You don't need any except those which you prefer to have running when Windows starts and can enable them after the Upgrade.  Repeat this step for the Startup folder by right clicking Start to access Run box, copy\/pasteshell:common startup press Enter to open Startup Folder.Uninstall any anti-virus except Defender.  Bloated AV's like Norton, McAfee, AVG and Avast need to run specialUninstallers (removal tools) for common antivirus software - ESET Knowledgebase.In BIOS Setup disable any virtualization settings.   Reset BIOS to defaults.  Make sure you have the Latest BIOS\/UEFI firmware update by comparing the one presently installed to the latest on the PC or motherboard maker's Support Downloads web page.  You must see to it you have the very latest driver for every major device - chipset, Display, Sound, USB, Network, etc - in Device Manager.  See here for more onUpdating a driver. - Microsoft Community Download, install and run a full scan with Malwarebytes.  Clean up anything it finds and then restart PC and run it again until it comes up clean. Remove if present C:\\windows.old folder following How to delete the Windows.old folder from Windows 10 - CNET.  Restart PC several times.I would also uninstall the buggy Windows Upgrade Assistant at Settings > Apps & Features.  There are tips here for cleaning up and managing smaller drives including 32gb drives.  Always create (on another PC) and run the media on cramped drives to save the huge amount of space the download and staging files takes:  What is the best way to deal with Windows 10 updates on a 32GB machine? | Technology | The Guardian More space! How Windows 10's storage analysis helps you free up your hard drive | PCWorld 7 Ways to Maximize Storage Space on Low Capacity Windows 10 DevicesUnplug all peripherals, leave only mouse and keyboard. Next type Command Prompt in Start Search, right click to Run as Admin, type:sfc \/scannow  then press Enter.  There are reports that updating the BIOS or UEFI firmware is resolving some issues.  Check the PC or motherboard's Support Downloads webpage to compare the latest with the presently installed one found in Windows Administrative Tools>System Information.  Carefully follow the instructions for updating, often found in a ReadMe file in download, from the manufacturer's Support, or ask back here for help. It’s highly recommended to Create a backup System Image of your existing OS before upgrading, which can be recovered using the booted Windows installation media,Repair CD orRecovery flash drivein 20 minutes.   Type Backup in Start Search box, in Backup and Recovery Center choose Create a System Image.  You can also use a more flexible imaging program like freeMacrium Imaging which allows recovery to any partition position on the hard drive.Remove any SD cards or external USB devices or peripherals.  If you want to study the logs to analyze what is causing Upgrade failure, you can use this tool following the guide here:SetupDiag | Microsoft DocsIf you prefer to run an in-place Upgrade the media must be opened from desktop or ISO double-clicked to Mount, then right click Setup file to Run as Administrator.  If using Flash installer make sure it is not set first to boot in BIOS setup so it won't boot itself during restarts, or unplug it during restarts.If you want to maximize chances for a successful Upgrade, then at the screen shown below choose the link to Change What to Keep and save nothing so the Upgrade has much less to choke on and has less problems after install. Make sure your files are backed up separately and you have your program installers and any Product Keys for programs like Office.  Everything that needs backing up is detailed in the Clean Install Wiki provided earlier.  (You can save this option as a last resort.)If it fails anyway then report back the exact error or failure behavior.   Try running it again offline without the internet by disabling the network adapter or pulling the ethernet cable. If Windows won't start see Troubleshooting Windows 8 and 10 Failure to Start - Microsoft Community.   But there's a very good chance in any case that you have such a corrupted install it is not worth keeping, so I'd strongly consider at this point going from worst to best by closely following Clean Install Windows 10 which is the gold standard install in an OS where the quality of the install is everything.Stick with built-in Defender in Windows 10 for best performance and adequate protection.  If you get infected add the inexpensive Real Time protection from the best-in-class free malware scannerMalwarebytes. No one I’ve had do this has ever been infected again.  I'd also periodically scan with free Malwarebytes.If the Upgrade repeatedly fails, you don't even want it and it is disrupting your PC then you can uninstall the Windows Upgrade Assistant and hide the Version Upgrade until it matures following this tutorial:  How to Block a Windows 10 Feature Update and Why You Might Need ToThere is media to reinstall or repair older versions at the TechBench site linked above.Feel free to ask back any questions and keep us posted on how it goes.","solutions":["My question is how to stop an invalid update from continue to retry to install. Here is what is trying to install: Upgrade to Windows 10 Home, version 1511, 10586. I am currently running a currently running Win 10 version . But this continue to retry to install.","Hi James -This is an important Update which should be installed.  Beginning with Windows 10 instead of Service Packs there will be regular Version Updates which will also update the installation media.  So please do install this Update when you can.Let us know how it goes. ","Hi James -This is an important Update which should be installed.  Beginning with Windows 10 instead of Service Packs there will be regular Version Updates which will also update the installation media.  So please do install this Update when you can.Let us know how it goes.  every other computer (desktop, laptop) in my house has updated to the 1511 windows 10 except this one. In fact, the last update of any sort says 11\/13\/2015. my others have been getting some kind of update now and then (yesterday in fact) . This pc was updated from windows 7 to 10 back in August so it's kind of past the 30 days thing. Ran the update troubleshooter with no luck. I did the settings, storage , temp weeks ago and deleted the windows 7 go back to file. Says I still have 42 Gb in temp but the listings only add up to about 3. hidden file?? also did the system file checker in the command window. I did a search for the windows.old file and found nothing. Any ideas?","Sure, James.  What's worked for me is to install Media Creation Toolto make bootable media for any needed repairs or reinstall, then open it from desktop to run Setup as an Upgrade which will do the same as the Windows Update for v.1511, but better.  You can also download only the ISO, right click to Mount and run Setup.  This puts it under your control.","The problem with the Win 10 1511 upgrade is that it obliterates apps.  And ANY scenario, OS that kills my app I use most (from Windows Store) along with the numerous extentions purchased through Microsoft account, is NOT acceptable.  And I've deleted every non-vital program--bye, itunes and all its parts, bye mp3 to wave converter (which I bought online, bye to video files, etc.  I have tons of room on my C drive.  The Recovery drive remains the same, since \"upgrades\" keep piling in--23gs in use out of 25gs.  Disk Management claims everything is \"healthy\", yet I still have no start button, start menu, clear access to any apps--except in the most roundabout way and even then--updates regularly fail and the ones that are \"successful\" have done absolutely nothing to improve my situation.Further, what you have proposed may be a snap to a computer professional with skills--something that wasn't essential when all was well with WINDOWS 8.1--but, it all sounds way too technical for me.  And I resent even having this dropped in my lap.   And the hours and hours I devoted to the ineffectual \"fixes\" suggested by your counterparts.  Now, you have this new idea that will make things right.Looks like I'm stuck.  Have to adjust to the greatly diminished functions courtesy of some sloppy work by Microsoft.  I'm sending them a bill for my services in trying to detect what is wrong with their system.I know they won't pay it.  I hope it, at least, goes against their credit rating.  Something should.  (Oh yeah, I'm sure embedded in their agreement, there is a clause absolving them of anything they do.  Okay, I'm not suing anybody, but, if I gotta work for them, then, I should get paid.","My biggest concern is that every time windows 10 stops working correctly the posted fixes always want you to do a clean (or new) install of windows 10. Problem with that is your option is to lose everything or just lose all your programs and just keep personal files (docs, videos, music) What I miss is the actual windows disc (like with 7 ) that you could load and then choose the REPAIR option. I have several desktops and several laptops in my home. I have experienced so many issues with 10 that after every major update I end up doing a new system image set just in case the next update crashes the system. I wish that Microsoft had give us the option to create a recovery partition if we wanted one. I put 500gb to 1 terabyte drives in everything . I have space.","Did you even read the Wiki above?  Bootable installation media is provided in the second paragraph.  It also explains how to save a System Image backup to use in place of a Recovery partition.  This is the modern way to reinstall in 20 minutes while maintaining  files, programs, settings and  activation. ","The steps in the above Wiki have been used by thousands of consumers since WIndows 10 release, as I was posting the compilation as a template before it became a Wiki.  Everyone who tried every step succeeded to Upgrade, and most got an even better install than an in-place Upgrade which (like a factory Install)  is an inferior install to begin with that no tech enthusiast would even consider running. In helping several thousand consumers with Upgrade problems, it's clear that the problem is always with the previous OS corruption or factory bloatware.  Some have disk junkyards that haven't been wiped off for a decade. As an example, no one who has done the vastly superior Clean Install Windows 10 Upgrade has any of these complaints.  So the install is everything!If you want you can go over the Windows 10 Install Integrity Checklist.","yes, I have had to do the clean install on 2 machines because of the types of errors mentioned in your article. everything working fine, all programs working like they should, very happy camper with windows 10 then the November update comes along and WHAM , a list of new problems and odd things happening. went online with a Microsoft tech and let him take control. no luck. system image re-install and re-update to the November update. now I have an invalid product key. Microsoft could not fix it because the old 7 tag on the machine was not quite readable. had to buy a windows 10 usb stick just to get the product key $110 gone. My point was that the updates coming from Microsoft don't always install properly and something weird malfunctions. like cortana not working anymore, clicking on the start icon stops- but right click works. So you might want to say that almost no one who has done a clean install has any of those complaints.  don't you think it odd that a person should have to make sure they have a current system image on hand for when an update fails? I have using computers since the giant floppy disc days. 95,98,xp 2000, 7 , vista 8, 8.1 Even had an early apple system. I have had hard drives fail, motherboards fail and a host of other things but never so many issues with an operating system. I like windows 10. A lot. I just think maybe it was released a little early and maybe more research into compatibility issues with windows 7 machines or aftermarket programs installed.","There shouldn't be any way even a faulty Update or new version glitch should wipe out Digital Entitlement activation which remains in MS Servers permanently.  I'm wondering now if it's still sitting there waiting to activate had enough time been given connected to the internet, or running slui 4 command which works very well for many to refresh the activation in MS servers. Is there any chance it says Digital Entitlement at Settings>System>About.  If so you can still use the Product Key elsewhere.  I think I'd restore theGeneric key to install Windows 10 RTM to try again to force Digital Entitlement activation so you can retrieve the Product Key to use elsewhere thereby saving the $110. I'm really sorry you had to go through this.  We would have fought it through for you, and still will if you want."]},{"symptom":"Werbcam HP Windows 10 will not enable        Webcam HP built in stopped working  Please help !!! thank you.","solutions":[]},{"symptom":"Event 1002 Application Hang        I get this...Log Name:      ApplicationSource:        Application HangDate:          1\/12\/2020 6:04:04 PMEvent ID:      1002Task Category: (101)Level:         ErrorKeywords:      ClassicUser:          N\/AComputer:      NancyPCDescription:The program explorer.exe version 10.0.18362.449 stopped interacting with Windows and was closed. To see if more information about the problem is available, check the problem history in the Security and Maintenance control panel. Process ID: 2274 Start Time: 01d5c99a2b0fc1fb Termination Time: 0 Application Path: C:\\Windows\\explorer.exe Report Id: 9d5fe1de-348c-4940-869b-8abf0826ccf9 Faulting package full name:  Faulting package-relative application ID:  Hang type: Cross-processEvent Xml:<Event xmlns=\"http:\/\/schemas.microsoft.com\/win\/2004\/08\/events\/event\">  <System>    <Provider Name=\"Application Hang\" \/>    <EventID Qualifiers=\"0\">1002<\/EventID>    <Level>2<\/Level>    <Task>101<\/Task>    <Keywords>0x80000000000000<\/Keywords>    <TimeCreated SystemTime=\"2020-01-12T23:04:04.676236300Z\" \/>    <EventRecordID>9445<\/EventRecordID>    <Channel>Application<\/Channel>    <Computer>NancyPC<\/Computer>    <Security \/>  <\/System>  <EventData>    <Data>explorer.exe<\/Data>    <Data>10.0.18362.449<\/Data>    <Data>2274<\/Data>    <Data>01d5c99a2b0fc1fb<\/Data>    <Data>0<\/Data>    <Data>C:\\Windows\\explorer.exe<\/Data>    <Data>9d5fe1de-348c-4940-869b-8abf0826ccf9<\/Data>    <Data>    <\/Data>    <Data>    <\/Data>    <Data>Cross-process<\/Data>    <Binary>430072006F00730073002D00700072006F00630065007300730000000000<\/Binary>  <\/EventData><\/Event>","solutions":["What were you doing?"]},{"symptom":"Power on but no signal or usb        I just got an ssd so i borrow the SATA cable from my cd drive to transfer data. I turned my pc on and the monitors stayed no signal. I pit everything back, still nothing. I unplugged all external cables and checked all internal ones. I also cleaned off the ram sticks. The same thing, power on with fans spinning, but no signal or usb. Any idea what the culprit may be?","solutions":["Yes, but I mean, if you do it all in turn is it only the last one that doesn't work?If you test a functional one in the 4th slot does it work? It is to know if it is the RAM or the slot which is defective. I don't know if I'm explaining myself well."]},{"symptom":"Pysical Ram not working        My physical memory is 8G but the computer is unable to use 3.98G of my physical memory. I have tried the guides online that say to change the virtual memory and to change the boot prosses but none of that worked to fix my problem. ","solutions":["By any chance, do you have the 32-bit version of Windows?","Hi CptDeathbringer, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.Do you know if you have installed a 32-bit version of Windows 10? If you are not sure, please go to: Start > Settings > System > About Then, under Device specifications > System type, see if you're running a 32-bit or 64-bit version of Windows.I am going to guess that it is a 32-bit version. If this is the case, you will need to perform a clean installation to move to the 64-bit version to utilize all your physical memory. Please ensure to back up all important files and settings before doing this!!If it is not the case, please reply and we can look into further suggestions. Regards, -Ashton","No it's a 64-Bit operating system, x64-based processor. So basicly its 64 bit system. It use to work fine but a quick back story is that last motherboard had a chip break off and caused it to die. So I got a new board and it posts but its saying that 3.98G is usable out of 8G","No it's a 64 bit system.","Does the BIOS \/ UEFI recognize the RAM as 8GB?","Hi Capt. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Type Resource in Search box, open Resource Manager, then Memory tab, post back a screenshot following this guide to capture a screenshot and attach it using Attach Image button in reply box:http:\/\/windows.microsoft.com\/en-us\/windows-10\/o... Now look at how much RAM is apportioned to hardware. If RAM is dedicated to a video card, this is sometimes adjustable in BIOS\/UEFI Setup. See here:https:\/\/smallbusiness.chron.com\/change-memory-a...https:\/\/www.thewindowsclub.com\/increase-dedicat...Test the RAM overnight to stress it with the best bootable test memtest86, following this guide to test both sticks and slots:https:\/\/www.wikihow.com\/Test-PC-RAM-with-MemTest86Run Crucial System Scanner to check the RAM is properly spec'd and configured: https:\/\/www.crucial.com\/usa\/en\/systemscanner?cm... Did you use the same Windows install with the motherboard swap? Type System Info in Start Search, open to see if the hardware and RAM is correctly listed.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","here is a photo of memory ","Yes, that confirms half of your RAM is apportioned to hardware, probably the Video card. I gave you ways to explore changing the apportionment if possible. If not then you can run Crucial System Scanner to check the RAM is properly spec'd and configured, what upgrade options exist for first quality RAM: https:\/\/www.crucial.com\/usa\/en\/systemscanner?cm... But you would not need to add RAM if it doesn't max out and hang with the 2gb it shows in reserve. That's not much though if you're idle when then screenshot was taken, so I'd either lessen the apportionment to video card if possible, or add RAM based on what the authoritative Crucial scan shows is possible.","I have a graphics card inside. Can that be part of the problem?","Yes, that's why I gave how to adjust memory apportioned to graphics card in my very first post.It's possible the card needs all that RAM so I also showed how to check if you can add RAM so that having 4gb dedicated to the card doesn't cause it to max out RAM ever."]},{"symptom":"hp creation        I try to open HP CREATIONS app and I can not used because the rocketlife server is not connecting","solutions":["Hi migdaliamendez, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.The problem you are experiencing, I think is related to the following, for cases similar to yours, I have verified in the HP forums, and they are effectively sharing the information of the statement.https:\/\/www8.hp.com\/us\/en\/ads\/print-projects\/ph...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"appt question        can i schedule an appt at the local microsoft store for help with windows 10 and my new dell laptop","solutions":["Hi Diane, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.Yes, you can schedule a service appointment with the Answer Desk or other service at your local Microsoft store.You can do so by finding your local Microsoft store here: https:\/\/www.microsoft.com\/en-us\/store\/locations...Then, clicking on the store that you wish to make an appointment for, and then you will see a blue button that says \"SCHEDULE SERVICE APPOINTMENT\".I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"How do I increase the time before screen locks?        How do I increase the time before screen locks?  Not trying to disable that feature completely just want to increase the time.","solutions":["Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.Right Click on start button Click on \"power options \" Then, click on \" Addiotional settings \" And click on \" change plan settings \" You can put the time you want.","I don't see additional settings  ","Hi, click \"on change setting \" like the picture below :-)","I have turn off display set to 3 hours yet lock screen is still like 5-10 min","In this same window click on 'choose when to turn off the display. Then click on 'change advanced power settings' And you will see a list of things to put to sleep choose what you want, ex: display, sleep, etc.","I can't find the lock screen setting","You want the computer to go to sleep, you mean? Or do you want the computer to go to sleep while in the lockscreen? Because I'm not sure what to ask","My computer goes to lock screen in like 5 min I would like to extend that time to say 30min","Ok, so in the menu where I told you to go you do not see the 'sleep mode' ??If your system is using the generic display driver, the Sleep option might also disappear from the Power Options menu. You need to download and install latest display driver from the manufacturers website.","So the thing is even though I set sleep to 2 hours it goes to lock screen very quickly like 5-10 min."]},{"symptom":"How to uncompress this file, MIME?        HelloRecently, Yahoo has closed its groups. They allowed people to download the content  though before the close. I received a file containing data such as below.I tried various techniques to open the files. The Outlook on my computer didn't have any mechanism to open the files. Notepad++ gave me English readable text plus a lot of text like below.Question: How do I view this in English? Do you have a script for me? What do I do?I remember years ago I had two scripts to encode data and decode data. I don't have those scripts!I've attached an image showing the names of the Yahoo files. They have \"mbox\"  in the filename. Two of the files were completely like the cryptic text below.Thank you,Data from one of the files:From ... Mon Jun 23 09:16:46 2014X-Deleted-Message: yesX-Deletion-Info: i=988;u=;t=1464438299;m=1892592101;s=2554111873;                                                                                                                                                                                                                                           From ... Wed Jul 30 09:44:22 2014Return-Path: <*** Email address is removed for privacy ***>Received: (qmail 77831 invoked by uid 102); 30 Jul 2014 16:44:21 -0000Received: from unknown (HELO mtaq6.grp.bf1.yahoo.com) (10.193.84.37)  by m17.grp.bf1.yahoo.com with SMTP; 30 Jul 2014 16:44:21 -0000Received: (qmail 30885 invoked from network); 30 Jul 2014 16:44:21 -0000Received: from unknown (HELO n1.bullet.mail.bf1.yahoo.com) (98.139.170.166)  by mtaq6.grp.bf1.yahoo.com with SMTP; 30 Jul 2014 16:44:21 -0000DKIM-Signature: v=1; a=rsa-sha256; c=relaxed\/relaxed; d=yahoogroups.com; s=echoe; t=1406738661; bh=tlKKCTQocg2CI7rsAXykZXGBfgSg11B2pCI2LhcqYzE=; h=Received:Received:Received:X-Sender:X-Apparently-To:X-Received:X-Received:X-Received:X-Received:X-Received:X-Received:Date:X-Received:Message-ID:X-Original-Return-Path:X-Mailer:MIME-Version:X-Yahoo-Newman-Property:Content-Type:X-Originating-IP:X-eGroups-Msg-Info:X-Yahoo-Post-IP:X-Original-Reply-To:Subject:X-Yahoo-Group-Post:X-Yahoo-Profile:X-YGroups-SubInfo:From:X-Original-From:Reply-To:Return-Path:To:Sender:X-Yahoo-Newman-Property:X-Yahoo-Newman-Id:X-eGroups-Approved-By:X-eGroups-Auth; b=e1d\/YV\/9AGTgwlhnMYKMHJVfuzBAzp9UVhsGmKZhy9RDdEzP\/bfMXi7ugdDAQEx6lABLCOaaSJkAVkxWgnZhh3xjlxgvKilwmjXtkDi7ApsqTp16fOvxZ39op4NOj8m1DC9LFaYv9lYw2pdDfhHOMybFF4m6sQ0mrZRvuuZKJB4=Received: from [72.30.235.64] by n1.bullet.mail.bf1.yahoo.com with NNFMP; 30 Jul 2014 16:44:21 -0000Received: from [10.193.75.125] by t1.bullet.mail.bf1.yahoo.com with NNFMP; 30 Jul 2014 16:44:21 -0000Received: from [127.0.0.1] by gapi4.grp.bf1.yahoo.com with NNFMP; 30 Jul 2014 16:44:21 -0000X-Sender: *** Email address is removed for privacy ***X-Apparently-To: *** Email address is removed for privacy ***X-Received: (qmail 67207 invoked by uid 102); 14 Jul 2014 07:04:14 -0000X-Received: from unknown (HELO mtaq2.grp.bf1.yahoo.com) (10.193.84.33)  by m15.grp.bf1.yahoo.com with SMTP; 14 Jul 2014 07:04:14 -0000X-Received: (qmail 27355 invoked from network); 14 Jul 2014 07:04:14 -0000X-Received: from unknown (HELO n3-vm8.bullet.mail.bf1.yahoo.com) (72.30.235.44)  by mtaq2.grp.bf1.yahoo.com with SMTP; 14 Jul 2014 07:04:14 -0000X-Received: from [66.196.81.179] by n3.bullet.mail.bf1.yahoo.com with NNFMP; 14 Jul 2014 07:04:14 -0000X-Received: from [10.193.242.232] by t9.bullet.mail.bf1.yahoo.com with NNFMP; 14 Jul 2014 07:04:14 -0000Date: 14 Jul 2014 00:04:14 -0700X-Received: from [127.0.0.1] by gapi1.grp.bf1.yahoo.com with NNFMP; 14 Jul 2014 07:04:14 -0000Message-ID: <*** Email address is removed for privacy ***>X-Original-Return-Path: ...X-Mailer: Yahoo Groups Message PosterMIME-Version: 1.0X-Yahoo-Newman-Property: groups-composeContent-Type: multipart\/alternative; boundary=\"9nlWnTS9ocNmxdhsK3FKVLWiM6a5jwOaA8HvrLV\"X-Originating-IP: 238.172.209.165X-eGroups-Msg-Info: 1:12:0:0:0X-Yahoo-Post-IP: 238.172.209.165X-Original-Reply-To: ...Subject: Facebook (Wk of July 6, 2014): Sample Article Marine Intro.X-Yahoo-Group-Post: member; u=367227004; y=UE5ZKGROOhmlBJ7XCZnpAJiLwJYlBWTdvgQEIPFjeNi9Z7uJIfvBX-Yahoo-Profile: chrislusardiX-Original-From: ...Reply-To: ...X-Original-Return-Path: ...To: *** Email address is removed for privacy ***X-Yahoo-Newman-Property: groups-systemX-Yahoo-Newman-Id: groups-systemX-eGroups-Approved-By: santosfe via web; 30 Jul 2014 09:44:21 -0000From: ...--9nlWnTS9ocNmxdhsK3FKVLWiM6a5jwOaA8HvrLVContent-Transfer-Encoding: base64Content-Type: text\/plain; charset=\"UTF-8\"UmVmZXJlbmNlOiBQbGVhc2Ugc2VlIHRoZSBGYWNlYm9vayBOZXcgTWVtYmVyIEdyb3VwIEluZm9ybWF0aW9uIHBhZ2UgZm9yICJBc3Ryb25hdXQgSG9wZWZ1bHMiIGF0Og0KIGh0dHBzOi8vd3d3LmZhY2Vib29rLmNvbS9ncm91cHMvMjUyOTk2NzA0NzM2OTU1Lg0KIA0KRllJOiBBIGdvb2QgZWxvcXVlbnQgbWVzc2FnZSB2aWEgRmFjZWJvb2sgKHRvIHRoZSBhZG1pbmlzdHJhdG9yKSBpcyB1c3VhbGx5IHJlcXVpcmVkIHRvIGdhaW4gZW50cmFuY2UgaW50byB0aGUgZ3JvdXAsIHBsZWFzZSBzZW5kLiBBcnRpY2xlcyBtYXJrZWQgIlJFUE9TVEVEIiBoYXZlIGJlZW4gcG9zdGVkIHRvIHRoZSB5YWhvbyBncm91cCBtb3JlIHRoYW4gb25jZS4gVGhleSBoYXZlIGJlZW4gcG9zdGVkIGFnYWluIGJlY2F1c2UgRmFjZWJvb2sgbWVtYmVycyBoYXZlIGFkZGVkIG5ldyBjb21tZW50cy4gVGhlIGFydGljbGVzIGZyb20gQW5ub24gYXJlIGF1dGhvcmVkIGJ5IHBlb3BsZSB3aG8gY2hvb3NlIHRvIHBvc3QgYW5vbnltb3VzbHkuDQogVGhlcmUgYXJlIGN1cnJlbnRseSAxODAgbWVtYmVycyBpbiB0aGUgRmFjZWJvb2sgZ3JvdXAuDQogVGhlIGdyb3VwIGhhcyBtYW55IHBvc3RzIGZyb20gd3d3LmFzaG9zLm9yZy4gSGVyZSBhcmUgc29tZSBleGFtcGxlczoNCiANCg0KIFNBTVBMRToNCiANCg0KIFtBcnRpY2xlIDEgb2YgMV0gRnJvbSBDaHJpc3RvcGhlciBMdXNhcmRpOiANCiANCg0KIENBVkVBVDogREFURUQgSU5GT1JNQVRJT04gVEhBVCBNQVkgTk8gTE9OR0VSIEJFIFJFTEVWQU5UDQogDQoNCiBGcm9tOiBDYXJsb3MgTm9yaWVnYQ0KRGF0ZTogV2VkLCAyNiBPY3QgOTQgMDg6Mjc6MTkgSlNUDQpTdWJqZWN0OiBBIE1hcmluZSBBcy1IbyBCaW8NCiANCg0KIE5vdyB0aGF0IEkndmUgZmluYWxseSBtYW5hZ2VkIHRvIGdldCBteXNlbGYgb24gdGhlIGxpc3QgSSdkIGxpa2UgdG8gdGVsbCB5b3UgYSBsaXR0bGUgYWJvdXQgbXlzZWxmLg0KIA0KDQogSSBhbSBhIE1hcmluZSBDb3JwcyBNYWpvciBhbmQgSSBmbHkgQ0gtNDZFIGhlbGljb3B0ZXJzLiBJIHdhcyBub21pbmF0ZWQgZm9yIE1pc3Npb24gU3BlY2lhbGlzdCBieSB0aGUgTWFyaW5lIENvcnBzIHRvIE5BU0Egb3ZlciBhIHllYXIgYW5kIGEgaGFsZiBhZ28uIEkgaGFkIHRoZSBob25vciBvZiBiZWluZyBzZWxlY3RlZCBhcyBhIGZpbmFsaXN0IHRoaXMgc3VtbWVyIGFuZCB3YXMgd2l0aCB0aGUgZmlyc3QgZ3JvdXAgb2YgaW50ZXJ2aWV3ZWVzIG9uIHRoZSBsYXN0IHdlZWsgb2YgSnVuZS4gVGhhdCBpcyB3aGVyZSBJIGxlYXJuZWQgdGhhdCBJIHdhcyBhbiAiQXMtSG8iLiBJJ20gc3VyZSBJIGtub3cgcGVvcGxlIHRoYXQgYWxyZWFkeSB0aGluayB0aGF0IG9mIG1lIGFueXdheSENCiANCg0KIEEgbGl0dGxlIGJhY2tncm91bmQgb24gbXlzZWxmOiBJIHdhcyBib3JuIGluIFBlcnUgaW4gMTk1OSBhbmQgY2FtZSB0aGUgVVMgaW4gMTk2NS4gSSBncmV3IHVwIGluIHdoYXQgaXMgbm93IFNpbGljb24gVmFsbGV5IChTYW50YSBDbGFyYSkgQ2FsaWZvcm5pYS4gSSBhdHRlbmRlZCB0aGUgVW5pdmVyc2l0eSBvZiBTb3V0aGVybiBDYWxpZm9ybmlhIChTZXAgNzcgLSBKYW4gODEpIG9uIGFuIE5ST1RDIHNjaG9sYXJzaGlwLiBJIGVhcm5lZCBteSBCUyBpbiBDb21wdXRlciBTY2llbmNlIGF0IFVTQy4gSSB3YXMgdGhlbiBpbW1lZGlhdGVseSBjb21taXNzaW9uZWQgYSAybmQgTHQgYW5kIGVtYmFya2VkIG9uIG15IG1pbGl0YXJ5IGNhcmVlciB3aGljaCBjb25zaXN0ZWQgcHJpbWFyaWx5IHdpdGggZmx5aW5nLiBJbiAxOTg4LCBJIHdhcyBzZW50IHRoZSBOYXZhbCBQb3N0Z3JhZHVhdGUgU2Nob29sIHRvIGVhcm4gYW4gTVMgaW4gU3BhY2UgT3BlcmF0aW9ucy4gSW4gbXkgdHdvIHllYXJzIHRoZXJlIEkgYWxzbyBwaWNrZWQgdXAgbXkgTVMgaW4gQ29tcHV0ZXIgU2NpZW5jZS4gVXAgdG8gdGhpcyBwb2ludCBJIGhhZCAxMCB5ZWFycyBzaW5jZSBnZXR0aW5nIG15IEJTIGluIENvbXB1dGVyIFNjaWVuY2UgYW5kIGhhZCBuZXZlciB0b3VjaGVkIGEgY29tcHV0ZXIgaW4gYW55IGNhcGFjaXR5IG9uIGFjdGl2ZSBkdXR5LiBJIHdhcyB0aGVuIGFzc2lnbmVkIHRvIFVTIFNwYWNlIENvbW1hbmQgaW4gQ29sb3JhZG8gU3ByaW5ncyBhbmQgd29ya2VkIGluc2lkZSBDaGV5ZW5uZSBNb3VudGFpbi4gSSB3YXMgcXVhbGlmaWVkIGFzIGEgU3BhY2UgU3VydmVpbGxhbmNlIENlbnRlciBDb21tYW5kZXIgYnV0IG15IG1haW4gZHV0aWVzIGludm9sdmVkIHByb3ZpZGluZyBjb21wdXRlciBzb2Z0d2FyZS9oYXJkd2FyZSBmb3Igb3VyIGFuYWx5c3RzLiBPbmUgb2YgdGhlIHJlYWwgaXJvbmllcyBoZXJlIHdhcyB0aGF0IHlvdSBoYWQgYSBNYXJpbmUgKG5vdCBuZWNlc3NhcmlseSBrbm93biBmb3IgdGhlaXIgaGlnaCBpbnRlbGxpZ2VuY2UgYW5kIHRlY2huaWNhbCBleHBlcnRpc2UpIG1hbmFnaW5nIG1hbnkgYWNxdWlzaXRpb25zIGFuZCBkZXZlbG9wbWVudCBwcm9qZWN0cyBhdCBVUyBTcGFjZSBDb21tYW5kLCBhIHBsYWNlIHdoaWNoIHJlbGllcyBleHRlbnNpdmVseSBvbiB0aGUgQWlyIEZvcmNlICh0aGUgc21hcnQgc2VydmljZSEpIGZvciBleHBlcnRpc2UuIEZvbGxvd2luZyBteSBqb2ludCB0b3VyLCBJIHJldHVybmVkIHRvIHRoZSByZWFsIE1hcmluZSBDb3JwcyB3aGVyZSBJIGFtIG5vdyBzdGF0aW9uZWQgaW4gT2tpbmF3YSB3aXRoIG15IHdpZmUsIGZpdmUga2lkcyAoYWdlcyAxMywgMTAsIDIsIDIgYW5kIDIpIGFuZCB0d28gZG9ncy4gSSB3b3JrIGF0IHRoZSBoZWFkcXVhcnRlcnMgZm9yIHRoZSAxc3QgTWFyaW5lIEFpciBXaW5nIGFuZCBoYXZlIHJlc3VtZWQgZmx5aW5nLg0KIA0KDQogSG93IGRpZCBJIGdldCBhcyBmYXIgYXMgSSBkaWQgd2l0aCBOQVNBPyBJJ20gbm90IHN1cmUuIE15IGRlZ3JlZXMgYXJlIHdoYXQgc29tZSBwZW9wbGUgd291bGQgY29uc2lkZXIgInNvZnQiIGFuZCBJIG9ubHkgaGF2ZSBhIGNvdXBsZSB5ZWFycyBvZiBleHBlcmllbmNlIGluIHRob3NlIGFyZWFzLiBXaGlsZSBiZWluZyBpbnRlcnZpZXdlZCwgSSB3YXMgdG9sZCB0aGF0IG9uZSBvZiB0aGUgYmlnIGZhY3RvcnMgd2FzIG15IGFiaWxpdHkgdG8gYWRhcHQgdG8gZGlmZmVyZW50IG9wZXJhdGlvbmFsIGFuZCBhY2FkZW1pYyBlbnZpcm9ubWVudHMgd2l0aCBncmVhdCBzdWNjZXNzLiBJIGd1ZXNzIHRoZSBmYWN0IHRoYXQgYWxsIHRocmVlIG9mIG15IGRlZ3JlZXMgYXMgd2VsbCBhcyBmbGlnaHQgc2Nob29sIGdyYWR1YXRpb24gd2VyZSB3aXRoIGhvbm9ycyBhbHNvIGhlbHBlZC4NCiBJIGFtIG5vdyBydW5uaW5nIG91dCBvZiBmaW5nZXJuYWlscyBhbmQgZXZlcnlvbmUgaW4gbXkgaG91c2UgaXMgYWZyYWlkIG9mIGJlaW5nIGJldHdlZW4gbWUgYW5kIHRoZSBwaG9uZSB3aGVuIGl0IHJpbmcgZm9yIGZlYXIgb2YgYmVpbmcgdHJhbXBsZWQuIEFjY29yZGluZyB0aGUgc2VsZWN0aW9uIG9mZmljZSwgdGhleSBhcmUgaG9waW5nIHRvIHJlbGVhc2UgVEhFIExJU1QgYXQgdGhlIGVuZCBvZiB0aGUgbW9udGguDQogDQoNCiBJJ2QgbGlrZSB0byBmaW5pc2ggYnkgc2F5aW5nIHRoYXQgSSBhbSBob25vcmVkIHRvIGhhdmUgZ290dGVuIHRoaXMgZmFyLiBBbHRob3VnaCBpdCB3aWxsIGJlIGEgZ3JlYXQgZGlzYXBwb2ludG1lbnQgaWYgSSBhbSBub3Qgb24gdGhlIGxpc3QsIEkgd2lsbCBzdGlsbCBiZSBwcm91ZCBvZiB0aGUgZmFjdCB0aGF0IEkgZ290IHRoaXMgZmFyIG9uIG15IGZpcnN0IHRyeSBhbmQgSSB3aWxsIGdvIG9uIGxpdmluZyAoYW5kIGFwcGx5aW5nISEpDQogDQoNCiBDYXJsb3MgTm9yaWVnYQ0KTWFyaW5lIEFzLUhvDQogDQoNCiBUaGUgYXJ0aWNsZSBjYW1lIGZyb206DQpodHRwOi8vd2ViLmFyY2hpdmUub3JnL3dlYi8yMDA1MDMwODA1MTUyMS9odHRwOi8vd3d3LmFzaG9zLm9yZy9hc3Ryb19lcG9zdGluZ3MuaHRtbA0KIA0KSnVseSA4IGF0IDExOjEzcG0NCg0K--9nlWnTS9ocNmxdhsK3FKVLWiM6a5jwOaA8HvrLVContent-Transfer-Encoding: base64Content-Type: text\/html; charset=\"UTF-8\"PHA+PHNwYW4+PGVtPlJlZmVyZW5jZTogUGxlYXNlIHNlZSB0aGUgRmFjZWJvb2sgTmV3IE1lbWJlciBHcm91cCBJbmZvcm1hdGlvbiBwYWdlIGZvciAmcXVvdDtBc3Ryb25hdXQgSG9wZWZ1bHMmcXVvdDsgYXQ6PC9lbT48L3NwYW4+PC9wPjxwPjxzcGFuPjxlbT5odHRwczovL3d3dy5mYWNlYm9vay5jb20vZ3JvdXBzLzI1Mjk5NjcwNDczNjk1NS48YnI+Jm5ic3A7PGJyPkZZSTogQSBnb29kIGVsb3F1ZW50IG1lc3NhZ2UgdmlhIEZhY2Vib29rICh0byB0aGUgYWRtaW5pc3RyYXRvcikgaXMgdXN1YWxseSByZXF1aXJlZCB0byBnYWluIGVudHJhbmNlIGludG8gdGhlIGdyb3VwLCBwbGVhc2Ugc2VuZC4gQXJ0aWNsZXMgbWFya2VkICZxdW90O1JFUE9TVEVEJnF1b3Q7IGhhdmUgYmVlbiBwb3N0ZWQgdG8gdGhlIHlhaG9vIGdyb3VwIG1vcmUgdGhhbiBvbmNlLiBUaGV5IGhhdmUgYmVlbiBwb3N0ZWQgYWdhaW4gYmVjYXVzZSBGYWNlYm9vayBtZW1iZXJzIGhhdmUgYWRkZWQgbmV3IGNvbW1lbnRzLiBUaGUgYXJ0aWNsZXMgZnJvbSBBbm5vbiBhcmUgYXV0aG9yZWQgYnkgcGVvcGxlIHdobyBjaG9vc2UgdG8gcG9zdCBhbm9ueW1vdXNseS48L2VtPjwvc3Bhbj48L3A+PHA+PHNwYW4+PGVtPlRoZXJlIGFyZSBjdXJyZW50bHkgMTgwIG1lbWJlcnMgaW4gdGhlIEZhY2Vib29rIGdyb3VwLjwvZW0+PC9zcGFuPjwvcD48cD48c3Bhbj48ZW0+VGhlIGdyb3VwIGhhcyBtYW55IHBvc3RzIGZyb20gd3d3LmFzaG9zLm9yZy4gSGVyZSBhcmUgc29tZSBleGFtcGxlczo8L2VtPjwvc3Bhbj48L3A+PHA+PHNwYW4+PGJyPjwvc3Bhbj48L3A+PHA+PHNwYW4+U0FNUExFOjwvc3Bhbj48L3A+PHA+PHNwYW4+PGJyPjwvc3Bhbj48L3A+PHA+PHNwYW4+W0FydGljbGUgMSBvZiAxXSBGcm9tIENocmlzdG9waGVyIEx1c2FyZGk6IDwvc3Bhbj48L3A+PHA+PHNwYW4+PGJyPjwvc3Bhbj48L3A+PHA+PHNwYW4+Q0FWRUFUOiBEQVRFRCBJTkZPUk1BVElPTiBUSEFUIE1BWSBOTyBMT05HRVIgQkUgUkVMRVZBTlQ8L3NwYW4+PC9wPjxwPjxzcGFuPjxicj48L3NwYW4+PC9wPjxwPjxzcGFuPkZyb206IENhcmxvcyBOb3JpZWdhPGJyPkRhdGU6IFdlZCwgMjYgT2N0IDk0IDA4OjI3OjE5IEpTVDxicj5TdWJqZWN0OiBBIE1hcmluZSBBcy1IbyBCaW88L3NwYW4+PC9wPjxwPjxzcGFuPjxicj48L3NwYW4+PC9wPjxwPjxzcGFuPk5vdyB0aGF0IEkmIzM5O3ZlIGZpbmFsbHkgbWFuYWdlZCB0byBnZXQgbXlzZWxmIG9uIHRoZSBsaXN0IEkmIzM5O2QgbGlrZSB0byB0ZWxsIHlvdSBhIGxpdHRsZSBhYm91dCBteXNlbGYuPC9zcGFuPjwvcD48cD48c3Bhbj48YnI+PC9zcGFuPjwvcD48cD48c3Bhbj5JIGFtIGEgTWFyaW5lIENvcnBzIE1ham9yIGFuZCBJIGZseSBDSC00NkUgaGVsaWNvcHRlcnMuIEkgd2FzIG5vbWluYXRlZCBmb3IgTWlzc2lvbiBTcGVjaWFsaXN0IGJ5IHRoZSBNYXJpbmUgQ29ycHMgdG8gTkFTQSBvdmVyIGEgeWVhciBhbmQgYSBoYWxmIGFnby4gSSBoYWQgdGhlIGhvbm9yIG9mIGJlaW5nIHNlbGVjdGVkIGFzIGEgZmluYWxpc3QgdGhpcyBzdW1tZXIgYW5kIHdhcyB3aXRoIHRoZSBmaXJzdCBncm91cCBvZiBpbnRlcnZpZXdlZXMgb24gdGhlIGxhc3Qgd2VlayBvZiBKdW5lLiBUaGF0IGlzIHdoZXJlIEkgbGVhcm5lZCB0aGF0IEkgd2FzIGFuICZxdW90O0FzLUhvJnF1b3Q7LiBJJiMzOTttIHN1cmUgSSBrbm93IHBlb3BsZSB0aGF0IGFscmVhZHkgdGhpbmsgdGhhdCBvZiBtZSBhbnl3YXkhPC9zcGFuPjwvcD48cD48c3Bhbj48YnI+PC9zcGFuPjwvcD48cD48c3Bhbj5BIGxpdHRsZSBiYWNrZ3JvdW5kIG9uIG15c2VsZjogSSB3YXMgYm9ybiBpbiBQZXJ1IGluIDE5NTkgYW5kIGNhbWUgdGhlIFVTIGluIDE5NjUuIEkgZ3JldyB1cCBpbiB3aGF0IGlzIG5vdyBTaWxpY29uIFZhbGxleSAoU2FudGEgQ2xhcmEpIENhbGlmb3JuaWEuIEkgYXR0ZW5kZWQgdGhlIFVuaXZlcnNpdHkgb2YgU291dGhlcm4gQ2FsaWZvcm5pYSAoU2VwIDc3IC0gSmFuIDgxKSBvbiBhbiBOUk9UQyBzY2hvbGFyc2hpcC4gSSBlYXJuZWQgbXkgQlMgaW4gQ29tcHV0ZXIgU2NpZW5jZSBhdCBVU0MuIEkgd2FzIHRoZW4gaW1tZWRpYXRlbHkgY29tbWlzc2lvbmVkIGEgMm5kIEx0IGFuZCBlbWJhcmtlZCBvbiBteSBtaWxpdGFyeSBjYXJlZXIgd2hpY2ggY29uc2lzdGVkIHByaW1hcmlseSB3aXRoIGZseWluZy4gSW4gMTk4OCwgSSB3YXMgc2VudCB0aGUmbmJzcDtOYXZhbCBQb3N0Z3JhZHVhdGUgU2Nob29sIHRvIGVhcm4gYW4gTVMgaW4gU3BhY2UgT3BlcmF0aW9ucy4gSW4gbXkgdHdvIHllYXJzIHRoZXJlIEkgYWxzbyBwaWNrZWQgdXAgbXkgTVMgaW4gQ29tcHV0ZXIgU2NpZW5jZS4gVXAgdG8gdGhpcyBwb2ludCBJIGhhZCAxMCB5ZWFycyBzaW5jZSBnZXR0aW5nIG15IEJTIGluIENvbXB1dGVyIFNjaWVuY2UgYW5kIGhhZCBuZXZlciB0b3VjaGVkIGEgY29tcHV0ZXIgaW4gYW55IGNhcGFjaXR5IG9uIGFjdGl2ZSBkdXR5LiBJIHdhcyB0aGVuIGFzc2lnbmVkIHRvIFVTIFNwYWNlIENvbW1hbmQgaW4gQ29sb3JhZG8gU3ByaW5ncyBhbmQgd29ya2VkIGluc2lkZSBDaGV5ZW5uZSBNb3VudGFpbi4gSSB3YXMgcXVhbGlmaWVkIGFzIGEgU3BhY2UgU3VydmVpbGxhbmNlIENlbnRlciBDb21tYW5kZXIgYnV0IG15IG1haW4gZHV0aWVzIGludm9sdmVkIHByb3ZpZGluZyBjb21wdXRlciBzb2Z0d2FyZS9oYXJkd2FyZSBmb3Igb3VyIGFuYWx5c3RzLiBPbmUgb2YgdGhlIHJlYWwgaXJvbmllcyBoZXJlIHdhcyB0aGF0IHlvdSBoYWQgYSBNYXJpbmUgKG5vdCBuZWNlc3NhcmlseSBrbm93biBmb3IgdGhlaXIgaGlnaCBpbnRlbGxpZ2VuY2UgYW5kIHRlY2huaWNhbCBleHBlcnRpc2UpIG1hbmFnaW5nIG1hbnkgYWNxdWlzaXRpb25zIGFuZCBkZXZlbG9wbWVudCBwcm9qZWN0cyBhdCBVUyBTcGFjZSBDb21tYW5kLCBhIHBsYWNlIHdoaWNoIHJlbGllcyBleHRlbnNpdmVseSBvbiB0aGUgQWlyIEZvcmNlICh0aGUgc21hcnQgc2VydmljZSEpIGZvciBleHBlcnRpc2UuIEZvbGxvd2luZyBteSBqb2ludCB0b3VyLCBJIHJldHVybmVkIHRvIHRoZSByZWFsIE1hcmluZSBDb3JwcyB3aGVyZSBJIGFtIG5vdyBzdGF0aW9uZWQgaW4gT2tpbmF3YSB3aXRoIG15IHdpZmUsIGZpdmUga2lkcyAoYWdlcyAxMywgMTAsIDIsIDIgYW5kIDIpIGFuZCB0d28gZG9ncy4gSSB3b3JrIGF0IHRoZSBoZWFkcXVhcnRlcnMgZm9yIHRoZSAxc3QgTWFyaW5lIEFpciBXaW5nIGFuZCBoYXZlIHJlc3VtZWQgZmx5aW5nLjwvc3Bhbj48L3A+PHA+PHNwYW4+PGJyPjwvc3Bhbj48L3A+PHA+PHNwYW4+SG93IGRpZCBJIGdldCBhcyBmYXIgYXMgSSBkaWQgd2l0aCBOQVNBPyBJJiMzOTttIG5vdCBzdXJlLiBNeSBkZWdyZWVzIGFyZSB3aGF0IHNvbWUgcGVvcGxlIHdvdWxkIGNvbnNpZGVyICZxdW90O3NvZnQmcXVvdDsgYW5kIEkgb25seSBoYXZlIGEgY291cGxlIHllYXJzIG9mIGV4cGVyaWVuY2UgaW4gdGhvc2UgYXJlYXMuIFdoaWxlIGJlaW5nIGludGVydmlld2VkLCBJIHdhcyB0b2xkIHRoYXQgb25lIG9mIHRoZSBiaWcgZmFjdG9ycyB3YXMgbXkgYWJpbGl0eSB0byBhZGFwdCB0byBkaWZmZXJlbnQgb3BlcmF0aW9uYWwgYW5kIGFjYWRlbWljIGVudmlyb25tZW50cyB3aXRoIGdyZWF0IHN1Y2Nlc3MuIEkgZ3Vlc3MgdGhlIGZhY3QgdGhhdCBhbGwgdGhyZWUgb2YgbXkgZGVncmVlcyBhcyB3ZWxsIGFzIGZsaWdodCBzY2hvb2wgZ3JhZHVhdGlvbiB3ZXJlIHdpdGggaG9ub3JzIGFsc28gaGVscGVkLjwvc3Bhbj48L3A+PHA+PHNwYW4+SSBhbSBub3cgcnVubmluZyBvdXQgb2YgZmluZ2VybmFpbHMgYW5kIGV2ZXJ5b25lIGluIG15IGhvdXNlIGlzIGFmcmFpZCBvZiBiZWluZyBiZXR3ZWVuIG1lIGFuZCB0aGUgcGhvbmUgd2hlbiBpdCByaW5nIGZvciBmZWFyIG9mIGJlaW5nIHRyYW1wbGVkLiBBY2NvcmRpbmcgdGhlIHNlbGVjdGlvbiBvZmZpY2UsIHRoZXkgYXJlIGhvcGluZyB0byByZWxlYXNlIFRIRSBMSVNUIGF0IHRoZSBlbmQgb2YgdGhlIG1vbnRoLjwvc3Bhbj48L3A+PHA+PHNwYW4+PGJyPjwvc3Bhbj48L3A+PHA+PHNwYW4+SSYjMzk7ZCBsaWtlIHRvIGZpbmlzaCBieSBzYXlpbmcgdGhhdCBJIGFtIGhvbm9yZWQgdG8gaGF2ZSBnb3R0ZW4gdGhpcyBmYXIuIEFsdGhvdWdoIGl0IHdpbGwgYmUgYSBncmVhdCBkaXNhcHBvaW50bWVudCBpZiBJIGFtIG5vdCBvbiB0aGUgbGlzdCwgSSB3aWxsIHN0aWxsIGJlIHByb3VkIG9mIHRoZSBmYWN0IHRoYXQgSSBnb3QgdGhpcyBmYXIgb24gbXkgZmlyc3QgdHJ5IGFuZCBJIHdpbGwgZ28gb24gbGl2aW5nIChhbmQgYXBwbHlpbmchISk8L3NwYW4+PC9wPjxwPjxzcGFuPjxicj48L3NwYW4+PC9wPjxwPjxzcGFuPkNhcmxvcyBOb3JpZWdhPGJyPk1hcmluZSBBcy1Ibzwvc3Bhbj48L3A+PHA+PHNwYW4+PGJyPjwvc3Bhbj48L3A+PHA+PHNwYW4+VGhlIGFydGljbGUgY2FtZSBmcm9tOjxicj5odHRwOi8vd2ViLmFyY2hpdmUub3JnL3dlYi8yMDA1MDMwODA1MTUyMS9odHRwOi8vd3d3LmFzaG9zLm9yZy9hc3Ryb19lcG9zdGluZ3MuaHRtbDwvc3Bhbj48L3A+PHA+PHNwYW4+PGJyPkp1bHkgOCBhdCAxMToxM3BtPGJyPjwvc3Bhbj48L3A+","solutions":["Hello! I am an Independent Advisor, I would love to help you out! Try downloading winzip. Then open the file within winzip and unzip the file. Does this work?","This is an image showing the filenames.","Hello,I forgot to mention one step in my explanation. I had something like Winzip already installed on my computer.When I download and use Winzip, I get the files shown in the below attached image. Basically, the files are the same as the first image that I attached.What do I do?Thanks,","The contents of the Winzip files are the same as my first posting.Thanks for any help","The .mbox file you should be able to import with thunderbird potentially. Otherwise there are mbox to PST converters. You could convert it to a PST and then import it into outlook as a PST.","Thunderbird opened the first file (4743615.mbox) up exactly like notepad++ did. I.E.: It appears to be exactly as I posted in the first posting. There was the same human readable content and there also seems to be content that requires some script to be run on it to be readable.The other two Yahoo mbox files were opened by Thunderbird and revealed human readable content. Interestingly enough in Thunderbird, they were very short files in readable English. But, the size of the 4743615.mbox.00002 file is the same size as the 4743615.mbox file which was like 192k lines long. That seems strange and indicates loss of data!I went ahead and tried saving the cryptic data in my first posting to a file named test.mbox and loading that into Thunderbird. The file was shown with the cryptic text and wasn't human readable.Thanks,","Hi Christopher, you need to select each part of encoded text and paste it into https:\/\/www.base64decode.org\/ site. Seems both documents in your listing are from Carlos Noriega, isn't it?","Hi Christopher, you need to select each part of encoded text and paste it into https:\/\/www.base64decode.org\/ site. Seems both documents in your listing are from Carlos Noriega, isn't it? Yes, it's from Carlos Noriega.","Was you successed in file recovery? Right now I've copied your data to new file with eml extension and my Outlook 2019 successfully opened this file:","I use aol to read email.My Outlook is Version 16005.12228.20356.0. I don't see an import option available.There has to be an easier way to load a large file into a program and view the contents in English. Doing it individually one by one is extremely slow, too slow!Christopher Lusardi"]}]}