{"windows":[{"symptom":"Problems updating Windows        I have problems updating, I even tried to update the computer and received the code: 0x8024a112My computer is an HP pavilion 500-p050 desktop PCI bought it and set it up a week ago, and now I'm having this problem, please help!","solutions":["Hi, Jessicabelcher1 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.If you have problems updating Windows, follow these steps: If you have a third-party antivirus, you must disable or uninstall it. Try reset Windows update components: Right click on the start button and select Powershell (admin) or Command Prompt (admin)Write the next hit enter after each line. net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Restart and try again. You can also download the Windows Error Solver: https:\/\/support.microsoft.com\/en-us\/help\/10164\/...https:\/\/aka.ms\/wudiag You can do it manually by downloading the Windows ISO. When updating with the ISO, disconnect the Internet. https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"BSOD and Freezing        Hi,I have a pretty high end gaming laptop for years now and since a month i get sometimes an BSOD with the stoppcode \"internal video schedule error\". After the computer than restarts after 1 minute it completly freezes and i have to manualy restart it the freezing keeps happening until i reset the computer.I got my pc checked and there are no hardware problems it also runs fine on linux.Thanks in advance Simon","solutions":["Hi Simon, Most likely this is caused by your video card device driver, however, to diagnose the underlying issue, I need to analyse your Mini-dump file(s):Open Windows File Explorer Navigate to C:\\Windows\\Minidump Copy any minidump files onto your Desktop, then zip those up Upload the zip file to the Cloud (OneDrive, DropBox . . . etc.), then choose to share those and get a share linkThen post the link here to the zip file, so we can take a look for you . . .","Here is the dropbox link.https:\/\/www.dropbox.com\/s\/6vo4m9hy4wzphlu\/dmp.zip?dl=0i dont think its the graphic card driver because its up to date","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Internal video schedule error occurs due to graphics driver error. Please reset the Graphics Driver and observe the PC. Go to Device Manager Locate Display Adapter Double tap on it. Right click on the Graphics Driver and select Uninstall. (Do Not click on any check box)Restart the PC.","i did it and for a day it worked but now i get exactly the same thing"]},{"symptom":"Windows 10 \/ Raid 1:  \"Optimize\" shows HDD, NOT installed SSD's        I HAVE NOT RECEIVED A COMPLETE ANSWER TO THIS QUESTION:  PLEASE, HELP!In my new Windows 10 desktop computer, (RAID 1, Two SSD's), I see Optimize shows \"Hard Disk Drive\", NOT \"SSD\", and I want to be sure defragmentation is not applied to these drives, instead of the proper TRIM utility.  What need I do?  I found a reply for this regarding Windows 8, but not sure how to proceed in Windows 10: \"Created on October 30, 2013 SSDs Showing up as HDD in system - Windows 8.1 GA\/RTM I had this issue during the preview and it appears to happen again in the final version of 8.1 as well. Somehow the system is incorrectly registering my 2x RAID SDDs as HDDs, which thus during the weekly \"Optimization\" runs a defragmentation on them instead correctly running TRIM instead. Which is quite frustrating to see it's still in the final product. In my preview thread the suggestion to fix this was to run WinSAT (Windows System Assessment Tool) from Powershell. It worked during the preview to correctly identify my SSDs and it appears to work in the final version as well. The description on how to run it from my previous thread: \"Usually the detection of SSDs can be forced by running the Windows Experience Index (= WEI, file name: WINSAT.EXE). You may have to run Windows Experience Index to force windows to detect RAID SSD in Windows 8.1.2013 Follow these steps:a.     Press “Windows key + W” from the keyboard.b.     Type “Administrative tools” without quotes in the search box.c.     Select “Administrative tools” option from the list.d.     Then right click on “Windows PowerShell ISE” and select “Run as Administrator” option.e.     Type “WinSAT diskformal” without quotes in the PowerShell and hit Enter.“Win8.1 Preview - Manual execution of the Windows Experience Index.png - Bild entfernt (keine Rechte)”.f.      Close “Windows PowerShell” and run Windows Optimization.g.     This should detect “RAID configured SSD on Windows 8.1.\" I highly suggest if you have SSDs, especially in RAID, that you check the Optimize Drives interface to see if it's correctly identifying your drives and if it isn't to run WinSAT diskformal from PowerShell.\"In reply to Sumit (Independent Advisor)'s post on January 5, 2020 How can I verify\/be certain?  In the Windows 8 advice, copied from the Microsoft Community, you see there can be an issue especially in RAID (1) configuration, where the hard drive(s) are not recognized as SSD, and a corrective procedure is given (for Windows 8, but I have Windows 10).  Is there some equivalent method to confirm my SSD's are receiving TRIM, not Defragment?  I ran \"optimize\" manually, and to my eyes, the process looked exactly like the \"defragment\" I've run for years on my old, Windows 7 with HDD.  As you see, I want to exercise extreme caution in protecting these 2, extremely expensive 2TB SSD's.Independent Advisor I agree to a certain extent about RAID that the things are unclear(I have to ask that to TPTB) but for normal configs please see this article from a Microsoft Employee.https:\/\/www.hanselman.com\/blog\/TheRealAndComple...In reply to Sumit (Independent Advisor)'s post on January 6, 2020 I did read the article you referenced.  While I am not a very technical person, I can see my issue is different than the issue addressed in that article.  The article revolves around  how Windows treats, maintains a SSD, and in the example \"optimize window\" the drive is clearly called \"SSD\" by Windows.  IN MY OPTIMIZER, the drive is called \"Hard Drive\", and this is the first basis of my concern that the drive is not being maintained as a SSD.I very much appreciate your offer to further investigate.  Again, please note my system is RAID 1, with (2) mirrored, 2TB SSD's, \"hardware based RAID\" with the controller on the motherboard.  I will await further information.  Again, my issue\/concern is not so much how Windows maintains an SSD, rather whether Windows sees my array AS SSD.","solutions":[]},{"symptom":"Delete gmail account from Mail app.        When setting up a new email address on Mail for Windows 10, I accidentally put in an unintendeed email (gmail) address.  I would like to delete it, but can't see an option for this.  Can someone help please? ","solutions":["Hi Lawrence#23, in the mail app, in the left panel, click accounts to open the manage accounts flyout on the right.click on the Gmail account to open the gmail account settings click \"remove this account from this device\" confirm by clicking delete. please let me know how you get on (or which bit is not as described)","Thank you so much for the almost instant response.  The email address I entered in error was my personal email address which was the same one used to set up my Microsoft account.  When I open that Mail settings window>>Manage account, the only options I get are \"Fix Account\" or \"Change Settings\".  From what I read on the web, I may not be able to delete this \"master\" account.  I don't want to fix it because I use Outlook for that email account.I only use the mail app for a couple of gmail accounts for clubs I am a member of.  Is there naything I can do?  Is it possible to delete the Mail app and reinstall it?Thanks again....","the fix account option will attempt to make the necessary fixes for the mail app, it may ask for permissions to edit and delete email etc. it will not affect the microsoft account or outlook.if the remove from this device is not available, fix the account first then go back into manage accounts to see if the remove option is there.alternatively, if you do not want to fix the account, click on \"options for syncing your content\" turn off email, calendar and contacts","turn off these"]},{"symptom":"Computer crashed during restart, wordpad document that I saved with 10,000+ words is blank        I had a story I had written in a wordpad document and I saved it before I had to restart because File explorer was being unresponsive.  During restart, the computer crashed (not sure if this is the right terminology but it's the blue background message with the unhappy smiley face.The wordpad automatically re-opened upon restart but was blank , or so I thought.  I could highlight the document, so it looks like my words are still there but hidden.  I tried changing text color, didn't help.  I saw a post saying to re-open it in Microsoft word, I tried that, and all I got was \"[]\" symbols everywhere.  How can I recover my document?  It's pretty important to me :(","solutions":["Hello, JasonZhang7,1. Did you look into your OneDrive files?2. Cortana Search Bar > Type %AppData% > Press EnterThis should take you to C:\\Users\\USERNAME\\AppData\\Roaming3. Type .asd or .tmp into the Search Bar upper rightFind the document depending on modified date4. Copy\/Paste the document to your desktop. Change the file extension from .asd or .tmp to .odtIf the above fails, use Easeus Data Recovery software or Piriform's Recuva software to find the file.","Hello, JasonZhang7,1. Did you look into your OneDrive files?2. Cortana Search Bar > Type %AppData% > Press EnterThis should take you to C:\\Users\\USERNAME\\AppData\\Roaming3. Type .asd or .tmp into the Search Bar upper rightFind the document depending on modified date4. Copy\/Paste the document to your desktop. Change the file extension from .asd or .tmp to .odtIf the above fails, use Easeus Data Recovery software or Piriform's Recuva software to find the file.I found the file and renamed the extension from .asd to .odt but it says \"Word cannot open the file because the file format does not match the file extension\"","Sorry, .odt would be Open Office fileStart over and this time rename it .txt instead.","I changed the file extension by clicking rename and then adding \".txt\".   I then opened it using word and the error message I get this time is:  Microsoft Word files with an .asd extension cannot be opened from this location.  Please move this file to the original .asd location and try again.  Not sure if I'm changing the file extension correctly or not.  I noticed that when I opened it in wordpad now, I see a bunch of wierd symbols now:  \"ÐÏà¡±á\"","Try Rohn's solution for opening the file.Another option would be to double click on the original file to see if it opens in Wordpad.","When I double click on the original file, it opens in wordpad but the text is invisible.  I tried Rohn's solution.  Opening the original file, all the text is replaced with  \"[]\" squares.  When I try to open the desktop copy file through word, I choose the option of all files in the dropdown, it won't let me open it giving me: \"Microsoft Word files with an .asd extension cannot be opened from this location.  Please move this file to the original .asd location and try again. \"  ","Move it back to where you copied it from. It won't have the same extension as the original. Once it's back in that location try opening it again.You can also try recoving the original document using software such as Recuva or EaseUS Recovery. Both are free utilities.Question: Did you try a System Recovery to date\/time prior to the loss of the document once the system crashed?FYI: I've edited twice thus the two additional paragraphs above. "]},{"symptom":"administration problem        hiso I have bought a new laptop with windows 10 32bitit was all good until I faced a problem during file transfer from drive C to another drive(drive D):(it is a  program file)it says I need administrator permission although I am the administrator and no one is using this laptop except methere are no other accounts on this laptophelp please and thank you in advance","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.You should not try and manually move a program file from one driver to another as this will most likely result in the program no longer working as files will not be where expected. Windows is making it tricky for you to move the file or folder so you can't accidentally cause a problem. If you want to move a program to another drive you should uninstall and reinstall that program - and during the install process choose the required drive.If you really do want to attempt to move this file or folder you can right-click it, go to Properties, then Security and give yourself the required permissions - but, I would not recommend this.Regards, David"]},{"symptom":"I am installing windows 10 on a lenovo laptop with windows 7 installed. It does not go to end of job. What is next step?        I am installing  Windows 10 upgrade on Lenovo laptop running window 7. The installation was going along well but never got to end of job What is next step?","solutions":["Hi Ray. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See these steps for overcoming Upgrade problems: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If any problems report back the error number and text, or the failure behavior. You'd get a much better install doing the Clean Install. Look over this gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... To create bootable Windows 10 Installation Media (on another PC if necessary) install Media Creation Tool and follow the directions in the middle of the download page here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Then either run the media to do the Upgrade or boot it as follows to Clean Install:Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key for your PC maker given in this chart:https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, then on second screen choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, select the Unallocated Space, click Next to let it create and format the needed partitions and start install - this makes it foolproof.You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC because you will learn everything that works best and how to apply it with your own hands.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Greg, Thanks for your reply. After waiting for the install to complete (24 hours) I finally powered off to shut down. The screen had no data but th windows logo and the circling lights to indicate it was attempting whatever. When I turned it back on it took a long time to boot but then announced that it could not install W\/10\"OxC1900-101-0x20017\" The installation failed in the SAFE_OS phase with an error in the BOOT operation.Should I try again or is there something to do before that?","You can try the Upgrade again following these steps for overcoming Upgrade problems:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Or you can do the gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki..."]},{"symptom":"Going Through a Problem Loop        So I'll keep this short; one morning I woke up to my laptop not really working. It would start up, the lights would go on, and the screen would light up as if it were about to display something, but never did. At first I thought it might've been the black screen of death, but the usual fixes for it didn't work. But then, one time when I just turned it on and let it sit there for about an hour, I came back to it saying \"Automatic Repair Couldn't Fix Your PC.\" And now I'm being sent through that loop, and I don't know where to go from here.","solutions":["Hi MrManny, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved. Keep in mind the root cause could be hardware and you can't fix hardware with software measures.Fix Automatic Startup Repair Loop in Windows 10, 8 and 7 <- read this https:\/\/www.top-password.com\/blog\/fix-automatic...Try running StartUp Repair from a Windows 10 boot disk or USB drive. That often will work when running from the recovery environment does not.You can make a Windows 10 Install disk and try to use it to repair the present installation.Make a Windows 10 Disk using the Media Creation Tool - select to install on another computer and the same version you have now. You can make a USB or DVD to boot with. Select Troubleshoot - Advanced Options - Automatic Repair.Installing Windows 10 using the media creation tool - create media then boot with it - use method I outlined above. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m...OR How to Prepare Bootable Install Media for Windows 10 - DVD, USB or SD Card https:\/\/answers.microsoft.com\/en-us\/windows\/for...OR use this method : How to Create a USB Recovery Drive in Windows 10 http:\/\/www.tenforums.com\/tutorials\/4200-recover...How to Do a Repair Install of Windows 10 with an In-place Upgrade http:\/\/www.tenforums.com\/tutorials\/16397-repair...Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all.","So I went through startup repair, but it only took about a minute for it to finish diagnosing to pop up with that same message but Startup Repair this time.","Did you also try the methods in the first link I posted Well if you did all of those from a Windows Disk then the only thing really left is a Clean Install.Of course, it could be a hardware problem. ------- Only if you tried all the methods I previously posted. A Clean Install would be activated with the Digital Entitlement. How to Prepare Bootable Install Media for Windows 10 - DVD, USB or SD Card https:\/\/answers.microsoft.com\/en-us\/windows\/for...Start fresh with a clean installation of Windows 10 https:\/\/www.microsoft.com\/en-us\/software-downlo...Clean Install Windows 10 http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all.","No I did it with installation files on a flash drive. Do you have any clue what it could be hardware wise or should I try asking somewhere else?","An installation USB is the same as using a Windows disk to boot from. Mainly, bypassing using the Windows on the system is the point.And you did try all the methods...... I would try a Clean Install which is works great. That would mean something unknown corrupted the OS. If it fails then it is hardware.If it is hardware it could be anything. Most suspect are hard drive, memory, and motherboard. Though anything hardware is possible.Feel free to ask anyone you choose. You will either get the same answers I posted or a whole lot of wild guesses.Here to help, Rob","Were you able to get the issue resolved or do you still need assistance? Feedback helps us help others and we are here to help. Rob - SpiritX"]},{"symptom":"VC_redist.x86.exe        Hello so every 30-40 minutes VC_redist.x86.exe pops on my screen and wants to change something in hard drive if i click yes or no it still pops on my screen after 30-40 minutes. Can someone help me thank  you ","solutions":["H Stan VC_redist.x86.exe is an installer for one of the Visual C++ Redistributables, that installer must be stuck in your Windows 10 startup processes and needs to be removed form there . . .Task Manager and indeed Msconfig offer only limited control over Startup items . . .Click the link below to download a small free utility that does not require installationhttps:\/\/docs.microsoft.com\/en-us\/sysinternals\/d...When the file downloads, unzip it. Depending on your system, run Autoruns or Autoruns64 as Administrator In the search box, type redist then if you find any entries referring to VC_redist.x86.exe untick those, that should remove that popup . . .","there nothing with redist","Hi Stankeeee Can you please provide a screenshot of the popup you are seeing, so I can try to find the underlying cause for you . . .","this keeps popping on my screen","Hi Stankeeee Open Windows File Explorer (folder icon on your Taskbar) In the address bar of File Explorer, paste this: %temp% In that folder, look for VSRedistSetup.exe and delete that file . . . that should stop that from popping up, though you may get another error from the process that is trying to run that serup file, if you do, please post a screenshot of the new popup, we will keep going until we find the underlying cause . ..","Hello so every 30-40 minutes VC_redist.x86.exe pops on my screen and wants to change something in hard drive if i click yes or no it still pops on my screen after 30-40 minutes. Can someone help me thank  you ddsaa"]},{"symptom":"Default Printer keeps changing to last used in Windows 10        I have the same problem as reported here: https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-hardware\/default-printer-keeps-changing-in-windows-10\/6848c6cd-59fe-4c83-aae6-4be70972f6c7, but this simple fix does not change the problem. I have unselected the option to allow Windows to manage my default printer but it is still change my default to the last used (Even though the correct default printer still shows the check mark next to it that it is set as the default). I have tried several of the ideas here, but nothing was helpful. https:\/\/windowsreport.com\/default-printer-keeps-changing-windows-10\/(I did notice that my SID numbers in the RegEdit app are rather strange. The one that is the longest has a TON of folders in it, and does not have a Printer folder (partial screen shot attached). I upgraded from Windows 7 and suspect that my registry might be a little out of whack since it's not a clean install.)This is really annoying and I can't find anything beyond the on\/off option, which does not work for me.","solutions":["Hi SEAlight. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.To force the default printer in registry follow this guide to adjust missing permissions:https:\/\/theitbros.com\/how-to-force-windows-10-t...If those fail try these additional registry fixes that are working for some: https:\/\/www.thewindowsclub.com\/let-windows-mana...https:\/\/troubleshooter.xyz\/wiki\/fix-default-pri...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows installation error: CLOCK_WATCHDOG_TIMEOUT        I'm attempting to install Windows 10 onto a laptop and when Windows installation restarts the laptop I get a a short loading dots screen, before the dots freeze at \"getting devices ready 85%\" and the computer bluescreens.The bluescreen freezes as well and the \"collecting info\" remains at 0%, giving me no option but to manually shut down the laptop. I am using a Lenovo Legion Y530:Processor: Intel Core i5-8300hRAM: 8GBStorage: 128GB SSD for OS and additional 1TB GB HDD for dataGraphics Card: Nvidia GTX 1050I'm unable to boot to safe mode as Windows hasn't been installed yet, and attempting to turn the laptop back on after the bluescreen only gives this message:\"The computer restarted unexpectedly or encountered an unexpected error. Windows installation cannot proceed. To install Windows, click \"OK\" to restart the computer, and then restart the installation\"I've attempted to install Windows again multiple times, I've even formatted my windows USB and redownloaded windows 10 from the media creation tool. My only thought is that it has something to do with my SSD and my HDD being in one system.What can I do to successfully install Windows?","solutions":["Hi, AlessandroGaggioli Try to update your BIOS version."]},{"symptom":"Bluetooth and device manager help        I cannot use a Bluetooth enabled device on my computer for speakers and there is no option to connect that way when I select 'add a Bluetooth device.'I am running Windows 10 Home on a Gateway using Intel core i5-2320 CPU with 3.00GHZ. Installed RAM is 8.0 GB. The operating system is 64-bit and I installed the Windows 10 on April 1, 2019Am I able to download and install drivers to support blue-tooth use on my computer? it didn't come installed and i've tried what I thought I could do own my own.","solutions":["Did you look in Device Manager and Bluetooth?","Hi, DanielleTaylor3 Check your Bluetooth, Go to Device manager then > Bluetooth.","yes I did and neither option worked that way","Hi Danielle Are you using a PC or a laptop? If that is a PC, most likely you do not have a Bluetooth radio in that If it is a laptop, what is the exact Model No. of your Gateway laptop - that will be printed on a sticker on the bottom casingIf that is a PC, you will need to buy a USB Bluetooth adapter, they are available on line for approx. $5+ and that will allow you to connect any Bluetooth device wirelessly to your PC . .","thanks so much. My Director actually told me the same thing later to buy a bluetooth adapter, so i'm going to have to go that route unfortunately. I have a PC and it's a Gateway something"]},{"symptom":"March of Empires asking for update        My computer shut down while March of Empires was open. Now when trying to open game, it is asking for an update. No update available, have tried everything I can think of and what I have seen in support short of uninstalling and reinstalling. If I do uninstall will all my progress be gone? Is there anything else I can try.","solutions":[]},{"symptom":"Microsoft Visual C++ Run time Error        Runtime Error!Program: .....iles(x86)\\AlienRespawn\\Componetns\\DSUpdate\\DSUpdate.exeabnormal program terminationThank you for taking the time to read and help! After recently having a hardware failure on my computer I was forced to change the Hard Drive and doa factory reset, and upgrade to windows 10. After this I have experienced this Run Time error, about 2-3 times. The error has caused the program I wasusing (Adobe Premier Pro) to shut down. I also tried opening a photo and this error showed up. However after getting the message I was able to click OK and start the program back up! I don't want any more serious issues popping up down the road and would like to know what I can do now so I don't see the message again. I just want to make sure this is not an hardware issue as well. In some of my own research I was told to uninstall and reinstall the Microsoft Visual C++ Runtime Library to fix the issue? I wasn't sure if deleting the current library would effect the computer at all. Thank you for all the input, advice, and help to get this resolved! God Bless!","solutions":["Hello PierreRoussel, I'm Didi, an independent advisor. Go to Services and set the startup type of the service \"SoftThinks Agent Service\" to \"Manual\" instead of \"Automatic\".Check the answer provided by Cbarnhorst on this thread for more information, scroll down to see his answer marked in green :https:\/\/answers.microsoft.com\/en-us\/windows\/for... Regards, Didi"]},{"symptom":"How do I transfer backup data from an external hard drive back to my PC once it has been repaird?        Using the Windows 10 backup feature, I had backed all of my data, including documents, music, photos and videos, to an external hard drive.  The backup was repeated hourly so it was fully up to date.  Then my PC crashed.  The PC is now being repaired and I have lost everything that was on the PC.  I want to restore all of my data to my PC by transferring it back from my external backup drive.  Are there specific steps I need to take to put everything back where it belongs?  Some things like videos, photos and music are obvious, as I assume I just drag them from my external device to their normal place on my PC hard drive.  I'm not sure where the other backed up items should go.  On the back up device, everything seems to be under the heading USERS.  Should I just drag everything to the PC's USERS folder, or is it more complicated than that?  I can't find basic instructions on how to do this anywhere, yet it would seem to be a common problem for folks who have lost everything on their PC.","solutions":["Thanks again, but I'm still having difficulty.  I have been trying the following:  Clicking on Settings, Update & Security, Backup, Backup (which gives me two options:Back up using File History and Looking for an Older back up?)    When I clicked on Back up using File History I'm asked to select a drive to back up to, a new backup is then immediately started.By enabling the backup process you preset the disk to be used. You must disable the backup, then select the disk that carries your old backup."]},{"symptom":"Windows 10, RAID 1, Optimize Shows HDD, not SSD        In my new Windows 10 desktop computer, (RAID 1, Two SSD's), I see Optimize shows \"Hard Disk Drive\", NOT \"SSD\", and I want to be sure defragmentation is not applied to these drives, instead of the proper TRIM utility.  What need I do?  I found a reply for this regarding Windows 8, but not sure how to proceed in Windows 10:\" Created on October 30, 2013 SSDs Showing up as HDD in system - Windows 8.1 GA\/RTM I had this issue during the preview and it appears to happen again in the final version of 8.1 as well. Somehow the system is incorrectly registering my 2x RAID SDDs as HDDs, which thus during the weekly \"Optimization\" runs a defragmentation on them instead correctly running TRIM instead. Which is quite frustrating to see it's still in the final product. In my preview thread the suggestion to fix this was to run WinSAT (Windows System Assessment Tool) from Powershell. It worked during the preview to correctly identify my SSDs and it appears to work in the final version as well. The description on how to run it from my previous thread: \"Usually the detection of SSDs can be forced by running the Windows Experience Index (= WEI, file name: WINSAT.EXE). You may have to run Windows Experience Index to force windows to detect RAID SSD in Windows 8.1.2013 Follow these steps:a.     Press “Windows key + W” from the keyboard.b.     Type “Administrative tools” without quotes in the search box.c.     Select “Administrative tools” option from the list.d.     Then right click on “Windows PowerShell ISE” and select “Run as Administrator” option.e.     Type “WinSAT diskformal” without quotes in the PowerShell and hit Enter.You will see: “Win8.1 Preview - Manual execution of the Windows Experience Index.png - Bild entfernt (keine Rechte)”.f.      Close “Windows PowerShell” and run Windows Optimization.g.     This should detect “RAID configured SSD on Windows 8.1.\" I highly suggest if you have SSDs, especially in RAID, that you check the Optimize Drives interface to see if it's correctly identifying your drives and if it isn't to run WinSAT diskformal from PowerShell.","solutions":["Hi Joseph,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Disk optimizing application automatically detects if it is an SSD or HDD so rest assured SSD won't be defragmented if it is there. This is built in into Windows.Sumit","How can I verify\/be certain?  In the Windows 8 advice, copied from the Microsoft Community, you see there can be an issue especially in RAID (1) configuration, where the hard drive(s) are not recognized as SSD, and a corrective procedure is given (for Windows 8, but I have Windows 10).  Is there some equivalent method to confirm my SSD's are receiving TRIM, not Defragment?  I ran \"optimize\" manually, and to my eyes, the process looked exactly like the \"defragment\" I've run for years on my old, Windows 7 with HDD.  As you see, I want to exercise extreme caution in protecting these 2, extremely expensive 2TB SSD's.","I agree to a certain extent about RAID that the things are unclear(I have to ask that to TPTB) but for normal configs please see this article from a Microsoft Employee.https:\/\/www.hanselman.com\/blog\/TheRealAndComple...Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","I did read the article you referenced.  While I am not a very technical person, I can see my issue is different than the issue addressed in that article.  The article revolves around  how Windows treats, maintains a SSD, and in the example \"optimize window\" the drive is clearly called \"SSD\" by Windows.  IN MY OPTIMIZER, the drive is called \"Hard Drive\", and this is the first basis of my concern that the drive is not being maintained as a SSD.I very much appreciate your offer to further investigate.  Again, please note my system is RAID 1, with (2) mirrored, 2TB SSD's, \"hardware based RAID\" with the controller on the motherboard.  I will await further information.  Again, my issue\/concern is not so much how Windows maintains an SSD, rather whether Windows sees my array AS SSD.","I have heard nothing further.  Do you have full information, now?"]},{"symptom":"Running DISM.exe  \/Online  \/Cleanup-image  \/Restorehealth        After I started the DISM.exe \/Online\/Cleanup-image\/Restorehealth I get a flashing white dot and after an hour no new data has shown on the screen! Does the flashing dot mean the restorehealth of my pc is in process?","solutions":["Hi William,It does take a while. I'm not sure which command did you use, but it should be with spaces:DISM.exe<space>\/Online<space>\/Cleanup-image<space>\/RestorehealthYou should see a progress and a confirmation after its done. Refer to the photos below:Also, make sure that you see the system32 in there. It indicates that you were running the command as administrator.Let us know how it goes.","It has been almost 5 hours since I Started the DISM.exe  \/Online \/Cleanup-image\/Restorehealth and my hp desktop still has not shown any progress on the screen. Once the above prompt was entered the screen showedDeployment Image Servising and Management tool Version 10.0.16299.15 then on next line-Image Version 10.0.16299.15 and a flashing white dash. When should I possibly see some progress on the screen?","Could you attach the screenshot on your next reply? Try creating a test user account and check if the issue replicates. Follow the steps outlined in this article.","I gave up on fixing the update problem with my HP Pavilion desktop. The problem started on 1\/9\/2018 and I have become too frustrated so, I went to WalMart today and bought a new HP all in One Pavilion Desktop. I appreciate all your help but 3 weeks is of effort is enough!","Oxc19oo107","After I started the DISM.exe \/Online\/Cleanup-image\/Restorehealth I get a flashing white dot and after an hour no new data has shown on the screen! Does the flashing dot mean the restorehealth of my pc is in process?","After I started the DISM.exe \/Online\/Cleanup-image\/Restorehealth I get a flashing white dot and after an hour no new data has shown on the screen! Does the flashing dot mean the restorehealth of my pc is in process?","Sa marche pas.","Hi William,It does take a while. I'm not sure which command did you use, but it should be with spaces:DISM.exe<space>\/Online<space>\/Cleanup-image<space>\/RestorehealthYou should see a progress and a confirmation after its done. Refer to the photos below:Also, make sure that you see the system32 in there. It indicates that you were running the command as administrator.Let us know how it goes.I have the same problem above.After I have use the command: DISM.EXE \/Online \/Cleanup-image \/RestoreHealth I have received the folloing error:ERROR: 87The RestoreHealth does not recgnized in this event.What these means and what I must to tdo?","John,Nothing happens, what next??Willem"]},{"symptom":"notepad        I need to move the newer version of notepad that's part of OS build 1809 to another laptop with OS build 1803. The newer notepad version has wraparound. I need \"trustedInstaller\" rights to do this. Merely copying the newer version from the other laptop won't work. How do I do this?","solutions":["Hi Robert I remember your question from yesterday and you made me curious, so I did this and it did allow me to copy Notepad out of that folder and into another PC . .Navigate to C:\\Windows\\System32 and find Notepad.exe Select that file and press Ctrl + C Then on your Desktop or on a clash drive, press Ctrl + V to paste a copy of that executableThen do the reverse on the other PC . . .","Tried that already. I can copy out but can't paste in without a request for \"trustedInstaller\" rights.","To be clearer, I can paste the executable to the desktop but can't paste to the System32 folder and that's what's needed to make it usable. The older version is 240K and the newer version is 248K. I have been waiting for many years for them to upgrade Notepad to include wraparound so I don't want to give this up. If I can't get it done, I'm about this >||< far away from saying goodbye to Windows and hello to a version of Linux. Tired of all the drama.","Why try to move it from one computer to another.Just go All Apps, Windows Accessories, Notepad, right click on it and Pin to Start.  Right click it again, More, pin to taskbar.I have found Wraparound in all versions.  Look at Format, Word Wrap.","I've been using Windows for a long time ... I have always been able to wrap text in Notepad.","I want the newer version on the other laptop. That laptop has a 512G SSD and the laptop with the newer notepad version has a 128G SSD. Wraparound is NOT line wrap; it is \"find\" or \"replace\" wraparound wherein the search will automatically wraparound to the top of the text if the target text is not found from the current cursor position to the bottom of the text. It is included with the notepad version on OS build 1809 (perhaps earlier as well, but not OS build 1803 and earlier). I can't believe I'm having to explain this over and over.","see other posts to get an explanation of \"find\" wraparound.","You need  to include computer after Notepad as there is a Notepad app that e have been talking about and not the Notepad computer.","Forget I ever mentioned notepad. As far as I'm concerned: What's Notepad?","The Notepad app is a very simple text editor.The Notepad computer was an IBM laptop.  N"]},{"symptom":"Microsoft Flight Simulator X: Steam Edition - Is a download available from Microsoft?        Can the Microsoft Flight Simulator X: Steam Edition be downloaded from any site other than Steam? As in, from the Microsoft site?","solutions":["Hello cpinck458, I'm Didi, an independent advisor. \"On July 9, 2014, Dovetail Games, the developer of Train Simulator, announced that it signed a licensing agreement with Microsoft to continue development on FSX and the production of new content. On December 18, 2014, the FSX: Steam Edition version of the simulator was made available through digital distribution via Steam.\" Source : https:\/\/en.wikipedia.org\/wiki\/Microsoft_Flight_... Therefore, you can buy and download FSX only on the Steam store : https:\/\/store.steampowered.com\/app\/314160\/Micro... Regards, Didi ------------ Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"printer\/scanner        I cant scan from my printer\/scanner into my computer although the printer is connected correctly.","solutions":["Hi RozFreeman, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this. A few questions I would like to ask to help troubleshoot:Was the scanner ever working before previously? Can you provide the make and model of your printer\/scanner device? We can provide you the download links for the most up-to-date drivers which may also help you.Have you tried scanning using the Windows Scan app? If it does not work, are there any error messages displayed?Please see the section \"Scan a picture or document with Windows Scan app\" here: https:\/\/support.microsoft.com\/en-ca\/help\/14088\/...Please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","Thanks Ashton I was able to get the problem resolved. I just needed to install the updates"]}]}