{"windows":[{"symptom":"Windows Defender Update still keeps locking up my PC        My laptop freezes up periodically, and virtually 100% of the time, it's due to Windows Update trying to update Windows Defender.  I know this because after I reboot the frozen computer, if I go to Check for Updates, it almost always says there is a Defender security update available. Windows Update slowing computers to a crawl (using 99% of processor resources) or locking them up entirely has been a problem since XP! Why won't MS fix this? Why does Update have to take over your entire system? Why can't it just pop up a message saying it wants to update, then let you choose when, instead of locking up your system when you're working? ","solutions":["Hi NV. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything possible for fixing failed Windows Updates, so that at least something will work before you work through them all. Even if you've tried a step, please do it over in sequence:Some Updates will sort themselves out in a few days so I'd wait to see. If not or they are bothering you then here are steps you can take:1) Run the Windows Update Troubleshooter from Windows Settings > Update & Security > Troubleshoot.2) There is a new guided walk-through from Microsoft for repairing Windows Update that leads up to resetting components if necessary:https:\/\/support.microsoft.com\/en-us\/help\/10164\/.... Try running that first. 3) If that fails try manually resetting Windows Update Service: Open administrative Command Prompt and type following commands one-by-one followed by Enter key.net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Close Command Prompt and see if Windows Updates works then 4) You can also install the Updates manually that fail to install, which are logged at Settings > Update & Security > Windows Update > Installed Update History, and then search for those to download and install from this Catalog:http:\/\/test.catalog.update.microsoft.com\/v7\/sit... 5) If they continue to fail and interfere, then you can block them using one of these methods:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... 6) If problems with Updates have become chronic and especially if you have other performance problems, go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 7) If nothing else works then do a Repair Install, by installing Media Creation Tool, open installed Tool and choose to Upgrade the PC Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version 1909. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... _____________________ Good news! There are major changes in Version 1903 giving back control over Updates to the consumer. Microsoft has heard us at the highest level who announced this here:https:\/\/blogs.windows.com\/windowsexperience\/201..._____________________ I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thanks for the info. However, my problem is not failed updates, it's that Windows locks up my PC while I'm working, and it appears to be when an update is available. ","Any 3rd party anti virus, security, cleanup programs ever installed on the computer?","If it's caused by Windows Updates then you would fix Windows Update, and those are the fixes that work best and help many people here every day.If you want to first check over Windows generally go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly.","Nope. Only use the one in Windows 10. ","Ok, I already tried 1 & 2, and I long ago disabled any unneeded start-up apps. ","See if you can manually Update defender to get them back on track: http:\/\/www.thewindowsclub.com\/update-windows-de...Are other Updates installing without problem. You can confirm this in Settings > Update & Security > Windows Update > Installed Update History"]},{"symptom":"Photos wont open images and windows apps run then crash.        Basically i was trying to open some images and a error message popped up saying \"The app didn't start\" then i realised that it was photo's fault as it couldnt even open and when i try to open the store, it runs then crashes. Ive tried alotta solutions from 2015 but non seem to help. I have only realised today that my images wont open. Would be happy if anyone helped me ;-;","solutions":["Hi, TGP25 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","thanks, i will try to do these, however, i have alr done the powershell thing, expect i didnt know i had to restart","Glad to Help!","hmm running the powershell didnt work ;-;","I recommend that you repair Windows completely before you must make a backup of your personal files, third-party software will be removed. Here the link to download the Windows ISO.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","thanks for trying to help, however i do not feel like going through the process of repairing my windows. Are there any alternatives to viewing images?","Follow these steps: Press the Start key and type the word CMD or Powershell, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanu p-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/929833...","I attempted this however, nothing was found and the problem still occurs.","Then you will have to repair Windows as directed above.","I'm experiencing the same issues. I have performed everything as above (i.e. powershell commands, diagnostics tool, repairing windows, DISM etc) and apps are still crashing\/not opening.Please advise."]},{"symptom":"Epson WF3620 printer slow to print        My Epson WF3620 printer is very slow to print. Can take 5 minutes to print 1 page. Color not very good either.","solutions":["My Epson WF3620 printer is very slow to print. Can take 5 minutes to print 1 page. Color not very good either.Is this whilst using a WiFi connection ???If so try connecting via USB and see if that speeds things up.As for color they are apparently quite slow and to print out a glossy 10 by 15 cm photo print can take 48 seconds or more. Always use Epson's color cartridges.Read the instructions carefully as there are many setting adjustments that can help in the area you are experiencing.They seem to be quite good printer \/ scanners and have good reviews albeit being a bit slow."]},{"symptom":"S Mode        ITS SO GODDAMN ANNOYING, I try to turn off S mode and it says; Try Again later, I tried and tried and tried and IT STILL SAYS TRY AGAIN LATER! I CANT DOWNLOAD ANYTHING AND I MIGHT BE GOING INSANE RIGHT NOW BC EVEN TRU MICROSOFT SHOP NOTHING IS DOWNLOADING! I need help, please.","solutions":["ITS SO GODDAMN ANNOYING, I try to turn off S mode and it says; Try Again later, I tried and tried and tried and IT STILL SAYS TRY AGAIN LATER! I CANT DOWNLOAD ANYTHING AND I MIGHT BE GOING INSANE RIGHT NOW BC EVEN TRU MICROSOFT SHOP NOTHING IS DOWNLOADING! I need help, please. Help pls","Hi Vini. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.They should have never put S mode on consumer PC's. There are millions of consumers who got these rigs for Christmas who are still trying to get out of S mode prison. Add to that server overload as Windows 10 approaches a billion users and Microsoft can't build server farms fast enough. So I would contact Microsoft Support by one of these phone numbers: https:\/\/support.microsoft.com\/en-us\/help\/405170...You can also go here: https:\/\/partner.support.services.microsoft.com\/... choose the link for Browser help, interact briefly about your exact problem, keep replying agent until it connects with an agent.A few reported that repairing the Store got it to work so you could try that first if you want:I'll give you everything possible to repair the store. Even if you've tried a step please do it over in this sequence. If any steps cannot be performed then report it and move on to the next:1) Try updating Store apps: https:\/\/support.microsoft.com\/en-us\/help\/402625... 2) Make sure you have the latest Windows 10 version 1909 in Settings > System > About and if not skip to Step 10 to install it by the most stable method.3) See if the fixes here help: https:\/\/www.pcworld.com\/article\/3053099\/windows... 4) Try running the Windows Store apps Troubleshooter at Settings > Update & Security > Troubleshoot.5) Try resetting the Store cache: http:\/\/www.thewindowsclub.com\/reset-windows-sto... 6) If that fails go to Settings>Apps and highlight Microsoft Store, choose Advanced Settings, then Reset. After it resets, restart PC.7) If that fails then reinstall Store. Type CMD in Start Search, right click Command Prompt result to Run as Administrator, copy the following code and paste it into the box using the Edit tools from Box's top left dropdown menu, press Enter:PowerShell -ExecutionPolicy Unrestricted -Command \"& {$manifest = (Get-AppxPackage *WindowsStore*).InstallLocation + '\\AppxManifest.xml' ; Add-AppxPackage -DisableDevelopmentMode -Register $manifest}\"8) Clear the LocalCache Folder: Open Run by pressing the Windows key + R hotkey. Copy and paste %localappdata% in Run and click OK. Open Packages> Microsoft.WindowsStore_8wekyb3d8bbwe > LocalCache folder. Press the Ctrl + A hotkey to select all content within the LocalCache folder. Press the Delete button. I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","All caps is considered yelling.  Please do not yell at the other users that make up this forum."]},{"symptom":"fax        how does one set up a fax account on windows 10","solutions":["Hi Jack. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See how to fax with Windows 10 here: https:\/\/faxauthority.com\/windows-10-fax\/https:\/\/www.howtogeek.com\/168841\/how-to-send-an...The Windows Fax and Scan utility has been hidden in the latest version and is available in Settings > Apps > Apps & Features > Programs and Features > Turn Windows Features On or Off > Print & Document Services > tick the box for Windows Fax and Scan, OK, Restart PC. Windows Fax and Scan will work with an existing fax machine or all of the ways in the first tutorial.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Windows Fax and Scan can be found in All apps under Windows Accessories."]},{"symptom":"Bad Image Error message pops up every time        Following error pops up everytime I am trying to run some installed programs on my computer.I tried to uninstall those programs but system is not allowing me to uninstall. I also tried to restore my system in safe mode but there are no restore points being shown. The system is not allowing to run any exe file and gives error. Is it a virus or some Windows update error? Can anybody please provide help.","solutions":["Hi Sindu. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Do you have the discontinued Windows Essentials program Movie Maker installed still? It will generate that error until it's uninstalled.Check at Settings > Apps > Apps & Features to see if it's still installed and uninstall it, restart PC to check if error goes away.If not then something else is causing it. See this tutorial: https:\/\/www.lifewire.com\/how-to-fix-msimg32-dll...Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Were you going to reply to my post, which I took time to research for you, or just give me a bad rating?","Thanks for reply Greg.Please understand my problems. My system is not allowing any uninstall from control panel and neither is it allowing any exe file to run whether it is antivirus or any program. No new installation is allowed. It shows following error when I run exe file:System restore is not showing any restore points, so how can I restore. Unfortunately all solutions you suggested above are the problems in themselves which I have put in the first description already.","Please do not take things personally. I read your reply where you are asking me to uninstall something and install some tool. I thanked you for the same. However, I had already informed in my original description that installation of new programs and uninstallation of programs is not happening on my system since this problem. System Restore is also not possible as no restore points are shown by my computer.","Then you'll need to go into Repair Mode (not Safe Mode) to run System Restore, try the new unisntall Updates button, or do a Reset, following one of these methods to access the Repairs:https:\/\/www.tenforums.com\/tutorials\/2294-advanc...It may be necessary to create bootable media to access Advanced Startup Options or do the Clean install:To create Windows 10 Installation Media on another PC install Media Creation Tool and follow the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, on second screen choose Repair Your Computer, then Advanced Troubleshoot Options, then System Restore, or the new Uninstall Updates button. If that fails go back to Troubleshoot Options to try a Reset.If that fails choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, click Next to let it create needed partitions and start install - this makes it foolproof. Everything needed to get the best possible Clean Install is here: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... It is a better install than any amount of money can buy and a great learning experience that will make you the master of your PC because you will learn what works best and how to apply it with your own hands. I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I understand you're focused on what you can't do, so let me reassure you that I've helped tens of thousands of people boot media to try repairs and if necessary Clean install and not one time has it failed to ultimately work. We may need to troubleshoot some, but it will always work ir the hardware has not failed, and we can determine that for sure too.","Thank you for the reply.Are you suggesting me to re-install windows 10? Will that be original and authentic Windows 10? When I bought the laptop, original Windows came by default with it. Also, will doing these steps erase all my personal data on the laptop?","If you read what I wrote it clearly focuses first on repairs and only gives the Reset and Clean Install if the other repairs fail. You don't have to do those if you want to sit with a PC that doesn't work after the repairs fail.The steps explain how to rescue your files. The fact you dont' have your files backed up is reckless and values them at nothing. Your files should always be backed up because a hard drive can die at any time without notice. Some suggestions to help ease into this habit: 1) You can sync your Desktop, Documents and Pictures folder using OneDrive Backup, or just drag valuable files into OneDrive folder, offering 5gb free with additional space for cheap:https:\/\/www.tenforums.com\/tutorials\/116029-turn... 2) Google Drive has a new Backup that allows you to choose User folders (Documents, Pictures, etc.) to sync up to 15gb for free to their cloud in real time so it always has the latest version.https:\/\/www.google.com\/intl\/en-GB_ALL\/drive\/dow... 3) In addition I'd have an on-site hard copy backup. The best way to do this is to sort all of your files into their User folders and then drag or copy them to another hard drive, USB external or flash drive. Here's how to drag, copy or move large groups of files: https:\/\/www.pcworld.com\/article\/2086566\/the-man... 4) Besides your files you should save a System Image back up to use in place of reinstall in 20 minutes. The best free alternative is Macrium:http:\/\/www.howtogeek.com\/howto\/7363\/macrium-ref... You can even use the Macrium program to mount and extract files from this image so it can serve as both image and file backup too.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thank you for your replies.I get a bit overwhelmed reading your replies. Can you please tell the methods one by one rather than in one go? I really cannot find any \"Repair\" thing above.In the meanwhile I ran sfc\/scannow in cmd prompt in safe mode. It said it detected some errors but could not fix it. Problems still remain. I cannot install anything in the computer or run exe files. I cannot access cmd prompt admin mode without safe mode.","I am not going to write them all out again, some for the third or fourth time. Go back to the top of this thread and perform each step in order. If you can't perform the step then move on. If you need help performing any step I will be here to help you.I was waiting for you to reply back with the results of the multiple repairs I gave in my first post last night. You gave me a bad rating without even attempting to do any of the repairs. Now you say you dont' even know there were repairs offered. So go back and work through them now, just like everyone else I've helped successfully for ten years over 100,000 times in forums.If you will not perform the steps then I will release the thread and you can try your luck with someone else or take it to a shop where the minimum charge in $150 and they will almost always reinstall WIndows with less than half as good of an install as what I can help you do if necessary. It's your decision."]},{"symptom":"Bluetooth keeps disappearing and reappearing on windows 10        Hello, bluetooth on my laptop keeps disappearing and reappearing after I Restart my laptop. I bought this laptop a month ago, and initially it didn't act like this, but from some point on it starting doing it, so I tried to reset it hoping that some sort of update might have inflicted the problem, but up to avail. When the bluetooth is dissappeared, it looks like this:As you can see, there is no 'Bluetooth Turn On\/Off' button.When I troubleshoot the Bluetooth on settings, it says there is no bluetooth found in my laptop, which is impossible because when I restart it, Bluetooth comes back again. On device manager, when the bluetooth is disappeared, I can see the Bluetooth option by 'Show Hidden Options.'  And when I tried updating everything on Device Manager, no changes or actually everything is up to date. And when I restart it, Bluetooth comes back up working perfectly until the laptop is in sleep mode due to being idle for long. After sleep mode is off Bluetooth is off.Anyone with a solution, please help me!","solutions":["Hi EB. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give all possible steps for troubleshooting Bluetooth in order of priority, so even if you've tried them please do it over in sequence. Many problems right now are being solved by updating to the latest version so if you want to skip to that step see the Repair Install at bottom: Try Updating the Bluetooth driver from the PC maker's Support Downloads webpage for your exact model. Install it even if it's the same or newer than the one in Device Manager reached by right clicking the Start button.Right click Start button to access Device Manager, locate Bluetooth device (if necessary from View tab Show Hidden Devices), on Driver tab see if Roll Back is available, if not try Update Driver, first automatically, then Browse, then Let Me Pick to try all previously installed Drivers. If these fail Uninstall the Driver, restart PC to reinstall. If the BT driver is not there, access the View tab in Device Manager to \"Show Hidden Devices.\"Make sure you're pairing correctly as shown here: https:\/\/support.microsoft.com\/en-us\/help\/15290\/... See Fixes here which are all working: https:\/\/support.microsoft.com\/en-us\/help\/14169\/...https:\/\/superuser.com\/questions\/1017867\/make-wi...https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/www.lifewire.com\/fix-windows-10-bluetoo...Try the Bluetooth troubleshooter at Settings > Update & Security > Troubleshoot. Try turning off Fast Startup at Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change settings that are unavailable > uncheck Fast Startup.If this is a mic or headset right click Volume icon in System Tray to Open Sound Settings, make sure the correct device is selected for input or output in the dropdown menu.Then try pairing again, if necessary run the Bluetooth Troubleshooter again. If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....If you think the BT adapter has failed, you can replace it easily with a USB nano adapter like this one:https:\/\/www.amazon.com\/ZEXMTE-Bluetooth-Receive... Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1909 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Re installing Windows XP - Activation Code        My HP Media Center PCm7177c had a HDD problem. Trying to re install Windows XP but the activation code is not accepted by Microsoft. What do I need to do ?Thanks,EASandry","solutions":["Contact them by one of these methods and keep contacting them until they do sort it out for you.@@@@@@@@@@@@@@@@@@@@@@@To contact Microsoft Support:What can we help you with?https:\/\/support.microsoft.com\/en-usContact support         http:\/\/windows.microsoft.com\/en-us\/windows\/contact-supportAlso: https:\/\/partner.support.services.microsoft.com\/en-au\/contact\/menu\/software\/windows\/setup\/\"Microsoft office locations around the world\"https:\/\/www.microsoft.com\/en-us\/worldwide.aspx\"Global Customer Service phone numbers\"https:\/\/support.microsoft.com\/en-au\/help\/13948\/global-customer-service-phone-numbers@@@@@@@@@@@@@@@@@@@@@@@"]},{"symptom":"Headphone jack question        Hello everyone, So we've had several end users say that their 3.5mm headphone jack on their PCs only works when the PC is first booted up with the headphones plugged in. If you unplug the headphones after Windows has already booted up and then plug the headphones back in, there is no sound. The PC also doesn't seem to recognize that anything is connected\/disco'd from that jack. USB headphones work fine. It's just the 3.5mm headphone jack. So far we've only had laptop users cite issues. Haven't tested this out on a desktop. I've been able to duplicate the issue on both Dell and HP machines. Both are running Windows 10. I'm not finding anything I haven't already tried on Google. (Updating drivers, etc.) Has anyone else run into this? Do we know if it's a Windows issue?Thank you!","solutions":["Hi Krystle, Windows itself cannot recognize any devices connected to 3.5mm jack - this is technical limitation. It is a function of sound card and sound driver.So please update sound drivers from Dell and HP site, check setting is sound driver's control panel.Check a device selected as output sound device.","Thank you, Igor. You're right about the driver. I was being an idiot about it. But rather than digging around for the correct driver (which I couldn't find), I tried a different set of headphones.The headphones in question appear to all be headphones normally used with cell phones. They sorta work on a PC, but not like on a cell. I went and bought a 3.5 mm single jack set of headphones specifically for a PC.Problem solved. I can plug\/unplug the connector into the PC after Windows has already booted up, and it switches over the audio just fine. "]},{"symptom":"All Downloads Fail        I can't download anything from the internet without getting a message that it contains a virus and was deleted.  This includes email attachments that I know do not contain viruses as well as even downloading a monthly bank statement.  I spend all day updating any available updates and checked that it is not my antivirus.  I use windows 10 and also use McAfee LiveSafe.","solutions":["HI Christopher. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Download, install and run a full scan with the most powerful on-demand free scanner Malwarebytes:https:\/\/www.malwarebytes.com\/mwb-download\/.In the Scan Settings first set it to include scanning for Rootkits. If necessary run it in Safe Mode with Networking, or Safe Mode accessed by one of these methods:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... Clean up anything found, restart PC and then run again until it comes up clean. Check for any remainders in Settings > Apps > Apps & Features, and also in each of your browser's Extensions, Home Page settings, Search service or Add-On's as shown here:https:\/\/community.box.com\/t5\/How-to-Guides-for-... Then check for damaged System Files: https:\/\/www.lifewire.com\/how-to-use-sfc-scannow... If it cannot repair them see Step 10 here to continue: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I would also try uninstalling McAfee which no expert anywhere recommends, although we solve many problems having it removed. Uninstall it in App Settings, then run the Removal Tool here:http:\/\/service.mcafee.com\/FAQDocument.aspx?id=T..., restart PC and check Defender is turned on by typing Security in Search box and opening Security settings.If you want to keep Malwarebytes as an on-demand scanner then you can turn off its Real Time trial version in it's Settings > Account Details tab.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thanks for the information, Greg.  Unfortunately when I try to run the setup for Malwarebytes.com I get the same message that it contained a virus and was deleted.Chris","I'd wipe the drive clean and reinstall. Any files need to be quarantined and scanned by Malwarebytes on their USB drive before importing into new install.Follow the illustrated Clean Install steps in this tutorial which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Make sure all other drives and peripherals are unplugged. Update the BIOS or UEFI firmware to latest, or reset to Defaults, making sure SATA controller is set to AHCI.Create the latest new Windows 10 Installation Media by installing Media Creation Tool and following the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... If you're using another PC to do this then uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor...If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first. If you can start Windows enter UEFI firmware here:http:\/\/www.isunshare.com\/windows-password\/four-...Choose the boot device as a UEFI device if offered, on first screen press Shift + F10 to open a Command Prompt, type the following commands followed by Enter key:DISKPARTLIST DISKSEL DIS # (replace # with the disk # of the Windows disk from list in previous command)CLEANEXITClose Command Box, on second screen choose Install Now, then Custom Install, then at the drive selection screen choose Unallocated Space, click Next to let it create needed partitions and start install - this makes it foolproof.You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","You can first try uninstalling McAfee which causes a lot of problems, use built-in Defender which always offers best Windows performance with least issues, and is from Microsoft who knows how to protect their OS best.Uninstall it in Settings > Apps > Apps & Features, restart PC, then use the McAfee removal tool to get it all out:http:\/\/service.mcafee.com\/FAQDocument.aspx?id=T...Now Download, install and run a full scan with the most powerful on-demand free scanner Malwarebytes:https:\/\/www.malwarebytes.com\/mwb-download\/.In the Scan Settings first set it to include scanning for Rootkits. If necessary run it in Safe Mode with Networking, or Safe Mode accessed by one of these methods:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... Clean up anything found, restart PC and then run again until it comes up clean. Check for any remainders in Settings > Apps > Apps & Features, and also in each of your browser's Extensions, Home Page settings, Search service or Add-On's as shown here:https:\/\/community.box.com\/t5\/How-to-Guides-for-... Then check for damaged System Files: https:\/\/www.lifewire.com\/how-to-use-sfc-scannow... If it cannot repair them see Step 10 here to continue: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If you want to keep Malwarebytes as an on-demand scanner then you can turn off its Real Time trial version in it's Settings > Account Details tab.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Greg,Ultimately this is what ended up working so thank you very much.  Kink of strange that I needed to uninstall my antivirus in order to have what appeared to be a virus go away.  Definitely better than having to wipe the drive clean.Chris","I'm glad that worked for you. McAfee has been recommended by almost all experts (to uninstall) for years. Let me know if there's anything else. Also when ready please mark the post which helped most as the Answer, to help others. A rating is also appreciated."]},{"symptom":"Update your child's Windows 10 device to get family features to work *not working*!        I recently setup a new laptop for my child for school. After adding his account to the laptop, the new device appeared in Microsoft Family, but with the message of \"Update your child's Windows 10 device [DEVICE-NAME] to get family features to work.\"I ran through all Windows updates, through to the latest version 1903 and patches. I have also cycled the PC through several restarts. The message persists.I know that time limits are being enforced; however, neither Notifications or App Limits work on the new laptop on his account. I do not want to remove and recreate his account, and am reluctant to remove and add the device again. Has anyone had this issue and how did you resolve it, if you did?","solutions":["Hi Rob My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.It would suggest one of two things, the account if a Family Account or the NTUser.dat file is corrupt. This is also an issue many users have been reporting for years now, but there isn't a definitive fix.I would also recommend you file a bug report; send me the short link so I can vote on it and bring it to the attention of the Windows engineers.https:\/\/windows10.help\/blogs\/entry\/54-how-to-su...Information in the above link is sourced from a trusted Microsoft MVP blog. If you are on social media, you can also let this engineer who works on it also know about the issue.Troubleshooting steps: Step 1: Change the date of birth on your Microsoft Account to ensure it reflects your are 18 years or older:Change the birthdate on your Microsoft account - Microsoft Support https:\/\/support.microsoft.com\/en-us\/help\/12411\/...Step 2: If the other account is setup as a family account, sign into your Your Family at the following link:https:\/\/account.microsoft.com\/familyUnder the account, click More options, click Remove from family. Restart then check if you can sign into the account again. Change the account privilege It is possible there is a profile issue, you could try changing the account privileges to Standard User from Administrator to see if it logs you in.In your current account Press Windows key + X Click Task Manager Select the Users tab Select the account, then click Disconnect Press Windows key + R Type: control userpasswords2 Hit Enter Select the other account Click Properties Click Group Membership Select Standard user Click Apply then OK Click Apply then OK again Restart the machine, the try logging into the account. If that doesn't work, then it suggest NTUser.dat might be corrupt. Open Start, type view advanced system settings Hit Enter Under User Profiles, click Settings For the affected profile, click Delete Select your user profile or another user profile that is able to log on successfully.Click Copy To.. Click Browse then save it somewhere on your drive Rename it to something else Open File Explorer > This PC > system drive where Windows is installed Open the Users folder Open the troubled profiled Go to the View tab, then check off Hidden items in Show\/Hide The NTUser.dat with backed up earlier, copy it into this folder Restart, then check if you can log in.","Hi Andre,Thank you for your detailed response. There are a few aspects of my Microsoft Family account that failed to mention in my original post, and that may be pertinent to my situation.I have an existing Microsoft Family account with myself and my wife as adults and my 13-year-old son as a child.There are currently three other devices associated with my child's account: Windows 10 Professional (64-bit) custom-built desktop computer, an Xbox One, and an Xbox One X. All three of these devices work as expected with Microsoft Family settings.The laptop I mentioned in my original post is a new Lenovo Flex 6 14 Series 2-in-1 Touchscreen Laptop. The laptop had Windows Home pre-installed.After creating my user account (using my Microsoft account to login to the Lenovo laptop), I upgraded the laptop to Windows 10 Professional. Once Windows 10 Professional was installed, I performed all available Windows updates, bringing it to version 1903 (May 2019 update).I am able to login to my user account (an Administrator account), and administrator group functionality appears to function correctly on my account.The laptop did not have any third-party AntiVirus or Security software installed. I have an active BitDefender subscription with open PC spaces and planned on installing BitDefender once the laptop was functioning as expected.I'm reluctant to remove my son's Microsoft account from my family group, because I do not want to inadvertently reset parental control settings that are active and working correctly on the other three devices on the account.Since my child's account has only existed on the laptop for about one week, rather than replacing the NTUser.dat file with a copy from another user account, I decided to remove my son's account from the laptop, including the entirety of his user directory. However, even after removing his account and recreating it, the same problem persists. (I did not scrub user accounts from the Registry, so if there are account settings in the Registry associated with his UUID, then it is likely that deleting his account from the computer did not flush out whatever datapoint is presenting Windows Family from properly working with the Lenovo laptop. My next step at this point is to try using a copy of the Default user's NTUser.dat file to see if that resolves the matter.If that does not work, I am thinking of adding a local administrator account unassociated with any Microsoft.com account. From that account, I can then remove all other user accounts, including the inactive\/hidden ones that are automatically added when adding an account with Microsoft Family group.I will post an update once I move forward.","Same issue here.I removed my child from the family and from the PC.Then re-added to family and PC.Problem persists.My other child account works well on the same PC. Very confounding.","What are people meant to do when this doesn't work?  Especially on an important issue like this.I am having the exact same problem.Have spent hours trying to fix it.Even re-installed Windows 10.Made no difference.Have Microsoft got an answer for this.  Its quite exhausting trying to solve something that makes no sense and where there is no real help.","Sadly Family Safety is not safe for your family, it is not reliable, has NEVER worked properly and breaks continuously.https:\/\/michaels.me.uk\/parents-beware-microsoft-family-safety-is-anything-but-safe\/","I am having the same problem, but only with one child's account out of 3. The other two child accounts are working fine on the same computer, so it can't be a computer update problem.","I have the same problem.Further, the XBox is asking my son to buy an Xbox Live subscription.  We already have one and it used to apply to the kids.  Now that the family features aren't working because my Windows 10 is not up to date (yet it is!!), it doesn't seem to apply anymore.Maddening.Microsoft still releases the worst software made and provides the worst user experience of any ecosystem.  Absolute garbage.","Same here.   Retired Software architect - I took all my Windows, PC's MSFT hardware to the dump 10 years ago and now use Apple.My son built a gaming computer and now its a full time job controlling him. Disgusting that this is a monopoly - shoud have been broken up in the early 1980's","Ok - Ive thought this out a bit and come to one possible idea of what MSFT's bug is.   Of the accounts of children who are working in families with multiple children,  were the accounts of the children whose accounts can be controlled without that bogus error, ORIGINALLY SET UP AS CHILD accounts?Were the account(s) that dont work originally setup as ADULT and you chnaged their birthdate to be correct which made them a CHILD????","See my question about how you originally set up these accounts.   Were they all CHILD or was the one that doesnt work set up initially as ADULT???"]},{"symptom":"Consolidating multiple users into just one        Windows 10 - My current pc (3 yrs old) inherited some issues when I moved everything from my old computer to this one.  One thing was I had 4 Users.  Have no idea why the tech did that but that is what happened.  Accounts I had were Jack, Jaci5, JaciS, and one that was the name of the computer.  It got so we never knew where to find files, I had some things in the computer 4 times!  I created a new user just so I could keep track and finally moved everything into that one account.  Now some things don't work right (like Google).  Is there a good or easy way to resolve this?  Should I move everything to an external hard drive or move over to my laptop and start over with a clean slate on the pc?  I'm concerned about some of the software as well as the files.","solutions":["Hi Jaci. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Look over the gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... You asked about consolidating Users. You can move your files over to one Admin User and delete the other User accounts by one of these methods:https:\/\/www.tenforums.com\/tutorials\/5464-delete...You can also go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"0xC004F012        My windows keeps asking me to activate it. I am getting error 0xC00F012. When I try to troubleshoot the problem error 0xC0000022. I tried almost everything I have found online on how to fix the issue. When I try to restart Software Protection it tells me Error 5: Access Denied. I don't know if it has anything to do with it but the last update I have received from Windows was on 12\/17\/2019 for Feature 1909 which seems a bit odd because it seemed before Windows had some kind of update at least once a week.Is there anyway else I can fix this? I am assuming this is what's affecting my Office 365 not being able to install too.","solutions":["Hi Randy, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.This is often seen as an error. Please contact Support, they would help you activate the copy of Windows.https:\/\/support.microsoft.com\/en-us\/contactus"]},{"symptom":"Where to  Start        I am a very basic beginner but I am tech savvy. where would I start if I wanted to pursue windows apps?","solutions":["Here's a good place to look:https:\/\/docs.microsoft.com\/en-us\/windows\/uwp\/get-started\/","Thank you","Hi, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.There are many platforms you can use which include win32 and UWP. please see the following:https:\/\/docs.microsoft.com\/en-us\/windows\/apps\/d..."]},{"symptom":"Computer reverting to previous OS when trying to upgrade to windows 10        Hello there,I have currently been trying to upgrade a work PC from window 7 PC to windows 10.I have gone through the Microsoft Media creation tool and told it to \"upgrade this PC.\" The system has gone through all the setup steps and checks, but when windows 10 was actually installing, it reached about 50% of the install and then started showing the \"undoing changes to your computer\" screen and reverted back to windows 7. I didn't see if it said anything else before it starting undoing things- I had walked away to let it do it's thing.Its happened twice so far, I have checked all the system requirements and everything looks good so I don't know what the problem is.The only issues I have seen that are similar are about systems that are already on windows 10 and are having problems updating.","solutions":["Hi taymus13, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Let us check the Installation log to find why the update failed. Please share the logs as mentioned in this article. You should use a File sharing service like Onedrive or Media Fire to upload files and share the link in the next reply.https:\/\/answers.microsoft.com\/en-us\/windows\/for...The Panther logs. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\PantherThe Rollback logs: These usually are created if Windows Update rolls back. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\Rollback[Only if the error code is 0xC1900101-0x30018] The Device Install Log from C:\/$Windows.~bt\\Sources\\Rollback\\setupapi\\setupapi.dev.logAs the log size might be large consider zipping before uploading."]},{"symptom":"unl ocked windows 10 laptop        I have a new lap, I set it up in hast and cant log on. I've reset my outlook pass word. Nothing seems to work","solutions":["Hi Susan, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.If you changed the Microsoft Account password on a different device, it might take a while to propagate.All methods to reset password are here: https:\/\/www.tenforums.com\/tutorials\/14699-reset...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads."]},{"symptom":"Determine what Microsoft userid is on my Dell desktop PC.         In booting up my Dell desktop PC, it runs through what I believe is the normal bootup process (shows Dell logo, etc) and then immediately goes to the Microsoft logon script.  It shows my name (first name, last name) and asks for password to log in.  I type in the password that works on my laptop when I go to \"live.com\" using my logon id \"*** Email address is removed for privacy ***.\"  The only thing I can  think that might be causing this problem is that the logon id for my desktop must be different than the one on the laptop.  Since I can't get logged on, I don't know of a way to determine the logon id on the desktop.  Can that be done some way, or is there a way to bypass the Microsoft account log in?At some point it will give me an option to logon using Microsoft Hello but as far as I know I have never set this up so it doesn't appear to be an option.","solutions":["Hi, EulaStull My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to enter the safe mode with the network function to repair, it may be that the network controller is outdated.Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. As soon as you see the Windows logo with the rotating dots, press and hold the power button until the computer turns off. Do this process twice..-Turn on your computer for the third time, and let it load. .-You should receive this message: Preparing Automatic Repair. After entering Mode Update the network driver may be outdated","I tried the suggested process but the only thing that happened was I was taken to a Dell troubleshooter that did some checks for operating system problems.  Once it finished that I was right back at the lock screen which I can't get out of.  Anything else I can try?","Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Changing user account in the app store        I went into the app store to download a game but instead of me being able to sign in to my Microsoft account, it keeps pulling up my daughter's account information. How do I log her out and me in?","solutions":["Open Store and click on top right corner of page and then click the username and then click sign out.","that is a problem Open Store and click on top right corner of page and then click the username and then click sign out.","pic top read that is a problems in not opened store my phone"]},{"symptom":"[SOLVED] Some apps don't load both on Windows start as well as manually trying to start them        Hi,Apologies if this is in the wrong category as I couldn't find one I felt was specific to my problem, so I've posted in performance and system failures.I have a problem when trying to run some apps.  Using Microsoft's own Process Explorer in place of Task Manager I can see the process starts but immediately gets disabled as it's greyed out.  Sometimes when trying to force close the process I get an error saying access denied.  While I have UAC settings on maximum as I'm security conscious and I want to make sure system specific changes are only those changes initiated by me, my login account is an administrator account.The most common app that fails to start is GPU Temp as I like to monitor the temperature of my GTX 1060 from the taskbar alongside CPU Temp.  CPU Temp runs perfectly fine but GPU Temp doesn't always start.  If it doesn't start, I know other apps that I've had problems with (such as WinAero Tweaker) won't run either.  If I see GPU Temp in the system tray on Windows start, then everything will be fine.This issue started since the 1909 release back in November 2019 though I initially put it down to the possibility of my copy of Windows being constantly patched and updated many months prior.  So on Sunday January 5th 2020 I performed a full system reset (deleting all apps, files and settings after backing up my files first) but the problem persists.Now bare in mind these are not app crashes, so I can't provide dump files, they just simply stop running as soon as they're loaded into memory.  Prior to the 1909 update release, all was fine.  Other than that, the performance on my PC isn't hindered in the slightest.  Has anyone else had this issue and if so have you managed to fix it?My PC specs are:OS: Windows 10 Professional x64 1909 (build 18363.535)Windows is retail edition not OEM as all parts listed below I've purchased myself and built my own PC.CPU: AMD FX-8350 Octo Core 4.2GHzMotherboard: Gigabyte 970A-DS3P (last BIOS update released Feb 26th 2016 and is installed, no further BIOS updates exist so technically BIOS is up to date)RAM: 4 x 8GB DDR3 (32GB total)Storage:2 x Samsung EVO 850 250GB SSDs (1 is used for Windows boot)1 x Western Digital Green 1TB 7,200rpm HDD2 x Seagate Barracuda 3TB 7,200rpm HDDS.M.A.R.T status of all drives report healthy with no issuesGPU: ZOTAC GTX 1060 6GB Mini running in dual screen mode with 2 x AOC 2460 monitors in 1,920 x 1,080p @ 60HzI use Bitdefender AV Plus for my AV solution (I also normally use Malwarebytes for a 2nd layer of protection, but as of writing this discussion I haven't gotten round to installing it since resetting my PC) and ZoneAlarm for my firewall.Any help would be greatly appreciated.Kind regardsKevin","solutions":["I recommend that you repair Windows completely before you must make a backup of your personal files, third-party software will be removed. Here the link to download the Windows ISO.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Transfer Windows 10 Pro Digital License to a different account        Hello,I have bought a laptop sometime last year and also purchased a Windows 10 Pro digital license from Microsoft Store after a few days of using the laptop (since it came with it a Windows 10 Home Single License).I am now about to sell this laptop and I want to include the Windows 10 Pro license with it but it seems to be tied to my Microsoft Account. I was wondering if there is a way to transfer it to the buyer's own account?","solutions":["Hi Dyosep, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Not the news you may want to hear, but the pro upgrade pack inherits the type of license from the underlying OS which is Windows 10 Home OEM. An OEM license is tied to the motherboard as is not transferable.Hence you may not be able to transfer that to the new computer.However, if you want to tie to the buyer account, just ask him to sign in with his email and he should see the device in the list. Additionally you may also remove the device fromhttps:\/\/account.microsoft.comHope that helps.","Hi Dyosep, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Not the news you may want to hear, but the pro upgrade pack inherits the type of license from the underlying OS which is Windows 10 Home OEM. An OEM license is tied to the motherboard as is not transferable.Hence you may not be able to transfer that to the new computer.However, if you want to tie to the buyer account, just ask him to sign in with his email and he should see the device in the list. Additionally you may also remove the device fromhttps:\/\/account.microsoft.comHope that helps. Are you sure about that?I just assisted a customers whos HP laptop had its motherboard clock burn. It was 5 years old and out of warranty.I helped the person buy a used no name PC, which I tested and the hardware was good. No HP.I installed fresh, from a formated drive, with the same username and connected to his Microsoft account he had on the faulty HP laptop. It worked, but the account didnt accept changing phone number and a few others.I used the Win 10 support, Explain the situation, I was clear about its a new HARDWARE, but the HP laptop was only broken in the MB clock and the rest worked. Thats pretty sad to loose your license for a small thing like that, which HP doesnt even sell the part to replace it with.Microsoft support fixed it so my customers (win 10 home), was now connected to his \"new\" old PC.The support was clear that they do not officially support this, but she agreed that it was silly to loose a home win 10 license only because the Vendor, didnt want to sell the part.In the license agreements its clear. Microsoft have no responsibility to do this. But an OEM license that does not have warrenty anymore, Microsoft has the right to support if they choose to.I have worked for many years in HP. This isnt unique to them. All Manufactorers does this. To sell a new computer, when the old one works fine if you just replace the part.Dyosep,I would call Microsoft, or use their chat support and simply ask them. Explain your situation and ask.Worse case, you get a no.","Hi Sumit, thank you for your response. If that is the case then I'll just see if I am able to transfer the license by letting the buyer login through his account. I'll give this a shot.","Hi Jonas, thank you for your response. I tried looking for their chat support earlier to no avail, so it seems I'll have to drop them a call then. I'll try that method as well. Thanks!","Let us know if you need any other assistance:)"]}]}