{"windows":[{"symptom":"How do I open a video project made with Windows 10 photos app?        How do I open a video project made with Windows 10 photos app?I made a video using the photos app. nice app!I have the exported video and want to change one of the text titles.Where is the project file?It was easy to do so in Movie Maker.Thanks.Yossi","solutions":["Hi Yossi, thanks for using the Photos Video Editor! To find your video projects, simply navigate to the Video Projects pivot in theapp.  There are a couple of easy ways to do this:Type \"Video Editor\" into the start menu and select the Video Editor tile to launch the Video Projects pivot directlyLaunch the Photos app and select the \"Video Projects\" pivot (see red arrow in image above--right below the Search bar) You can then continue to edit your projects to your heart's content! If you need to access your video project on another device, just select \"Save in OneDrive\" on the top of your video project, and the video project will be roamed to the cloud. Just log into the second device with the same Microsoft account you logged in with on the first device, and your project will automatically appear on the Video Projects page."]},{"symptom":"irql not less or equal windows 10        I upgrade my pc parts few months back and now once in awhile it crashes with the blue screen with error irql not less or equal. need help ","solutions":["Hello! I am an Independent Advisor, I would love to help you out! Can you upload the dump files from the bluescreen then I may be able to look further into the root cause potentially.The dmp files should be located here: C:\\windows\\Minidump Zip any files and upload them to onedrive and link the download here. From there I can look at it further.","Do you have any razer software or drivers installed? If so uninstall that software\/drivers and restart the computer and then test. Are you still getting the BSOD after removing razer software\/drivers?The log files indicate that it is because of RzDev_0306.sys which seems to be razer synapse or related razer driver\/software.","i do, okay i will try some things later. thanks for the info. will tell you it fixes it or not","I look forward to future updates!"]},{"symptom":"Registration Entries appeared in Documents directory        A file called cc_20200107_112022 (type Registration Entries) appeared somehow in my Documents directory.  I have no idea what it is.  I have scanned it both with Malwarebytes & McAfee, showing no issues with either scan. When I double click it says \"Adding information can unintentionally change or delete values & cause components to stop working correctly. If you do not trust the source of this information in C:\\Users\\______\\_______\\cc_20200107_112022.reg, do not add it to the registry. Are you sure you want to continue?\"  Yes   NoSo I've just clicked No so far.  What is this Registration Entries thing, how did it appear suddenly, & can I safely delete it?","solutions":["Yes, I would delete the file and CCleaner. It's registry cleaner has always been iffy and now the whole app is disregarded by all experts. You can use Disk Cleanup that's built-into Windows 10 to be safest, and NO registry cleaner:http:\/\/windows.microsoft.com\/en-us\/windows-10\/d...Let me know if there's anything else. Also when ready please mark the post which helped most as the Answer, to help others. A rating is also appreciated."]},{"symptom":"A Digital Audio Driver Requirement and Suggestion        Windows audio driver e.g WASAPI supports configurable fixed audio file sampling rates (44.1Kbps ~ 384Kkbps, etc ) ; this creates distortion and audible via careful listening when audio source file is of different sampling rate from the Windows sound drivers' configured fixed sampling rate when you connect the external DAC ( Digital to Analogue Converter) devices via USB or etc. Windows Audio device drivers would be best to support option to follow the source file's sampling rate. For example Foobar2000's DSP Manager supports dynamic sampling rates ( File>Preference>Playback>DSP Manager>MultiResampler>mouse right button >configure>\"from the list\"...)  This problem cannot be solved via oversampling; so it should follow the source files's sampling rate to be bit perfect in this digital audio age... ","solutions":[]},{"symptom":"Windows 10 sleep mode gets shut down        Hi,I'm facing a problem, when my computer is in sleep mode, after some time it gets shut down.I have recently bought new laptop HP Spectre x360 15\" last month and having Windows 10 1909 version.Please assist me. Really appreciate your help. Thank you!","solutions":["Hi Harlik. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See fixes for Windows shutting down in Sleep mode: https:\/\/www.majorgeeks.com\/content\/page\/how_to_...https:\/\/www.thewindowsclub.com\/windows-computer...https:\/\/www.guidingtech.com\/fix-windows-10-shut...https:\/\/superuser.com\/questions\/1189310\/windows...If those don't help then what often works is to fully troubleshoot Sleep to find and fix the problem which should show up during this process:I will give you all possible fixes for Sleep. If you need help performing any step just ask back:First confirm you have the Sleep options configured correctly as shown here: https:\/\/www.tenforums.com\/tutorials\/2843-change....You might want to try Hibernate to succeed Sleep, or use Hibernate in place of Sleep - it's just a deeper sleep that actually powers off because desktop stored in RAM during sleep is written to hard drive hiberfile then powered off.Most Sleep problems are caused by the Display driver, so try updating yours from the PC or Device maker's Support Downloads web page for your full model number, Serial Number or Dell Service tag. While there make sure you have the latest BIOS, Chipset, Network, Sound, USB and all other drivers by comparing those posted for download with the version and date of the corresponding ones in the Device Manager.If that doesn't help then in Device Manager on Display device Driver tab choose Roll back, Uninstall (then restart to reinstall) or try another one previously installed at Device Manager>Display adapter>Driver>Update Driver>Browse>Let me pick.In addition there are steps here to specifically troubleshoot Sleep mode problems:http:\/\/www.makeuseof.com\/tag\/fix-windows-10-sle... What I do is go into Advanced Power options and set Display and Sleep to 1 minutes, Hibernate to 2 minutes, then after completing each step restart the PC and observe what happens for 3 minutes.Also did it previously work? Do you have a System Restore point from when it did?http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t...This may have been caused by Windows Updates. Check which Updates were installed right before the problem began, and if necessary uninstall them from Settings > Update & Security > Windows Update > Installed Update History.You can also try to roll back using System Restore to a point before this began: http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... Then if an Update reinstalls and causes the same problem uninstall or roll it back again, then immediately hide it using the Hide Updates tool from Method Two here:https:\/\/www.askvg.com\/fixing-windows-10-automat... If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1903 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"solitaire hijacked        microsoft solitaire collection taken over by some malware pushing slot machine. unable to play solitaire (premium account). Malware disappears with Reset but returns after one game. Malware Bite show clean scan.please help","solutions":["problem solved itself before I could provide screenshot. Thanks"]},{"symptom":"Sharing settings and files when changing from local to microsoft qaccount        I just added my Microsoft Account to my computer (Admin). It was originally set up as a local account, (standard).  Now I cannot figure out how to get my settings and files opened. Please help. Tried opening as admin but no go. ","solutions":["Hi Susan. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Did you convert the Local Account to your MS Account as shown here: https:\/\/www.tenforums.com\/tutorials\/5375-switch... ?If so see here to give yourself Admin privileges: https:\/\/www.windowscentral.com\/how-change-user-...If this fails use the existing Admin account to create a new Local Admin Account in Settings > Accounts > Family & Other People > Other User, copy your files over, test all apps work correctly or reinstall them.If for some reason you have no Admin account (which should be your main operating account) then enable the built in hidden Admin account to do this:https:\/\/www.isumsoft.com\/it\/enable-hidden-admin...https:\/\/www.tenforums.com\/tutorials\/2969-enable...Then when ready delete your MS account in Settings > Accounts > Family & Other People. Restart PC, go back to convert the new Local Admin account to your MS Account.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"recent windows 10 install        was using windows 7 home premium, recently upgraded to windows 10. after install, printer, smart tv, apple tv are not recognized as being on network.Need Help","solutions":["Hi John. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See these guides for connecting Windows 10 to TV: https:\/\/www.techadvisor.co.uk\/how-to\/laptop\/con...https:\/\/www.wikihow.com\/Connect-PC-to-TV-with-HDMIhttps:\/\/www.intowindows.com\/how-to-wirelessly-c...https:\/\/www.techwalla.com\/articles\/how-to-conne...Connect Apple TV to Windows 10: https:\/\/smallbusiness.chron.com\/connect-apple-t...I'd also consult your Smart TV and Apple TV manuals available on their Support Downloads web page to get connected again or troubleshoot connection.PRINTER: Rather than spending too much more time fiddling I'd simply Clean Install the printer which always works, lasts longer and actually saves time:1) Power up the printer, if wired unplug it's USB cable from PC. 2) Go to Settings>Apps>Apps and Features to find and Uninstall any printer software.3) Use one of these methods to remove all of the old printer drivers: https:\/\/www.tenforums.com\/tutorials\/101274-unin...https:\/\/helpdeskgeek.com\/how-to\/remove-uninstal...4) Now type Control Panel in Start Search, open CP, choose Icon View. In Control Panel open Devices and Printers, right click printer to delete Printer and any scanner or fax of the same name. Restart PC.5) Go to the printer model’s Support Downloads webpage to download and install the latest full software package. Now is also the time to check for any newer printer firmware to install which matters a lot.6) Extract Printer software, right click Setup file to Run as Administrator. Follow the setup screens closely as you install the software. For USB it should prompt when to plug in the printer.Older software may need to be installed in Compatibility Mode to run correctly: https:\/\/www.groovypost.com\/howto\/run-old-softwa... If you have further problems reply back with results of each step. Once it's installed and you've run a test print, then scanned it to see that it opens on the desktop, open the Printer software and go into its Settings to set the scan-to file location you prefer, also the email app you want opened for Scan to Email, if applicable.I hope this helps. Feel free to ask back any questions and let us know how it goes. If you will wait to rate my post until we are done, I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Microsoft Product Key On My Dell Laptop        I am looking for the Microsoft Product Key on my Windows 8.1 Dell Laptop.  I obtained the Product Key from the laptop as the administrator.  But Microsoft says it is not correct, get another one (like they grow on trees!).  I just want to enable other features on my laptop.","solutions":["I am looking for the Microsoft Product Key on my Windows 8.1 Dell Laptop.  I obtained the Product Key from the laptop as the administrator.  But Microsoft says it is not correct, get another one (like they grow on trees!).  I just want to enable other features on my laptop. You are mistaken in what you are trying to do with that Product Key.The original product key that came as part of the preinstalled operating system is not for Add Features.Add Features to Windows 8.1 is to upgrade to Pro, etc. AFTER you have bought the Upgrade.This is what the Add Features to Windows 8.1 was for:Microsoft has ended sales for it.Try amazon.com, etc.Windows 8 and 8.1 Pro Pack and Media Pack are no longer available to buyhttps:\/\/support.microsoft.com\/en-us\/help\/3107057\/windows-8-and-8.1-pro-pack-and-media-pack-are-no-longer-available-to-buyAs of October 30, 2015, the Windows 8 and 8.1 Pro Pack (which upgraded Windows 8 Home or 8.1 Home to Windows 8 Pro or 8.1 Pro, with Media Center) and Media Pack (which added Media Center to Windows 8 Pro or 8.1 Pro) are no longer available for purchase from Microsoft. Previously purchased feature pack licenses will still work, and valid feature packs may still be available for purchase from third-party retailers. Support for these products is still available.Cheers.","Thank you Bill for taking the time to provide me with information.  I originally started out to find the Product Key.  The one I found, at the command prompt, turns out to be false, per Microsoft.  I still would like to find the Product Key for my  ( ?? )  machine but have no more time for this.  And will not waste anymore of your time on this.  Cheers back to ya","Who at Microsoft told you it was false?It will come up as no good for Add Features.@@@@@@@@@@@@@@@@@@@@@@@With Windows 8\/8.1 The Product Key on preinstalled Operating Systems (HP, Acer, etc) is embedded in the BIOS in the Motherboard, so that the lost and\/or worn C.O.A. Sticker problem is no more.This information may interest you if you do wish to keep a record of it:\"Windows 10 Embedded Product Key Tool\"https:\/\/neosmart.net\/blog\/2014\/windows-10-embedded-product-key-tool\/\"We’re proud to introduce the immediate release of our newest utility for Windows users: the NeoSmart Technologies Embedded Product Key Tool. Designed for users of Windows 7, Windows 8, and Windows 10, our embedded product key tool will retrieve and display the Windows setup product key embedded in the BIOS or EFI, allowing you to store it for safe-keeping or use it to reinstall Windows with an official Windows setup image.\"You can also use:\"Belarc Advisor - Free Personal PC Audit (Version 8.5c)\"http:\/\/www.belarc.com\/free_download.htmlOr:\"Product KeyFinder\"https:\/\/www.magicaljellybean.com\/keyfinder\/"]},{"symptom":"Unable to get Windows 7 to start        I am having problems with my old Windows 7 Home Premium desktop computer.When I switch on the computer the normal STARTING WINDOWS screen appears. The screen then momentarily goes black then the normal WINDOWS IS LOADING FILES message appears on the bottom of the screen as the bar graphic fills from left to right. The screen then momentarily goes black and the normal (c) MICROSOFT CORPORATION message appears with the colured bar with the moving block in it appears. The screen then changes to the normal light blue wallpaper picture in preperation for the login graphics to appear but instead of the login box appearing I get a brief glimpse of a large command prompt box momentarily flash up on the screen then about 2 seconds later a smaller command prompt box momentarily flashes up on the screen. Then about a second later the MICROSOFT STARTUP REPAIR program automatically starts but, unfortunately, fails with the message STARTUP REPAIR CANNOT REPAIR THIS COMPUTER AUTOMATICALLY. On this screen there is a Problem Details button. If I click this it displays the following detailed report:Problem signature:Problem Event Name: StartupRepairOfflineProblem Signature 01: 6.1.7600.16385Problem Signature 02: 6.1.7600.16385Problem Signature 03: unknownProblem Signature 04: 21200649Problem Signature 05: AutoFailoverProblem Signature 06: 11Problem Signature 07: CorruptFileOS Version: 6.1.7600.2.0.0.256.1Locale ID: 1033I have tried running SYSTEM RESTORE but this has not cured the Windows startup problem.I have run NORTON BOOTABLE RECOVERY TOOL and it found a couple of suspect emails but no virus infected files.I have a WINDOWS 7 SYSTEM REPAIR CD.Any suggestions on what I should try next?","solutions":["Often the DVD will work when you boot from it, whereas the built-in software may fail.You have the DVD so read this:https:\/\/www.sevenforums.com\/tutorials\/681-startup-repair.html Cheers.","Thanks Bill,Yes; I have tried using the Startup Repair on the DVD but, sadly, this doesn't work either. If I look at the fileD:\\Windows\\System32\\Logfiles\\Srt\\SrtTrail.txt I see:Startup Repair diagnosis and repair log---------------------------Last successful boot time: ‎12\/‎3\/‎2018 11:19:40 AM (GMT)Number of repair attempts: 28Session details---------------------------System Disk = \\Device\\Harddisk0Windows directory = D:\\WindowsAutoChk Run = 0Number of root causes = 1Test Performed: ---------------------------Name: Check for updatesResult: Completed successfully. Error code =  0x0Time taken = 15 msTest Performed: ---------------------------Name: System disk testResult: Completed successfully. Error code =  0x0Time taken = 0 msTest Performed: ---------------------------Name: Disk failure diagnosisResult: Completed successfully. Error code =  0x0Time taken = 94 msTest Performed: ---------------------------Name: Disk metadata testResult: Completed successfully. Error code =  0x0Time taken = 15 msTest Performed: ---------------------------Name: Target OS testResult: Completed successfully. Error code =  0x0Time taken = 78 msTest Performed: ---------------------------Name: Volume content checkResult: Completed successfully. Error code =  0x0Time taken = 234 msTest Performed: ---------------------------Name: Boot manager diagnosisResult: Completed successfully. Error code =  0x0Time taken = 0 msTest Performed: ---------------------------Name: System boot log diagnosisResult: Completed successfully. Error code =  0x0Time taken = 0 msTest Performed: ---------------------------Name: Event log diagnosisResult: Completed successfully. Error code =  0x0Time taken = 110 msTest Performed: ---------------------------Name: Internal state checkResult: Completed successfully. Error code =  0x0Time taken = 124 msRoot cause found: ---------------------------Startup Repair has tried several times but still cannot determine the cause of the problem.Thanks,Ian.","Have you tried entering Safe Mode  to see if it boots.Tap the F8 Key in 1 second intervals before the splash screen starts.This only allows essential systems to start at boot.You can run restore from there as well and perform other diagnostics.","I believe the root cause of your problem is a failing or already failed hard drive.  You need to re-install Windows 7 after installing a new hard drive.  The hardware installation is quite easy.  The cost of a new drive is under $100.  A local technician will likely charge you something like $300 for this, but if you are reasonably good at following detailed instructions precisely as they are stated, you can do it yourself.  In fact, in many instances the local technician does a poor job of it.You can follow the detailed procedure I use.  You will find it here:https:\/\/www.askwoody.com\/2019\/canadian-tech-how-to-rebuild-a-win7-system-with-minimal-snooping\/","Hi Frank,Thanks  for your suggestion. Yes; have tried F8 then Safe Mode. No real difference. Microsoft Startup Repair still starts up automatically before Windows reaches the login prompt stage.I am starting to wonder if those Command Prompt boxes I see momentarily flashing up on the screen (they come and go too quick to see any text in them) are perhaps part of a Microsoft Update which fails... but I have no idea how to check if an on-restart Microsoft Update is pending, nor how to temporarily stop it cutting in and crashing the boot sequence.Ian.","Hi Canadian Tech,The thought that my hard drive may have become faulty has crossed my mind. I did however run the manufacturers advanced hard drive test and it passed ok. I also  ran an anti-virus program on it which was able to read and check 2,314,350 files on the hard drive without problems.I have also thought about reintalling Windows on a new hard drive as you suggest but I have the unfortunate problem that the computer case was scraped against a cabinet when putting it on its shelf a few years ago so about 4 characters of the Windows License Code sticker are unreadable. Do you know in which file within the Windows software the License Code is stored as I can boot the computer into a command prompt using the Windows DVD so may be able to recover the License Code that way?Ian.","Is the computer by chance a Dell?","Hi Canadian Tech,No; not a Dell. It is an HP Pavilion Slimline s5545uk Desktop Computer","I have used a program before that has had mixed results.  Meaning in some cases the Microsoft Product Key it found was not in fact the correct one.  And, in other cases it was.  you could try it and with part of the key known to you, you could validate its output.  It is named Produkeyhttp:\/\/www.nirsoft.net\/utils\/product_cd_key_viewer.htmlAnother that some say works is Belarc  https:\/\/www.belarc.com\/products_belarc_advisor","Hi Canadian Tech,Thanks for those 2 suggestions. Do you know if Windows creates a log file during start-up? Maybe if I could find it it may give some detailed clues about which particular file has become corrupt crashing the startup sequence and causing the Windows Startup Repair program to trigger.Ian."]},{"symptom":"KB4517389 is destroying my PC functionality and I cannot get rid of it.        KB4517389 is a Windows update that causes my PC to lock up every 2 hours and disables most forms of video playback. I have uninstalled it 4 times, which is difficult because the Windows uninstall an update feature doesn't work on it.It also makes System Restore fail. All restore points try and fail. Even in safe mode.Every time I uninstall it, it reinstalls itself, even with pause updates turned on. I have tried uninstalling most other programs and even disabled all 3rd party background functions, as well as performed all hardware diagnostics and system repair options. The system will even fail if I leave it on the login screen and do not log in.Every time I ask Microsoft all their technicians do is give me useless release notes or tell me how to install it, but never how to remove it.How can I permanently remove this poison from my system and not spend 3 days a week fighting for a functional PC?","solutions":["Are you sure Windows Update cause this issue?Open start and search for feedback and open Feedback Hub app and report this issue.","Hello There! My name is Evan an independent adviser. I feel your pain I've had similar issues myself what with owning a 10 year old gaming PC. There's 2 options.Option one. Navigate to this page https:\/\/support.microsoft.com\/en-us\/help\/307393.... You'll download the troubleshooter which has an app called \"show or hide updates\".Run this directly after you uninstall that pesky update. This will then hopefully give you the option to avoid the install.Secondly, there is a more drastic measure which involves the \"Run\" command and the \"services\" function. It will completely disable updates. Sometimes I use option 2 myself when I wish to avoid an update for a few months. However, I would first like us to try option 1 first.","This troubleshooter never produces results, it just fails. If it completes it tells me there are no updates to hide. Both of these options don't work in any way, especially when I can't uninstall the offending update.","You really think I haven't posted this on feedback hub multiple times?"]},{"symptom":"Transfering Windows 10 - Confirming Key        I'd like to transfer Windows 10 Pro from my old computer to a new one I just bought (without Windows).  Apparently, I have to call Microsoft to ask about the key and if what I have is transferable.  However, the wait time when I call Microsoft for a call back is 21 hours! Is there anything else I can do?  Thanks.","solutions":["Hi MPageMiller My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help answer your question.I would recommend having a look at the following article which details how to find out what type of license you have and then what options you have.https:\/\/www.groovypost.com\/howto\/transfer-windo...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Hope this helps."]},{"symptom":"My Visio laptop won't boot.        It flashes the logo about 3 times and then eventually opens the setup utility screen, which doesn't help. It failed to do a restart during my recent online attempt at upgrading to Windows10 from 7, so the installation didn't complete. The pinhole reset button on the bottom of the case does nothing either. Any suggestions?","solutions":[]},{"symptom":"How do I download iTunes app to my PC?        How do I download I Tunes app to my PC* Original title: I Tunes app","solutions":["Hi Diane You can download that from this link to the Microsoft Store: https:\/\/www.microsoft.com\/en-us\/p\/itunes\/9pb2mz..."]},{"symptom":"Can we able to get existing Windows 7 Updates.        Hi,We are having 100 Windows 7 64bit licenses.So if we reinstall any new Windows7 are we able to get existing Windows 7 updates.or there will be no updates at All.Please guide through,Regards,ravi ","solutions":["XP, Vista, etc. continued to have the updates, up to end of support date, available from Microsoft after end of support.Microsoft hasn't said anything different is going to happen with Windows 7.And we don't work for Microsoft.","The hardest part will be getting Windows update backend happy.  You remember the long scanning problem of Windows 7?  When you rebuild PCs, be prepared to be EXTREMELY patient as it scans and scans and scans for updates.","The hardest part will be getting Windows update backend happy.  You remember the long scanning problem of Windows 7?  When you rebuild PCs, be prepared to be EXTREMELY patient as it scans and scans and scans for updates.FYI:I am not the OP.Will you stop posting to me.","My apologies, I'm posting from a small screen and hit the wrong reply.","You remember the long scanning problem of Windows 7?This issue has been fixed. The Windows 7 general update search disease - unlike the Vista one - has been cured in January 2017. It wasnot related to rebuilding Windows 7 or a certain amount of updates missing.Regards, VZ"]},{"symptom":"I don't want a PIN number        I don't want to have to enter a PIN to start my laptop. How can get rid of this stupid new update on Windows 10? It asks for me to set a PIN every time. I don't want it, I've tried to uninstall the latest updates (which I hate), but I can't get rid of this new requirement that I don't want","solutions":["Hi Matthew, this is a bug in version 1803 . . . Cancel the PIN prompt and login to your PC Go to Windows Defender Security Centre icon on the tray. Under 'Account Protection' go to 'Set up Windows Hello for faster, more secure sign-in'Click 'Set-up', it will prompt you to set up a pin - don't. Click \"Dismiss\" After that, there should be no more prompting at startup","I had this problem and traced the solution to my sign in screen. When logging on below the space to enter my password are two icons. One looks like a keyboard and set windows hello as sign in - the other looking like a pc allows logging in with windows account. By selecting the windows account on the sign in screen the prompt for a pin disappeared. It is only required if the user has selected the Hello icon for signing in. "]},{"symptom":"Win10 Home (free) re-activation        HP 2107c Win7 upgraded to Win 10 Home, months later (now) i replaced MB, now Win10 not activated, i found 25 digit serial number for Win10 Home, in Speccy,used it in System Update change product key, but got message of invalid key. How do i get it activated?","solutions":["Great, I hope all your files will be recovered. If you don’t have any further questions please feel free to mark one of the replies as the answer &\/or rate my help: 1 star means you are very unsatisfied with my help and 5 stars means you are very satisfied with the help I gave you."]},{"symptom":"screen freeze        my screen has shifted to the right cutting off that side of the page.  it still works up and down.  the screen is like this continuously.  is there an easy fix?","solutions":["Hi yIs Please explain this in more detail, is the screen cut off on the right hand side on everything you see on your screen or is this just in one application?If that is everywhere in Window, right click your Desktop, on that menu you will see the Control Panel for your Video Card, open thatLook for an aspect ratio setting, then try each of the settings to find the one that fits your screen . . .If this is only happening in one application, then zoom out in that application, if you cannot find the zoom function, what application is that?"]},{"symptom":"Dropping off network        computer keeps dropping off the network.  Tried new drivers, turn off power saving and all the other suggestions.  How do I know if the card itself is just bad?","solutions":["Hello, popeye51047,need more details: how do you connect to the internet, via LAN or wirelessly?Is the problem present in both modes?Do you have a laotop or desktop PC?https:\/\/support.microsoft.com\/en-us\/help\/10741\/windows-fix-network-connection-issues","I wrote this for my clients.  You will find a lot of information here that will give you a better insight into how WiFi networks work.  Assuming the modem your Internet Service Provider supplied you has a built in wireless router, try it and see how well it  works for you.  The key questions are, how good is the wireless signal strength and whether it drops signals.  Go to www.speedtest.net to see how it does in different parts of the house.  If that is satisfactory, stick with it.  The actual supplied speed is best tested on the same site with a computer connected by Ethernet cable.Keep in mind that a wired connection using an Ethernet cable to the router will always deliver superior speed.  For example, many printers have Ethernet connections and can operate as a network printer by plugging them into your router (or the supplied modem with router).It has been my experience that the wireless facilities in provider-supplied modems do not do a good job of wireless.  If that is the case, you will need to get your own wireless router and get your Internet Service Provider to shut down the wireless facility in their modem.You should not have more than one wireless router in a network or even try to connect one to another.  In some wireless routers there is the capability of shutting down the router function and having them operate as wireless access points which acts like a signal repeater.  In that case the wireless access point wirelessly connects to the main wireless router and has the network key (password) to it.Check list & TipsMicrowave ovens will interfere with your wireless signal2.4 Ghz cordless phones will interfere with your wireless signalLarge metal objects like refrigerator, freezer, cabinets, laundry will interfere with your wireless signalMetal in walls, floors or ceiling — some apartment or condo buildings are built of Concrete with reinforcing steel rods in it will interfere with your wireless signalNear large steel beams either in floor, ceiling or walls will interfere with your wireless signalYour computer itself will interfere with your wireless signalOther electronic devices such as a TV will interfere with your wireless signalSometimes other nearby neighbours can cause interference through use of over-powered wireless systemsIf you are located near an airport or other place where radio signals are used extensivelyMost (not all) routers have an ip address of 192.168.0.1.  Entering that in the Internet Explorer address bar should bring up a window for entering user id  and password (not necessarily the same as the wireless key).  You must have this.   Once past that point, you can do all kinds of manual setup.  For example the wireless encryption key (other names too). You can reset your router back to factory defaults by using a straightened paper clip.  Press it into the tiny hole in the back that says reset while the router is powered up.  Hold that pin there for at least 15 seconds.Many routers then have a user id of admin and no password.Do not get carried away with WiFi security.  It can not be accessed from any point much further than about 50 feet.  Write the key you create on a sticker and put it on the router or modem.There is a type of technology that few will tell you about that can make a huge difference for this type of problem.  It amazes me that more people, even technical people, are not aware of it.  It is actually in some routers and notebook PC radios and the sellers don’t even know it.  It is called MIMO, which stands for Multiple In Multiple Out.  It is supported by n radios, and will be used provided both the sending and receiving devices are capable.  It works by transmitting on 2 or more closely adjacent band widths simultaneously.  If a packet of information is lost or garbled, MIMO attempts to find a better copy of the packet from the adjacent stream, and is usually successful.  Obviously 3×3 MIMO systems are better than 2×2.If you buy a new router, you should insist it has MIMO and you may have to do a lot of research to find which ones have it.  More than you might think, but their sellers don’t know about it.Wireless n devices (both router and the radio in your computer) are much better capable of handling this interference.  Check to see if your router supports n and that it is set up to run on n if your devices talk to it on n.  You will need help from your ISP (Internet Service Provider for this).You should not have more than one wireless router in a network or even try to connect one to another.  In some wireless routers there is the capability of shutting down the router function and having them operate as wireless access points which acts like a signal repeater.  In that case the wireless access point wirelessly connects to the main wireless router and has the network key (password) to itPlacement of the wireless router can be very much the cause.  It should ideally be near the centre of a building.  It should be high in a room not down low to the floor where it can pick up more interference.  Not near a wall or other electronic device.  Sometimes just moving a router a foot or two can make a huge difference.  Likewise the way antennas are pointed, assuming your router has one or more externally"]},{"symptom":"You have been denied permission to access this folder        Hello! Thank your for taking the time to read. I recently upgraded my computer to windows 10 after having a computer hardware failure and replacedthe hard drive. Now back and running. However I ran into a a few issues since, but the one that I need help with at this moment is as the title says. I have a 6 TB Hard Drive I use for backing up my files. And on the first time trying to open a specific folder on the Drive I found myself with this message: You Currently Don't have permission to access this folder - click continue to get permanent access to this folder. I did some research and howto go into the security tab, and and by adding \"everyone\" under \"Groups and Usernames\" you can gain access. However the Drive is already set up as \"everyone\" I also have been using the drive for other projects and have access to the folders with out any problems, this is the first folderon that drive that I have encountered this. I went into the security for this specific folder and it says you must have READ permissions to access thisfolder press advanced to continue. When I go into the folders security it says \"You do not have permission to view this object's security properties, even asand administrative user\" Try taking ownership of the object, which includes permission to view it's properties ( click Change above)\"Any idea what the next step is to gain access to that folder? Thank you for the help!  ","solutions":[]}]}