{"windows":[{"symptom":"‘No applicable devices linked to Microsoft account’        i have been trying to download sims 4 on my windows 10 lenovo. It says ‘you own this game’ and gives me the option to ‘install on my devices’ however when i click this, it tells me i dont have any applicable devices linked to my microsoft account. I do have a microsoft account and it is linked to my windows 10 laptop. Is this an issue with windows 10? It was very expensive so i therefore expect to get my moneysworth. Do i need am Xbox account? Is that the issue? Very frustrated i just wanted the sims and have discovered that many people have the same issue. Help me microsoft!","solutions":["Hi Maggie. I'm Greg, an installation specialist and 9 year Windows MVP, here to help you.See fixes working here:It looks like you don't have any applicable devices linked to yourGame Pass install probsDid you go into your MS account from which the game was purchased and confirm that the Lenovo laptop is listed as a linked Device? Sometimes with more than on e MS account a device will be linked to another account and not the one the game is registered with. Confirm that first. If it's clearly linked to the same account you bought the game with, then I'd contact Store support here:https:\/\/support.microsoft.com\/en-us\/help\/28808\/...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I'm having this exact same problem with Halo Wars 2: Ultimate Edition on windows store.","Hi Greg, I happen to have the same exact issue as Maggie concerning a game I purchased on the Microsoft store. I did what you recommended but when I try to add a device it doesn't find any. Could you tell me how to check if my Lenovo is connected to my Microsoft account? ","I am also having a similar issue. Has this issue found a resolution?","I have sims 2, 3 and 4 but all are in the Origin clientEA is the publisherif you have the game from the MSFT store, you may need to reset the storeopen an elevated command promptwsresetand this will reset the store which should get you back in business","I am just as concerned as Maggie is. I tried downloading Minecraft on my Windows 10.. I had already installed the Minecraft Windows 10 Edition... but I wasn't able to invite my friends.. So I tried installing Minecraft, just Minecraft. Once I purchased it, it said my device wasn't applicable, so I tried everything I could. Microsoft isn't really an application you can trust.. I am very frustrated.. Is there any possible way I can get a refund?? Thank you.","I am also having a similar issue. Has this issue found a resolution?     No, I'm afraid it hasn't. I wasted $30.00, and I am still unable to play the game I purchased.","Same problem here. I bought the XBox Game Pass for PC yesterday, downloaded, installed and played one game no problem. Now trying to install Wolfenstein 2, and it says I have no linked devices which is impossible.SOLVED: You have to join the Windows Insider Program. Joining that allows you to update Windows higher than is normally available, and then you can install any game... Not good, but that's it.","Hello Greg, I recently upgraded to Xbox Game Pass Ultimate. When I try to install a game, while signed into my account, from the MS webpage, I get a dialog box stating:Where do you want to install?It looks like you don’t have any applicable device(s) linked to your Microsoft account. To install, sign in on a device with your Microsoft account.My account manger shows my PC on my devices' listing page. I linked to the manager using the same account, which displays \"My account login\" on both the page trying to install and the devices listing. Apparently the dialog cannot access the devices linked to my account. When I did not use the \"....\" -> \"Install on my devices\" and just clicked \"Install\/play\" the install did kick off and is apparently working.  ","Hello, When I try to install a video-show app in MS Store in windows 8.1, while signed into my account, from the MS web page, I get a dialog box stating:Where do you want to install?It looks like you don’t have any applicable device(s) linked to your Microsoft account. To install, sign in on a device with your Microsoft account. When I did not use the \"....\" -> \"Install on my devices\" and just clicked \"Install\/play\" theinstall did kick off and show only cancel button."]},{"symptom":"Can't open print queue from settings menu        I'm trying to help someone with a weird issue that is preventing her from accessing the printer queue or printer management from the Settings menu. As shown in the screenshot below, when any printer is clicked, the 'Open queue' and 'Manage' icons are not included in the light gray box, and if either of those two items are clicked, they merely select the next printer in the list. I've tried restarting, running Windows update, and diagnostics. The queue and management will open if I run Print Management directly or from Device Manager. Anyone else ever seen this before? The machine is currently running cumulative update 1903.","solutions":["Hi BarryWilliams01, I'm Charles, an Independent advisor trying to help. Let's see if by applying these steps we can restore the correct operation of the printer.1.- Start Windows in safe mode, this article will show the steps to execute this process, in addition to explaining what it is and the purpose of applying it, from the >> Show all section, once started try to go to the Windows configuration and open the print queue. https:\/\/support.microsoft.com\/en-us\/help\/12376\/...2.- Apply the Windows troubleshooting Windows key + I >> Settings >> Update & security >> Troubleshoot >> Printer (Click on this) >> Run troubleshoot.3.- Uninstall and reinstall the printer Control Panel >> Select the printer >> Remove device, you can confirm that it has been removed in the Windows configuration and in the section >> Programs & Features of Control Panel, also by following these steps: Windows key + R >> Execute , type command: printui \/s \/t2 + Enter >> Drivers, if found, click Remove + Apply + Accept, restart the computer4.- Install the printer with the installers of the brand and model page, preferably, install with the administrator accounthttps:\/\/support.microsoft.com\/en-us\/help\/401538...I hope the steps work for you too Attentive to any comments Have a happy day Best Regards, Charles.","Charles,Thanks for the detailed response. The Troubleshooter ran only steps that I had already tried. All printers, including built-in ones, are similarly affected. I can access the print queue in other ways (i.e., from Print Manager). Only when I try to access it through the Settings menu, is it not working. I think perhaps the glitch is occurring in that menu. I'm not optimistic, but I hadn't yet tried starting in Safe Mode. That may be a useful suggestion for narrowing down the cause.Your reply also gave me another idea. The laptop belongs to our organization. Thus far I have tried to investigate the problem from the user's account, running apps as administrator only when prompted. I will need to try restarting the laptop from my account and see if the problem is present when the Settings menu is run from an administrator account. That may narrow down the scope of the problem.Thanks again,Barry","Hi, Hopefully it works for you, have a great day Regards","Hi Charles,Way too many distracting elements to this story! The direct copy function on the multifunction machine in question is producing copies in which the black is way too light if requesting a color copy, but look just fine if a black & white copy is requested. Printing and scanning work fine in either mode. For a while, it was not visible from computers that were accessing the network through the WiFi, although it was working just fine if the computer was using a wired connection. Both the printer and router were showing that it was being assigned an IP address. I finally diagnosed and fixed that problem by restarting the router. I'm hoping that pushing a firmware update will fix the copy function, but when I attempt to do that, I get the message that the firmware is current and no update is needed. Eventually I'll find instructions on how to force an update. In the meantime, it's only annoying and frustrating.My apologies, because none of the above information is really relevant to this forum. It does, however, illustrate the number of apparently unrelated and frustrating glitches related to printing that we experienced almost simultaneously.Thanks,Barry ","Hello Barry!Did you ever find a solution to this issue? It would be nice to not have to run to the plotter to cancel incorrect prints.Best,Becca","Hi Becca,No solution yet, but I've been more than a little pressed for time lately, and thus far the problem has been more frustrating than hindering.Can you access the printer queue from either Print Management or running Device Manager from the Start menu? I've attached screenshots for those. To get the queue from the Print Mangement tool, select More Actions under the printer on the lower right.My apologies if this is too elementary or if you've already tried those solutions.Barry","Good Morning Barry,Yes, thank you! I can get into the print management portion. Our print options are a little screwy because the default drivers were installed incorrectly and we had to reinstall the correct ones, but I can get to the queues this way. It was no rush, I was just curious.Thanks a bunch!Becca","I did find a solution, I had the same problem for ALL my local printers on a system that we use for shipping.  It has a network laser printer that was not a problem, but a local laser printer and three Thermal Label Printers that were all problematic.  The problem cropped up after upgrading the system from Windows 7 to Windows 10-1903.I was able to resolve the problem by logging in as a local admin and removing all the printers.  Then logging in as a regular local user and reinstalling all the printer.Hope this help.V\/r,Dave","Hi,This appears to be a bug in Windows 10 (not sure when it appeared but it's been there for months).It is a user interface bug - when you click Windows things you are clicking on the printer below rather than the button.A work around is to click on the printer name then press tab once (for Open Queue) or twice (for Manage) and then press space.I am pretty shocked this sort of bug escaped QA for so long, it is pretty embarrassing to be installing new computers with Windows and have to explain why the new one has this user hostile behaviour..","I reported this in the feedback app FWIW https:\/\/aka.ms\/AA6yzmz"]},{"symptom":"Wireless network adapater disabling itself        My Acer Aspire E3 has worked wonders for years. I've kept it in tip top shape. Virus scans, regular hard drive maintenance, all that fun stuff. Ever since the last Windows update my network driver is disabling itself.When I try and connect to my home network, which has 2\/3 or 3\/3 bars consistently, the adapter disables itself.Resetting (router and laptop)Windows trouble shooter (lol) Rolledback and updated driversUninstalled drivers and re installed them Configured various power settingsRestarted with & without automatically connect enabledForgetting network & reconnectingDisabling Ipv6 and rebootingNetsh\/ipconfig flushing\/renewingSetting\/resetting Network bandwith to various settingsDisabling firewall\/anti virusMy phone and Playstation have 0 issues with connection. The network says \"Secured\" then when I connect it either disables my network card or gives me the oh so useful error message of \"Can't connect to this network\". Before anyone suggest reinstalling things or rolling back something, or 'turn it off and on'..I went to school for computer programming analytics and networking technical support. I've reached out to others even better at IT than I, still no luck. I'm ready to switch to Linux.","solutions":["Hi RaibowAlpaca, There's a lot of things to consider in regards to your concern. Please check this article for possible solution to your current issue: https:\/\/www.makeuseof.com\/tag\/fix-windows-10-wi...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Nope. After unsintalling the drivers the situation is now worse. Now it's only finding my home network with minimal signal, and no other networks. I also had already tried everything on that list prior to you posting that link anyway, excluding uninstalling drivers.Even though it's finding the network the same connection issue is still persisting.I could see all the WiFi networks in the neighborhood prior to that \"fix\".","Hi RainbowAlpaca, Based on the information that you gave, you could see all the Wifi Networks aside from your own network.Then definitely the problem is your Router I believe so. Did you tried hard resetting it as well using the Pin Hole? Also, did you tried contacting your ISP for replacement? Please update us and we will be waiting for your feedback. Thanks and regards,","Well there are several other Mac Addresses connected to the router. All with successfull connections. If my laptop is only finding one network out of the 12 around me, I don't understand how my router would be the issue. I'm not even connected to it. Why can't Windows find the other networks?As for the \"resetting\" suggestion. I wouldn't be requesting Microsoft support if I hadn't already done the usual Google-able tech fixes. I ran my computer with a bootable Linux USB and using a Windows XP VM I was able to connect. So it's Windows. For sure. Also with this new update when I reset my computer via Windows taskbar the OS will sometimes crash. Not if I restart via .bat file scripts though."]},{"symptom":"BOOTING UP WINDOWS        My computer screen only shows the message bellow and wont detect the windows DVD to install. I have changed bios settings(booting priority for the Hdd\/external drives) and even tried to boot from the last known installation by pressing F8 but even that doesn't work. please advise accordingly. I do not want to use third party software.","solutions":["Please answer as many of these questions as you can.  Maybe I can advise you.Laptop or DesktopAge of computermake\/modelOperating system installed (e.g. Windows 7)32 or 64 bit? (Right-click on Computer, choose Properties)Service Pack 1 (SP1) installed? Same place as 5 above.Capacity of disk drive, how much is in use?  Pie chart shown in ComputerModel number of hard drive (click Disk in Device Manager)If Windows has ever been re-installed since it was new, when was that?Age of hard drive if not the originalHow much memory is installed? (Right-click on Computer, choose Properties)Please list ALL installed programs.....What security software is installed?Is your internet service wireless or wired?","See if this assists you:https:\/\/superuser.com\/questions\/433753\/this-cpu-is-not-compatible-with-64-bit-mode-installing-windows-7-ultimate-6And this: https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/0xc000035a-when-trying-to-re-install-7-enterprise\/818ceed9-8224-4cdc-98d1-7a57235641e4Cheers."]},{"symptom":"Office Upgrade        I have Office enterprise and have read that I can upgrade to office 2013.  Is this a true statement?","solutions":["You need to go to the Office forum.","Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Could you clarify what version of Office you have at the moment, do you mean you have an Office 365 enterprise subscription?Regards, Ross"]},{"symptom":"CA Workstation Cert Gone After In-Place Upgrade Task Sequence        After an in-place upgrade using a task sequence the trust cert for our LAN connection is gone and the machine can no longer connect to the network to get another cert from gpupdate. Tried to export cert via powsershell but its a non-exportable private key and cannot add it to the in-place upgrade task sequence. Is there a way to copy the cert from the old profile and move it to the new profile in the task sequence via powershell?","solutions":[]},{"symptom":"I have a lenovo touch screen, why my keyboard comes up to log on; but stopped coming up on my screen to work?        have a  Lenovo all in one with touch tablet, my\" key board \" works ok  to log in my (pass phrase)  but don't come up on pages to type . do any one have a cure?           ******@outlook[PII is masked by MSFT Support] ","solutions":[]},{"symptom":"Code of conduct violation?        I just posted a discussion that was deleted by a moderator.I'm puzzled as to what I did wrong so that I won't do it again. (that's not sarcasm) I'm being sincere here.I really needed advice on the subject.Would the moderator please inform me on how I \"misbehaved\" or what I did wrong?","solutions":["You also posted a question after that about the same problem, which has more notice than a discussion.You don't post a question and a discussion about the same problem (duplicate threads).https:\/\/answers.microsoft.com\/en-us\/page\/faq#faqCodeConductPlease don't:Divert or change a thread for your own purposes; just start a new thread with the subject you want to discuss.Post questions that are the same or similar to questions you have already posted. When someone has an answer or a reply, that person will respond to you.Two threads about the same problem causes problems as no one knows what others have posed in the other thread.Regards.","Thank you for replying so fast.I sincerely didn't mean to cause trouble, but the two issues are interrelatedThanks","No worries at all.It's something that if we see duplicates when we are in the forums helping with questions, we tidy it up.FYI: And more people are likely to help with a question posted, than a discussion.Cheers."]},{"symptom":"how to set up alexa app on windows 7        how do I set up an app for amazon alexa ? as the grandkids are going ape help me please","solutions":["The Alexa \"app\" is installed on a smart phone or tablet (e.g., an iPhone or iPad).  Assuming that you have a new Amazon Echo, instructions are here: https:\/\/www.amazon.com\/gp\/help\/customer\/display.html\/ref=hp_left_v4_sib?ie=UTF8&nodeId=202189140If you have a computer with wi-fi capability (most laptops), you can configure Alexa by going tohttps:\/\/alexa.amazon.com\/In either case you'll have to have (or create) an Amazon account.  If you're going to use your own Amazon account, after you have things set up, you probably should go to Settings > Accounts > Voice Purchasing and either disable purchasing or set a \"voice code\" for authorizing purchases.  Otherwise, your grandkids may put your bank account on a diet.","How do I set up Alexa on windows 10 ?","What part of the previous response did you not understand?","You moderators don't understand the question.  Your answer is for how to set up Alexa on a smart phone or tablet (apple or android).  The question is how to set it up on a Windows 7 PC.  The true answer is you can't.  It's funny that Microsoft has Alexa apps for IOS and Android but not for Windows, it's own product.","You moderators don't understand the question.  Your answer is for how to set up Alexa on a smart phone or tablet (apple or android).  The question is how to set it up on a Windows 7 PC.  The true answer is you can't.  It's funny that Microsoft has Alexa apps for IOS and Android but not for Windows, it's own product.\"You moderators don't understand the question. Your answer is for how to set up Alexa on a smartphone or tablet (apple or android).\"Except for the fact that the first response told you that you had to use a mobile device, or a web browser (limited) to set her up. The only way you could set her up on your PC would be *gasp* a web browser.\"The question is how to set it up on a Windows 7 PC. The true answer is you can't.\"As stated above, that is pure BS. You set it up via a web browser if you don't want to do it via mobile.\"It's funny that Microsoft has Alexa apps for IOS and Android but not for Windows, it's own product.\"This clearly shows you tech illiterate because anyone under the age of 35 would know that Alexa is created by Amazon, Inc. Microsoft's personal assistant is named \"Cortana\" which is on iOS, Android and Windows.So please, before being ignorant to the responses given, read what is posted, and don't assume anything, because the Alexa owned by Microsoft part just made you look ridiculous. ","You moderators act like typical IT geeks. Explain how to set it up in win 7 whether it be browser or otherwise. In Clear Laymans Terms!","Thank you.","How do I set up Alexa on windows 10 ?PLEASE HELP ME","If your Windows 10 device has wi-fi, go to https:\/\/alexa.amazon.com\/spa\/index.html, click \"Settings\" and then click \"Set up a new device.\"If your Windows 10 device does not have wi-fi, you need to find another device, like a smart phone, that does have wi-fi. ","You moderators don't understand the question.  Your answer is for how to set up Alexa on a smart phone or tablet (apple or android).  The question is how to set it up on a Windows 7 PC.  The true answer is you can't.  It's funny that Microsoft has Alexa apps for IOS and Android but not for Windows, it's own product.Microsoft doesn't own Alexa. Amazon Does. Microsoft owns Cortana."]},{"symptom":"Prepairing for Windows 10 Merge        I am preparing for windows 10 merge from windows 7 and in doing so ive been trying to back up my files programs etc on a removable flash drive. However every attempt to start the backup procedure my whole system freezes up and the only way to get out of the freeze is to unplug the power cord to my laptop. Ive run a registery cleaner an its good, ive run a disk cleaner and its good. I always keep a good antivirus running along with a good firewall. I intense malware program is always at bay. I do however have a hugh hog of a fake antivirus app called Segaurazo and ive tried everything possible to get rid of but cant. Please help ASAP so I can make the transition of windows 10 a clean install. Desparately and urgently waiting. Larry O.  ","solutions":["You can't back up programs unless you use a System Image Backup (Complete PC Backup).And you can't use that on Windows 10.But if you have to reinstall 7:These are quite good programs to use for Complete PC Backup and are free:\"EaseUS Todo Backup Free\"http:\/\/www.todo-backup.com\/products\/home\/free-backup-software.htm\"Welcome to EaseUS Todo Backup Manual\"http:\/\/www.todo-backup.com\/support\/help\/http:\/\/www.todo-backup.com\/download\/docs\/User_Guide.pdf______________________________________________\"AOMEI Backupper Standard\"http:\/\/www.backup-utility.com\/free-backup-software.html\"Configure and automate AOMEI Backupper in Windows\"https:\/\/www.winhelp.us\/configure-aomei-backupper-in-windows.html_____________________________________________\"Macrium Reflect Free\"http:\/\/www.macrium.com\/reflectfree.aspx\"Macrium Reflect Tutorial\"http:\/\/www.macrium.com\/webtutorial\/tutorial.asp@@@@@@@@@@@@@@@@@@@@@@@@@@Programs should be reinstalled from the original media (DVD, download, etc.).You can't copy\/paste installed programs from the programs folder and think that's it, as when a program is installed the files are spread throughout the operating system, in the registry and file association for other programs, etc., etc.You should also check with the program manufacturer to see if programs are compatible with 10.If they aren't:Make older apps or programs compatible with Windows 10https:\/\/support.microsoft.com\/en-au\/help\/15078\/windows-10-make-older-apps-or-programs-compatible_____________________________________For data:The simplest method is to copy\/paste your data files to USB flash drive > then plug flash drive into Windows 10 > copy\/paste files through File Explorer on 10.Or read through this Microsoft information:Move files off a Windows 7 PC using Backup and Restore.Applies to: Windows 7 Windows 10 https:\/\/support.microsoft.com\/en-au\/help\/4469209\/windows-7-move-files-off-pc-using-backup-and-restoreMoving to a Windows 10 PC.Applies to: Windows 10Windows 7Windows 8.1https:\/\/support.microsoft.com\/en-us\/help\/4229823\/moving-to-a-windows-10-pc@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Microsoft has partnered with this company back from the XP > 7 days.Personally I don't use it.It does not come for free: https:\/\/www.microsoft.com\/en-us%2Fwindows%2Ftransfer-your-dataMove your files, folders, and more to your new Windows 10 PC for only $14.95.* Microsoft has partnered with Laplink to provide you with a special offer – for a limited time, save 50% off the regular price of $29.95 for PCmover Express.@@@@@@@@@@@@@@@@@@@@@@@@@@@But that program does go further to move programs for more money with the Professional version $44.95.https:\/\/pcmover-10.laplink.com\/index.html#pro@@@@@@@@@@@@@@@@@@@@@@@@@@@@Get rid of that malware first; otherwise it will be going into the System Image Backup, etc:http:\/\/www.malwarebytes.org\/products\/malwarebytes_freeRemoval instructions for Segurazohttps:\/\/forums.malwarebytes.com\/topic\/249582-removal-instructions-for-segurazo\/","This seems and sounds logical and thus answers my delima on why I couldn't use backup and restore functions like I tried to do. I'm going to try one if the back up programs you talked about and I'm hoping that a 64 gig USB flash drive should be ample storage for everything I need and want to back up. Don't you think?  If not please let me know and  I'll try to cough up more cash for another flash drive. Please stay on alert for my post cause I'm going to try and make all this happen in the next few days. Thanks so much for your speedy reply, I really appreciate it and I plan to use your info top hand. I'll try to keep you posted on the outcome of my adventure. I'm just a little apprehensive that I'm going to make a big mistake and foul everything up. It's just been over 15 to 20 years since I've tried to play with a operating system. But that's what you are here for to help and guide us through. Right?  Have a good day and I'll let you know my outcome.","The thing is the built-in Windows 7 data backup and system image backup is totally unreliable.Most of us that work with computers for a living and come here to help others (we don't work for Microsoft) have been using 3rd party programs for years because of it.Macrium Reflect free is what I useAnd for your docs, photos, etc. a manual backup is the best way.Flash drives are not the most reliable piece of hardware to use for long term backups.I recommend and use USB external hard drive for it, especially for system image backups.Cheers."]},{"symptom":"Keyboard malfunction        My keyboard has decided not to work.  It will work when I type in my PW to sign on but not once I sign onto my device.  I have to use one of the on-screen keyboards.  Does anyone know why this is happening and\/or how to fix it?","solutions":[]},{"symptom":"settings configuration        I have refreshed my Netbook and when configuring it to remove the \"sleep\" option from the power menu, the box will not un-check. Is there a way to correct this? thanks ahead.","solutions":[]},{"symptom":"microsoft bingo        it wont start and it keeps stealing my bingos  it has a server error","solutions":["Hi Bob, Online gaming requires periodic resetting of your network configurations. It is one of the maintenance procedures that help refresh or repair your network connectivity. In this way, it could eliminate unable to connect issues, resolve latency, andwill return your network status like when you started using the Internet. To resolve your concerns regarding your connectivity with Microsoft Bingo, we suggest that you reset your TCP\/IP or Internet Protocol to its default settings. To do this, follow the instructions below:Step #1: If you're connected to a Wi-Fi router, check your Wi-Fi router if the green lights for Wi-Fi (WLAN) and Internet are both blinking. This means they are switched on and enabled.Step #2: Run the Network troubleshooter. To diagnose your network configuration, perform the steps below:1. Open Start menu, then click Settings icon. 2. Click Network & Internet. 3. On the left pane, click Status. 4. Click Network troubleshooter to diagnose and fix network problems. Step #3: Perform an Internet connection reset via Command Prompt. To do this, follow the steps below: 1. Press Windows + R to open the Run window. 2. Type cmd, then press Enter. 3. Type the following commands, then press Enter after typing each commands below:netsh int ip reset resettcpip.txt netsh winhttp reset proxy netsh int ip reset ipconfig \/release ipconfig \/renew ipconfig \/flushdns netsh winsock reset 4. Restart your PC to complete the process. Step #4: We also suggest that you restart your router and wait for 15-30 seconds then turn it on again. Visit this link:Fix network connection issues in Windows 10 for more troubleshooting alternatives for your Internet connection. Updating yourEthernet adapter driver is also suggested there. Step #5: Ping Microsoft server then tell us the result through a screenshot. 1. Press Windows key + R to open the Run window. 2. Type cmd, then press Enter. Type ping www.microsoft.com and press Enter. If you receive 4 replies, it means that your connection with the website is working properly.If you got a request time out, it means that your connection has issues. Step #6: Disable all other anti-virus programs and enable Windows Defender only. Source: https:\/\/www.windowsphoneinfo.com\/threads\/when-w... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"Windows Explorer search field stopped reacting        Hello there,A few days ago I installed Nov2019-update for Win10, and after that in Windows Explorer search stopped working.When I search for things from Start panel - all works fine, but when I open some folder and try to put the cursor to the top-right field in order to search for smth, that field simply won't work. Cursor won't show itself in the field, and therefore I cannot even start typing anything there at all.The searching service is loaded and works, problem in just with searching within Windows Explorer.I wonder how could this be fixed? ","solutions":["Hi, Inscriptor My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps: Press the Start key and type the word CMD or Powershell, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanup-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/947821...","Hi, JeffreyThey say, \"Windows updates and service packs may fail to install\" - but the updatehas been installed. Bug is not in the inability to install the Nov-19 update.Also, what if the search bug was caused by a different reason - how would those commands help me then?","Just checked:[==========================100.0%==========================] No component store corruption detected.","Hello, Please run Search and Indexing troubleshooter from Settings app > Update & security > Troubleshoot. See if it helps you.Hope this helps!","It doesn't help, I tried it. It says, it couldn't identify the problem.Problem still persists.","I recommend you to repair Windows Completely before you must backup your personal files, the third-party software will be deleted.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I've just found a strange and weird workaround. To open the (old) Control panel, search something there, then at the same address bar select D: drive and navigate to required folder, then search bar works for some time.But when I close this Explorer window and open a new one, search bar in it again won't work.I do need this option at work and at home A LOT, please provide a solution that will really fix the issue once and forever, without any workarounds.","Hello,Resolved the issue starting the ctfmon.exeHope it helps.","Tried, won't help.","Hello.Same issue here. I have no solutions ATM."]},{"symptom":"BSOD \"attempted write to readonly memory\"        I've had this error happen atleast 3 time this week, i've included minidumps and i also ran sfc \/scannow and have CBS.log and followed through with chkdsk C: \/f \/r \/x and had to restart and it did it's thing but not sure if it fix this issue .  I've attached a link to onedrive with 4 of the minidumps and the most recent one 12\/28\/19 6:39PM . Any help would be appreciated. Cheershttps:\/\/jxjjxy-my.sharepoint.com\/:f:\/g\/personal\/sfktevtzi_t_odmail_cn\/EhkSwpfULXxGiwSGFgoDQyQBdYA7xml5Pw4jDskWqdePGg?e=1MGnpw","solutions":["Hi Vert, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.The crash was caused by memory corruption,most probably caused by a 3rd party driver.The next step, Let us try finding any misbehaving driver Enable Driver Verifier: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...(Must create a Restore point before) Upload the newer dumps when you get Driver_Verifier_detected_voilation. Please note that the system might crash before you reach the desktop-if it does please let us know so that we can guide you to disable Verifier.Technical Information: IMAGE_NAME:  memory_corruption","Hi Sumit, thanks for quick reply and help. After some trouble booting up I did verifier\/reset in order to get back. I've uploaded the file as instructed. Cheershttps:\/\/jxjjxy-my.sharepoint.com\/:u:\/g\/personal\/sfktevtzi_t_odmail_cn\/EVtfEUMB38VPoymav8g5KXkBlKXOoZ8PT43dKZdxw0gMrQ?e=OKewmA","Driber verified and it looks like DAEMON Tools Lite is causing the crash, which is known to do so.Please uninstall the same and let us know if it crashes again. Techincal Information: FAILURE_ID_HASH_STRING:  km:0xc4_2000_vrf_dtliteusbbus!unknown_function","Appreciate the your help. If anything pops up  again will report. ","Looking forward to the results. Happy Holidays and wishes for a wonderful new year.","Hiya again, I've had another crash with same error bsod. The computer was idle, I had left for 30 mins to do errand and came back to find it in blue screen. I uploaded the minidump it produced. https:\/\/jxjjxy-my.sharepoint.com\/:u:\/g\/personal\/sfktevtzi_t_odmail_cn\/EaCX7LKBKoNCtJpr_exGpbkB-l0-T8TqghDETkcmN1EDRg?e=1Nl7xC","The most recent crash was caused by cdflt.sys which is a component of Windows.Looks like a Memory test is required. I suggest you to Run memory test for at least 8 passes, preferably Overnight. https:\/\/www.tenforums.com\/tutorials\/14201-memte...When the test completes post back the Image(You can use your phone's camera). Disclaimer: There are links to non-Microsoft websites which would provide accurate and safe information. Watch out for ads on the sites which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","Hi,I get a BSOD on My ACER and the following message:\"ATTEMPTED TO WRITE TO READONLY MEMORY\"\"What Failed: BHDrvx64.sys\"Can anyone help solve this please?  System spec is: ","Hi, it's taken me a couple of days to get back and my question is since i could not successfully boot into memtest86+ I had to resort into installing the uefi free version thats compatible with my system called \"memtest86\" . Will the test return same results your expecting? I read in the forum that as soon as you saw errors to shut it down as that means either dimms or cards are damaged.  Should i still follow through with 8 passes? Since i just started ill keep it running. Will running this software direct me to the damage(d) item(s)?","I decided while memtest86 is running i could research my current mobo tuf-z390 plus gaming(wifi). I checked out the Qualified Vendor list and to my disappointment my ram part # F4-3000C15D-16GVR does not show up. Is QvL just a recommendation or tested ram that work %100 .  I found other G.Skill rams  with same setup of 4gb x8gb."]},{"symptom":"Windows 10 hard drive failure and license to new drive        My laptop has a hard drive that is failing. It is running Windows 10. I have downloaded the ISO, but need to know how to activate the license on the new drive.Thanks!","solutions":["Good, keep me posted."]},{"symptom":"W10 1909 Won't Allow Desktop as Dnload Target - How Do I Change That        W10-64 1909 Up-to-Date .... For All App Update Dnloads I'm (only recently) having W10 \"insist on\" the Dnload site as -- C:\\user\\MyNameAdmin -- folder Vs. the long-time Firefox \"Desktop\" designation.Clk to Desktop target nets ---\"You do not have permission to install at this location (I am always in Admin acct) . Contact Admin for permission. Do you want to dnload to MyNameAdmin?\" .Any Name Chg or Delete for a desktop shtcut gets an Admin popup easily solved by clk'ing Continue.Does anyone know of how I might change this denial for Desktop Dnloads (main issue), & Del  -  Name Chg as a bonus?","solutions":["Hi Craig, You can check this article for full guide on how to set your Download Target Folder:https:\/\/windowsreport.com\/change-download-locat...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Thanks for the Reply. The Move function looked right but did Not work.In Explorer I tried the \"user\\MyName Admin\" Acct\\Download Folder\\Properties\\Location tab\\Move \\chose Desktop\\ A Download Folder allegedly should have been created in Desktop Folder, but Was Not\\ Re-Started .... BUT it still gives the Not Authorized to download there - Contact Admin when Desktop is Selected -Firefox has Always seemed to control the Desktop dnload location and my Admin Acct \"Downloads Folder\" has never been used as far as I remember.Just a weird Windows thing that just started but I can live with it if necessary.Thanks again!","Hi Craig, Can you confirm if your current account is an administrator? Can you try to switch to an admin account then try this again? I'll be waiting for your response. Thanks and regards,","EDIT: I Have since Dnloaded to Desktop FROM the Admin backup Acctbut my expertise won't tell me much more.In the main Admin Acct the Desktop Properties Security Tab shows the Administrators line, Everyone, and System; In the Admin Backup Security Tab it shows BOTH the Admin line from the main Acct AND the Admin Backup line (not Everyone) - IS THAT relevant?W10 Settings\/ Accounts\/ My Info-  shows Local Acct - Admin;Start Menu shows MyName Admin \/Rt Clk  Chg Acct Settings (currently) shows Local Acct - AdminOther than -- Me Admin Backup (shows Local Acct\/ Admin)-- I don't even see a Local user acct ( Me\/wife Only users) unless a Default one is hidden.Thanks for the Reply. No intention to make this a project for you. Just hoped for past experience to offer a known fix.","SOLVED: In the Desktop Properties Security tab I gave -- Everyone -- Full Control and a Test App Dnloaded to the Desktop.Thanks again, Richard, for your kind efforts!!","Hi Craig, Thanks for confirming the resolution for this issue. I will mark this question as resolved. You always have a good day! Take care"]},{"symptom":"Win 7 Disk Cleanup disaster        Edge Version 79.0.309.43 (Official build) beta (64-bit)Windows 7Since being unable to save enough for a new computer, I decided in prep for the 14th by doing a disk cleanup on my C;\\ drive last night.B I G   M I S T A K EI had no idea that disk cleanup automatically looks for updates and installs them whether you want them to or not!!! (especially since I configured it to only install updates manually) I discovered this when I rebooted it when it was done cleaning up, and was told it was configuring updates and not to turn off the computer. Having no choice, I let it go and after the reboot, it hung at 100% and stayed there for an hour.I shut the computer off, and it booted up fine. (premature sigh of relief)I tried to go on line and discovered that Edge had gone back to where it was when I first installed it. I'd lost my favorites, my ad blocker, dark mode and all my passwords.I decided to go with panic mode first resort and did a system restore back to the 8th (yesterday) whirrrr click click. System hung on the initializing screen and after half an hour would go no further.Shut it off rebooted in Safe mode and tried again... same thing.Rebooted and thought maybe if I uninstalled whatever the updates were, that'd fix it.Checked and discovered it'd installed 31 updates that I'd skipped over the last year or so, which I then uninstalledRebooted and tried system restore again, still no luck, hung at initializing.Now I learned from experience, and last month I made a copy of Profile1 in my user folder \"just in case\"Using that I'm back on line with this warning to othersREGULARLY BACK UP YOUR EDGE PROFILEAside from lost recently-added shortcuts it's back to normal, with ad blocker etc. back... but I can't get system restore to work at all and it was working fine last monthany suggestions?One other detail... I'm using a miracle machine-a HP desktop bought in 2005 which originally had XP on it, updated to win7 home premium and apparently can't be upgraded to Win 10 - Except to change the CD\/DVD burner 3 times, it's been trouble free!!!!!!!!!!!I'm existing on disability checks and can't afford a new computer yet","solutions":[]},{"symptom":"Changing region        Hey,I'm having problems changing the country\/region when filling the shipping category. It's on USA and it won't let to change it to anything else. I'd be very glad if somebody could help.","solutions":["Hello, I'm Didi, an independent advisor. To change your country \/ region in the Microsoft Store please follow this guide :https:\/\/support.microsoft.com\/en-us\/help\/403926... Regards, Didi","Hello Deadbirdo, The tutorial below can help show you how to change your region in Windows 1****0-a.html"]},{"symptom":"LT MDMI to TV no audio on TV        I have an up to date Win 10 LT, which I have used to watch videos via a MDMI cable to my TV (Vizio 3 yrs old) for many months. Now, with no changes on my part, I can watch the videos but get no audio on the TV. In fact, the TV audio speakers have disappeared from my sound devices list. I have read on a few help forums and have tried the various things, to try to make the TV speakers show on sound choices, to no avail. I've exhausted my limited tech knowledge and need help. If the help is not to complicated, I will try any solution. I have no idea what has caused this change of LT\/MDMI\/TV\/speakers settings, as I have done nothing different or changed any settings. Thank you. SR","solutions":["Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.Try this Right click start button and choose Device Manager Expand Display Adapters Right Click NVIDIA GeForce or whichever adapter is listed other than Intel and choose Update DriverClick Browse My Computer Click Let Me Choose From List Choose NVIDIA GeForce from List Press Enter Then close and re-open your TV and restart the computer Marco"]}]}