{"windows":[{"symptom":"Child account and windows chrome- can't access. Constant msg 'ask adult\/ admin for permission'        Can anyone help please? ALl filters removed from 17 YO child but he still cant access chrome. 2 hours wasted trying to resolve","solutions":["Hi frustratedMy name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.So I can advise you better and understand your issue can you answer the following question.Has chrome been restricted by windows 10 parental controls or the restrictions within Chrome?"]},{"symptom":"Disable  \"Check Firewall Status\" Notification        Hello,This question has been asked before  but it doesn't appear to have been solved.  I support users who somewhat inconsistently receive the \"Check Firewall Status\" notification when their domain firewall is off.  I wont go in to any extra details but I can promise that it does not need to be on and am hoping for a solution besides just turning it back on.  Just for clarification so this isn't misinterpreted:I am not looking for a way to turn the firewall on or offI am not looking for a way to suppress firewall notifications about blocked connections and whatnotI would prefer to not disable or hide the entire notification or action center.Any help would be really appreciated thanks.","solutions":["Hi, You should be able to disable this from Settings > System > Notifications & Sounds > and disabling Security & Maintenance. Keep in mind though, this is the complete group so if you use services like Windows defender this would disable those notifications as well. Alternatively you can do the same by editing the registry; HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Notifications\\Settings\\Windows.SystemToast.SecurityAndMaintenance\\Enabled = 0 (DWORD) Currently it is not possible to disable only the firewall notifications. If you would like to see this added, I would recommend leaving feedback in the Feedback Hub app.i hope that helps"]},{"symptom":"Windows 10 activation issues.        Whenever I try to activate windows, I get this message:Something interrupted out troubleshooting. Make sure you're connected to the Internet, wait a few minutes, and try again. (0x80070057)I get this message even though I am connected to the internet, and this issue has lasted over several days with several restarts so it can't be that. If anyone has a fix, please share it!","solutions":["Hello Fancy03, I'm Didi, an independent advisor. Try to put your Windows key in Settings > Update & Security > Activation > Change Product Key.Where did you buy your Windows key ? If you bought it from an unreliable source it could cause this error.If the problem persists try to contact Microsoft support directly : Via phone : https:\/\/support.microsoft.com\/en-us\/help\/405170... Via chat : https:\/\/partner.support.services.microsoft.com\/... select \"Contact support in the browser instead\", talk briefly about your exact problem and if you keep saying it didn't help it should connect you with an agent.Regards, Didi","I bought my windows key off of eBay, but this seller has worked for me before so I think this computer might have an issue with it.","Hi Fancy03, Try to contact the seller to make sure with him that the key is genuine. Also contact the Microsoft support with the links I gave you previously, they should be able to fix the issue if your key is valid.Regards, Didi"]},{"symptom":"ntoskrnl.exe system process that causes internet to \"disappear\"        Hey, ever since I built my new computer I've gotten this system process that causes my internet to \"disappear\"(don't know how to say it better) for 10-30 seconds. It can happen at random intervals (5-20 minutes), but it also often happens right after I do something, for example send a message in discord or click a link on google. It doesn't affect games, but apps like discord, google chrome and spotify are affected. When I click the process and open file location it highlights ntoskrnl.exe. How can I fix this? Thanks!","solutions":["Hi, Simon121 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps to repair your Internet connections: Enter the Start menu or by pressing the Win + I key combination, open the Settings and click on the Network and Internet option. Once there, we select the Status option from the menu on the left side and, within the configurations and options that are loaded in the right panel, we have to look for the restoration of the network. When you click on this option, it will show us a new window from where we can restore the network in Windows 10. In this way, all network adapters will be removed and reinstalled, and the original configuration of other network components will be restored. net. This implies that if we were using some software, such as a VPN client or virtual switches, we will have to reinstall them.A process that the system performs automatically by clicking on the Reset button that is now displayed in Network Reset in Windows 10 settings. It is normal for the process to not take long, although we must wait until the end completely and restart the computer to continue with the network configuration in Windows 10 as we have done so far.https:\/\/www.kapilarya.com\/how-to-reset-network-...https:\/\/support.microsoft.com\/en-us\/help\/10741\/...You can also check that your drivers are updated. https:\/\/support.microsoft.com\/en-us\/help\/402844...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","This didn't work","Hi Simon My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Ntoskrnl.exe (Short for Windows NT operating system kernel) otherwise known as kernel image, is a system application file that provides the kernel and executive layers of the Windows NT kernel space, and is responsible for various system services such as hardware virtualization, process and memory management, thus making it a fundamental part of the system. It contains the cache manager, the executive, the kernel, the security reference monitor, the memory manager, and the scheduler.I would recommend updating your drivers and running an anti virus and anti malware scan. Let me know if you need further help doing either of these.Hope this helps.","Drivers are updated and I ran a full scan with my McAfee, but it didn't solve it","Some ntoskrnl issues can be caused by faulty memory (RAM). Try running the Memory Diagnostic Tool in Windows 10.The full path of the Memory Diagnostic Tool is: %systemroot%\\system32\\mdsched.exe eg. c:\\Windows\\system32\\mdsched.exeStart the Windows 10 Memory Diagnostics Tool via Run-Dialog [Windows-Logo]+[R] and the command: mdsched.exe!Select Restart Now and check for problems, the Memory Diagnostics Tool will run automatically when you restart the Windows 10.","No problems were detected","Try running the system file checker to check for corruption.Press the Windows key, type cmd and then right click Command Prompt (Admin) to open the Command Prompt as an administrator.When Command Prompt opens, enter sfc \/scannow and press Enter.The repair process will now start. Don't close Command Prompt or interrupt the repair process."]},{"symptom":"HP8700 officejet says no driver available. It was workong with this PC earlier. Power cycle didn't help        I have windows 10 on a laptop. I have an HP 8700 that was working with this PC earlier. Went to use a little while back and all I could get out of it was the printer is in an error state. It still works when using a different PC. I removed the printer in settings and then reinstalled it. I get the same error state message or one that says no driver available. What gives???","solutions":["HP says this-- https:\/\/support.hp.com\/us-en\/retired-productsThe 8700 is no longer supported.  ","Hi TonyaGarrett1, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Let's try to find a solution to the problem, through the following steps: 1.- Let's execute the troubleshooting of Windows >> Printer and observe the behavior.Press Windows key + I >> Settings >> Updates & security >> Troubleshoot >> Printer (Click on this option) >> Run troubleshoot.2.- Uninstall and install the printer at the Windows level in Control Panel >> Programs and features >> Select the printer >> Uninstall. Then go to Control Panel >> Devices & printers >> If you look at the printer >> Select and right-click >> Remove, then go back to the desktop and run >> Windows + R >> Run, type: printui.exe \/s + Enter >> Drivers >> Remove the printer drivers, restart the computer, then install again. I add the official drivers of the HP pagehttps:\/\/support.hp.com\/us-en\/product\/hp-officej...https:\/\/support.microsoft.com\/en-us\/help\/401540...If the problem persists, you can try to contact the brand manufacturer to verify the appropriate driver.Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"settings for connecting router        each time trying to connect router through cable modem i lose internet, new router but internet does not get through it . also recently upgraded to win 10,is there some setting to change? have tried all trouble shoot,  please anyone, have been battleing this for long time,  ","solutions":["Hi sdmadw, I will release the question for other experts come to give his opinion, I am sorry not to find the problem.Thanks!","Hi sdmadw and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.Could you provide some further details? 1. What type of cable you are using? 2. Is it crossover or straight through? Thank you!"]},{"symptom":"Windows 10 Pro for refurbished PC        Hello.I recently purchased a refurbished laptop, that came with Windows 10 Pro, but would not boot completely into the operating system.  Since it would not boot completely, I could not navigate to the restore or fresh start options, to restore the operating system to working status.  I used the media creation tool, to make a Windows 10 installation media, on a USB drive.  However, every time I try to install Windows 10 Pro, the installation media installs Windows 10 Home instead.  When I try to upgrade Windows 10 Home to Windows 10 Pro, using the serial key on my COA sticker, it tells me that the serial key did not work.What I need to know, is how I can get Windows 10 Pro reinstalled on my laptop, using the serial key that came with this refurbished laptop?","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.The system probably has a built-in key for Window 10 Home in the BIOS and the installer is automatically picking it up and using it and not giving you the chance to select Pro.Also the refurbisher code won't be valid to upgrade from Home to Pro which is what it thinks you are trying to do.What you should do is try to upgrade from Home to Pro by entering the \"default\" Windows 10 Pro key. This should allow the conversion and after doing that you can change key to your proper key and get reactivated. The default key is: VK7JG-NPHTM-C97JM-9MPGT-3V66TThe full details are explained in this article which covers almost the same situation you've found yourself in:https:\/\/softwarekeep.com\/help-center\/how-to-upg... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Regards, David"]},{"symptom":"Activation code        I need activation code to upgrade my Driver Tonic","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Driver Tonic is an app with dubious benefits - rather than activate it you might actually be better to remove it. You can do that by going to START >Settings (the cog) > Apps. Then find Driver Tonic in the list click it and choose Uninstall.If you're interested to see more information about this app have a look here: https:\/\/geeksadvice.com\/remove-driver-tonic\/ Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Regards, David"]},{"symptom":"how to mirror my computer to viera tv        how do I internet connect my computer to my Viera tv","solutions":["Hello stuartbinder, my name is Farah and I'm an Independent Adviser. I can help you regarding this question- Type in start menu \"connect to a wireless display\" and open it - Scroll down to connect to a wireless display and click on it, a new side window will open, and your TV should Appear in a moment. choose your TV and click on connect.it will mirror your PC to the TV Feel free to ask any questions if you have Regards Farah","Hello Stuart, The tutorial below will help show you how to connect to a wireless display (ex: viera TV) in Windows 10 to mirror your PC display to the TV.https:\/\/www.tenforums.com\/tutorials\/53814-connect-wireless-display-miracast-windows-10-a.html"]},{"symptom":"Windows 10 STARTUP  APP unique per user        Hi,I have a Windows 10 IOT Enterprise system.I want to have an APP run on startup when a particular user logs on; but not when anyone else logs on.I have no problem adding and removing apps that run when everyone logs on, but for just one user seems obsure.Please advise.Boyd","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.You can put a shortcut to the app you wish to run in the start-up folder - there's a global startup folder and a per-user start-up folder which you can access from right-click START > Runshell:startup - for the current users folder shell:common startup - for the global startup folder Further details here (it's for Windows 8, but the options remain the same): https:\/\/www.thewindowsclub.com\/startup-folder-i...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Regards, David","shell:startup - for the current users folder shell:common startup - for the global startup folder This will only work if the user uses the same machine each time."]},{"symptom":"Power Management        I have migrated from a company-managed PC to my own now (HP Omen) - is it possible to close the lid without shutting down the machine?  (I'd like to continue to use it with wireless keyboard, mouse, and external screen.) Is it even a good idea to do this?","solutions":["Hi Joe You should be able to do this and it is no problem doing this, many people do . . .Right click the Battery Icon on your Taskbar and choose Power Options On the left, click 'Choose what closing the lid does' Set that to nothing on Battery and Power Restart your laptop . . .","Hello Joe, If needed, the tutorial below can help show you more on how to do what Dave posted.https:\/\/www.tenforums.com\/tutorials\/69762-change-lid-close-default-action-windows-10-a.html"]},{"symptom":"Problem with Username and email account on new Windows 10, Office 365 set up        I am SO FRUSTRATED.  I have a bran new Windows 10 computer.Somehow, when I was setting it up, I entered the wrong email address.NOW, every time I long in to my computer, my name - with the wrong email addresscomes up.I cannot seem to remove this incorrect name and email and replace it with the correct information.Additionally, this seems to affect my email account and address in the Windows 10 Mail applicationAND, when I installed Office 365, the email address was also wrong.  I have uninstalled Office 365 completely until I get this User Account information problem solved.Can anyone give me instructions on how to remove the incorrect User Account info and email and replace it with the correct info.Ideally, it seems like this would match with my Microsoft Account login information - but right now, it does not.Thanks SOOO much for your help with this frustrating situation.JoAnne Flynn","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Best thing to do is probably add a new account with the correct information first - so you're adding a second account. Login with the current \"wrong\" account - go to START > Settings (the cog) > Accounts > Other users. Then choose \"Add someone else to this PC\". Go ahead and add your account again with the correct email details, etc, once you've added the account and it's showing in the list be sure to set it to an \"Administrator\". To do that click on the new account in the list - and choose \"Change account type\".Once you've done all that go back to START button, click the little profile icon (about four icons up directly above the START button) and choose \"Log out\".Once you get back to the Welcome page choose \"Other user\" and then login using the new account you just created. Once that all looks ok you can go back to the Accounts page in Settings and delete the original \"wrong\" account.Regards, David"]},{"symptom":"Windows hello facial recognition has stopped working,biometrics missing.        Window Hello facial recognition has stopped working .I have tried all the advice I can find on the web to fix it ,but have managed to remove the biometrics from the device manager list. I've searched for a replacement download but couldn't find anything. I'm using a Surface Pro 4. Any Suggestions?","solutions":["Hi Sunny, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Troubleshoot Windows Hello problems on Surface https:\/\/support.microsoft.com\/en-us\/help\/402351...You may get driver package of Surface from here:https:\/\/support.microsoft.com\/en-us\/help\/402350...Let us know how that goes.","HI Sumit, Thanks for the reply, I've downloaded the driver and firmware package from the links but it still hasn't. worked . The bio-metric device is still missing from the driver list and Windows hello cant activate the camera.  I know I can sign in with my pin but its just frustrating not being able to get it to work !","Hi Sunny, Thank you for the response. In the device manager, click view>Show hidden devices.Does the camera appear? If so, you may try disabling and re-enabling the same.","Thanks again for the suggestion Sumit. I tried it and again no change. Sorry for the disjointed reply things have been hectic.","I see. It looks like a hardware issue and your device might require service. Is there any Microsoft Store near your location?","Hi Sumit,       I'm not sure where the nearest one is but ill do a bit of research. The surface is now about three years old so its out of warranty and I am looking to upgrade so I may persevere for a bit longer and then replace it with a newer model. Thanks so much for all your suggestions."]},{"symptom":"Windows 10 upgrade        If I upgrade to Windows 10, will my 3rd party software still be there and work, or will I have to reinstall them? (I have a PC)","solutions":["An upgrade to Windows 10 preserves your third-party software.A clean install of Windows 10, by definition, erases your hard drive, so you will need to reinstall your third party software.Whether or not your third party software will work properly (or at all) on Windows 10 depends entirely on whether or not the software developer supports their software on Windows 10. If the developer supports their software on Windows 10, you will have no troubles.Although an upgrade to Windows 10 is easier to do, a clean install gives much better results."]},{"symptom":"Virtual PC 2007 will not install I have tried running it in compatibility mode        Virtual PC 2007 will not install I have tried running it in compatibility mode.","solutions":["Virtual PC 2007 does not run on Windows 10.Instead, install a real virtual machine: VirtualBox from Oracle; VMWare Workstation Player from VMWare; or Hyper-V from Microsoft (which is included with Windows 10.)","Hi MadMax, Virtual PC 2007 has a lot of issues with Windows 10. You may refer to this thread in regards to this concern: https:\/\/www.betaarchive.com\/forum\/viewtopic.php...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. It's more likely to use a different application than Virtual PC 2007 for Win10. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"graphic card        I just had a new graphic card (GT710) installed on my computer.  Everything works fine except that the text of my Office 2016 programs (Outlook, Word, etc.) has changed (pale, lighter, funny looking...).  Do I need to upgrade something?...  I have already downloaded a driver for Windows 10 from the GT710 web site, but that didn't chage anything.  Thanks for shedding some light...Pierre","solutions":["Hi, Have you tried to disable the hardware graphics acceleration? Go to \"File\" > \"Options\" > \"Advanced\" then \"Display\".","What model computer? Is the card supported by the power supply?","Hi mlg63,It's a tour Asus Essentio Series","Hi jhestech A+ I think this might be it... I'm in the middle of something else, but will try this later and keep you posted..Thanks! "]},{"symptom":"How to reinstall Windows 10 from WIndows 7.        Hi Tech support,   My Dell PC was upgraded to Windows 10 Free in 2016 from Windows 7 Pro (Production key <Product Key removed by VM >). Recently, my PC was unable to boot, I reinstalled the windows. After reinstalled the windows became Windows 7 as the original Windows 7 not the upgraded Windows 10. Now, I want to upgrade to Windows 10 but I don't have the Windows 10 product key I couldn't upgrade. How Can I find the windows 10 product key? or Free upgrade to Windows 10 is not available at this time. Please help me how to go back to the previous Windows 10 which was free upgraded.Do you provide me the  Windows 10 product key?Best regardsQuang Vo","solutions":["There was no product key for the free upgrade.It was a Digital entitlementThe free upgrade to 10 is yours for the life of that device.The best method to upgrade back to 10 is to clean install it.Use the Windows 10 media creation tool on the Software download page \"Start fresh with a clean installation of Windows 10\"https:\/\/www.microsoft.com\/en-us\/software-download\/windows10startfreshReinstall Windows 10:https:\/\/support.microsoft.com\/en-us\/help\/4000735\/windows-10-reinstall\"How to Clean Install Windows 10\"http:\/\/www.tenforums.com\/tutorials\/1950-windows-10-clean-install.html_______________________________________________How to Create Bootable USB Flash Drive to Install Windows 10 fromThis tutorial will show you how to create a bootable USB flash drive that can be used to installWindows 10 with or without UEFI.________________________________________________To access BIOS\/UEFI - UEFI\/EFI configuration:https:\/\/neosmart.net\/wiki\/boot-usb-drive\/_____________________________________When your free upgrade to 10 was  originally activated Microsoft will have kept the Hardware Configuration details of your device on their Servers for recognition purposes if you have to reinstall 10.\"Activation in Windows 10\" (Digital entitlement)https:\/\/support.microsoft.com\/en-au\/help\/12440\/windows-10-activationCheers.","Thank you very much for your help. I will follow your instruction to get back to Windows 10 today. I will let you know the result.Have a nice dayQuang Vo","Yes; do let me know how it works out for you.Cheers."]},{"symptom":"Microsoft Password Email Address Change        I have many files and folders on onedrive. I would like to change eventually delete my primary alias. I intend on creating a second alias and make that my primary before eventually deleting my original primary alias. With that being said, I surely do not want to lose and files in onedrive or my 365 information.Some information I have found indicated I will lose all information but that is not logical if I create a new primary alias before deleting the old one.Does someone have the answer to this? Thanks!!","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.As you say your Microsoft account will be maintained and all data such as OneDrive, etc, will stay regardless of the email address(s) you have linked to the account. You can sign-in with any email address which you have linked to your account.The details are explained here: https:\/\/support.microsoft.com\/help\/12407\/micros... Regards, David"]},{"symptom":"Desktop asks for PW every time after I've logged in        Desktop keeps saying there's a problem with my MS account, click to fix.  I do and it wants PW and then says OK no problem  BUT it happens EVERY time I fire it up.  Never happens on the Surface Book.  If I ignore it everything works OK, it's just annoying that it says there's a problem with my AC every time I fire it up.  I have done the chat with support and tried everything they said, it's updated to latest Win 10 version but no difference.Any Ideas?","solutions":[]},{"symptom":"Cannot restore my computer to factory reset.        I really dont know where to begin but basically i was trying to hard reset my computer (The computer is the Steammachine) and it gave me an error that i cannot restart my computer because of an error. I do have a prompt telling me that windows resource protection found corrupt files but was unable to fix some of the. I have the log itself of what files were corrupt but i dont know how to read it at all. Can someone help me out!","solutions":["Hi, hestonmize My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.I recommend that you repair Windows completely before you must make a backup of your personal files, third-party software will be removed. Here the link to download the Windows ISO.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I don't know what a 'hard reset' is - that's not a defined term.I do know what a 'factory reset' is - that's where you return your computer to exactly the way it was when it left the factory, hence the name. After a factory reset, your computer will be as it was when you first received it, and when you press the 'power' button, your computer will setup all over again, exactly like it did the very first time you pressed the 'power' button.If you want to perform a factory reset, you'll have to go to the manufacturer's website for instructions. There you will find detailed, step by step directions for your particular model. Microsoft does not have these instructions, since Microsoft doesn't know what other software was installed at the factory, and how the manufacturer setup the computer at the factory.","Hello Mr. Cloutier,I seem to have a similar issue, however I'm able to login but my desktop setting are as if it's a new install \/ new user. I had logged on successfully earlier this morning and initated a folder scan prior to installing and app. Windows defender prompted that it couldn't open so I restarted. On logging in, I viewed screen text greeting me and some words on updates. Then \"Welcome to Windows...\" edge browser page.Steps to diagnose:1. Restarted and tried my wife's login. Same response.2. Recovery \/ restore; states there are no restore points because last update was greater than 10 days3. Open my WD backup app: unable to find file. I have that drive locked and I turn it once a day to backup files. It's set on continuous so I am hesitant to activate it if the profile I'm logged in with is the issue (thinking it would overwrite that file).Recommendations?Thank you,JL","So i think i fixed my issue by following these steps. when i run the prompt it said that the corrupt files had been fixed. hope this works. https:\/\/www.youtube.com\/watch?v=09cWplaeB1Y"]}]}