{"windows":[{"symptom":"Windows 10 First Install disk 0 0.0MB of space        I just finally got my new PC working and am trying to download windows 10, i get to when it says i need to select a disk to download it to. But the only option is disk 0 saying that it has 0.0MB of space both free and available, I've tried to clean the disk using the terminal, ive tried unplugging my HDD and plugging it into different slots, but nothing i do seems to solve the problem, is there anything i can do other than just buying a new HDD?","solutions":["Hello AgressivePity!!! Evan the independent adviser here to help. May I please ask what type of PC you are using first? Is this a chromebook\/surface? Just checking!!It almost sounds like the disk has been formatted as Install disk only and no files are able to be installed.Via the search bar please type and click>>>create and format. This will bring up a list of your hard drives....Do any of them say system reserved or partitioned???","I just finally got my new PC working and am trying to download windows 10 ...Did your new PC not come with Windows 10  already installed?If you were buying a new PC, and you wanted Windows 10, why not buy a new PC with Windows 10 already installed?","I had gotten parts for christmas, it's a clean fresh build that i put together myself, so it didn't have anything on it","I had wanted to try my hand at building a PC","Hmm...is it currently formatted to NTFS?","I just tried doing that but when i try to create partition primary it says \"Diskpart has encountered an error. Incorrect function.\" it does that with pretty much any command i try to do other than, clean","I had that same issue myself when I installed a second hard drive... my power supply unit wasn’t supplying enough power to the HDD sorry I’m stumped.","Hi AgressivePity and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.Have you tried changing the SATA cable? Thank you!"]},{"symptom":"How to Upgrade from Windows 7 to Windows 10        As per Microsift, Windows 7 is going to sunset in Jan 2020.I am using Windows 7 Home Premium Service Pack1 and I do have Product key comes with my Lenovo T520.Need your help to get\/download the Windows 10 and install as  upgrade, reason I want to keep my other s\/w intact. Please provide me step by step procedure.Thanks in advance.","solutions":["You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700Cheers.","If you're looking for information for home users, see Windows 7 support will end on January 14, 2020.With end of support Microsoft is not telling you that your operating systems won't work.What they are saying is that after a certain date they will no longer support them.Whether they still work or not with particular programs is up to the particular program manufacturers.Example: Google Chrome is no longer supported for security updates in XP or Vista by Google and Mozilla Firefox is following the same path.What this basically means with Microsoft no longer supporting an operating system is that even though hackers may find \"holes\" and vulnerabilities to be able to access the operating systems and cause security problems, Microsoft will no longer be monitoring or rectifying those problems by way of Security Updates each month.You are on your own in regards to maintaining the Security of your operating systems.What does it mean if Windows isn't supported?____________________________________________________This will show you when support (Mainstream and Extended Support) for the various operating systems ends.Windows lifecycle fact sheet - Windows Help - Microsoft SupportAnd these FAQs show you how Microsoft arrived at the Support Lifecycle Policy:Microsoft Lifecycle Policy FAQhttps:\/\/support.microsoft.com\/en-au\/help\/17140\/lifecycle-faq-general-policy-questions@@@@@@@@@@@@@@@@@@@@@@@","As per Microsift, Windows 7 is going to sunset in Jan 2020.I am using Windows 7 Home Premium Service Pack1 and I do have Product key comes with my Lenovo T520.Need your help to get\/download the Windows 10 and install as  upgrade, reason I want to keep my other s\/w intact. Please provide me step by step procedure.Thanks in advance.Hello,If you're sure that your device is compatible with Windows 10, you can perform in-place upgrade using Windows 10 ISO file.Refer this step-by-step guide:https:\/\/www.kapilarya.com\/how-to-upgrade-to-windows-10-using-iso-fileLet us know if this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP. ","You do not have a Windows 10 product key; only Windows 7.As I said:You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@And Lenovo doesn't supply Windows 10 drivers for that model number you gave.Supports XP > 8.1https:\/\/pcsupport.lenovo.com\/au\/en\/products\/laptops-and-netbooks\/thinkpad-t-series-laptops\/thinkpad-t520\/downloads\/driver-list"]},{"symptom":"Windows 10 Home Reactivation after hardware change?        I recently changed my motherboard and cpu and my new pc has my account and everything but it wont let me reactivate my windows?","solutions":["Hi hacobo, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Activation depends on what type of license you have of Windows 7\/8\/10. If Windows 7\/8\/10 came preinstalled with the computer, that is called an OEM license. For an OEM license, the license dies as soon as Motherboard dies. So essentially it is non-transferable. If that is the case you need to get a new license.However, this is not same for retail licenses i.e. you purchased the license through Microsoft store. That does carry transfer rights. If that is the case, please see the below steps:Run the activation troubleshooter on the new device using the below steps: Go to Settings>Update and security>Activation and run the troubleshooter. and select I recently changed hardware on this device.(Please note that Activation troubleshooter requires you to have digital license linked to Microsoft Account.)If the troubleshooter hasn't helped, you would have to call Microsoft during support hours to get more help.https:\/\/support.microsoft.com\/en-in\/help\/405170...Please let us know if you need any assistance.","Hello,What is the source of your Windows license?If you're using OEM license, it would have died with motherboard, and you need to buy new license for new motherboard.If it is retail license, refer this support article:https:\/\/support.microsoft.com\/en-in\/help\/20530\/windows-10-reactivating-after-hardware-changeHope this helps!"]},{"symptom":"Windows 7 ending\/windows 10        I've tried windows 10 earlier and DID NOT like it. what should i do? I can't afford new computers can't afford the now needed upgrade to windows 10 and I'm technology challenged! I'm NOT very good with technology. I can barely operate a cell phone! I don't understand a lot of new programs and such. I'll google information to try to get familiar with things but it takes me long time to figure out what needs done. Windows 10 automatically installed on computer at 1 point but I did NOT like it and could not turn off voiceover on computer. Could only hear cortana and NOTHING else. Could not watch anything on computer because cortana ALWAYS talking over everything. All i know about windows 8.1 was it had MANY MANY glitches and difficult!~!! I Don't know what to do & where to get assistance!Any helpful feedback appreciated!Thanks","solutions":["If you're looking for information for home users, see Windows 7 support will end on January 14, 2020.With end of support Microsoft is not telling you that your operating systems won't work.What they are saying is that after a certain date they will no longer support them.Whether they still work or not with particular programs is up to the particular program manufacturers.Example: Google Chrome is no longer supported for security updates in XP or Vista by Google and Mozilla Firefox is following the same path.What this basically means with Microsoft no longer supporting an operating system is that even though hackers may find \"holes\" and vulnerabilities to be able to access the operating systems and cause security problems, Microsoft will no longer be monitoring or rectifying those problems by way of Security Updates each month.You are on your own in regards to maintaining the Security of your operating systems.What does it mean if Windows isn't supported?____________________________________________________This will show you when support (Mainstream and Extended Support) for the various operating systems ends.Windows lifecycle fact sheet - Windows Help - Microsoft SupportAnd these FAQs show you how Microsoft arrived at the Support Lifecycle Policy:Microsoft Lifecycle Policy FAQhttps:\/\/support.microsoft.com\/en-au\/help\/17140\/lifecycle-faq-general-policy-questions@@@@@@@@@@@@@@@@@@@@@@@","Does that mean if I have other security in place (for example Norton) at least security could be \"covered\"? Would I still have internet access?","Does that mean if I have other security in place (for example Norton) at least security could be \"covered\"? Would I still have internet access?Of course you will have internet access.Everyone has their own favourite anti-virus program.This is what I wrote:With end of support Microsoft is not telling you that your operating systems won't work.What they are saying is that after a certain date they will no longer support them.Whether they still work or not with particular programs is up to the particular program manufacturers.Example: Google Chrome is no longer supported for security updates in XP or Vista by Google and Mozilla Firefox is following the same path.What this basically means with Microsoft no longer supporting an operating system is that even though hackers may find \"holes\" and vulnerabilities to be able to access the operating systems and cause security problems, Microsoft will no longer be monitoring or rectifying those problems by way of Security Updates each month.You are on your own in regards to maintaining the Security of your operating systems."]},{"symptom":"Gaming issue        Hello, I recently installed Age of Empires II Definitive Edition from steam and am trying to play it but unfortunately it is not working and instead it comes up with the message:\"Intel(R) HD Graphics GPU with vendor id 32902 and device ID 258 is not DirectX 11 compliant:I am unsure as what to do. If I have to change my DirectX from 12 to 11, can you send me the details please.Thank you","solutions":["Hi, Windows 10 comes with Direct 12 built in. You need to download DirectX 11 directly. Here's a link to the same issue someone was having with Civ:https:\/\/answers.microsoft.com\/en-us\/windows\/for...","- Do you have Direct Play enabled in....Programs and Features > Turn Windows Features On or Off .Scroll down to and enable Legacy Components andDirect Play- Win10 actually comes with all DX9,1011 & 12 files, and there is nothing for the user to change.DX is most likely not the problem with your game, but in the event of a corrupted DirectX file the installer above wouldreplace any corrupt DX11 files, but to replace DX9,10 & 11 versions you would use theDirectX Redist (June 2010) installer package.(The DX11 files in the 'update' linked above are included in the full installer).Download Details - Microsoft Download Center - DirectX Redist (June 2010)- As the error says, the problem may be more to do with your aging graphics processor.You may not have posted the full model designation of your Intel HD integrated graphics, but if you are using a machine withan Intel HD graphics older than Intel HD4000 and newer series, it cannot run DX11 games.eg - Intel HD 2000\\3000 series and the olderIntel HD (without a number)cannot use DX effects higher than DX10.You can verify this in dxdiag. R\\click on the Start button and click on Run.Type  -  msconfig   - into the Run command and click on theDisplay tab.In the right column you can see which versions of DX  your graphics processor can run in theFeature Levels section.- I'm not sure if the original release of AOE2 ran on DX 7, 8 or 9. The older Intel HD graphics would be able to run that version,but not the newer updated version."]},{"symptom":"How to fix computer lag?        I just had to do a in-place upgrade for my PC due to a previous problem and now I am trying to play a game on ROBLOX and it is very laggy. It is nothing to do with there game as before I did an in-place upgrade, it was working fine but now it is very laggy. I try to turn the graphics down through the game but doesn't help one bit. I don't know if it is something to do with my graphics card but it was working fine before the in-place upgrade and now I don't understand what the problem is.I also then try a different game on ROBLOX but it doesn't work how it used to and it is very laggy.Info on my PC:Processor: Intel(R) Core(TM) CPU @ 2.80GHz Installed Memory (RAM): 8.00GBSystem Type: 64- bit operating system, x64 based processorAny suggestions on what I should do, would appreciate the help.","solutions":["Hi, Open Task Manager with the game running and look for programs that are using a large amount of resouces (CPU, RAM etc). If the game doesn't have the right resources available it will start to lag as it's having to wait before performing CPU or GPU bound tasks.","Hi Rhys, Can you perform a Clean Boot to see if the lag continues? https:\/\/support.microsoft.com\/en-ca\/help\/929135...This will help us isolate if it is due to a service on your computer. Let me know."]},{"symptom":"Recurring internet connection problem        I have a problem where I keep losing the internet connection on my PC. Sometimes it lasts less than a minute before it resolves itself, other times it lasts much longer. But it always fixes itself eventually somehow.It doesn't seem to be an issue with the router, because I can use the internet without any problems on a phone and a tablet using the same wi fi, it's only on the PC. It's also not a browser issue, as it happens on all browsers.The most common error message isDNS_PROBE_FINISHED_NO_INTERNET I ran Windows Network Diagnostics and it didn't find the problem. I did run Ccleaner at one point and deleted all cookies, history, internet cache, etc and this seemed to work, but maybe it was just a coincidence. I've tried running it again and deleted only the history, cache and DNS cache but that doesn't work. Even if deleting everything works as a temporary solution, it's not one I can really keep doing as this loses all my log ins and means I have to set up my internet banking again as it's reliant on cookies staying on the PC.These are the other kind of messages I get:On Chrome:DNS_PROBE_FINISHED_NO_INTERNET This site can’t be reachedThe connection was reset. [or sometimes site name “took too long to respond”]Try:Checking the connectionChecking the proxy and the firewallRunning Windows Network DiagnosticsERR_CONNECTION_RESETCheck your Internet connectionCheck any cables and reboot any routers, modems, or other network devices you may be using.Allow Chrome to access the network in your firewall or antivirus settings.If it is already listed as a program allowed to access the network, try removing it from the list and adding it again.If you use a proxy server…Check your proxy settings or contact your network administrator to make sure the proxy server is working. If you don't believe you should be using a proxy server: Go to the Chrome menu > Settings > Show advanced settings… > Change proxy settings… > LAN Settings and deselect \"Use a proxy server for your LAN\".On Opera I get this message:This site can’t be reachedmoz.com took too long to respond.Try:Checking the connectionChecking the proxy and the firewallRunning Windows Network DiagnosticsCheck your internet connection.Check any cables and reboot any routers, modems, or other network devices you may be using.Allow Opera to access the network in your firewall or antivirus settings.If it is already listed as a program allowed to access the network, try removing it from the list and adding it again.If you use a proxy server…Check your proxy settings or contact your network administrator to make sure the proxy server is working. If you don't believe you should be using a proxy server: Go to the Main menu > Settings > Change proxy settings… > LAN Settings and deselect \"Use a proxy server for your LAN\".Firefox and IE take too long even to search for something and don't seem to be doing anything. Does anyone have any ideas what could be happening here? Thanks.","solutions":["Hi, JayTFT Try to flush the DNS Resolver cache. To do that, Go to CMD and type, ipconfig \/flushdns Also try to release and renew the IP address. (Release the IP) ipconfig \/release (Renew the IP) ipconfig \/renew","Hi JayTFT,try if these steps solve your problem:https:\/\/www.upylondon.com\/fix-dns_probe_finished_no_internet\/Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).","Hi. Sorry, I should have said that I've done the flushdns. It doesn't always seem to work and I have to do it all the time so it's not a permanent fix. I'll try the ipconfig \/release.","Hi, Also try these Commands on CMD. netsh int ip reset netsh winsock reset"]},{"symptom":"DirectX version not compatible?        I am trying to get the online game The Elder Scrolls to run, but when I hit play, I get a message saying that the DirectX version is unsupported. It gives you an information link in the hopes of fixing this problem, and it says that the game needs DirectX 11 to run. My laptop has DirectX 11.1. Does this make any difference? If so, what can I do to get the game to work?","solutions":["There is an on going issue with an incorrect error pointing to DirectX causing people to run around in circles trying to 'fix'DirectX when the real problem is a corrupted  .NET framework. See how you go repairing .NEThttps:\/\/docs.microsoft.com\/en-us\/dotnet\/framework\/install\/repairGoint on what you have said, it looks like the graphics processor in your machine cannot use DirectX 12, but it will run any gamethat uses DirectX 9 or 10 as well as DX11 effects  .- Win10 comes with all DX9,10,11 & 12 files, but a DX file can also be corrupted from time to time.Should this be the case you would want to reinstall DirectX to repair any corrupted DX files using the DirectX Redist (June 2010)installer package.- Note that if have not yet tried repairing .NET, and you also get an error when trying to reinstall DX, this would be another commonsymptom of a corrupted .NETDownload Details - Microsoft Download Center - DirectX Redist (June 2010)"]},{"symptom":"Laptop isn't waking from sleep, nor is it shutting down        I am facing two annoying problems on my HP Pavilion laptop:1. My laptop doesn't wake up. The lights don't blink. Instead, they just stay on, with the screen blank, and the only way to get out of this is by forcefully shutting it down and starting it up again.2. When i shut down my laptop, the hardware is still running, and again i have to forcefully shut it off by long pressing the power button.For the first problem, I have enabled all the options under Advanced Settings of the battery to put my laptop to sleep, but it doesn't help. I have also disabled quick startup, since it has been mentioned that it does help with this problem, but it hasn't done anything.I don't think i need to update my BIOS, since this problem started after i reinstalled windows a while ago.I don't know how to get around this problem. Please help","solutions":["Hi Andre.M. Have you tried to run the Windows Power Management troubleshooter? Follow the instructions below. 1. Go to settings 2.Choose the Update & Security, 3. Then click \"Troubleshoot\", then Under \"Find and fix other problems\", click on Power, then Run the Troubleshooter.","it didn't work. It just advised me to reduce my brightness, that's it. The issue is still there","Hi Andre.M. and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. -Press the \"Windows key\" and type in \"Edit Power Plan\" press Enter. -Click \"Change advanced power settings\" and the \"Power Options\" will pop up. -PCI Express > Link State Power Management > turn \"OFF\" then click \"Apply\" and \"OK\".-Restart the PC. I hope this helps. Feel free to ask back any questions and let me know how it goes. I will keep working with you until it's resolved.Thank you!","Sorry for the late reply, i was testing it out.My laptop does go to sleep and shut down properly now, but only after times of low activity, like browsing or watching videos. But after activities like gaming or using some heavy software, the laptop does not go to sleep. This is after I have exited the game and the softwares of course. And the games are not cracked, I bought them off Steam.I tried using the laptop for browsing for an hour after gaming, and it still didn't go to sleep, nor did it shut down properly."]},{"symptom":"return to windows 7        How do I return to windows 7 from an attempt to go to window 10","solutions":["see your other thread and only post ONE thread about the same problemhttps:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/return-to-windows-7\/64a2fc79-782e-4d71-be34-cea348f5ef2c"]},{"symptom":"TASK BAR ICONS        SOMEHOW ANOTHER THE TASK BAR ICONS HAVE MOVED ON ME ALSO THE TIMEHAS DISSAPPEARED .. THEY ARE ALL TOGETHER INSTEAD OF SPACED OUT..  I MIGHT HAVE CLIKED ON SOMETHING BUT DONT THINK I DID.. HOW TO MOVE THEM BACKTO DEFAULT POSTION TO THE BOTTOM RIGHT CONCER?? PLZ HELP, THANKS","solutions":["Hey Willie. Happy New Year! Right click an empty area of Task bar to open Task Bar Settings, scroll down to Turn System Icons On or Off, turn on the Clock.While in TaskBar settings find the menu for Combine task Bar buttons, and try the various settings to see which you prefer.If the Task Bar has grown taller, put your mouse on the top until it turns into a two-headed arrow and drag it back down.Also look for the double line in to the left of the System Tray group at the right end of the task bar, drag that line left or right to space things more to your liking.Then right click task bar again to choose Lock the Taskbar. If it still doesn't look like you want, then please post a screenshot so we can see what you're seeing. Here's how:http:\/\/windows.microsoft.com\/en-us\/windows-10\/o.... Attach using Attach Image button in reply box.","All caps is considered yelling.  Please do not yell at the other users that make up this forum."]},{"symptom":"return to windows 7        How do I return to windows 7","solutions":["How do I return to windows 7 Return form where; 10?You only have a limited time to use this method:Go back to Windows 7 or Windows 8.1 - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@If that option is not available you have to follow this path:You can also borrow the exact same edition of Windows 7 Retail DVD and use your Product Key on the COA sticker to reinstall the operating system.@@@@@@@@@@@@@@@@@@@@@@@@@Or you can use this for preinstalled OEM or Retail Licenses.  This is on a first come, first served monthly basis.Download the correct ISO file and make your own disk and use the Product Key that is on the COA Sticker.https:\/\/www.heidoc.net\/joomla\/technology-science\/microsoft\/67-microsoft-windows-and-office-iso-download-toolDownload: Windows ISO Downloader.exeAnd here are instructions on how to burn ISO images to disk:http:\/\/www.snapfiles.com\/get\/ISORecorder.htmlYou change the Boot Order in the BIOS to be able to boot from your installation media:How to Boot Your Computer From a Disc or USB DriveThen do a clean install:http:\/\/www.sevenforums.com\/tutorials\/1649-clean-install-windows-7-a.htmlThe COA sticker is either on the underside of the Laptop or in the Battery Compartment.With a Desktop it is either on the side, rear or top of the Computer Case.Using the downloaded ISO file Method may require phone Activation.If it does require phone Activation, do not follow the Auto Prompts, but hold on for a real person to explain to as to what has been done for re-installation purposes\"How to Activate Windows 7 by Phone\"http:\/\/www.sevenforums.com\/tutorials\/18715-activate-windows-7-phone.htmlThe above method also will require you to go to your Computer Manufacturer's website > Support and Downloads Section > locate your Model Number and Operating System > then download and install the latest Drivers for it. ________________________________________________Using the USB method in conjunction with the above Windows 7 download:http:\/\/www.sevenforums.com\/tutorials\/2432-usb-windows-7-installation-key-drive-create.html\"How to Get and Use the Windows 7 USB\/DVD Download Tool\"http:\/\/www.sevenforums.com\/tutorials\/31541-windows-7-usb-dvd-download-tool.html________________________________________________And this is very good and easy to use:Rufus - Create bootable USB drives the easy wayCheers."]},{"symptom":"windows.com\/stopcode        anyone know how to stop the windows.com\/stopcode, it can happen anytime but so far not when i start the system, i will be doing research or reading some news when it would just go off with above messagesince i posted this i have tried everything i could plus had microsoft techs take over my computer and one reinstalled windows 10, as new hp computer had there techs take over my computer and they sent a tech out to my home and hardware and software all good and was reading that if do a memtest86 that might tell me something as i would get lots of different bsod errors and computer freezes and so couple days ago ran memtest86 and found had 9 errors re cpu so ran iy again and had no errors, last time was 2 days ago (today is 10\/3\/17) and so far my computer has not frozen or had and bsod, lets hope it stays that way,i suggest you run memtest86 coupls times and see if works for you.today is the 29\/6\/17 and since i did the memtest86 twice i have not had any bsod so far and computer is not frezzing so lets hope i have fixed the problem","solutions":["Hello Terry, This probably is caused by memory corruption. Kindly refer to the link below and follow Zigzag's post:Stopcode on Windows 10Let us know what happens."]},{"symptom":"100% High Disk Usage Due To \"SysMain Service\" Running In Background        Hi, I am a windows 10 user. From past many months I am facing a issue where whenever I start working my laptop suddenly I face lag and hang issues. My system just gets hanged for few mins and I can't do anything. When it gets fixed, I go to task manager and see that my disk usage has almost reached its peak 100% and the CPU usage also increases gradually. Even the RAM usage also. And I get to see that SysMain service keeps running in the background and I don't have any control over it. It literally consumes everything and I can't work properly. For this problem to get fixed I have to always restart my laptop. Then only it gets fixed. So do you have any solution for it as to how to reduce the usage or completely stop that service? Please help because I can't work properly and the performance just reduces. Even it consumes most of my internet.","solutions":["Hi Indi. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) See fixes here for 100% disk usage: http:\/\/www.thewindowsclub.com\/fix-100-disk-usag...https:\/\/www.kapilarya.com\/fix-windows-10-100-pe...2) Update your drivers from the PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.3) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 4) If this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Update History, then uninstall them from the link there, and immediately check for these again and hide with the Hide Updates tool explained here: https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... You can also use System Restore from within Windows to get back before the problem began, then check for Updates with the Hide Update tool and hide them:https:\/\/www.windowscentral.com\/how-use-system-r... 5) If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....If that doesn't work you can also Go Back in Repair Mode as shown here: https:\/\/www.tenforums.com\/tutorials\/2294-advanc...6) If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1809 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... -------------------------------------------- But remember that in Windows 10 everything depends upon the quality of the install, and Factory or Upgrade installs are inferior installs which most enthusiasts won't even run because they'd expect endless issues. Consider now or later doing the Clean Install in this link which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... There is also an automated Fresh Start that reinstalls WIndows while shedding corrupting factory bloatware, saves your files, but doesn't clear the drive to get it cleanest:https:\/\/www.howtogeek.com\/265054\/how-to-easily-... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Your Phone App Stopped sending messages        I just did a Windows 10 update and now I can't send messages from my computer using the Your Phone app. I can still receive Messages and my photos will update.I tried deleting the app from my computer so I could reinstall it but the uninstall box is grayed out.Any suggestions? ","solutions":["Hi BruceK My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.To uninstall Your Phone in Windows 10, do the following. Open PowerShell as administrator. Type or copy-paste the following command: Get-AppxPackage *Microsoft.YourPhone* -AllUsers | Remove-AppxPackage Hit the Enter key. The app should be removed. Hope this helps.","That didn't seem to work...I received an access is denied, I don't think I'm in as an administrator. What I really want to know is why the Your Phone App stopped allowing me to send messages.","Hi BruceK, I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.I want to suggest reseting My Phone App rather than uninstalling it, since you will still require it thereafter.You can rest the App by going to Windows Settings > Apps > Apps & Features > Your Phone > Advance Options > Terminate then Reset.Once reset, you will have to pair it again from Your Phone App on your mobile device.Let me know if I can help you further!"]},{"symptom":"Importing video from sony handycam video camera        I am trying to import video from a sony handycam video camera with mini dv tapes.  I have a surface pro 3 running windows 10 pro.  I have plugged the video camera into my usb drive, but I cannot get the computer to detect the camera or upload any video.  I am ultimately trying to transfer the video and burn it onto DVDs.","solutions":["Hi DC__11 You cannot directly transfer video from that Sony HandiCam to your PC via USB cable, because those videos are in analog format . . .What is the exact Model No. of your Sony HandiCam?","It is a sony handycam DCR-HC32. Years ago I used a sony laptop with a dvd burner and transferred some of the tapes to DVD by plugging the camera into the computer. Thanks. ","Hi DC__11, I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.Unfortunately, DCR-HC32 is incompatible with Windows 10 and Sony no longer provides support for it. You can visit this link and you will find that the model is not listed as compatible -https:\/\/www.sony.co.uk\/electronics\/support\/arti... An alternative you can try is to purchase a capture device that is compatible with the A\/V connecting cable that came with your Sony Handycam. Page 9 has a picture of the A\/V connecting cable -https:\/\/www.sony.com\/electronics\/support\/res\/ma.... The capturing device works by recording A\/V playback from the camera into digital files. I was able to find a capturing device that seems compatible -https:\/\/www.avermedia.com\/product-detail\/C039. You probably want to visit a local store to find out more or check with their representative if they can offer you other compatible capturing devices. Sony has published an article with instructions on Transfer Video to a Computer with an Audio Video (A\/V) Cable.https:\/\/www.sony.com\/electronics\/support\/camcor... Let me know if I can help you further! Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"My Keyboard Light Doesnt Turn on Even when Hard Reboot + unplug Battery.        Hello,This problem occurs usally when I hibernate.the only solution that seemed to work with me is to do incorrect shut down (i.e. unplug without shut down + no battery)is there any better way to properly do it? ThanksEdit:  System Name DESKTOP-BlaBlaBlaSystem Manufacturer ASUSTeK Computer Inc.System Model G53JWthough im not entirely sure what causes the problem. Im certain its not hardware problem because:1-) it works may times2-) its usually fixed when I accidentally unplug laptop3-) it works on boot screen briefly just before im unto windows 10.","solutions":["Did you download the last ATK package ? On the Asus support page they do not give the version for windows 10, but here yes:http:\/\/ivanrf.com\/en\/latest-asus-drivers-for-wi...This package installs the software ATK Hotkey Driver and other ASUS drivers and software with various laptop models. It is pre-installed with new laptops and required to run various optional functionality. It is a set of utilities that will enable the functions of the button Fn on your keyboard. _________________________________________________Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Bluetooth        I have a GIGABYTE GC-Wbax200 installed in my pc. This hardware has bluetooth capabilities however, windows 10 does not recognize that it has bluetooth capabilities. The OS and drivers are all up to date. Bluetooth does not show in device manager. The troubleshooter says i have no bluetooth devices installed. And restarting The bluetooth support service plus making it automatic and local, has not fixed the issue. Please help","solutions":["Hi MS. I I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give all possible steps for troubleshooting Bluetooth in order of priority, so even if you've tried them please do it over in sequence. Many problems right now are being solved by updating to the latest version so if you want to skip to that step see the Repair Install at bottom: Try Updating the Bluetooth driver from the PC maker's Support Downloads webpage for your exact model. Install it even if it's the same or newer than the one in Device Manager reached by right clicking the Start button.Right click Start button to access Device Manager, locate Bluetooth device (if necessary from View tab Show Hidden Devices), on Driver tab see if Roll Back is available, if not try Update Driver, first automatically, then Browse, then Let Me Pick to try all previously installed Drivers. If these fail Uninstall the Driver, restart PC to reinstall. If the BT driver is not there, access the View tab in Device Manager to \"Show Hidden Devices.\"Make sure you're pairing correctly as shown here: https:\/\/support.microsoft.com\/en-us\/help\/15290\/... See Fixes here which are all working: https:\/\/support.microsoft.com\/en-us\/help\/14169\/...https:\/\/superuser.com\/questions\/1017867\/make-wi...https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/www.lifewire.com\/fix-windows-10-bluetoo...Try the Bluetooth troubleshooter at Settings > Update & Security > Troubleshoot. Try turning off Fast Startup at Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change settings that are unavailable > uncheck Fast Startup.If this is a mic or headset right click Volume icon in System Tray to Open Sound Settings, make sure the correct device is selected for input or output in the dropdown menu.Then try pairing again, if necessary run the Bluetooth Troubleshooter again. If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....If you think the BT adapter has failed, you can replace it easily with a USB nano adapter like this one:https:\/\/www.amazon.com\/ZEXMTE-Bluetooth-Receive... Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1909 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"High contrast mode - the darndest thing...        1. Go into High Contrast Mode.2. Logon to https:\/www.rams.com.au3. Position your cursor into the Search box in thetop right hand corner.4. Don't actually type anything.5. After a few seconds - maybe 10 -you will be logged off from the site.6. Note you will not have typed anything. 7. If you are not in High Contrast Mode everythingworks OK.You get a similar result fromhttps:\/www.theaustralian.com.au There are plenty of other examples on the internet- lots you need to be a member before you can get sufficiently into the site.This is not a new thing, at least more than one year old.","solutions":["Interesting, James. If you want to report this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems.If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it. If you are an Insider I can also vote it up with my MVP badge and track the issue for you.Happy New Year!"]},{"symptom":"Windows 10 Pro Security and How to save Word document as pdf or export.... having more trouble with this new Windows package I just bought not sure if will keep past a year        First I like to know if the built in security ie virus protection firewall within the Windows 10 computer I just bought is sufficient and if so why would you all sell the MSWin10 Pro. Also I purchased the word prescription and am unhappy with it so far it makes you keep logging in to use it and the font is somehow set on 9.5 when reading learning how to use certain features not sure but you all have made it more difficult than needed to access. Really confusing but trying to see if its worth it - whatever assistance you can provide will be much appreciated or will try to get my money back. And I am computer literate at least my Win 7 is still in good shape. Please don't destroy windows 7 and make it obsolete like you all do to force us to have to purchase your newer more complicated software. Its bad when you all have to charge us now for these apps which were once part of the entire system. First let me know if Win 10 Pro is required and if so why?Thank you for your assistance.","solutions":["Hi KH. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Pro is the exact same operating system as Home with just a few extra features unlocked.Defender is perfectly adequate, gives best Windows performance, is built in, has least issues and is from Microsoft who knows how to protect their OS best. If you ever suspect you're infected, run a full scan with free Malwarebytes which is the most powerful scanner by far (nothing else comes close). You can print any document with Microsoft Print to PDF and it will convert it to PDF. This is more a PDF converter than a printer, is built-in and easy to use.Another method is to save your Word document in .pdf format in the Save As dialogue in Word. This converts it too.To set the default type size and Font in Word see here: https:\/\/support.office.com\/en-us\/article\/change...To change the size of type and objects in Windows 10 including Word go into Settings > System > Display and set Scaling to 125%. If that's too big set a custom scaling around 117% to start and adjust from there.Everyone loved Windows 7 but it's too old now, barely able to be installed and run on modern hardware.Let me know if there's anything else. I'll be here to help until it's resolved. ________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]}]}