{"windows":[{"symptom":"Photos app can't open files in This PC > Pictures folder        When I try to open any image file in This PC > Pictures using Photos, I get this error messageThis also applies to any subfolders inside This PC > Pictures.However, if I navigate to Users > Owner > Pictures, all of the files open normally.","solutions":["Hi its I think your This PC - Pictures refers to the OneDrive Pictures folder, not the local Pictures folder . ..In the left pane of File Explorer, click 'This PC' In the right pane, right click Pictures and choose Properties Does that report the location as something like: C:\\Users\\Owner\\OneDrive\\Pictures or is it just C:\\Users\\Owner\\PicturesWhen you say you can open photos form the C:\\Users\\Owner\\Pictures folder, are all your photos in that folder as well, or are you missing photos in that folder?","It reports the location as C:\\Users\\OwnerI believe the Owner\\Pictures folder is identical to the This PC > Pictures folder with all the same files.","Click your Start Button, type regedit and hit Enter to open the Registry EditorClick View and make sure 'Address Bar' is turned on Paste this into the Address Bar at the top and hit Enter HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell FoldersPlease provide a screenshot of the resulting registry editor window . . .","Okay, here you go.","Hi Its Thank you for that screenshot, you are correct, both shortcuts refer to the same folder. . .So in File Explorer, if you go to Quick Access - Pictures, do those photos open and not when you go to This PC - Pictures?","The result is the same when I go to the pinned Pictures folder under Quick Access, and when I go to Pictures under This PC. Clicking on either one makes the address bar show This PC > Pictures, and I'm unable to open any files, getting the same error message from the OP.Another fact that might be useful is that this doesn't always happen. Sometimes, usually when the PC has just restarted, I can open pictures normally.","Another thing I've noticed is that if I click on Pictures under Quick access, then switch to Pictures under This PC, Photos will open them successfully. This works in the other direction too. As long as I switch from one picture folder directly to the other they will work. But if I go to any other folders between them, then the images won't open.","Hi Its and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that might help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/www.intowindows.com\/fix-we-cant-open-th...I hope this helps. Feel free to ask back any questions and let me know how it goes. I will keep working with you until it's resolved.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Joseph.As per the article, I repaired, reset, then manually uninstalled and reinstalled the Photos app. The error still happened after each step and is still happening now.","Hi Its, I would suggest you do a repair using the in-place upgrade. You may try following these steps. Check this article for detailed instructions. https:\/\/www.kapilarya.com\/how-to-repair-windows...I hope this helps. Feel free to ask back any questions and let me know how it goes. I will keep working with you until it's resolved.Thanks and Happy Holidays! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows problem BSOD 0xc00000e9        Out of nowhere I decided to boot up my pc after leaving it for sometime and then that screen appeared. I managed to get into BIOS and followed most of the instructions but my lap is an asus one so it Was different than the rest(asus bios is different from the other ones)It' been a week since I formatted mc pc. I'd love to get some help***moved on english forum***","solutions":["Oops ...I'm really sorry, I misread the start of your question, I read \"reboot\" instead of \"boot\"So many of the tips I gave can't work that way. I found some manipulation to do to correct the boot. If you can follow these steps to see what it will do.---Perform a Startup Repair--- 1- Plug in the USB, which contains a Windows 10 installation media and press Power button.2- Then press any key to start the system from USB. 3- If Windows fails to detect hard drive automatically, read everything that is given during the restart process and try to find the reference to the key, which has to be pressed to interrupt normal startup (usually, F2, F10, ESC, or DEL).4- Use the arrow to the option like \"Boot, Boot Options, Boot Order\" or something similar, and then press Enter.5- Locate CD, USB flash drive or DVD under the \"Boot list\" and change its place from down below to the top using the arrow keys. Once done, hit \"Enter\".6- After that, press \"F10\" key to save the changes. 7- Click \"Yes\" on the confirmation window and let the system to reboot. 8- Set the language, time, currency, keyboard, and other required settings, and press \"Next\".9- Select \"Repair your computer\" and wait for the System Recovery Options to open.10- Once opened, select the \"Windows installation drive\", and press \"Next.\" 11- Click \"Startup Repair\" option and wait for the process to complete. or ---Rebuild Boot Manager to fix 0xc00000e9 BSOD--- 1-Plug-in USB or insert your DVD with the Windows Installation Media and boot up your PC.2-After that, press a key to boot the system from the external drive. 3-Set \"Language, time, currency, keyboard\/input method\" , and hit \" Next. \" 4-Select Repair your PC (NOT install Windows). 5-Select the type of OS you want to fix and click Next. 6-When the System Recovery Option opens, select Command Prompt. 7-Type the following commands in the Command Prompt window hitting the Enter key after each of them:cd \/d Partition:\\\\Windows\\\\System32 bcdedit \/enum all bcdedit -create {bootmgr} -d “Description” bcdedit -set {bootmgr} device partition=Partition: bcdedit \/displayorder {GUID} bcdedit \/default {GUID} bcdedit \/timeout Value 8-Finally, restart your PC."]},{"symptom":"Has anyone encountered receiving a \"wrong password\" message on a shared network drive in a domain?        I'm fairly new to using Active Directory and have come across an odd issue:Our company uses a directory for our office network and one of our employees has an external device that holds all of his photos which he accesses via a shared network drive. Last week he was able to access it just fine using his log-in credentials, but now he's getting this message whenever he tries to type in his password:He doesn't have any issues logging-in to the domain, and from what I can tell he has the same permissions as he had last week and his account\/password isn't disabled. He had the credentials saved in the Windows Credential Manager last week but those were gone when I looked at his computer this morning and when I tried entering in the credentials again I got the same message. I was able to find a temporary workaround by using credentials for a different account on the domain, but I can't figure out why it's not accepting his password here, but does on everything else. His computer is running Windows 10 Pro if that helps.","solutions":["Hi Brian, I have encountered this a few times while using active directory. For some reason there are times when a permission is not inheritable and it causes the exact issue you are describing.My suggestion would be to either remove the group he is part of for the permission and then re add it and inherit those permissions to all folders and sub-folders and\/or to add him as permission to this drive specifically and see if that works.","Thanks for the suggestions!I tried them but unfortunately they didn't work. When I tried to add him as a permission to the drive I got this message:I also tried adjusting the permissions as an administrator as well as change the owner of the drive to the user but received the same message each time. Do you have any other suggestions?","I've seen that error before on AD - try this: https:\/\/answers.microsoft.com\/en-us\/windows\/for...It's obviously having an issue with permissions","Thanks for the response! I had also tried that and received the same error message. I also noticed that any changes that did take effect were negated once the user logged off then back on to his computer.","Wow! I think his SID is causing an issue... What if we did this...what would happen if you made another user with the exact same name and made the username let's saynewusername1 and had him logon - would that work? I wonder if its an issue of having to delete his user account and re-add it.","Thanks for the suggestion!I created another account with the same permissions and it has access to the shared drive. I haven't deleted the original account yet because I wanted to see if there was anyway that it can be saved because this user has their desktop set up in a very specific way and ideally it would be better to save the original account than to delete it and remake it as I fear that all of his desktop settings on his computer would be lost since the remade account would technically be a new account. Any suggestions?","Thanks again for the suggestion!I was curious to see if there's any way that his original account can be saved\/salvaged because this user has their desktop set up in a very specific way and ideally it would be better to save the original account than to delete it and remake it as I fear that all of his desktop settings on his computer would be lost since the remade account would be viewed as a new account on his computer. Any suggestions?"]},{"symptom":"Cant create folder in c:\\users\\user\\pictures (or documents)        I can't add a folder to the pictures folder or the document folder now.  I was trying to import photos from my iphone, and it stopped. It wouldn't get half the photos and wouldn't create anymore folders. So, I went to explorer to manually add a folder, and this is what I get.  This is a new install of Windows 10 on a brand new SSD hard drive. ","solutions":["I cant save to these folders either.","Hi Leeann, You may want to try the suggested steps in this article: https:\/\/helpdeskgeek.com\/help-desk\/fix-could-no...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"Game Pass Ultimate        So today, I bought Game Pass Ultimate off the Microsoft Store on PC. I go to download a game and when I press install, I only have the option of installing it on my Xbox, even though I want it to be installed on my PC, does anyone know how to make it install the game onto my PC?","solutions":["Yes, Minecraft is not part of the Windows game pass. Which it would need to be in order to install on a PC."]},{"symptom":"File Explorer not responding in Windows 10        windows 10 my file explorer is not responding. [Moved from: Windows \/ Windows 10 \/ Files, folders, & storage]*Modified title for accuracy**Original title: windows 10 file explorer not responding*","solutions":["Open Start, type: file explorer options Hit Enter Select the General tab Click Restore defaults Could be an issue with your display driver. uninstall your display driver then restart Press Windows key + X Click Device Manager Expand Display adapters Right click the current display adapter Click Uninstall Exit Device Manager Restart","I'm Greg, a volunteer installation specialist and 8 year Windows MVP, here to help you.Right click Start button to open Task Manager. On Processes tab, scroll down to Windows Explorer under Windows Processes. Highlight, then click Restart button at bottom.If this isnt' enough go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... But remember that Factory or Upgrade installs are inferior installs which most enthusiasts won't even run because they'd expect endless issues. Consider doing the Clean Install in this link which compiles the best possible install that will stay that way as long as you stick with the tools and methods given: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... There is also an automated Refresh that reinstalls WIndows while shedding corrupting factory bloatware, saves your files, but doesn't clear the drive to get it cleanest:https:\/\/www.howtogeek.com\/265054\/how-to-easily-... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved."]},{"symptom":"Weird visual glitch in apps        As you can see in the picture below I've been having this weird visual glitch that only happens certain apps like in this example in Visual Studio Code but also in the Discord PTB and I've tried everything updated my graphics drivers, rolled them back to updates when I didn't have that visual glitch and also tried around with Windows settings but I can't seem to figure out what it is. I would really appreciate the help. Thanks to everybody who is willing to help me solve this problem.","solutions":["Hi there, My name is Riccardo and I want to assist you today with this issue...a few questions:1. If you change your resolution (to a lower) does it work better? 2. If you use Windows 10 default standard colors does it work properly? 3. What type of GPU are you using? 4. Is Windows up-to-date with Windows 10 Feature 1909? Let me know the answers and we will get to the bottom of this.","One thing I forgot to mention is that I am using a Windows Insider Program OS build. But I manage to fix it by updating my OS to 19536.1000 I now can't use Wallpaper Engine but I at least know that I'm not the only person that is having a problem and I can live without Wallpaper Engine for some time ^^. I really appreciate your help Riccardo and thank you for taking the time to help someone in need! ","No problem. I’m glad there is a fixing place as this would be very annoying!"]},{"symptom":"Battery Report Anomaly        Hello Folks,Lately, I have noticed that the battery on my Lenovo Yoga 920 laptop has been dying rather quickly while in connected standby.Taking a look at the battery report (generated by typing \"powercfg\/batteryreport\" in WindowsPowerShell), I noticed some values in the \"Usage History\" table that did not make sense.For instance, during the 7 day period between 02-10-2019 and 02-17-2019, the battery report states thatthe laptop was in connected standby mode (while running on battery) for 704 hours, 27 minutes and 54 seconds.This is simply impossible, as there is only 168 hours in a 7 day period.To look further into the matter, I took the data from the \"Usage History\" table in the battery report and visualized itusing Excel. The attached figure shows time on the x-axis and total usage (in hours) on the y-axis. The total usagewas calculated as follows: total usage = active battery duration + connected standby battery duration + active AC duration + connected standby AC duration (please see column headers in the second figure \"Usage History\" table to make sense of what I am trying to explain).My question is this: given my recent experience of quick battery drains while the laptop is in connected standby, should I be concerned with the spikes seen in the figure? In theory at least, shouldn't we expect the blue curve to be very close to the orange line of 168 hours? Thanks,John","solutions":["Hi John, These oddities you are in the battery report coincide with a battery life that is less the optimal. How old is your laptop?","Hey Rick, My laptop is only 1.5 years old ","What are you currently getting for battery life? Were you always on Windows 10? Or did this just start.","I'd say around 6 hours from full charge. Yes I was always on Windows 10.","Ouch that’s around half of what the manufacturer suggests. This is looking like a defective battery.You may be eligible for a replacement from Lenovo. They will ask you to use some battery optimizing techniques; but, the data you are showing especially these massive spikes it’s showing that a hardware issue exists.Have you updated your BIOS? Lenovo may have a battery diagnostic through the BIOS to check if there is an inherent issue.","Thanks for the good leads Rick, I'll look into these. Cheers, John","Thanks let me know."]},{"symptom":"Can I display Power BI dashboard as a Windows 10 Lock screen?        Hello, I've seen mentioned that you can choose Power BI as an app to display detailed information on the Windows Lock Screen under \"Personalize\"  Is this possible? the only apps I see are the default mail, Skype, calendar and the plus signs where there is a limited browse ability for some app but not Power BI.Thank you,Scott","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.It’s not something I have seen included natively with Power BI however they may be third party apps which offer this functionality.Regards, Ross"]},{"symptom":"Can't login with microsoft account or school account on word (office 365) incl. windows store.        Problem: Can't login with microsoft account or school account on word (office 365) incl. windows store.Why the problem occurred: Changed Microsoft account from *** Email address is removed for privacy *** to *** Email address is removed for privacy ***. In the process, everything that could be moved from the file C: \\ Users \\ Karwa to C: \\ Users \\ star was moved. Then all the files that could be deleted was deleted, the only thing that was left in the Karwa file is C: \\ Users \\ Karwa \\ AppData \\ Local \\ MEGAsync \\ ShellExtX64.dll which does not go away for unknown reasons. The Karwan account was deleted through the control panel and got its admin rank stripped while the Starnerd account was created there and got the rank as admin.What I have done to fix the problem: I followed the references in several pages but this one specifically (https:\/\/support.office.com\/en-us\/article\/why-do-i-receive-the-error-sorry-there -s-an-issue-signing-you-in-right-now-6b226ccd-fbf0-4fe2-bfb6-11e86a09b483) led me here and I have reinstalled office 365 once.Version of Word: 1902Version of Windows 10 Home: 1909 \/ OS Version: 18363.535Error code: 0x80070520Extra: the cause seems to be connected to windows itself. Considering that I can't log in to the Windows store. Nor can I connect my work account to windows via Start menu>Settings>Account>E-mail & app account> add work account. I get the same error everywhere 0x80070520.","solutions":[]},{"symptom":"Can I Duplicate a Windows 10 BackUp and use it for recovery?        I know this is a Strange Question to ask!I have setup a 1tb HDD(:E Drive) for Backup, If I copy paste all those files to another external HDD (:Z Drive) for safety purposes. Will I be able to use :Z drive for recovery?","solutions":["Hi Jefrison, one may use backup and copy it to another drive but exactly backup made by backup program.Second (reserve) installation require second license unfortunately. Third copy of installation requires third license and so on.","Nobody knows what \"all those files\" are.If you are backing up only your personal folders, like Documents, Music, Pictures and Videos,  you can - and should - store multiple copies of your backups on different media. The mantra among backup professionals is \"2 is 1, and 1 is none.\"If you are backing up your entire hard drive, or just your software (because you store your personal folders on a separate partition) the proper way to do that is by making animage backup. You'll need third-party software for that, which compresses the image into a single file that you can copy to multiple media.The image is an exact copy of your hard drive, so when you restore the image, your computer goes back in time to exactly the way it was when you made the image. Moreover, it takes just minutes to restore an image."]},{"symptom":"Windows Boot Manager showed up when restarting Windows.        Windows 10 Enterprise (1803) 17134.1184Hey,When I restarted my laptop today, I encountered an issue with Windows Boot Manager showing up, saying, \"Windows failed to start...\".I have attached an image of the Popup.I pressed Enter and went over to OS selection and there were two options: 1. Windows 10 and 2. Windows 10 Fast Mode.I selected Windows 10 and PC woke up as usual but I still want to know what caused that thing to come up.I'll be grateful if you could take a second to give me some info. and details of the popup.Thanks,Jyotirmay Kumar Jha.","solutions":["Hi Kumar, How did you obtain Windows 10 Enterprise license? Error code says the trial period is over."]},{"symptom":"How to bring back - probably 'Missing Folder'        Happy New Year Is Not so Happy to me today - I was copying and pasting something from a Mobile Device, Hardware, or Drive - and with that unit window open I use the Right Mouse Button (RMB) and selected 'Copy' - then went to an open spot on my desktop (which there was not a lot of open space because I have a lot of icons on it) and click on Right Mouse Button (RMB) and selected 'Paste' -- BINGO (not in the 'positive' sense) a bunch of icons on the desktop were rearrange - - I will not type or repeat what came out of my mouth - but - in rearranging the icons back to where they belonged initially (using a 'capture picture' to go by that was previously taken) - I noticed that an integral 'Folder' was missing - that contained past articles that I wrote for Facebook Posts -- it was NOWHERE to be found - I looked everywhere I looked inside other folders - I looked inside The Trashcan - - sometimes when something like this happens before some folders or icons somehow will move off of the visible 'desktop' screen - I looked there - nothing - I tried a computer 'restore' from one day before (when I do remember the folder being there and using it ) - - the message said restore completely successful - something to the fact that - 'Documents' were not affected etc. (which the missing 'Folder' was full of??)Anything else I can try to find or bring back this 'Missing Folder'","solutions":["How do I SEE & READ views & answers to my Q's posted?? - ArtisteBob","To answer your last question first, when someone replies to your question, you'll get a notification email.  Click on the \"Post a reply\" button at the bottom of the email to be taken to the thread.  Alternatively, click on your name at the top right of any page after you've signed into Microsoft Community and then click \"My Profile\" (NOT \"My Microsoft account\") and you'll get to your Microsoft Community profile where you'll see a list of all the threads in which you have participated.  Click on any of these to go to the thread.If you want to reply, you MUST go to the thread and click the \"Reply\" button.  DO NOT use your email to send a reply -- that will go to the great bit bucket in the sky.With respect to your \"lost\" folder, first of all, a System Restore does not restore any of your personal data files.  It restores your \"computer's state (includingsystem files, installed applications, Windows Registry, andsystem settings)\" -- that's why it's call System Restore.If you remember the name of one or more of the \"missing\" files (even a partial name), you can search for it.  You can use either the built-in search functionality or -- my preference -- (free) Agent Ransack, which is more powerful and easier to use. https:\/\/www.mythicsoft.com\/agentransack\/See the following articles for descriptions of how to use Windows 7 Advanced Searchhttps:\/\/www.howtogeek.com\/73065\/learn-the-advanced-search-operators-in-windows-7\/https:\/\/www.groovypost.com\/howto\/howto\/use-advanced-search-in-windows-7-similar-to-windows-xp\/Because the most likely place that your missing folder has gone to is somewhere in your user profile, if you are using Windows Advanced Search, start by clicking Start and then click your account name at the top right of the Start Menu (not the icon, but the name).  This will open a Windows Explorer window at the \"root\" of your user profile, so when you use the search box at the upper right of that window, you'll be searching through your entire profile.If you're using Agent Ransack, use the \"Browse for a single folder\" icon at the right of the \"Look in\" box and then browse to C:\\Users\\<youruseraccountname>Once you find a file that was in the missing folder, right-click on it and select \"Properties.\"  You'll see the file's current location next to \"Location\" on the \"General\" tab of the file's Properties."]},{"symptom":"Sculpt comfort mouse disconnection at frequent intervals        I have 2 of these mice and have had continual problems for several years onmultiple devices. The mouse disconnects during use at seemingly random intervals. Turning the mouse off and on has no effect.Disabling power management for the mouse has no effect.In the past I've managed the problem by sleeping the PC and when it wakes, the mouse starts working again. However doing this dozens of times a day is extremely frustrating. I recently discovered that if I launch the Mouse and Keyboard center app, connection is reestablished. However, leaving the app running does not solve the problem either. The mouse will still disconnect and the app has to be restarted to fix the connection.Clearly this is an ongoing hardware\/software bug because the problem persists with multiple mice on multiple PCs. If I can't get a solution then I will have to throw these mice in the trash.","solutions":["Hi Mondrian and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that might help you resolve your concern. You can check and see if the instructions provided can help you.Device Manager -> Bluetooth -> Intel Centrino Wireless Bluetooth 3.0+ High Speed AdapterSelect the Driver tab Roll Back Driver Restart PC So, I am now using Microsoft's Generic Bluetooth driver, and have had no issues for the past couple of days.I also run this tool in order to prevent updates to the driver: https:\/\/support.microsoft.com\/en-us\/kb\/3073930Full Thread: https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this helps. Feel free to ask back any questions and let me know how it goes. I will keep working with you until it's resolved.Thank you!","Thanks for your reply. I looked at the instructions. On my laptop, the bluetooth device seems to be Intel Wireless Bluetooth in Device Manager. The option to roll back driver is greyed out. The only options available areUpdate Driver and Uninstall Device. There is also Bluetooth Device (RFCOMM protocol TDI) but same issue.Not sure where to go from here","Hi Mondrian, I will release the question for other experts come to give his opinion, I am sorry not to find the problem.Thanks!","Thanks Joseph. I really don't know what to do anymore. I must have had to sleep my Surface 2 and 4 ten thousand times in the last 3 years to get the mouse working again. Now it's the same on my Asus. I can't count all the wasted time and focus this has cost me. Add to this thetwo replacements of the Surface 4 because MS replaces a faulty tablet with one that has the same fault...Never had any MS hardware that worked properly. I scream out loud sometimes.","What does it take to get a reply from an actual Microsoft Employee??These mice are clearly garbage. Do you know how many thousands of $$$ of productivity you have cost me with garbage mice and Surface Pro hardware??WHY DOESN'T MICROSOFT TAKE RESPONSIBILITY??In the 3 minutes it took me to type this reply the F**king mouse stopped working  twice!!!!!  You do the math over 3 years!!!"]},{"symptom":"Windows Defender is Cleaning those files which are not virus, what to do?        I'm using Windows 10 in my Lenovo laptop but I'm shocked when Windows Defender is notifying me that your file is infected and was quarantined. I believed that the file is cleaned and not infected. Now what to do?","solutions":["Hi ChrisJaroc and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.Since you are sure that the file is cleaned, you may \"Restore\" the quarantined file. For more detail on this solution, check out this article and look for \"How do I review a quarantined file?\" :https:\/\/support.microsoft.com\/help\/4466972Next, I would suggest you add an exclusion for that file, so that it doesn't get quarantined again:https:\/\/support.microsoft.com\/help\/4028485Please let me know if I can help you further!"]},{"symptom":"no sound driver installed in device manager        no sound driver installed in device manager","solutions":["Hi Most likely this is caused by Windows updates . . . Go to the support page for your PC on the Manufacturers website, then from there, download and install the Audio device drivers they recommend for your PC . . .If you have any difficulty locating that support page, what is the Make and exact Model No. of your PC - that will be printed on a sticker on the bottom casing of your PC . . ."]},{"symptom":"LINE 1 OF SOUND CARD IN USE BY ANOTHER PROGRAM        I use various software with audio from a radio to accomplish various functions. This has worked flawlessly until this week. I now get a flag everytime I try to open any software that uses LINE IN ,it says LINE IN OF THE SOUND CARD IN USE BY ANOTHER PROGRAM, the software I am trying to use stops and will not proceed to open.I still hear the audio from the radio out of my PC speakers.As far as I can tell there is no other software using the LINE IN audio.This seems to have occurred but I am not sure soon after I upgraded Windows 10 from version 1903 to 1909.I tried to upgrade and reload the Realtek audio drivers ,doesn't help.I am unable to revert back to Windows 10 version 1903,Audio settings are all correct ?Everything else on my PC works perfect.Any ideas.Al","solutions":["Hi AI Open the Settings App (gear icon on your Start Menu) Go to Privacy - Microphone Check the list of Apps allowed to access your Microphone for any clue as to what may be using the Audio Line InTemporarily turn off all access to your Microphone on that settings page, then restart your PCThen check to see if you are still getting that Line In error . . ."]},{"symptom":"Program Files folder Read Only        Hi,I have an application which is installed in the \"Program Files\" folder. I need to change the configuration file in one of the application's subfolder, but folder is marked as Read Only as are all folders in \"Program Files\" an their subfolders.I tried following sollutions:1) right click the folder and change the properties (deselect Read Only)2) change the folder's attributes using a cmd window as administrator3) played around with the user permissionsNo solution seems to work. It looks as if the read only attribute is dropped, but immediately put back to Read Only again. The user which is performing this tasks is a member of the administrators group.How can I change the  configuration file?Kind regards,Fred","solutions":["Hi Fred If you select that file, copy it (Ctrl _ C) then go to the Desktop and paste that file there (Ctrl + V)Edit the config file on the Desktop and then try copying that file back into the application folder, does that succeed?","Hi Dave,Thank you! This works. Simple solution but didn't think about it. I tried copying the file locally and then editing the file but that didn't work. Your solution works like a charm.Fred","Hi Fred, glad to Help!"]},{"symptom":"I merged My User folder and My Downloads folder.        I merged my User folder named (Sridhar Rambhatla) with my Downloads folder accidentally. This is how my Users folder looks .The Location still says Sridhar Rambhatla . I even tried using regedit and changed the name to %USERPROFILE%\\Downloads.What do i do to restore the location of my Downloads Folder?  ","solutions":["Hi Sridhar This can be fixed by editing the registry . . . Click your Start Button, type regedit and hit Enter to open the Registry Editor Click View and make sure 'Address Bar' is turned on Paste this into the Address Bar at the top and hit Enter HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell FoldersPlease provide a screenshot of the resulting Registry Editor window . . .","I did that. It didn't work.","Hi Sridhar Open the Registry Editor again, it will still be on the same page . . . 1 Double click {7D83EE9B-2244-4E70-B1F5-5393042AF1E4} then set its Value Data to this and click OK%USERPROFILE%\\Downloads 2 Close the Registry Editor and then restart (not shut down) your PC That should have separated those folders fro you . ."]},{"symptom":"Wifi Networks dont show up        After my pc got a hardware change, wifi networks wont show up anymore. I cannot connect to wifi or bluetooth","solutions":["Have you gone to Device Manager, Network  and checked the adapter?  Also; does Bluetooth show up in Device Manager?  If not have you gone to the top and Scan for hardware changes?","Hi BrandonChen2, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Follow the instructions on the website that the Windows MVPs share, you have a series of steps that can help you solve the network problem.https:\/\/thegeekpage.com\/fix-wifi-network-is-not...Regarding Bluetooth, if you have connection problems, you can check the official Microsoft instructionshttps:\/\/support.microsoft.com\/en-us\/help\/14169\/...Let me know if you have something else that I can help you with, I'd be happy to help.Happy holidays Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hello, Please run Network Adapter troubleshooter from Settings app > Update & security > Troubleshoot. Let us know what it reports back. Regards.","bluetooth doesnt show up in device manager, even after I scanned for hardware changes.","Wifi doesn't appear when I do \"Press Windows Key+R to launch Run, type “ncpa.cpl” and hit Enter.\" Only ethernet appears ","Hi, Verify that it is not disabled in the option >> Change Adapter Settings Regards"]}]}