{"windows":[{"symptom":"cannot send or receive emails        We have had a power outage here due to bushfires, and now my email is not sending or receiving. Unable to send or receive messages for the Lobethal (themoos) account. Windows Live Mail couldn't log on to the email server using authenticated POP (APOP). Contact your email provider and verify that it supports authenticated POP. To change this logon setting, in the folder list, right-click on the account name, and then click Properties on the shortcut menu. In the Properties dialog, click the Servers tab and then under Incoming Mail Server, select a logon option.Server: 'pop.lobethal.net'Windows Live Mail Error ID: 0x80004005Protocol: POP3Port: 110Secure(SSL): Nowhat does this mean??cheersRoseanne","solutions":["Hello, Roseanne,Sorry for the inconvenience. The fire may have destroyed a transformer. Contact your Internet Service Provider. They can check your connection and get you back on track.","Server: 'pop.lobethal.net'Where did you get that name from?Lobethal is the name of a country town in the Adelaide hills where the bushfires have been bad; one of many places in Australia.This part is confusing:Lobethal (themoos) account.Who is your Internet Service Provider who supplies your Internet Connection?","Server: 'pop.lobethal.net'Where did you get that name from?Lobethal is the name of a country town in the Adelaide hills where the bushfires have been bad; one of many places in Australia.This part is confusing:Lobethal (themoos) account.Who is your Internet Service Provider who supplies your Internet Connection?lobethal.net is our domain name, which we own. we are with BigPond. And yes, we live in Lobethal, had a bushfire go over the top of us, house ok but 6.5 acres of burnt our trees etc....","Hello, Roseanne,Sorry for the inconvenience. The fire may have destroyed a transformer. Contact your Internet Service Provider. They can check your connection and get you back on track.we were getting emails after the fire, but all of a sudden it has changed.  I am not familiar with all the POP3, IMAP stuff, so not sure how to correct any of that.  We also check our mail through MailWasher, whether this might be part of the problem??","I suggest that you contact Telstra\/BigPond to check the settings.As it appears that Telstra is hosting your Domain Name 'pop.lobethal.net', the Business section of Telstra would be where to ask.Or just ring Telstra and they will transfer you to the correct section.Cheers."]},{"symptom":"Chrome screen totally white with 2 inch black bar across        Chrome screen totally white with 2 inch black bar acrossScreenshot belowCan't access settings or extensions as no menu dots and when I right click I get a black screen with thick white band on or sometimes totally blank, no address bar, bookmarks menu, 3 dots, nothing.Done compatibility test, nothing happensTried uninstalling and reinstalling, nothing happensTried rebooting and restarting no joyNo joy with anything, cant access extensions F11 doesn't work eitherScreenshot below, can anyone help pls, at wits end.PS sorry screen looks beige\/orange, I have blue light filter on, but the beige\/orange is actually white. Thanks","solutions":["You tried uninstall\/reinstall Chrome.As that does not fix it and as Chrome is a Google Product:\"Chrome Help Center\"https:\/\/support.google.com\/chrome\/?hl=en#topic=3227046\"Google Chrome Help Forum\"https:\/\/productforums.google.com\/forum\/#!forum\/chromeCheers.","HiThanks for your answer.When I turned on chrome today it was ok, but when i opened a new tab the colours were inverted.I used my invert extension to get it back to normal but the problem seems to have cleared, hope it doesn't come back.","Glad you sorted it out.","Glad you sorted it out. HiProblem returned.Sorry there was no help in the link supplied.I even had the black band on IE briefly.I'v since tried many solutions on the internet, using IE as default browser.Unable to install chrome.Running compatibility test.Trying to reinstall chrome.Loads of other things, nothing works.The screen on chrome is totally black, when I press F11 I get a white band across.No answers on your link help with my problem, don't mean to sound ungrateful, but am at wits end as to what to do.","I never gave you the links just to look at.I gave them to you to ask your questions there about these problems with Google's Chrome browser.It is Google's software you are having problems with, not Microsoft's.","Problem returned.Sorry there was no help in the link supplied.I even had the black band on IE briefly.I'v since tried many solutions on the internet, using IE as default browser.Unable to install chrome.Running compatibility test.Trying to reinstall chrome.Loads of other things, nothing works.The screen on chrome is totally black, when I press F11 I get a white band across.-From that useless Chrome window, open an Incognito Chrome session from [Ctrl+Shift+n] Does that window open normally?Don"]},{"symptom":"Change from Windows 10 S mode to Windows 10 Home        Change from Windows 10 S mode to Windows 10 Home","solutions":["Hi Javier Open the Settings App Go to Update and Security - Activation In the Switch to Windows 10 Home or Switch to Windows 10 Pro section, select Go to the Store. (If you also see an \"Upgrade your edition of Windows\" section, be careful not to click the \"Go to the Store\" link that appears there.)On the Switch out of S mode (or similar) page that appears in the Microsoft Store, select the Get button.After you see a confirmation message on the page, you'll be able to install apps from outside of the Microsoft Store.","There is no Switch to Windows 10 Home section in theActivation menu","I purchased a new HP laptop 6 days ago. The sales man told me I could upgrade from Windows 10 S mode to Windows 10 home at any time. He even told me how to do it. Or I could pay them to do it for me.I have tried this repeatedly for 5 days, always with the same outcome.Try again later. something went wrong on our endWhat do I do now?????"]},{"symptom":"Periodic BSoD after upgrading to Windows 10 from Windows 7        Today I upgraded to Windows10 from Windows7. I did this many times without issues, but this time it's not perfect.I have periodic BSoD since the upgrade - I didn't have any before the upgrade, so I don't think it's a hardware issue. I already tried upgrading the video card driver, but no luck. I had 9 BSoD in the last 8 hours, so getting a little annoyed with it, but didn't find any solution so far.Found the minidump files and uploaded here: https:\/\/1drv.ms\/u\/s!ArZ7KNeb5Ho8kHZqautjTDJm1xpl?e=5Svk3ELet's hope it contains information what went wrong.Thanks in advance, Ivan","solutions":["Hi Ivan, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved.Keep in mind all it takes is a single hardware component or driver to not be compatible to cause this issues. It could be anything. All 3 minidumps were identical BugCheck 109 :BugCheck 109, {a39fe865a6d03767, b3b6f4ebf9526cd4, ffffa90d06e46620, 1c}Probably caused by : Unknown_Image ( ANALYSIS_INCONCLUSIVE )Further analysis revealed on a little help.1. If you are over-clocking anything STOP! Not only can OC cause BSOD's it can make them virtually impossible to troubleshoot.2. Fully uninstall Daemon Tools which has been known to cause issues.3. Fully uninstall Avast which is either the cause or helping to mask the cause. Use only Windows Defender which in Windows 8\/8.1 & 10 is a full antivirus. (It is what I use on all my systems and those I manage.)fffffc0f`2b9e9868  fffff803`63dece4cUnable to load image \\SystemRoot\\system32\\drivers\\aswVmm.sys, Win32 error 0n2*** WARNING: Unable to verify timestamp for aswVmm.sys*** ERROR: Module load completed but symbols could not be loaded for aswVmm.sys aswVmm+0xce4cAvast - Uninstall Utilityhttp:\/\/www.avast.com\/uninstall-utilityList of anti-malware program cleanup\/uninstall toolshttp:\/\/answers.microsoft.com\/en-us\/protect\/wiki\/mse-protect_start\/list-of-anti-malware-product-removal-tools\/2bcb53f7-7ab4-4ef9-ab3a-6aebfa322f75Uninstallers (removal tools) for common antivirus software http:\/\/kb.eset.com\/esetkb\/index?page=content&id=SOLN146 4A. Check with Gigabyte Support, their on-line docs, and drivers, Ask them about known issues. Update the BIOS, chipset drivers, and all major drivers (see driver update methods below).BiosVersion = F14BiosReleaseDate = 04\/17\/2013 <-- Current BIOSSystemManufacturer = Gigabyte Technology Co., Ltd.BaseBoardManufacturer = Gigabyte Technology Co., Ltd.BaseBoardProduct = B75M-D3H4B. Check with Nvidia Support and their forums about any known issues. Update the video drivers.fffff803`6a850000 fffff803`6b8c9000   nvlddmkm.sys dated 3\/23\/2018 Nvidia video drivers.Nvidia - Drivers - Use OPTION 1 to manually enter your driver info to get most current drivers. http:\/\/www.nvidia.com\/Download\/index.aspx?lang=en-usNvidia Support - check with Support as it could be a known issuehttp:\/\/www.nvidia.com\/page\/support.htmlNvidia Forums - also check for forums as it could be a known issue and\/or others likely to have ithttp:\/\/forums.nvidia.com\/5.  Not required yet a good idea would be to remove ALL power then reseat the cards, memory, and cables (on both ends when possible) - actually remove and reseat them - do not just snug. Clean the vents and remove any dust bunnies, Ensure the system has adequate ventilation.6. Run the memory tests (see methods below).7. As needed use ALL the methods in the troubleshooters below.8. After ALL the above if needed run Driver Verifier to see if it can indicate a CAUSE (see Driver Verifier methods below).-----------------------------------------------------------Troubleshoot blue screen errors <-- read this linkhttp:\/\/windows.microsoft.com\/en-us\/windows-10\/troubleshoot-blue-screen-errorsProbably a hardware issue, be sure to check the memory very carefully (see methods below).Remove ALL power then reseat the cards, memory, and cables (on both ends when possible) - actually remove and replace - do not just snug.How To Reseat Expansion Cardshttp:\/\/pcsupport.about.com\/od\/fixtheproblem\/ss\/reseat-excards.htmHow to Reseat a Desktop Memory Modulehttp:\/\/pcsupport.about.com\/od\/fixtheproblem\/ss\/reseat_memory.htmHow to Reseat Internal Data and Power Cableshttp:\/\/pcsupport.about.com\/od\/fixtheproblem\/ss\/reseat-power-cables-data-cables.htmReseating your RAM, Video Card, and Hard Drivehttp:\/\/www.youtube.com\/watch?v=DLxNPBQBfT8========================================================= Does the system have RAID? If so that is also very suspect.If software related, this error is usually a driver issue and display adapter (video) driver is the most suspect though it could be others. Antivirus\/antispyware\/security programs, hardware (heat) and major software issues can also cause the error. When you get to the driver section of the troubleshooter use my generic methods below and then return to the troubleshooter if needed. Have you added hardware recently or updated drivers? Be sure to look in Control Panel - Windows Updates to see if any drivers were updated there. Other lessor possibilities include antivirus\/anti- spyware\/security programs.BCCode:  109      0x00000109  BCCode: 109    0x000000109 <-- read this linkhttp:\/\/www.faultwire.com\/solutions-fatal_error\/Modification-of-system-code-or-a-critical-data-0x00000109-*1262.html?order=votes or  https:\/\/tinyurl.com\/y5kaqsby=================================================This utility makes it easy to see which versions are loaded : Run DriverView - set VIEW to Hide Microsoft drivers - update those without Dump in their names (and update BIOS and chipset drivers).DriverView - Free - utility displays the list of all device drivers currently loaded on your system. For each driver in the list, additional useful information is displayed: load address of the driver, description, version, product name, company that created the driver, and more.http:\/\/www.nirsoft.net\/utils\/driverview.html  For Drivers check System Maker as fallbacks and Device Maker's which are the most current. Right Click the Start Button - Device Manager - Display Adapter - write down the make and complete model of your video adapter - double click - Driver's tab - write down the version info. Now click UPdate Driver (this may not do anything as MS is far behind certifying drivers) - then Right Click - Uninstall - REBOOT this will refresh the driver stack.Repeat that for Network - Network Card (NIC), Wifi, Sound, Mouse and Keyboard if 3rd party with their own software and drivers and any other major device drivers you have.Now go to System Maker's site (Dell, HP, Toshiba as examples) (as rollback) and then Device Maker's site (Realtek, Intel, Nvidia, ATI as examples) and get their latest versions. (Look for BIOS, Chipset, and software updates at System Maker's site while there.)Download - SAVE - go to where you put them - Right Click - RUN AD ADMIN - REBOOT after each installation.Always check in Device Manager - Drivers tab to be sure the version you are installing actually shows up. This is because some drivers rollback before the latest is installed (sound drivers particularly do this) so install a driver - reboot - check to be sure it is installed and repeat as needed.Repeat at Device Makers - BTW at Device Makers DO NOT RUN THEIR SCANNER - check manually by model.Manually look at manufacturer's sites for drivers - and Device Maker's sites.http:\/\/pcsupport.about.com\/od\/driverssupport\/ht\/driverdlmfgr.htm    ====================================================Memory tests do not catch all errors such as mismatched memory (possible even for sticks that appear to be identical) and when faster memory is placed in the system behind slower memory. So it is best to also swap sticks in and out to check for those even if all memory tests fail to show a problem.To test RAM check here - let it run 4+ hours or so.  <-- best methodwww.memtest.orgMemTestX86 - Test RAM Withhttp:\/\/www.tenforums.com\/tutorials\/14201-memtest86-test-ram.htmlFor the Windows Memory Diagnostic Tool.Type in Cortana's search box ->  Windows Memory Diagnostics  ........find at top of the list - click it. in Windows 8\/8.1\/10 the name is \"Windows Memory Diagnostic\".================================================After doing ALL the updates you can, and if the issue continues, then run Driver Verifier. Driver Verifier can help find some BSOD issues : Using Driver Verifier to identify issues with Windows drivers for advanced usershttp:\/\/support.microsoft.com\/kb\/244617How To Troubleshoot Driver Problems in Windows Vista or 7. (8\/8.1 and 10  are essentially the same).http:\/\/www.winvistaclub.com\/t79.htmlUsing Driver Verifierhttps:\/\/msdn.microsoft.com\/en-us\/library\/windows\/hardware\/ff545448%28v=vs.85%29.aspx?f=255&MSPPError=-2147217396 WINKEY + X - RUN - type in -> verifier \/reset      hit enter to disableIf Driver Verifier creates a minidump upload it and post the link here so we can analyze it.Here to help,Rob------Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all.","Thanks for the quick answer Rob,1, No overclocking, so that's not the cause2, Daemon tools has been removed by the Win10 updater3, That's the last thing I'll try - you can be brave, but I'm not (and I'm a software engineer too, so I know what I'm talking about)4A, I'll take a look at Gigabyte support4B, That's the first thing I did. Upgraded to the latest NVidia driver5 & 6, I'm sure it's not a hardware issue: never had before the upgrade and had 9 since than (the upgrade finished around 10 hours ago) - too much of a coincidence to be believableI'll try the rest and get back to you.","Daemon Tools is still loading as shown in the minidumps. Here is just one part : dtliteusbbus.sys dated 12\/28\/2015 Daemon Tools lite. BTW, be sure to fully uninstall SPTD.sys as well. sptd.sys dated 10\/11\/2009 Both of those are known issues. ------ Did you update Nvidia manually? Check the rest of the drivers as confirmed dates and versions by Driver View.It could be a hardware compatibility issue, meaning the hardware and\/or available drivers are not fully Windows 10 compatible.Here to help, Rob","Were you able to get the issue resolved or do you still need assistance? Feed back helps us help others and we are here to help. Rob","Hi Rob,I didn't want to give feedback too early to make sure it really worked. But it seems it did. I removed the remnants of Daemon Tools and haven't had a single BSoD for two days!Thank you for your help,  Iván","Excellent! Very good troubleshooting. If you don't have any additional questions, feel free to mark as Answer and choose a rating which helps others find the right info.Glad to have helped, and have a great day! Rob"]},{"symptom":"Microsoft Plus Digital Media Edition        So I have a Compaq Presario computer from 2005, and it came with Plus Digital Media Edition, but I never got a Product Key for it because it was pre-installed. So I can't use it. Any help?","solutions":["If it came preinstalled as an add-on to XP, you will have to contact HP.But I doubt if they would even know about it now.https:\/\/en.wikipedia.org\/wiki\/Microsoft_Plus!Marketed as \"The Ultimate Photo, Music, and Movie Enhancement Pack for Windows XP\", Microsoft launched Plus! Digital Media Edition along withWindows XP Media Center Edition. Plus! Digital Media Edition signified the first time Microsoft had released a second Plus! product based on the same base operating system. Microsoft Plus! Digital Media Edition was also the first Microsoft product to be made available for sale to consumers via e-commerce as full product download through online retailersTo find your XP operating system product key:Compaq is HP.If OEM preinstalled (Dell, HP, etc.) license:The COA sticker, which has the Product Key on it, is either on the underside of the Laptop or in the Battery Compartment.With a Desktop it is either on the side, rear or top of the Computer Case."]},{"symptom":"cant burn a cd this morning and I received an error code 0xc0aa0301 I have made no changes to this computer burned one last week the computer is a HP Pavillion        Hi, I have made no changes to my and I can't burn a CD this morning however I burned one last week. I receive and error code 0xc0aa0301. the computer is a HP Pavilion. No blueray or anything like that.","solutions":["Hello AlanDel, I'm Didi, an independent advisor. To fix error 0xc0aa0301 when trying to burn a CD please try the methods listed in this page :https:\/\/support.hp.com\/us-en\/document\/c03280697If this doesn't work boot your computer in safe mode and try to burn your CD. Here's a guide on how to boot in safe mode :https:\/\/support.microsoft.com\/en-us\/help\/12376\/... If burning works in safe mode it could indicate that a service or a background application is the cause of the error.Regards, Didi ----------- Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thank you I will try now and get back to you.","Hi AlanDel, Alright, I'll be waiting for your answer. Regards, Didi"]},{"symptom":"Windows 10 virtualization,...        Hello Folks,      My USB connected computer device wont install and\/or initialize  when Virtualization is enabled in the BIOS.  I can install the driver for the device successfully if Virtualization is  not enabled in BIOS;  thereafter when on the desktop,....the device will initialize and function properly when Virtualization is not enabled in the BIOS>I'm not running a VM but my network requires Credential Guard to be on,..............and in order for Credential Guard to be on is to enable Virtualization in BIOS>I need to get the Device to work and Credential Guard needs to be on.Please lmk,...........much thanks,............................","solutions":["What USB device is it that you are using. What does the manufacturer of that device say."]},{"symptom":"Possible system 32 and\/or SpeechRuntime.exe error        I can use discord and firefox, but every time I try to open another app it'll give me a speechruntime.exe error or a \"the specific procedure can not be found.\" I can't reset pc it gives me an issue everytime i try. I dont know what to do.","solutions":[]},{"symptom":"howto get  erid of option page that faces me whenever I want to access gmail account        how do I get rid of the option page that hounds me when I try to access gmail? It is a nuisance","solutions":["HI Thomas. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.What options page? Can we see a screenshot so we know what you're talking about? Here's how to take one and post it back:http:\/\/windows.microsoft.com\/en-us\/windows-10\/o...How are you accessing your Gmail?  In a browser?   Does this happen with other sites in your browser. I would access your mail in the Windows 10 Mail app which is an easier way to access your mail with a huge inbox that lets you merge all of your Office and Web Mail accounts, and an even larger ad-free reading pane.  See here how to get started:  https:\/\/www.windowscentral.com\/how-get-started-mail-app-windows-10Let me know the answers to the above so I can help you better.","I try to access gmail from Google's page and it is the ONLY program that forces 3 options; on me before I can use gmail;  I cannot get around it.. I've tried to get in via the mastheads or other programs but no luck. Needless to say, it is extremely annoying; especially when I have so may others using that address to check with me."]},{"symptom":"Upgrade to windows 8        I would like to upgrade my laptop from Vista to windows 8","solutions":["Windows 8 is no longer supported.You need 8.1.There is no upgrade path from Vista to 8.1; you clean install it.First check if your computer manufacturer supports and supplies Windows 8.1 drivers for your exact Model Number.Windows 8.1 does not come for free; you have to buy it.Microsoft no longer sells it; try amazon.com, etc..Warning:You do not buy a Product Key by itself, as they are normally stolen\/pirated, Volume Licenses which are not for private use, or MSDN keys which are not to be sold by the original subscription holder.Make sure that you buy the complete sealed package (DVD, license) https:\/\/www.microsoft.com\/en-us\/howtotell\/Shop.aspx Read Section: Beware of Product Keys sold separately.  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@"]},{"symptom":"Windows 8.0 upgrades, Windows 10, Windows Live Essentials and Windows MovieMaker        Three part question:[1] Does an original Windows 8.0 download (legal key) include \"Windows Live Essentials 2012\" with \"Windows MovieMaker?[2] Once a legal Windows 8.0 has been downloaded ...is there still a free upgrade to Win8.1 as there once used to be?[3} If I buy a new license and upgrade to latest Windows 10 ...will Windows MovieMaker \"travel\" on up through either of those upgrades and still be useable in it's original form?","solutions":["https:\/\/support.microsoft.com\/en-au\/help\/18614\/windows-essentialsWe're no longer offering the Windows Essentials 2012 suite for download, but if you already have it installed, it will continue to work as it does today. It reached end of support on January 10, 2017, and it isn't available in Windows 10.Windows Essentials 2012 included:Windows Movie MakerWindows Photo GalleryWindows Live WriterWindows Live MailWindows Live Family SafetyOneDrive desktop app for Windows For similar features, you can upgrade to Windows 10. For example, the latest version of thePhotos app allows you to create and edit videos with music, text, motion, filters, and 3D effects. VisitMicrosoft Store for more video creation and editing apps.Windows 10 also offers many other features similar to Windows Essentials, such asupdated email, family safety, and OneDrive.","There are no legal Windows 8 downloads available.To get Windows 8.1 for free, you already need to have an OEM or Retail licensed Windows 8.Update to Windows 8.1 from Windows 8If the above Microsoft method does not work:Read this information: Windows 8.1 - Update to from Windows 8Or save your Data and do a clean install of the exact same edition of 8.1 as 8 is.Windows 8 > 8.1 is a free upgrade released by Microsoft and this is a workaround if you are unable to get it via the Store, etc.@@@@@@@@@@@@@@@@@@@@@@@@@@You can download and create your own Windows 8.1 Installation Media to reinstall the Operating System with..\"Create installation media for Windows 8.1\"http:\/\/windows.microsoft.com\/en-us\/windows-8\/create-reset-refresh-media\"Download Windows 8.1\"https:\/\/www.microsoft.com\/en-us\/software-download\/windows8A similar Tutorial which may also assist you\"Create Installation Media for Windows 8.1\"http:\/\/winsupersite.com\/windows-8\/create-installation-media-windows-81In the first screen of this very simple wizard, you need to choose the following:Language. English – en-us if you're in the United States.Edition. Windows 8.1 (Core), Windows 8.1 N, Windows 8.1 Pro, Windows 8.1 Pro N, or Windows 8.1 Single Language.Architecture. 64-bit (x64 ) or 32-bit (x86)._______________________________________\"How to Create a Bootable USB or DVD with a Windows 8 or 8.1 ISO\"http:\/\/www.eightforums.com\/tutorials\/2227-create-bootable-usb-dvd-windows-8-iso.html   WarningThis will not work to install Windows 8 or 8.1 for UEFI. For that, see this tutorial below instead.UEFI Bootable USB Flash Drive - Create in Windows_____________________________________How to clean install:\"How to Do a Clean Install of Windows 8 or Windows 8.1\"http:\/\/www.eightforums.com\/tutorials\/2299-clean-install-windows-8-a.htmlMake sure that you read Section 4 about using generic keysIf you have a retailWindows 8 product key and want to clean install Windows 8.1or Windows 8.1 Update, then you would need to enter a generic key below to install unactivated with, and change the product key later on instep 22 below to activate with your Windows 8 key.If you have a retailWindows 8.1 product key and want to clean install Windows 8.1or Windows 8.1 Update, then you are good.If you have an OEM Windows 8product key and want to clean install Windows8.1 or Windows 8.1 Update, then you would need to enter a generic key below to install unactivated with, and change the product key later on instep 22 below to activate with your OEM Windows 8 COA product key.If you want to clean installWindows 8 Enterprise,Windows 8.1 Enterprise, or Windows 8.1 Update Enterprise, then you would need to change the product key later on instep 22 below to activate since Enterprise editions do not ask to enter a key at this step._____________________________________With Windows 8\/8.1 The Product Key on preinstalled Operating Systems (HP, Acer, etc) is embedded in the BIOS in the Motherboard, so that the lost and\/or worn C.O.A. Sticker problem is no more.When you reinstall it will pick up the Product Key and activate the system automatically.If it does not, follow these steps:\"How to Activate Windows 8 and 8.1 by Phone\"http:\/\/www.eightforums.com\/tutorials\/24636-activate-windows-8-phone.html\"Get help with activation errors\"http:\/\/windows.microsoft.com\/en-us\/windows-8\/activation-errors\"How to activate a Microsoft product by using Microsoft Product Activation Center\"http:\/\/support.microsoft.com\/kb\/950929\/en-us_______________________________________________If you do wish to\/need to keep a record of it:\"Windows 10 Embedded Product Key Tool\"https:\/\/neosmart.net\/blog\/2014\/windows-10-embedded-product-key-tool\/\"We’re proud to introduce the immediate release of our newest utility for Windows users: the NeoSmart Technologies Embedded Product Key Tool. Designed for users of Windows 7, Windows 8, and Windows 10, our embedded product key tool will retrieve and display the Windows setup product key embedded in the BIOS or EFI, allowing you to store it for safe-keeping or use it to reinstall Windows with an official Windows setup image.\"You can also use:\"Belarc Advisor - Free Personal PC Audit (Version 8.5c)\"http:\/\/www.belarc.com\/free_download.htmlOr:\"Product KeyFinder\"https:\/\/www.magicaljellybean.com\/keyfinder\/Cheers.","You would have already read no Movie Maker in 10.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 October 2018 Update and previous versions of Windows 10The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700Cheers.","Thankyou for the avalanche of information ….it will take me some time to get to it all.I would have an authentic OEM Win 8.0 key. It seems then that I would get the 8 (or 8.0 and then upgrade to 8.1) ….including MovieMaker.The objective was just to get MovieMaker ….and it seems that I would.The question was: Would Moviemaker \"migrate\" or \"travel\" up with the next (paid for) upgrade to Win10?My wife's laptop free upgrade, from 8.1 to Win 10 (back in 2016) did maintain the full functionality of MovieMaker ….therefore I would expect that a repetition of the upgrades, as described above, would likely work.I was just looking for a bit of confirmation prior to buying another older laptop with an authentic 8.0 OEM key.Thanks for the help.","The point of my question is ….would an existing installation of Windows Live Essentials 2012 be eradicated from any PC, operating on Win8.1, …..once the PC was upgraded to Win10?","Thankyou for the avalanche of information ….it will take me some time to get to it all.I would have an authentic OEM Win 8.0 key. It seems then that I would get the 8 (or 8.0 and then upgrade to 8.1) ….including MovieMaker.The objective was just to get MovieMaker ….and it seems that I would.The question was: Would Moviemaker \"migrate\" or \"travel\" up with the next (paid for) upgrade to Win10?My wife's laptop free upgrade, from 8.1 to Win 10 (back in 2016) did maintain the full functionality of MovieMaker ….therefore I would expect that a repetition of the upgrades, as described above, would likely work.I was just looking for a bit of confirmation prior to buying another older laptop with an authentic 8.0 OEM key.Thanks for the help.I have told you there are no downloads for 8, only for 8.1.And I had to download Windows Essentials myself, when it was available from Microsoft, to use Windows Live Mail.And it is not part of 10 either.","I currently have Windows Live Essentials functioning in Windows 10 ….this was a result of upgrading an 8.1 laptop to Windows 10 during the free period, back when it was offered in 2016.….therefore I know it can work in 10 ….and I understand it is not part of any new Win10 downloads.I am assuming if and when I get the other laptop, with the OEM 8.0 key, that I can get a 8.1 download.I am hoping that this latest 8.1 download will also contain Windows Live Essentials and MovieMaker.Perhaps I may be mistaken that it was included as \"original equipment\" ….or in this case \"included software\" as part of the original OEM 8.1 operating system, in the laptop when we bought it ….it actually may have been download as an \"update\" after our purchase, I don't know for sure.That is what I was trying to determine ….I will go through all the information this evening.Thanks again for the help.Regards","I downloaded Windows Essentials myself on 8.1 and chose to install only Windows Live mail 2012 from it.So there is no Windows Movie Maker, Windows Live Writer already installed, or installed by myself..You can download the Windows Essentials package, not from Microsoft, from elsewhere to 10, but it does not come with 10.","WLM 2012 is not included as part OEM software.8.1 downloads will not contain any part of Windows essentials, as in WLM, or Movie maker.Microsoft won't be including it in a download of 8.1, as it is not supplied by them since 2012 (read my first reply here)","You have clarified many questions and assumptions.There are many other helpful links up top there.Thanks again for your help."]},{"symptom":"Every time I shut down or restart my pc, everything resets to factory settings.        I have windows 10, and very time I restart, everything restarts. While everything is installed, my account info and other various things are not saved. I also can’t open several apps, like mail & the Microsoft store. Any help would be appreciated.","solutions":["Hi, thanks for posting your question in the community! My name is David an independent advisor and I am here to help you.According to what you report, it is possible that you are accessing a temporary Windows profile, to discard this, I would like you to create a new local user profile, you can do it by following the steps of the following linkhttps:\/\/support.microsoft.com\/en-us\/help\/402692... You can also create the profile by following these steps: press the \"Windows\" + \"R\" keys, in the run window type \"netplwiz\" without the quotes, select add, choose the option \"Login without a Microsoft account\", select \"Local account\", fill in the information requested and select finish. Once the user account is created, in the \"user accounts\" window, select the newly created account and select properties, select the group membership tab and select the \"Administrator\" option, select accept and enter the new profile, verify If everything works normally. Let me know the result of the process, if it has been useful or if you still need more help, I will be waiting for your response."]},{"symptom":"error update code 800705B9        Last time I can't update my Windows. All time I have error \"code 800705B9\". What can I do?","solutions":["This is the Microsoft advice:Fix Windows Update issuesWhat does this guided walk-through do?This guided walk-through provides steps to fix problems with Windows Updates, such as taking a long time to scan, or error codes while installing updates.Common error codesThe steps in this guided walk-through should help with all Windows Update errors and other issues. As an example, here are some commonly seen error codes: 0x80073712, 0x800705B4, 0x80004005, 0x8024402F, 0x80070002, 0x80070643, 0x80070003, 0x8024200B, 0x80070422, 0x80070020.How does it work?We’ll walk you through a series of troubleshooting steps to get your Windows up to date. Be sure to follow the steps in order.1. Run the network troubleshooter2. Run the Windows Update troubleshooter3. Rename software distribution backup folders4. Download the most recent Servicing Stack Update (SSU)5. Fix Windows file corruption6. Reset or reinstall Windows@@@@@@@@@@@@@@@@@@@@@@@@@@But after a Reset this poster TwoPuddies  found a way to solve the unable to update problem.https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/updating-win81-after-reset-and-installing-office\/6018eb0e-f9c0-4340-9f9d-20dd8a97bb63?page=2Hey Mr Bill Smithers,Juts to give an update: I didn't actually try to reinstall Windows. Instead I procrastinated for a while then decided to go looking for a solution again that didn't involve reinstalling Windows, prior to giving up and then reinstalling. Ha!I'm not sure how I found it but I found someone else having the same problem with a Lenovo laptop who had found a solution after posting on another forum (I posted here and Lenovo forums). I hope I'm not breaking rules by posting links to external websites (my apologies if I am) but here goes:-https:\/\/www.bleepingcomputer.com\/forums\/t\/635451\/win-81-reinstalled-now-have-problems\/The link says if KB3173424 doesn't solve the problem (this is the KB file the link you posted to the Fix Windows Update issues tells people to download as part of the troubleshooting process) then download the July 2016 rollup which is KB3172614 - which is dependent upon having KB2919355 and KB3021910 installed. The machine I was having trouble with had only KB2919355 installed but I thought I'd try installing KB3173424 anyway, and as soon as it had installed and rebooted the machine I had 227 updates waiting for me. Woo!!!@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Also read how Æþelleo  solved their Windows Update problem after a reinstall:https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/manual-updates-to-make-windows-81-update-service\/4104307f-0277-4cb9-b866-2bf053c60352"]},{"symptom":"Windows 8.1 mail s does not show body of message from only SOME senders.        Email messages from some senders show up in Mail in Windows 8.1 but there is no message body.  The same messages show up OK on other computers.","solutions":["Email messages from some senders show up in Mail in Windows 8.1 but there is no message body.  The same messages show up OK on other computers.Do not reply to that scammer claiming to be from Microsoft Support.They have been banned."]},{"symptom":"Windows 7 Pro upgrade to Windows 8.1 Pro and then use WIndows 8.1 Pro Pack to get WMC        I am currently running Windows 7 Pro on a HTPC and with the deadline on 7 looming, I was wondering if I could purchase an upgrade to Windows 8.1 Pro and then purchase the Windows 8.1 Pro Pack (Windows 8.1 to 8.1 Pro with WMC) in order to get WMC.  So my question is, if I have 8.1 Pro running on my machine, can I then use the 8.1 Pro Pack product key to get WMC?I tried looking for a just the 8.1 WMC Pack for sale, but am unable to locate.  I am able to find the 8.1 Pro Pack for sale, but since I would already have 8.1 Pro (from the upgrade from 7 Pro), I am uncertain if the above scenario would work to get WMC. I know there are other available HTPC\/DVR options, but I have a Ceton PCIe card that works, and if I can squeak a few more years out of WMC, I would like to.  Thank you in advance.Chris","solutions":["Microsoft no longer sells Windows 8.1.And what you are referring to, the 8.1 WMC\/Pro pack, was for upgrading Windows 8.1, not upgrading from 7.WMC is discontinued and not in 10.Windows 8 and 8.1 Pro Pack and Media Pack are no longer available to buyhttps:\/\/support.microsoft.com\/en-us\/help\/3107057\/windows-8-and-8.1-pro-pack-and-media-pack-are-no-longer-available-to-buyAs of October 30, 2015, the Windows 8 and 8.1 Pro Pack (which upgraded Windows 8 Home or 8.1 Home to Windows 8 Pro or 8.1 Pro, with Media Center) and Media Pack (which added Media Center to Windows 8 Pro or 8.1 Pro) are no longer available for purchase from Microsoft. Previously purchased feature pack licenses will still work, and valid feature packs may still be available for purchase from third-party retailers. Support for these products is still available.Cheers.","I know I cannot use the 8.1 WMC\/Pro Pack to upgrade from 7 Pro to 8.1 Pro.  I was planning on first purchasing the 8.1 Pro upgrade from a third-party retailer that still has the 8.1 Pro upgrade in stock.  After installing the 8.1 Pro upgrade, I was hoping to do another \"upgrade\" by using the 8.1 Pack to get WMC.So, to make things a little easier, if I was currently running 8.1 Pro, can I use the 8.1 Pro Pack with WMC (which I already have a copy of) to add WMC?  Can I use the key from my 8.1 Pro Pack to \"upgrade\" my current 8.1 Pro to add WMC?  Or, will Windows tell me when trying to use the 8.1 Pro Pack to \"upgrade\" that it is not available since I am already on 8.1 Pro.In the end, all I want is to add WMC to 8.1 Pro, and I am unable to locate\/purchase\/obtain any separate and legitimate Media Packs.Thanks,Chris","I am currently running Windows 7 Pro on a HTPC and with the deadline on 7 looming, I was wondering if I could purchase an upgrade to Windows 8.1 Pro and then purchase the Windows 8.1 Pro Pack (Windows 8.1 to 8.1 Pro with WMC) in order to get WMC.  So my question is, if I have 8.1 Pro running on my machine, can I then use the 8.1 Pro Pack product key to get WMC?I tried looking for a just the 8.1 WMC Pack for sale, but am unable to locate.  I am able to find the 8.1 Pro Pack for sale, but since I would already have 8.1 Pro (from the upgrade from 7 Pro), I am uncertain if the above scenario would work to get WMC. I know there are other available HTPC\/DVR options, but I have a Ceton PCIe card that works, and if I can squeak a few more years out of WMC, I would like to.  Thank you in advance.Chrisi cant install the windows 8.1 because they said windows 8.1 couldnt installed","I am currently running Windows 7 Pro on a HTPC and with the deadline on 7 looming, I was wondering if I could purchase an upgrade to Windows 8.1 Pro and then purchase the Windows 8.1 Pro Pack (Windows 8.1 to 8.1 Pro with WMC) in order to get WMC.  So my question is, if I have 8.1 Pro running on my machine, can I then use the 8.1 Pro Pack product key to get WMC?I tried looking for a just the 8.1 WMC Pack for sale, but am unable to locate.  I am able to find the 8.1 Pro Pack for sale, but since I would already have 8.1 Pro (from the upgrade from 7 Pro), I am uncertain if the above scenario would work to get WMC. I know there are other available HTPC\/DVR options, but I have a Ceton PCIe card that works, and if I can squeak a few more years out of WMC, I would like to.  Thank you in advance.Chrisi cant install the windows 8.1 because they said windows 8.1 couldnt installedYou start your own thread here; not tack your problem onto someone else's computer problems.These are NOT chat rooms.","I was able to upgrade successfully.I started with Windows 7 Pro.  I purchased the Windows 8 Pro upgrade from a third-party Microsoft partner and installed.  I then did the free upgrade from Windows 8 Pro to Windows 8.1 Pro through Microsoft.After all the updates to Windows 8.1 Pro, I used the Windows 8.1 Pro Pack (purchased from a third-party Microsoft partner) to add Windows Media Center.  This was the part I was unsure about (since I was not 100% sure if I could use Windows 8.1 Pro Pack to add WMC if I already had Windows 8.1 Pro), but it went seamlessly.I successfully kicked the can down the road a few more years so that I can continue using WMC until 1\/10\/2023 when Windows 8.1 reaches its end of life (end of extended support).Thanks,Chris","I was able to upgrade successfully.I started with Windows 7 Pro.  I purchased the Windows 8 Pro upgrade from a third-party Microsoft partner and installed.  I then did the free upgrade from Windows 8 Pro to Windows 8.1 Pro through Microsoft.After all the updates to Windows 8.1 Pro, I used the Windows 8.1 Pro Pack (purchased from a third-party Microsoft partner) to add Windows Media Center.  This was the part I was unsure about (since I was not 100% sure if I could use Windows 8.1 Pro Pack to add WMC if I already had Windows 8.1 Pro), but it went seamlessly.I successfully kicked the can down the road a few more years so that I can continue using WMC until 1\/10\/2023 when Windows 8.1 reaches its end of life (end of extended support).Thanks,ChrisGlad you sorted it out.Cheers."]},{"symptom":"Need help on video quality        When ever I watch videos, during dark scenes, there's these black splotchy-squares that appear with really bad detail. Is there a setting like contrast or something I need to tune to get rid of this? Doesn't do it when I game, just in cut-scenes and videos.","solutions":["Hi a Those dark blotchy squares are they in dark areas of the video? If so, those are pare of the encoding of the film, this generally happens on highly compressed video files like AVi,MP4, MKVThe only way to remove those is to download higher resolution\/quality videos . . .","Hello, I was trying to figure out if it was something wrong with my monitor but yet it doesn't do it all the time so part of me was convinced that it wasn't my monitor. It only does it on some videos. I was watching game-play on YouTube of Cyberpunk 2077 and in each video, it has the dark splotchy areas in dark scenes. I thought it was maybe something to do with the computer it was played on or what.","Hi a Rest assured, this is not caused by your hardware or any fault on your PC The blacks\/dark areas are the most compressed in videos in those file formats to reduce the size of the file, this is particularly true of H265 encoded videos and the better your screen, the more noticeable this is . . .","Thanks, I appreciate the help! Couldn't find anything on the internet that matched my problems so I came here.","This video shows what I'm talking about. Specifically in the corners https:\/\/www.youtube.com\/watch?v=aZprMx2ecU8&t=1505s"]},{"symptom":"Serious, Strange Behavior with PC, its strange behavior to SDD and occasional Driver Issues...        Hello, dear Microsoft. I'm obliged to note you on this crisis. I've been attempting to solve a strange problem that happened after 30 minutes and two days of dealing with it. Issue that appear;The screen saver activates and after another ten minutes on the bootup screen, a different dot like silhouettes appears on the upper center beneath the window loading screen.Once In Desktop the initial updates begin objecting, which are serializable through main Windows Update are automatically sending me toBSoD when The Restart occurs;Furthermore, another problem arises after downloading the driver and performing the recommended express installation at the end of installing the drivers.Two major crises have to do with the event code appearing under gpu-z, amd master, msi burner, device manager. Mainly with the device manager where \"other unknown\" and \"Driver of the Display Adapter\" show yellow exclamation marks with code 43, 41, error.G.SKILL Aegis DDR4 2666 C19 1x16GBGigabyte GP-GSTFS31480GNTD 480GB AMD Ryzen 3 2200G with AMD Radeon Vega 8 (Raven) [ASUS]Asus PRIME A320M-KLog Name:      Microsoft-Windows-Kernel-PnP\/ConfigurationSource:        Microsoft-Windows-Kernel-PnPDate:          1\/10\/2020 4:03:49 PMEvent ID:      410Task Category: NoneLevel:         InformationKeywords:      User:          SYSTEMComputer:      WIN-HAR7VQP1AEADescription:Device PCI\\VEN_1002&DEV_15DD&SUBSYS_876B1043&REV_C8\\4&28505369&0&0041 was started.Driver Name: display.infClass Guid: {4d36e968-e325-11ce-bfc1-08002be10318}Service: BasicDisplayLower Filters: Upper Filters: Event Xml:<Event xmlns=\"http:\/\/schemas.microsoft.com\/win\/2004\/08\/events\/event\">  <System>    <Provider Name=\"Microsoft-Windows-Kernel-PnP\" Guid=\"{9c205a39-1250-487d-abd7-e831c6290539}\" \/>    <EventID>410<\/EventID>    <Version>0<\/Version>    <Level>4<\/Level>    <Task>0<\/Task>    <Opcode>0<\/Opcode>    <Keywords>0x4000000000000000<\/Keywords>    <TimeCreated SystemTime=\"2020-01-10T15:03:49.577992200Z\" \/>    <EventRecordID>763<\/EventRecordID>    <Correlation \/>    <Execution ProcessID=\"4\" ThreadID=\"112\" \/>    <Channel>Microsoft-Windows-Kernel-PnP\/Configuration<\/Channel>    <Computer>WIN-HAR7VQP1AEA<\/Computer>    <Security UserID=\"S-1-5-18\" \/>  <\/System>  <EventData>    <Data Name=\"DeviceInstanceId\">PCI\\VEN_1002&amp;DEV_15DD&amp;SUBSYS_876B1043&amp;REV_C8\\4&amp;28505369&amp;0&amp;0041<\/Data>    <Data Name=\"DriverName\">display.inf<\/Data>    <Data Name=\"ClassGuid\">{4d36e968-e325-11ce-bfc1-08002be10318}<\/Data>    <Data Name=\"ServiceName\">BasicDisplay<\/Data>    <Data Name=\"LowerFilters\">    <\/Data>    <Data Name=\"UpperFilters\">    <\/Data>    <Data Name=\"Problem\">0x0<\/Data>    <Data Name=\"Status\">0x0<\/Data>  <\/EventData><\/Event>Log Name:      Microsoft-Windows-Kernel-PnP\/ConfigurationSource:        Microsoft-Windows-Kernel-PnPDate:          1\/10\/2020 4:03:49 PMEvent ID:      400Task Category: NoneLevel:         InformationKeywords:      User:          SYSTEMComputer:      WIN-HAR7VQP1AEADescription:Device PCI\\VEN_1002&DEV_15DD&SUBSYS_876B1043&REV_C8\\4&28505369&0&0041 was configured.Driver Name: display.infClass Guid: {4d36e968-e325-11ce-bfc1-08002be10318}Driver Date: 06\/21\/2006Driver Version: 10.0.18362.1Driver Provider: MicrosoftDriver Section: MSBDADriver Rank: 0xFB2006Matching Device Id: PCI\\CC_0300Outranked Drivers: Device Updated: falseParent Device: PCI\\VEN_1022&DEV_15DB&SUBSYS_876B1043&REV_00\\3&11583659&0&41Event Xml:<Event xmlns=\"http:\/\/schemas.microsoft.com\/win\/2004\/08\/events\/event\">  <System>    <Provider Name=\"Microsoft-Windows-Kernel-PnP\" Guid=\"{9c205a39-1250-487d-abd7-e831c6290539}\" \/>    <EventID>400<\/EventID>    <Version>0<\/Version>    <Level>4<\/Level>    <Task>0<\/Task>    <Opcode>0<\/Opcode>    <Keywords>0x4000000000000000<\/Keywords>    <TimeCreated SystemTime=\"2020-01-10T15:03:49.535838600Z\" \/>    <EventRecordID>762<\/EventRecordID>    <Correlation \/>    <Execution ProcessID=\"4\" ThreadID=\"112\" \/>    <Channel>Microsoft-Windows-Kernel-PnP\/Configuration<\/Channel>    <Computer>WIN-HAR7VQP1AEA<\/Computer>    <Security UserID=\"S-1-5-18\" \/>  <\/System>  <EventData>    <Data Name=\"DeviceInstanceId\">PCI\\VEN_1002&amp;DEV_15DD&amp;SUBSYS_876B1043&amp;REV_C8\\4&amp;28505369&amp;0&amp;0041<\/Data>    <Data Name=\"DriverName\">display.inf<\/Data>    <Data Name=\"ClassGuid\">{4d36e968-e325-11ce-bfc1-08002be10318}<\/Data>    <Data Name=\"DriverDate\">06\/21\/2006<\/Data>    <Data Name=\"DriverVersion\">10.0.18362.1<\/Data>    <Data Name=\"DriverProvider\">Microsoft<\/Data>    <Data Name=\"DriverInbox\">true<\/Data>    <Data Name=\"DriverSection\">MSBDA<\/Data>    <Data Name=\"DriverRank\">0xfb2006<\/Data>    <Data Name=\"MatchingDeviceId\">PCI\\CC_0300<\/Data>    <Data Name=\"OutrankedDrivers\">    <\/Data>    <Data Name=\"DeviceUpdated\">false<\/Data>    <Data Name=\"Status\">0x0<\/Data>    <Data Name=\"ParentDeviceInstanceId\">PCI\\VEN_1022&amp;DEV_15DB&amp;SUBSYS_876B1043&amp;REV_00\\3&amp;11583659&amp;0&amp;41<\/Data>  <\/EventData><\/Event>Log Name:      Microsoft-Windows-Kernel-PnP\/ConfigurationSource:        Microsoft-Windows-Kernel-PnPDate:          1\/10\/2020 4:03:46 PMEvent ID:      430Task Category: NoneLevel:         InformationKeywords:      User:          SYSTEMComputer:      WIN-HAR7VQP1AEADescription:Device PCI\\VEN_1002&DEV_15DD&SUBSYS_876B1043&REV_C8\\4&28505369&0&0041 requires further installation.Event Xml:<Event xmlns=\"http:\/\/schemas.microsoft.com\/win\/2004\/08\/events\/event\">  <System>    <Provider Name=\"Microsoft-Windows-Kernel-PnP\" Guid=\"{9c205a39-1250-487d-abd7-e831c6290539}\" \/>    <EventID>430<\/EventID>    <Version>0<\/Version>    <Level>4<\/Level>    <Task>0<\/Task>    <Opcode>0<\/Opcode>    <Keywords>0x4000000000000000<\/Keywords>    <TimeCreated SystemTime=\"2020-01-10T15:03:46.044482100Z\" \/>    <EventRecordID>670<\/EventRecordID>    <Correlation \/>    <Execution ProcessID=\"4\" ThreadID=\"124\" \/>    <Channel>Microsoft-Windows-Kernel-PnP\/Configuration<\/Channel>    <Computer>WIN-HAR7VQP1AEA<\/Computer>    <Security UserID=\"S-1-5-18\" \/>  <\/System>  <EventData>    <Data Name=\"DeviceInstanceId\">PCI\\VEN_1002&amp;DEV_15DD&amp;SUBSYS_876B1043&amp;REV_C8\\4&amp;28505369&amp;0&amp;0041<\/Data>  <\/EventData><\/Event>Image of the Issue Code - Link Provided","solutions":["Hello, once again. Today I wanted to post more of the BSoD mini dumps via windgbKMODE_EXCEPTION_NOT_HANDLED (1e)This is a very common bugcheck.  Usually the exception address pinpointsthe driver\/function that caused the problem.  Always note this addressas well as the link date of the driver\/image that contains this address.Arguments:Arg1: ffffffffc000001d, The exception code that was not handledArg2: fffff80042425dd6, The address that the exception occurred atArg3: ffffe70146151140, Parameter 0 of the exceptionArg4: 0000fffff8004242, Parameter 1 of the exceptionDebugging Details:------------------***** Debugger could not find nt in module list, module list might be corrupt, error 0x80070057.KEY_VALUES_STRING: 1PROCESSES_ANALYSIS: 1SERVICE_ANALYSIS: 1STACKHASH_ANALYSIS: 1TIMELINE_ANALYSIS: 1DUMP_CLASS: 1DUMP_QUALIFIER: 400DUMP_TYPE:  2BUGCHECK_P1: ffffffffc000001dBUGCHECK_P2: fffff80042425dd6BUGCHECK_P3: ffffe70146151140BUGCHECK_P4: fffff8004242EXCEPTION_CODE: (NTSTATUS) 0xc000001d - {EXCEPTION}  Illegal Instruction  An attempt was made to execute an illegal instruction.FAULTING_IP: +0fffff800`42425dd6 ??              ???EXCEPTION_PARAMETER1:  ffffe70146151140EXCEPTION_PARAMETER2:  0000fffff8004242BUGCHECK_STR:  0x1E_c000001dCPU_COUNT: 4CPU_MHZ: da5CPU_VENDOR:  AuthenticAMDCPU_FAMILY: 17CPU_MODEL: 11CPU_STEPPING: 0CUSTOMER_CRASH_COUNT:  1CURRENT_IRQL:  0ANALYSIS_SESSION_HOST:  DESKTOP-CN0MD6BANALYSIS_SESSION_TIME:  01-11-2020 22:59:30.0732ANALYSIS_VERSION: 10.0.18362.1 amd64freLAST_CONTROL_TRANSFER:  from fffff800521421d0 to fffff8005214206cFAILED_INSTRUCTION_ADDRESS: +0fffff800`42425dd6 ??              ???STACK_TEXT:  fffff800`47867748 fffff800`521421d0 : 00000000`00000000 00000000`00000000 00000000`00008714 00000000`0000357d : 0xfffff800`5214206cfffff800`47867750 00000000`00000000 : 00000000`00000000 00000000`00008714 00000000`0000357d 00000000`00000000 : 0xfffff800`521421d0SYMBOL_NAME:  ANALYSIS_INCONCLUSIVEFOLLOWUP_NAME:  MachineOwnerMODULE_NAME: Unknown_ModuleIMAGE_NAME:  Unknown_ImageDEBUG_FLR_IMAGE_TIMESTAMP:  0STACK_COMMAND:  .thread ; .cxr ; kbBUCKET_ID:  CORRUPT_MODULELIST_0x1E_c000001dDEFAULT_BUCKET_ID:  CORRUPT_MODULELIST_0x1E_c000001dPRIMARY_PROBLEM_CLASS:  CORRUPT_MODULELIST_0x1E_c000001dFAILURE_BUCKET_ID:  CORRUPT_MODULELIST_0x1E_c000001dTARGET_TIME:  2020-01-11T20:54:04.000ZOSBUILD:  18362OSSERVICEPACK:  0SERVICEPACK_NUMBER: 0OS_REVISION: 0SUITE_MASK:  272PRODUCT_TYPE:  1OSPLATFORM_TYPE:  x64OSNAME:  Windows 10OSEDITION:  Windows 10 WinNt TerminalServer SingleUserTSOS_LOCALE:  USER_LCID:  0OSBUILD_TIMESTAMP:  unknown_dateANALYSIS_SESSION_ELAPSED_TIME:  1eANALYSIS_SOURCE:  KMFAILURE_ID_HASH_STRING:  km:corrupt_modulelist_0x1e_c000001dFAILURE_ID_HASH:  {1317f67f-e01f-874d-b4c9-a3a1ee68b035}Followup:     MachineOwner---------"]},{"symptom":"How to change device name        I got a new laptop and the device name is a cryptic thing I'd like to change to something I immediately understand. How do I do that (Windows 10).","solutions":["Hi NancyCalme to change the device name go to settings -> system -> about under \"Device Specifications\" click \"Rename this PC\" enter the new name and click next"]},{"symptom":"displaying CR3 images        Hi,I upgraded my Canon camera to a new one that takes CR3 raw images. When can I expect Windows 10 to display these files? thanks","solutions":["Hi FrankMH61, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.In a previous discussion thread from last year, a Canon representative confirms that they no longer make codecs to view thumbnails of RAW images in Windows Explorer.https:\/\/answers.microsoft.com\/en-us\/windows\/for...I am sorry to be the bearer of bad news. However, these images will still be viewable using their software, Digital Photo Professional, or other compatible software that open CR3 files.Regards, -Ashton"]},{"symptom":"Network Sharing        Hi all, I would like to share my files via network sharing by giving access to specific colleagues. How does this work? I am not able to find any of my colleagues on my network when I type in their names. If I share my Microsoft Access database via this method, would my colleagues be able to open and edit concurrently and see the latest updates in the database? Thanks! ","solutions":["Hi testest97, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.I think this Microsoft article would be a great read in your situation: https:\/\/support.office.com\/en-us\/article\/ways-t... I would be careful giving multiple users edit access to your Microsoft Access database if it is a single database. There would be concerns about availability and database consistency since people would have the ability to edit data at the same time. The above article describes some different options for making the database sharing more reliable.This webpage has a guide with screenshots that will be helpful for setting up network file sharing:https:\/\/pureinfotech.com\/setup-network-file-sha...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Please note, Homegroups have been removed in the latest version of Windows 10, so the instructions referring to this lower down on the page would not be available. For more information on File sharing over a network in Windows 10, you can view this website, which is also referenced in the first Office link I have provided: https:\/\/support.microsoft.com\/en-ca\/help\/409269... I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","Hi Ashton, The problem is I would like to share the folder only with specific people, and when I try to type in the person's name to add, the names cannot be found. Do you know what the problem might be? Thanks!","Hi testest97, Do those people have user accounts on the PC that you are sharing from? Only existing user accounts on the PC can be selected when you choose to share with specific people.On the other PC, the username and password of the account would have to be entered. If the same username\/password exists on the other PC, they may not be prompted for the credentials.Let us know! Thanks, -Ashton","Hi Ashton,What do you mean by having user accounts on the PC I am sharing from? How would they have accounts on my PC?Thanks!","Hi there, They would need to be local accounts on the PC sharing the file. You can create local accounts by going to Start > Settings > AccountsThen select Family & other users. (In some editions of Windows you'll see Other users.)Select \"Add someone else to this PC\". NOTE: If everyone has a Microsoft account, you can add their Microsoft accounts at this step. If they are not, then you'll want to create a local account by continuing on to:Select \"I don't have this person's sign-in information\", and on the next page, select \"Add a user without a Microsoft account\".Enter a user name, password, password hint or choose security questions, and then select Next.Source: https:\/\/support.microsoft.com\/en-ca\/help\/402692... You would then use the new account when prompted to enter in the username and password on the file share, when using another PC to connect to the PC with the file.-Ashton"]}]}