{"windows":[{"symptom":"Safely Remove Hardware icon        I cannot display Safely Remove icon on my taskbar. It is turned on in Settings\/Select which icons appear - but does not appear. It is not showing in Hidden Icons.??????","solutions":["Hi, What devices do you have connected? Safely remove hardware will only appear when you have a USB device mounted to access it's storage.","Apple iPhone","is the device is accessible in FIle Explorer when connected?","Apple iPhone 7","That doesn't answer the question, are you able to see files on the device when it's connected via usb in file explorer? You may only be able to see photos depending on the iPhone's software version.","Yes (via This PC)","Hi pictureattacher,Open Settings >> Personalization >> Taskbar >> under Notification area >> Click select which icons appear on the taskbar.In the below list, Kindly turned on for the Windows Explorer \"Safely Remove Hardware and Eject Media.Make sure to trust a computerConnect your iPhone, iPad, or iPod touch to your computer or another device.Enter your passcode, if you have one, to unlock your iPhone, iPad, or iPod touch.If you want to allow your computer to access information on your device, select your device in Finder and click Trust, or if you're using iTunes, click Continue.On your iPhone, iPad, or iPod touch, confirm that you allow your computer or other device to access your data. If you don't want to trust the computer or other connected device, tap Don't Trust on your device. If you want to trust your computer, tap Trust.Hope this helps you.Regards,","Thank you for your help.(No need to reply).","Hey PA. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Guardian Moderator here to help you.In Version 1809 they changed Safely Remove to no longer be the default for plugging in USB storage devices (phones never were). In order to change it back see the steps here:https:\/\/www.techspot.com\/news\/79551-windows-10-...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","this did not solve my problem.  I hit yes rather than reply. My device is accessible in File Exlporer"]},{"symptom":"Key sequences autocorrecting to special characters        I have already turned off all autocorrect options in the settings (As far as I know of.) However, certain keyboard shortcuts or character sequences insert special characters. e.g. Ctrl+Shift+M should insert a comment in Google Slides, instead it a types greek letter Mu (it won't allow me to type here) and \"a (typed in sequence, not as a combination) will transform into ä. How can I turn this off? In the settings I turned off SwiftKey suggestions, and that worked for a day, but then it stopped working. I''ve tried turning it on and off repeatedly. ","solutions":["What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK","What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK Windows 10","We know you are in Windows 10.What OS Build are you at?  Like this;","Sorry, is this what you mean?","That is from a different screen but that is the right information."]},{"symptom":"I added a 3rd monitor without a speaker and now cannot hear participants in Teams        I have tried all sound settings and have not found where to disable the monitor without speakers as the output.  Where can I find the setting?","solutions":["Hello Hillary, The tutorial below can help show you how to change the default sound output device to what you had before in Windows 10.https:\/\/www.tenforums.com\/tutorials\/102323-change-default-audio-playback-device-windows-10-a.html","Hello Hillary, Thanks for your question today. My name is Evan an independent adviser here to assist you.What you will want to do is quite easy to follow. First type \"adjust volume\" in your cortana\/windows search bar then click \"adjust volume\" to open a new window. Then click the \"change other sound settings\" link that will be present in this new window.A second window will open up then please click \"Playback\". What you will now do is right-click the monitor you wish to be set as the default sound playback device and then click set as default device and default communications device (unless your communications device is your headset). I hope this helps. If you succeed in fixing the issue please mark this as resolved and a helpful response. If it doesn't I am here to continue to assist. Thank you!"]},{"symptom":"cant install paid vpn app on windows 7 professional        Hello all,Each time i tried to install my VPN app I am getting a prompt message that \"the net framework 4.8 is not supported on this operating system. i have windows 7 professional. my computer i up to date and am getting this same message on my other windows 10 home OS computer also. sigh. please help. thank.Jeves","solutions":["Thanks for replying. I got the issue fixed with their customer care. thank u."]},{"symptom":"The MessagingService_1e2d55f service terminated with the following error:  The device is not ready.        I am searching through my event viewer for errors and warnings. (it is a new computer to me with all recent windows 10 updates)  Some I have found to be normal according to forums.  This error seems to occur every time I log on, when the service tries to load using the programC:\\WINDOWS\\system32\\svchost.exe -k UnistackSvcGroupI do not seem to have any authority to alter this entry, and it is probably just as well as I have no idea what device it is trying to access.I gather that this is not malware, and it is a service which is provided by Microsoft.   I have run windows defender and it has not found any issues on my computer since I have owned it.I do not generally want to use messaging, although perhaps I am using messaging currently.  Can I safely ignore this error?  ","solutions":[]},{"symptom":"Cant use anything        hello,I recently updated my motherboard and kept old hard drive so I was going to activate windows but when I tried to click 'change product key' nothing happened. I thought it was weird so then I tried opening task manager and nothing happened, then device manager and nothing happened, then cmd with administrator and nothing happened. after about a minute I got the errors 'cannot access specific device'... its really bad, I cant even reset my pc and half of my programs work please help thanks.","solutions":["Hello, Mndlebot,1. The key is tied to the original motherboard on the pc. If you did not upgrade\/change the motherboard through the computer manufacturer process, then it is possible you will have to purchase a New Windows 10 key.2. If you purchased a retail copy of Windows 10 from a reputable supplier, i.e. Office Depot, Staples etc.. then the key would have to be uninstalled from the original device in order to be reinstalled on the new device.3. Try these steps. Verify if you are able to activate the key.https:\/\/support.microsoft.com\/en-us\/help\/20530\/windows-10-reactivating-after-hardware-changeRelated Threads:Why I can't activate WindowsActivate Windows 104. You might also try contacting an Activation Specialist by phone. Explain the situation to them and they may or may not be able to help you activate Windows 10.Windows activation: (888) 571-2048Activate using Microsoft Chat Support"]},{"symptom":"Common Meanings Of A Blue Screen Of Death        What Are The Common Meanings Of BSOD Code 0x5C?","solutions":["Hi Aaron That is just a generic code . . . Blue Screens are generally caused by a corrupt or incompatible device driver, and sometimes by incompatible software, rarely, they are caused by a hardware issue . . .If you are getting Blue Screens, check to see if your system is producing minidump files:Open Windows File Explorer Navigate to C:\\Windows\\Minidump Copy any minidump files onto your Desktop, then zip those up Upload the zip file to the Cloud (OneDrive, DropBox . . . etc.), then choose to share those and get a share linkThen post the link here to the zip file, so we can take a look for you . . .","Thanks! Although I Wanted The Meaning For Code 0x5C, Now I Know The Definition Of Blue Screens! Thanks Dave!"]},{"symptom":"Tap to Click        Can't turn off tap to click in Windows 10 on new HP computer...","solutions":["Hi JohnLisk, My name is Riccardo and I'd be happy to help... This is actually a pretty common issue with HP laptops, it seems like it defaults to this...I am guessing this is a laptop?There's a few ways we can fix this: (I am sure you tried some of these) Step 1 - Disable 1. Click Start and then type in: Control Panel > click Control Panel icon 2. Select Classic View from the left side of the window. 3. Double-click the Mouse icon and, then, select the Device settings tab. 4. Click the Settings button and, then, Tapping. 5. Un-select the Enable tapping checkbox and click OK. Step 2 - Try downloading a different version of your Touchpad Drivers Go to support.hp.com Enter the model and name of your product Get the Drivers and download the touchpad driver for this... Let me know if the above assists."]},{"symptom":"my mp4 to mp3 converter        hello for the past serval days my converter has not been working right I go to youtube.com and copy and paste the link and nothing happens is the converter out of date or need an updated version thank you David wright (904) 207 2992 ","solutions":["Hi David Google spend a lot of money to prevent people from downloading YouTube content, they constantly update the security on that website, if your software has stopped working, it is because Google have changed their security measures and that software will need to be updated by the developers Honestly, we cannot help you on this forum to download content form Youtube, it is against the Code of Conduct of this forum . . ."]},{"symptom":"Ark Saved file locations        So I have found a lot of information on the save file locations on Steam downloaded ark but not much on the Microsoft Store downloaded.I currently have a non-dedicated server save that me and one other person have worked on but want to open it up to more without the distance tether. I simply want to take the save file from my non-dedicated work and place it into the files so that when the dedicated server is launched it doesn't start us off from scratch.I would also like, even though it may not be possible, to be able to host the dedicated server while also being able to play on it through the same computer it is being hosted from. The main goal here is to use my computer as a dedicated server to eliminate host tethering while being able to play with my friends. I know they removed the \"tether distance\" setting in game so that you would be forced to either host dedicated or buy a server, so i don't know if i what I'm asking is even possible anymore.","solutions":["Hi GadflyTheMad I'll try to help you on this issue. In order to access the default save location of Windows applications, follow these steps:- Open File Explorer - On the address bar, type C:\\%LocalAppData%\\Packages and press Enter. About your second question, you should reach the Ark forum. Regards","I've retched out there as well but as i mentioned before, most people on the forum are experienced with the Steam file systems.I had already found \"C:\\WpSystem\" file path which seems to be where your LocalAppData packages are creating their shortcuts from.Neither of theses am I able to find two individual saved states indicating non-dedicated or dedicated, which when loaded are two completely different maps and character creations. The closest I've found is \"C:\\Users\\UserName\\AppData\\Local\\Packages\\StudioWildcard.4558480580BB9_1w2mm55455e38\\LocalState\\Saved\\Maps\\SavedArks\"Which shows 3 created '.arkprofile' files indicating that those are the 3 character profiles created by those that logged into the dedicated server.With that being said I am unable to find any evidence of any other character profiles or map generation indicating that it is the files for the non-dedicated sessions.I understand I may be asking the wrong crowd the wrong questions but I am at an impasse on understanding the saves locations without creating quarries of my own.","Well, as I can't test the game myself, I can't try to find it too. Try to reach the customer service of Ark in order to ask if they can show you where the files are on the Windows Store Edition.Another idea, would be to create a new map (or character, or whatever is requiered in the game), then close everything, and search on your whole computer all the files that were created at this exact moment (sort results by time of creation).It may lead you to the correct directory. Jay"]},{"symptom":"Windows Spotlight \"Like what you see?\" option is missing        Like a lot of other threads, my Windows 10 PC (Acer) is correctly showing the Windows Spotlight images on the lock screen but is not showing the \"Like what you see?\" and other informational hot-spot overlays on said image.I have run DISM and SFC, I have tried changing my default browser back to edge (which has Bing as the default search provider)(have since changed this back to chrome), I have tried resetting my network, I have ensured that my systems region and language is English (UK), I have tried enabling and disabling CTRL+ALT+DELETE at sign in , I have tried enabling and disabling PIN sign-in, I have tried changing the background from Spotlight to Picture to Slideshow and back to Spotlight. Nothing seems to make any difference.I have \"Let Cortana respond to \"Hey Cortana\"\" disabled and also \"Let cortana have access to my calendar, email messages and Power BI data when my device is locked\". There are no apps added to my lock screen (not even the default ones).The OS is at version 1709 (build 16299.19), the fall creators update.This used to work - I think the last time I remember it working was before the first creators update, which this PC received around September IIRC. I have a laptop (HP) that is also on FCU for which this works just fine.How can I fix this? Thanks, T.","solutions":["Hey all, I've just finished a session with a really helpful Answer Desk tech agent who's provided a definite fix - I've restarted, locked, shut down, sleep and hibernated my PC - on sign in, the Spotlight function is always there!No need to change the registry, install extra programs etc - it's a simple fix.Here are the steps to follow:In Personalization->Lock Screen settings change Background to Picture. Minimise this windowGo to the following folder, select all files inside that folder, then move them to the Recycle Bin and permanently delete: C:\\Users\\<USERNAME>\\AppData\\Local\\Packages\\Microsoft.Windows.ContentDeliveryManager_<somerandomcharacters>\\SettingsExpand the window with the Personalization->Lock Screen settings. Change Background back to Windows Spotlight.Close all windows - sign out, sign back in again - if the Spotlight \"Like what you see?\" box is there, great! To double check, restart the PC, go through the sign out\/sign in process, sleep and hibernate modes etc - it all worked for me, so I really hope it works for you!"]},{"symptom":"Change language popup        After last update, I see this popup when changing language.How I can turn this off? This is just visual trash that only distracts.","solutions":["Hi SomUser, My name is Riccardo and I'd be happy to assist. Do you have Sticky Keys enabled? This is generally why this shows up...Go to Start > type in Settings > Go to Ease of Access > Click Keyboard on the left sideTurn off Sticky Keys - you can click the Allow the shortcut key to start Sticky Keys (if you enable it by clicking shift 5 times)Let me know if this helps.","\"Use Sticky Key\" is already turned off. And any variation of checkboxes at this section did nothing for my problem.","Does this happen when you change the language from English to Russian? Is that the only time the notification comes up?","Yes, I see it if I change my language. And this popup is displayed if I hold Alt-button ~100 milliseconds or more.But if I press Alt + Shift very quickly, then the language changes without a popup...","I just used Shift + Alt and it doesn't have the popup - can you try that?"]},{"symptom":"Brightness Problem        BrightnessIt doesn't let me change brightness, I tried using action center, and the brightness slider isn't there, I looked everywhere in the control panel and settings, and its not there. Is there anyone who can help me (I'm not on administrator account).","solutions":["Have you gone Settings, System, Display?Also go Settings and type Brightness in the box at the top.","Yes, I did.","Hi, TheJediGamer082, Look at the function keys.Usually F3 is the brightness keyPress the correct function key to determine if you can lower or raise brightness level.Settings > DisplayIs Nightlight On or Off?If Off, turn it OnDo you now see the slider in Action Center?"]},{"symptom":"where do I find pin number vs password login??        where do I find pin number vs password login?","solutions":["Hi William Open the Settings App (gear icon on your Start Menu) Go to Accounts - Sign-In Options On that page, you will find the various login options in Windows 10 . . . .","If you have a PIN already look below the sign-in box.  PIN icon look like a number pad."]},{"symptom":"HP Officejet k5400 printer keeps showing paper jam        I have  a Hp Officejet Pro Printer k5400. It keeps showing a paper jam, I cleaned it and there are no pieces or scraps of paper, I also cleaned the back rollers and still shows a paper jam, although sometimes it works, but next time I turn it on again the same fault. Can the sensor be reset? I'll appreciate some help. Thanks Pedro.* Moved from Community Participation Center* Original title: k5400 printer","solutions":["HP support:https:\/\/support.hp.com\/us-en\/product\/hp-officejet-pro-k5400-printer-series\/2511747\/model\/2511764","No, I have done all the cleaning it shows in the hp videos, but still shows  paper jam (power and resume button blink), I cannot reset the printer. perhaps is something else that requires prof. fixing but since it is an 6 year old machine it would be cheaper to buy a new one. Thank you very much. Pedro","Contact options:https:\/\/support.hp.com\/us-en\/contact-hp\/product\/hp-officejet-pro-k5400-printer-series\/2511747\/model\/2511764"]},{"symptom":"BSOD Machine_Check_Exception 0x9C        Hi thereSo it's the third time I post about this since other topics have been abandonned whitout answer nor resolution.Basicly, since I build this computer, I keep encountering a BSOD with the 0x9C code.  Always the same parameters.Both happens randomlyAlso (but I think the issue is the keyboard) since I have my new keyboard I also encounter a 0x124 WHEA_Uncorrectable_Error BSOD as well.Here is the minidumpsDumps fileWhat have already have been tried:  Memtest and other ram testsUpdate BIOSReset BIOSsfc \/scannow and dismCHKDSKChecking disk status with a tool (all hard drives are healthy) Checking temperatures which never exceeded 64 for CPU and 67 for GPU (And they aren't overclocked)Use verifier (which solved another bluescreen issue by finding a software which was causing it).Reinstall google chromeReinstall GPU drivers (safe mode)Uninstall GeForce Expercience (only) leaving the driversNote that the crashes seems to happen randomly (it can be 10 days without them or can happen 2 days in a row (even 2 times in a day once)).It happened on some websites while web browsing, while gaming (issue 0x124 escpecially but once or twice as well for the 0x9C).Since the module impacted is hal.dll it's bothering to really troubleshoot the issue.If necessary and if it may help I can as well zip MEMORY.DMP file (which is huge of 1.24GB).  Mindump seems to erase after some times which is why I don't have more in the zip file.Thank you verry much in advance for all the help.Best regards.","solutions":["Hi, 0x124 bugcheck indicates that a fatal hardware error has occurred. See details athttps:\/\/docs.microsoft.com\/en-us\/windows-hardwa... Unfortunately hardware errors mostly cannot be diagnosed using dump files Please clean PC and power supply unit from dust. Check system journal (Event Viewer) for possible errors at these moments, especially Kernel-Power errors. DistributedCOM errors should be ignored.","Hi,I've already cleaned the PC (all components including powersupply) from dust (although I forgot to mention it in my first post).  The only Kernel-Power mentions I have are thouse cause of the reboot from the BSOD (or the proper shutdown I initiated \/ reboot whe updates).  Also I've forgot to say that each times the issue happened (either 0x9C and 0x124) I've attempted to check in the event viewer to seen anything helpful, but unfortunately, there is a gap of time when this error happen.  As I said for the 0x124, it started to happen when I've changed my keyboard, so I think for this specific BSOD it's part of the issue.  Ususally this specific error happen when I'm typing (or doing alt+tab with it), screen freeze and then I got the BSOD WHEA_Uncorrectable_Error.  (I could be wrong with my diagnosis, but it would be strange that the error started at this specific moment.)Also it's more the 0x9C error (which in this case happen since the computer was built (which mean end of July 2019).I thank you for your help.Regards","What is your new keyboard? How it is connected? Can you replace it foe test with simples and cheapest one ($5 or so) and remove installed drivers?","It's a g910.  ATM yes I did swaped it for my old g105 keyboard.  For the installed driver, I can but they will install back at the second I'll plug it back since GHUB will detect it right away.I'll tell you if the 0x124 happen with the keyboard.  I'll keep you upddated.","0x124 code may occur because of different hardware\/ Unfortunately modern PCs are extremely complex and check may be done mostly by component replacing. Try to disconnect or disable all devices not needed for booting and base operation.","The is no devices plugged except keyboard and mouse now (and for the keyboard I've plugged back my old G105 logitech keyboard).  I will have to plug back my headphones at some point.  Though the problem does not happen at boot, it does happen randomly during web browsing, playing games.  Actually there is nothing particular that seems to cause the issue (except that I'm typing on the keyboard, which is also part of what induce me to think that it is the G910 which is causing the issue.Anyway as said I'll keep using the g105 for now and if no issue is saw for the 0x124 BSOD, I'll assume this is the cause of this particular bluescreen (even though I don't understand why it's so random).For the 0x9C which is random as well, in the last topic some advisors told it was the GPU, but installing the drivers as suggested didn't work the problem through (even though it was in safe mode.)Problem is, that the issue happening randomly I can't really reproduce the problem at will. (Which is also kind of an issue by itself)In any case, thank you for the assistance you are offering into attempting to resolve the issues.Regards.","Please check system journal (Event Viewer) for Kernel-Power 41 (63) errors. 0x124 and 0x9c sometimes may be the results.","That is in fact what happened every time it entered in BSOD with 0x9C.  Every time there is a Kernel-Power, unexpected reboot to prevent things to go wrong.  Problem is there is not hint of what caused it (no logs before the event itself).The problem occured July the 7 (3 times), the 9 (once), the 10 (twice), the 12, the 14, the 15, the 16 (twice), the 17 (5 times), the 20, the 23, the 27 (twice), 9 august, 10t august, 14 august, 15 august, 21 august (twice), 29 august, 30 august.Until the 17 July the issue was caused by Aorus Engine ( As this link shows )Then the issue seemed to be less frequent.11 September, 16 September (twice), 22 September, 26 September, 29 September, 30 September, 3 October (twice), 9 Octobrer, 16 October, 19 October, 3 November, 10 November, 11 November, 13 November, 21 November, 15 December, 21 December, 26 December and 28 December.Each time at randoms moment.  Wasn't doing exactly the same thing (except for WHEA_Uncorrectable_Error where I was using the keyboard (so for the 0x124).  For the 0x9C it occured randomly when I was on chrome (mostly when I was practicing my driving rules of the road) (I've used Microsoft Edge, Google Chrome and Edge with the same issue) or when I was (recently) gaming (Pathfinder Kingmaker).This link was were an agent diagnosed that the cause was possibly the Graphic Card.  Although updating driver didn't solved the issue.I can't swear or not it's the case, but since the crashes seems to happen so randomly for 0x9C, I don't have a clue where to search.","What exactly sort of Kernel-Power errors do you have? Are they 41 (63)?","Absolutely"]},{"symptom":"windows 10 home addition installation                        I purchased from Microsoft Windows 10 Home\/Pro on a usb  thumb drive a couple years ago however I was never able to get it to install. I now find myself doing a complete fresh install and am determined to use my installation media. I did not plan the installation in advance and did not have updated media creation tool to work with anyway. I am having the same issue as when I attempted to do a fresh install in the past.1  . set up boot to boot from usb first.2.   restart computer with usb drive.3.   do custom install delete all partitions on computer before proceeding to set up 64 bit windows4.   after install completes, I go to the product key where it has all ready automatically been filled in5.   I remove pre filled in key and use the key that came with my product I then get an error code. I feel like I do not have control of my operating system.My services automatically are set to many settings I do not want and some of which I have no control over while some are necessary many are not. I am a one person home user and do not want an endless list of settings I do not feel comfortable windows granting access. Some of which include settings like remote management (enterprise too) several other remote capabilities  even to include remote management of my firewall.When I disable many such services windows update changes them right back. While this is a separate issue,  I want to feel in control of my computer and that starts with my product key.How do I fix this ","solutions":["First don't call the number posted it's a scam.Did you buy a Windows 10 Home licence and have you installed Windows 10 Home. If you type winver in Search and select the top result does it show you have Windows 10 Home installed and which version and build does it show.","Hi Carol, what exactly did you purchase, Windows 10 Home or Windows 10 Pro? There are different boxes for these editions.Did your PC have preinstalled Windows? What version and edition?","yes I have a license I purchased. All part of the box I received.","This computer came with Win 8. I purchased Windows Home addition. However the USB drive itself says Home\/Pro. The box states Windows Home. I assume it installs according to the license purchased. After installation Going directly to Control Panel - System Security  View information about your computer screen Windows Pro is listed with product ID:00180-19251-48724-AAOEM","If I try to change it I get an error code oxc004f050","What really troughs me is after I delete all drives pre install and do not connect  to internet,how can the computer even locate any other installation?","Was your Windows 8.1 Pro Edition? In this case installer will use Pro key in BIOS instead of key you enter.Create in Sources folder of your USB drive file PID.txt with the two-line text: [PID] Value=XXXXX-XXXXX-XXXXX-XXXXX-XXXXX Where XXXXX-XXXXX-XXXXX-XXXXX-XXXXX is your product key. Start installation. It should use your key instead key from BIOS.","If I understand you right , you are telling me to add this file to the windows installation USB stick. So I tried to do that but I get a message telling me I can not write to windows installation USB drive.How can I change the key in the bios?","actually I went from 8.1 to installing a beta version of windows 10 that I downloaded on line about a year after it came out. Is it possible for the downloaded beta version to have changed the key in the bios?I believe every time I try to install my windows, windows just continues to reinstall the beta version over it and I am back where I started.  ","You will be able to check the version and build by typing winver in Search and selecting the top result, what is shown as the version and build.To add the file quoted previously it sounds like you need to create your own USB install media using a 8GB flash drive. Use the Media Creation Tool to create the media.http:\/\/www.microsoft.com\/en-us\/software-download\/windows10however there is every possibility you have already got a licence for Windows 10 Pro and didn't need to buy a Home licence. If you installed Windows 10 Insider Preview on the device then the Windows 8.1 licence was converted to a Windows 10 licence and that's why the install media keeps installing Pro edition without asking.There's no reason (other than you have bought Home) that you can't use this licence."]},{"symptom":"Updates failure        I had ran into a problem where my updates failed and took storage as I tried to update them repeatedly. I know this because, I deleted every app and game. Now I don’t have enough storage to do anything how do I find the updates and delete them?","solutions":["Hi Carlos, I am sorry, you would be amazed how many users with 32GB of internal storage (29.1GB usable) ask the exact same question here on Community each day . . .Honestly, there is only one answer, backup your data and perform a clean install of the 32Bit version of Windows 10 - that will give you more internal storage space - I know this is not the answer you are looking for, but it is the only and best Answer. You will then have enough space for the next year of Windows 10 updates and your system will be faster . ..Any device with a 32 GB SSD is not good enough to run Windows 10, regardless of the system specs put out by Microsoft.I honestly don't know why the manufacturers produced these devices. The Windows 10 folder with a couple of updates will very quickly eat up 20 - 25GB of your hard drive, mine is currently 23GBYou can reinstall Windows 10 at any time and it will not cost you anything, however you will not have enough space to create the bootable Windows 10 media, you will need to do that on another working PCSince you previously had Windows 10 installed and activated on that PC during the installation process skip the steps which ask for a product key and select the option 'I am Reinstalling Windows 10 on this PC', and activation will not be an issue, your PC will have a digital entitlement stored on the Microsoft Activation Servers Make sure you install the same Edition of Windows 10 (Home, Pro . . . etc.) you previously had installed to avoid Activation issuesClick this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), you can create a bootable USB flash drive (min 8GB) using that toolThen, Boot your PC from the Installation Media you just created (change Boot Order in your BIOS) to begin installing Windows 10"]},{"symptom":"what is the DU display update on Dell?        what is the DU display update on Dell?  My computer will not accept it and I have a Dell computer","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,Are you referring to dell's dell update package? Dell has a built in software that detects any outdated drivers or bios update and pushes it to the device.I'd recommend updating the driver through the device manager as there are cases that the software fails to proceed with its driver update1. Hold and press the windows key and the X key and choose the device manager 2. Locate the display adapter category and expand it3. Right click your display driver and choose to update Let me know how it goes. :)"]},{"symptom":"Can't find where I saved my photos.        I can't find where I've saved my photos.  I need several suggestions, since it seems I've tried everything.   Thank you!","solutions":["Hi Tracie. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.How were these photos imported? Did you pay attention to where they were going? It's best to put them in the C:\\User Pictures folder which is already linked to the Photos app so they'll display there too.If they're not there then do any of them have names or tags you can search for? If not then can you import them again and this time pay attention they go into the Pictures folder. If you run the import program you used it should tell you where they were put.Let me know what you find. I will be here to help until this case is resolved.","In File Explorer do you have a D:\\ drive?  If so add a folder to it and name it Photos.  Save your photos there.  Then you will know where they are.","Thank you!","Thank you so much!I will try these and be in touch.  ","I had to get a new PC and that's where I'm lost.  No pictures in folders that I can find.  Have a Happy New Year's eve!","Tracie, how did you transfer these pictures? Easiest is to copy them into OneDrive on the old PC, then sign into OneDrive on the new PC to copy them out of OneDrive folder into your Pictures folder. Or copy them to an External or flash drive (so they're also backed up on site as well), then move it to the new PC and copy them out into the User folders.Here are the many ways to copy or move files: https:\/\/www.pcworld.com\/article\/2086566\/the-man...","Have you already checked Photos? How about the Pictures file? What do you have set as a default for pictures? If you know  the name, photo number or any information about any of the pictures have you searched for them?"]}]}