{"windows":[{"symptom":"\"connect to wireless display\" doesn't work after i upgrade display drivers        The first to 2 pictures before i updated the drivers and next 2 after i have updated the drivers.upgrading display drivers stops showing \"connect to wireless display\" option in projection settings. after updating drivers I am able to project to current device from other device but can't project from current device to other devices as it doesn't show option to connect wireless displays. how to fix this issue?","solutions":[]},{"symptom":"Unable to delete Sharepoint files from an old drive        I recently installed a new SSD in my computer and am keeping myold drive as seconday storage. I do not want to format the old drive as it has a large amount of files that I want to keep.I have a problem with some sharepoint files that I am unable to delete. I am not the owner of the files as they were shared with me and were synced to my old drive. I now have the files sync'd to my new drive and would like to delete them from the old drive.When I try to delete through Windows I get the message \"You require permission from S-1-5-21-918759735-4191655838-884660155-1002 to make changes to this folder\"I am also unable to delete via CMD(admin) or PowerShell(admin).How can I delete these files without formatting the drive?","solutions":["Hello, I'm Didi, an independent advisor. Follow this tutorial to take ownership of the folder that contains the files you want to delete on your old drive :https:\/\/www.howtogeek.com\/301768\/how-to-take-ow... Once you have taken ownership you should be able to delete those files. Regards, Didi --------------- Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Your pc run into a problem and needs to restart stope code: DRIVER PNP WATCHDOG        so, I've been having this issue for a while now. the last error message I got was stope code: DRIVER PNP WATCHDOG                     ^                     | |previous error messages:Your pc device needs to repairfile:\\Boot\\BCDerror code 0xc00000098I created a windows recovery  drive  from Microsoft's website and and I get stop code: DRIVER PNP WATCHDOG all the time. Machine is a  lenovo y50-70 type 80EJ.I've tried rebuilding the BIOS using rebuildbcd  etc...nothing works","solutions":[]},{"symptom":"photo files will not open        my photo files will not open, i can see each folder but i can not open them up, just keep getting system error 805605970","solutions":["Hello, I'm Didi, an independent advisor. To fix the system error with Photos check the methods listed in the following guide, if a method doesn't work try the next one :https:\/\/www.winhelponline.com\/blog\/photos-store... Regards, Didi ------------- Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Bitlocker Password on Removable Media only works on some systems        I have a removable USB Drive that has been encrypted with BitLocker.  However, it only works with some systems.  Other systems, including other Windows 10 systems, reject the password as being incorrect even though I have verified it is the correct password.The drive decrypts as expected on my normal PC and other PCs we have in the building, but only certain PCs reject it, so it is not damaged and does not need a recover key.","solutions":[]},{"symptom":"How to remove Porn emails in junk folder        How can I stop porn sites being sent to my junk mail folder","solutions":["Hello Kyman7, I'm Didi, an independent advisor. To reduce spam emails and porn related spam emails please refer to the answer provided by Alukard on this thread, scroll down to see his answer :https:\/\/answers.microsoft.com\/en-us\/outlook_com... Regards, Didi"]},{"symptom":"add another person on 1 computer        two users on one computer windows 10\/ have separate my documents & files.I have a microsoft office 365 account. Do a new user need to create their  user name, password","solutions":["Hi,Thank you for writing to Microsoft Community ForumsIn order to get clarity and to assist you accordingly, please reply with the answers to the questions below.Did you configure two separate user account on the PC?Do you want to use Office 365 on both the user account?If you want two user accounts on the PC, then refer this article to create two separate user account:Create a local user or administrator account in Windows 10.If you have two separate user accounts and want to install Office 365 on both the user accounts. Yes, then you need to install Office 365 separately on both the accounts and sign in with the same Microsoft account that is associated with Office 365. You can refer this article for further information: Accounts in OfficeRegards,Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"Kindle issue        updated my laptop from windows 7 to 10; now I cannot find my kindle listed as a device in order to update the kindle software. going nuts.","solutions":[]},{"symptom":"Error0xc1900101 while trying to update from WIN 10 1803 to 1903        I've tried to update from version 1803 to 1903 4 times and each time everything seems to go fine until at the end I get a screen saying \"Windows could not configure one or more system components. To install Windows, restart the computer and then restart the installation.\" I've done all of this still get the same message. Windows then has to uninstall everything it has done and settle back at v 1803.Any suggestions would be very welcome.Thanks","solutions":["Hello! I am an Independent Advisor, I would love to help you out! I would suggest going through the guided walk through for fixing windows update errors. It is a great resource that will take you step by step in order to fix any issues with windows update.Here is the link: https:\/\/support.microsoft.com\/en-us\/help\/10164\/... I hope this helps!","ThagstromThanks so much for your reply. I was quite a ways through the \"update fixer\" when a Toshiba technician told me that it is likely that the laptop's drivers are only compatible as far as version 1803. Since there appears to be no chance of Toshiba updating the drivers, I guess 1803 is as much as the machine will handle. Now I'll have to figure out how to suppress all Microsoft updates.Thanks again for your suggestion. I plan to let it run to completion, but don't have much hope for a major update.","That is unfortunate news. Let me know if anything does come of it and I will be glad to try to help.Also, what is the make and model of your computer you are trying to update?","Computer is Toshiba Satellite laptop model P775-S7320 Serial no 9B041270KOn Toshiba's online Windows 10 check list this model is not on the list with those compatible with Win10 v1903. However, on a chat session a Toshiba technician told me that it was compatible, but on a phone session another Toshiba technician told me it probably wasn't because of out-of-date drivers that were unlikely to be replaced.Since the update fixer you recommended did find and correct a few things, I attempted anotherupdate to 1903 . However after 6 hours of downloading and updating I got the same error message I listed originally.Before this latest update attempt Windows Update classified Windows 10 (1803) as \"up-to-date.\" After the failed update attempt it now asking me to update to version 1909. Since 1903 could not be updated successfully I believe trying to update to 1909 (over 1803) would be an exercise in futility, but am interested in your thoughts.I very much appreciate your interest in this problem and am certainly open to any suggestions. However I'm almost ready to bite the bullet and accept the fact that this laptop is only compatible with Windows 10 through version 1803.","I looked at the driver site as well. There is only official support until windows 8.1. Sometimes those drivers will work with Windows 10. However, in many recent windows updates, there has been a need for newer drivers.There is a chance that you could uninstall\/remove all of Toshibas drivers, or do a fresh install of Windows 10 and get the latest windows update, and windows may find compatible drivers automatically. However, this is not a sure thing and if you did this you would be wiping your harddrive. And there is a chance that there is no compatible driver that can be found and the old Toshiba drivers may not work on the newest windows 10 potentially leaving some functionality of your device non-functional.","Thanks ThagstromI forgot to mention that early on I had tried to fix the problem with an ISO file update, but that didn't work either.I think I'll leave well enough alone, disable Windows Update and stick with v1803. At age 89 I hate to give up, but my wife doesn't use the laptop that much anyway. She'll just have to live with 1803.I had the same problem with a fairly new Dell desktop and had to buy another one.Thanks so much for your help.**** SevierJackson, MS","I am sorry no solution was found to move to the newest updates."]},{"symptom":"100% CPU Usage NO REASON AT ALL        I had a Windows 7 Professional and then thought about upgrading to Windows 10 since Windows 7 is coming to end. When I upgraded to Windows 10 i got a random Blue Screen. My PC restarted i opened Task Manager and there it is 100% CPU Usage non-stop. Its really annoying i read the same problem of some guy on this kinda forum, and followed his steps. None of them worked and i'm really annoyed by Windows 10. This never happened on Windows 7 and i'm really hoping there is a way to fix this.My PC:CPU: Intel Core i5 2400 3,10GHzRAM:12GB(4x3)Graphics Card: Nvidia Geforce GTX 1050 Ti 4GB GDDR5HDD:1TBI am waiting for help.","solutions":["Hello, To fix high CPU usage issue, please refer these steps: Try to identify the process creating this issue. Download Process Explorer from Microsoft: https:\/\/docs.microsoft.com\/en-us\/sysinternals\/downloads\/process-explorer Run the tool then select the system process, right-click and select Properties. Switch to the Threads tab. This will show which file is using the excessive CPU usage, from which you can then attempt to diagnose it. Also refer: https:\/\/www.kapilarya.com\/fix-windows-10-high-cpu-usage-problemLet us know if this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP. ","Hi ,Frustrated_694 my name is Dennis, I'm an independent advisor and I'll do my best to help today. here how to solve that problem I hope it helps you https:\/\/www.kapilarya.com\/fix-windows-10-high-c...Regards, Dennis. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Windows 10 Insider Preview 19041.1 (vb_release)stuck at 100% downloading.Do i need to restart my PC to see if it works? Because my CPU IS STILL AT 100%.","restart and tell me if it continues 100%","i can't believe it its still at 100%.","i said its still 100%.","Hi Frustrated, There's a lot of things to consider on your end. Please check the suggestions inside this article for further clarification: https:\/\/www.windowscentral.com\/15-tips-increase...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Why, i done all steps my PC looks awful and still 100%.","Hi Frustrated, You might want to do a Clean boot as well, just to make sure that this is not a software related issue.https:\/\/support.microsoft.com\/en-ph\/help\/929135...Please let me know if this will work. Thanks and regards,","Oh of course to make my PC more NON-USABLE.I just need a normal fix, something simple that helps. I've been sitting here for hours and nothing. Thinking about going to another company who knows."]},{"symptom":"Where in Windows 10 are the scanned files for Windows Fax and Scan App?        I have a Lenovo Windows 10 laptop, connected to a canon.  I see an abbreviation of where the scan went, but it stops at the first two locations (this PC\/Silvi\/ and that's it.  I can't find the scans when I go to Silvi, can not find the scanned docs, etc.  I went to the Photos folders and still can't find em.I Scanned in a bunch of photos.  So, where the heck are they??","solutions":[]},{"symptom":"Windows 7 error \"there are no more endpoints available...\"        On Windows 7, I am receiving the error \"there are no more endpoints available from the endpoint mapper\" when I attempt to format a dvd.  How can I resolve this?","solutions":[]},{"symptom":"window activation        after window 10 update even after writing the product key it is showing 0xc004f074 error. and I can't connect to the organization's server as I am in another state. so, kindly help me in fixing that.","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,Where did you acquite your product key? First, we'd need to identify the state of the current license on your windows 10.1. Open start menu and locate command prompt and run as administrator 2. Execute this command slmgr \/dlv Normally product keys which needs to locate their organization's network are considered a volume license keysThese product keys are mainly used by large companies or organization that is being used by hundreds and thousands of computer on the networkWhat the product key is looking for is the network connection of the company\/organization of where it has been issued from.Unlike a full retail version product key, these are unique product keys that has transfer rights. I'd recommend to considerobtaining a full retail license as these are secured keys for whenever you plan on upgrading your device or plan to transfer your licenseon a different hardware."]},{"symptom":"Computer doesn’t wake from sleep after update        since your latest updates wake\/sleep function wont work. my pc hp desktop 2 years old was ok before. HP tech spent hours trying to sort it .but no joy.both the tabs are ticked in device manager for mouse and keyboard. It will sleep using function and f10, but cant wake it. my pc does not have a sleep button.very frustrating, please help.regardsmike lovell***Modified title from: wake\/sleep function***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand how frustrating it could be when the computer doesn’t work as it is supposed to. I’ll help you with this issue. However, please let us know: May I know the update that was installed recently? To check go to Start >> Settings >> Update & Security >> Windows Update >> View update history.When you say, “both the tabs are ticked in device manager for mouse and keyboard” which tabs are you referring? Which build version of Windows 10 are you using currently? To check type:winver in the search bar on the Taskbar and hitEnter. What is the make and model of the computer? I would suggest you to refer the article on HP PCs - Sleep and Hibernate Issues (Windows 10, 8) and see if that helps. You may also want to run the powercfg command and see which device is configured to wake the computer from sleep. Refer the steps mentioned below: Type command prompt in the search bar on theTaskbar.Right click on the command prompt icon and selectRun as administrator.Now, type: powercfg -devicequery wake_armedThis will return few details, please share the logs with us to help you further. Let us know how it goes.  Regards,Nikhar KhareMicrosoft Community - Moderator","Hello,updates are upto date.the tabs are those in device manager properties.the build,  1909\/18363.535HP 24g099na 3in 1(in command prompt it says device query not recognized.)regards","Win10, all the updates.  I see a similar problem on my Desktop PC.  I have settings of sleep the monitor but never the PC.  Previous to build 1909 flicking the Mouse would immediately wake the monitor, after 1909 that only works some of the time, I have to tap the Keyboard Enter key on these occasions where the Mouse does not do it.  1909 definitely changed the behaviour. ","Hello Nikhar,did you get my reply of december 27th?regards","Hi,Thank you for replying.I'm apologize for the delayed response.I would like to know were you able to perform the steps mentioned in the HP article from my earlier response. If you have not performed the troubleshooting steps, please try the steps and get back to us with the results.Also, I would suggest you to copy paste the powercfg command in Command Prompt and check the results.Let us know how it goes.  Regards,Nikhar KhareMicrosoft Community - Moderator","Hello,tried the hp suggestions and yours but no joy, believe the problem started with the latest feature upgrade.regards"]},{"symptom":"windows 7 activation issue while downloading        I have a valid Windows 7 home premium license key that I had installed on a dell laptop in 2012. Now that laptop is not in use anymore. I bought a new desktop and wanted to install Windows 7 and then upgrade to 10 as I read that free upgrade is still possible.So I went to windows 7 download page and entered the key but got error.https:\/\/www.microsoft.com\/en-in\/software-download\/windows7\"The product key you entered is invalid or not supported by this site\"What needs to be done? Please advise.","solutions":["I have a valid Windows 7 home premium license key that I had installed on a dell laptop in 2012. Now that laptop is not in use anymore. I bought a new desktop and wanted to install Windows 7 and then upgrade to 10 as I read that free upgrade is still possible.So I went to windows 7 download page and entered the key but got error.https:\/\/www.microsoft.com\/en-in\/software-download\/windows7\"The product key you entered is invalid or not supported by this site\"What needs to be done? Please advise.You are missing part of the story going by that error message.What type of license is the Windows 7 license; OEM preinstalled (Dell, HP, etc.), OEM System Builders, or Retail?Microsoft does not supply Windows 7 ISO downloads for OEM preinstalled operating system Product Keys for Dell, HP, etc. machines@@@@@@@@@@@@@@@@@@@@@@@@@@Besides that:If the Laptop\/Computer came with the Windows Operating System preinstalled (Dell, HP, Acer, etc) , that Product Key that came with the Laptop\/Computer is for the preinstalled OEM Licenseand is non-transferable.The OEM License\/Product Key (preinstalled Operating Systems on Dell, HP, etc machines) is tied to the first machine it is installed on and dies when that machine dies.The above rule also applies to OEM System Builders Licenses.Retail Operating System License, that you buy and install yourself, are allowed to be transferred to another machine.But Retail Licenses can also only be installed on one machine at any particular time.",">>What type of license is the Windows 7 license; OEM preinstalled (Dell, HP, etc.), OEM System Builders, or Retail?I purchased the laptop in 2008 and it had Vista preinstalled. Windows 7 home premium was a separate DVD purchase in 2012","Use this instead:This is on a first come, first served monthly basis.https:\/\/www.heidoc.net\/joomla\/technology-science\/microsoft\/67-microsoft-windows-and-office-iso-download-toolDownload: Windows ISO Downloader.exe","Windows 7 Upgrade licences purchased at retail are reusable on any computer.  There is no limit other than you should not install on more than one computer at a time.  Those licences do not expire.You need to find an install disk for the same edition (home, pro, etc) and same bitness (32 or 64).  You can borrow one.  The brand name on the disk does not matter.  It is important that you download all the Win7 drivers for your system before you start.  You can find them at: https:\/\/www.dell.com\/support\/home\/ca\/en\/cadhs1\/.  Enter your Dell service tag.  If Dell does not provide the Win7 drivers for your new desktop, you could be out of luck.  But, it would not surprise me if you discovered that the win7 install process itself provided all the drivers it needs.Be warned:  If you replace the operating system on a Dell computer, you would be violating the terms of the warranty.","You cannot install windows 7 on a brand new computer. The hardware is incompatible. Win 10 should already be installed on the new computer. If you bought a computer without an operating system you have to buy a license.Windows 7 is no longer supported by Microsoft. End of Life is in just a few days--1\/14\/20."]},{"symptom":"telling me that I need to fix my hotmail account (again) when I try to \"fix\" it ...it gives me a blank screen        my Hotmail account is telling me that I need to fix my account.  When I try to do this I am getting a blank screen.","solutions":["Are you receiving this error inside Windows?Since when this problem started?Is there any error code associated with it?Are you using any VPN or Proxy?","Where are you seeing the message? What are you doing when it appears?"]},{"symptom":"ok i have a personal account and a buissness account i set up computer with my personal account but i need to use my bussniess account        this is the error message I get when tring to link the two please help This email is part of a reserved domain. Please enter a different email address.","solutions":["What do you mean by \"trying to link the two\"? In what way are you trying to link the personal and business addresses? What are you doing when you see the error message?"]},{"symptom":"Enabling TLS 1.2 and known issues?        We are currently using Windows Server 2008 R2 and there is a requirement to enable TLS 1.2. These server are mixure of SharePoint, SQL and application. I want to know if i enable TLS 1.2 on these would this cause issues?","solutions":["Hi,Server and IT Pro questions are best handled on our sister Site Technet as this is only a Windows consumer only forum:https:\/\/social.technet.microsoft.com\/ForumsPlease choose the most appropriate category on Technet forums from the left."]},{"symptom":"Mouse jumps top right every few seconds        In the last 3 months the USB Logitech mouse on my  4 year old Chillblast Windows 10 PC (i7, 16Gb) has started jumping (resetting) to the top right of screen at random intervals of 4-15 seconds. Quite often this occurs while I happen to press the left mouse button so in effect clicking on the top right \"x\"causing whatever is open full screen to close and making the PC almost unusable. The resets seem to be far more frequent after a restart. In the last few weeks the mouse seemed to start freezing as well for several seconds multiple times per minute. After not being able to recover previous system images, and having tried several fixes including rebooting in safe mode, Norton virus scans, uninstalling recent updates, installing new mouse drivers, logging in under a new account and various tweaks to the mouse config, nothing seemed to work so I elected to take a back-up and do a hard reset of WIndows 10. As expected all data and apps were wiped and the operating system re-installed from scratch. All went smoothly with no error messages. As expected having cleaned out all the clutter the system now runs much faster and the  mouse freezes have stopped. However the frequent mouse resets continue several time a minute. I tried several different USB mice but they too had the same reset problem.I'm out of ideas on what to try next, maybe replace the USB card or try a wired mouse? Does any one have any practical ideas to solve apart from buying a new PC?","solutions":["Hi, Roland My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps: Press the Start key and type the word CMD or Powershell, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanu p-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/929833...","Hi Jeffrey,Thank you for your help. much appreciated!The 4 commands all ran & completed successfully with no error messages.However the mouse continues to reset to top right every 4-15 seconds.Not sure is its related but I have also been observing, from before I did the Windows hard reset  and continuing after, multiple error events in Event Viewer. They don't seem to relate to the mouse though or related hardware. They are Window Logs\/Application errors such as:Faulting application name: dwm.exe, version: 10.0.18362.387, time stamp: 0x8e064b77Faulting module name: ntdll.dll, version: 10.0.18362.418, time stamp: 0x99ca0526Exception code: 0xc000000dFault offset: 0x000000000010f220Faulting process ID: 0x4bdcFaulting application start time: 0x01d5c0e9e028ff39Faulting application path: C:\\WINDOWS\\System32\\dwm.exeFaulting module path: C:\\WINDOWS\\SYSTEM32\\ntdll.dllReport ID: fdaf2b16-1120-4c95-9bd8-1b3b14da7bb7Faulting package full name: Faulting package-relative application ID: I'm also seeing errors under Custom Views\\Administrative Events such as:Windows cannot unload your registry file. The memory used by the registry has not been freed. This problem is often caused by services running as a user account. Try configuring services to run in either the LocalService or NetworkService account. DETAIL - Access is denied.Several different types of error, too many to list.Any thoughts?Roland","You have updated Windows to the latest version 1909?","I have 1903. I'll update and see how things are...Many thanks.Roland","Glad to Help!","Hi Jeffrey,Just a quick update on this problem having updated to the latest Windows 10. Unfortunately the problem is still there I.e. mouse position resets top right multiple times a minutes, making the PC almost unusable.I have also conducted some further tests, in addition to the Windows 10 hard reset, to eliminate possible causes:I tried a wired mouse instead of wirelss and got the same problem.I remove the mouse and keyboard USB and used just the onscreen keyboard with my touch screen to move around. Amazingly even this configuration resulted in focus being lost from the current cursor position\/window with position of the pointer moving to top right of screen several times a minute.I uninstalled Norton security incase this was causing it. It wasn't.I tried different power models including having all processors fully clocked. Made no difference. Conclusion: Probably motherboard related. Suspect a new PC is required. Any thoughts before I pull the plug?Many thanks,Roland"]},{"symptom":"How can I uninstall the Xbox Game Bar App?  I never use it and it takes up too much storage space.        How can I uninstall the Xbox Game Bar App?  I never use it and it takes up too much storage space.","solutions":["Hi AnnMorrison, I'm Wilfredo S an Independent Advisor When performing these steps the Game Bar will stop appearing when we press the Windows key + G.Right click on the start menu button. We enter \"Settings\" and \"Gaming.\" Select \"Game Bar\". We deactivate the option \"Record game videos, screenshots ...\". I hope it helps you","I want to UNINSTALL it, not just turn the options off.  Why is UNINSTALL greyed out?","I noticed the greyed out \"Uninstall\" button also. :-\/In fact, clicking on the \"Terminate\" button which isn't greyed out is also useless and does nothing.Hopefully someone with some actual knowledge on actually uninstalling it and not just temporarily disabling it will come forward and post a \"how to\" here.","@ the OP....- Where did you find the XBOX Game Bar folder, and how much space does it use ?I wouldn't have thought it uses more than a 100MB or so drive space if it's never been used to record, and if it's disabledit's not using any other resources ( unless I've missed it listed in Task Manager when it's not enabled ).I've never given myself permissions to open the C:\\Program Files\\Windows Apps folder to find how much space it uses though.I assume this is where MS have put Game Bar, and the files in this folder are encrypted so all you can do is view the size of thecontents when you do give yourself permissions to open it. (I have given myself permissions to open another Windows Apps folder which I installed on another HDD when I installeda game demo from the MS Store, but I'm not game to mess with the main folder in C:\\ ).Whatever the case. Game Bar cannot be uninstalled. It was built into Windows by Big Brother MS.There may be a way, but the risk of borking Windows trying to uninstall it wouldn't be worth it just to have it removed from Settings.The shortcut can be removed from the Start menu using commands, but that's it..","Hi BossDweeb,I did not make the comment that it takes up too much space (I think it's only 84 kb, not an issue)...  it just bothers me that if I take automatic updates I can't turn around and uninstall programs I don't want\/need\/wish to have on my laptop.  I agree with you - it's not worth losing sleep over; I was just curious if someone from MS could provide an easy solution.","It could take up 50G and I wouldn’t care, IF i actually wanted it that is.The fact that I neither asked to download it or was asked if I wanted to during an update bothers me a little bit, but what is more concerning is that not only is the “Uninstall” button greyed out (why even offer it?), but clicking on the “Terminate” button does ab-so-lutely nothing.My main gripe however is that I have and older PC (not everyone can afford to upgrade every year or two), and it slows my system to a crawl during boot up, and then I still have to wait for the game bar to pop up before I can close it. Is it still active and running in the background, gobbling up the minimal RAM I have on my dinosaur PC?Not everyone is a gamer, and its beyond presumptuous to force it on users simply to push a product.","There is a lot not like about Win10. Even if disregarding the tedious bi-annual version updates, and the 'apps' that cannot beuninstalled. I could go on for hours (did actually, but realised I was most likely boring people so I've cut most of it out).However, we have to work with, and around what we are given, and if so inclined, post complaints frequently via the Feedback app.I doubt MS respond to less than millions of complaints on a specific issue though (Even before Win10, but they didn't even havea feedback option before).----------------------------------------- Anyway, back on topic....\"and it slows my system to a crawl during boot up, and then I still have to wait for the game bar to pop up before I can close it.\"- Hmm, I wonder why ?  If it's not enabled in the Gaming Settings it should not be launching when you boot into Windows.I certainly never has on my machine. Have a look in Task Manager > Startup tab, and if you see it listed there you can disable it from launching with Windows.While you are there you can disable anything else you know you don't need to load when booting into Windows.If it is somehow running in the background, even when not enabled in either location, you can end the task  bylocating it in Task Manager > Processes. Not a desirable thing to have to do, but sometimes you gotta do....Running DISM may fix a Game Bar always on issue. If not the more extreme measure of doing a Repair reinstall may be the only option.DISM - Repair Windows 10 Image - Windows 10 Forums[EDIT: I was browsing a link given by Greg on another GB thread.- If you have not already uninstalled the XBOX app, try Reset in option #4, or just uninstall the XBOX App.The two features are apparently interconnected.Failing that, check out the part of the article relating to deleting Game Bar keys from the Registry (back them up first as a precaution).This deals with Game Bar corruption, and may help with your Game Bar auto-run issue.https:\/\/www.askvg.com\/fix-game-bar-is-not-opening-or-working-in-windows-10\/- In your case not opening Game Bar after deleting the keys may be the better solution, but if the problems persists even with itturned off in Game Settings, you may need to open Game Bar and rebuild the Registry keys as per the instructions.]- I've never used Game Bar, but assume the uninstall button may not have been removed because MS are working on some otherstrategy [EDIT: maybe linking Game Bar to the XBOX app]. Still strange they would leave an option that only leads to frustration, but MS works in mysterious ways.- Regarding your older PC. Just how old and how much system RAM ? (Not to do with age, but be glad you are not one of the poor souls who bought tablets\\notebooks with criminally small 32GB memory chips.soldered into the machine in lieu of a proper SSD\\HDD.  E-waste at it's finest.  The Windows folder alone hovers around 20+GB. )- Note that while you may see a lot of RAM in use, this may be because Win10 does a better job of using RAM than previous Windows.At idle, my Win10 64bit averages around 2.5+GB with 8GB RAM. Win7 64bit used about 1.5GB w\/ 8GB RAM with pretty much the samethings loading when booting into Windows.Rather than have X GB's of RAM sitting empty Win10 caches more commonly used data than previous Windows, but when a programrequires more RAM, Win10 (should) reallocate more RAM to the program running in the foreground if required.This has caused a fair amount of confusion, even from people with 8GB or more RAM who are accustom to seeing most of their RAM 'free'.If your machine has less than 4GB RAM it may have issues, but only if you are a heavy multi-tasker or run programs such as Photoshopwith large files.Does your machine have an HDD or SSD ? Win10 does seem to favour running from an SSD. I keep a backup of my Win10 on an7200rpm HDD, and booting from the HDD (to verify the cloning process worked properly) is slow as molasses in winter.*He heads off for a cup of coffee*.If your machine is running slowly in general you may want to run Disk Cleanup, if you haven't done so in a long while.Select the Cleanup System Files option for a more thorough job of deleting old update backups and files.----------------------------@Sherry...- Check out the article I linked to in my Edit above.- Unfortunately, no one with any influence at MS headquarters\\development team hangs out at these forums.The feedback app is as good as it gets..","Is this a virus or adware? I never downloaded it nor do I need it. I powered up my notebook today and it popped up as I was surfing the Internet.I am also having a similar problem and am unable to install it.","Thanks for the lecture on how the Xbox Game Bar is not using up that much space. That was not the question though. And we should be able to delete any software we don't want. I'm tired of Microsoft putting things on my computer that I don't want. And it's only going to get worse if we don't complain. ","I have IOBIT Uninstaller (it's free) and it deleted Xbox Game Bar with no problem."]}]}