{"windows":[{"symptom":"Volume bar frozen at 100        The volume bar is frozen on my system and this started to occur following a Windows update. It comes up as soon as the system is turned on. I tried the following although nothing fixed the problem:1. Reinstallation and updation of Audio drivers2. Clean booting the systemPlease help me with this. ","solutions":["Hi Aparna Is this the standard Windows volume bar at the top left of your screen, or is that somewhere else on your screen?Do you use a laptop or a PC with a separate monitor? If you move your mouse to that volume control, does the pointer move in front or behind that Volume Control?","Hi DaveYes, it is the standard Windows volume bar at the top left of the screen.I use a laptop and the pointer hover in front of the volume control, not behind.","Hi Aparna, What is the exact model and manufacturer of your laptop?","Hi RickI have a Dell Inspiron 13-5378 Signature Edition.","Does it let you lower the volume at all or it just stays at 100","It just stays at 100","Even if I try reducing the volume, it reduces and instantly goes back to 100"]},{"symptom":"WiFi repeatedly saying 'No Internet, Secured' every few minutes on two different Windows based laptops since last update (Aug 2019)        Hi All - So, since the latest round of Windows updates (Aug 2019) I have a persisting issue with two laptops doing the exact same error. Periodically, both devises claim in the network settings to be connected to WiFi but has the message 'No Internet, Secured'. A basic manual disconnect \/ reconnect fixes the issue 100% of the time, but is very inconvenient, as it happens again minutes later. This happens so often it is infuriating. Both devises had no such issues before the update, and after trying several fixes the issue has not gone away. NOTE: All none windows based equipment have no such issues.You cant watch a 3-minute video on YouTube without the Network saying 'No Internet, Secured' and having to manually having to disconnect and reconnect to the network. I have tried in 3 different WiFi locations and have the same issue - so it is not our home network doing it. We have 2 PS4's, a Switch, 2 Tablets and 2 Mobiles all on the network and all suffering with no drop out of service. We have paid subscriptions we can not use properly (such as WWE Network, Netflix and Amazon Prime) because of the signal issues since the latest update. 2nd NOTE: This post took ages to successfully upload, as the error just keeps on happening. I had to Copy \/ Paste this dialogue after the page reloaded blank several times. ","solutions":["Hi G.M.Pearson I am Vijay, an Independent Advisor. I am here to work with you on this problem. Try following one by one. Skip a step which you have already tried. A. Run Internet Connections \/ Network Troubleshooters Windows Key+i > Update & Security > Troubleshoot > 1. Click Internet Connections > Run the Troubleshooter 2. Click Network Adapter > Run the Troubleshooter B. Head to following Microsoft Help Link and execute the steps there https:\/\/support.microsoft.com\/en-us\/help\/10741\/...C. Run Built-in & Guided Walk through Windows Update troubleshooter Built-in : Windows Key+X > Click Settings > Click Update & security > Click Troubleshoot > Click Windows Update > Click Run the TroubleshooterGuided Walk though - https:\/\/support.microsoft.com\/en-us\/help\/10164\/... D. As a last resort if nothing works - I would recommend that you perform a Windows 10 repair upgrade. Repair upgrade fixes all Windows errors and retains all files, applications and settings. (You will not lose any data while backup is a good idea) Below is a good guide to perform repair upgrade https:\/\/www.tenforums.com\/tutorials\/16397-repai...Do let me know if you have any more question or require further help. Disclaimer - This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","hi G.M.Pearson My name is Smith and I am an Independent Advisor. I would be happy to help you today.Try to repair your internet connection Restore all network adapters to repair your connection. Open the network and Internet settings in the Configuration application. The quickest way to do this is to right-click or long press the network icon in the notification tray and choose \"Open network and Internet settings\". The network icon looks different if you have an active cable connection or a wireless connection. The menu that opens is the same. Choose open network settings and the Internet. On the left side of the Network and Internet settings window, make sure you are in the Status category. Then, to the right, scroll to the end of the configuration list. There, you should see a link called \"Restart the network.\" Click or tap on it.The Configuration application opens a view called Network Restart, which tells you that \"This will remove and then reinstall all your network adapters, and will set other network components to their original settings. You may need to reinstall other software of networks, such as VPN, client software or virtual switches. If you agree with all that and want to continue restarting your network adapters, click or touch Reset now.Windows 10 asks you to confirm that you want to reset your network adapters. If you do so, click or touch Yes.If you went ahead and chose to reset your network adapters, Windows 10 informs you that your computer or device shuts down in 5 minutes. Close the notification and save whatever you are working on before this timer expires.https:\/\/support.microsoft.com\/en-us\/help\/10741\/...Hope this helps. Keep us posted on the status for further assistance.","I have tried the above fixes on both devices in the last 24hrs and still have the same persisting error.Are there any other fixes you can recommend?","Thank you, however, I have tried this fix and the error still persists.Is there any other fix you can recommend?","There are two other actions which I can recommend. You can try them one by one and check after each.1. Restore from a system restore point to a point when things were working fine https:\/\/support.microsoft.com\/en-us\/help\/12415\/...2. If the issue has been caused due to recent Windows update - I would suggest that you uninstall the latest KB update and hide it so that it doesn't install it automatically and wait for new update to come which will be installed automatically.To know which update got installed Windows Key+i to invoke Settings > Update & Security > Click View installed update history. These KBs should be from the below list. Don't uninstall any other KBFor 1903 - https:\/\/support.microsoft.com\/en-us\/help\/4498140 For 1809 - https:\/\/support.microsoft.com\/en-us\/help\/4464619 For 1803 - https:\/\/support.microsoft.com\/en-us\/help\/4099479 Make note of KB and uninstall and block it. Uninstall Windows Key + R > Type: appwiz.cpl > Enter > Click View installed updates > Select the required updates, right click, uninstall.Block Microsoft has provided a tool Show\/Hide Updates tool to block the update Download the tool from below link http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2...When you run this troubleshooter, it will search for available updates and list themSelect the update which you want to hide. Click Next and follow on-screen directions","Check this link, I hope it helps. http:\/\/techgenix.com\/no-internet-secured-error\/https:\/\/www.thewindowsclub.com\/no-internet-secu...This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thanks, but I have tried all the above fixes and still have the same issue","Thanks, but I have tried all the above fixes and still have the same issue","Same problem here after installing 1903 build.It's pretty much rogered my laptop: - intermittent wifi disconnects. - cpu up\/fan on a lot more - optimus switching problemsGreat update Microsoft!  Not.","Hi All - So, since the latest round of Windows updates (Aug 2019) I have a persisting issue with two laptops doing the exact same error. Periodically, both devises claim in the network settings to be connected to WiFi but has the message 'No Internet, Secured'. A basic manual disconnect \/ reconnect fixes the issue 100% of the time, but is very inconvenient, as it happens again minutes later. This happens so often it is infuriating. Both devises had no such issues before the update, and after trying several fixes the issue has not gone away. NOTE: All none windows based equipment have no such issues.You cant watch a 3-minute video on YouTube without the Network saying 'No Internet, Secured' and having to manually having to disconnect and reconnect to the network. I have tried in 3 different WiFi locations and have the same issue - so it is not our home network doing it. We have 2 PS4's, a Switch, 2 Tablets and 2 Mobiles all on the network and all suffering with no drop out of service. We have paid subscriptions we can not use properly (such as WWE Network, Netflix and Amazon Prime) because of the signal issues since the latest update. 2nd NOTE: This post took ages to successfully upload, as the error just keeps on happening. I had to Copy \/ Paste this dialogue after the page reloaded blank several times. I've been having the same issue, which began when yours did, following the same update. I've done every stupid fix that has been offered on every forum and website, with zero resolution. Come on, Windows. This is ridiculous."]},{"symptom":"I still have Windows Vista on my HP Pavillion Desktop has been running so far but I am having problems now.        After a Re-Image Repair to my system I had to reinstall Norton 360 and Norton Utilities.  After this I got and Unauthorized version of Windows Vista opening on my desktop. i tried to authorize it my re-entering my product code again but I keep getting error message 0x8007000D.  I can't upgrade to Windows 10 my system won't support it.  Right now my windows seems to be running OK. I know I need to buy a new computer but I just can't afford one right now.  Do you have any suggestions on how I can correct this problem?Janie","solutions":["You used a System Image Backup you made previously to reinstall the operating system?And now it won't activate correctly?","No I tried that and my computer crashes or I get an error message that it cannot restore. I thought maybe that was the reason it wouldn't restore.  I don't want to do a complete recover because I have a lot of files I will lose. As long as it is working I don't want to make things worse.Janie","No I tried that and my computer crashes or I get an error message that it cannot restore. I thought maybe that was the reason it wouldn't restore.  I don't want to do a complete recover because I have a lot of files I will lose. As long as it is working I don't want to make things worse.JanieI still have no idea what you mean by: After a Re-Image Repair to my system.You say you couldn't do that?For Activation problems:The COA sticker, which has the Product Key on it, is either on the underside of the Laptop or in the Battery Compartment.With a Desktop it is either on the side, rear or top of the Computer Case.If you have to use phone activation:\"How to Activate Vista Normally and by Phone Activation\"http:\/\/www.vistax64.com\/tutorials\/84488-activate-vista-phone.htmlMicrosoft is the one who says yay or nay for Activation.You have to go through them, but lately a lot of posters have been referred back to here by them when using phone activation.If that happens use this method of contacting Microsoft: Contact support         http:\/\/windows.microsoft.com\/en-us\/windows\/contact-supportAlso: https:\/\/partner.support.services.microsoft.com\/en-au\/contact\/menu\/software\/windows\/setup\/Cheers.","After a Re-Image Repair to my system I had to reinstall Norton 360 and Norton Utilities.  After this I got and Unauthorized version of Windows Vista opening on my desktop. i tried to authorize it my re-entering my product code again but I keep getting error message 0x8007000D....Hi JanieDeVaul:What is your computer make\/model, does your system information (Control Panel | System and Maintenance | System) show that you currently have VistaService Pack 2 installed as shown below, does your IE9 browser have Update versions 9.0.60 \/ KB4014661 as shown below (launch your IE browser and go to Help | About Internet Explorer) and what is thefull name and version of your Norton product?  You said you have Norton 360, but is that Norton 360 Premium v22.15.2.22 (i.e., the legacy version for Win XP\/Vista released in April 2019 with 25 GB of backup storage) or the \"standard\" Norton 360 (with 2 GB of backup storage)?Like Bill Smithers, I'm not sure what you mean by \"re-image repair\".  Do you mean that you had a problem booting up your Vista OS and tried to perform asystem restore or startup repair from the Windows Recovery Environment as described in the BleepingComputer tutorialUsing System Restore from the Vista Windows Recovery Environment?If that isn't correct, do you mean that you used the built-in Windows System Restore and restored your programs and Windows system files and registry to a previous date using a saved system restore point (see the BleepingComputer tutorialsWindows Vista System Restore Guide), did you perform a factory reset that reset your computer back several years to factory condition (which sounds unlikely if you still have most or all of your personal documents and user files), or did you use disk imaging software like Macrium Reflect, Acronis True Image, etc. to re-image your entire hard drive using a full disk image (an image file with an exact copy of your entire hard drive).Norton always recommends that users turn off Norton Product Tamper Protection before running any type of system restore - see the Norton support articleFix System Restore Problems with Norton Installed, which states that Norton's self-protection feature \"can prevent Windows System Restore from changing Norton files, which results in the 'Restoration Incomplete' message\".  Do you recall if you turned off Norton Product Tamper Protection before running your system restore?  If your system restore aborted before it ran to completion that might be the cause of your error 0x8007000D message.-----------32-bit Vista Home Premium SP2 * Firefox ESR v52.9.0 * Norton Security Deluxe v22.15.2.22HP Pavilion dv6835ca, Intel Core2Duo T5550 @ 1.83 GHz, 3 GB RAM, NVIDIA GeForce 8400M GS","I have Windows Vista Home Premium 64 bitCopyright 2007Service Pack 2 Processor:  Intel (R) Pentium (R)CPU E2220 @ 2.40 GHzMemory (RAM) 8.00 GHB 64 bit OSThe repair program I used was Reimage Repair published by Reimage Support Link http:\/\/www,reimageplusProduct version  22.15.2.22I don't use Internet Explorer I could not get version 9 to work on my computer so I changed to:Mozilla Firefox 52.9.0 ESR (x86 en US) Published by MozillaI think my Computer is a Pavillion 720  I have not been able to find paper work  on it just yet.I did try  to activate with Norton Programs turned off. I still get the same error message. I tried the System Restore not System Recovery, in Recovery you lose your files and I have too may important files to do that.  As long as I have a version of Windows that works I am not that desperate.  I think I am going to try Symantec see if they can help me, I was re-installing their program when this happened.  But if you have any ideas let me know.Janie","After a Re-Image Repair to my system I had to reinstall Norton 360 and Norton Utilities.  After this I got andUnauthorized version of Windows Vista opening on my desktop. i tried to authorize it my re-entering my product code again but I keep getting error message 0x8007000D ..Right now my windows seems to be running OK......The repair program I used was Reimage Repair published by Reimage...Hi JanieDeVaul:I've never used the Reimage Repair system optimizer but I occasionally run a manual Threat Scan withMalwarebytes Free v3.5.1 (the legacy v3.5.1 installer for Win XP \/ Vista is available <here>) to look for any malware or potentially unwanted programs (PUPs) that might have been missed by my Norton real-time protection.  According to Metallica's post athttps:\/\/forums.malwarebytes.com\/topic\/194200-removal-instructions-for-reimage-repair\/Malwarebytes detects Reimage Repair as a potential threat (PUP.Optional.Reimage) and advises against use of this utility.You said in your original post that \"Right now my windows seems to be running OK\" so I'm still not clear why you would need to reactivate your operating system using your Windows product key.  Are you still seeing a pop-up stating you are using an unauthorized version of Windows at boot-up, and if so are you able to capture an image and post it in your next reply?Regardless, it sounds like you need to reinstall Norton 360 (Premium???) v22.15.2.22 to fix the damage done by the Reimage Repair utility.  I've performed a clean re-install of my Norton Security Deluxe (see the instructions I posted <here> in the Norton forum as user lmacri,, and note the warning about Norton Utilities) but if you want to perform a clean reinstall you would need tocontact Norton Customer Support via Live Chat at https:\/\/www.norton.com\/chat and ask them for the download link for the latest full offline installer for the legacy version of your N360 product (I only have the download links for my own legacy version of Norton Security Deluxe that I posted <here>).  If that sounds like too much work just ask Norton Customer Support to connect to your computer via remote access and have them perform a clean reinstall for you - just be sure to mention you have a Vista SP2 OS and need to reinstall the older legacy v22.15.2.22 of your N360 product.You might also want to read my 14-Nov-2019 post in HenrySeldon's thread BSOD When Clicking On Right Top \"X\" Close Button about a known issue with Windows Update that affects Vista SP2.  I only wanted to know if you haveIE9 v9.0.60 \/ KB4014661 (Cumulative Security Update for Internet Explorer 9: April 11, 2017) since that would tell me if you are patched to end of support in April 2017.  If you have an earlier IE9 version then you are likely affected by this Windows Update problem and it could causeunexpected glitches and errors on your system.If your Vista SP2 OS is fully patched to the April 2017 end of extended support and a manual Windows Update (Windows Update | Check for Updates) runs to completion in 5 or 10 minutes and does not find any available updates then it's always possible that Reimage Repair damaged your system files.  It might be worthwhile to run Vista's built-in System File Checker (sfc \/scannow) from an elevated command prompt to see if it can detect and repair any damaged or missing files.  Instructions are posted in BeerMonsterKiwi's thread Vista - Startup Repair Cannot Repair This Computer Automatically - after the scan is finished it should report \"Windows Resource Protection did not find any integrity violations\" as shown below if your system files are not damaged.-----------32-bit Vista Home Premium SP2 * Firefox ESR v52.9.0 * Norton Security Deluxe v22.15.2.22HP Pavilion dv6835ca, Intel Core2Duo T5550 @ 1.83 GHz, 3 GB RAM, NVIDIA GeForce 8400M GS","Reimage Repair is not recommended by this Community.References promoting it are deleted.","Hi JanieDeVaul:Further to your 0x8007000D error code, the article 5 Ways to Fix Windows Update Error 0x8007000d states:\"The Error Code 0x8007000d appears when either you try to download and install updates or when activating Windows OS or MS Office product. This error also known as activation failure error and appears when your product activation files could not be found.Apart from it, this error occurs due to corrupted or damaged protected system files like dll file, exe file, sys file etc. Most of the updates or installation file relies on various types of system files and if when these files gets damaged or replaced by another program then you may start experiencing different types of error including 0x8007000d.\"This error code is often associated with a Windows Update failure, but the askvg.com articleList of Common Problems in Activating Windows Vista notes that if you are trying to install Windows Vista on a computer system and see an \"error 0x8007000D: Unable to open the license\" during activation then \"This error code occurs when you use 'Windows Anytime Upgrade' (WAU) feature and indicates that theinitial download may have been corrupted. Try to download the setup package again.\"Is there anything in particular you're doing when you see this error code?  For example, are you running Windows Update, trying to reinstall Vista from a Windows Vista installation DVD or launching the old Upgrade Advisor on your Vista machine (e.g., Start | All Programs | Extras and Upgrades | Windows Anytime Upgrade)?  Please note that the free upgrade offer from Vista to Win 7 expired several years ago on 31-Jan-2010 and there isno free upgrade path from Vista SP2 to either Win 7 SP1 (which is reaching end of support soon on 14-Jan-2020), Win 8.1 or Win 10.  Assuming your current hardware could even support a newer OS, you would still have to purchase a license key to complete the upgrade.If the Reimage Repair utility corrupted some system files it's possible that Vista's System File Checker (sfc \/scannow) will be able to fix the damage, but I wouldn't recommend that you use any third-party repair tools or try other fixes until we understand what you're doing that generates this 0x8007000D error in the first place.-----------32-bit Vista Home Premium SP2 * Firefox ESR v52.9.0 * Norton Security Deluxe v22.15.2.22HP Pavilion dv6835ca, Intel Core2Duo T5550 @ 1.83 GHz, 3 GB RAM, NVIDIA GeForce 8400M GS","Basically anyone posting links in posts to reimage repair is banned in this Community.You put a hyphen in it, that's why my question. After this I got and Unauthorized version of Windows Vista opening on my desktop. i tried to authorize it my re-entering my product code again but I keep getting error message 0x8007000DYour question was about Windows Activation, not Windows updates.Did you follow any of my advice about trying to solve your Windows Activation problem?","Yes I tried all of them nothing worked. I am sorry it if put a link in the posting, I did not mean to.Janie DeVaul"]},{"symptom":"Bitlocker recovery of a partition broken disk        SO I Had a big 3 TB disk, I used one partition with bitlocker GPT, another that's 200 GB with Linux ubuntu on it and one with 9 GB for linux system required partition. I wanted to remove the linux. I used AOMEI assistant to delete linux partitions, but I did it without deleting contents of partition option (probably the problem), then the windows disk partitioner showed 200 GB of unallocated space, I then extended the bitlocker partition to the unallocated space using windows partitioner, then everything broke and stopped working, the bitlocker recovery key, password, nothing unlocks the disk.My guess is that the windows partitioner didn't clear data that was in unallocated space, so it added alot of random data to bitlocker partiton, the random data doesn't have metadata, so it doesn't unlock right? That's my theory. How do I recover my data, it's still there, how do I get to it.","solutions":["Hello ErikVukašinović, I am Andrew an independent advisor. Are you saying you lost the recovery key or that the drive with all your data cannot be read?It always a bad idea to move around partition sizes with data on the drive, especially extending the partition. It's possible the drive you extended still had data on it if you just deleted the partition, that really only deletes the first bits of data telling the computer how big it is and where on the discs it lays. You very well could have added all the old data to the existing data, thus making the existing data harder to find and scrambled.You can TRY moving the encrypted data to an external drive and unlock it from there.","Hello ErikVukašinović, I am Andrew an independent advisor. Are you saying you lost the recovery key or that the drive with all your data cannot be read?It always a bad idea to move around partition sizes with data on the drive, especially extending the partition. It's possible the drive you extended still had data on it if you just deleted the partition, that really only deletes the first bits of data telling the computer how big it is and where on the discs it lays. You very well could have added all the old data to the existing data, thus making the existing data harder to find and scrambled.You can TRY moving the encrypted data to an external drive and unlock it from there.Let me rephrase what I didSo I had one bitlcoker partition and 2 irrelevant partitions.I used a software to delete the 2 irrelevant partitions, which had linux on them, but chose the option to just delete partitions without deleting their contents.Then I used windows partition manager to extend the bitlocker partition into the space in which were part of the previous deleted partitions.Immedeately after doing this, my bitlocker partition got locked out, it's name suddenly disappeared, windows recognised it as locked and when I tried using the correct password and the correct recovery key to unlock the bitlocker partition it reported that the password is incorrect and the key is also incorrect. I cannot see the name of the drive neither can I get to the data, despite the fact I used the correct key and password to try and unlock it. Since I extended the partition using windows own partition manager, and I did that before with other partitions with no problems, something is seriously wrong. BTW the linux partitions used ext4. Since the data should still be on the drive how do I get it back? How do I transfer it to another disk if I can't read it?"]},{"symptom":"Windows 10 white blank icons everywehre        First of all, i tried every internet posted solution to restore icons by clearing icon cache and running countless command prompts.Nothing helped.I dont want to run update. I like my computer working please. Update your self, see how you like it.I am including a screenshot of Devices and Printers, Pictures, and some scripts.Icons are blank for random locations, not on the desktop. Desktop icons are fine. Its the icons that are in folders on my other drives.When i was uploading this picture, it was also white blank, but on my desktop this picture actually does have a correct preview thumbnail.Is there a solution ?","solutions":["What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK","Hi tonycst and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.1. Have you tried running basic troubleshooting commands like SFC and DISM? You may try following these steps. Check this article for detailed instructions. https:\/\/support.microsoft.com\/en-ph\/help\/929833...2. If this not works. Repair Windows 10 Using In-Place Upgrade. https:\/\/www.kapilarya.com\/how-to-repair-windows...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","1909 18363.418When i zoom in and out (making icons smaller or larger) they display correctly but turn white\/blank when they turn from icons to thumbnails size.On the other hand, with pictures its different. Once i zoomed out to icon size, picture thumbnails updated and worked fine even when made large.As of right now, problem seems to have resolved its self in some areas but not in all. I still get no proper icon in folders where i have scripts but pictures and devices and printers are now ok.","Restoring health does not help.Reinstalling\/Updating OS is not an option.","Hi tonycst, I am Andrew. What steps have you taken so far? I am confident running these scripts and updating windows to its latest version will help. Please follow these scripts, let us know if all was fixed.In the search bar, type cmd. Right-click on cmd.exe and select Run as Administrator. Type SFC \/scannow and press the Enter key. Re-enter Command Prompt as Administrator and run these: dism.exe \/online \/cleanup-image \/startcomponentcleanup dism.exe \/online \/cleanup-image \/scanhealth dism.exe \/online \/cleanup-image \/restorehealth Take care, Andrew"]},{"symptom":"Windows 10 network delay and timeout        I'm having a rather interesting problem across every device in my home running Windows 10. I try and go to a website, any website on any browser on any of the computers, and theres a high chance it times out. However, if I use the \"troubleshoot network\" option on the task bar, as if by magic, the websites load, even on other computers.Ex. I used my laptop to go to youtube, and as it was having a hard item loading, i used my main PCs option of \"troubleshoot network\" and the site loaded on the laptop.Ive replaced literally every part of my home network in an attempt to rectify the situation. My isp ran a new fiber line on the road ( last reseort, cost a pretty penny), a new copper line to my home, upgraded my NID, new inwire, and a brand new wall jack and modem. My network goes as followsModem-> network gigabit switch -> Xbox, computer, Magic jack, Apple air port, and Netgear wifi router. Over Wifi is my laptop, a few phones, 2 tablets, and other wifi enabled devices in my home.Apple airport is used for a mesh network setup for a few access points (block house so running hard line is a pain)Laptop is brand new as of 2018, and my tower pc has a new motherboard.Gigabit switch is only about 4 years old, and ive used several others to see if it was the problem, but the problem remained.So since i've LITERALLY reparteed every part of my network i'm at a total loss.My question is, anyone ever have this issue? what was the solution you found?","solutions":["Have you gone into Device Manager, Network, Wi-Fi adapter, Power management and cleared the check before \"Allow the computer to turn off this device to save power\"","That would be a solution, on my laptop. My main PC however does not have that option. As i said, its across every windows 10 device in my home. Main pc, laptops, and my shop computers. I've done that now, ill post again the result.","Problem still present, thanks for the idea though.","Hi Johnny My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.You have done a of isolation of the problem. Disable Energy Efficient Ethernet in \"Client for Microsoft Networks\" Press Windows key + X Click Device Manager, expand Network Adapters, right-click the adapter > Properties > Power Management, and then clear the Allow the computer to turn off this device to save power check box.If you don't have that option, see other ways to disable it: https:\/\/blogs.technet.microsoft.com\/exchange\/20...If the network connection is slow or lagging, check if Windows 10 is downloading Windows Update or the Microsoft Store is downloading updates. These can sometimes affect the performance your network connection.If you have a VPN enabled, disable it. Try resetting your firewall: Press Windows key + X Click Command Prompt (Admin) Type the following commands, pressing Enter after each command: netsh int ip reset reset.txt netsh winsock reset netsh advfirewall reset Try adding the Google Public DNS to your router then see if you can successfully browse the site:Google: Add Public DNS to Your Home Router - groovyPost https:\/\/www.groovypost.com\/howto\/google-add-pub...Last, I would consider contacting your ISP to check on your Internet connection so they check if its an issue with the connection to your house.","I've disabled the power management as suggested by the first person who responded, on both nearby computers. Your solution may work, but they seem to be focused on it being \"PC side\" of the problem. As i stated in the Topic, its across every Windows 10 device in my home. My \"troubleshoot network\" trick works, even for another PC.\"Ex. I used my laptop to go to youtube, and as it was having a hard item loading, i used my main PCs option of \"troubleshoot network\" and the site loaded on the laptop.\"I should mention that i get the \"website cannot be reached\" or \"website has timed out\" error. As soon as i use the TN option, problem fixed for an undetermined amount of time.The only other possible thing it could be is maybe a bad wire somewhere, however if that was the case, every device on every OS would have the issue, but its only W10.","Which version of Windows 10 do you have on each affected device?","All my computers are on the latest release.","The latest release of what version?What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK","Sorry for not getting back to this post here, Ive tried more things. Last night I updated Windows to the newest version so i could run Game Pass, and in that process my network problem seems to have been resolved.I had called Microsoft about this, and they insisted it was something on my network, when now the evidence points to Microsoft being at fault.Guess my next PC will be running Linux, or i'll be getting a Mac.","I'm seeing something similar on a laptop.It seems to be specific to each program accessing the network. For example, I'll open Chrome and start browsing. Initially the sites in Chrome will time out for about 45-60 seconds, then start working.Then, with Chrome working fine, I'll open Internet Explorer and get the same timeout issue for 45-60 seconds in IE. IE then works fine.I get the same timeout problem with Remote Desktop as well - 45-60 seconds before I can reach the remote computer. After that, no problem.So it doesn't matter that other processes are accessing the network just fine at that very moment. Every new process takes 45-60 seconds to get network access.The behavior isn't just happening to new processes. If a process has not accessed the network in a while, it will experience the timeouts again after being idle.I ran Wireshark to see what is happening in that initial timeout period. I see nothing going outbound to the target server in that time.I tried going to internal sites to eliminate firewall issues, and I tried entering IP addresses to eliminate DNS issues. No change.There is no proxy. All connections (WiFi, LAN, docking station LAN) get this issue. I see it on home and office networks as well. I tried Safe Mode with Networking. It happens that way, too."]},{"symptom":"Conflict & Delete folder for DFS (DfsrPrivate\\ConflictandDeleted)        Continuously DFS is giving issue for one link, every time data are not getting in sync for one folder other folder data working fine.Whenever we see such issue DFS conflict & Delete folder is start storing those files in there, i understand that this is the MS feature which help to not loose conflict data but ideally there is no conflict but this is keep on happening.Please suggest, thanks in advance.Kumar","solutions":[]},{"symptom":"Unwanted newline printing in command prompt        I have recently been facing this issue in the command prompt: after executing every command, an unwanted newline is printed on the command prompt. Is it possible to return to the earlier format where the lines are consecutive, instead of having an empty line between each command? I know it does not affect the usability in any way, but it would be great if this can be reverted.","solutions":["Hi Lonare The only thing that may resolve this for you is, right click the Command Prompt window header and choose PropertiesTick the box for Legacy Console and apply that, then restart Command Prompt However, that will reduce the size of the extra carriage return, but not eliminate it altogether . . ."]},{"symptom":"Personal Vault - How to change verification from code to PIN ?        Currently I am using a code sent to me by mail to unlock  the Personal Vault.In fact, I need to unlock it twice.1st: r-click on OneDrive icon in the taskbar and select Unlock Personal Vault(code is being sent)2nd: r-click on OneDrive icon in the taskbar, select view online, enter my user-id and password, then within OneDrive, the personal vault shows as locked, r-click on it select Unlock (code is sent)2x a code and 1x user-id + pw.On Internet I read about the option to use PIN to unlock the Personal Vault.Q: How can I change from code to PIN ?Thanks!","solutions":["Hi Mike, thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.Two-step verification is required to gain access to Personal Vault. On OneDrive Mobile App, you will be able to setup Personal Vault PIN to gain access to Personal Vault.On Desktop or Browser, the verification is by Text, Email or Microsoft Authenticator App depending on the two-step verification method you have configured for your Microsoft Account.I would sugggest setting up Microsoft Authenticator App so you can unlock your Personal Vault with lesser steps while on Desktop or Browser - Unlock Personal Vault > Send Notification > Approve on Microsoft Authenticator App. If you would like to update your Two-step verification method, please refer to this article: https:\/\/support.microsoft.com\/help\/12408 If you like to know more about Personal Vault, please refer to this article: https:\/\/support.office.com\/en-us\/article\/protec... Please let me know if I can help you further!","Thank you very much for taking the time for this elaborate reply. Probably you won't believe it...But ..eh .. I don't have a smartphone.Uncomfortable feeling having to confess this: it seems a smartphone is a 'must' nowadays.Am considering buying one some day.Am using Windows on desktop only and on laptop. The laptop is new and has a clean Windows 10 x64 Pro installed only, nothing else yet. So 'using' is somewhat exaggerated.  :-)Anyway, that aside, whilst using a PC and not having a smartphone, it the above log in procedure seems to the only way. Thanks again.","I see. You aren't the only one I've known without a smartphone either. It's a personal choice and should be respected!You're welcome!","Just for fun, I made screenshots of the steps to be taken to unlock Personal Vault (PC and online) in the classic (non-smartphone) way  :-)Not really a one-click thing, ha.","Hello, my name is Arif Ahmed, Windows Advisor. Thank you for sharing the Screenshots Mike."]},{"symptom":"Printer won't work.  HPOfficejet 6600        My inks will not move forward when I open the door on printer.  It always has before.  Printer will not work. All cables and and things are hooked up","solutions":["Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.I would like to ask if you are trying to replace the ink for your printer? http:\/\/youtu.be\/iMRibyeS4nAThe printer is powered on and cartridges does not slide out after you have opened the ink cartridge access door.If so you may have a hardware issue and the best way moving forward is to contact HP.Let me know if you need further assistance! Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Windows 10 installation loop        Im trying to do a clean installation of windows 10. When it has done the installation and reboots after 10 seconds it puts me back at the start of the installation ( where you choose language, currency etc). I have tried taking out the usb before it reboots but then i just get forced into bios. Is there some solution?","solutions":["Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.First, I want to set an expectation that this could be a long back and forth. Next, these are some questions about your installation. 1. Before Installation reboots, what screen did you see? 2. Is your installation media USB Drive? How did you create the it? Media Creation Tool?3. Was the installation media created on the same machine before you start this process?4. What's your computer's brand and mode? 5. Are you still able to boot into Windows without the installation? 6. If you were to follow this post, is there any difference? https:\/\/www.tenforums.com\/installation-upgrade\/... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","1. Just the normal motherboard loading screen, then straight to bios 2. The installation media was made using the media creation tool onto a usb.3. It was made on a different computer4. It was a self built pc with a tuf asus motherboard5. No this was a clean installation and i was trying to install it on my new ssd, it works fine when installing on the old hdd though.6. I can check the post"]},{"symptom":"Cannot Update Windows 10 1903...It Stuck on 60%        Getting This Type Of Error Message While Updating The Windows 10 1903...It Stops At 60%.... Showing The Message As Windows Could not configure One Or More System Components...To Install the Windows Restart the computer and then restart the installation...Please Help Me To Get Over It...","solutions":["Hi, Let us check the Installation log to find why the update failed. Please share the logs as mentioned in this article.https:\/\/answers.microsoft.com\/en-us\/windows\/for...","https:\/\/1drv.ms\/u\/s!AsGI0Giwza5uaXCtKnpvgvZ0QkY?e=qL3PgE Still in progress","Hi Laks. I'm Greg, an installation specialist and 9 year Windows MVP here to help you.I would manually upgrade to the latest version 1903 by opening the Media Creation Tool from this link:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m..., choose Download Tool Now, then open the tool and choose Upgrade This PC Now. This saves your files, apps and most settings in place, is the most stable method to change versions, brings your Updates current, resolves most problems. If any problems report back the verbatim error and number, then continue with these steps for overcoming Version Upgrade problems:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If the Version has problems I will work with you to try to resolve them. If the problems are intractable, you have ten days to roll it back in Recovery settings.Most problems are resolved by doing this gold standard Clean Install which should get you past all difficulties as it has millions of others who have followed the steps in this link and never come back to report another problem:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... . So read it over and see if its something you want to learn to do.I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.","Please disable IIS and then try again as it looks to be failing. 2019-06-12 12:57:20, Error CSI 000006a9 (F) Generic Command ErrorCode: 80004005 Executable: iissetup.exe ExitCode: 13 Phase: 38https:\/\/www.tenforums.com\/tutorials\/7247-turn-w...Let us know how that goes.","Error Again.... Please Do Help...I have Followed Your Instructions...But Still The Errors Coming...","So restart the PC to see if anything changes. If Ctrl Alt Del doesn't work then press and hold Power button, then power back on to see what happens and report back.Are you running the Upgrade to Version 1903 by installing Media Creation Tool, opening the tool and choosing Upgrade this PC now?If so and it won't progress move to the next step to use the media to Upgrade version following these steps for Overcoming Version Upgrade hurdles:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...","This message coming if i restart...I used this tool...to upgrade windows 10 ","That is not running the Media Creation Tool as I suggested. That picture is of the buggy Windows Upgrade Advisor which is used by buggy Windows Update to upgrade versions, or if you run it from the MCT downloads page.I suggest again to install the Media creation Tool, open it, and choose Upgrade This PC now. This runs the media after it downloads with no interference from Upgrade Advisor.You can also use the MCT to create media so you don't have to keep downloading it, by choosing after you open it to Create Media and either make the bootable flash stick or download the ISO. Then open stick or double click ISO to mount it, run Setup file as Admin. For further problems follow http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...","So I Have To Use This ToolTo Update Right....Just Simply Upgrade The Pc No Other Work Had To be Done Right,,,","Yes, proceed and if it chokes again follow the steps in my last link"]},{"symptom":"Issues with Windows and, or also, Outlook        I have what I think is an unusual problem. I cannot connect the problem with Windows 10 or Outlook 2019. I will try to explain the symptoms.The problem seems to center around Outlook. Even after a cold start, Outlook is apparently loaded in the background. When I actually open Outlook, the program just “pops open”. No welcome screen messages of Loading Profile, Processing…, loading of add-ins…, etc. Everything seems good and functional. However, I eventually experience is that Outlook is not downloading all emails or emails become stuck in Outbox folder.I then will exit Outlook, wait a couple of minutes, then open Outlook. Sometimes Outlook will “pop open” again, or I will get the welcome screen. When the latter happens, all is good. If the former, I restart my laptop.Sometimes when I restart my laptop, I get the Windows welcome screen and the message that my computer is “Preparing Windows…”. (This does not always occur.) Strange becasue I didn't see any Windows updates. After the laptop does what it’s doing, I see a generic desktop with none of my screen apps anywhere with the message that that Microsoft could not properly sign me in; that I should sign out, and sign in again.What I’ve then done is restart my computer which corrects that symptom. However, sometime when I reboot my laptop, I lose Bluetooth drivers. I usually can by running the Windows Troubleshooter, but not always. After repeated reboots and cold starts will Bluetooth functionality return. I use Bluetooth primarily for a remote speaker.These problems have been occurring for the last week or two. The only change I’ve made is perhaps a Windows update, but I haven’t added or deleted any programs or made any system changes.Anyone have any thoughts? This has progressed beyond my knowledge. (By the way, I am posting this under the Outlook Community too.)","solutions":["Hi StephenPeca I'll try to help you out. We're going to check the system integrity first : - with the command line (type \"cmd\" in the start menu, then run it \"in administrator mode\")- type \"sfc \/scannow\" then hit enter. Let the process run, it may take a bit of time. It will check the system files for any corruption. Second thing to do : - hit \"CTRL + SHIFT + ESC\" to run the task manager - go to the \"startup\" tab - check if outlook is in here. If yes, right click on it, then select \"disable\" (to disable the launch at startup).Close and restart the computer to check if this improves the situation. I'll wait for your news Regards","Thanks.After running the commands, came back with “Found corrupt files and successfully repaired them”.Neither Outlook or Office where in Startup programs.I also did a “Quick Repair” of Office 2019. I’ll see over the next day or two if issues are solved."]},{"symptom":"Can't uninstall KB4517389        KB4517389 has been giving me some trouble with bluescreens. Instead of using system restore point I tried to fix it and it isn't really going great. My computer hasn't frozen recently but I still can't uninstall the update.Uninstall update - An error has occurred. Not all of the updates were successfully uninstalled.Windows update troubleshooting - Troubleshooting couldn’t identify the problemdism.exe \/Online \/Cleanup-image \/RestorehealthDeployment Image Servicing and Management toolVersion: 10.0.18362.1Image Version: 10.0.18362.418[==========================100.0%==========================] The restore operation failed. Either the repair source was not found or the component store cannot be repaired.Error: 0x800f081fDISM failed. No operation was performed.For more information, review the log file.The DISM log file can be found at C:\\WINDOWS\\Logs\\DISM\\dism.logsfc \/scannowBeginning system scan.  This process will take some time.Beginning verification phase of system scan.Verification 100% complete.Windows Resource Protection did not find any integrity violations.","solutions":["Hi Silk. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Guardian Moderator here to help you.That DISM command is only to verify the wim image by which SFC checks system files, which isn't necessarily indicated unless there are other symptoms pointing to broken System Files and not just a failed Update. See Step 10 here to see how DISM is used this way: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Update History, then uninstall them from the link there, and immediately check for these again and hide with the Hide Updates tool explained here: https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... You can also go into Repair Mode by whichever method works here: https:\/\/www.tenforums.com\/tutorials\/2294-advanc... to use the new Uninstall Updates button in Advanced Troubleshoot Options:https:\/\/pureinfotech.com\/uninstall-updates-adva... You can also use System Restore from within Windows or the above Repair Mode to get back before the problem began, then check for Updates with the Hide Update tool and hide them:https:\/\/www.windowscentral.com\/how-use-system-r... If those fail then Prepare and submit the BSOD crash report back here for a BSOD expert's analysis following these steps:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If any steps cannot be performed normally then try them in 1) Safe Mode with Networking or 2) Safe Mode accessed by one of the illustrated steps in this guide:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1903 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to rate my post, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","The problematic update is KB4517389Settings>Update & Security>Windows Update under Update History, then uninstall them from the link there - and error has occurredThe new Uninstall Updates button in Advanced Troubleshoot Options - unable to uninstall update. System Restore from within Windows - it has been longer than 10 daysIs there any other way to remove or reinstall the update correctly as it did not seem to install correctly?","Confirm you have the latest Servicing Stack precursor Update here: https:\/\/support.microsoft.com\/en-us\/help\/452186...No problems reported from the 4517389 Update page here: https:\/\/support.microsoft.com\/en-us\/help\/\/windo... A crash is almost always caused by drivers. The most basic thing we need to know how to do to maintain a PC is know at all times we have the latest BIOS and drivers installed from the PC or Device maker's Support Downloads web page. How is this progressing?","Greg, The 4517389 Update page link comes back with a 404 error.  I have the latest Servicing Stack precursor Update.  I still can not uninstall KB4517389, it comes back with an error.Edge is still not working.","Greg, The 4517389 Update page link comes back with a 404 error.  I have the latest Servicing Stack precursor Update.  I still can not uninstall KB4517389, it comes back with an error.Edge is still not working. Wow...! Greg seems to be out since October of 2019...not so good. That would be two months.We have been experiencing blue screens since. In the news this update is a problem.Off subject...why does Microsoft updates take control of our computer at a whim while we are working, updates...then does not restore our desktop?"]},{"symptom":"Performance        Whenever I turn off the Battery Saver off my laptop doesn't work properly.It works like it doesn't have i3 processor it has some old pantium processor and Not 4GB RAM but 4 MB RAM.what should I do how can make it work properly with battery saver on.","solutions":["Hello Sharmacoder, I am Andrew an independent advisor. Many performance issues can lay within the BIOS settings. Can you enter your BIOS by pressing the correct key as soon as you turn on your computer. It will show you which one, most are typically F2, F12, delete and escape. Once in the bios reset the defaults, then save and exit. Keep using the computer and let me know if the performance has improved. Take Care, Andrew"]},{"symptom":"What is StartMenuExperienceHost.exe        For a few days, I have been seeing this process in task manager. It might be 18282.1000, but it was showing just before I updated too...(I honestly have no idea what category to put this in...)EDIT: I log in 407 days later to see that this now has 38,021 views. Cool.","solutions":["This is a legit exe and is an integral part of Windows OS. This shows all Windows 10 default apps in a GUI. Also responsible for Start menu etc.","Hello,AFAIK, StartMenuExperienceHost.exe is separate process for Start Menu and is an integral part of Windows 10. In earlier versions of Windows 10, Start Menu used Windows Shell Experience Host (ShellExperienceHost.exe). However, to improve the performance of Start Menu, StartMenuExperienceHost.exe was introduced.Hope this answers your query!"]},{"symptom":"Error 0x800f0985 when applying KB4530684 to fresh install of Windows 10 1909 x64        Motherboard: Gigabyte H55M-UD2H from 2010I searched Google for any mention of this specific error when installing the 2019-12 Cumulative patch for Windows 10 1909 x64 and found nothing helpful.I purged the Software Distribution\\Download folder and that made no difference.I ran the Windows Update Troubleshooter and it found no issues.I tried applying the update multiple times by Windows Update and by installing the patch manually and it failed every time in the same way.Two slightly newer machines with Asus P8H67M-LE motherboards from 2011 weren't affected by this error. However, the 2019-12 patch may have been applied before the 1909 feature update was.Other patches to my Gigabyte machine install correctly.Has anyone experienced this error?","solutions":["HI C21. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything possible for fixing failed Windows Updates, so that at least something will work before you work through them all. Even if you've tried a step, please do it over in sequence:Some Updates will sort themselves out in a few days so I'd wait to see. If not or they are bothering you then here are steps you can take:1) Run the Windows Update Troubleshooter from Windows Settings > Update & Security > Troubleshoot.2) There is a new guided walk-through from Microsoft for repairing Windows Update that leads up to resetting components if necessary:https:\/\/support.microsoft.com\/en-us\/help\/10164\/.... Try running that first. 3) If that fails try manually resetting Windows Update Service: Open administrative Command Prompt and type following commands one-by-one followed by Enter key.net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Close Command Prompt and see if Windows Updates works then 4) You can also install the Updates manually that fail to install, which are logged at Settings > Update & Security > Windows Update > Installed Update History, and then search for those to download and install from this Catalog:http:\/\/test.catalog.update.microsoft.com\/v7\/sit... 5) If they continue to fail and interfere, then you can block them using one of these methods:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... 6) If problems with Updates have become chronic and especially if you have other performance problems, go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 7) If nothing else works then do a Repair Install, by installing Media Creation Tool, open installed Tool and choose to Upgrade the PC Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version 1909. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... _____________________ Good news! There are major changes in Version 1903 giving back control over Updates to the consumer. Microsoft has heard us at the highest level who announced this here:https:\/\/blogs.windows.com\/windowsexperience\/201..._____________________ I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Greg,My apologies for not having replied. I'm dealing with a sudden family medical issue. I'll try to get to this later this week if I can find the time.What I can add is that this issue affected this computer both with a fresh W10 build and previously with an upgraded W7 -> W10 build. Too bad the errorcode doesn't give details of its own."]},{"symptom":"Update Error Code        Good day Wondering if any one can help me. I tried everything and nothing seems to resolve my problem.Every time I try and update it give me this:According to troubleshoot its one of the drivers ( Located: C:\/Windows\/system32\/drivers\/9c36df06fc817acd) that's infected with a virus but my anti-virus does not remove it at all.I tried every solution google gave and nothing works. Is there any other solutions that I can try?I don't want to delete the virus because i don't know what it will do.Please help","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command promptDISM \/Online \/Cleanup-Image \/RestoreHealthRun these commands on the command prompt to restart windows update servicesnet stop bitsnet stop cryptsvcnet stop wuauservnet stop msiserverRen C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.old net start bitsnet start cryptsvcnet start wuauservnet start msiserverAfter successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartThis should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","Thank you very much ill try that right away ","Fingers crossed!"]},{"symptom":"Unusual tmp files        I navigated to a folder on my local server and noticed that a tmp file flashed in to view briefly in the folder and then disappeared. I was able to open a properties view window before it disappeared.  It showed a file named EVPS_1744_4132_20201613742.tmp owned by the server of size 0 bytes. What is this file for and is there any security issue going on?","solutions":["Hi Pete Are you using Enterprise Vault File Server for Archiving? If so, then those temporary files are created by that software, the temp files are probably created during recalls and this is normal, once those files are deleted after use, it is only when those files are not automatically deleted, then you would have an underlying problem . . ."]},{"symptom":"KERNEL MODE HEAP CORRUPTION & IRQL NOT LESS OR EQUAL        Hi! New year greetings for you ^^Last October 4, I updated my PC to version 1909. From that time, I started getting unwanted restarts on my PC with a blue screen \"KERNEL MODE HEAP CORRUPTION\" problem or \"IRQL NOT LESS OR EQUAL\". I can still use my PC as I used to. It can still boot up and run apps like it used to be. I never installed any unknown software. I started to use appserv and wamp to the work not sure if the problem from them.  I regularly check updates for Windows Defender hoping it can solve the problem. I tried to update drivers but it still happens suddenly. Is there anything I could do about this?Included is the link for the latest Minidump hope it helps.https:\/\/1drv.ms\/u\/s!AkLdItb9YWGgwjNXdJyuDaChpKTZ?e=zgAAX4Thank you","solutions":["Hi Raneen Analysis indicates igdkmd64.sys as a possible cause of your system crashes, that is the device driver on your Intel HD Graphics . . .Open Device Manager (accessible by right clicking your Start Button) Expand the Display Adapters Section Right click your video card and choose Properties On the Driver Tab, choose 'Roll back Driver' Restart your PC once done . . . If that option is grayed out or does not resolve the issue, go to the support page for your device on the manufacturers website, then download and install the video driver they recommend, it may well be an older version to the one you are currently running","Hi again,I downloaded and installed the video driver they recommend it was an older version. Now will wait and see hope it is the solution.Thanks for your help.","Hi Raneen Analysis indicates igdkmd64.sys as a possible cause of your system crashes, that is the device driver on your Intel HD Graphics . . .Open Device Manager (accessible by right clicking your Start Button) Expand the Display Adapters Section Right click your video card and choose Properties On the Driver Tab, choose 'Roll back Driver' Restart your PC once done . . . If that option is grayed out or does not resolve the issue, go to the support page for your device on the manufacturers website, then download and install the video driver they recommend, it may well be an older version to the one you are currently runningHi again,It happened again suddenly \"IRQL_NOT_LESS_OR_EQUAL blue screen error\" not sure what caused it. Could this cause damage to the hard-disc?What should I do now?This is the latest minidump filehttps:\/\/1drv.ms\/u\/s!AkLdItb9YWGgww4nomRUachrNRok?e=4jafAKIt happened again suddenly \"IRQL_NOT_LESS_OR_EQUAL blue screen error\" not sure what caused it. Could this cause damage to the hard-disc?"]}]}