{"windows":[{"symptom":"rear usb port on packard bell computer        HiI need to get a cable\/usb stick but the front 2 usb don't work.I know the rear one works, but ii is a different shape than ther front ( rounded corners)Anyone know where I can get a usb cable\/stick that will fit?thanksNeil","solutions":["Hi Neil If that has rounded corners, that is not a USB port . . . 1 What is the exact Model No. of your Packard Bell, that will be printed on a sticker on the back casing of your PC . . .2 Open Device Manager (accessible by right clicking your Start Button) At the bottom of the hardware list, is there any exclamation marks beside any of the devices in the USB section?"]},{"symptom":"Ark Survival Evolved        So on my Xbox One the update on Ark Survival Evolved says 793.36 but on the Microsoft Store Ark Survival Evolved it says 793.16, they are both updated but it stops me playing cross play, any reason why they aren't on the same update? Edit: So the game updated but it is only 793.34 so I still can't cross play.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. If you are unable to cross-play, there might be a difference between the updates.The Apps\/Games in the Store are most updated. If the update is conflicting and resists you from Cross-Play, please download the game from Store.","Please let us know the status when you install the game from Store.","I already have the game installed on both Xbox One and through the Microsoft Store, the problem is that my Xbox One game is not on the same update as the Microsoft Store game yet they both have the latest update.","Could you please check the version of the update from the \"About\" page of the game?"]},{"symptom":"Drive doesn't show up on Installation        Hello I wanted to reinstall Windows on my PCon a new SSD (It is nfts formated and MBR), but when I boot via the windows Boot USB stick the drive is not visible. (But it is in the boot menu it is).  Also I can see it on my orher pc as a normal drive. Do you have any Idea how to fix it? Best wishes Tobias.","solutions":["Hi Tobias Yes, you are correct, the installation routine should not need any special driver to see that drive,check for another spare SATA port on your motherboard . . ."]},{"symptom":"Change Win 10 Boot Drive        I would like to change my primary boot drive from my current C to E, an ssd with only 128G of storage. My C drive is nearly full at ~850G, so I can't just migrate everything. I know how to change the primary boot drive in BIOS, but don't know what files need to move such that Windows can actually boot from it.","solutions":["Hi The0Gamer379 Honestly, if you are booting from C then that PC is set up incorrectly, the best option rather than moving Windows, would be to clean install Windows 10 and your applications on to that 128GB (119GB) SSD drive, while that would be a bit of work, your system would be much faster and more responsive. Then you could use the other drive for you data . . ."]},{"symptom":"Ultime Word Games - Saved progress but doesn't show progress on the game        Hello.I am playing Ultimate Word Games on my PC and I have compelted a number of levels (approx. 25) however when I loaded it today I noticed that the game had reset back to level 1.When I clicked on level 1 it told me that the game was complete and allowed me to click \"next level\".  I can do this for every level that I have already compelted.Is there a way to automatically do this so I can play the latest level of the game without having to click through every level I have already compelted?Regards","solutions":["Hi SilentSplash60 I'll try to help you out. Does the issue appear each time your launch the game ? Was it working properly at any given time ? Prior to an update maybe ? By the time, here are some things to test out in order to reset the game : https:\/\/support.microsoft.com\/en-us\/help\/402749...I'll wait for your news Regards","Thanks for advise, I've done updates but to no avail, I think I'll just have to work my way through clicking on \"next level\" until I get back to the level I was on.","Have you also tried this ? https:\/\/support.microsoft.com\/en-us\/help\/402805..."]},{"symptom":"Microsoft Assured Support customer - no access to support        Hi In the past I have, as a Microsoft Assured Support customer, and had access to level 1 and level 2 advocates.Now I cannot even get access to the bot or to message a  Microsoft assistant, because I get the bot but there is either a blank box when asked to be put through to a person, or today I got a greyed out box so I could not even get access to support via a bot.I have paid for this service and have no access to support despite my subscription still being active.Here is a screenshot of the box  I am getting, excuse the orange colour in place of the white, I use a blue light filterI cannot even write in the box despite using different browsers, including IE.Thanks in advance for any help PS I have looked online extensively for answers to my  problems and cannot find anything","solutions":["I am sorry but we don't work for Microsoft or have anything to do with their Tech Support.We are computer users that come here to help each other.https:\/\/support.microsoft.com\/en-au\/help\/4467230\/assisted-software-support-options-assure-premiumIs there a special phone number for Assure subscribers?Assure subscribers don’t need to call a specific phone number. Call usor contact usvia chat, and let the support advocate know that you're an Assure subscriber. Be sure to provide the Microsoft account that you used when you bought Assure.https:\/\/www.microsoft.com\/en-us\/store\/b\/software-support","Hi Thanks for your quick reply.I cannot access the support team, there is no link, the link I was provided with now just leads me to the bot.From the info you gave me they say there is no phone numer to call. They just say contact chat, which brings me full circle to the bot with the greyed out area where I cannot enter my question.I just tried the bot again and asked te be put through to a person and when I chose message a Microsoft agent I get a blank white box.I'm getting nowhere and feel ripped off by Microsoft","We have nothing to do with their bots, chat, or phone support.@@@@@@@@@@@@@@@@@@@@@@@To contact Microsoft Support:Contact support         http:\/\/windows.microsoft.com\/en-us\/windows\/contact-supportAlso: https:\/\/partner.support.services.microsoft.com\/en-us\/contactus\/windows\/tech-services\/\"Microsoft office locations around the world\"https:\/\/www.microsoft.com\/en-us\/worldwide.aspx\"Global Customer Service phone numbers\"https:\/\/support.microsoft.com\/en-au\/help\/13948\/global-customer-service-phone-numbers@@@@@@@@@@@@@@@@@@@@@@@"]},{"symptom":"intel(R) wireless ac 9560 160mhz adapter is experiencing driver or hardware related problems in my hp laptop        intel(R) wireless ac 9560 160mhz adapter is experiencing driver or hardware related problems in my hp laptopI've tried all the remedies available online but none of them worked (except system reset which I don't want to do)Any other inputs will be appreciated.Thanks in advance!","solutions":["Hi, kaushik_gvsn My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps to repair your Internet connections: Enter the Start menu or by pressing the Win + I key combination, open the Settings and click on the Network and Internet option. Once there, we select the Status option from the menu on the left side and, within the configurations and options that are loaded in the right panel, we have to look for the restoration of the network. When you click on this option, it will show us a new window from where we can restore the network in Windows 10. In this way, all network adapters will be removed and reinstalled, and the original configuration of other network components will be restored. net. This implies that if we were using some software, such as a VPN client or virtual switches, we will have to reinstall them.A process that the system performs automatically by clicking on the Reset button that is now displayed in Network Reset in Windows 10 settings. It is normal for the process to not take long, although we must wait until the end completely and restart the computer to continue with the network configuration in Windows 10 as we have done so far.https:\/\/www.kapilarya.com\/how-to-reset-network-...https:\/\/support.microsoft.com\/en-us\/help\/10741\/...You can also check that your drivers are updated. https:\/\/support.microsoft.com\/en-us\/help\/402844...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I've already tried this, but not much use.Like I've said tried most of the options already and my HP lap is 6months old.","I recommend you to repair Windows Completely before you must backup your personal files, the third-party software will be deleted.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi,I've performed a system reset but the issue still persists...","Hi,Is there any other way apart from this?! I could connect to wifi but it goes off intermittently.What are the chances that this being a hardware issue?Thanks in advance!","hi,I had the same problem but managed to solve.first configure the intel wireless adapter to use N not AC 5 ghz in advanced 802.11 n\/ac wireless mode.second step set mimo power safe mood to dynamic SMSP.third step set roaming aggressiveness to medium.fourth step set throughput booster to disable.fifth step set transmit power to medium.sixth step use fixed ip address not dynamic from the router (manually enter ip address and default gateway and DNS)finally update your wifi adapter to the latest software 21.50.1.1","Hello:I was having the similar issue. After a recent driver update on my HP Envy135, my 5Ghz connection would connect but would not give me any internet\/network connection. 2.4 Ghz connection worked good. I did the following two changes to the adapter and issue was resolved:1. set mimo power safe mood to dynamic SMSP.2. set roaming aggressiveness to medium.Got this recommendations from here. Thank you.","Thanks for your response!  But none of these steps helped me either....","Thanks for your response!  But none of these steps helped me either...."]},{"symptom":"ERROR : The directory is not writable by current user        ERROR : The directory is not writable by current user","solutions":[]},{"symptom":"Negate\/Disable Hibernate?        I have a laptop (Dell 64bit chip, fwiw) that has Win 10 Pro 64 bit.  Things now work fine after my upgrade from Win 7 Ultimate which was upgraded from Vista in \"1842\",  ;-).Under Win 7 Ultimate I could close the laptop's clam shell and it would 'sleep' overnight and awaken on the mouse movement.  [Note: I have a monitor attached to the laptop so the laptop is below my desk]. Now, after several attempts, each 'sleep' becomes a hibernate which requires me to open the clam shell and cntl+alt+delete and then close the clam shell.  I've gone into the Win 10 Pro Power & Sleep settings and set Screen: Battery=15 min; Plugged in=15min\/\/Sleep: Battery=15 min; Plugged In=30 min.I've also tried Additional Power Settings of Battery: Press Power Button: Sleep; Press Sleep Button: Sleep; Close Lid: Do nothing\/\/Plugged in: Press Power Button: Sleep; Press Sleep Button: Sleep; Close Lid: Do nothingWhat I want is when I'm away for a while or overnight is to require the Cntl+Alt+Delete (not just sleep and re-awake on mouse movement or keyboard) to have additional security,What am I needing to do?","solutions":["How are you getting on with my instructions?"]},{"symptom":"Windows 10 Temporary Profile Deleted All My Files        I have lost an important file to a temporary profile.A few days ago Windows messed up my login process and I got signed into a temporary profile. Back then I didn't know what a temporary profile was and thought all my files on my user profile were gone for good. There was no pop-up, no notification stating that I was signed into a temporary user profile (I only found out after googling many hours later). There was an important document that I needed which I saved onto my temporary profile, but after logging back in the next day the document was gone. I only just found out that whenever I sign out the temporary profile and its associated data gets deleted. Is there any way to recover data from a previous temporary profile?Note: I am aware that all my files on my main user account can still be accessed through my C: drive. However, the document I am after was saved onto a temporary profile which I am pretty sure has been deleted","solutions":["Are you recovered back to your correct profile now. If not restart 4 times using Start > Power > Restart to see if that part is resolved.If you created this document while using the Temp profile then there is no windows method to recover the file all you can do is scan with recovery software.As an example Recuva. https:\/\/****\/recuvaEdit, the link is auto removed on this site so you will need to search the internet forRecuva","Depending on whether you are using an SSD or HDD you may be able to recover the document you need.If you can take the drive out of the machine and place it into a SATA to USB caddy and plug that into a completely different machine, you can run software that will recover deleted files. but every time you use your PC before that increases the chances that the document is lost forever"]},{"symptom":"Problems with my desktop PC.        I recently had problems with my Windows 10 PC. When I opened Edge, the picture was unstable and flickers. With Chrome, a panel intermittently opens on the right side of the web page showing the elements etc. of the page. When I opened a spreadsheet in Libreoffice, a dialogue box comes up entitled Group. This box cannot be closed and the only way to close the spreadsheet is with task master. After trying several things to fix these problems, I decided to delete both hard drives and clean them with DBAN. I then reinstalled Windows 10 on the cleaned drive but the same problems are still in evidence. Can anyone tell me how to fix these problems?Move from Office 365 for admins \/ Exchange Online \/ Office 365 for business","solutions":["What has this got to do with any of the groups you have posted to??????????Sound more like a win problem or hardware issue","Hello Fredpea, I noticed that you posted the thread in Exchange Online \/ Office 365 for Business category. So I want to confirm whether the problem happens only for the pictures inOutlook Web App(WA) or it happens to all the websites in the browsers. In this thread, we mainly focus on the problems about Office 365 for Business and Exchange Online. If you are not sure about it, I suggest you capture some screenshots so that I can under your scenario better. Regards,Rick","Sorry, posted on the wrong page."]},{"symptom":"D: drive on Laptop hard disk - Location Not Available after recent Windows update        I have recently updated Windows 10.I store all my documents on the D: Drive (on partition of laptop hard disk). Since the update in File Explorer the D: drive has a blue question mark over it - when I double click on it the egg timer comes up and does not go away. Also in Fle Explorer all the recent D: drive documents come up - when I click on them I get the Location not Available error.When I go to CMD and type in D: it does not recognise the drive.All aspects of the C: including the Desktop seem to be working fine.There are a lot of posts about the Desktop disappearing and external drives being lost but I could not find any reference to a partitioned drive. Several posts suggest that it might be a faulty drive - but it was working fine before the upgrade - I suspect that a pointer or a Registry item has got corrupted.I seem to think that this happened to me before and I managed to find the solution but HELP PLEASE","solutions":["Hi Robin Open Disk Management (accessible by right clicking your Start Button) Expand that window, so all drives and partitions are showing in the bottom right panePlease provide a screenshot of that Disk Management window . . .","Hi DaveI hope that this helps!Kind regardsRobin","Hi DaveDo you have any thoughts on possible recovery?Kind regardsRobin"]},{"symptom":"How can I backup my Paint 3D projects?        I can't seem to access the local files for my paint 3D projects. I have over 20 projects for my business and I cannot afford the risk of losing them. How do I backup my projects so that I can access them from a different computer and continue my work on them?Help much appreciated.","solutions":["Hi AlexanderBridges i have found that the projects can be backed up by copying the contents of C:\\Users\\username\\AppData\\Local\\Packages\\Microsoft.MSPaint_8wekyb3d8bbwe\\LocalState\\projectspasting to another device will allow me to edit the project. **WARNING** this will overwrite any saved projects on the destination device, make a copy of the existing projects folder before pasting.it might be a good idea to make a suggestion for easy backups to the development team using the feedback hub (winkey+F)"]},{"symptom":"Windows lock screen        windows hello is not working.but I can see that the camera is on ","solutions":["Hi, My name is Will i'm an independent adviser. Please can you explain further what the issue is. Have you setup Windows Hello in the sign in options previously?"]},{"symptom":"Explorer.exe the parameter is incorrect        How to fix explorer.exe the parameter is incorrect ","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,Method 1: Process dism restore health Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command prompt DISM \/Online \/Cleanup-Image \/RestoreHealth Restart the computer and check if the same behavior occurs Method 2: Create a new user profile 1. Search for netplwiz on the start menu 2. Click on Add 3. Choose to sign in without a Microsoft account 4. Fill up the form and choose finish\/done 5. Highlight the newly created user account from the user account\/netplwiz window6. Hit properties and set it as an administrator 7. Sign in the account and check if the same issue occurs Method 3: Process in-place upgrade In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo... 2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept. 4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","Not work bro:( every time I turn on\/restart my computer there is always a notification like that"]},{"symptom":"Solving error code: 0x80070422 and Access denied when changing windows update to \"Automatically\"        Hi Guys,I'm facing issue when my windows trying to install .net Framework 3.5 and it prompted the error code as per my subject above. I tried to googled the solution and I think the solution should be changing the windows update to \"Automatically\" on Wndows 10 while mine is shown as \"Disabled\".The problem is when i'm trying to change the startup type to \"Automatically\" instead of \"Disabled\" it prompted the error as \"Access denied\".Is there anyone why there is the error prompted out and caused me to fail in changing the startup type for windows update. Please give me a solution if anyone know what is the problem going on.Thanks.","solutions":["Hi Z, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Renaming the registry key should enable the options. https:\/\/www.winhelponline.com\/blog\/windows-upda...Let us know how that goes. Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"Upgrade from Windows 7 fails at about 75%        Split from this thread.Trying to upgrade from Windows 7 to Windows 10. Getting the same error.ErrorSYSTEM THREAD EXCEPTION NOT HANDLEDThe installation failed in SECOND_BOOT phase with an error during BOOT operation0xC1900101-0x40017When the update reaches 75% it runs into the above errors.Just tried to upgrade today from Windows 7 and am having the same issues.  Get to 75%, get the above mentioned error, it tried to recover install 3 times and then reset the computer back to Windows 7.","solutions":["What is the make and model of the device or full spec.How are you trying to upgrade, via downloaded ISO or using the Media Creation Tool to upgrade now.You should uninstall any 3rd party antivirus.Be aware you may need a Windows 10 licence, the free upgrade period was 2015 to 2016."]},{"symptom":"How to restore a Windows 10 system image to an existing or larger storage device        Technical Level : Intermediate SummarySince Windows Vista Microsoft included a system imaging utility that makes it easy to backup your entire computer, which you can then use to restore in case of system failure, move to a larger hard disk or simply to have a working state of your computer just in case. As noted, a system image is an exact replica of your hard disk, down to the partition layout. Depending on how large your Windows 10 installation is, it can use a lot of space, so you should invest in an external USB hard disk with a lot of space. In this article, we take a look restoring the system image on a larger hard disk. This makes it quite convenient if you somehow outgrow your current storage allotment.DetailsFirst, check out the following article how to create a system image here. Once you have your backup ready, you can proceed to shutdown the system, install your hard disk or restart and boot from the recovery drive or Windows 10 bootable media. If you don’t bootable Windows 10 media, see the following article for instructions:How to download official Windows 10 ISO files To learn how to change your BIOS options to boot from the DVD drive, see the following tutorial:http:\/\/notebooks.com\/2011\/05\/05\/how-to-load-bios-and-change-boot-configuration\/Once your computer is set to boot from the DVD, you should see this option.If you are installing from a thumb drive, see the following instructions how to prepare your computer to boot from one:http:\/\/windows.microsoft.com\/en-NZ\/windows7\/Start-your-computer-from-a-Windows-7-installation-disc-or-USB-flash-driveThe Windows logo will appear on screen, this might be here for a while, as long as you see the indicater, everything should be ok.Click NextClick Repair your computerClickTroubleshootClickSystem Image RecoveryMake sure your external hard disk where the system image is located is connected and turned on.System Image will select the latest system image, if you would rather restore another image, select theSelect a system image radio box and click Next and follow the on screen instructions to select an available system image.System Image will format and repartition your hard disk, if you have partitions or other attached storage you would to exclude, click theExclude disks... button and do so then click NextClickFinish to beginOne final warning before the restoration begins. Click Yes to continue.Wait wait while the restoration takes place. This can take some time. When complete, your computer will restart automatically or you can do so right away.Reclaim unallocated disk space if necessaryIf you restorage a system image on a hard disk or SSD that is larger than the one it replaced, then you will have unallocated disk space to reclaim because the system image restored according to its known partition layout.Press Windows key + X or right click the Start button and clickDisk ManagementYou will notice there is a unallocated partition, this is what you need to reclaim. To do so, right click the Local disk where Windows 10 is installed, usually C:\\ and clickExtend Volume...Click NextClickNext (make sure the unallocated partition is actually selected).Click Finish , you should now see a single disk partition for your Local disk in Disk Management with reclaimed space.Related:How to manually backup and restore your filesHow to free up disk space in Windows","solutions":["That is all fine and wonderful, but my image restored with a 450MB recovery partition between my primary partition and my unallocated space.  The option to extend my system volume and reclaim the extra 118 GB of space in my larger drive is not available.  Any ideas how to fix this?","Yes, Metalman007, this is one of the MANY problems with Windows 10!  If you have since found a solution please post it...I for one would really appreciate it.  I always seem to forget this deficiency in Win 10 (worked find in 7 and I believe 8) until I go to upgrade to a larger drive.  I ran into it in the pre-release version and I foolishly thought Microsoft might actually address the issue but alas they did not.  Even if you install to a drive and make C only part of the total drive it still puts the recovery partition at the end of C so you can't even expand on the same disk thanks to that very poor design logic.","If u select exclude partitions would u be able to exclude all exept for the partition where the default os is installed? (Usualy C) or can u only exlude certail drives, and is it possible to make a system backup of a certain drive only (eg of only windows os drive and exclude all other partitions from ur image)","There is no option to exclude partitions unfortunately.","Silly me.  My little HTPC only has room for one laptop drive, 500GB.  Filled it up with my iTunes folder so I installed a 1TB drive.  Did the above only to discover there's no way to extend C: because its bracketed by System Reserve and the Recovery partition! The unallocated space is the same size as the C: drive that's too small!  is there no way around this?  Recovery doesn't let you resize or skip partitions before the restore.","Ah yes,I was reading along and thinking \"didn't I already try this and was unable to expand\/extend my partition?\".I was eventually able to reformat my new larger drive (1 TB) by using diskpart to delete partitions. I was about to have another go at transferring my full 500 GB drive to the 1 TB using Acronis with both drives plugged into SATA ports on a desktop. Unfortunately, I let chkdisk run on the 500 GB and it is basically ruined now with \"file or directory is corrupted or unavailable\". I'm hoping I still have the image file.","very easy.install MiniTool Partition Wizard  delete the recovery partition,then merge all the partitions to system partition","Hi everybody! Just to start I have to say that I’m a deprived widower of Rescue & Recovery, the wonderful former IBM (then until Windows 7, Lenovo) program that saved me a lot of times with its incremental backup\/restore functions.   Now, in Windows 10 that program is no more supported, and I asked many time for a valid substitute. Microsoft and also Lenovo, answered that the need of R&R is completely overcome by the standard Windows 10 Backup and restore functions.   Thus I used the standard functions making regularly both system images and file backups.   Then all OK?   Unfortunately not!   The first time I needed a restore because of a Hard Drive Crash, I started the image restore with the last copy available. The re-imaging started perfectly and I started breathing regularly, while the restore went up for about one hour and a half.    But unfortunately I discovered at the end of the restore that it was unsuccessful due to an incorrect parameter; error 0x80070057; no other comment from the procedure.   There are many advices on the InterNet, quite common among the users, none of them worked. Luckily informatics is my job and after a week I solved, but a “normal” user?   Now a backup\/restore like that is as a parachute full of holes, or a lifebuoy made of lead. Horrid!   I’ll look for something better, like Acronis AOMEI or something else, but Microsoft can be charged for refunds, being responsible of such a disgusting functionality.   Waiting anxiously for some answer and advice…   Yours    Dr. Ing. Alberto Maria Marchetti    ","I agree  with  you completely, After trying many methods to restore my computer from a system image, I too had to buy programs like Laplink And Aomei to be able to backup and restore my computer.  Microsoft has not given any updates to solve this problem.  Quote ( Microsoft can be charged for refunds, being responsible of such a disgusting functionality.)Leslie Callapp","That is all fine and wonderful, but my image restored with a 450MB recovery partition between my primary partition and my unallocated space.  The option to extend my system volume and reclaim the extra 118 GB of space in my larger drive is not available.  Any ideas how to fix this?To move partitions arround I use free OpenSource GParted https:\/\/gparted.org\/livecd.phpYou download the .iso file and burn it on a CD or see documentation to get it bootable on a USB drive.Once you boot with it, you have a old fashion graphic interface to play arround with your partitions.Select the physical drive on upper right corner.Then ensure you have the partition selected and go on the menu \"Partition\" \"Resize->Move\".Put 0 at \"Free Space Preceeding\"Hold 9 until filled at \"New size\" (going out of that edit box will just put the maximum size).Click apply and enjoy"]},{"symptom":"windows music player keeps duplicating music files   ext drive g        windows Media Player keeps duplicating music  external drive g  Library","solutions":["Hi JimD2 My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.When you move digital media files on your computer, the file name and file path information remain unchanged in your library. Then when you select a file to play from its new location, a new entry is created in your library if the option to automatically add it to your library when it is played is selected. As a result of this, your library may quickly contain a large number of duplicate or invalid entries.To prevent music files from being added automatically to your library 1. In Windows Media Player, on the Tools menu, click Options. 2. On the Player tab, clear the Add music files to library when played check box.Now, when you play any music files on your computer or from the Internet, the file will not be added automatically to your library.Hope this helps."]},{"symptom":"Is it possible to move the window control buttons to the left side?        I want to move the window control buttons to the left side like this:Is it possible?","solutions":["Hi HAYKXACHATRYAN There is no setting or registry hack that can move the Windows controls to the left side, however, there is a tiny free portable utility that can do that for you called LeftSiderhttps:\/\/media.askvg.com\/files\/Leftsider.zip________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","If you are talking about the taskbar icons then yes.  Right click on the taskbar, click on Taskbar settings.  There you can do a lot of things with the taskbar.","No, I'm talking about window control buttons...","It doesn't work with all apps,Look at this:","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. There is no native way to move the Window Control Buttons to the left side. However, there are many 3rd party software which may allow you to do this by emulating the native Windows user interface.I would not recommend you to try a 3rd party software due to phishing, security and privacy issues.","\"There is no native way to move the Window Control Buttons to the left side.\"\"I would not recommend you to try a 3rd party software due to phishing, security and privacy issues.\"Ok :(","That's a browser I have never seen before.   It must be customizable to move items around.  From what I read, the only browser that can do that is Vivaldi:https:\/\/vivaldi.com\/blog\/building-buttons-that-move\/","Hi HAYKXACHATRYAN I get that it is unfortunate that there is no native solution to this. 3rd party software aren't perfect solution, as they need to adapt to a nearly infinite number of different window size \/ layout \/ color...Maybe you'll find your luck with one, but it's a matter of luck I think. Feel free to come again if you need further help Regards","\"There is no native way to move the Window Control Buttons to the left side.\"\"I would not recommend you to try a 3rd party software due to phishing, security and privacy issues.\"Ok :(You realize that anything that isn't made by Microsoft is 3rd party software be definition, right? So beyond Windows itself, Microsoft Office, perhaps Visio, you shouldn't install much else on your machine according to this response...No Firefox, Chrome, Spotify, Thunderbird, Slack, Zoom, no games or game launchers like GOG, Steam, etc. etc.Now, I AM NOT SAYING that you should just install anything, but there are many reputable tools out there (like for instance WindowsBlinds, but there's other too!) that have been doing this for many years... The biggest pain though is apps that insist on drawing their own (I'm looking at you, Google, Mozilla!)"]}]}