{"windows":[{"symptom":"Windows 10 set up crashes        Im trying to download windows 10 home 64 bit onto a thumb drive but it crashes on the setup and i get error code 0x80070456-0xA001B. What is this error code. Thanks in advance. ","solutions":["HiMy name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.I think this is due to the USB device's formatting type. You need FAT32 not an NTFS or GPT. Indeed all the USB greater than 32GB NEED an NTFS system and is quite normal that the procedure doesn't work with them. You have to change in any case the system format of the USB to FAT32.Hope this helps."]},{"symptom":"about Windows 11 and Windows 12        I want to ask if it's true that Windows 11 and Windows 12 really exist?Do these two links provide false information ??<link removed><link removed>","solutions":["It is *not* true, and according to Microsoft it will never be true. Microsoft has said the will never be any versions with new names. Windows 10 is the last name.But nobody knows whether Microsoft will change its mind one day and come out with  a newly-named version. But if does, there is no guarantee that it will be called Windows 11.","Hi, Thank you for writing to Microsoft Community Forums. I understand your query regarding Windows 11 and 12.  Currently, the latest version of Windows available is Windows 10 and the information about Windows 11 and 12 are just rumors. As of now, there is no information available about Windows 11 or 12 officially. If you are using Windows 10, I would suggest you to keep your computer updated with the latest updates. For more information on installing Windows updates, see Windows Update: FAQ. I would also suggest you to beware of the sites providing information on downloading Windows. If you wish to download Windows, you can navigate tohttps:\/\/www.microsoft.com\/en-us\/software-download\/windows10 Let us know if you need any further information, we will be glad to help you. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Microsoft update stopped computer communication with printer        After a recent Microsoft 10 update my computer will not communicate with my printer.  Tried  printer driver..no luck. I understand this has been a recent problem...Any Microsoft fixes?","solutions":["Hi Michael. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Run the Printer troubleshooter at Settings > Update & Security > Troubleshoot. Rather than spending too much more time fiddling I'd simply Clean Install the printer which always works, lasts longer and actually saves time:1) Power up the printer, if wired unplug it's USB cable from PC. 2) Go to Settings>Apps>Apps and Features to find and Uninstall any printer software.3) Use one of these methods to remove all of the old printer drivers: https:\/\/www.tenforums.com\/tutorials\/101274-unin...https:\/\/helpdeskgeek.com\/how-to\/remove-uninstal...4) Now type Control Panel in Start Search, open CP, choose Icon View. In Control Panel open Devices and Printers, right click printer to delete Printer and any scanner or fax of the same name. Restart PC.5) Go to the printer model’s Support Downloads webpage to download and install the latest full software package. Now is also the time to check for any newer printer firmware to install which matters a lot.6) Extract Printer software, right click Setup file to Run as Administrator. Follow the setup screens closely as you install the software. For USB it should prompt when to plug in the printer.Older software may need to be installed in Compatibility Mode to run correctly: https:\/\/www.groovypost.com\/howto\/run-old-softwa... If you have further problems reply back with results of each step. I hope this helps. Feel free to ask back any questions and let us know how it goes. If you will wait to rate my post until we are done, I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I had already tried this with no success.","How did you clean out the old drivers exactly?"]},{"symptom":"Screenrec audio help        Hi I have installed Screenrec and would like to record audio as don't have a mic, however in settings the option to change as shown in the pic. Can anyone help I would be so grateful :)   ","solutions":["Hi Vanessa. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Screenrec is software and doesn't have a microphone. So if you don't have a mic you will still have to get one.Then follow the Setup steps here from Screenrec: https:\/\/screenrec.com\/screen-recorder\/record-co... ?See some PC microphone options here: https:\/\/lifehacker.com\/how-to-choose-the-best-m...https:\/\/www.amazon.com\/Best-Sellers-Computers-A...https:\/\/www.bestreviews.guide\/cheap-computer-micI hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"error code with 0x80070002 when trying to register 32 bit DLL in 64 bits window 10        While I trying to regsvr32 xxx.dll in administrator dos window, I received an error message as following:\"The Module xxx.dll was loaded but the call to DllRegisterServer failed with error code 0x80070002.\"The Module is a security application for online login.I have the ALL permission.  How to troubleshooting with issue?  Thanks! Mike","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.The error is suggesting your command prompt doesn't have full administrator privileges. Even if your account has admin privs you still need to specifically open the command prompt in the way described below.I'm not sure what method you've used to open the command prompt but try both of these methods:Right-click on START button, from the menu choose \"Command Prompt (Admin)\" Click START, search the menu by typing \"Command\", when you see Command Prompt right-click it and choose \"Run as Administrator\".Regards, David"]},{"symptom":"From Windows 7 to Windows 10 - Not correctly loading        I'm wondering if anyone else out there is having difficulties in getting the Windows 10 Pro to load properly.  I've purchased my software, got the license\/key and have followed the steps, but it keeps bypassing the area where you're to enter the license\/Key into the set-up.  It simply takes on a mind of it's own, goes through the process and then gives me a message that \"changes\" are not being made.  I'm not sure what to do at this point.  Any assistance would be helpful.  If not, I'll simply have to get IT help elsewhere, but it's not exactly how I'd wish to spend my day....  Thanks in advance for any assistance.","solutions":[]},{"symptom":"Problems with FS2002; SF9; and FSX        I know that this is a bit unusual, however all three of FS programs are in need of fixing.  I have a HP Desktop with WIN10 installed.  #1 FS2002.  This program will download completely, however the area where all of the aircraft should show up is BLACK.   #2 FS9.  This program also downloads (into (D:) (the other two go into (C:).  When I attempt to start the program is just disappears.  #3 FSX will download to about 95% and quits.  Up comes a notice that errors no.****prevent the program to complete the process and tells me to close it.  I know that this is a bit cryptic but I have tried everything to correct these problems.  If you can help it would be appreciated.  Jim","solutions":["I know that this is a bit unusual, however all three of FS programs are in need of fixing.  I have a HP Desktop with WIN10 installed.  #1 FS2002.  This program will download completely, however the area where all of the aircraft should show up is BLACK.   #2 FS9.  This program also downloads (into (D:) (the other two go into (C:).  When I attempt to start the program is just disappears.  #3 FSX will download to about 95% and quits.  Up comes a notice that errors no.****prevent the program to complete the process and tells me to close it.  I know that this is a bit cryptic but I have tried everything to correct these problems.  If you can help it would be appreciated.  Jim","For FS2002 and FS9 no ideaFor a install of FSX, as silly as it sounds, a easy solution is just to clean the install DVDs (believe it or not!)","Hi Jim,Interesting problem you have.   Have all three Flt. Sims been running properly together at an earlier stage?   Then they suddenly threw up these problems?   Or, is this the first time you have tried to install and run all three on the one computer?I would first remove all three Sims from your computer, making sure that all folders and Registry items are deleted as well.  You could do a search for these via your Cortana Search box, using the words:  Flight Simulator or by their names.   Or, if you have software such Revo Uninstaller or Advanced System Care, then do a deep clean.   After this is done, reboot your computer for the actions to be completed.   This is only the first step for a good basis to start installation;  after this, it may well be a hit and miss installation as you are now trying to install very old Sims on Win10.Then make sure your graphic card drivers are up to date, your Windows Updates are current, and all your Microsoft Visual C++ are up to date also.   If you haven't already got them, you may have to download and install the older versions of MSVC++ (i.e. 2005, 2008, etc.).  Your Flt. Sim may throw up an error to that effect.   If possible, install the Sims to the root of your drive(s):  e.g. C:\\FS2002 or D:\\FS2002, and not into Program Files, which is the default).Install FS2002 first and make sure it is running well before rebooting your computer and proceeding to the next install.  Now, if you're still getting the problem of black aircraft (the spinning one, I presume), at that screen, try pressing Alt + Enter to see if that fixes it.   If nothing works, you might need to do some online research for this problem (both FS2002 and 2004 are not Sims I use).The matters with FS2004 and FSX.   FS2004:  This sounds like you might need a No CD fix (i.e. starting the Sim without the use of Disk 4, which may not be compatible with Win10).   FSX:  This one could be an installation error.   The Error codes are important to note, or else go to your Event Viewer (Custom Views > Admin Events) and scroll down to when the FSX installation error occurred to find the error message.   See how you go with FS2002 first.Chris"]},{"symptom":"Window 10 bugcheck event        Hi,I have been having problems with my desktop pc occasionally crashing. This is an event message i got after a recent crash.The computer has rebooted from a bugcheck.  The bugcheck was: 0x00000116 (0xffff98861e64b010, 0xfffff8048d4eac10, 0xffffffffc000009a, 0x0000000000000004). A dump was saved in: C:\\WINDOWS\\MEMORY.DMP. Report Id: f0454358-c0cd-4417-81cd-b53b63ec16a0.can you please help me with this.RegardsBluesman","solutions":["Hi Blu3sman, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved. That is most often the video driver. If over-clocking STOP!. Try using this method to uninstall then re-install the latest video drivers. Display Driver Uninstaller https:\/\/www.guru3d.com\/files-details\/display-dr...====== Troubleshoot blue screen errors <-- read this link http:\/\/windows.microsoft.com\/en-us\/windows-10\/t...We can analyze the minidumps if you make them available from the OneDrive or other file sharing sites (such as MediaFire). If you have problems uploading the minidumps copy them to the Desktop or the Documents folder and upload them from there.One-Drive - Share files and folders and change permissions http:\/\/windows.microsoft.com\/en-us\/onedrive\/sha...Upload photos and files http:\/\/windows.microsoft.com\/en-us\/onedrive\/add...Zip or upload the contents of C:\\Windows\\minidump Use OneDrive to upload collected files http:\/\/social.technet.microsoft.com\/Forums\/en-U...Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all.","Hi Rob,Thanks for the quick reply. Funny that you gave me the suggestion of uninstalling my video driver using DDU as i have just done that. Have yet to test though.As for the minidump, i have 3 and have zipped them up and added them to my OneDrive documents folder, where do we go from here?Bluesman","Well, be sure to check with the video device maker's support (and\/or the actual computer maker if a laptop or tablet) and forums about any known issues.If that driver update works then you have done it. If not use the methods in my previous post AND run Driver Verifier. ------ After doing ALL the updates you can, and if the issue continues, then run Driver Verifier. Driver Verifier can help find some BSOD issues : Using Driver Verifier to identify issues with Windows drivers for advanced users http:\/\/support.microsoft.com\/kb\/244617How To Troubleshoot Driver Problems in Windows Vista or 7. (8\/8.1 and 10 are essentially the same). http:\/\/www.winvistaclub.com\/t79.htmlUsing Driver Verifier https:\/\/msdn.microsoft.com\/en-us\/library\/window...WINKEY + X - RUN - type in -> verifier \/reset hit enter to disable If Driver Verifier creates a minidump upload it and post the link here so we can analyze it.Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all."]},{"symptom":"Bamboo Ink Pen Will Not Write        I have the Lenovo Yoga C740 2in1 laptop. I have been trying for several days now to figure out how to get the Bamboo ink pen to write on my screen. I have it connected and it will do its commands when I push the buttons, but it will not write. I have tried reinstalling the bluetooth driver for it. I have installed the Wacom pen & tablet drivers. I do not know what else to do. ","solutions":["Hi Elizabeth. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See fixes for Bamboo pen won't write here: https:\/\/windowsreport.com\/bamboo-ink-pen-not-wr... (avoid ad links!)https:\/\/appuals.com\/fix-wacom-pen-not-working\/ (avoid ad links here too)https:\/\/www.reddit.com\/r\/wacom\/comments\/9u3li4\/...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Internet speed not up to par        I have a Dell Inspiron 15 with a Qualcomm QCA9377 802.11ac wireless adapter.  I have 400Mbps service thru Spectrum.  The wifi router is spitting about 433 but I can only seem to get about 140 on the Dell.  I'm getting about 180 on my Samsung J7 phone.  I've turned off SmartByte.  Looking for any info or suggestions on why I'm not getting the speed I'm paying for or if this laptop isn't capable. TIA.","solutions":["HI Pete. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything so that at least something will work. Even if you've tried some of these steps already please do them over in sequence to see if it makes as difference:Update your network adapter drivers from the PC maker's Support Downloads web page using the full model number, HP Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.If you have the latest network driver then try on it's Driver tab also to Roll Back, or Uninstall and then restart PC to reinstall the driver. Try also all older drivers from Update Driver > Browse > Let Me Pick list working backwards.If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them.If this was caused by Version update then you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool.Go to Device Manager > Network Adapters, select network adapter in use, click on the Power Management tab, clear the check box to \"Allow the computer to turn off the device to save energy.\" Then click on the Advanced tab, disable any energy-saving options.Enable IPv6 in the network adapter settings: https:\/\/www.tenforums.com\/tutorials\/90033-enabl... Run the fixit from https:\/\/support.microsoft.com\/help\/929852 (Re-enable IPv6 on all nontunnel interfaces) and reboot.Right click the network icon in System Tray at bottom right end of task bar to Troubleshoot Problems.Try all of these steps: https:\/\/support.microsoft.com\/en-us\/help\/10741\/... https:\/\/www.thewindowsclub.com\/windows-10-netwo...Go to Settings > Network & Internet > WIfi > Manage Known Networks, highlight and remove the network having problems, restart PC to see if it shows up again.Try plugging in by ethernet cable to the router to compare, then plug the ethernet cable into the modem (if separate) to see if this might be an issue with the router.Try powering off modem, router and PC and then restarting in that order with 1 minute in between each. You may need to reset your router or even optimize it following these steps:https:\/\/www.lifewire.com\/resetting-a-home-netwo...https:\/\/www.pcmag.com\/article\/258865\/how-to-set...Your router manual is always available from the manufacturer's website for your exact model.You also are entitled to Support from your internet provider to get online on all devices. This is always included in the monthly bill. If your router is less than a year old they will also Support getting it connected and optimized.Another option is you could replace the wireless adapter with an inexpensive USB nano adapter like this one:https:\/\/www.amazon.com\/OURLiNK-600Mbps-Wireless...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows 10 fresh install        Im getting a black screen When trying to install a Windows 10 USB on the computer i just built.the computer has a ryzen 9 3900x on a gigabyte b450m ds3h with 16gb of corsair vengence ram and a 120gb ssd, it also has a saphire nitro+ graphics card but i dont think thats relevant.","solutions":["Hi Mary, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Does the device POST? If so, try making the media again: https:\/\/www.tenforums.com\/tutorials\/2376-create...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads."]},{"symptom":"YOUR WINDOWS LICENSE WILL EXPIRE SOON,WIDOWS 10        Hi,Your windows license will expire soon message on windows 10 shows on my laptop even if my windows license is activated.I know there are lot of ways to fix this but I tried all of them:                                                                                              1.Restart Windows Explorer process                                                                                              2.Change your group policy                                                                                              3.Disable services                                                                                              4.Use your command prompt to find your product key                                                                                              5.Modify your registry                                                                                              And I even have restored it.But it still appears.I do not know have I mentioned all the methods I tried,but I tried all I could find on google.If somebody has solution please let me know.Thank you!","solutions":["Hi, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Get help with Windows 10 Activation errors: https:\/\/support.microsoft.com\/en-in\/help\/10738\/...https:\/\/support.microsoft.com\/en-in\/help\/12440\/...To better diagnose the issue, Please send us the results of both steps. 1. Right click Start>Command Prompt-Admin and type in the following command: slmgr.vbs \/dlv You will get a window, take a screenshot using snipping tool and paste it it next reply.2. Run the activation troubleshooter and send us the snip too. Using the Activation troubleshooter-Windows 10 https:\/\/support.microsoft.com\/en-in\/help\/20527\/...How to get a screenshot and post back: https:\/\/answers.microsoft.com\/en-us\/windows\/wik...Please let us know if you need any assistance in posting.","Hello,First, check the type of license installed on your system.1. Open administrative Command Prompt.2. Type slmgr \/dlv and press Enter key.3. Note the Product Key Channel section Windows Script Host box:If it mentions OEM <method>, you’ve OEM license installed.If it says Retail, you’ve retail license installed.If it mentions GVLK, VOLUME_<method> then you’ve volume license installed. Note that GVLK stands for Generic Volume License Key.---------In case if it reports that you've volume license installed, then it is not a valid license to be used by end users (correct me, if your system is part of organization). In this case, you need to buy genuine license for your Windows 10.Hope this helps!","............","It is: GVLK, VOLUMEI bought my laptop and got my Windows 10 on it so I do not know anything about it.","Hi, Thank you. Appears to me a counterfeit copy of Windows. What is the source of your license?","How can I know the source of my license?","Sorry, I meant if the Windows came preinstalled with the computer and seller promised the same?Please note that Windows is a paid product and requires a separate license apart from the computer you purchased.","It came preinstalled with the laptop!","Thanks. Does this tool show a product key? https:\/\/neosmart.net\/OemKey\/If not, the seller lied to you and installed a counterfeit copy. Ask him to issue a new license.Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","Thank you for help.It seems that my windows is not activated.Windows showed that information today.I just do not understand why it has been showing that all this time."]},{"symptom":"C:\\\\WINDOWS\\system32\\ncryptsslp.dll is either not designed to run on Windows or it contains an error. Try Installing the program again using the original installation media.        The message pops up every time I try to download something or play a game and won't let me complete either of the actions. I've tried numerous ways to solve the problem and nothing seems to work. I've tried to delete the program but it says I don't have permission to be able to delete the script. So, I gave myself full control and tried to delete the script but it says that ncryptsslp.dll is open in another program, and when I delete that program, it says that it is open in another one. I've tried to factory reset my laptop and the message still pops up. I scanned my laptop using multiple virus protections and they don't find anything. I ran a scan through command prompt and it detected an issue but wasn't able to fix it. This problem accrued when I ran a windows update and all the programs that I used worked before the update and now they do not work.","solutions":["Hi, please run sfc \/scannow command to repair system files. if this will not help please try to repair system files by DISM.exe \/Online \/Cleanup-Image \/RestoreHealth command from Windows PowerShell (administrator) environment.","Hi, please run sfc \/scannow command to repair system files. if this will not help please try to repair system files by DISM.exe \/Online \/Cleanup-Image \/RestoreHealth command from Windows PowerShell (administrator) environment. When I use command prompt and run sfc \/scannow command it says \"Windows Resource Protection found corrupt files but was unable to fix some of them.\" So, I tried using Windows PowerShell and when I useDISM.exe \/Online \/Cleanup-Image \/RestoreHealth nothing happens and I assume something is supposed to load but nothing ever does even after I run commands such as DISM.exe \/Online \/Cleanup-Image \/CheckHealth and DISM.exe \/Online \/Cleanup-Image \/ScanHealth","Dism command may require several minutes for completion so it may seems it does not work at first moments. Please wait any response.","Dism command may require several minutes for completion so it may seems it does not work at first moments. Please wait any response.Sorry for the long response, but this still didn't work. When I do use these commands it says that the problems have been fixed or the problems cannot be fixed. Even after I restarted my computer after using Windows PowerShell as an administrator the problem still occurred when I tried to download something such as virus protection, games, etc."]},{"symptom":"Werid error I can't find fix to        I have today installed windows 7 on an core 2 duo early 2008 IMac. I had installed it fine, but when it came to the part of installing boot camp drivers, whenever I turn on, log off, sign on my computer it fails and this pulls upIdk what it is but I looked up the dll and it says it is installed with other things but it is with other apps and this seems like a system app. Please answer thanks.","solutions":[]},{"symptom":"how do i download a app outside of microsoft        im trying to download streamlabs OBS but it said \"To let your pc run smoothly we didn't download the app to change settings go the this setting ( I forgot the word it said)","solutions":["Hi iPush,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Does your device has Windows installed in S mode?"]},{"symptom":"Upgrade from Windows 7 Pro to Windows 10 on 64-Bit Desktop computer        I am totally confused by all the options out there.  I do not run a business, but I do not like the home version of Excel (or didn't in the XP days), so I have Windows 7 Pro operating on a Dell XPS desktop computer with Intel Core I7.What do I need to upgrade to Windows 10?  I do not use apps, and do not have a smart phone.  I do NOT use the cloud, I have a Simpledrive 1TB backup drive from SimpleTech by Fabrik.  I don't want to lose any of my files or my Non-Microsoft programs, such as the program for my digital camera, Norton, Spybot, and my Lexmark Prospect Pro205 printer.  All of which I am hoping are compatible with Windows 10.  They were all purchased when I had Windows XP.So, do I need a Windows 10 CD or something else?  Are there instructions for those of us who know how to work ON a computer but do not understand ISO, Enterprise vs. Pro vs. others, OE, Installation media (does this just mean a cd?),  etc.Do I need a new Product Key, or do I use the one I have on my Windows 7?  Do I need just one item, or multiple items to upgrade.  i.e. License vs. Product Key, vs. Media creation tool vs. etc.","solutions":["You have to check with the program and printer manufacturer's websites to see if THEY support 10 for their devices and programs.If you have to buy 10, you buy a Retail License.Read about upgrade paths, as you are concerned about your programs which you don't know if they are even compatible with 10.If they aren't they may work in 10 if you reinstall them in compatibility mode.You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:Dell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 @@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700Cheers.","1.  Dell XPS 8700 has not been tested for Windows 10.2.  Processor Requirements:  How do I know what it supports?\"Supports PAE, NX and SSE2.Supports CMPXCHG16b, LAHF\/SAHF, and PrefetchW for 64-bit OS installation\"3.  Where do I find information about the storage controllersStorage controllers must support booting using the Extensible Firmware Interface (EFI) and implement device paths as defined in EDD-3.Storage host controllers and adapters must meet the requirements for the device protocol used and any requirements related to the device storage bus type.Bus-attached controllers must implement the correct class\/subclass code as specified in the PCI Codes and Assignments v1.6 specification.","Here is my system information:  Can someone tell me if it is compatible for Windows 10 AND what I need to upgrade from Windows 7 Pro to Windows 10 Pro?All my external hardware is connected via wires (USB),  I do not use any wireless (WiFi) service at this time.Service Tag :              Express Service Code :               Computer Model : XPS 8700 BIOS Vendor : Dell Inc. BIOS Version : A13 BIOS Date : 6\/13\/18 Processor Processor : Intel(R) Core(TM) i7-4770 CPU @ 3.40GHz Clock Speed : 3.4Ghz L2 Cache Size : 1024 Memory Available Memory : 63.46% Page File Size : 24,476.5MB Available Page File : 97.86% Virtual Memory : 24,476.5MB Available Virtual Memory : 76.06% DIMM3 : 2,048.0MB DIMM1 : 4,096.0MB DIMM4 : 2,048.0MB DIMM2 : 4,096.0MB Network controller Adapter Realtek PCIe GBE Family Controller Bluetooth Device (Personal Area Network) Storage Drive : C: Storage : 3 Drive Size : 906.8GB Total Available Space : 703.7GB Used Space : 203.1GB Drive : D: Storage : 5 Drive Size : Total Available Space : Used Space : Drive : E: Storage : 2 Drive Size : Total Available Space : Used Space : Drive : F: Storage : 2 Drive Size : Total Available Space : Used Space : Drive : G: Storage : 2 Drive Size : Total Available Space : Used Space : Drive : H: Storage : 2 Drive Size : Total Available Space : Used Space : Drive : I: Storage : 2 Drive Size : Total Available Space : Used Space : Hardware Disk Drives ATA ST1000DM003-1CH1 SCSI Disk Device CF\/MD Card MS\/Pro\/Duo Card SD\/mini-MMC\/RS Card SM\/xD Card Lexmark USB Mass Storage USB Device Display Adapters NVIDIA GeForce GTX 645 Keyboards, Mice & Pointing Devices USB Input Device Monitors Dell E207WFP Sound Devices NVIDIA High Definition Audio Realtek Audio Bluetooth Audio Device USB Controllers Intel(R) 8 Series\/C220 Series USB Enhanced Host Controller #2 - 8C2D Intel(R) USB 3.0 eXtensible Host Controller Bluetooth Hard Copy Cable Replacement Server Intel(R) 8 Series\/C220 Series USB Enhanced Host Controller #1 - 8C26","We have no authority to tell you Yes or No to installing 10 on that device.We give you advice, also give you where to look for the information; then it is up to you to weigh that up and make the decision to upgrade to 10, or not.Dell supplies Windows 10 64bit drivers for your Model.https:\/\/www.dell.com\/support\/home\/au\/en\/aubsd1\/product-support\/product\/xps-8700\/drivers","Just a couple of additional points:1.  Excel is a component of Microsoft Office, which is completely separate from Windows.  Depending on which version of Excel you have, it may or may not work if you do manage to move to Windows 10.  You will, of course, need the Excel (or Office) product key in order to install Excel on a new system.  The Excel or Office product key is NOT the same as your Windows product key.Microsoft Office 2010 and newer will work with Windows 10.  Microsoft Office 2007 also will install and run on Windows 10, although Microsoft no longer supports Office 2007.  Older versions of Microsoft Office might work if installed in \"compatibility mode.\"  To determine which version of Excel you have, see https:\/\/www.asap-utilities.com\/download-help-excel-version.php2.  The Lexmark Prospect Pro205 printer has been discontinued by Lexmark.  Lexmark still supplies drivers for this printer for Windows 8 and asserts that these drivers should work for Windows 10.  In addition, it appears that Microsoft Update will be able to provide a Windows 10 driver for the Pro 205 (although these drivers are described as \"for testing,\" so it's not clear how functional they are).","Which versions of Office work with Windows 10?https:\/\/support.office.com\/en-us\/article\/which-versions-of-office-work-with-windows-10-0fc85c97-da69-466e-b2b4-54f7d7275705The following versions of Office have been fully tested and are supported on Windows 10. They will still be installed on your computer after the upgrade to Windows 10 is complete.Office 365 (Version 16)Office 2019 (Version 16)Office 2016 (Version 16)Office 2013 (Version 15)Office 2010 (Version 14)Office 2007 (Version 12) is no longer part of mainstream support and hasn't been tested on Windows 10. However, Office 2007 will install and run on Windows 10.Versions of Office prior to Office 2007 are no longer supported and may not work on Windows 10. To see options for upgrading to the latest version of Office, seeChoose your Office.","Which versions of Office work with Windows 10?https:\/\/support.office.com\/en-us\/article\/which-versions-of-office-work-with-windows-10-0fc85c97-da69-466e-b2b4-54f7d7275705The following versions of Office have been fully tested and are supported on Windows 10. They will still be installed on your computer after the upgrade to Windows 10 is complete.Office 365 (Version 16)Office 2019 (Version 16)Office 2016 (Version 16)Office 2013 (Version 15)Office 2010 (Version 14)Office 2007 (Version 12) is no longer part of mainstream support and hasn't been tested on Windows 10. However, Office 2007 will install and run on Windows 10.Versions of Office prior to Office 2007 are no longer supported and may not work on Windows 10. To see options for upgrading to the latest version of Office, seeChoose your Office.I currently have Office 15, at least that's what shows up when I search \"Office\"  Will the upgrade convert my inidividual files to a version compatible with Windows 10, or do they stay as they were originally saved?   Most of my files are currently saving as Microsoft 97-2003.","Just a couple of additional points:1.  Excel is a component of Microsoft Office, which is completely separate from Windows.  Depending on which version of Excel you have, it may or may not work if you do manage to move to Windows 10.  You will, of course, need the Excel (or Office) product key in order to install Excel on a new system.  The Excel or Office product key is NOT the same as your Windows product key.Microsoft Office 2010 and newer will work with Windows 10.  Microsoft Office 2007 also will install and run on Windows 10, although Microsoft no longer supports Office 2007.  Older versions of Microsoft Office might work if installed in \"compatibility mode.\"  To determine which version of Excel you have, see https:\/\/www.asap-utilities.com\/download-help-excel-version.php2.  The Lexmark Prospect Pro205 printer has been discontinued by Lexmark.  Lexmark still supplies drivers for this printer for Windows 8 and asserts that these drivers should work for Windows 10.  In addition, it appears that Microsoft Update will be able to provide a Windows 10 driver for the Pro 205 (although these drivers are described as \"for testing,\" so it's not clear how functional they are).When I search Office it says Office 15 which is Office 2013 Version 15.  But when I go to Excel Help, I do not see an option for \"About Microsoft Excel\".   Which the link above said I should see.  So I'm confused. ","Office 15 is (as shown in the material cited by Bill Smithers) Office 2013.  This will work fine with Windows 10.No, an upgrade to Windows 10 will not convert your files, nor do you need to do so.Starting with Office 2007, Microsoft changed the default format of files to an \"Office Open XML standard.\"  Files saved in this format have an \"x\" appended to the filename extension:  .docx, .xlsx, pptx, and so forth.  See, e.g.,https:\/\/www.howtogeek.com\/304622\/what-is-a-.docx-file-and-how-is-it-different-from-a-.doc-file-in-microsoft-word\/Office 2007 and newer versions can read and edit both the new file formats and the old file formats.  If you like, you can use \"save as\" in your Office 2013 applications to save a copy of any file in the newer format.","Which versions of Office work with Windows 10?https:\/\/support.office.com\/en-us\/article\/which-versions-of-office-work-with-windows-10-0fc85c97-da69-466e-b2b4-54f7d7275705The following versions of Office have been fully tested and are supported on Windows 10. They will still be installed on your computer after the upgrade to Windows 10 is complete.Office 365 (Version 16)Office 2019 (Version 16)Office 2016 (Version 16)Office 2013 (Version 15)Office 2010 (Version 14)Office 2007 (Version 12) is no longer part of mainstream support and hasn't been tested on Windows 10. However, Office 2007 will install and run on Windows 10.Versions of Office prior to Office 2007 are no longer supported and may not work on Windows 10. To see options for upgrading to the latest version of Office, seeChoose your Office.I currently have Office 15, at least that's what shows up when I search \"Office\"  Will the upgrade convert my inidividual files to a version compatible with Windows 10, or do they stay as they were originally saved?   Most of my files are currently saving as Microsoft 97-2003.No, 10 won't convert your Office files as long as you still have that version of Office installed.How you see your Office files depends on Office.You need to keep Office installed to be able to read those files in that Office format."]},{"symptom":"mat-debug-xxxx.log files        Why are these files appearing in quantity (every 15 minutes), while running Windows 10 home, in my \/apps\/local\/temp folder? They did not appear before the last 3 days ago.","solutions":["Hello! I am an Independent Advisor, I would love to help you out! This has an answer here: https:\/\/answers.microsoft.com\/en-us\/windows\/for...Basically, these are most likely telemetry logs from Office 365. Is this a personal machine or a work machine? Are you using office 365, and do you have any work accounts added to it?Were any settings changed right before these files started appearing?","I do not have Office 365. I only have Office 2010. I have not changed any settings or added any accounts so far as I know. I only want to know specifically what a mat-debug file is related to in terms of applications and how to disable filling up my temp. folder with these 0 byte files during the time I am operating this computer.","Can you attach one of the log files here?","in file location C:\\Users\\greni\\AppData\\Local\\Temp:\"mat-debug-12928.log\" is zero bytes (typical one of 12 = one every 15 minutes).There is another non-zero byte file that seems associated with these files:\"18e190413af045db88dfbd29609eb877.db.ses.\" The contents of this file when opened with Notepad are as follows:157465269363829A73B1A-0845-487F-A030-D241AC7A1390.","Hi Richspacenuke, Do you have any Onedrive app running in background? if so can you try to disable it then check if problem still persist.","I disabled it but the \"mat-debug\" (and to a lesser extent \"aria-debug\") files continue to propagate in my temp folder. Should I uninstall One Drive? (I don't use it).","Since youre not using it. Try to uninstall it first and see if it helps.","Is there a way to re-install it later? Also, after watching what is going on using Process Explorer, I think the real culprit may be Smartbyte telemetry used by DELL (my computer is a Dell Inspiron I5 series). It gave me problems some time back when it was filling up my Windows\/temp file with telemetry files.  Is that possible?","I uninstalled Microsoft One Drive and the mat-debug-xxxxxx.log file is still propagating in my temp file.  I am going to ask Dell if they understand what a mat-debug-xxxxxx.log file does.","H Richspacenuke Just a quick question, do you have Matlab or Simulink by Mathworks installed on our PC?"]},{"symptom":"DEVICE MANAGER        IF I WERE TO UNINSTALL EVERY THING IN DEVICE MANAGER, ON REBOOT WOULD EVERY THING REINSTALL?","solutions":["Hi FRANKMA1OZ, Yes it would try to install everything; but, before you do this - why would you want to do it? If you are wanting to restore everything back to Windows 10 factory-level setting you can perform a Reset or Repair Upgrade like below:https:\/\/answers.microsoft.com\/en-us\/windows\/for...I strongly suggest NOT to do this as you could cause severe stability issues with your system.","IF I WERE TO UNINSTALL EVERY THING IN DEVICE MANAGER, ON REBOOT WOULD EVERY THING REINSTALL?It wouldn't matter because you would be unable to reboot."]},{"symptom":"Change from PIN to Password Login        Hi all, please help me with the issue below:I’m using Windows 10, and I was using password to log into my laptop. However, after updating windows, I was prompted to change to PIN, so I started using PIN for a while. Now, for some reasons after updating Windows, I was prompted to use password to log in again. But I don’t remember my password and cannot reset it because it’s a local account (it’s not linked to my other devices).Are there any ways to reset my PW\/change back to PIN so I can log into my device?Thank you!!","solutions":["Hi Huong. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.A PIN is only a convenience. It requires a password to have a PIN. Some functions will always require the password.They do not make it easy when you forget your password, or else anyone could say they're you and get into your account. You should first try changing the password. If it's a Microsoft account password and you set up a security email or phone number then you can change the password easily enough in your online account here: https:\/\/support.microsoft.com\/en-us\/help\/402683... If not you have to go through account recovery: https:\/\/support.microsoft.com\/en-us\/help\/17875\/... If it's a local account you can change the password from the sign-in screen if you set up test questions for this purpose:https:\/\/www.windowscentral.com\/how-add-security... You can also enable the built-in hidden Administrator used only for emergencies as shown here:https:\/\/www.isumsoft.com\/it\/enable-hidden-admin... Sign into it to create a new Local Admin account in Settings > Accounts > Family & Other People > Other, as shown here:http:\/\/www.howtogeek.com\/226540\/how-to-create-a... Sign into the new account, test if the problem persists, if not then move your files over, test that all programs work or else reinstall them, then when ready delete the old account in the same place, and hide the built-in Admin account.You can then change it to your Microsoft account if desired: https:\/\/www.tenforums.com\/tutorials\/5375-switch...If these all fail then you may need to reset your PC, saving files. In order to avoid the need for the password you forgot you may need to create bootable media to access Reset or do the Clean install:To create Windows 10 Installation Media on another PC install Media Creation Tool and follow the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, on second screen choose Repair Your Computer, then Troubleshoot Options to try a Reset.If that fails choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, click Next to let it create needed partitions and start install - this makes it foolproof. Everything needed to get the best possible Clean Install is here: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... It is a better install than any amount of money can buy and a great learning experience that will make you the master of your PC because you will learn what works best and how to apply it with your own hands. If you have files that aren't backed up you can use the same bootable media to try to rescue your files using these methods:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... A suggestion for creating a complicated password that you'll remember: a [childhood street address] + [phone number] that doesn't exist any longer and only you remember for life.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Stanley Remote Oulet and HP Win10 Compatability\/Configuration        I was hoping to get information on the ability for and HP Elite operating Win10 to connect with the remote operated single oulets manufactured by Stanley. Please include any hardware and or app\/software that my be needed or helpful!THANK YOU in advance.","solutions":[]}]}