{"windows":[{"symptom":"Wifi Adapter uninstalls itself        Hi there,I am having an issue with my asus r510v and wifi adapter \"realtek 8821AE Wireless 802.11ac PCI-E\".Randomly when I navigate through the Internet or playing online games my connection falls, but the status icon in tool task says I am still conneced until I try to continue gaming or open another link. Then the icon in task bar changes to no internet and trying to reconnect only says the message \"cannot connect to that network\".If I go to device manager it shows the adapter with a red exclamation and if I try to disable it (to re-enable it after) then it disapear like if there was nothing connected.The only event registered in event log is that DNS are not responding.Retarting the computer solves the issue for a while.So please, if anyone can help me I would greatly appreciate it.","solutions":["Hi, AlfonsoPB My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps to repair your Internet connections: Enter the Start menu or by pressing the Win + I key combination, open the Settings and click on the Network and Internet option. Once there, we select the Status option from the menu on the left side and, within the configurations and options that are loaded in the right panel, we have to look for the restoration of the network. When you click on this option, it will show us a new window from where we can restore the network in Windows 10. In this way, all network adapters will be removed and reinstalled, and the original configuration of other network components will be restored. net. This implies that if we were using some software, such as a VPN client or virtual switches, we will have to reinstall them.A process that the system performs automatically by clicking on the Reset button that is now displayed in Network Reset in Windows 10 settings. It is normal for the process to not take long, although we must wait until the end completely and restart the computer to continue with the network configuration in Windows 10 as we have done so far.https:\/\/www.kapilarya.com\/how-to-reset-network-...https:\/\/support.microsoft.com\/en-us\/help\/10741\/...You can also check that your drivers are updated. https:\/\/support.microsoft.com\/en-us\/help\/402844...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thank you for your time Mr. CloutierI checked all links and solutions you provided but it is still happening.Did a netsh wlan show wlanreport and it shows this:<\/EventMessage>      <\/WlanEvent>      <WlanEvent type=\"ncsi none\" error=\"0\">        <UID>513<\/UID>        <EventID>4042<\/EventID>        <EventLevel>4<\/EventLevel>        <EventTime>2019-12-31T20:28:03<\/EventTime>        <EventMessage>Cambio de capacidad en {a22d0c99-6d15-4f0c-82e0-ece44e1ec467} (0x47008000000000 Familia: V4 Capacidad: Ninguno MotivoDeCambio:SuspectArpProbeFailed)<\/EventMessage>      <\/WlanEvent>      <WlanEvent type=\"wlan \" error=\"0\">        <UID>362<\/UID>        <EventID>11004<\/EventID>        <EventLevel>4<\/EventLevel>        <EventTime>2019-12-31T20:28:22<\/EventTime>        <EventMessage>Se detuvo la seguridad inalámbrica.So the reason why my connection falls according to this https:\/\/forum.huawei.com\/enterprise\/en\/windows-client-dont-respond-arp-probe-packet\/thread\/470481-861 is that the device send an ARP probe packet to check the user online status. If the user does not respond within a detection period, the device consider that the user is offline and thus switchs off the wifi adapter wich may return with a simple disable and re-enable or with a full reboot.Hope this information may let you know how can we solve my problem because I can´t find it anywhere.And again, thank you for your time.","I recommend that you repair Windows completely before you must make a backup of your personal files, third-party software will be removed. Here the link to download the Windows ISO.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Windows 10 Activation after motherboard change        I recently changed motherboards and now my windows isn't activated I was signed in with a Microsoft account linked to my windows copy but it still won't let me activate it the error code is 0Xc004F211","solutions":["Hi om3y, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.It is important to inform you that every time a major hardware change is made, which in your case was the motherboard, it is very likely that Windows will not be able to find a license that matches the next time you start your device. Based on what has been described, I invite you to consult the information in this official Microsoft link that handles this topic.https:\/\/support.microsoft.com\/en-us\/help\/20530\/...Additionally, you can consult the section of the error that you are observing 0xC004F211https:\/\/support.microsoft.com\/en-us\/help\/10738\/...If the problem persists, once you apply the recommendations, do not hesitate to contact directly with the Microsoft support found in each link.Let me know if you have something else that I can help you with, I'd be happy to help.Happy new year Regards, Marc M."]},{"symptom":"Uninstall and re-install             I keep getting the following message when I boot up.   The file 'C:Program Files (x86)\\driver support\\svc\/install.log ...  I guess I've got to uninstall that file and then reinstall it.  Don't know how to and don't even know where to find the file......Help?......Mick","solutions":["Hi MickMy name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a solution.Open the Start menu.Click Settings.Click System on the Settings menu.Select Apps & features from the left pane.See if driver support is listed and click the Uninstall button that appears.Click the Uninstall pop-up button to confirm.Hope this helps.","Hi MickMy name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a solution.Open the Start menu.Click Settings.Click System on the Settings menu.Select Apps & features from the left pane.See if driver support is listed and click the Uninstall button that appears.Click the Uninstall pop-up button to confirm.Hope this helps. Jon,    Worked like a charm....you're the best !....Thank you.                                                           Mick"]},{"symptom":"Gears of War 5 will not finish installation        On the windows store it does not give me an option to continue installation.But as you can see on the main menu of the game it is stuck at 86%. There is nothing showing me progress of it installing anywhere, nor can i find an option on the game UI to continue.Any ideas? Please don't say re-download.Thanks.","solutions":["I found this I'm now downloading a 'Gaming Services' App which  I hope will help. I will update after.https:\/\/support.xbox.com\/en-GB\/games\/game-setup\/troubleshoot-games-windows-10","Same happened to me, but im stuck at 45% :(","Did you all ever find a solution?","Hi all,Same for me unfortunately. I am stuck at 80%. Seems the only solution is to uninstall and reinstall... except that the game is 60GB. At least the single player campaign is installed. ","Hi all,What worked for me is that I clicked install, and I left it on \"Download Pending\" for over an hour. Eventually the Microsoft store could verify all my files and the installation resumed. Hope this helps.","Do a complete Uninstall of the game and reinstall it again (with Administrator rights to be safe). While the game is being downloaded make sure the download will no be interrupted. e.g. pc goes to sleep, hibernates, or logs out. (just dont play it till is 100% finished downloading and installing, you'll know its is 100 percent finished when you enter the game try to playt and it doesn't you \"installation is at xx% finished\") It worked for me!","I solved this by installing Gears of War 4 too.I had the same problem. Before i updated my PC, i had the game installed and working fine (had gears of war 4 too) but, once i updated my hardware and reinstalled my PC, couldn't restore my windows apps from my second storage, so i downloaded gears 5 again, but in this time the game was uncomplete and stuck in 86% of remaining download, i tried to uninstall and reinstall the game but didn't work and every time was missing different content, so i installed gears of war 4 too and suddendly gears 5 worked :')it looks like gears 5 recycles content of gears 4, it makes sense since gears 5 weighs half of gears 4well, this annoying solution worked for me, i hope someone finds a better one"]},{"symptom":"No install option for Outer Worlds on PC (have XBOX game pass for PC, updated Windows 10, signed into acct)        I hope this is the correct forum. I chose 'Devices' as it somehow appears that while this PC clearly shows as a device on my MS Account Profile, it doesn't show as an option to install games under Xbox Game Pass for PC. Here are the details:I'm logged in as Admin to my MS account - I can see my pic, name, etc. in my browser.I subscribed the Xbox Game Pass for PC. It shows in my subscriptions.This PC shows in my devices under my account. It's a new PC, plenty of hard drive space, fully updated. I was able to install other games just fine.I should be able to install The Outer Worlds (or Gears 5 or any game labeled \"Game Pass\"). The install button is grayed out but the ellipsis drop down has 'Install on my devices'When I choose that, a window popups up saying \"Where do you want to install? It looks like you don't have any applicable devices linked to your Microsoft Account.\" This is clearly not true. I'm signed into my MS account. I can install and play other games. The proper subscription shows for this account.There's a Get more info link which is again useless. It just opens a generic help page for the MS Store.I've restarted, removed all other MS accounts (I had an older one that I never use) and made sure this was the only one showing on this PC. I'm not behind on any payments or subscriptions.Thank you in advance for your help. My guess is somehow the game pass isn't syncing with this PC correctly.","solutions":["Hi ArsBaka This is reported quite a bit, what seems to work for most users is: 1 Make sure Windows 10 is fully up to date Click your Start Button, type winver and hit Enter On the resulting dialog, what Version No. and build No. of Windows 10 are you running?2 Reset the Store Application Click your Start Button, then just type wsreset.exe, and hit Enter 3 Restart (not shut down) your PC"]},{"symptom":"Windows 10 1909: troubleshooters display The XML page cannot be displayed on report page        ever since I went to version 1909, I have been unable to view the troubleshooting reports option in all troubleshooters. instead of displaying the report, I got the following text; The XML page cannot be displayed Cannot view XML input using XSL style sheet. Please correct the error and then click the Refresh button, or try again later.--------------------------------------------------------------------------------Security settings do not allow the execution of script code within this stylesheet. I do not know what security settings it refers to. I certainly did not set any any settings to block this. I have been unable to find any relevant data on this issue on my own.","solutions":["just found out that XSL might be referring to MS-Office Excel files, which I do have, but should play no part in this issue. Excel should not even affect the windows trouble shooters, should they? I did make a report in the feedback hub, but that was when 1909 was still in release preview. ","A lot of people are reporting many different issues with 1909, from Downloading, Installing, and behaviour after installing.for now, I would recommend rolling back to 1903, which is a known stable build.(1909 \"should\" also be stable, but apparently not)","A lot of people are reporting many different issues with 1909, from Downloading, Installing, and behaviour after installing.for now, I would recommend rolling back to 1903, which is a known stable build.(1909 \"should\" also be stable, but apparently not)this issue and another one related with logging into a remote computer using remote desktop connection (the one that comes with windows not the one from the windows store) are the only issues I am having with 1909. I have not had any install or download issues with the new version.I did do a repair install, on my machine, just too see if that would fix the issue, but it did not. strangely enough, the device I have been remoting into lately, A gen 5 Surface Pro (model 1796) which I upgraded to 1909 from 1809, does not have this issue. maybe this issue stems from 1903, not 1909 as I originally thought? ","there must be a setting somewhere either in the registry or elsewhere that needs changing. but, hell if I know where too look. if someone has any suggestions, I would like to hear them. I don't consider telling me to perform a roll back and not use 1909 a proper suggestion. for me, that is not possible, since I was apart of the release preview group for 1909, it has both been too long to do a rollback, and also I did a repair install to help test the 1909 .iso, when it was released for release preview users. and just so it is clear, I did the last repair install using the released 1909 iso image, not the release preview image.","BUMP (12.31.19) - ISSUE IS STILL PRESENT EVEN AFTER REINSTALLING WIN10 1909"]},{"symptom":"Kernel Power 41 Computer Reset        Hi All, I'm running into some issues w\/ Kernel Power 41 error and my computer turning off mid-game when playing Counter Strike. This hasn't occurred once in the normal operating of the PC outside of when I'm playing video games, and it's never happened previously when using my HDD on Windows 7. So here's the timeline of events:I recently updated from Windows 7 to Windows 10 about a week ago, and then shortly after that I got a Samsung 860 EVO SSD and cloned it from my existing HDD. When I play counter strike utilizing my newly cloned SSD as my new boot drive, the computer shuts down on it's own within ~30 minutes, it reboots normally and then shows Kernel 41 critical error in the Event Viewer. I initially thought this was more likely to be related to my newly installed Windows 10 rather than my new SSD, but I just booted Windows 10 through my HDD and played Counter Strike for a few hours without a single issue, so now I'm inclined to think it's the new SSD and not Windows 10. I cloned the SSD from my HDD using Samsung Data Migration and then just started booting off the SSD. One other interesting quirk is that occasionally when I'm booting up my computer when it's using the new SSD as the boot drive, sometimes the computer will turn on, turn off about 2-4 seconds later, and then turn itself on again another 2-4 seconds later and it'll boot totally normally on this second attempt. I've tried every step in this link and pretty much anything else I can find on Kernel 41 errors.https:\/\/windowsreport.com\/kernel-power-41-error-windows-10\/My computer is a bit old, but given it's been working totally fine until this new SSD was utilized it makes me think it's unlikely to be a hardware issue. Any tips\/ideas would be greatly appreciated as I have no clue what to do at this point. PSU: Antec Earwatts EA 750 750W Continuous Power ATX12V version 2.3 GPU: NVIDIA GeForce GTX 760CPU: Intel Core i7-2600K Sandy Bridge Quad Core 3.4GHz (3.8GHz Turbo Boost)HDD: Seagate BarraCuda ST31000524AS 1TB 7200 RPM 32MB CacheSSD: Samsung 860 EVO SSD 500GBMotherboard: ASUS P8Z68 Deluxe LGA 1155 Intel Z68 6Gb\/sRam: HyperX T1 Series 16GB 240-Pin DDR3","solutions":["One last thing I forgot to mention, not sure if there's any relevance to it but figured I should share in case it means something to someone. The way the computer crashes has come in two forms. While both forms result in a Kernel 41 error in the Event Viewer, half of the crashes have fully come by totally shutting down my desktop and my desktop losing power. The other half of the crashes have just resulted in a massive computer freeze, where the computer still has power, but it's totally frozen and nothing works (no CTRL ALT DEL or anything). In this latter state, I tried letting the computer sit like that for 15 minutes and it just stays frozen, so eventually I have to power it off and start it back up so the end result from my perspective is effectively the same. ","Hi Marty, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved. That issue is usually hardware and\/or heat related though there can be software causes (rare)..Be sure to update the firmware on the SSD and check with its maker about possible issues with it.Sometimes running Stress tests can identify the possible hardware issue. PC Stress Test free software for Windows 10\/8\/7 https:\/\/www.thewindowsclub.com\/pc-stress-test-f...====== Could be your computer just does not have the complete specs to run your programs or games. Best to check with the program and game makers' support and forums.Are there any DMP files in C:\\Windows or C:\\Windows\\minidump? If so please post those so I can analyze them.ID41 often with no Bug_Check - The main cause of this issue as you have described is hardware related :https:\/\/support.microsoft.com\/en-us\/help\/202850...1. Over-Clocking -> best to reset ALL to the defaults especially while troubleshooting2. Memory (check thoroughly as indicated below). 3. Power Supply (see below to ensure you have enough power). 4. Over-heating - even if the overall temps are with-in specs a single component can be too sensitive to even the normal levels of heat and fault at a lower temp. Try adding a fan blowing into the case to reduce the effects of heat even more than the cooler usually does. Of course ensure all built-in fans are running. ==================================================== After checking determining the wattage of the power supply you will then need to check the requirements of the motherboard and devices. Usually the video card is one of the major power users.How do I determine how big my power supply is? http:\/\/www.computerhope.com\/issues\/ch000800.htmOther good sources of information are the device makers' sites and their forums. eXtreme Power Supply Calculator http:\/\/extreme.outervision.com\/psucalculatorlit...Power Supply Calculator https:\/\/www.newegg.com\/tools\/power-supply-calcu...Choosing the right power supply for your computer http:\/\/en.kioskea.net\/faq\/588-choosing-the-righ...How Do I Test the Power Supply in My Computer? http:\/\/pcsupport.about.com\/od\/toolsofthetrade\/f...==================================================== Memory tests do not catch all errors such as mismatched memory (possible even for sticks that appear to be identical) and when faster memory is placed in system behind slower memory. So it is best to also swap sticks in and out to check for those even if all memory tests fail to show a problem. To test RAM check here - let it run 4+ hours or so. <-- best method www.memtest.org MemTestX86 - Test RAM With http:\/\/www.tenforums.com\/tutorials\/14201-memtes...For the Windows Memory Diagnostic Tool. Type in Cortana's search box -> Windows Memory Diagnostics at top of list - click it. in Windows 8\/8.1\/10 the name is \"Windows Memory Diagnostic\". Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all.","Thank you very much for your time in writing the above. Fortunately for me, I went on vacation, returned a week later and my computer hasn't crashed once under the same conditions that was forcing it to crash previously. So not sure what the issue was, but I'll bookmark this post and follow-up with it if I run into the same issue in the future. Thanks"]},{"symptom":"Why is Windows 10 \"attempting repairs\"?        I leave my Win10 64 bit Dell desktop on all the time.  But two times now, I came in in the morning to find a blue screen and Dell symbol after which it successfully booted following some time \"attempting repairs\".   Something appears to be failing in the night clearly but1) what do these \"attempting repairs\" episodes mean?2) what can I do to find\/address the underlying problem?Thanks.Jeff","solutions":["Hi Jeff That sounds like a Windows update is not installing correctly and Windows is trying to roll back . ..Open the Settings App (gear icon on your Start Menu) Go to Update and Security - Windows update Is there Pending Updates and are any of those indicated as having failed (number in brackets beside the update)?","Thanks for the response.  I checked there and it said Windows was up to date.  There was an optional update available for download and installation so I'm going to try doing that.-Jeff"]},{"symptom":"How do i transfer data from old pc to new pc        how do transfer data from old pc to new pc ...both using windows* Moved from Education","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand you want to transfer data from your old computer to new computer, we will certainly help you with this. There are multiple ways you can transfer data. Below are the few methods that you can use as per your convenience: Using Backup and restore We can create a backup of the files to an external drive (like USB or External hard drive) and then restore it on the new computer. Please refer the steps in the articleBackup and Restore in Windows 10.  Using OneDrive Another way will be to save the files to OneDrive. OneDrive is free online storage that comes with yourMicrosoft account. Save your files in OneDrive folders and you'll be able to get to them from any PC, tablet, or phone. You can access the files in OneDrive using your Microsoft Account from any device. If you re-install Windows or change your computer, you can easily download all your files through OneDrive on your new machine without the hassle of migrating data manually. You can refer the article OneDrive on your PC to configure OneDrive. You may also refer Sync files with OneDrive in Windows to sync your files with OneDrive. For additional information, you may refer the article Save disk space with OneDrive Files On-Demand for Windows 10. Hope the information provided by me is helpful for you. Let us know if you need any further assistance, we will be glad to help you further. Regards,Nikhar KhareMicrosoft Community - Moderator","Thanks your answer solves the question how to transfer data from old PC to the new one. My main problem is how do I insert my new PC in my network and be able to transfer files between them."]},{"symptom":"Screen size change access        Help - My screen size has been reduced when I sign on to the point that the EXPAND box normally at the top right of the screen is not accessible. It is not accessible because the screen size is reduced. Can anyone tell me how\/why it has first been reduced and second how may I expand the screen to allow me to increase it's size? Thanks in advance for what must be either a silly question or a simple fix.","solutions":["Hi JRZZZZZ From your question, it is unclear, does a full screen application not fit on your screen, or is there a black border around your screen?Right click your Desktop, choose Display Settings Make sure Resolution is set to the one marked (recommended) then do the same for Scale . . .Close that Settings App Right click your Desktop, on the resulting menu, you should see the Control Panel for your graphics hardware (Intel HD . . etc), open thatOn that Control Panel, look for an Aspect Ratio settings, then try each of the options on that page to see if you can fit everything on your screen . . .","Thank you for your prompt reply. There is a black border (approx 1\" in size) at the top and left margin only. Now you must forgive a lack of expertise to ask - WHERE does one right click on the desktop to find the Display settings? Until I know that answer, I can't apply the balance of your directions. ","Hi JRZZZZZ On your Desktop, you generally have icons for Apps . . etc. right click any spot on the Desktop that is not a file or icon . . .","Many thanks. I was able to follow your directions and my problem is resolved."]},{"symptom":"Item not found, item no longer located in desktop        HiI was working on a Sibelius file last night and saved it to the desktop. This morning when I tried opening it, I kept getting met with the error \"Item not found, item no longer located in C:users\\***\\Desktop. Verify the item's location and try again.\" If I look in Sibelius recent files it is not there. If I try to open it from file explorer it says that windows is trying to locate the file. To locate yourself, click browse. Yet it is not present when I click browse. Does anyone know how to fix this? I was working on this for hours and I would really hate to start again :(Edit: I am wondering if the problem may have been caused because my version of Sibelius (Sibelius ultimate) was not activated at the time? This morning when I opened it, it said it was activated, and I did nothing different ","solutions":[]},{"symptom":"Printer Continuously Prints Same Page - Windows 7        Had an issue where my printer continuously printed the same page without stopping! Probably printed over 100 pages and never stopped!!Didn't really find a straightforward solution, so I thought I'd share here what finally worked for me;1. Pull the paper out of the printer’s paper feeder. This step at least stops the immediate problem and stops wasting paper and ink\/toner!!2. Go to; Control panel ;  Devices and Printers ;  Right click on the offending printer; select “see whats printing”When new window opens, Select “Printer” then “Cancel all documents” When asked “Are you sure you want to cancel?” select “Yes” Close window 3. Go to “Start” Type “cmd” When command prompt opens, type net stop spooler then press enter – close the windowHard reset the printer – turn power OFF, wait a minute, turn power ON Again Go to “Start” Type “cmd” When command prompt opens type net start spooler then press enter – close the window4. If not resolved, turn printer OFF, unplug printer from wall, reboot computer When computer restarts, plug in printer and power printer ON.Now document will be cleared and printing can be done normally. Hope this helps someone. :)","solutions":[]},{"symptom":"activation needs reactivation frequently        I have activated my W10, but frequently I get a message saying I need to activate. If I run troubleshooting, it will activate. why doesn't the activation stay on?","solutions":["To check Windows activation,in run or cmd type:  WinVerAlso,to edit Product Key,R.click my computer\/properties\/look at bottom of new window,it should say:  Windows is Active   If not,change Product key.","Hi billgm42, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Consult the instructions of the Windows MVP that offers alternatives to solve this problem.https:\/\/www.thewindowsclub.com\/windows-10-activ...Let me know if you have something else that I can help you with, I'd be happy to help.Happy new year Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Microsoft Visual C++ Runtime Library Error!        Hello! Thanks for the help in advance. I am literally struggling with this error every time i restart my PC. Ive tried everything from uninstalling all libraries to reinstalling. I have the correct NVIDIA drivers installed and i cannot seem to find an article to assist with this problem. This message never goes away. All of my games run smooth. Please HELP! Thank you. ","solutions":["Hey Jordan My name's Evan an independent adviser. Sweet wallpaper btw. This has been answered in the past I'll get you to follow this link: https:\/\/answers.microsoft.com\/en-us\/windows\/for...It basically shows you how to reinstall your Visual Studio\/ check for errors you may currently have...Please let me know if any of this helps!"]},{"symptom":"URL pops up while hovering over the links in Windows 10 Mail app.        Original Title: W 10 Mail url pop upsHow do I stop URL address popup when hovering over live link in windows 10 mail.  See attachment.  It usually pops up in the wrong place.","solutions":["Hi Charlie, Thank you for posting your query in Microsoft Community. Well that’s an inbuilt feature and there's no option to disable it. Whenever you click on the picture or link mail, that particular link will always pop up.Let us know if you have any further queries about Windows 10.We will be happy to assist you.Thank you.","Why didn't you make it pop up at the bottom of the window like IE? Instead of in the middle of the page.  Attention Microsoft...","Those URL pop ups are extremely annoying.   Please get rid of them.Dick","It may be inbuilt, but I would not call it a feature! Features are supposed to enhance the customer experience and that is not the case here. Sometimes these popups are so large they block the link you want to click or they are so numerous when navigating, that it takes any pleasure out of reading the email. In addition, I can no longer click to go directly to the URL either I have to enter key combination or with touch screen it has added additional options to go to link, copy, etc. I am also seeing object placement indicators (including rotate) e.g. Amazon when I click a button  (even though the objects cannot actually be edited).Whoever thought that obliterating emails with hover popup boxes filled with lines of meaningless URL strings could be of any possible use to the regular User, needs to rethink this \"feature\". ","They are not click on pop ups they are hover pop ups. They are annoying when you cursor over them  to click on something you want to go to. Can't you do something different?WLM is so much better. I can't believe you would go downhill that far with win10 mail!","Those URL pop ups are extremely annoying.   Please get rid of them.DickI agree 100000%.","Windows Live Mail does not have these hover over pop ups. WlM is sooooo much better than W10 that there is no comparison!!!!!","Those URL popups are useless to the majority of users.   You call that a feature?  Windows 10 email app has several built-in (FEATURES?), such as when you delete a message, the next message does not automatically appear in the message window like most feature-less email apps.","Why doesn't Microsoft just get rid of Win10 Mail and keep WLMail?  WLMail has been working just fine for years and with a LOT more features.","Hi Charlie Thank you for posting your query on Microsoft Community. I understand that you are facing issues with Windows 10. I apologize for the inconvenience caused to you.I suggest you to provide your valuable feedback and suggestion regarding the issue in the Windows Feedback app.Let us know if you need any further assistance on Windows related issues and we will be glad to help. "]},{"symptom":"32 bit to 64 bit Windows Home        I have a new 1TB Sata HDD. The old Sata HDD has my windows 10 Home 32 bit installed. Could I use the media creator tool and install Windows 10 Home 64 bit to new hard drive and would this detect the digital license on old hard drive? I know this sounds like it would be too easy.","solutions":["I also already have a 64 bit capable motherboard and cpu and 8gb memory","Hi Bowtie68 the digital license (held on microsoft servers) is valid for 32 bit or 64 bit. although it does require a clean install, you can install the 64 bit instead of the 32 bit.during install, skip the pages that ask for a key, it will activate automatically when you go online.Greg Carmack's article can help in guiding you through a clean install https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"How do I organize my pictures all in one place and keep them that way        how do I organize my pictures all in one place and keep them that way* Original title: pictures","solutions":["how do I organize my pictures all in one place and keep them that wayHere's how I do it:All my pictures are stored in the Pictures folder in my user profile. For you that'sC:\\Users\\your user account name\\PicturesMy pictures are organized into subfolders as I like.Nothing can change this arrangement.In  addition, I backup my Pictures folder to an external drive every day, so I'll never lose my pictures.","tried typing in C:\\Users\\my name \\Picturesand it says its not a recognized command","tried typing in C:\\Users\\my name \\Picturesand it says its not a recognized commandIt's not a command.It's a folder on your hard drive.","Hi, TamiHenderson,In the Pictures Folder located on Drive C:\\ you can organize Pictures by Creating Folders for each category.Example: Summer Vacation, Christmas, Anniversary, etc..Once you locate the Pictures you would like to place in \"for example\" the Christmas folder, you can move or drag and drop them into the newly created folder.Scroll down to Organizing Photos on a Mac or PC. This tutorial shows how to tag photos as well.https:\/\/www.shutterfly.com\/ideas\/how-to-organize-photos\/"]},{"symptom":"Task Manager        Yesterday (Dec. 30th) and again today when I open Task Manager the headings at the top of the window (Applications, Processes, Services, etc.) as well as the Close (X) button are all missing. Right-clicking anywhere on the window has no effect. My OS is Windows 7 Home Premium, Service Pack 1, 64-bitHas anyone else experienced this, know why this is happening or know how to fix this?Thank you.","solutions":["It sounds like your Task Manager has gone into \"Small Footprint Mode\"Double-click just inside\/on the Task Manager Border to bring it back to \"Normal Mode\".Same for Vista and Windows 7.\"How to Switch Between Normal and Small Footprint Mode in Vista and Windows 7 Task Manager\"http:\/\/www.vistax64.com\/tutorials\/114377-task-manager-small-footprint-mode.htmlDouble click on a border of Task Manager to switch between modes.​ NOTE:See the border areas highlighted in yellow below.​Normal Taskbar Footprint Mode:​​Small Taskbar Footprint Mode:​Cheers."]},{"symptom":"MUSIC TRANSFER        CANNOT TRANSFER MUSIC FROM ITUNES TO IPOD USING USB CABLE.  TELLS ME TO \"SCAN THE DRIVE\"AND RE-TRY.   NEVER HAD THIS PROBLEM WITH WINDOWS 7.","solutions":["Hi, DonBomar,Please don't type using all caps. It is hard to read and considered rude\/shouting. Please be considerate of our visually impaired members of which I am one. It just makes it more complicated for me to read. Thank you.Try the steps listed in this tutorial.https:\/\/www.imyfone.com\/itunes-issues\/songs-won-t-transfer-from-itunes-to-ipod\/"]},{"symptom":"How can i cancel payment for Driversupportbill.co        How can i cancel payment for Driversupportbill.co , i dont need this anymore because i dont have this PC longer, and a thank before at this is just the one time to pay, no every month. Thank you for help.Paula","solutions":["How can i cancel payment for Driversupportbill.co , i dont need this anymore because i dont have this PC longer, and a thank before at this is just the one time to pay, no every month. Thank you for help.PaulaContact them or your Bank\/Credit Card Company.@@@@@@@@@@@@@@@@@@@@@@@@I do not recommend that you use any Registry Cleaners, Optimizers, Driver Updaters, Tune -Up utilities, etc.They may do more harm to your operating system than any good that they claim to be able to do.__________________________________________________Device driver:https:\/\/www.computerhope.com\/jargon\/d\/driver.htmYou normally only replace\/reinstall drivers if you are having a problem with the existing ones or you require newer features that a newly released driver for a particular device would give you.A lot of released drivers have never been updated since the year that they were released, but the devices they are for still work correctly.You should obtain your Driver Software from your Computer or Hardware Manufacturer, not through Windows Update (except for Microsoft Hardware Updates), as Microsoft normally does nor have those latest Drivers available as Microsoft relies on the 3rd Party Hardware Manufacturer to supply them.Go to your Computer or Hardware Manufacture's website > Driver and Software Support Section > look up your Computer or Hardware Model number > then your Operating System > locate the correct Drivers > download and install them.Driver Downloads:Acer:http:\/\/us.acer.com\/ac\/en\/US\/content\/driversAdvent:http:\/\/www.adventcomputers.co.uk\/product-downloadsAlienware:http:\/\/support.alienware.com\/Support_Pages\/Restricted_Pages\/driver_downloads.aspxAsus:http:\/\/www.asus.com\/supportDell:http:\/\/www.dell.com\/support\/drivers\/us\/en\/19\/ProductSelectoreMachines:http:\/\/www.emachines.com\/ec\/en\/US\/content\/driversFujitsu:http:\/\/www.fujitsu.com\/us\/support\/Gateway:http:\/\/us.gateway.com\/gw\/en\/US\/content\/drivers-downloadsHP:http:\/\/www8.hp.com\/us\/en\/drivers.htmlLenovo:http:\/\/support.lenovo.com\/en_US\/downloads\/default.page#LG:http:\/\/www.lg.com\/us\/support\/software-manualsSamsung:http:\/\/www.samsung.com\/us\/support\/downloadsSony Vaio:http:\/\/esupport.sony.com\/perl\/select-system.pl?DIRECTOR=DRIVERToshiba:http:\/\/support.toshiba.com\/driversCheers."]}]}