{"windows":[{"symptom":"issues        I recentlky ran a tan on my computer and it states that there was issues with  built in windows applicaions","solutions":["Hello! I am an Independent Advisor, I would love to help you out! What scan did you run? Would you be able to send a screenshot of the message you got?","I recently ran a scan it tells me I have issues with Esent, winstore.app.exe, and Microsoft,phoo.exe","Hello, TamieHenderson,Did you try going to Services AppsLocate the troublesome Apps in the listClick on Each App separately (Winstore then Microsoft Phone, etc..)Select Advanced OptionsSelect Repair\/Reset optionDo this to the other troublesome appsVerify if all is working well when finished."]},{"symptom":"Tottal panic attack. I need help recovering my data from partitioning my hardrive        my windows hasnt been booting for a while but thats not the main reason i post question. Although i hope to resolve that too before jan 14.i was experimenting with linux distros by downloading an iso on a usb , then booting from there on my laptop. All was fine when i was also able to view my data on my hard drive through linux. But this is where i lose my pooh poohi accidently partitioned my hard drive..... completely erasing my personal files !!I did not overwrite the data after the event.i found online. That it is possible  to recover data loss  due to partitioning. I was  in a way releived, but it just seemed like a scam and im not tryna be victimized.please and thank you","solutions":["my windows hasnt been booting for a while but thats not the main reason i post question. Although i hope to resolve that too before jan 14.i was experimenting with linux distros by downloading an iso on a usb , then booting from there on my laptop. All was fine when i was also able to view my data on my hard drive through linux. But this is where i lose my pooh poohi accidently partitioned my hard drive..... completely erasing my personal files !!I did not overwrite the data after the event.i found online. That it is possible  to recover data loss  due to partitioning. I was  in a way releived, but it just seemed like a scam and im not tryna be victimized.please and thank youThis may or may not help you.If it doesn't, contact Data Recovery Specialists, who are very, very expensive.\"TestDisk, Data Recovery\"http:\/\/www.cgsecurity.org\/wiki\/TestDiskTestDisk can run under DOS (either real or in a Windows 9x DOS-box),Windows (NT4, 2000, XP, 2003, Vista, 2008, Windows 7 (x86 & x64), Windows 10@@@@@@@@@@@@@@@@@@@@A word of advice for the future: You should always have your data backed up to at least two external media destinations (external hard drive, DVDs, flash drive) in case of system file corruption and\/or hard drive failure"]},{"symptom":"PASSWORD . . .        On my computer, it was easy to eliminate, the login, lock screen password. Accounts\/login options\/etc. It was very easy to do.I now have another computer. When, I follow the same steps . . . The screen, that pops-upl is just a Windows login screen. I, could have, changed my password. But, that's not what I want. I want to, eliminate it!Any clues? Thanks for reading . . . Jerry","solutions":["Hi Jerry. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.There are two steps to get rid of the Lock Screen and the Log in both: First is to skip the log in screen using this method: https:\/\/www.tekrevue.com\/tip\/skip-windows-10-lo...This takes away the password sign in box, but leaves the Lock screen along with your User account and a Next button:Eliminate the Lock Screen by one of these methods: https:\/\/www.windowscentral.com\/how-disable-wind...https:\/\/windows.gadgethacks.com\/how-to\/disable-...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thanks Greg . . . I really appreciate, all you've done. You have helped me, many times, before!I'm a life-long computer geek. Having, two computers, is wonderful . . . Actually, I have six.But, I'm only using two now, crazy.I copy\/paste, your Forum reply, into an email. Sent it to myself. So, now I have it, on my other,computer.It's late, so I'll work on it tomorrow . . . Thanks again, Greg . . . Jerry","Glad to help you, Jerry. Keep me posted on your progress as I will be here to help until the case is resolved.","Greg . . . I followed your instructions, about removing the password from the login,lock screen. But, during the process, I somehow deleted my account. Stupid of me!Now, I'm locked out of my computer. When, I put in my password, it says, try again.To reset my password, it says I need a DVD drive. But, it's a Dell. They have no DVDdrive. They do everything with USB drives. I do have another Dell, which is what,I'm using now. But, this computer was a replacement. And, I have to send it back.But, I need to get that computer fixed first. It's a catch 22. I'm locked out?I can create a Windows 10 installation, on a USB drive, if that would help? I remember before, when I reset a computer, it just did it thru the WiFi cloud. So, please tell me you have an idea, on how I can fix this?You have helped me many times before. Thanks for reading . . . Jerry","Greg, I give up . . . I created a Windows 10 USB drive install. But, the computer, does notrecognize it. I plugged it in, nothing. I turned it off, with it in. Turned it on, still nothing?I need this computer. It's my favorite. Their must be a way. I'll look for, computersupport groups, in this area. They might, take a look at it? I ran netplwiz, and somehow I deleted my account, or something?Any answers, would help. Thanks for reading . . . Jerry"]},{"symptom":"Updating         I am trying to upgrade to Windows 10 but its telling me that my Windows 7 must be updated.  It hasn't been since 2017","solutions":["Did you ever buy 10 and is your hardware compatible for 10??@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700Cheers."]},{"symptom":"Device drivers        My laptop runs Windows 10.  In the COM port the computer will not recognize a generic USB cable and thus will not recognize the device to which it is attached.  My Windows 10 is up to date.  The device is a Yaesu amateur radio.","solutions":["Hi there My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Is the device Windows 10 compatible? Has any software been installed for the Yaesu device?It may be that the device is connecting on a different port than is set in the software.The following steps will help you determine if the computer is recognising the device.1. Plug device in 2. Open Device Manager: Right-click: Start > Device Manager 3. In the Device Manager list, look in Ports and see if the device is listed against a COM port such as COM1 or COM4.Hope this helps.","It did not solve the problem.  I had used the particular cable to add some additional radio repeaters in this radio a couple weeks ago.  The cable continued to appear in the COM ports until 2 days ago.  I needed to upgrade the underlying programs in the radio and noted that the computer was not recognizing the cable or the radio. The radio is Windows 10 compatible.  I finally downloaded software for another cable model so that I could upgrade the programs in the radio.","Is your issue now resolved?","No, the computer still does not recognize the cable.","Hi KD8ZYW, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.See the steps shared by the Windows MVP on its website. https:\/\/www.thewindowsclub.com\/usb-device-not-r...If they do not work, you can start Windows through a clean boot, it is an error-proof process, so, we can detect if it is any third-party program or driver that causes the problem, also in the same article there is the option of safe mode, both are very similar processes that have the same purpose. https:\/\/support.microsoft.com\/en-us\/help\/929135...Let me know if you have something else that I can help you with, I'd be happy to help.Happy New Year Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I tried another cable that I have and connected it to another device.  Upon doing so, the cable appeared in the COM port.  I then tried that cable in the Yaesu radio but neither the Yaesu or the cable appeared in the COM port.  This leads me to suspect that the problem is in the radio not the driver and computer recognition.","Hi, I understand, it is very possible that it is what is happening, based on the discard that you did with the cable when testing on the other computer.Regards","The problem must be with the radio.  So, I will not try to access it except with the one special cable that was purchased in order to facilitate the operation of the radio through the computer.  Thanks all for your efforts.","Hi, I understand, you're welcome, we're here to help you. Happy New Year"]},{"symptom":"Microsoft gifting error        I can't gift my friend sea of theives, it always pops up with an error when I get done putting all of the information in. ","solutions":["Hi, PrimalGroudo,1. Use this link to contact Microsoft Store Support for assistance. It's possible you have a corrupted profile. They are more able to assist you with your account.You might try creating a new Account then access the store to see if you have to buy something.2. Use this link to log into your account. Select Services and SubscriptionsIf using Xbox Live > Under Paid With > Select Change the way you PaySelect Add a brand new means to paySelect from the options availableIf using a different payment methods does not work, contact MS Store Support using the link I supplied in Step 1."]},{"symptom":"new hard drive, OEM Windows 10 license        Hi,I have a Dell desktop with a pre-installed Windows 10 Home copy.I need to replace the hard drive due to speed \/ noise issues.My question is, if I get a new hard drive, how can I install Windows 10 on it again?And how to ensure that will be a \"valid\" licensed copy?Thanks","solutions":["Hi Simplify,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Minor changes like HD swap do not make Windows activation void. Just do a clean install of the same edition as was before, you would find Windows activated as soon as it gets online. Skip entering the key.How to do a clean installhttps:\/\/answers.microsoft.com\/en-us\/insider\/for...https:\/\/answers.microsoft.com\/en-us\/windows\/for...You can go for cloning as well if you can connect both of those simaltaneously. Let us know if it is the case."]},{"symptom":"windows 10        I operate windows 7 and will be upgrade to windows 10.Does windows 10 still need anti-virus?","solutions":["Windows Defender in Vista\/Windows 7 is an Anti-Spyware Program, not an Anti-Virus Program.But from Windows 8 onwards (8\/8.1\/10) Microsoft upgraded Windows Defender to be an Antivirus and it comes as part of the Windows 8\/8.1 and 10 operating systems.So you do not need to install a 3rd party AV.Windows Defender is quite a good Anti-virus but if you require extra security I suggest that you also add thisfree version of Malwarebytes as an Anti-malwareon-demand scanner, which thefree version is; not a real time scanner which an AV is.Scan with it either once a week or month, depending on how you use your device.http:\/\/www.malwarebytes.org\/products\/malwarebytes_freeCheers.","\"Need\" is too strong a word. If you are an expert in practicing Safe Hex, and never make a mistake doing it, then you you don't need an anti-virus with any version of Windows.But as a practical matter, none of us is perfect, and almost everybody should have an anti-virus program running.Windows 10 comes with a very good antivirus program, Windows Defender. That's a good one to run and it's not necessary to use a third-party anti-virus instead. But I also recommend that you run the free MalwareBytes AntiMalware. which checks for other forms of malware besides viruses.","The only way you do not need an anti-virus is if you do not go on the internet.Drive-by infections occur by simply going to a website where device can become infected.https:\/\/www.kaspersky.com\/resource-center\/definitions\/drive-by-downloadA drive-by download refers to the unintentional download of malicious code to your computer or mobile device that leaves you open to a cyberattack. You don't have to click on anything, press download, or open a malicious email attachment to become infected. A drive-by download can take advantage of an app, operating system, or web browser that contains security flaws due to unsuccessful updates or lack of updates. Unlike many other types of cyberattack, a drive-by doesn't rely on the user to do anything to actively enable the attack."]},{"symptom":"Windows Startup errors        Dear Microsoft community, since i have updated my windows 10 to the latest version im getting the following errors: There was a problem starting startupchecklibrary.dllThere was a problem starting winscomrssrv.dllThis happens only when the windows is starting. Usually i only click OK and everything runs smooth but it simply is annoying.Hope someone has resolved this issue. ","solutions":["Hello! I am an Independent Advisor, I would love to help you out! This is most likely to do with a previously installed software that you no longer have.You should disable any startup items that you do not want to automatically start. You can get to the startup items by right-clicking the taskbar > task manager > startupLeft-click anything on the list then click \"disable\" on the bottom right. Disable anything that you do not want or use as this also can speed up your boot speed.Then restart the computer. If the errors still pop up then I would recommend disabling every startup item and restart and see if the error still pops up.Let me know what you find!","Hey Thagstrom,Thanks for your replyHere you have attached image of the startup panel and only thing that i turned on is the Realtek Audio Manager, even after disabling it i still have the issue with the errors on start up","Open command prompt by right clicking on it and select open as admin. Then run these commands one by one: sfc \/scannow DISM.exe \/Online \/Cleanup-image \/Scanhealth DISM.exe \/Online \/Cleanup-image \/Restorehealth DISM.exe \/online \/cleanup-image \/startcomponentcleanup You can also download and run this tool: https:\/\/docs.microsoft.com\/en-us\/sysinternals\/d...Run it and look if anything is named either of the .dll's you are getting errors for. Unselect them.Restart and see if the error comes up again.","I might suggest performing, \"Disk Cleanup,\" on a periodic basis, especially after every MS update and upgrades. ","I did the autoruns software and i see the errors here as attached on the photo, should i unselect them? ","Yes, uncheck them and then restart the computer.","Solved :D Thank you very much Thagstrom, appreciated, hope your effort helps  the community.Kind regardsIvan Pajmakoski","Glad to help! When ready please mark the post which helped most as the Answer, to help others. A rating is also appreciated.","I had the same problem and this is caused by Windows Defender quarantining those DLL files.In my case StartupCheckLibrary.dll was a severe level executable trojan horse.  I didn't have winscomrssrv.dll as you did, but another exe file.Windows Defender quarantined the actual file which is a threat, but it didn't remove it from the task scheduler that runs it. That's why it showed up as an error in the first place."]},{"symptom":"Mouse Scroll not working to scroll pages. only can Change the Volume control. How to fix it?        Original Title: Mouse scroll wheel only adjusts the volume. How do I get it to scroll pages again?Using wireless mouse (Silvercrest MTS2218-m with win 7 x64) and scroll wheel no longer scrolls page up and down in any program. It only adjusts the volume. How do I get it to scroll pages again?Have already checked settings in control panel>mouse nothing obvious there to change this annoying feature. And have already uninstalled mouse driver in device manager but no change. have also shut down and started up laptop several times.","solutions":["Near the scrolling wheel is a dpi button, which also can be used to switchbetween normal and media mode by holding it for 3 seconds. In the media modethe wheel controls the volume and does not scroll.Read the manual...   ;-)","Hi, 1.     Have you checked whether the mouse works fine on a different system?Try to connect the device to a different computer and then check.If the issue persists, I would suggest you to contact manufacturer for further assistance.Thank you. "]},{"symptom":"Swapping Hard Drives, One Using Windows 7, other using Windows 10        I Have been using my Windows 7 laptop for 4 years, I heard about Windows 7 not begin supported after 1\/17\/20, So I went and got a laptop hard drive from a computer that just died from a fried capacitor, this laptop was running Windows 10. Here are my questions.If I swapped my Windows 7 drive for the Windows 10 drive, would It boot to Windows 10 on the old laptop or would it be corrupted?Would It affect my BIOS?Would my computer crash?Would I not be able to boot up my computer?If I wanted to go back to my Windows 7 drive, would everything be back the way it was?Laptop: HP Elitebook 8440pDonor laptop is also an HP","solutions":["1. You can't take a hard drive with an installed operating system on it > put it in another device and expect it to boot into Windows.The installed operating system on the hard drive from the Windows 10 device also has the drivers for that Windows 10 device's motherboard installed on it.And no you can't change them.You have to clean install 10.2. But now we come to Windows Licensing, as to whether you can transfer that Windows 10 license or not.You do not tell us what type of License you have.If the Laptop\/Computer came with the Windows Operating System preinstalled (Dell, HP, Acer, etc) , that Product Key that came with the Laptop\/Computer is for the preinstalled OEM Licenseand is non-transferable.The OEM License\/Product Key (preinstalled Operating Systems on Dell, HP, etc machines) is tied to the first machine it is installed on and dies when that machine dies.The above rule also applies to OEM System Builders Licenses.Retail Operating System License, that you buy and install yourself, are allowed to be transferred to another machine.But Retail Licenses can also only be installed on one machine at any particular time.Cheers.","The first thing to do is check if HP has Windows 10 drivers for the system you want to keep.Go to the HP Support site, enter the Serial Number and see if there are Windows 10 drivers offered.A first glance with a general search for Elitebook 8440p shows HP does not have Windows 10 drivers for that model but you should check by Serial Number and if you don't see it you can ask in theHP online Community to be sure:","You do bother checking if HP has drivers at all if the 10 license is OEM, as you can't transfer the license from one device to another anyway.","See Bill Smithers's reply to your questions, and let me add the following:Yes, Microsoft is about to drop support for Windows 7. However that does *not* mean you can no longer use it. It means that they will no longer provide updates to it. If you are happy with it, there's no reason why you shouldn't stay with it. Just be sure to run third-party security software that's kept up t date.","If you're looking for information for home users, see Windows 7 support will end on January 14, 2020.With end of support Microsoft is not telling you that your operating systems won't work.What they are saying is that after a certain date they will no longer support them.Whether they still work or not with particular programs is up to the particular program manufacturers.Example: Google Chrome is no longer supported for security updates in XP or Vista by Google and Mozilla Firefox is following the same path.What this basically means with Microsoft no longer supporting an operating system is that even though hackers may find \"holes\" and vulnerabilities to be able to access the operating systems and cause security problems, Microsoft will no longer be monitoring or rectifying those problems by way of Security Updates each month.You are on your own in regards to maintaining the Security of your operating systems.What does it mean if Windows isn't supported?____________________________________________________This will show you when support (Mainstream and Extended Support) for the various operating systems ends.Windows lifecycle fact sheet - Windows Help - Microsoft SupportAnd these FAQs show you how Microsoft arrived at the Support Lifecycle Policy:Microsoft Lifecycle Policy FAQhttps:\/\/support.microsoft.com\/en-au\/help\/17140\/lifecycle-faq-general-policy-questions@@@@@@@@@@@@@@@@@@@@@@@"]},{"symptom":"Can't type quotation marks (\")        Hi,Normally when using US (International keyboard) settings, typing [ Shift + ' + Space ] gives you [ \" ]. However, for me both typing [ ' + Space]  and typing  [ Shift + ' + Space ] all give me [ ' ]. In order to type a quotation mark, my only option is to type [ Shift + ' + ' ], which gives me [ ' \" ], and then I can delete the single quote. I have tried different keyboard settings, but they don't fix the problem. Does anybody know how I can fix the issue? Please, feel free to ask for any additional information if needed.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We appreciate your effort on this. We understand that you are unable to type(“), when using US (International Keyboard). Ideally, if we press Shift key + ‘ + Space, we should get“. However, as this is not working for you, we can try the steps mentioned below and see if that helps: Method 1: On-Screen keyboard You can try using the On-Screen keyboard and see if you get a different results. To open On-Screen keyboard, typeosk in the search bar on the Taskbar and hit Enter. Method 2: Reinstall US (International keyboard) We can try to uninstall and reinstall the US (International keyboard) and see if that makes any difference. Refer the steps mentioned below: Press Windows key + I, to open Settings.Click on Time & Language and click onLanguage on the left pane.Now, click on English (United States) language pack and selectOptions.Click on United States–International and click onRemove. (If Remove button is greyed out, you might have to add one keyboard and then remove the International keyboard).After removing the keyboard, click on Add a keyboard and selectUnited States-International. Method 3: New user account To eliminate possibilities, we would suggest you to create a new user account, add the US (International keyboard) and check if the issue persists. Please refer the articleCreate a local user or administrator account in Windows 10. Let us know the results. Regards,Nikhar KhareMicrosoft Community - Moderator","Hi Nikhar,Thank you for your thorough response. I have tried out the options you suggested. I was aware of method one, however for day-to-day writing this is not a viable option for me. I cannot have the on-screen keyboard open for everything I want to type. Method 2 and 3 both did not work for me. I removed the keyboard and added it again, rebooted the system but the problem persisted. Also I have created a secondary Microsoft account for the purpose like you suggested, but in both accounts the problem remains. I know it is not a hardware or driver problem because it has not always been like this. My laptop came with Windows 10 pre-installed and it worked fine. Later I installed a secondary keyboard layout (Russian), however I have always kept the US International one installed and removed Russian again. I am not sure if the problem originates from this, but it might, if that is any help for finding a solution.I have not been able to solve the problem so far.","Hi, Thank you for replying. I apologize for the delayed response.  We would like to know the make and model of the computer that you are using. If you are using a laptop, we would suggest you to check if any hotkey applications are installed on the computer. Regards,Nikhar KhareMicrosoft Community - Moderator","Hello,Not a problem. I am using a laptop, an acer aspire e5 573-598f running Windows 10.There are no hotkey applications installed. There are only the laptop native Fn Function keys, however the corresponding keys don't have any additional functions in this (F1-F12 and arrow keys etc. have additional functions). ","Hii am totally mystified why Microsoft has tried to get so smart about typing a \"\".  Why not simply insert the character when you push down the key?  What possible advantage is there to all this fancy finger work to do something so simple?by the way I have been unable to find the setting where I can get out of the international keyboard - none of the guidance on the web worksVery frustrated and irritated as this is such a ridiculous invention!","I agree. The simplest approach (and the one that worked perfectly well for decades) was to type Shift+\" to make the opening quotation mark appear, input the text you wanted to include inside the quotation marks, then type Shift+\" to make the closing quotation mark appear.The 'new and improved' method mandates typing Shift+\"\", moving the cursor left to insert it between the quotation marks, inputting the text you want to include inside the quotation marks, then moving the cursor right to clear the quotation marks. An increase in complexity for no gain. I'd like to know the rationale for this. I'd like it even better if the process reverted to the older, simpler method."]},{"symptom":"Win 7 to Win 10 upgrade continues to fail and many weeks of trying         After all suggested fixes and workarounds (antivirus, USB peripherals, clean boot, disk space, ScanHealth\/RestoreHealth, removing bad manifests, all of that, over and over), I get the same error message: 0x800704B8-0x3001A The installation failed in the FIRST_BOOT phase with an error during BEGIN_FIRST_BOOT operation. My biggest challenge, perhaps, is that I don't know how to interpret the log files. And apparently, neither do the Microsoft tools I've used that are supposed to do just that. So in the hope that a nice Microsoft expert has time on his or her hands, sees my post, and wants to take a peek at my log, I've provide it here:  https:\/\/1drv.ms\/u\/s!AjUc6e8QX2MOgS7jqFLtsNZ6hKcqI'm on Windows 7 Pro OS, on a machine that I built myself in 2016 with all new components and an AMD64 processor. Each of my older, smaller, slower machines at home are already on Windows 10, so there's no doubt that my system can handle the upgrade. If I cannot find a solution on this forum, I will have to go through the arduous task of installing as a new system and then reinstalling all of my many dozens of applications. I hope to not have to do that, as I bought Windows 10 directly from Microsoft and would expect that the thumbdrive they sent me would simply do the upgrade I paid for. (Call me naive.)Thanks, anyone. ","solutions":["It looks like you have a situation with a Security Template not being applied to the upgrade.  I have seen this before but have not found a solution.  You can do some research to see if you can find something.I did see one thread which suggested it might be due to the origin of your install.  Was Win 7 installed cleanly or is it a cloned drive or a Deployment type situation?  Is it an OEM install of some type? My Win 7 system handled the Security template fine but I will do some more research regarding exactly what might be happening.  I was upgrading a Win 7 Ultimate to Win 10 Pro..  If you are on Win 7 Pro, that might make a difference but something to check on.Cannot apply the security template for the new OS. Error: 0x800704B8Operation failed: Upgrade security. Error: 0x800704B8[gle=0x000000b7]Operation execution failed: 26. hr = 0x800704B8ExecuteOperations: Failed execution phase Pre First Boot. Error: 0x800704B8Hopefully, you have an image backup of the Win 7 system?  If you are on Win 7 Pro, that might make a difference but something to check on.","Hi,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.The setuperr.log you shared was uncommonly very large which usually isn't seen. It might mean there are multiple things playing a role. The last two things I noticed were a connected standby display problem and Security template failed to apply. Setupact should give more insight with rollback logs. I would look at both tommorow and post back.Let us check the Installation log to find why the update failed. Please share the logs as mentioned in this article. You should use a File sharing service like Onedrive or Media Fire to upload files and share the link in the next reply.https:\/\/answers.microsoft.com\/en-us\/windows\/for...The Panther logs. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\PantherThe Rollback logs: These usually are created if Windows Update rolls back. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\Rollback[Only if the error code is 0xC1900101-0x30018] The Device Install Log from C:\/$Windows.~bt\\Sources\\Rollback\\setupapi\\setupapi.dev.logAs the log size might be large consider zipping before uploading.","Was Win 7 installed cleanly or is it a cloned drive or a Deployment type situation?  Is it an OEM install of some type?Thanks for this. I'm inclined to say that my current OS was cloned, as I definitely had a system before that. Not sure if I documented the software update back in 2016. (Hardware is well-documented with receipts from Newegg.) I will pursue the Security template angle. Never heard of this, so my prior research is incomplete.","Let us check the Installation log to find why the update failed. Please share the logs as mentioned in this article. You should use a File sharing service like Onedrive or Media Fire to upload files and share the link in the next reply.Thanks for this. The zipped files are here: https:\/\/1drv.ms\/u\/s!AjUc6e8QX2MOgS9TTihfmm0P-u9p?e=qAA0ylI'll also research the Security template issue, as both you and Saltgrass pointed it out.","Thanks Joe, as Saltgrass said, we haven't made much progress in decoding certain upgrade failures, and yours is one of them.2019-12-28 13:15:07, Error                        InstallSecurityTemplate: Error in processing upgrade template. Error: 0x000004b82019-12-28 13:15:07, Error                 SP     Cannot apply the security template for the new OS. Error: 0x800704B80x800704B8==> An extended error has occured. Two things I can suggest to you which might rectify this: 1. Turn off Secure boot in BIOS settings. 2. Do a clean boot and try again. https:\/\/support.microsoft.com\/en-in\/help\/929135...Let us know how that goes.","I have been looking at this some more.  I still can't say for sure what is the primary failure of the upgrade.  Some errors may be the result of another problem which triggers the failure.  You also have the \"Cannot Create Hardlink\" error which I have seen in several failed upgrades.But a question, do you have your personal folders on a different partition than your OS partition?  I have never done that myself and as far as I know, that is allowed but I will need to check if it could be a problem for an upgrade.","...do you have your personal folders on a different partition...Yes, I try to keep only the OS and installed applications on C: drive. Whenever I can, I direct stuff, including Documents and other Libraries to another virtual drive. ","Sorry Joe, sometimes I just sort of think out loud and put something in the thread in case it might be relevant.Since you have Win 7 Pro, you are using different install media than other folks.  When you download your media, it includes the Work Station images since Win 7 Pro is multi-processor capable. Your upgrade is using the Win 10 Pro image to install but I was wondering if you download the media and do it for another system, if the image you got would be different than the one you have.....  Would it give you an incompatibility warning if you used that media...?Edit:  I just noticed you say you bought the media from Microsoft..  Not sure why you paid for it but maybe that is why you have the larger image.  You might try just downloading yourself and creating the flash drive for the install.","Edit:  I just noticed you say you bought the media from Microsoft..  Not sure why you paid for it but maybe that is why you have the larger image.  You might try just downloading yourself and creating the flash drive for the install.I paid for 10 because I thought I had to. Didn't the free upgrade offers go away? But anyway, I'm proceeding as you suggest, and am using the download from Microsoft. If I need my 10 key, I'll have it. If I need my 7 key, I'll have that too. ","...we haven't made much progress in decoding certain upgrade failures, and yours is one of them. ...1. Turn off Secure boot in BIOS settings. 2. Do a clean boot and try again. A dubious honor to be undecodable. Not sure I'm ready to mess with the BIOS just yet. Maybe as a last resort after I try the upgrade from MS website rather than from the MS thumbdrive.Further info from diagnostics seems to imply that BIOS might be just fine(?):SetupDiag was unable to match to any known failure signatures.System Information:Machine Name = EDITINGTOWER-PCManufacturer = Gigabyte Technology Co., Ltd.Model = Z97X-SLIHostOSArchitecture = 1033FirmwareType = PCATBiosReleaseDate = 20150918000000.000000+000BiosVendor = BIOS Date: 09\/18\/15 15:47:46 Ver: 04.06.05BiosVersion = F9HostOSVersion = 6.1.7601HostOSBuildString = 7601.24540.amd64fre.win7sp1_ldr_escrow.191127-1706TargetOSBuildString = 10.0.18362.1 (19h1_release.190318-1202)HostOSLanguageId = HostOSEdition = ProfessionalRegisteredAV = FilterDrivers = FileInfoUpgradeStartTime = 12\/28\/2019 11:52:29 AMUpgradeEndTime = 12\/28\/2019 1:15:07 PMUpgradeElapsedTime = 01:22:38CV = ReportId = a9376132-a088-4c32-8221-60bfa5d888c6"]},{"symptom":"Minecraft Windows 10        I purchased Minecraft for Windows 10 for my daughter, there is no link to get her to sign in only an order number.  She cannot log in, so far a bummer of a Christmas present....","solutions":["Hi, Purchases are tied to the account. So the download and login for the game should be handled by logging into the account it was purchased on or gifted to in Windows.I hope that helps."]},{"symptom":"usb microscope Carson eFlex?             How do I turn on and operate my Carson eFlex microscope on my HP laptop?George Forest","solutions":["Hi, You need to download the software (incl the driver) for this from the manufacturers website. It looks like this is the Microscopehttps:\/\/www.carson.com\/products\/eflex-mm-840\/? In which case you can get the software fromhttps:\/\/www.carson.com\/customer-support\/software.I hope that helps."]},{"symptom":"Help me        I have windows 7 32 bit operating system,x86 based pc...can i upgrade it to windows 7 64 bit?When i go to performance information and tools it says that [64 bit capable=Yes]","solutions":["Microsoft no longer sells 7.And support for 7 ends in 15 days time anyway.@@@@@@@@@@@@@@@@@@@@@@@@@@32bit > 64bit is not done by any upgrade.It is done by a clean install.Retail Windows 7 licenses can use 32bit or 64bit (but not both at same time) for free.OEM licenses are for the bit architecture that they are bought with.If you want to change it, you have to buy it.It requires a clean install of the operating system.Save all your data and be prepared to reinstall all your 3rd party programs.Then do a clean install:http:\/\/www.sevenforums.com\/tutorials\/1649-clean-install-windows-7-a.html_______________________________________________But before you attempt it, check with your computer\/laptop manufacturer to make sure that they support and supply 64bit drivers for your machine and for the edition of Windows 7 you are licensed for.Also check your computer specs to see if you have or can upgrade to at least 4GBs of RAM, as without at least 4GBs of RAM you are wasting your time installing a 64bit version.Or it may be easier for you to download the Crucial Scanner which will tell you what is the matching RAM for your Motherboard and the max. amount of RAM your Motherboard can accommodate.Crucial System Scannerhttp:\/\/www.crucial.com\/usa\/en\/systemscannerCheers.","Does clean installing removes all of my files in my pc?...if it does..can i install a software that can backup my files?","Yes it does.As I said:It requires a clean install of the operating system.Save all your data and be prepared to reinstall all your 3rd party programs.To back up your data all you need is a USB flash drive or a USN external hard drive and either drag and drop the files across, or copy and paste them to the external drive","So i cant use any backup software?...only hardwares","So i cant use any backup software?...only hardwares Windows 7 has backup software, but it is totally unreliable.And if you back something up, where do you think you are going to save it to?You don't normally save it to the hard drive on the computer, even in another partition, as the hard drive might fail.You should always have your data backed up to at least two external media destinations (external hard drive, DVDs, flash drive) in case of system file corruption and\/or hard drive failure","Can you give me the step using ISO image?","Can you give me the step using ISO image? There is no use giving you anything as you never told me what type of license you have.If your Windows 7 32bit license is OEM preinstalled (Dell, HP, etc.) you can't change from 32bit to 64bit for free.If it is OEM System Builders license you can't change from 32bit to 64bit for free.If you bought your own Windows 7 license it should have come with both 32\/64bit disks for you to choose which one to install.__________________________________________I gave you this but you never replied to it:Retail Windows 7 licenses can use 32bit or 64bit (but not both at same time) for free.OEM licenses are for the bit architecture that they are bought with.If you want to change it, you have to buy it.","Thanks anyways ...i really like this community😉👍","All you have to do is answer my question about type of license you have.There is no use giving you all the details of how to do it if you can't do it if you don't have a license to do it.","No. There is no way way to change the \"bitness\" of any version of Windows from 32-bit to 64-bit, or vice-versa. The only way to get there is by doing a clean installation of 64-bit Windows. Doing a clean installation means losing all your data files and installed programs. You can recover your data files by first backing them up to external media, then restoring them after the clean installation. But you can't recover your programs; they will need to be reinstalled from their original media .Why do you want to do this? Depending on what you do with your computer, there may be little or no value to you."]},{"symptom":"Black display after Windows 10 1909 update        I decided today to do a windows update and the windows 10  1909 ed was proposed. I accepted and waited long but I have lost my Lenovo T430 display: it seems nealy black and I cannot see and do any action. Please help me as before the PC was workong perfectly. Thanks","solutions":["Hi, This sounds like your Graphics Settings may have changed to something not supported by the display. It's worth trying a couple of things to see if this is the case. Try restarting your graphics driver with Win+Ctrl+Shift+B the screen should flicker for a second while it restarts. If this doesn't work check your display resolution and refresh rate in safe mode.I hope that helps."]},{"symptom":"Tablet Email just stopped receiving and sending  Emails        Hi , I just bought  a Samsung tablet set it up with all my details but now I can't receive Emails at all Cant send any and cant receive any cant get my head around this what do I need to do Thanks ","solutions":["Hi , I just bought  a Samsung tablet set it up with all my details but now I can't receive Emails at all Cant send any and cant receive any cant get my head around this what do I need to do Thanks You have posted to the Vista operating system forums.You would not have Vista on a new Tablet."]},{"symptom":"Window 7 to Windows 10 Clean Install Key Not working        I have several computers to move to Windows 10 Pro.  I want to do a clean install.I have downloaded the .iso file onto a USB drive.I went through the loading and selected to add product key later.It does not activate automatically if I enter the Windows 7 Product key it says it does not work.","solutions":["@@@@@@@@@@@@@@@@@@@@@@You may or may not still get 10 for free.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@"]},{"symptom":"large toolbar at top of screen above the https box        I have no idea how to pull up the \"toolbar\" if that is what it is called I have went  to settings and cannot figure out how to get rid of this also the bottom tool bar is too fat but not as bad as the top toolbar it is effecting how I play my games and read my email etc.... The top is 2 inches tall and above the https search line","solutions":["I'm not really sure what you mean, but please try this: Press the F11 key on your keyboard.(Don't like the results - just press F11 again to go back to what you had before.)","Hi where are you seeing these toolbars is that in the Edge browser, if so on the top toolbar, to the right of the thumbnails click the up arrow to hide that toolbar...","when I do that it just lightens the toolbar it doesn't reduce the size","do I have to be in the browser to do this cause I dont see a thumbnail in this site","Cna you please provide a screenshot of what you are seeing on your screen, and we can provide you with a solution...","how do you do a screen shot??? I have never done that before...sorry","Hi chiggerz Click your Start Button, type snip and hit Enter - this will open the Snipping Tool or Snip and Sketch (depending on your version of Windows 10)Set Mode to Full Screen, then click New to take a screenshot Save that file to your Desktop and close the Snipping Tool Then in your next Post, click the second last button on the toolbar above your post to select that image and upload it to your post . . ...","the gray area is 2 inches tall","Click the arrow indicated below to remove that 2 inch area . . . .","Click the arrow indicated below to remove that 2 inch area . . . ty ty ty so more I haty ty ty some more I have been going insane trying to figure it out "]}]}