{"windows":[{"symptom":"Windows 10 update 1803 to 1909 failed        Hi, I have tried everything that is suggested like removing the softwareDistribution directory and running repair,  troubleshooting but the update always failed around 60% of the update.   The update will rollback.   How can I resolved this problem.  Thank you. ","solutions":["Hi KAKueh Click the link below, then click 'Update Now' on that page to immediately get 1909 and bring your PC right up to datehttps:\/\/www.microsoft.com\/en-us\/software-downlo...If you encounter any trouble with that 'Update Now' link, then with these major upgrades, the most successful method is to upgrade from the Windows 10 ISO - you download the ISO and then perform an Offline UpgradePlease Note, follow the steps, this is then just an update and your files and applications will remain untouched . . .Click this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), then choose ISO, not USBWhen the ISO file completes downloading Disconnect from the Internet Temporarily disable any 3rd party Anti-virus you may have installed Then, in Windows File Explorer, double click the ISO and then run Setup.exe to begin the upgrade . . ."]},{"symptom":"Generic audio driver detected        I have windows 10 home and I was having some issues in playing audio through external devices such as headphones. So I ran troubleshooting process and I got the message \"generic audio driver detected\". Although now I don't have much problems in playing audio but every time I run the troubleshooting process I get the same message. There are minor issues like sometimes the audio comes after a delay of few seconds and sometimes when I start the windows, the \"base\" effect kicks in after a while. Apart from this my audio is working just fine but I am still getting the message. I tried searching about it on the internet but didn't get any solid answer. Should I be worried about this ?? I have attached the image of the result of troubleshootingAny help would be appreciated.Thanks","solutions":["Hi, thanks for posting your question in the community! My name is David, I am an independent advisor and I am here to help you.The message sent by the troubleshooter tells you that you have a generic sound driver installed in your system, which in most situations should not be a problem, but if you have any incidents, I recommend you update the driver following the instructions in the following link https:\/\/support.microsoft.com\/en-us\/help\/402844... Another way in which you can update the sound driver is by entering the official page of your OEM and downloading and installing the driver corresponding to your PC model.Let me know if the information has been useful or you still need more help with your query, I will be waiting for your response.","Hi, thanks for posting your question in the community! My name is David, I am an independent advisor and I am here to help you.The message sent by the troubleshooter tells you that you have a generic sound driver installed in your system, which in most situations should not be a problem, but if you have any incidents, I recommend you update the driver following the instructions in the following link https:\/\/support.microsoft.com\/en-us\/help\/402844... Another way in which you can update the sound driver is by entering the official page of your OEM and downloading and installing the driver corresponding to your PC model.Let me know if the information has been useful or you still need more help with your query, I will be waiting for your response.Hello David, thanks for your response. I have already tried updating the audio driver but it said that the latest driver is already installed. So far I haven't faced a serious problem but sometimes while playing a video, the video keeps on playing but the sound accompanies the video after a delay of few seconds and the video stays mute for those(very few) seconds. And sometimes when I start my system the bass effect comes a few seconds later in the audio. Both of these problem occurs while playing audio through an external media such as earphones or headphones.First I thought that the problem is with my headphones but it happened with every device.Also my battery has lived out its life and I am getting message that I should replace my battery. So, is it possible that these problems are a result of that ? Also can you please explain to me what exactly is a generic audio driver. Your help is much appreciated.Thanks Naman"]},{"symptom":"cannot access desktop icon settings        i am unable to acess desktop icon settings beacuase windows says it doesnt have permission even though im the administrator what do i do?","solutions":["Hi Hexagon2512 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.1. Press the Windows key then press enter. 2. Type \"Run\" press enter. 3. Type in. Rundll32.exe shell32.dll,Control_RunDLL desk.cpl,,0 I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"Wireless Connection Problem: Cannot connect to some WiFi network but was able to connect to it earlier        Hi,I'm not able to connect to some WiFi networks which I was able to connect to earlier. I can successfully connect to other WiFi networks so I don't think it's an hardware issue. I didn't update my system or did anything that might cause this problem.I tried all the steps given in this articlehttps:\/\/support.microsoft.com\/en-us\/help\/10741\/windows-fix-network-connection-issues#1TC=windows-10I was able to connect to my WiFi properly untill yesterday, and suddenly now it started giving me an error of 'Can't connect to this network'I also tried disabling my firewall and antivirus but that didn't help, I also tried reseting the network, restarted the laptop like a hundred times, tried updating the network adapter driver, still the problem persists.I am able to connect to the same network via different devices including other windows 10 laptops and android and ios devices.Please provide me with steps to resolve this problemThanks","solutions":["Hi SagarRaisinghani,probably the network administrator of your school has set restrictions on the network, so access is allowed only to some devices.The mac address of your pc may be in the list of blocked devices that are not allowed access.You must contact the management of your college."]},{"symptom":"Mouse without Borders encryption keys         Gentlemen:       We love the mouse without borders and would like to use it in our  environment.  However, since different users are going to use the same computer.  Is there a way to hard code an encryption key for a pair of machines for all users that log into that machine? Looking for less of a per user setting and more of a per PC settings in regarding static Security Keys. Thanks","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query related to Mouse without Borders encryption keys to connect between computers. We do have a dedicated forum, where you should be able to find support related to your query. Let me help you in pointing towards the right direction, I would suggest you to post your query onTechNet forums, where we have support professionals well equipped with the knowledge on Domain Environment to assist you with your query. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Arc mouse connected but not working\/responding        I purchased a Microsoft arc mouse yesterday and it worked properly for one day (to be exact, 10 minutes), but then the next day the laptop says that it is connected but it never responded or worked. I tried to reconnect and restart my Surface pro 6 multiple times and it didn't help at all so i went and swapped for a new mouse, the same problem occurred. The same happened to my Surface pen as well, but it did work properly for a long time.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues while using Microsoft Arc Mouse on your PC. For further clarity on the issue, please respond to the questions below: Which build version of Windows 10 are you using currently?Are you aware of any changes made to the PC prior to which you weren’t facing this issue? Refer the article Which version of Windows operating system am I running?Meanwhile you may want to refer the articleTroubleshoot problems with your Microsoft mouse or keyboardand see if that helps. In addition, you can try updating the Bluetooth Drivers for your Microsoft Surface Pro PC and see if that helps. The drivers can be downloaded fromMicrosoft website Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Problem downloading Halo: Reach MCC edition purchased from Microsoft Store on PC        Receive a Halo Reach Key for my birthday and proceeded to activate game on Microsoft store on my Windows 10 computer with said key. However when I click \"Install on my devices\", I am told that I do not have any applicable devices linked to my Microsoft accout. I proceed to link my user account on my pc to a Microsoft account by follow the directions given to me by the help page linked with the message, but it did nothing to help my issue. If there is not a clear way to resolve this issue, I would like a refund for the game, please.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues while installing Halo REACH on your PC, and I certainly appreciate your efforts in trying to resolve the issue by following certain troubleshooting steps. Let’s try couple of troubleshooting steps and see if we can fix the issue.  Method 1: Try resetting the Store and see if that helps. Press Windows key + R. This will openRun. Alternatively, you can go to Start and search for ‘Run’.In Run dialog box, type ‘wsreset.exe’ and hitEnter. Note: A blank Command Prompt window will open, and after about ten seconds the window will close and Microsoft Store will open automatically. Method 2: Run the Store App troubleshooter to identify and fix problems. Press Windows + I key together to openSettings.Click on Update &Security and then click on Troubleshoot.On the right hand pane scroll down and look for Windows Store Apps.Click on it and select Run the troubleshooter.Follow the on-screen instructions. Method 3: Run the PowerShell command to re-register store. Press Windows + X keys together and click onWindows PowerShell (Admin).Now type in the command and hit Enter:Get-AppXPackage *WindowsStore* -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register “$($_.InstallLocation)\\\\AppXManifest.xml”}Restart the PC. However, if you are looking for a refund of the game then, you can get in touch withMicrosoft Store Support and they will assist you further with the refund query. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Linking My iPhone        Hello,I want to link my iPhone to windows 10. So when I go to 'Your Phone' app, I select iPhone> link the phone; but a message pop up stating \"You will need a new app to open this ms-cxh.\" Then, when I go to the windows app store, there are no results coming up for ms-cxh. Please, would mind helping me? Thanks.Allen ","solutions":["Hi Allen According to the Microsoft website, the 'Your Phone' App does not currently support iPhones, it just supports Android Phones, please see the details on this page:https:\/\/support.microsoft.com\/en-us\/help\/4531293"]},{"symptom":"New Computer        Hey guys. I am still getting used to gaming on a desktop computer. These the two drives, my OS system is installed on the SSD drive, which is also where my games are being installed. How do i install my games into the storage drive? Will it allow me to do so? For both Xbox game pass games and Steam (other related game providers)","solutions":["Hi BioticWolfClaw You can set your system to install all games on the data drive, here is the best setup for a system like yours with a small SSD and large data drive . . .1. Move all your User Library folders to D: Open Windows File Explorer In the right hand pane, right click your Documents folder and choose Properties Select the Location tab In the Location box, type D:\\Documents then click Apply and Ok When that move completes, do the same for Pictures, Videos and Music Each time, provide a new folder location, for example, Pictures will go to D:\\Pictures2. Move the location of all future content downloaded from the Microsoft Store Open the Settings App (gear icon on your Start Menu) Go to System - Storage - Change where new content is saved: Change all options you find there to D 3. If you are a Steam Gamer Stop all processes associated with Steam Move the Steam folder to your D drive manually Then open the Steam Control Panel and point that to the new location 4. Please Note: this should ideally be done before you begin installing any softwareFor 3rd party applications, some will allow you to choose an installation location, for those, create a new Program files folder on your D drive, then for each application, create a new sub-folder of that folderOther 3rd party applications will not allow you to change the installation location, and there is no safe way to move those to your D drive . . ."]},{"symptom":"Adobe Flashplayer 11.3        1. I have Windows 10 installed on my PC.a. Does it include the programme Adobe Flashplayer ?b.  If so , which version?2. I also have Google Chrome - which works well:a. Do I have to de- activate it before I can install Adobe Flashplayer 11.3 ?b. If so, please show me step -by -step how to do this3. The South African Revenue Service requires that i send my tax returns via Adobe Flashplayer 11.3.1 If it is already installed :,   a. Show me where to find it     b. Show me how to activate it 3. The SARS offered to send it via email so that I can install it GRATIS:    a,. I  tried to download & install the Adobe Flashplayer 11.3.d the link they sent,but it did not work.    b. Is it perhaps so because of  my existing settings on my computer that BLOCK(!!!) the Adobe Flashplayer 11.3.Please assist.Kind regardsE C LUBBE SOUTH AFRICA*** Email address is removed for privacy ***","solutions":["Hi Elizabeth The Flash Player should already be installed on your PC, though these days it is turned off by default . . .The current version of Adobe Flash Player is 32.0.0.303, so if they are asking you to install version 11.3, that is a very old versionHere is the official link to download Adobe Flash Player https:\/\/get.adobe.com\/flashplayer\/However, you may not need to do that . . . Open Chrome, at the top right, click the 3 dots and choose Settings On the left, click 'Privacy and Security', then on the right, expand 'Site Settings'In there you will find the settings for the Flash Player, which is turned off by defaultSet that to 'Ask First' that should allow you to access websites that use the Flash Player . . .________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]},{"symptom":"Windows 10 Two thirds size window plus replica mini window        Help!  When I open a new window it is not taking up the full screen, just about 2\/3rds.  And there is a smaller replicate window above it.  Each new window opened has a smaller replica window.  All of these smaller windows are in a row at the top of my screen.","solutions":["Are you viewing the Edge browser and seeing the tab previews? An explanation of that feature is contained on this page:https:\/\/community.windows.com\/en-us\/stories\/mic.... Bring up the previews (or hide them) by clicking the arrow to the right of the new tab icon.If that's not what you're looking at, please include a screen shot."]},{"symptom":"Windows 7 to Windows 10 upgrade        So, I have an older Acer laptop that originally had Win7. I did a clean install upgrade to Win10 during the free period. The hard drive crashed a couple of days ago. Naturally, I have no back up (My bad). I have the clean install disk I made at the time, but do not have the win 7 install code.2 questions.1. If I had the code, could I still do the free upgrade?2. I do have an old Win 7 disk from another PC build I have. Can I use that number to do the install?ThanksAlan ","solutions":["If you haven't changed the motherboard then clean install Windows 10 with the same edition, Home or Pro and it will auto activate once connected to the internet.","you don't need the code or windows 7, because you have previously had windows 10 installed and activated on that device, you can reinstall windows 10 anytime you wish.to get the best install, with fewest issues, use the media creation tool to create bootable media and clean install windows 10.make sure to get the same edition of windows 10 (home, pro, etc) that you had before.during install, skip the pages that ask for a key, it will activate automatically when you go online.Greg Carmack's article can help in guiding you through a clean install https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"How to add English keyboard layout into Vietnamese language like on old windows 10 build?        I applaud the effort to add telex and vni method into the new windows build, but they are abyssmal (i won't go to detail.) I'm desperate, I can barely type with the new methods.In the old build, I can still add English keyboard layout into Vietnamese language and then use other program like Unikey to type effectively. How to do it with the new build.","solutions":["Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.You mean you want to add a secondary keyboard layout? Here's a guide that might help youhttps:\/\/www.windowscentral.com\/how-change-your-...(Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.)I hope this helps with your concern! Please let me know if you have further questions.","Hi Paulo,Thank you for your reply.Sadly I can only add 3 layout to Vietnamese language whereas in Windows 7 or Windows 10 old builds I can addany layout regardless of the language.Regards,Tuan","Hi, So sorry that the new build is limiting you now to add more layout. What you could do for now is remove the layout that you rarely use. I know that Windows 10 is still lacking some features that others are using in their old OS version. That's why it is advisable to send your feedback on Feedback Hub app for any suggestion regarding this so this could be raised and hopefully added in future updates."]},{"symptom":"Incorrect email        Although i sign in with my current email address, I have an issue when wanting to change my security settings because microsoft wants to send a code to an old email address. I am not sure how to change this. ","solutions":["Microsoft Account?Security info & security codesSecurity info is an alternate email address or phone number that you add to your account. If you forget your password, or if someone else is trying to take over your account, we send a security code to that alternate email or phone number. When you give the code back to us, we know that you’re really you and we can get you back into your Microsoft account.____________________________________________Update security infoOn the Security basics page, select theUpdate info button. If you're not already signed in to your Microsoft account, you'll be prompted to sign in.You may be asked to enter a verification code to continue. If you don't have access to your alternate email or phone number, chooseI don't have any of these and follow the instructions to replace your security info.Select Add security info then follow the instructions to enter a new email or phone number. We'll send a verification code to that new email or phone number. Enter that verification code, and selectNext. Your new security info will appear in your list.If you want to update which security info we'll send alerts to, select Change alert options and deselect the checkbox for the one you no longer want to receive alerts for, unless they're critical."]},{"symptom":"Change language in Windows 10        Hi,I'm giving my Windows laptop away and I'm trying to get the display language in Czech. When I go to Time and Language, the Language option is not available. I managed to change the preferred languages but when I try to change the Windows display language the only option is English.Thanks for help!Luca","solutions":["Hi Luca 1 Open the Settings App (gear icon on your Start Menu) Go to System - About What is the exact edition of Windows installed on that laptop, is that a Single Language version?2 When you go to Time and Language - Language, below that language drop-down is there an option - Add a Windows Display Language in the Store?."]},{"symptom":"Cannot change from Workplace\/Domain computer to PC        I have a windows 10 Pro PC but when I go to This PC > Properties > Change settings > Network ID > then click on the \"This is a home PC\" Radio Button it prompts me to restart but after restarting nothing happensI need a fix to this for group policy","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues while removing a PC from Domain. We do have a dedicated forum, where we do support issues related to Domain Environment. Let me help you in pointing towards the right direction, I would suggest you to post your query onTechNet forums, where we have support professionals well equipped with the knowledge on Domain Environment to assist you with your query. However, you may want to refer the article Remove-Computer and see if that helps. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Microsoft wireless Mouse 1850- Can I get a replacement Bluetooth receiver?        I lost my bluetooth receiver  for my wireless mouse 1850. Is there any solution to connect it with any old bluetooth receiver? Replacement USB available purchasing? * Moved from Community Participation Center * Original title: Microsoft wireless Mouse 1850","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query related to trans-receiver for Microsoft Wireless Mouse. You have reached the Windows Technical Support team, and we don’t have the tools or services to help you with the query. I would suggest you to get in touch with Microsoft Supplemental part team for further assistance with the trans-receiver. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Access violation at address XXXXXXXX in module 'whatever'. Read of address 00000027.        We have 5 computers in our office (one server and four desktops). All of them have Windows 10 installed, even server (running MS SQL Server 2014 and file storage). We are using licensed property management software and their programmers are unwilling to help us (because software works with other customers and even on half or our computers). Here is what happens:Program is located on the server and executed on network computers. All users use the same network credentials. Software uses MS SQL Server for database. One of the tasks we have to do is to create a PDF documents\/reports. Two computers have no issues creating them, but the other two return an error: \"Access violation at address 00630B28 in module 'iPartments.exe'. Read of address 00000027.\" The error description varies slightly if we run the create a PDF documents\/reports function in another program 'iCounters.exe'. In this case the error reads: \"Access violation at address 0062F01C in module 'iCounters.exe'. Read of address 00000027.\" So the Read of address part stays the same.Any idea what might be happening? This started about a month ago, I don't remember changing anything, but it could be connected with updates (either Windows, this licensed software, other software). All computers use the same version of licensed software iPartments, iCounters.Thanks a lot!","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that some of the PC’s are having issue while creating the PDF document\/reports. However, we do have a dedicated forum, where we do support issues related to SQL Server. Let me help you in pointing towards the right direction, I would suggest you to post your query on MSDN forums, where we have support professionals well equipped with the knowledge on SQL Server to assist you with your query. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"LNK4084 error in FORTRAN Power Station  4.0        Hi,I get LNK4084 error with the message \"total image size 487452672 exceeds max (268435456); image may not run\" in MSDN FORTRAN power station 4.0. I have windows 10 with 8 GB RAM.Can you help me in solving this?thanks","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are getting an error, ‘LNK4084’ in FORTRAN Power Station 4.0. Let me help to point you in the right direction where you will find appropriate support options for this query. We do have dedicated forum for queries regarding MSDN FORTRAN power station 4.0. I would suggest you to post your query inMSDN Forums, where you will be able get in touch with developers with expertise on MSDN FORTRAN power station 4.0 and they will be able to provide you appropriate insights. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"VIDEO CARD DRIVER DOESN'T SUPPORT AERO EFFECTS.        VIDEO CARD DRIVER DOESN'T SUPPORT AERO EFFECTS.","solutions":["VIDEO CARD DRIVER DOESN'T SUPPORT AERO EFFECTS. If it doesn't support it, it doesn't support it.We can't do anything about that.You get the drivers from your computer\/laptop manufacturer's website if Windows 7 came preinstalled on the manufacturers supplied hardware, or from the graphics card manufacturer's website.Cheers."]}]}