{"windows":[{"symptom":"Media Creation Tool Issues        I've been trying to use the Microsoft Media Creation Tool to download an os for my new PC but it seems to force close after I answer the question about language and version. Can anyone tell me why this is happening and how to fix it?","solutions":["Hi Maya, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Download an ISO file and then use Rufus to create an Installation media. You can get an ISO file from here: https:\/\/tb.rg-adguard.net\/public.phpThen use Rufus to create an Installation media. https:\/\/www.tenforums.com\/tutorials\/2376-create...FYI The website I linked for downloading ISO fetches the downloads from Microsoft servers so the downloads are genuine and authentic.Disclaimer: There are links to non-Microsoft websites which would provide accurate and safe information. Watch out for ads on the websites which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","Are you downloading using the new computer?","No I dont have an os on the new pc"]},{"symptom":"No longer have an active active administrator account        Hi all,For reasons I can't understand, my local account on my Windows 10 PC (which is not on a domain) is no longer a member of the local administrators group (it definitely used to be).  The only account that is a member of the administrators group is the Administrator account, which is disabled.I therefore can do nothing to manage my own computer.Does anyone have any ideas on how I can enabled the administrator account, or re-enable my own account's administrator access, given that I currently cannot log on with any account that currently has administrator access.Thanks.","solutions":["Have you gone Settings, Accounts?","Hi GerardO'Neill, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Follow the directions on the website shared by some Windows MVPs, which can help youhttps:\/\/www.windowscentral.com\/how-change-user-...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thanks for the suggestions Marc but unfortunately none of them work because they all require administrative privileges to perform.  That's the problem - the computer has no enabled accounts that have administrative privileges.","Hi Iacrumb,I can get into Settings, Accounts, but there seems to be nothing in I can do in there to change the permissions of my account (given I have no administrative permissions to begin with)."]},{"symptom":"Problem with Internet access        If my computer sits idle for several minutes, I cannot get an internet connection again without going to Control Panel and selecting \"Find and Fix Problems\" under System and Security. After it runs through all the checks, it comes up with \"Reset 'Local Area Connection Adapter'\" and then shows it's \"Fixed\". My desktop has a Realtek PCle FE Family Controller and I am wondering if some setting in it is causing it to drop the network connection after the computer sits idle for awhile, causing me to go through this procedure every time I want to connect to the network\/internet again?","solutions":["Here is a idea.Go to Start Orb.Type in : device manager and click Enter Key to open.Scroll down to : Network Adapters and expand the column.Right click on your Realtek network adapter \/ controller. Select properties.Select the Power Management Plan Tab.Remove the Check Mark from : Allow the computer to turn off this device to save power. Does this work for you ???( If its a laptop you will consume a bit more battery power whilst running on battery )."]},{"symptom":"Package can not register        I bought a newer computer and was forced to switch to Windows 10 AKA worthless!!!anyway I was getting by with it until I put it online and Microsoft forced a update on me. Now I have no control of settings, I cannot open my pictures and most everything is messed up just as I had expected from windows 10 all along as I have seen the press on this worthless system!!!! tried getting help onyoutube but I don't have enough control to even use their advice. How do I back this system off so I can install 7  8 or any other working system that came before? I don't like the sound of package can not register, Makes me feel like it is trying to high jack my files and the like again just as I expected from win 10. HELP!!!","solutions":["What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK"]},{"symptom":"I want to change file explorer view for Downloads folder        Currently my Downloads folder in File Explorer shows sub-headings like Today and Last month.  I would like to change it to a straight list without sub-headings.  I've fiddled unsuccessfully with the View options.  This is the only folder where this happens, and I'd like to lose it.  But how?","solutions":["Hi IImaginethat On the View Ribbon, choose Group By - None, that should return your preferred view:.","DaveM121,That fixed it, thanks!  When I went there at first the Group by button was greyed out.  The tool tip popped up, but it didn't respond to clicks (no wonder I couldn't fix it).  Moving to a different folder and back got its attention, and now it looks great.  Thanks for your help!","I came here looking for this answer, thanks, But, is there an <all> way to do this, or do I have to open each folder in order to set it to <none>?","RCStanfill,This article offers a procedure for setting one folder view, and further down the page, another procedure for setting all folders to the same view.  If you're okay with the default, there's always the restore defaults button:File explorer > File > Change folder and search options > General > restore defaultsIImaginethathttps:\/\/www.windowscentral.com\/how-reset-folder-view-settings-windows-10-file-explorer","No, I.'ve known how to do that since my first Win3.1 computer. What I want is what used to be called the \"tree\", that shows ALL Folders at the same time in the left hand pane of File Explorer. Win 3.1\/95\/98 and XP all did this but I can't find a way to do it in Win 10. You could either \"Show Tree\" or \"Collapse Tree\".","After you set Grouping to (None) and the rest of the view to your liking, you should useApply to Folders to save these view settings as your custiom default for thatFoldertype:The common FolderTypes are: Generic (used by the Desktop folder underThis PC), Documents, Pictures,Music, Video, and Downloads. So you have to set the view on one of each & then useApply to Folders (a total of six gtimes) in order to set the view on all of your folders.Keith","What I want is what used to be called the \"tree\", that shows ALL Folders at the same time in the left hand pane of File Explorer.It's gone from FIle Explorer, but, just for fun, if you copy & paste the following code as the taraget of a new Shortcut, it will launch the oldBrowse for Folder dialog and open the folder you select:PowerShell -Command \"(New-Object -ComObject shell.application).BrowseForFolder(0,'Choose a Folder', 0).self.InvokeVerb()\"","Well, that was interesting, but still didn't open a full list (tree) like I wanted. I guess it's just not available anymore. Too bad, having to open every folder to see if the inner folder I want is there just isn't important to Microsoft any more. Thanks for the help though."]},{"symptom":"How can I activate FSX with an Authorization Number?        I am moving my copy of FSX Gold Edition from my old pc to a new pc.  I received an authorization number from Microsoft two years ago which activated okay on my old pc.  Where do I enter this authorization number in FSX on my new PC for activation?","solutions":["Hi Flight. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See how others have dealt with this here: https:\/\/answers.microsoft.com\/en-us\/windows\/for...If those don't help then contact Microsoft Support by one of these phone numbers:https:\/\/support.microsoft.com\/en-us\/help\/405170...You can also go here: https:\/\/partner.support.services.microsoft.com\/... choose the link for Browser help, interact briefly about your exact problem, keep replying agent until it connects with an agent.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi FS105,That Authorization number you received from MS may have been given because at that time you couldn't activate FSX with its own Product Key or you had lost the key.   That MS number would not be useful for a fresh install to a new PC;  you'll need to use the Product Number affixed on the FSX packet.   If you don't have it, then maybe you could try to use that old MS number or else you will need to contact MS for it.   To get the phone number applicable for your country, you will need to go into the FSX Directory (after installing it of course) and then find the file (Phone Activation.xml) to get the number.   The down-side of this is, is that the list in that file is now so old that it may not be useful.    As well, your question was pertaining to the location of the Authorization number (Activation Key) box after installing FSX.   After you install Disks 1 and 2, one of the last prompts will be for activation of the product.   If you don't get this prompt, either there may not be a need for further activation (as some of us experience when re-installing FSX a number of times on the same computer), or there is a glitch in the activation process.The two ways to tell if FSX is activated is:   1.   after taking a flight, FSX stops working after about thirty minutes then it is not activated, and   2.    open up a flight (i.e. to the point when you are seated in a cockpit) and press  Alt  to open up the top Menu bar.  Then go to   Help   and then to   About Microsoft Flight Simulator.   At the bottom there should be a Product ID.   If it is there then this indicates that your FSX is activated.  Chris      ","I would like to thank both Greg Carmack and Criso747 for their immediate responses and assistance.  I did use Criso747's procedure for finding the Microsoft Activation phone number and it still works okay as of 1\/10\/2020.  However, my authorization number was not accepted.The very good news here is that my activation was successful after re-entering my Product Key correctly!  I misread a \"B' as an \"8\".  Mea culpa!","Thanks for letting us know, FS105.   Happy Flying.Chris"]},{"symptom":"No audio when playing Minecraft Windows 10        Hey, so basically whenever i try to play minecraft there is no audio.I've placed the sliders all the way to 100% in the settingsMinecraft is not mute in my equalizer settingsI've run the audio troubleshooter with no successI've reinstalled Minecraft about 8 times now.Other apps from the microsoft store play audioMy audio driver is up to date.The only thing that i suspect may have caused this is the fact that i ran this script that i found on a youtube video for optimising windowshttps:\/\/drive.google.com\/file\/d\/1TJp1BE0s_6ZqzeZshiCmxbYNQfpnNXkZ\/view","solutions":[]},{"symptom":"Help My Bluetooth keeps connecting and disconnecting from device manager        Help my Bluetooth keeps disconnecting and reconnecting kn device manager I have a ASRock z270 Killer ali\/ac with a Intel core i5  processor the option to turn on or off bluetooth is complety missing in settings and when I go and try to add a new device it says that my computer doesn't have bluetooth it also shows the bluetooth driver connecting and constantly disconnecting all the time with that noise when you plug in or unplug something from your computer its driving me crazy so I tried to reinstall windows and it didn't help at all if someone can please help I would really appreciate it.Thanks,Michael","solutions":["Hi Michael. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Guardian Moderator here to help you.I'll give all possible steps for troubleshooting Bluetooth in order of priority. Many problems right now are being solved by updating to the latest version so if you want to skip to that step see the Repair Install at bottom:Try Updating the Bluetooth driver from the PC maker's Support Downloads webpage for your exact model. Install it even if it's the same or newer than the one in Device Manager reached by right clicking the Start button.Right click Start button to access Device Manager, locate Bluetooth device (if necessary from View tab Show Hidden Devices), on Driver tab see if Roll Back is available, if not try Update Driver, first automatically, then Browse, then Let Me Pick to try all previously installed Drivers. If these fail Uninstall the Driver, restart PC to reinstall. If the BT driver is not there, access the View tab in Device Manager to \"Show Hidden Devices.\"Make sure you're pairing correctly as shown here: https:\/\/support.microsoft.com\/en-us\/help\/15290\/... See Fixes here which are all working: https:\/\/support.microsoft.com\/en-us\/help\/14169\/...https:\/\/superuser.com\/questions\/1017867\/make-wi...https:\/\/answers.microsoft.com\/en-us\/windows\/for...Try the Bluetooth troubleshooter at Settings > Update & Security > Troubleshoot. Try turning off Fast Startup at Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change settings that are unavailable > uncheck Fast Startup.If this is a mic or headset right click Volume icon in System Tray to Open Sound Settings, make sure the correct device is selected for input or output in the dropdown menu.Then try pairing again, if necessary run the Bluetooth Troubleshooter again. If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....If you think the BT adapter has failed, you can replace it easily with a USB nano adapter like this one:https:\/\/www.amazon.com\/ZEXMTE-Bluetooth-Receive... Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1909 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Display Problems        Hey Everyone... Im using a 64 Bit Edition of Wimdows 10 on my Laptop with an extended display connected via Intel Graphics 3000.  The problem is when i unplug the extended display (LG Television via HDMI plug) my laptop display orientation changes and it always seems to be upside down LOL. Which is a real pain! Or sideways or flipped, you get the idea.  So, it never used to do this and has only been for a couple of weeks.  I have run a full In depth Virus Scan (Avast Free Edition 19.8.2393 (build 19.8.4793.545)) with up to date Virus Defs. Also an Online Scanner (Trend).  I have checked my display properties - no joy there.   Basically i dont know what else to do. Any help","solutions":["Get rid of the 3rd party AV, Security, Cleanup.All you need is Windows Defender and Malwarebytes.","Hi Gary, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Please see the below options: Option 1.Try Rolling back if you have an option: Go to Device Manager by typing in Devmgmt.msc in Run dialog box. Navigate to Display devices and right click ATI Radeon HD or Similar device you have. Choose Properties.On the Driver tab, hit rollback Driver to go back to the previous version. Option 2. Remove drivers completely and Install the the newest ones available from the OEM or the maker.What you need to do: 1. Uninstall everything of Display driver using DDU http:\/\/www.guru3d.com\/files-details\/display-dri...2. Reboot. 3. Make sure your device manager shows Microsoft Basic Display adapter. 4. Download the driver from the OEM or the maker like AMD 5.Run the Setup and you should be good to go. Disclaimer: Guru3d.com is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"I'm trying to get Minecraft for Windows 10  cant find device.        I'm trying to get Minecraft for Windows 10 and when i try to download it it says \"It looks like you don’t have any applicable device(s) linked to your Microsoft account. To install, sign in on a device with your Microsoft account.\"  I think I need to try to download the Microsoft App itself i think","solutions":["Hi Tyler,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.No applicable devices means your Windows is not up to date. The fastest way to get the upgrade is through Media creation tool or ISO file.Please download Media Creation Tool from the link below and select Upgrade this PC at the first screen.https:\/\/go.microsoft.com\/fwlink\/?LinkId=691209All steps, including upgrading using ISO file and Media creation tool, are covered here:https:\/\/www.yourwindowsguide.com\/2019\/11\/update...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads.","We are up and running.  thank you very much!","Great, Thank you for letting us know :) Feel free to ask any other questions. To help others with the same issue you may want to mark the thread as answered and choose an appropriate rating :)Have a good weekend."]},{"symptom":"Chess Master 9000        I've read the answers to the problem of having Chess Master 9000 play with Windows 10. Can anyone recommend a comparable chess program that will work with Windows 10?","solutions":["Chess Master is not one of the better chess-playing programs. There are two very good ones:Fritz and Rybka. I recommend both.","Hi Bill. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Guardian Moderator here to help you.Here are the best Windows 10 Chess games to try and find one you prefer: https:\/\/www.pcgamer.com\/best-chess-games\/https:\/\/www.thewindowsclub.com\/free-chess-games...https:\/\/www.microsoft.com\/en-us\/p\/3d-chess-game...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"deleted an e-mail not intended        how can I retrieve an e-mail I deleted from the deleted file?","solutions":["Hello, Jerry, 1. Try these Commands using PowerShell (Admin)Right Click on Start > Select PowerShell (Admin)Follow these steps:https:\/\/www.anyrecover.com\/deleted-files-recovery-data\/recover-deleted-files-cmd\/2. In the Tutorial's menu they do offer free Recovery Software. I am not familiar with it so use it at your own risk or try using a free Utility called Recuva. ","These are 8.1 operating system forums.There is no Right click on Start > select Powershell.I recommend Recuva as I use it:Try this free Program to attempt to recover your Data, or you may need to use Data Recovery specialists, who are very, very expensive.https:\/\/www.piriform.com\/recuvaWhat it can and cant dohttps:\/\/www.piriform.com\/docs\/recuva\/introducing-recuva\/what-it-can-and-cant-do","I recommend PowerShell above Command Prompt as it is a more thorough utility.Try pressing Winkey + X + A to open PowerShell (Admin) window.Tips on opening Powershellhttp:\/\/irisclasson.com\/2014\/01\/06\/ways-to-open-powershell-keyboard-only-no-installs-no-scripts\/"]},{"symptom":"My mouse tracks weird with my new Acer laptop        I got a new Acer Aspire 3 laptop and have of course, installed my wireless mouse as I can't stand using the touch pad. My mouse is a Logitech M325, and while it works okay when away from the touch pad, when I get it near it, the tracking gets all wonky. I move my mouse up, it goes to the right, and when I move it down, the cursor goes to the left. In addition, the tracking gets super fast and out of control.I've tried updating to the latest version of Windows 10, deleting and reinstalling the mouse driver, turning it off and back on again, unplugging and re-plugging it in, and even turning the touch pad off. I tried everything that I could think of to fix it, and nothing has worked.If anyone has any ideas as to why this is happening, and how to fix it, I'd really appreciate it.","solutions":["Go Settings, Devices, Mouse, Additional mouse options, turn off trackpad.","Hi Sleepy. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I have the same notebook mouse for a Dell laptop, which I like a lot. Are you able to disable the touchpad to avoid problems with it interfering like palm drag or other? If not or it still interferes then I'd try fixing the touchpad first to get it out of the way, then focus on the mouse. Update the Touchpad driver from the PC maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you also have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.If that doesn't help then enter Device Manager reached by right clicking the Start button, go to Mice > Touchpad and then Driver tab. Choose Update Driver, then Automatic to see if it gets a better driver that resolves the problem. If not try Update Driver > Browse > Let Me Pick to try all previously installed drivers. If that doesn't work then try uninstalling driver, Restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver.See the troubleshooting steps here: https:\/\/support.microsoft.com\/en-in\/help\/402786... Go to Settings > Devices > Touchpad to go over the Settings. Then choose Additional Settings which opens the Mouse properties box. The Touchpad software installs a tab onto it - usually the last one - that should have more settings to check, including a checkbox to Disable Touchpad when USB pointing device is attached. This prevents palm drag from causing the cursor to jumpIf disabling successfully the touchpad doesn't work then when did mouse last work correctly? What has changed since then? Is there a System Restore point to roll back to before then?http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... Change the batteries if wireless, try another USB port, reset mouse from button on bottom if available - or search Google for specific steps how to reset your mouse.Try the mouse in another PC to isolate if it's the mouse or Windows causing this.Try another mouse in this PC to confirm if Windows is the problem. For mouse lagging or freezing issues see https:\/\/www.thewindowsclub.com\/mouse-pointer-la... Access the Device Manager reached by right clicking the Start button, choose the Mouse, then Driver tab. First try Update this Driver > Automatically, then Roll Back if available. If not choose Uninstall button, restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver.Is there mouse software installed in Settings > Apps > Apps & Features? Uninstall it to see if the problem stops. This is unneeded bloatware.Adjust the mouse settings in Settings > Devices > Mouse, checking all settings including the Additonal Mouse Options box - check Settings on all tabs.Report back all results for possible other things to try. To check if Windows is causing this you can also go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. Update your drivers from the PC maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.If this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version which you need anyway and by the most stable method.http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"updates not downloading        2019-12 Cumulative Update for .NET Framework 3.5 and 4.8 for Windows 10 Version 1903 for x64 (KB4533002) andWindows Malicious Software Removal Tool x64 - December 2019 (KB890830) when downloading it shows error and I cannot download it no matter what. Plus I cannot update to version 1909 too.","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command promptDISM \/Online \/Cleanup-Image \/RestoreHealthRun these commands on the command prompt to restart windows update servicesnet stop bitsnet stop cryptsvcnet stop wuauservnet stop msiserverRen C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.old net start bitsnet start cryptsvcnet start wuauservnet start msiserverAfter successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartThis should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","Right click start, Apps and features, Programs and features, Turn Windows Features on or off.There you will find the .NET items."]},{"symptom":"\"Installed\" fonts not showing up in Windows Fonts folder        Hi guys,Unfortunately, none of the previous answers solves my problem.I try to install fonts. According to Windows that also works but I cannot see the installed fonts in the Windows Fonts folder and neither do they show up in Illustrator. When I copy a font file into the Windows Fonts folder it says \"The \"xxxxxx\" font is already installed. Do you want to replace it?\" - I click yes, but still - the font does not show.It's not a problem of the font file as it was working previously. Same happens to hundreds of other fonts. Says they are installed but they don't show and they are not selectable in other applications.Thanks for your help!","solutions":["Hi, Sorry for the inconvenience caused to you, Thank you so much for your valuable question please, I would suggest you to please see the below mentioned article and see if it helps. I am hopeful that your query will be resolved, If the issue persists kindly do let me know,waiting for your kind reply please. https:\/\/support.microsoft.com\/en-us\/help\/203018...Please let me know, if that helps and feel free to ask back any question. Kind Regards: Yasir","Hi Yasir,Thanks for the prompt reply. I have seen this article but is that for Windows 10? My setup is different:I can go to two different font settings:1) Control Panel - Appearance and Pers. - Fonts:2) Windows Settings - Personalization - Fonts\"Click Start, point to Settings, and then click Control Panel.Double-click Fonts.On the File menu, click Fonts to place a check mark.On the File menu, click Install New Font.To verify that fonts are being displayed, look in a folder that contains font files (such as the Windows\\Fonts folder).What File menu? Which check mark?Thank you","Try copying your new fonts to your actual fonts folder using the select, copy, paste method we have all always used.Your Fonts are stored here: ANY Fonts you want to use must therefore be placed here in this folder. Then you can use them.","Hi Yasir,Thanks for the prompt reply. I have seen this article but is that for Windows 10? My setup is different:I can go to two different font settings:1) Control Panel - Appearance and Pers. - Fonts:2) Windows Settings - Personalization - Fonts\"Click Start, point to Settings, and then click Control Panel.Double-click Fonts.On the File menu, click Fonts to place a check mark.On the File menu, click Install New Font.To verify that fonts are being displayed, look in a folder that contains font files (such as the Windows\\Fonts folder).What File menu? Which check mark?Thank you","Can you hold for a while so i can search other solution for you. Thanks Regards, Yasir","As you can see my suggestion actually works for Windows 10 (and all other versions)","Thanks Janey for your trying. Of course, I know how to install a font :)But my problem is this as follows:Before:Then I select a font and copy try to copy it in this folder. This happens:As you can see above, this font was not there. Anyway, I click yes, but it's still not there as you can see:","Perhaps it is listed under another name?  Look under \"London\" in your list instead of \"Chalet\".","Nope. This is also not the only font. I copied several hundred and in the fonts folder, there are only 231 listed.","OK. Well, sorry I couldn't help. Hopefully someone else here can."]},{"symptom":"Windows 7 wont boot.        Went to start my laptop and all I get is a blank screen with a dash.  Tried holding F2 and F12, does nothing. Any help would be appreciated","solutions":["Do you by any chance get a splash screen for the manufacturer's logo on it (Acer, Dell, HP, etc.), or does the screen remain absolutely black from the moment you turn the power on?If you don't, you have a failure even before it attempts to boot into Windows.","Nothing  it goes straight to blank screen with that dash in the left corner,  it doesn't flash or nothing.","Take it to a local, reputable Computer Tech and get them to test the hardware."]},{"symptom":"WIN 7 Home upgrade to WIN 8.1        I got this Your WIN 7 is not supported after 01 14 2020.OK... So I pressed the Upgrade Win 7 heading and asked about Win 8.1.Took me to a down load Win 8.1 page and downloaded the zip file to my cloud HD.Then a message appeared...Please log in or create a Microsoft account...Ask for the license code for WIN 8.1 single language OS.You can load as upgrade to Win 7 or clean install.Is this where I would need to pay for the license for one computer???  The download was free???I am using a HP 15-g013cl Laptop, with max upgrade of memory, hard drive an latest HP software.I also have older version of AutoCAD, Photo Shop, and Canon EOS XTI Digital Camera software...Will this software need to be removed for an upgrade... or will it all be disabled???For a Clean install will the software be able to be reloaded???","solutions":["You have to buy 8.1 to use it.It is only a free download.You will have to check with the program and hardware manufacturers to see what operating systems their products support.Support for 8 ended in Jan, 2016.Extended Support for 8.1 ends in 2023.But first check if HP supports and supplies 8.1 drivers for your exact model number.https:\/\/support.hp.com\/us-en\/drivers\/selfservice\/hp-15-g000-notebook-pc-series\/6545564\/model\/7155640Also:\"Windows 8.1 system requirements\"http:\/\/windows.microsoft.com\/en-us\/windows-8\/system-requirementsWindows 8\/8.1 does not come for free; you have to buy itMicrosoft no longer sells 8\/8.1.Try amazon.com, etc.Warning:You do not buy a Product Key by itself, as they are normally stolen\/pirated, Volume Licenses which are not for private use, or MSDN keys which are not to be sold by the original subscription holder.Make sure that you buy the complete sealed package (DVD, license)https:\/\/www.microsoft.com\/en-us\/howtotell\/Shop.aspxRead Section: Beware of Product Keys sold separately.@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Windows 8.1 & Windows 8 Upgrade Pathshttps:\/\/www.thewindowsclub.com\/windows-8-1-upgrade-paths","Thanks for the info... But the download iso was from microsoft windows download site... I will try to speak with a human there...","Microsoft has the 8.1 download for those who have already bought 8.1 and want to reinstall it.Or for those who have bought Windows 8 and want to upgrade to 8.1.8\/8.1 does not come for free and Microsoft doesn't sell it"]},{"symptom":"Error 0x80070780 the file cannot be accessed by the system        How to solve withError 0x80070780 the file cannot be accessed by the systemPlease help, I am using window 10 and office 365RegardsAMTRIS","solutions":["What kind of file?","What kind of file?Type Shortcut , in desktop can not delete , move or rename, always  Error 0x80070780 the file cannot be accessed by the system, Please help, I am using window 10 and office 365always like that why? please help","Hello, Amtris,Try the steps found here.https:\/\/www.auslogics.com\/en\/articles\/fix-error-0x80070780-win10\/"]},{"symptom":"Format a Hard Disk Drive        I want to reformat a HGST 750GB hard disk drive connected thru a USB port on my computer. How do I do this?","solutions":["1- Right-click on the drive letter in File Explorer.2- From the context menu that opens, select Format.","Hi Bob,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Press Windows + E Keys to open File explorer.Click This PC on the left. Locate your drive under this PC.Right click the drive and choose format. Select quick format and click OK. Hope that helps."]},{"symptom":"update to build number 1903        i am unable to update to the latest build number as bluetooth driver out of date","solutions":["What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK 1903 is a version number not a build number.","What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK 1903 is a version number not a build number.Sorry I meant version not build number :15063.141","What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK 1903 is a version number not a build number.Sorry I meant version not build number :15063.141 Thank you very much for responding","Hi masonandroid My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.The following Microsoft website should be able to help you with your issue. https:\/\/support.microsoft.com\/en-gb\/help\/452983...Hope this helps.","Hi masonandroid My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.The following Microsoft website should be able to help you with your issue. https:\/\/support.microsoft.com\/en-gb\/help\/452983...Hope this helps. Hi  Jon thank you very much I am just about to click on your link have a nice weekend.","Thank you, you too. Let me know how you get on."]}]}