{"windows":[{"symptom":"Windows won't open        Whenever I login to Windows it goes to my profile and while loading just stops. No big updats or anything, just happened after restarting my PC to refresh it after being on for a long time. What could of happened so randomly and why? How do I fix it?","solutions":["Hi HH. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.What do you mean it profile after logging in? Do you see the desktop with your files and apps in place? If not exactly what do you see? If you can explain a bit more then I can perhaps help narrow the possible repairs to do.It could be a corrupted account which we see a lot here. If so that often requires creating a new account to move over into. You can also try fixing a corrupted Windows 10 account:https:\/\/www.techbout.com\/fix-corrupt-user-profi... See if you can System Restore to a point before the problem began following this guide:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... You can System Restore from Repair Mode if it will not work in Windows, following one of these paths:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... You can also go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thanks for that great reply! I mean before I even log in. It shows the dell loading screen, then I enter the password on my account. After that, it loads for half a second and freezes. I will attempt to fix a corrupted account. Thank you so much for being so helpful and being so greatly qualified for this job!","I'm happy to help. Keep me posted on your progress as I will be here to help until the case is resolved.","I have now realized I may need to go into safe mode to go back to a past restore point, as home.bt says. I simply cant get onto my computer to restore it back. What simple way can I get onto safe mode fast before it freezes?","See how to get into Safe Mode with Networking (so you have internet), or Safe Mode, accessed by one of these methods:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... If you use a PIN to sign in, you'll need the full password for Password. To get out of Safe Mode if you're stuck: https:\/\/www.isumsoft.com\/it\/get-windows-10-comp...If necessary enable the hidden Built-in Administrator from the Sign In screen as shown here:https:\/\/www.isumsoft.com\/it\/enable-hidden-admin.... Sign into it and Create a new Local Admin account in Settings > Accounts > Family & Other People > Other as shown here:http:\/\/www.howtogeek.com\/226540\/how-to-create-a... or here: http:\/\/www.kickiteasy.com\/add-a-new-user-accoun... Sign into the new account, test if the problem persists, if not then move your files over, test that all programs work or else reinstall them, then when ready delete the old account in the same place.You can then change it to your Microsoft account if desired: https:\/\/www.tenforums.com\/tutorials\/5375-switch...","Thank you so much! I'm worried though. I restored back to the latest version, but it keeps happening. And now it is a loop of BSOD for BAD SYSTEM CONFIG INFO. I am very worried, what do I do?","See fixes for Bad System Config here: https:\/\/www.thewindowsclub.com\/bad_system_confi...https:\/\/www.maketecheasier.com\/fix-bad-system-c...If Windows won't start or isn't stable enough to repair, Unplug power and remove battery, press and hold power button for 30 seconds to release all power from circuitry, plug back in and power up to see if any change.I will give you steps to access the Repair Mode to try all repairs to get Windows started, and if not to do the automated Reset or the superior Clean Install after rescuing your files.1) Use whichever method works in this link to access Advanced Startup Options: https:\/\/www.tenforums.com\/tutorials\/2294-advanc.... Easiest may be to force shut down the PC (by holding in the power button) three separate times to trigger the Startup Options. If one of these methods work, then go to Step 3.2) If none of the other methods work it may be necessary to Create Windows 10 Installation Media on another PC following the steps in the middle of the downloads page here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... Make sure to uncheck the box for Recommended Settings to choose only the licensed version.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... Choose the boot device as a UEFI device if offered, then on second screen choose Repair Your Computer. If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first. There is always a way to get the media booted and I will guide you until it does, even if necessary to reset the BIOS to defaults via several methods.3) In the Advanced Troubleshooting options try to System Restore to a point before the problems began, Startup Repair, then if necessary from Startup Settings try to get into Safe Mode with Networking, or lastly Safe Mode.If Startup Settings aren't available you can force Safe Mode from Command Prompt following Step 5 here:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf..., or using the command to unhide F8 Advanced Boot Options here:https:\/\/www.tenforums.com\/tutorials\/22455-enabl... where you can also try the old reliable Last Known Good Configuration.4) From Safe Mode w\/Networking work through the Windows 10 Install Integrity Checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... Update your drivers from the PC's Support Downloads web page. Compare the latest drivers with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.5) If Safe Mode doesn’t work or help stabilize things then return to Advanced Troubleshoot options. Next try Command Prompt to run through Windows 10 Install Integrity Checklist (above link) Step 10 repair commands including sfc \/scannow, DISM, a full Disk Check: https:\/\/www.groovypost.com\/howto\/check-hard-dri..., or return to Troubleshoot options to Reset Your Windows 10 PC.6) Better yet do the vastly superior Clean Install following the steps in this link to delete all partitions down to Unallocated Space to get it cleanest:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... 7) There is a step to Rescue Files from the booted media or Repair Mode Command Prompt first:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... These steps are excerpted from my tutorial that compiles everything possible for Troubleshooting Windows 10 Failure to Start:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... You can continue with the other steps there.To test hardware, Dell and HP have onboard diagnostics triggered by powering up and pressing the F12 and ESC key respectively.Test the RAM overnight to stress it with the best bootable test memtest86, following these steps which test both the sticks and the slots:https:\/\/www.wikihow.com\/Test-PC-RAM-with-MemTest86Test the hard drive with diagnostics: https:\/\/www.lifewire.com\/free-hard-drive-testin...Best is to use the manufacturer's own if there is one, otherwise use Seatools bootable long test:http:\/\/blog.nowherelan.com\/2013\/04\/04\/boot-seat... Follow this up with a full Disk Check: https:\/\/www.groovypost.com\/howto\/check-hard-dri... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer There are links to a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thank you. My computer has no BSOD! Its just still freezing, so I will continue to update and try more methods. Thank you! (If possible could you give me more webpages to try and fix it?) Thnk you so very much!","I am so very happy! I finally fixed it sort-of. When it displays my wallpaper and the login screen, it freezes sort of. But then when i click the power button, it actually shows the shutting down screen and my mouse which can finally move. This never happened before! any tips to stop that?","I can move my mouse for until it shows the login page, freezes, turns black, lets me move my mouse, and freeze again. Has this ever happened? Thank you.Cheers,Jamie."]},{"symptom":"windows 7 COA to windows 10        I am a computer tech for a national retail computer sales and service company, being part of their service and repair team I have been required to obtain training from a variety of sites, of course the Microsoft Expert Zone is one of them, as such over the years as part of the various trainings offered I have received free copies of windows 7 and 8, since I have at least a half a dozen copies of windows 7 and windows 8 and the associated COA's for each, and since windows 7 has reached EOL, and for the foreseeable future Microsoft is letting users upgrade to 10 using 7 and 8 keys, I would like to convert them to windows 10 COA's without going through the hassle of installing windows 10, activating and then repeating until all the COA's have been registered.is there a way to register the COA's without installing windows 10 and activating? or will all windows 7 and 8 keys now be fully valid windows 10 Keys just like an OEM key?also, once a windows 7 COA is used to activate windows 10, will it still be able to activate the original windows 7? I use virtual machines for various software application testing and use and would like to be able to continue to install 7 and 8 on new virtual machines.","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Unfortunately you do have to go through the upgrade process in order to convert these to Windows 10 keys.As it is the same license you can only use this for one installation at a time, so you couldn't use a Windows 10 installation and a Windows 7 installation using the same key.Regards, Ross","Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Unfortunately you do have to go through the upgrade process in order to convert these to Windows 10 keys.As it is the same license you can only use this for one installation at a time, so you couldn't use a Windows 10 installation and a Windows 7 installation using the same key.Regards, Ross thank you, that being said, once I upgrade a COA to windows 10, should I change that OS back to the corresponding windows 7 OS, (single install of either\/or), will the original windows 7 activate or will it tell me the code is no longer valid for windows 7?","No it would still activate as Windows 7 if you delete the Windows 10 installation"]},{"symptom":"Can't disable\/remove PIN for logging into Windows 10 v1903        Hi,    It's been quite sometime and I've tried many ways to disable the PIN but I can't.       1. I removed the logging in password, and now my PC log in screen shows two log in methods, [password and PIN] clicking on password automatically logs me into the windows while clicking on PIN asks for PIN.       2. For a time, There was option to change the PIN, however, the option to remove it was grayed out, and i tried to remove it by leaving the new PIN field empty but I couldn't.      3. The option to change or remove it has disappeared, instead, \"Sorry this PIN isn't working for your organisation resources. Tap or click here to fix it\" message appears. I want to point out that, it's a personal PC, I have my institutes office365 account signed in, nothing more.Kindly help....","solutions":["Hi,Thank you for writing to Microsoft Community Forums.I understand that you are unable to disable PIN in Windows 10, In order to get clarity and to assist you accordingly, we would need some information.Are you aware of any changes made on computer before this issue occurred?May I know what happens when you click on \"Tap or click here to fix it\"?Have you already set up Windows Hello?Are you using Windows 10 Home or Windows 10 Pro?Please provide me the Screenshot of the error in Sign-in options.Refer this article How to include a screenshot in your post.If you are using Windows 10 Pro, I suggest you to try the following method and check:Press Windows +R keys to open the run command box.Type gpedit.msc to open Group policy editor.Select Administrative Templates under Computer configuration.Go to System > Logon.Set the Turn on PIN sign-in to value 0.Please reply with details and we'll be happy to assist you.Thanks,Suman.BMicrosoft Community – Moderator","Yes...having same issue. Do you mean value of zero \"0\" or leaving it blank? Thank you Charlie ","i have the same issue but i have windows 10 home ","I am using Windows 10 homeHappened the first time turning my pc back on after resetting it, as an update had given me a memory leak. It wouldn't let me in without creating a pin which i did not want to do, now it says \"Sorry this PIN isn't working for your organisation resources. Tap or click here to fix it\"I am not using Windows hello or cortana or anything, as i find it annoying and inconvenient.When you click to fix it it tells me to sign into my account, then it wont let me sign in as it is a personal not a work accountFix it.","I was like you and had the exact same issue.  I found this resource and used the \"Take Ownership\" app and it worked!  https:\/\/www.top-password.com\/blog\/disable-pin-login-in-windows-10-8\/   Make sure you know your password, before you do it though.  ","Hi,Thank you for writing to Microsoft Community Forums.I understand that you are unable to disable PIN in Windows 10, In order to get clarity and to assist you accordingly, we would need some information.Are you aware of any changes made on computer before this issue occurred?May I know what happens when you click on \"Tap or click here to fix it\"?Have you already set up Windows Hello?Are you using Windows 10 Home or Windows 10 Pro?Please provide me the Screenshot of the error in Sign-in options.Refer this article How to include a screenshot in your post.If you are using Windows 10 Pro, I suggest you to try the following method and check:Press Windows +R keys to open the run command box.Type gpedit.msc to open Group policy editor.Select Administrative Templates under Computer configuration.Go to System > Logon.Set the Turn on PIN sign-in to value 0.Please reply with details and we'll be happy to assist you.Thanks,Suman.BMicrosoft Community – ModeratorThe gpedit.msc does not work.  Says it can't find that location.  This is very annoying that I can't prevent it asking for a PIN every time I log in. "]},{"symptom":"Sea of thieves crashing        On my pc my sea of thieves crashes after about 10 seconds after launch please help","solutions":["Hi what error does it give you when it crashes? Please could you send a screenshot?","Hello, when it crashes nothing pops up it just crashes and completely disapears and theres nothing.","There is no error box telling you what error it is","Please can you try shutting down the PC first fully, then start i back up. then try again. if that doesn't work, please can you try and re-install the game? Does your computer meet the minimum specifications for it?","I have tried that and i have redownload the game 3 time and it still dosent work. My pc specs are alot higher than the recomended specs","Hi Josh, You might want to try to do Clean Boot on your PC before launching the game. There's a chance that one software\/service is contributing on your current issue.https:\/\/www.laptopmag.com\/articles\/clean-boot-w...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"Adaptive Brightness issue in Windows 10 1909        Auto Brightness not working. Drivers are up to date tried with Microsoft driver but still not working any idea. Like on Version 1809 when i plugged in charging it auto goes to 100% and if i unplugged it then it drops to 50 auto or where i set it to.i tried every solution which is available on Google like updating graphic drivers enabling and disabling generic monitor drivers etcHere is my Product name and Specification of my Laptop.HP Pavilion - 15-cs0066txMore InformationBRANDHpGENERATION08th GenerationPROCESSOR TYPE8th Generation Core i7-8550u QuadCore Processor (4 Cores - 8 Threads)PROCESSOR SPEED1.8 GHz Turbo Boost 4.0 (8 MB Cache)INSTALLED RAM08 GBTYPE OF MEMORYDDR4 2400HARD DRIVE SIZE1 TeraByte HDDHARD DRIVE SPEED-OPTICAL DRIVENoTYPE OF OPTICAL DRIVE-SSDNoneTYPE OF HARDDRIVESATACARD READERYesTYPE OF MEMORY CARDS1 multi-format SD media card readerDEDICATED GRAPHICSYesGRAPHICS MEMORYNVIDIA® GeForce® MX150 (4 GB GDDR5 dedicated)TYPE OF GRAPHICS MEMORYDiscreteSWITCHABLE GRAPHICSYesGRAPHICS PROCESSORIntelASPECT RATIO16:9BACKLIGHTLEDSCREEN SIZE15.6\" diagonal FHD IPS anti-glare micro-edge WLED-backlit (1920 x 1080)SCREEN SURFACE15.6\" diagonal FHD IPS anti-glare micro-edge WLED-backlit (1920 x 1080)SCREEN RESOLUTION1920x1080TOUCHSCREENNoCOLORSilverDIMENSIONS (WXHXD)36.16 x 24.56 x 1.79 cmWEIGHT1.85 KGFINGERPRINT READERNoNUMERIC KEYBOARDYesBACKLIT KEYBOARDFull-size island-style backlit keyboard with numeric keypadBLUETOOTHBluetooth® 4.2 ComboLANNoSPEED-WIRELESS\/WIFIYesTYPE802.11b\/g\/n\/acCONDITIONNewUSBYesUSB 2.0NoUSB 3.01 USB 3.1 Type-C™ Gen 1 (Data Transfer up to 5 Gb\/s, Power Delivery, DisplayPort™ 1.2, HP Sleep and Charge); 2 USB 3.1 Gen 1 (1 HP Sleep and Charge)USB PORTS (TOTAL)3MICROPHONE INPUT1 headphone\/microphone comboHEADPHONE OUTPUT1 headphone\/microphone comboHDMI1 x HDMI v1.4BATTERY LIFEBattery life mixed usage Up to 11 hours and 30 minutes Video Playback Battery life Up to 9 hours and 30 minutesBATTERY TYPE3-cell, 41 Wh Li-ionCAMERAYesNO. OF EFFECTIVE PIXELSHP Wide Vision HD Camera with integrated dual array digital microphone32\/64-BIT OS64 BitOPERATING SYSTEM (PRIMARY)Genuine Windows 10 Pro","solutions":["Hi Tasneem Adaptive brightness relies on your system having an ambient light sensor on the system and I don't see that listed in the specs of that system, did adaptive brightness ever work on that laptop?Please check this setting: Right click the battery icon in the Taskbar and select Power Options Click on 'Change plan settings' beside the selected power plan Click on Change advanced power settings. In the Advanced settings window, expand Display and then expand Enable adaptive brightness - make sure this is set to Off for both On Battery and Plugged in. Click Apply and OK to save any setting changesDo you have those settings?","Hi Thank you for your reply but here what i trying to make understand on Version 1809 when i plugged in charging it auto goes to 100% and if i unplugged it then it drops to 50 auto or where i set it to.","Hi Tasneem Do you mean you want two separate levels when on Battery and on Power or do you want the same level on both?In version 1809 Microsoft removed the 2 separate brightness sliders and replaced those with just one brightness sliderYou need to set the levels on that one slider on the Notification panel, when your laptop is connected to power and also when your laptop is on battery, windows will remember those separate settings from that one slider . .If that is not what you mean, please explain in a bit more detail . . .","Hello Dave,In the Advanced settings window, expand Display and then expand Enable adaptive brightness - make sure this is set to Off for both On Battery and Plugged in. Click Apply and OK to save any setting changesI encountered a problem with this because when I expanded Display, it did not show adaptive brightness.I have tried everything that I have looked up but I really cannot do anything about it. I am using Windows 10 1909 on a Lenovo Legion Y530.I really want to adjust my screen brightness. Your help will be greatly appreciated."]},{"symptom":"Windows 10 Minecraft, missing bundle packs        I bought the Windows 10 Master Collection. I changed my gamertag to something I wanted and now I am missing the following...Pastel skin pack, Pure BDcraft texture pack, Wildlife Savana, Winter mini games festival and Relics of the Privateers. Everything shows up in my account just does not show up in game.","solutions":["Hi SassyCountry, You may refer to this link for further clarification in regards to your concern: https:\/\/help.mojang.com\/customer\/en\/portal\/arti...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Hi sassycountry296 I'll try to help you out. I'm not very much used to minecraft modding, so I'll need a bit of explaination Did you bought thoses packs in the markplace ? Or did they came with the game ? Have you already tried to disconnect \/ reconnect your xbox account ?"]},{"symptom":"spooler on W10 not working        Good Morning,My PC has a Windows 10 partition (C) and a Window 7 partition (D).I update my W10 and clean it regularly. All was working fine unto recently.My W10 spooler stops systematically and I can't see any printers and can't pring.On the other hand, my W7 spooler runs automatically and I see my pdf, local and network printers. PRinting is possible.I have tried the windows fix, many controls (sfc...), repair kits (Tweaking) and even reinstall Windows 10: no success.Would you have any advice that could help me?Thanks in advance","solutions":["Hi Alen. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Rather than spending too much more time fiddling I'd simply Clean Install the printer which always works, lasts longer and actually saves time:1) Power up the printer, if wired unplug it's USB cable from PC. 2) Go to Settings>Apps>Apps and Features to find and Uninstall any printer software.3) Use one of these methods to remove all of the old printer drivers: https:\/\/www.tenforums.com\/tutorials\/101274-unin...https:\/\/helpdeskgeek.com\/how-to\/remove-uninstal...4) Now type Control Panel in Start Search, open CP, choose Icon View. In Control Panel open Devices and Printers, right click printer to delete Printer and any scanner or fax of the same name. Restart PC.5) Go to the printer model’s Support Downloads webpage to download and install the latest full software package. Now is also the time to check for any newer printer firmware to install which matters a lot.6) Extract Printer software, right click Setup file to Run as Administrator. Follow the setup screens closely as you install the software. For USB it should prompt when to plug in the printer.Older software may need to be installed in Compatibility Mode to run correctly: https:\/\/www.groovypost.com\/howto\/run-old-softwa... If you have further problems reply back with results of each step. Once it's installed and you've run a test print, then scanned it to see that it opens on the desktop, open the Printer software and go into its Settings to set the scan-to file location you prefer, also the email app you want opened for Scan to Email, if applicable.I hope this helps. Feel free to ask back any questions and let us know how it goes. If you will wait to rate my post until we are done, I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Make sure that you are installing into Windows 10.","Hi Greg,Many Thanks for  the great help.Unfortunately, the issue is not linked to a printer but to the spoolsv.exe on my Windows 10 partition.It stops systematically after any start. Any Printing is blocked when working under Windows 10.Yet, my spoolsv.exe on my Windows 7partition run well when working under Window 7.","Yes, that's the print spooler which is still subject to the printer software being properly installed to work correctly. I solve problems all the time with the print spooler by reinstalling the printer software.If you want to first focus on the spooler there are fixes for print spooler in WIndows 10 here:https:\/\/pureinfotech.com\/fix-printer-spooler-wi...https:\/\/windows101tricks.com\/print-spooler-keep...Run the Printer Troubleshooter from Windows Settings > Update & Security > Troubleshoot.If these don't work then I'd clean install the printer software as it solves almost all problems including those with the spooler.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thanks lacrumb,Of course printers had been installed on both the Windows 7 and the Windows 10.In Windows 7, all printers are installed and working,In windows 10, non of them are existing (only a network on which is off).","You need to install the printer software into Windows 10 even if it is a network printer.","Thanks Greg, but I do not have any printer installed anymore on Windows 10 (not even the standard OneNote).If I want to install a printer, W10 sends me the message \"the local spooler is stopped. Start the spooler or the PC\" [sorry my system is in French and the translation may not be top]In service.msc, When  I start it, it stops systematically.I have run the event monitoring, I have an error and the report says (translated):Name of the defective application: spoolsv.exe, version : 10.0.18362.476, horodate : 0x84440337Name of the defective module: msvcrt.dll, version : 7.0.18362.1, horodate : 0x58bec60cException code: 0xc0000005Error distortion : 0x0008abcaDefective Process ID: 0x258cStarting time of the defective application: 0x01d5c2cb28211117Path to the defective application: C:\\WINDOWS\\System32\\spoolsv.exePath to the defective module: C:\\WINDOWS\\System32\\msvcrt.dllReport ID: 4862bed8-c1a5-4bb3-a810-c6aecc5f8e39Complete name of the defective package:Application ID related to the defective package:","Thanks lacrumb,have a look at the post I replied to greg","Were you going to try the steps I gave to fix the spooler? I was waiting for your reply with the results of those steps so I could give you others.Please do not skip any steps. We often find out later that the fix was the skipped step. If you need help performing any step I will help.Next run the System File Checker from Step 10 in this checklist: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... If it finds unfixable files continue with DISM in Step 10. If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m...","What printer are you talking about?  My Epson printers are network and every so often when there is an update I have to reinstall them.  I have 9 computers that access my 2 Epson printers."]},{"symptom":"Windows 10 BSOD Store Data Corruption        I have been facing this error for a while now. It occurs when I use heavy ram hungry applications or games like Rainbow 6 Siege. Midgame it would freeze and crash to a BSOD.  The memory dump file is here.I have done mem test on the rams individually and both are error-free. Ran the game on them individually and got the same error.Any help short of reinstalling windows (I can't do that currently) is welcome.","solutions":["How much RAM?","HiMy laptop has 16GB ram.  The application uses at least 8GB+ ram when available.Initially, the laptop came with 8, I added another stick of 8 with the same 2666 MHz freq. Before adding this ram the usage used to be 6 GB.Also, I just analyzed the dump in whocrashed and it gave this reportcrash dump file: C:\\WINDOWS\\MEMORY.DMPThis was probably caused by the following module: ntkrnlmp.exe (nt!memset+0x88B78)Bugcheck code: 0x1C7 (0x0, 0xFFFFAA8FB2D6E000, 0xD9255BB9, 0x1BE575)Error: CUSTOM_ERRORThe crash took place in the Windows kernel. Possibly this problem is caused by another driver that cannot be identified at this time. Thank you","Hi, The error may be to be related to the graphics subsystem. Ensure all graphics drivers are the latest version available from ASUS for the laptop.Also, consider updating the BIOS to the latest as the error may be motherboard related.Some general info on the error you experienced (STORE_DATA_STRUCTURE_CORRUPTION (1c7)):https:\/\/docs.microsoft.com\/en-us\/windows-hardwa...","The BIOS is updated to the latest version.But should ignore all the nvidia driver updates then?The one on their website is from may 2019441 to 416","I have been facing this error for a while now. It occurs when I use heavy ram hungry applications or games like Rainbow 6 Siege. Midgame it would freeze and crash to a BSOD.  The memory dump file is here.I have done mem test on the rams individually and both are error-free. Ran the game on them individually and got the same error.Any help short of reinstalling windows (I can't do that currently) is welcome.","I would suggest to use the one from their website as it may be modified for the system.If the error persists consider running the Windows Memory Diagnostics Tool as suggested in the article from Microsoft.","I have run the windows memory diagnostic tool quite a few times and found the test to be error-free in the event viewer.Here is a minidump file of a BSOD I just had with the older gpu driver from the manufacturer's website (ASUS)","Can you provide the following information which may help determine any issue(s):Windows Key + R > type msinfo32 in the \"Open\" box > OK > File > Save > then save as an .nfo fileThen make the resulting .nfo file available via OneDrive. Also, can you do the following: Windows Key + R > type eventvwr in the \"Open\" box > OK > expand \"Custom Views\" and then right-click \"Administrative Events\" > select \"Save all events in Custom View As\" and save as an .evtx fileThen make the resulting .evtx file available via OneDrive.","Here are the resulting.evtx and resulting.nfo files","Seems to hardware issues as the following errors are logged in the System Event Logs:WHEA-Logger - A corrected hardware error has occurred. Reported by component: Processor Core Error Source: Corrected Machine Check Error Type: Translation Lookaside Buffer Error Processor APIC ID: 2 The details view of this entry contains further information. ACPI - : The embedded controller (EC) did not respond within the specified timeout period. This may indicate that there is an error in the EC hardware or firmware or that the BIOS is accessing the EC incorrectly. You should check with your computer manufacturer for an upgraded BIOS. In some situations, this error may cause the computer to function incorrectly.As you have the latest BIOS I would suggest to contact ASUS on the issue and see if there is a known issue.A possibility is that you may have to downgrade the BIOS if everything worked OK with a previous BIOS version."]},{"symptom":"Windows 10 activation after hardware swap        Hello,I have recently swapped out most of my pc hardware and can no longer use my activation code and I have checked on the help pages and haven't found anything that has helped. Any suggestions?","solutions":["Hello Cohner_863, Windows 10 activation is directly associated with your computers hardware. Changing out the majority of the hardware will cause windows to no longer find the license and you will have to re-activate windows. The correct steps can be found here:https:\/\/support.microsoft.com\/en-us\/help\/20530\/..."]},{"symptom":"How to Place Date in Taskbar        How do I put date back on my taskbar at bottom of screen?[Original Title: date]","solutions":["Hello madonnamitchell, I'm Didi, an independent advisor. Right-click on your taskbar, click \"Taskbar Settings\" and uncheck \"Use small taskbar buttons\" so it is set on \"Off\".Regards, Didi"]},{"symptom":"Error ethernet doesnt have a valid IP configuration        I bought lenovo thinkpad recently, i used an usb ethernet adapter to connect to LAN. But it did not provide access to internet, i tried troubleshooting then it showed that the connection between your access point, router, or cable modem and the internet is broken. Then in order to solve this problem i opened command prompt and entered the following in the same order: netsh winsock reset, ipconfig\/release , ipconfig\/renew. Then i did restart. After restarting, now it shows in troubleshooting that ethernet doesn't have a valid IP configuration. I tried various methods such as rebooting, updating drivers, but none of them helped. ","solutions":["Hi Itschaitanya,probably that usb-ethernet adapter needs driver update or it is not compatible with your pc.If you have the chance, try inserting that adapter on another pc and check if it works."]},{"symptom":"ms project 2016 perpetual license        i want to install my Microsoft project 2016 app onto a second PC (using only 1 at a time). Order number 3004990657. when I try to do this I get an error it is already installed. I thought this was a perpetual license so I could use it as long as only 1 in active use at a time?","solutions":["Hi ktkane2000 On this page, you can learn the specifications of each edition of Microsoft Office :https:\/\/products.office.com\/en-us\/compare-all-m...If you want to use Office on multiple computers, you'll have to get a \"Familly\" edition, which you can run on 6 differents accounts (6 accounts, multiple devices)If you're running on a single account, a personnal edition should be enough, (1 account, multiple devices).I hope this answers your question Regards","Sadly no. I did buy ms project app as stand alone for $1000. it doesn’t come with any office bundle. When i tried to install it on my second computer it said no can do i have to buy another. It said can’t use a home use license on a second computer? But I paid full retail online with Microsoft for this stand alone MS Project Pro 2016 app. There is no “home use” version. very frustrating. I e-mailed Microsoft via link in receipt and no response for 4 weeks. ","I understand. I just checked office project 2019 : https:\/\/products.office.com\/en-us\/project\/compa...?It is stated : \" One license covers 1 PC per user \" It may unfortunately be limited to one computer.","Yep. Very frustrating. So i have to spend $2000 to have project on my surface pro 4 and my newer laptop. Thanks for the fast reply. Guess ill go to a different PM app for my PC. Pethaps Concept Draw Project. ","You're welcome Regards Jay"]},{"symptom":"Directory not accesibble on client, permission deniend        Hey Everyone,I have a problem with my new Microsoft Surface Laptop 2 and I don't know why.On my work computer (Desktop) I have installed the owncloud client. So I can download files on demand (if I need them).This is working fine for a long time. Never had issues with it.Last month I have bought a Microsoft Surface Laptop 2 laptop (a nice laptop by the way). But it is saying: `Directory not accessible on the client, permission denied` (screenshot below). When I look at the directory (C:\\Users\\xx\\ownCloud) it does exist.Is there a way to fix it, since it seems to work on other devices.","solutions":[]},{"symptom":"edge is not working to search terms         I am running windows 10 and  have no problem to connect internet,but if  I need to search a term using edge  have a problem to connect any page with saying :can not connect securely to this page:Why is it and how to fix it?","solutions":["Hello emintemizerler, Please try the steps provided here: https:\/\/www.drivethelife.com\/windows-10\/microso... These are the most common fixes to this problem. Disclaimer: Please be aware that the link provided is not a microsoft link, it is advised to not download anything from this site as it is not verified by Microsoft.","I have tried your advised steps but without any success.Thank you for your help."]},{"symptom":"Administrator Permissions in Windows 10        I have to say right now that my patience has just about worn out.  I am tired of this problem, and am quite angry that some company decides that I cannot control my computer.I AM THE ONLY ONE ON THIS COMPUTER.  I AM THE ADMINISTRATOR - and I'm sick of Windows trying to control what I do and do not do in regard to the running of it.I cannot delete some folders; I cannot get in to some folders; I cannot download most of the time; I can't edit some documents, documents which ARE MINE!I have given myself administrative rights.  So what, it just changes right back, as do my Word 13 settings.  I'm up to my eyebrows on this one.This has got to stop. Now.I don't mean to be disrespectful, I truly do not, but this has just got to change.","solutions":["There is a difference between a user administrator account and windows system administrator, which sounds like where your problem may be coming from. The system administrator is there to protect your PC from unauthorised changed. Some things may have got mixed up during the upgrade.Can you describe how you are trying to change the privileges and on which folders. Also what folders you are trying to delete or which folders they are in.","I cannot delete some folders; I cannot get in to some folders; I cannot download most of the time; I can't edit some documents, documents which ARE MINE!You need to be very specific - remember we can't see your computer.What folders can't you delete?What folders cannot you access?What do you mean by \"cannot download most of the time\"? What are you trying to download from where to where? What happens when you try?What documents can't you edit? What happens when you try?","I've had this problem since Windows 7.  It's random. I'll delete a program, go into program files to delete the folder, and it won't let me.I begin a novel. Save it, go in to edit, and it won't let me.  I go into Word to personalize, it won't let me. But the part that really gets my goat is when I try to download a program and it says I don't have permission. Whose permission? God's? Because that's the only entity I think should have a say on what I download or do. (This of coarse does not include illegal downloads. I'm talking about a program I want, say an audio program, or a screen saver, whatever.)I'm the only one on here. Who is the Administrator? Me.  So what the h*** is going on here?  I don't have time for this.It's frustrating, it's enraging and it's, in my opinion, ridiculous.But, thank you so much for answering and trying to help. I'm upset with a program, not a person.","Let's say I decide that I don't want a program anymore, say a anti-spyware program.  I do an uninstall, but often folders are left behind.  Most of the time, I'm told that I don't have permission to delete those folders.And then let's say that I want to download a screen saver, for instance.  When attempting to download, I'm told that I do not have permission.  There have been other instances, so numerous that it's difficult to remember specifics because they are so random.Now, let's say that I want to move files from one hard drive to another: .doc files. My files.  I'm often told that I do not have permission.Okay, I'm working on my novel.  I've finished writing for the day and save it.  The next day, I do not have permission to edit this file.It's all over the place.  Bottom line, I am disgusted that I am told what I can and cannot do on my own computer of which I am the only operator.  No one has the right to tell me what I can and cannot do.  I don't go out looking for illegal sites; I don't try to download illegal content; I'm simply an author and an artist who tries to get work done as simply and efficiently as I can.These issues eat up my time, which is sometimes billed. So I end up trying to work for ten billable hours but can only bill, say six.  It's infuriating and makes me look bad when I fall behind on the deadline.","OK let's deal with these one by one.I've had this problem since Windows 7. That would say to me there's something very wrong with your setup. Upgrading to a newer version of Windows won't fix that. I'll delete a program, go into program files to delete the folder, and it won't let me.Because you shouldn't be doing that. When you uninstall a program, it should remove those folders automatically. I presume you are uninstalling programs via Control Panel>Programs and Features?I begin a novel. Save it, go in to edit, and it won't let me.  So precisely what happens when you try? Where are you saving this document to?I go into Word to personalize, it won't let me. What do you mean by that? What version of Word?When you say you can't \"download\" a program, do you mean the download of the installer file from the internet, or the actual install of the program?","Nope, new computer.I thought I made that clear. I go in and do an uninstall - yes, through Control Panel. It leaves things behind, which often I cannot delete.I save it to the drive where I save all of my writings.  It says that I do not have permission to edit this document. Everything is, I do not have permission.  Makes me want to pull my hair out.  I'm using Word 13, but it happened in Word 10 as well.I cannot download from the internet. It can be anything from Win Zip to something frivolous like a wallpaper.I know that many, many people have this problem.  There are times when my husband will come stomping into the kitchen because the blank blank windows says he doesn't have permission to do a simple blank blank task.  I don't know anyone who doesn't have this problem.This needs to be rectified. People should have a choice.","If you are saving these files into the standard user folders, eg users\\documents, users\\pictures, users\\downloads etc. Open File Explorer and go to those folders (not in quick access but the actual folders) pick one, and try to create a new file or folder in that folder. If you can't right click on the folder and select properties and then select the security tab. Select your name\/user and all the permissions should be set to allow. If not that may be the route of the problem. Select edit and see if you can add any missing permissions. (for that folder)These permissions should be inherited from your users folder so you could check that too. This folder can be found in C:\\Windows\\Users and because of this it will affect all your personal folders including downloads, which would explain why you can't download a file.","I had the same issue.. I logged off my windows account and selected local account.Then signed out of the local account then found the admin account. I lowered the UAC (user account control). Now I can access everything as normal.","That's the whole problem. I'm working in the admin account. It's the only account I have.Thank you, though.","Thank you. At least this takes care of one thing.  But still have the universal permissions issue.Many thanks, though.  This helps in this area."]},{"symptom":"Laptop no longer sees android device when connected via USB        I have a Huawei P20 Pro and Windows 10 on Surface Pro 4. When I connect it only charges the phone. I can't see the phone showing on the Device Manager. It's been about a month since I last connected my phone and it was working fine then. I've tried all the help articles online e.g. updating settings on the phone's developer options. My phone connects fine to my other Mac computer, so I'm confident it's not the USB cable. I have other USB devices working on my laptop so it's not the USB port. Is the best option now just to run a repair or is there something else I can try?Thoughts much appreciated thank you.","solutions":["Press Win+X> Device managerLocate android device then right click then select Update driver.If the update doesn't help then try to uninstall the Android driver, Windows will re-install it after a restart.","Press Win+X> Device managerLocate android device then right click then select Update driver.If the update doesn't help then try to uninstall the Android driver, Windows will re-install it after a restart.My phone doesn't show on the Device Manager (I'm assuming it should show as 'Huawei P20 Pro' or 'Android Phone' etc.). I've noticed under 'Other Devices' the list expanded shows exactly as follows:- Bluetooth Peripheral Device- Bluetooth Peripheral Device- Nearby Server Socket- Nearby Server Socket- SMS\/MMS- SMS\/MMSCould this be my phone or something else?","Hi blafa, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.See the steps described in this link shared by some Windows MVPs, these indications are adapted to the problem you are currently presenting.https:\/\/www.howtogeek.com\/195607\/how-to-get-you...If the above steps do not work, try starting Windows through a clean boot, it is an error-proof process, so we can detect if it is a third-party program or driver that causes the problem.https:\/\/support.microsoft.com\/en-us\/help\/929135...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi Marc thanks for the response. I've the tried the clean boot as suggested but I'm still having the same issue.The first link describes checking the notification panel for USB settings. My phone doesn't have anything to show that it is connected. The only way it's responding is by going on charge.Then it describes finding the phone on the device manager list. The only thing I can find on my device manager is what I posted above:Other Devices:- Bluetooth Peripheral Device- Bluetooth Peripheral Device- Nearby Server Socket- Nearby Server Socket- SMS\/MMS- SMS\/MMSI'm wary of trying to update these drivers (side note: the list of device drivers available doesn't give me 'MTP USB Device' as suggested in the article) as Windows has warned me I could potentially corrupt files or even stop my laptop from working completely.","Hi, I understand, with the clean boot is there no difference in behavior? Regards","Hi, I understand, with the clean boot is there no difference in behavior? Regards No it's exactly the same.","Hi blafa, You might want to check this option on your Huawei as well, https:\/\/www.mobikin.com\/android-backup\/enable-u...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Hi blafa, You might want to check this option on your Huawei as well, https:\/\/www.mobikin.com\/android-backup\/enable-u...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards, Thanks Richard but I've already tried the developer options. ","Hi blafa, If that's the case, try to check for the brand and model of your Motherboard. Then update all Chipset drivers since there's a chance that you missed some of it.This might help you solve your concern. Let me know if it will work. Thanks and regards,"]},{"symptom":"recovery\/ restore problems update problems hp pavilion 1803 to 1903 used to be windows 10 pro full update before restore        System Model HP Pavilion x360 Convertible 14m-cd0xxxVersion 10.0.17134 Build 17134 is windows  currently.    was windows 10 probut my Microsoft  account had to reset password but it restores factory before my 30day wait over {used pc since december2018 bought it new} also I had recently  joined insider program just to see. never had windows update fail in last 11months. until restoring after.After factory restore I believe I had to log in local account instead of Microsoft, for the pin was gone and not online to log in email, im no longer that version of windows im windows home after recovery. stuck on 1803 feature update trying to update to current.  tried near every trouble shooter there is and one caught my eye, partitions are mixed up 2 drives hidden post on google search same symptoms, but it never had a solution. youtube video some guy used legacy device on his bios or something same symptoms kinda.  I haven't modified partitions yet only viewed, seems not right, I think windows update is downloading to wrong part of harddrive  too, have had non stop expanding file sizes probly from indexer indexing to wrong partition so I put file explorer settings to default and rebuilt index.  sometimes my X button to close a window is red too, and sometimes browser is unsecure and sometimes shows a lock. im using xfinity hotspot not sure where but it lets me log in or use free pass. recently for waiting on install of dsl from att.  don't have info to steal if its a neighbor viewing but I did remove remote ps and sharing files and so on, disable wmn 1 but left rest like someone told me to.  change the coin to 0id like to fully factory restore or get windows updated to version I had that I cant remember. it was windows 10 pro may update 2019.  or around then.  backups are gone or hidden in wrong partition. chkdisk f\/ r\/ on reboot in 1 min it gets to  11% hours later never budged  everytime I try hard reset with battery in for I haven't  opened up this labtop yet  I have to find efi64  file in boot settings to get back to windows or its stuck in a checking system - cant fix problem shutdown  or advanced options loop. for most boot settings are  .  or .. and regular one is unlabled volume pci(and a bunch of symbols) last recovery I did stopped at 99% for 20hours but got to 99% in about 2hrs , I had to power off and on and it said not all files were removed and went to windows updating for your protection in online world, that took 10 mins but I didn't have internet connection anywhere near by at the time so it updated from and update  saved on my pc somewhere right? sorry I cant explain things perfectly Im still remembering events that may or not help solve.  My error event log is huge and hp support assistant warned me error reports are taking up too much space recently.  heres some snips of things.  thanks for reading by the way. im looking that the offsets like primary 3 size matches recovery offset, is any this supposed to be that way, . environmental variables, I don't remember adding any intentionally but I could have.  should I remove all variables?what dism check system image or repair does from local accounts on this pc,  on powershell but  fine on my Microsoft account.  stays there for ever never goes past that. have to use cmd prompt though. 0x80072ee2 is the windows update to feature 1903 fail from 1803hp diagnostics on boot everything passes except hard drive and it passes smart test, and fails short and long test .  I reset bios to factory security settings","solutions":["Hi, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.If the drive fails the diagnostic test, it is probably the root cause of the problem.Download and run HDTune . http:\/\/www.hdtune.com\/ Select the Disk where OS is installed. Make screenshots of the following the health the error scan the benchmark Post back the screenshots. Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","running the error scan now.  my local hospital just got hijacker hacked encrypted all their information.  , locked down, they called fbi and all. im using a local open hot spot of xfinity same company that hospital uses comcast,  , I know its unsafe, but I been waiting for another company to show up here install dsl for long time now. i sorta felt hijacked too, when id try install malware bytes and it says pick work or home, install now. and the only button is no. the yes button missing, I tried type virus in cortanas search bar, to get to virus and protection and it was saying , my IT administrator has blocked the priviledge. I just own a labtop I just play games on it at home no business or company with a IT tech, I on cmd prompt out of curiosity pressed shutdown . it said the computer shut down. yet not mine, don't get it feels like 2 people here on linked some odd way, ones not me. I did run sfcfix tool a sight i trust said to try .before this it found a lot wrong that sfc scannow and dism never located.  uh oh hard drive errors","im in safemode with network for all these test if it should I try to boot regular and run, I actually went safe mode yesterday and it said somethin in the since user account been disabled, and my log in was gone. found the only restore point, brought me back to 3 days ago, to atleast be able to log in and I guess im in safemode, that first 6 bad  blocks on error scan, hard drive made a buzz noise like the loser buzzer in a game show. other red  blocks didnt made a noise just sounded normal.  "]},{"symptom":"Cannot use search in the File explorer on Windows 10 1909 (18363.535)        Hey.I have had windows 10 for quite a while. Recently I noticed, that I cannot type into the search field in File Explorer when I want to search for a file in some folder.This behavior appeared from nowhere and now renders this feature unusable and it is driving me crazy.Anyone experiencing the same issue or have suggestions on fixing this behavior?Thanks.","solutions":["Hi Dodancs, Usually, this happened in 1909 update. Might as well roll back to 1903. Based on your concern, there's a lot of people experiencing this kind of issue as well.What I can suggest is to rollback the updates: https:\/\/lifehacker.com\/how-to-undo-and-prevent-...And disable your windows update for the mean time, please follow this link for detailed guide:https:\/\/www.cleverfiles.com\/howto\/disable-updat...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"sea of thieves crashes on launch on windows pc        when i launch sea of thieves, it basically crashes.  Tried a few fixes but nothing. have tried a few of your help suggestions but still nothing.when it crashes no error box pops up displaying what error is happening. running latest windows 10 please advise. ","solutions":["Hi JOSHTHEGIANT306 I'll try to help you on this issue. Here are some ideas to test : - Uninstall \/ reinstall the game - Check for Microsoft store update (the 3 dots on the top right corner, in the store app)- Check for Windows update (manually search for update) - Try the troubleshooting guide of the store : https:\/\/support.microsoft.com\/en-us\/help\/402749...- Try the Xbox Beta app : https:\/\/www.xbox.com\/en-us\/xbox-appI hope this helps Regards","Nothing worked i tried it and also tried every thing from the microsoft store and still sea of thieves crashes at launch","Has the game launched at least one time without crashing ? What are the specs of your computer ?","One time The game did manage to get past the loading screen and into the beginning trailer but then it froze and an error popped up saying there was missing files that were needed to play the game and then it crashed. I have done everything the sea of thieves support has told me to fix it but nothing works.","I9 9700H1080 TI16GB DDR4 RAM","Hello plz reply","Well, if nothing works (delete \/ reinstallation \/ reset of the store \/ xbox app beta), i'm quite out of solution.Something must have gone wrong at the first download, and is keeping you from launching it again.The last solution I could give you, if you have another empty drive available, is to install a new windows on it, download the game and test it.Or you can reinstall your actual windows, but without garantee that it'll work, unfortunately."]},{"symptom":"Screen flickering\/stuttering during installation and after installation of windows 10        Hi, I recently built my first ever PC for playing games and other general uses and for a few months things where running perfectly I had no issues at all. However recently I encountered some screen flickering and after trying all the solutions I could find online I couldn’t stop it from happening, and my PC got to a point where I could not even log in. I eventually managed to reset the PC and tried re installing windows to see if it would fix the issue. However, during the installation process the screen was flickering, after the setup it didn’t occur for a while but as soon as i started using the PC it imidiatley started again even from doing something simple like looking at task manager. When I say screen flickering my monitor doesn’t switch on and off, the image of what is being displayed flickers and moves about it even happened while task manager was open and also occurred while the PC was in safe mode. It happened when the monitor was either plugged into the motherboard or the GPU.only time I don’t get this flickering is when I’m on my BIOS and the initial installation screen where you input your product key.Is this a software issue with windows 10? As far as i know all my hardware is in good working order, I’ve not overclocked my CPU or anything. if it helps this is my build.MB: MSI Z390-A ProCPU: Intel Core i5 9600K 3.7GHz 6 coreCooler: Hyper Cooler Master 212GPU: Gigabyte GeForce RTX 2060 superRAM 16GB (2x8GB) Crucial ballistix sport LTPSU: Corsair 550W 80+ GoldSSD: 1TB Sandisk & 1TB TCSunbowI would list all the things I have tried but the list is very long and I don’t want to draw this post out majorly. But none of the current windows solutions have worked.","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Do you have a different screen you can test the computer with? Given you are getting the same problem whether connected to the integrated graphics or your 2060 I'd wonder whether this is the common denominator? There's no reason why the specs you've listed should present any problem, and Windows 10 doesn't have any difficulty working with that spec usually either. The reason the display works in the BIOS and the initial \"loading\" screens could be because the resolution and refresh rate will be different for those screens.Regards, David","Hi david,Thanks for your reply. Yeah I have had the same issue on a different display, I tried using different ways to connect the displays e.g. HDMI, VGA, and a DisplayPort cable all showed the same issues. I also connected the displays to my motherboard and the issue was there still.Its weird after the re installation of windows 10 it  will sometimes happen instantly, other times I get a few days where it works fine then the problem starts again.Is there any software or any checks I can do to see if my GPU is damaged?Thank,Kyle.","You can try running FruMark - I've use this one myself. It's designed to work the graphics card really hard so is likely to show up a problem (especially with overheating) very quickly.https:\/\/downloads.tomsguide.com\/FurMark,0301-27... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Are you overclocking at all? If so would be worth turning that off to see if things settle down.Are there any BIOS updates for your mainboard you could install?","Okay thanks ill run FruMark and see if that brings anything up.No i’m am staying away from overclocking as I don’t want to do too much damage as i’m pretty new to building my own PC.No not yet ill try that too, I did install all the drivers from the CD but never checked if there were updates for my BIOS.I did try uninstalling, reinstalling, and updating the drivers in the device manager for my displays in safe mode but that didn’t do anything.Thanks,Kyle.","Hi Kyle and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.I just wanted to chime in a little. There is a known issue with the GPU and certain displays with G-Sync enabled. Do you happen to be using such displays? If so, do check out the compatible list of displays from NVIDIA here:https:\/\/www.nvidia.com\/en-us\/geforce\/products\/g...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi comnuts,This list is it showing the only screens that work with the GPU or the ones that don’t work? The monitors I have been using are an LG 27UK650 and a samsung C24F396. If this was the issue I had my PC running for about 2 months before I started to experience this issue.thanks,Kyle. ","Hi Kyle, the list shows displays that are compatible with NVIDIA G-Sync. Both the displays you have are not compatible so G-Sync shouldn't have been enabled. Your displays do support AMD Freesync.Anyway, please verify in your NVIDIA Control Panel that G-Sync aren't enabled.","Hi Comnuts,yeah I just checked the Nvidia control panel and it doesnt look like G-Sync is enabled. I also removed my graphics card and used the VGA port on my motherboard and the issue was there still. The display itself doesnt flicker on and off, the actual information being displayed is what is being affected.its like if you switched between 2 monitors with different resolution and the PC auto detects and adjusts the resolution for you, just without changing monitors. Thats probably the best way I can describe it. Thanks,Kyle","Ok, and since you were able to enter BIOS within out the flickering, it means your CPU is good. Pretty much narrowed to Windows.Can you do one more check that Variable Refresh Rate isn't enabled in Windows Settings? It's not supposed to be enabled by default as well.https:\/\/devblogs.microsoft.com\/directx\/os-varia...","I have had a look and I cant find that option in my settings, I noticed on that page you linked that it wont show if you dont have some requiremnts, I have windows 1903 installed so I’m guessing I dont have the other requirements to see the option.I have tried re-installing windows multiple times but the same problems comes back after a little bit.Thanks,Kyle."]}]}