{"windows":[{"symptom":"Documents not showing up after restore in the Quick Access Folders        I just restored a back-up from older Surface Laptop 1 to a new Surface Laptop 2, but none of the documents are showing up in the quick access \"Documents\" folder.I can find the restored documents under \"Local Disk (C:) > Users > MyName > Documents\", but this is a long way to access these documents.Is there a way to fix it?","solutions":["You probably moved your library folders at some stage. What is the full path to your \"Documents\" library?","Hi AToor When you restored WIndows, you would have wiped the Quick Access Cache (basically a list of recent items)It is only when you open those documents again that they will be added to the Quick Access sectionA quick way of doing this is if those documents are in a specific folder, right click that folder and choose 'Pin to Quick Access' . . .","This PC > Local Disk (C:) > Users > MyName > Documents\"","I am still having some issues where two of the folders under \"ThisPC\" are mapped to my OneDrive folders.These folders are (1) Documents (2) Pictures. (see the attached image and the cloud symbol next to these folders).When I right-click on the folder and \"Properties\" and \"Location\" and click \"Restore Default\" and \"Apply\", I get this message:When I click on \"Yes\", I get this error message:If I click \"No\" and then OK, I get the same message:Essentially, I am unable to change the location of this folder.Can this be addressed to change the location to default folders on my computer?Thanks.","You probably moved your library folders at some stage. What is the full path to your \"Documents\" library?Please see more details in my new post below."]},{"symptom":"updating xp to WIndows 10 home        Can an XP pro system with a pentium 4 processor, 200 GB dish space and 1 GB of memory load and run windows 10?  I have updated a smaller windows 7 system to windows, but the microsoft website doesn't mention xp upgrades.","solutions":["Oops. Autocorrect messed it up :)My apologies. It won't be able to run Windows 10."]},{"symptom":"identifying my desktop as a windows phone        I have an HP all in one desktop computer and every time I go to my account Microsoft sees it as a phone","solutions":["Hi Blane. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.One way to get a device correctly listed in your Microsoft Account is to set it as a trusted Device following these steps:https:\/\/www.tenforums.com\/tutorials\/5426-add-re...Let me know how that works. I'll be here to help until it's resolved. ______________________________________________ Note: Linked tutorial is from Shawn Brink who is a trusted Microsoft MVP."]},{"symptom":"How do I restore my computer back to todays date?  Please help!        How can I restore apps I had saved in my File Explorer folder?  Also apps I had saved in Windows and Microsoft?  ","solutions":["Hi Linda. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) Did you check the Recycle Bin on Desktop. The files can't just disappear, if deleted they have to first go into the Recycle Bin until it is emptied. You can restore them from there if so.If not then do a search for keywords or file names in File Explorer > This PC search box. If it hits on one's name, right click to Show File Location and go there to see if your files are there.2) See if you can System Restore to a point before the problem began following this guide:https:\/\/www.windowscentral.com\/how-use-system-r... 3) As to files you said were saved to Windows or Microsoft, what are these exactly? If they're installed Store apps which won't open then you can re-register them using this tutorial which will often bring them back:http:\/\/www.tenforums.com\/tutorials\/3175-apps-re...So try those and let me know what happens. Also any more detailed information about your problem can help me help you better.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"packaged not registered        I cannot open any files on my lap top. It states \"package not registered\"  Help all my work is on this computer. ","solutions":["Hi NH. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See how to fix Package Not Registered error in Windows 10: https:\/\/www.thewindowsclub.com\/package-could-no...https:\/\/www.majorgeeks.com\/content\/page\/how_to_...Run System File Checker from Step 10 in this checklist: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"How to enable complete memory dumps in Windows        Ever wondered why a blue screen happened, only to end up not being able to find a cause from the default memory dump? Well, that's why I wholeheartedly recommend switching your memory dump settings to \"Complete Memory Dump,\" so that it's easier for you to debug (find out) the causes of Blue Screens (bug checks) as you'll have a complete dump of the RAM at the time of the crash. By default, Windows only dumps the kernel memory space, which is useful for some crashes, but it's not perfect, as some blue screens are caused by processes or modules outside the kernel memory space. A complete memory dump has none of these issues, because it's quite literally an entire dump of all the physical RAM in the system.NOTE: A complete memory dump takes up a LOT more space on your computer's storage device compared to the default \"Automatic\" or \"Kernel\" memory dumps. More specifically, a complete memory dump will take up the amount of storage space equivalent to the amount of RAM installed. (Example: Let's say you have 8 gigabytes of RAM. The complete memory dump will be 8 gigabytes.) Despite this, it's not as big of a deal as some may make it out to be, as the memory dumps don't stack (by default every time a complete dump occurs, the previous one is overwritten) and it's only 8 gigs of space you need to take up. While I know some devices are storage constrained (and for those devices, like anything below 100 gigs, I would recommend sticking to an automatic memory dump, all other devices, complete) the small cost is worth it for better debug ability.Now here's what you do:1) In the Start menu in Windows 7 or 10 (or Start screen in Windows 8 or 8.1), search for Control Panel, and open it.2) Go to System and Security -> System -> then click on Advanced system settings.3) Click settings under Startup and Recovery.Bonus tip: I would also highly recommend disabling automatic restart here by unticking the checkbox. This is because if the computer does crash, you can see what the error code is, and look it up to find out the problem.4) Where it says \"Write debugging information,\" click the drop down and change \"Automatic memory dump\" (Kernel in windows 7), to Complete Memory Dump. Then click apply and ok.It will ask for a reboot, so if you want to, go ahead and do so.That's it! That's how you enable a complete memory dump in Windows. ","solutions":[]},{"symptom":"When trying to activate you get 0xC004F074 with description \"The Key Management Server (KMS) is unavailable\"        When trying to activate you get 0xC004F074 with description \"The Key Management Server (KMS) is unavailable\"I have been running windows 10 pro for 4 years with an active license. It is telling me I have to activate ","solutions":["Hi VictoriaKettelkamp, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.These are the steps that the Windows MVP shares on its website, in the article it addresses the problem and offers its suggestions to try to solve it.https:\/\/www.thewindowsclub.com\/windows-10-activ...Let me know if you have something else that I can help you with, I'd be happy to help.Regards, Marc M. Have a nice day Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","It seems that the Independent Advisor is not familiar with a KMS (Key Management Server) license.You have the wrong type of Windows license. You were given a KMS license, which is also known as a volume license. This type of license is sold to organizations that buy Windows licenses in large quantities. A computer with a KMS license must be in regular contact with the organization's KMS server to maintain its activation, otherwise the copy of Windows loses its activation, which is what happened in your case.The correct type of license for an individual user is either an OEM (Original Equipment Manufacturer) license - which is what you get when you buy a computer from a computer manufacturer - or a Retail license - which is what you get when you build a computer and purchase a copy of Windows on your own.This unfortunate situation sometimes happens when an unscrupulous repair shop re-installs Windows with a stolen or hacked KMS license. In any case, now you need to buy a Retail license and do a clean install of Windows.If, in fact, your computer was recently repaired, you ought to complain to the repair shop. I say this because, if you originally purchased your computer from a computer manufacturer, your computer came with a valid OEM license. In that case, the only way for it to lose that license is if someone removed the original copy of Windows and replaced it with a KMS-licensed copy of Windows. An OEM license doesn't spontaneously become a KMS license, and no update from Microsoft would do that.WARNING: The web page recommended by the Independent Advisor contains a link to well-known harmful software called Reimage Plus. The link is found underneath this text:Download this tool to quickly find & fix Windows errors automaticallyPlease do not click on that link!"]},{"symptom":"Windows 10 updates locked up laptop        Hello,I have a laptop that is useless now, had to buy a new one to pay bills.  Seems the last updates made the graphics incompatible so all I am able to reach is the bios page.  Luckily the December 5 updates were given me similar troubles so I backed up files on a separate drive.  I fixed that problem by finding a Utube video instruction of typing a certain narrative in command prompt (check disk).Currently it only goes to bios, I cannot get to command prompt or repair options.  I bought a repair thumb drive that loads if bios options are changed but again a grey screen prevents going further. Needless to say I am livid that the fundamental operating system and developed by a powerhouse like Microsoft would cost me a new laptop.  Since this unit was not too expensive, sending it to get repaired most likely is not smart.Any instructions would be appreciated, I probably have tried all of them but help if you can.","solutions":["Hi LSF. I'm Greg, an installation specialist and 9 year Windows MVP, here to help you.A laptop is made up of hardware so unless hardware fails you can always repair or reinstall Windows and will probably have a much better install than the one you had. There is ALWAYS a way to boot the media even if the auto repair functions won't respond. If not then we troubleshoot until it boots. I've never seen a single case out of over a hundred thousand I've handled in forums where media could not be made to boot as long as the hardware is still good.Here are steps to recover from failed Updates or Version Update install which causes Windows to fail to start or function. If any steps won't work then report back and move on to the next. At least one step will always work, leading up to if necessary doing an automated Reset or a gold standard Clean Install: 1) Try whichever method works in this tutorial link to get into Advanced Startup Options to run System Restore or Uninstall Updates button, or if this is a version update Go Back to Old Version:https:\/\/www.tenforums.com\/tutorials\/2294-advanc.... Easiest is to restart or force shutdown the PC 3 times to force it into Repair Mode.If you are able to access System Restore or Go Back and it fails, skip to step 3.2) If necessary borrow another PC and follow the steps in the middle of this download page to create bootable installation media to access the repair options if not accessible by any other method:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... The bootable media is also the only method that doesn't require the password if you're stuck on that.Boot media by powering up the PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... You may need to enter BIOS\/UEFI Setup to turn off Fast Boot if it won't allow the Boot Menu key to interrupt starting Windows:https:\/\/www.mydigitallife.net\/comprehensive-lis... Choose UEFI version of media if offered, browse to second screen to Repair Your Computer link.3) Choose Advanced Troubleshoot options to run System Restore, or if this was a version Update choose More Options to Go Back to Old Version.If it rolls back then you can hide the Windows Updates and Version Upgrade responsible until they mature by installing and running immediately the Hide Updates tool:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... There is a new option after Version 1809 to roll back Windows Updates from the Repair Mode in Option Four here:https:\/\/www.tenforums.com\/tutorials\/5486-uninst... If this fails try a Startup Repair, or go back to Troubleshoot Options on the previous screen to Reset your PC which will save your files while reinstalling Windows.4) If that fails you can use the booted media created in Step 2 to Clean Install the latest version which should get you past all difficulties as it has hundreds of thousands of others who have followed the steps in this link and never come back to report another problem: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... The link compiles the best possible install of Windows 10 that will stay that way as long as you stick with the tools and methods given.There is a step to rescue files from the same bootable media: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Make sure during the booted install to follow the illustrated steps to delete all partitions down to Unallocated Space to get it cleanest, then click Next to let it auto-create the needed partitions, format them and begin install - this makes it foolproof.The media provided for the Clean Install is latest and normally the problems go away with the Clean Install, however if they don't you can find earlier version media to use here:https:\/\/tb.rg-adguard.net\/public.phpBurn to DVD or create bootable 8+gb flash stick installer using this tool installed to Windows:https:\/\/www.microsoft.com\/en-us\/download\/detail... Then once you're back in Windows 10, you can block the problem Update using one of these methods:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...For Version Updates the most stable method to install is using the media as shown in these steps for overcoming Version Upgrade problems:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Good news, Microsoft is giving back to users more control over Updates as announced recently here:https:\/\/blogs.windows.com\/windowsexperience\/201... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","What laptop is it?","Thanks, I am not seeing anything promising in the solutions, again there is no way to see the screen since the last update after 1809 was incompatible with the integrated graphics.  Cannot access repair or system restore.Started with Win 7 home premium and do not know the key, will search to see how to find it.","Toshiba C655D-S5057 not an expensive model as I do not require one.","I gave you the exact steps needed to get into Repair Mode to do the necessary repairs. If those don't work I also gave you exactly how to create bootable media, how to boot it and then repair, reset or reintsall Windows.Every step I gave is backed up by an illustrated tutorial. If you have any questions you only need to ask back.So may I ask why there's nothing \"promsing\" when you have literally everything needed?If you were to take this to a shop, they would likely reinstall with less than half as good of an install as I gave for you to do yourself with my help - after trying all the other possible repairs I gave.","Calling it a night, more on this over the weekend.  Unit sits with the same grey screen, created the thumb drive of #2 off new laptop, tried to start dead one by holding down the Bios boot menu keys one at a time and both, all resulting in same grey screen.  Have it starting with USB first, secure boot turned off.  Last try was in Bios, I clicked on HDD recovery and let it try to start again, it sits grey.","USB first in Boot Priority is wrong, it must remain Windows Boot Manager. That's the whole point of using the BIOS Boot Menu key to trigger the media, not the Boot Priority order.If you know for sure the Boot Menu key to press, then hold it down while powering on. If it skips it then it's either the media is not created correctly or it's bypassing it due to Fast Boot being set in UEFI\/BIOS Setup.Test the media boots in another PC correctly to know it's good.","Switched to hard drive startup in Bios, held down each Bios key separately and both together, after it gets to Preparing Automatic Repair (still holding button down), it again goes to grey screen.  This takes about 3.5 minutes.Options in Bios:Enter SetupSecuritySecure Boot (I have this disabled)TPM (it is enabled)Power Management (nothing here it seems needing change)AdvancedChange Boot Order (I have it in this order: HDD, USB, ODD, LAN)System ConfigBuilt in LAN (this is enabled, I do not have a LAN though)Web Camera (disabled)Boot Mode (set on UEFI Boot, option is for CSM Boot)  unit came with Win 7, free upgraded to 10.Power on display (set on auto selected, options of System LCD only or External Display Device) I have nothing plugged in but the usb.Function Keys (set to Standard F1-F12 Mode)HDD Recovery (I had tried this last night, it went to grey but this was when the USB was first in line)","For UEFI boot, if you have a UEFI install (with the EFI System partition) then for almost all BIOS' the Windows Boot Manager must be set first to boot.It sounds like it is bypassing the media and trying to start Windows, if that's the same behavior as when you try to start Windows.Test that the media will boot in another PC. If not then create it over again using only the Media Creation Tool and following the instructions for creating media in the center of the Download page here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m...For a UEFI isntall the media must be booted as a UEFI device. It should show a loading screen, not preparing Automatic Repair. The latter means it's skipped the media.If your BIOS boot Menu key is not working then you can set flash stick to boot first in Setup under Boot Priority Order, followed by Windows Boot manager. But you must unplug the flash stick before any restarts during reinstall or repairs or it will start all over again.","USB works fine, made from the new computer and ran setup after plugging into new one, it tried to start loading things so I escaped and performed this two times to make sure it was not fouled up from doing this.Clicked on USB in Bios, windows logo comes up and USB lights up, it spins a bit then goes to grey screen, let it sit for a good while.   Normally the Toshiba logo comes up when it tries to go into repair mode so it seems to be trying to read the usb. Had it on CSM boot, I do not know how to get to Windows Boot Manager.  Maybe this is just the first screen in Bios that lists the HDD, USB, ODD and LAN."]},{"symptom":"Moving Files        I want to move many files in my Dropbox to a flash drive (2 TB) in drive E: I don't want to keep the files in Dropbox that I want to move to E:","solutions":["Okay, is there a reason you cannot do this?  Are you getting an error?","I had the same problem.   I copied \"a set of folder and files from Desktop Dropbox\" into another \"Folder on Desktop\", but only the File Folder Names (Tree) went over. All Files proper went missing.   I think the current available method has to be by \"Download from Online Dropbox\". But this method cannot bring the Folder Structure down.  This time Files went over but not in folder structure.So it is likely that the those list of files shown on Desktop Dropbox are just virtual links (in Setting).   There could be problem in transfer when the Dropbox size had grown into large GB."]},{"symptom":"Unable to clear all Task View items        bing films\/clips in Edge - how to remove them? When I try to do it in task view by clicking on that - all is removed except the bing films? They stay there so what do I do to clear everything? In Bing all is clear but they are still there in the task view??Can you help me?Matthew Brown<Moved from Music, Movies & TV><Original Title: bing films in Edge - how to remove them from the task view?>","solutions":["Hi Matthew, Thank you for posting in Microsoft Community. I understand that not all the Task View history is cleared from the Timeline in your Windows 10 computer.Ideally, when you use the option to clear Activity History, this would clear all the viewing history from the timeline. However, we can check a few settings and see if you are able to clear the Task View timeline. I would suggest you to check Manage activity history settings and see if you are able to clear the Timeline.Please make sure to read the “Notes” section before making the changes.If you want to clear the entire Activity History from your device, you can you can clear and delete both the activity history stored on your device and sent to the Microsoft cloud. SelectStart, then selectSettings>Privacy>Activity history. UnderClear activity history, selectClear. If you still see the items in the timeline, you can try the manual steps:Press Windows + E key to open File Explorer.Browse to C:\\Users<Your User Name>\\AppData\\Local\\ConnectedDevicesPlatform\\Search for the file ActivitiesCache.db.Rightclick on Taskbar and open TaskManager.Go to Services tab and look for the serviceCPDUserSvc_XXXXXX <XXXXX is a random number>Right click on the CPDUserSvc_XXXXXX and select Stop.Now go to ActivitiesCache.db and rename the file toActivitiesCache.db.old. Delete the rest of the file in the folder.Do not delete the folder.Restart the computer and check if the items are still in the Task View Timeline. Let us know how it goes. Regards,Vivian S  "]},{"symptom":"Text boxes invisible, system text invisible\/strange font, can't navigate anything because of it. Help please!        I'm at a bit of a loss. I have absolutely no idea what started this, as everything was sunshine and lollipops this very morning.I keep my PC in hibernate most of the time, which may be a factor, but I think it's mainly because of my system thinking it's Japanese.I did it a long time ago (2 years I think?) to do something I can't remember at the moment (was probably to download a Japanese game) and now, everything has gone haywire to the point that I genuinely cannot tell anything apart.Word documents have gone entirely blank as well, and this issue seemed to stem straight from a word document. I have deleted the Japanese language pack but I think it's also changed the Canadian and American English packs.To be frank, I don't know what's going on, and have no idea how to fix it. All help is greatly appreciated.A little album of images to show what I mean: https:\/\/imgur.com\/a\/8g84psf","solutions":["Hi Sirus. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) See if you can System Restore to a point before the problem began following this guide:https:\/\/www.windowscentral.com\/how-use-system-r... 2) Download, install and run a full scan with the most powerful on-demand free scanner Malwarebytes:https:\/\/www.malwarebytes.com\/mwb-download\/.In the Scan Settings first set it to include scanning for Rootkits. If necessary run it in Safe Mode with Networking, or Safe Mode accessed by one of these methods:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... Clean up anything found, restart PC and then run again until it comes up clean. Check for any remainders in Settings > Apps > Apps & Features, and also in each of your browser's Extensions, Home Page settings, Search service or Add-On's as shown here:https:\/\/community.box.com\/t5\/How-to-Guides-for-... Then check for damaged System Files: https:\/\/www.lifewire.com\/how-to-use-sfc-scannow... If it cannot repair them see Step 10 here to continue: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... 3) If that fails run a Repair Install which reinstalls WIndows while keeping your files, programs and most settings in place, by installing the Media Creation Tool from this linkhttp:\/\/windows.microsoft.com\/en-us\/windows-10\/m..., open the tool and choose Upgrade This PC Now. This will solve most problems and also bring it up to the latest version which you need anyway and by the most stable method.If you want to keep Malwarebytes as an on-demand scanner then you can turn off its Real Time trial version in it's Settings > Account Details tab.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Okay... nevermind. Everything seems to have just fixed itself on its own...I have absolutely NO idea what fixed it. I launched a steam game and seemingly, everything fixed itself on its own. Even my word documents are fine.I was at a loss before, but now, I'm just at a total loss for words. If this happens to you, I guess... just launch a steam game? Or something? I'm so confused... but everything seems to be fine now, so..."]},{"symptom":"Display randomly shuts off        I recently build a new computer and it has been working fine except for one issue. My computer will randomly shut the screen off while everything else is still running. I can hear sound through my headphones and all the fans and RGB are still on. The only way to shut the computer off is to flip the power switch on the back of the system. My specs:Processor: Ryzen 5 2600xGPU: RTX 2060RAM: 16gb Corsair Vengeance ddr4 3000 memoryMotherboard: AsRock b450 steel legendPSU: Rosewill 650w bronze 80+Help will be greatly appreciated, thanks.","solutions":["Hi, thanks for posting your question in the community! my name is David an independent advisor and I'm here to help you.To better identify your incident, it is important that you answer the following questions:* When the screen turns off, do you see the mouse cursor? * How long does it take before your screen turns off? * Have you identified if this incident occurs after running a particular application?* What antivirus software do you have installed? * Have you updated the video drivers of your device? I want to rule out that this incident is caused by a failure in any controller of your computer, therefore I recommend entering Windows in safe mode following the steps of the following linkhttps:\/\/support.microsoft.com\/en-us\/help\/12376\/... and using your device as normal as possible, if the incident does not occur , we must think that the problem is a controller.Let me know the results of this test and the answers to the questions I have asked you, I will be waiting for your answer.","Well, it seems like it just randomly turns off. I've been playing games and it turns or even sometimes when I'm just watching youtube. I don't see my mouse cursor, it makes it so that there is no connection to the monitor even when I try unplugging the monitor and plugging it back in.  It does not take a specific amount of time to turn off, it seems random. Windows security was not on, but I just now turned it on. The computer is new and all the drivers are up to date. Thanks.","Hi, thanks for keeping in touch, we will continue to look for the cause of your incident.I would like to ask you, what the result was when entering safe mode, the screen continues to turn off?I want you to perform the following test, if possible when the incident occurs on your monitor, connect your device to another monitor or if possible on your TV, if the image is reproduced on your TV, it is possible that the fault comes from your monitor, if not, try changing the connection cable. I also want you to uninstall the video driver and leave the generic Windows, just to rule out that the problem is a badly migrated video driver.Finally, I would like you to verify that the components are correctly connected to your motherboard.Let me know the results of the processes, if they have been useful and if you need more help from me, I hope we can solve your incident soon.","I am writing this while the issue is happening. I didn't yet put it into safe mode, but I will after this. I tried hooking it up to a different screen while it was happening and there was still no signal. I also tried using two different HDMI cables. One thing is that the incident doesn't happen quickly, it happens after I have been using it for a while and It doesn't happen every time I use the computer. I am going to try some of the other things you recommended. I might install something that lets me see what is on my screen while the display issue is happening. Also, pressing that power button on the top of the case doesn't work while the issue is happening.","Also, I am looking at event viewer and here are a few errors and warnings it had around the time the event happened.\"The Desktop Window Manager process has exited. (Process exit code: 0x000000ff, Restart count: 1, Primary display device ID: NVIDIA GeForce RTX 2060) \"It was saying that a bunch and I don't know what it means.It was also saying \"Faulting application name: dwm.exe, version: 10.0.18362.387, time stamp: 0x8e064b77Faulting module name: unknown, version: 0.0.0.0, time stamp: 0x00000000Exception code: 0xe0464645Fault offset: 0x0000000000000000Faulting process id: 0x1b84Faulting application start time: 0x01d5c9028666c2b2Faulting application path: C:\\Windows\\system32\\dwm.exeFaulting module path: unknownReport Id: 6ae8d0db-74a5-4034-b3df-ab533f7a6b92Faulting package full name: Faulting package-relative application ID: \"  Another thing that you might want to know is that I am running an unactivated version of windows and I just haven't gotten around to buying an activated copy. If you think that that would be helpful I am fine with buying one.","Hi! Thank you for the additional information and for keeping in touch. Tell me, what was the result after using the PC in safe mode? Thanks for testing, we can rule out failure of your monitor and connection cables. In that case, we can rule out failure of your monitor and connection cables. Let me know the result of the other processes I've shared with you.Could you explain a little better about the case button? if you press it does not restart the PC or does not turn off?Basically what the event viewer is telling you, is that there was a conflict between your video card and the Desktop Window Manager (dwm.exe), it leads me to think that the problem may be very related to your video card, It may be that in software or with a hardware failure, it is necessary in this case to perform the driver processes that I recommended in my previous response. As an additional measure, try an In-place upgrade on Windows 10 to rule out failures on the operating system itself, you can be guided by the following article from the Microsoft community https:\/\/answers.microsoft.com\/en-us\/windows\/for... Answering your last question, the lack of activation in your Windows if it can generate problems for you in the future, mainly related to the personalization of your system, some Microsoft account synchronization functions will not be available and some important updates may not be installed. Otherwise, it should not be related to the problem you have at this time.Let me know what the result of the processes has been, remember that I am here to help you find a solution to your incident, I will be waiting for your response.","Putting the PC in safe mode made it so that I couldn't play any games, and the issue pretty much only occurs while I'm playing games. About the button. While the issue is happening, pressing the power button does not do anything, I have to press the reset button. I did the Windows 10 upgrade, but the issue still occurred later, while I was playing a game. I think that I found something that is important in the event viewer, \"Display driver nvlddmkm stopped responding and has successfully recovered.\" Thanks.","Hello again, thanks for the additional information. If you could not perform the tests in the safe mode the situation is a bit complicated, but do not worry, we will validate some additional things.Again, the event viewer tells us about a conflict with your video card, I would like to ask you, did you uninstall the video driver from the device manager by checking the option \"Delete the driver software for this device\"?If you already did, try again, but this time try installing a slightly older video driver, try it with two or three previous versions, remember that you can download the driver from the pagehttps:\/\/www.geforce.com\/drivers select your graphics card model and you will see the list of drivers ordered by version. During the driver installation process, disconnect your computer from the internet. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Once this is done, deactivate custom automatic updates from manufacturers, follow the following path: Control panel> System and security> System> System protection> Hardware tab> Device installation settings> No> save changes.Perform the processes and let me know the results, I will be waiting for your response."]},{"symptom":"Win 10 家庭版加入局域网，可以访问其他计算机，但是其他计算机无法访问本机        您好，  本机是win10 家庭版系统，加入公司局域网，可以访问公司其他计算机分享的文件，但是其他计算机无法访问本机，没有权限访问，已经尝试使用 net user guest\/active yes 在命令提示符中输入，但是不知道下一步如何操作，谢谢！","solutions":["您好,我是独立顾问(Independent Advisor)Dexter,请让我来帮助您. 不建议直接开启没有密码保护的guest账户,可能会导致安全隐患,您可以参考我这篇文章中的步骤设置一下共享: http:\/\/alian.fun\/archives\/69_______________________________________________ 免责声明:以上涉及到的网址链接均[不是]来自微软的官方网站.这些页面所提供的信息均较为准确可靠.不过依然提醒您需要注意这些页面可能会包含您有可能不需要的产品广告,所以在您下载安装这些广告产品的时候请务必看清楚并确认这是您所需要的."]},{"symptom":"Microsoft Media Center Electronic Program Guide (EPG)        My Microsoft's Electronic Program Guide (EPG) as my TV listing provider was retired yesterday as of January 2020.  I need another TV listing provider to continue receiving TV Program Guide information.  What are my options?* Moved from Community Participation Center","solutions":["Nobody?","Fellow geeks that are sobbing over the demise of media center said \" install EPG123 and get a subscription to SchedulesDirect:http:\/\/epg123.garyan2.net\/","I don't know if this will help or not, but something strange happened on my HTPC this week. I turned on WMC today and the guide information was there, even though it was gone earlier this month... No clue why, but I have been playing with alternative media player apps (XBMC and Plex). I guess it's possible one of them is doing it, but I haven't had a chance to dig into it yet..."]},{"symptom":"issue with installing a office proffesional plus 2016        ok running latest widows 10 build 64 bit pro  on virgin system. apparently i am not able to install office office proffesional 2016 of a disk.installer is 64 bit all i gtt is orange window with office logo blinks then a smaller window shows up with spinner circle telling me we are getting ready or some bs similar and then it just hangs and does nothing after that window disappears.","solutions":["Go to the Office Forum.","Hi, markdoom Please, Post this on msoffice forum.","Typically, Office Pro Plus is a volume-licensed product, not usually sold on a retail basis. Where did you acquire the license?"]},{"symptom":"Sketchpad has completely disappeared from Ink Workspace        I have tried rebooting and turning Ink workspace on and off from settings and taskbar. It is only showing me Whiteboard and Fullscreen snip. Did Windows do away with sketchpad, forcing me to login with a Windows ID to use Whiteboard? Or is this a bug from a recent update? Or is there anything else I can try?","solutions":["Hi JN. I'm Greg, an installation specialist, 10 year Windows MVP, and Guardian Moderator here to help you.See if one of these help: https:\/\/www.windowscentral.com\/windows-ink-how-...http:\/\/www.informit.com\/articles\/article.aspx?p...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","This is what I see when I click on the icon.","Sorry, didn't go through the first time.","I have tried rebooting and turning Ink workspace on and off from settings and taskbar. It is only showing me Whiteboard and Fullscreen snip. Did Windows do away with sketchpad, forcing me to login with a Windows ID to use Whiteboard? Or is this a bug from a recent update? Or is there anything else I can try? ________________________________________________________________________Hi jnossie,        The Screen Sketch was replace with Snip & Sketch in Windows 10 May 1903 Update. for more information please see Link :https:\/\/mspoweruser.com\/microsofts-snipping-tool-replacement-gets-new-name-capture-options\/I Have Not tried the new White Board. I believe you need to download it by clicking on the White Board that you see in your image.I Hope This HelpsIf My Reply Answered Your Question, Please Mark It Answered. Thank-You","Hi JN. I'm Greg, an installation specialist, 10 year Windows MVP, and Guardian Moderator here to help you.See if one of these help: https:\/\/www.windowscentral.com\/windows-ink-how-...http:\/\/www.informit.com\/articles\/article.aspx?p...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","If this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Update History, then uninstall them from the link there, and immediately check for these again and hide with the Hide Updates tool explained here: https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t...If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....After 10 days you can reinstall the older version using downloads available from Microsoft TechBench here:https:\/\/tb.rg-adguard.net\/public.phpBurn to DVD using WIndows Image Burner or create bootable flash using one of the options here:https:\/\/www.tenforums.com\/tutorials\/2376-create...","Same thing happened with me! Microsoft please fix this! I don’t want to have to roll back the update just to get this one feature back. It seems like this must be a glitch. ","Agreed.","I've deleted the Latest update and i wont be updating it again !!!!!!!!!i don't like White Board because it collects info , if u have some ideas in there its at Flight risk to be stolen by Microsoft. and sold to someone who can make profit out of it.i know that all my sketches are useless but not everyone is like me , some uses this to write books or make sketches for blue prints.i don't like the fact that once i installed Whiteboard , it DEMANDS that i accept the terms .... when i tried to open the Terms link ( IT WONT EVEN OPEN ) i looked over the internet and some say if u deiced to us ACCEPT terms without reading it , it gives the company privileges to write WHATEVER they want in it Later on , it can simple give itself permission to Sell , record ur voice and use camera and location as much as they like since u have Agreed on something u didn't even read. ALL LEGAL ! ONLY BLAME YOURSELF.not another (( facebook )) mistake.I'll return back to SketchPad until the matter is resolved . + you cant collect info from our personal devices , you are not allowed to , not even for advertising , i don't allowed and everyone else should do the same. + you cant force me to sync my sketches to my Microsoft account without my permission.   ","Exactly the same has happened to me on an HP spectre x2Another tablet is still offering sketchpad"]},{"symptom":"Office 365 Home subscription - print problems        With the last update, I am unable to print in color from Word.  Don't know if other Office programs are similarly afflicted.This is a must-have capacity for me (a deal-breaker relative to my subscription), so I am very upset by this, especially since there was no advance warning, and seems to be no post-event fix.  Typically, there is no option to specify \"Office 365\".That means this problem will be lost in the shuffle.  Extremely bad roll-out and failure to plan for the unexpected!!!!","solutions":["Hi Judith. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.A) If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....If that doesn't work you can also Go Back in Repair Mode as shown here: https:\/\/www.tenforums.com\/tutorials\/2294-advanc...B) If this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Update History, then uninstall them from the link there, and immediately check for these again and hide with the Hide Updates tool explained here: https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... You can also use System Restore from within Windows to get back before the problem began, then check for Updates with the Hide Update tool and hide them:https:\/\/www.windowscentral.com\/how-use-system-r... C) Run the Printer troubleshooter at Settings > Update & Security > Troubleshoot.Check the Color settings in Print Properties: Type Printer in Search box, open Printers & Scanners, click on the printer, then Manage, then Print Properties.D) If nothing above helps then Rather than spending too much more time fiddling I'd simply Clean Install the printer which always works, lasts longer and actually saves time:1) Power up the printer, if wired unplug it's USB cable from PC. 2) Go to Settings>Apps>Apps and Features to find and Uninstall any printer software.3) Use one of these methods to remove all of the old printer drivers: https:\/\/www.tenforums.com\/tutorials\/101274-unin...https:\/\/helpdeskgeek.com\/how-to\/remove-uninstal...4) Now type Control Panel in Start Search, open CP, choose Icon View. In Control Panel open Devices and Printers, right click printer to delete Printer and any scanner or fax of the same name. Restart PC.5) Go to the printer model’s Support Downloads webpage to download and install the latest full software package. Now is also the time to check for any newer printer firmware to install which matters a lot.6) Extract Printer software, right click Setup file to Run as Administrator. Follow the setup screens closely as you install the software. For USB it should prompt when to plug in the printer.Older software may need to be installed in Compatibility Mode to run correctly: https:\/\/www.groovypost.com\/howto\/run-old-softwa... If you have further problems reply back with results of each step. Once it's installed and you've run a test print, then scanned it to see that it opens on the desktop, open the Printer software and go into its Settings to set the scan-to file location you prefer, also the email app you want opened for Scan to Email, if applicable.I hope this helps. Feel free to ask back any questions and let us know how it goes. If you will wait to rate my post until we are done, I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I'm not having a problem with printing in color. What kind of printer do you have? What device\/computer were you printing a word document from?I have a brother MFC J825DW. I just used word, typed a short paragraph in red and printed it without any problems. I am currently on my Dell Laptop.What do you mean by, \"Typically, there is no option to specify \"Office 365\".\""]},{"symptom":"AFTER UPGRADE FROM WIN 7 TO WIN 10--TOTAL DISFUNCTION        Hello Community: Today I upgraded my HP Desktop (circa 2011) from Win 7 Pro to Win 10 Pro. I used the Microsoft Media Creation tool. My PC totally met the qualifications, had a valid license etc. I followed the instructions to the letter. At the end of the update, everything appeared to come up properly. I did the updates as needed, and activated Defender,. I also set up password protection. After a couple of restarts, the system tray showed no internet, the sound icon had a red X over it. I began by trying to diagnose the wifi problem. I discovered that the system was stuck in airplane mode. I attempted numerous fixes as presented in my Google search. That included disabling\/enabling,uninstalling\/reinstalling network adapters and a total reset of network adapters. The toggle switch for \"Airplane Mode\" is grayed out and cannot be accessed. I explored various ways to do this, including disabling Airplane Mode, all with no positive result. At long last, I checked into System Restore. That, too proved not doable because the drives could not be rescanned. I am attaching various screenshots from the settings pages to give you an idea of what I am encountering. At this stage, my PC is totally unusable. I looked at the option to \"Reset This PC\" It warns that I will be unable to undo the upgrade or go back to Win 7.  Please let me know what the most logical fix might be (if any).  Thank you...Jeff  Please see attached files...","solutions":["I'm glad to hear it, Jeff. I dont' remember anything mentioned about two old copies of Office being also installed as that would have been my first focus.You're welcome to ask any questions in the Clean Install tutorial comments section, or you can ask for me here in forums any time.Let me know if there's anything else. Also when ready please mark the post which helped most as the Answer, to help others. A rating is also appreciated."]},{"symptom":"Microsoft Flight Simulator low on memory problem.        I have a copy of FSX and love the game. However, with addons to enhance the appearance of the game I get a message telling me I’m out of memory after a short while of flying, less than an hour and one half. I was told that this is because Flight Simulator is 32 bit and no matter how much RAM I have, the game will only recognize the first 4GB. My PC has 16GB of RAM, an i9 8950HK, six core processor. Also, the SSD is a 2TB Samsung 970 Pro (NVMe) and a Nvidia 1050 Ti (4GB) video card. I have installed several US states that are photo real and I have left the HD water enhancement installed. I have also adjusted the settings within Flight Simulator to the lowest settings that still give me a good frame rate and realistic look. Is there no way around the 4GB limit? No utility to access RAM above 4GB? I’ve also stopped as much as I can from loading when my PC boots up. Many thanks to all, Blair...              PS, my OS is Win 10 Pro.. ","solutions":["Hi Blair,I'm assuming that your Win 10 Pro is a 64 bit version and not 32 bit.   And yes, FSX is limited to 4 GB of VAS (Virtual Address Space, not RAM) as it is a 32 bit application.First off:  have you got the HIGHMEMFIX=1 entry in your fsx.cfg?   You probably know what I'm referring to and though it may not necessarily solve your issue, it is a must for FSX.Secondly:  you have a very good setup for FSX, so no problems in that regard.   With your installed photoreal scenery, can you load only the scenery that is applicable to your flight plan?   In other words, go to FSX Settings and to your Scenery Library.  Make sure that Add On Scenery is at the top.   If you have your photoreal U.S. States under that, make sure that the (two) cities that are on your flight plan are the only ones enabled (of the photoreal cities, that is). Thirdly:   make sure that your page file is set to your preference.   It is normally suggested to have it set to \"Automatically manage paging file size for all drives\".   Though you can set a Custom size depending on the available space on your SSD.If after all that you are still getting OOM errors, it could be that your VAS  is running low (usually because of photoreal scenery, heavy textures, clouds, high LOD radius, etc.) and may also be a high frame rate setting (generally 30 fps is considered more that adequate for smoothness).   So, if you are still seeing OOMs, then you may need to start from scratch (i.e. deactivate all photoreal scenery and move sliders to minimums (what is acceptable to you), with FPS at 30) and see how you go.   If no OOM, then progressively move up the scale and find out what is causing the problem.ChrisNB:  Have a look at this good article from PMDG:   https:\/\/support.precisionmanuals.com\/kb\/a108\/vas-management-stopping-out-of-memory-oom-errors.aspx"]},{"symptom":"event viewer        got problems something like( administrative logs).","solutions":[]}]}