{"windows":[{"symptom":"Help with Windows 10 update failure        I am trying the install the latest Cumulative Windows 10 update KB4530684 on my inspiron 5759 x64 intel-based laptop which has consistently failed.Looking at the Windows 10 installation log (before it was deleted!) it appears this may be failing because previous update KB4524570 failed. All previous Cumulative updates succeeded. I installed the latest updates from Dell then ran the manual install of this update and it failed again.I followed some advice from MVP Greg Carmack posted here and it did not help, but the steps deleted my entire update history event log:https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/2019-12-cumulative-update-for-windows-10-version\/b4a4a27c-b065-47a0-a408-77e0e7e9b5fbQuestions:1. Can I restore my installation history log? I searched my PC and don't see the renamed files anymore mentioned in the link above.2. I need help getting the KB4524570 to install and further KB4530684 installed.Any help would be greatly appreciated.Joe Boriotti","solutions":["Hi Joe. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Resetting all the components of Windows Update will clear out the History, as will the Repair install which is the same as a Version Update.Did you do the Repair Install which is the last resort Step? If not and none of the other steps worked, it always works.If you don't want to do that then manually install the missing Updates which is one of the steps I'd already given. They are here:https:\/\/www.catalog.update.microsoft.com\/Search...Read more about those Updates here: https:\/\/support.microsoft.com\/en-us\/help\/452457...https:\/\/support.microsoft.com\/en-us\/help\/453068...Installing those might get it working again too, the reason I put that as one of the firs steps I gave you before.Keep me posted on your progress as I will be here to help until the case is resolved.","Hi Greg,Before I try this final recovery step, may I know if this will invalidate installed applications such as Microsoft Office?Joe","Joe, the Repair Install saves your files, apps and setting in place while reinstalling Windows, solves most problems, takes about an hour.Your files should always be backed up anyway if you value them at all."]},{"symptom":"all in one acct.        how do I go back to separate acct. for each computer just to help windows10 from mixing up everything it doesin accounts","solutions":["Hello nlfox,Creating a local admin account would help in this case, the steps to do that are shown in the following link https:\/\/www.groovypost.com\/howto\/create-local-account-windows-10\/","Hi NL. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Just make sure the account you want to keep is an Admin account because there must always be one:https:\/\/www.windowscentral.com\/how-change-user-...Then remove the unwanted account(s) by one of these methods: https:\/\/www.tenforums.com\/tutorials\/5464-delete...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Laptop restarts automatically after closing Lid        Hello,I close the lid of the laptop, and then when opening the lid after a few hours, the laptop has restarted automatically because of which I lose my work. This has happened 3-4 times before too.Can anyone please tell me what may be the reason behind this? And any diagnostics for it?Thank You.","solutions":["Hi Lumiere. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.What is set at Settings > System > Power & Sleep > Additional Power Settings > Choose what Closing the Lid does? Try Sleep or Hibernate.The issues is likely with Sleep. I will give you all possible fixes for Sleep. If you need help performing any step just ask back:First confirm you have the Sleep options configured correctly as shown here: https:\/\/www.tenforums.com\/tutorials\/2843-change....You might want to try Hibernate to succeed Sleep, or use Hibernate in place of Sleep - it's just a deeper sleep that actually powers off because desktop stored in RAM during sleep is written to hard drive hiberfile then powered off.Most Sleep problems are caused by the Display driver, so try updating yours from the PC or Device maker's Support Downloads web page for your full model number, Serial Number or Dell Service tag. While there make sure you have the latest BIOS, Chipset, Network, Sound, USB and all other drivers by comparing those posted for download with the version and date of the corresponding ones in the Device Manager.If that doesn't help then in Device Manager on Display device Driver tab choose Roll back, Uninstall (then restart to reinstall) or try another one previously installed at Device Manager>Display adapter>Driver>Update Driver>Browse>Let me pick.In addition there are steps here to specifically troubleshoot Sleep mode problems:http:\/\/www.makeuseof.com\/tag\/fix-windows-10-sle... What I do is go into Advanced Power options and set Display and Sleep to 1 minutes, Hibernate to 2 minutes, then after completing each step restart the PC and observe what happens for 3 minutes.Also did it previously work? Do you have a System Restore point from when it did?http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t...This may have been caused by Windows Updates. Check which Updates were installed right before the problem began, and if necessary uninstall them from Settings > Update & Security > Windows Update > Installed Update History.You can also try to roll back using System Restore to a point before this began: http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... Then if an Update reinstalls and causes the same problem uninstall or roll it back again, then immediately hide it using the Hide Updates tool from Method Two here:https:\/\/www.askvg.com\/fixing-windows-10-automat... If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1903 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I have a laptop that I keep on all the time.  When I close the lid it is set to do nothing.  Therefore it is running all the time but is not keeping me awake at night.  I usually only open it to make updates.  I run it all the time as it controls my watering around the property."]},{"symptom":"Delete files from share folder        some employees in our network delete files from shared folder how can i log this action ? my shared windows server is 2008 please help me , Thank you.","solutions":["Hello Amir,You can do that by enabling file and folder auditing,, for the steps please check the following linkhttps:\/\/www.techotopia.com\/index.php\/Auditing_Windows_Server_2008_File_and_Folder_Access"]},{"symptom":"Mouse Cursor Flickering on Windows 10        This is a really annoying problem. Two things seem to be happening. First is the mouse cursor is flickering. It's as if it's having an anxiety attack. The flicker can also interfere when trying to click on icons, although most of the clicking feature seem to work okay most of the time.The second thing I noticed is that down at the bottom of the screen is a big circle that has an arrow in it. This arrow flickers in rhythm with the cursor. I have tried every suggestion I can find on the internet, including those from this forum. I've deleted device drivers for both the mouse and video card and the intel driver, changed screen resolution, tried changing mouse settings, tried changing the settings of my video drivers,  I tried changing the performance settings, I changed the boot up settings in my Bios. I tried starting up without my usual start up programs. Nothing stopped the flickering.I use a USB mouse, so I tried different USB ports. I also tried a wireless mouse. The flicker did not stop in either case. I think it's a problem with the Windows update. I had this problem some months back, but it stopped. Then I updated a few days ago and the mouse flickering started up again.I did notice that while in my Bios the cursor did not flicker. While in Windows 10, as I am now the mouse cursor does flicker.Help.","solutions":["Hi, jimclay75051 My name is Smith and I am an Independent Advisor. I would be happy to help you today.I recommend you check these methods to repair any Windows problem. Press the Start key and type the word CMD, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanup-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/947821...Hope this helps. Keep us posted on the status for further assistance.","Hello, SmithErikson. I appreciate the quick reply. I followed the above steps and it did find and correct some corrupt files. So that that's for the good. But it did not fix the flickering problem. And the circle remains at the bottom of the screen.I greatly appreciate the response though. Thank you.","I recommend you to completely repair Windows, First, it would be a good idea to backup your personal files and photoshttps:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/www.intowindows.com\/repair-windows-10-i...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thanks again for the reply.As it happens I have both AOMEI Backupper and Onekey recovery. So I tried several things. Using Backupper I rolled everything back to a few ago before the problems started. That did not help. Then I tried a complete Windows Reset. That too did not solve the problem.Then I have OneKey recovery on my drive, which when I built my computer five months ago, I installed and it created a OEM type recovery partition. I assume the OS will be as it was five months ago when I first installed Windows 10. So I recovered my system using it, and surprisingly to me, that did not work. The cursor continued to flicker.Because none of that work, I went ahead and using Backupper reinstalled my current installation. So no harm was done, although the flickering did not get fixed.I dug into my BIOs some more and dis-selected everything that seemed unnecessary. That did not help. Then I randomly tried to changed settings, again it did not help.I'm sure there's a solution but I have no idea. I'm starting to get use to the cursor and have moved into the acceptance stage. If you have any more ideas, I'd love to hear them. But if not, I appreciate the effort. Thanks again.","Funny thing just happened. Earlier today we were having a bit of rain with some lightning. The electricity went out and my computer shut down instantly. The electricity came back a moment later. I rebooted the computer and the flickering problem was gone. I find that very strange. I guess the next time I have the flickering problem, I'll trying turning off the computer by unplugging it. So for now, the problem is fixed, no more flickering. Thank you for all your help.","glad to help","Well, this problem has returned and it is just as it was before. It was fixed until this morning when I rebooted. I tried giving it a sudden unplug to simulate the electricity going out , but that did not help.If you or anyone else has anything else I might try, I will appreciate the help. Thanks.","Solved! (I think...)I spent hours yesterday trying to find the solution to this problem, trying stuff at random and search the internet for ideas. Nothing worked, but I was reading about one person who said his touch pad was causing his flickering problem. I don't have a touch pad, but I do have a touch monitor. In fact I have two monitors, one touch and one is not, which may or may not having anything to do with it.Anyway, the touch screen monitor was the problem. The first way to solve this, in my situation, was to go to Device Manager > Human Interface Devices > HID-compliant touch screen, right click and disable the device. This worked immediately.However, as I realized later, the far easier solution is to reach around to the back of the monitor and unplug the usb cord that connects the monitor's touch screen functionalities to the computer. This too caused the flickering mouse cursor to stop. Very frustrating problem if you don't know the solution. But when you do it is easy. Hope this helps someone.","I'm having the exact problem on my laptop touch screenexcept that the circle with the second flickering arrow are on the right edge of my screen instead of the bottom. Just started after system updates ran this morning upon start up. Running Windows 10. Hoping to see a resolution here that can help resolve it on a laptop.  soon and I'll post it if I find one first. ","Jim - Your post helped me figure this out in my own (similar) situation. I was about to reboot (good old remedy) because of the paranoid mouse pointer flicker but then felt that I had too many things open and might lose a lot of that 'state' upon reboot. Upon searching I hit upon this question and your \"big circle\" observation. I had that as well and realized that there was another faint image of the mouse pointer stuck at the top of my other monitor (as if attempting to break through into the monitor where the mouse was behaving crazy). Just \"undocking\" my laptop and \"re-docking\" it immediately resolved the issue. (As FYI, I have my monitor layout set so that my laptop monitor appears 'below' the larger (docked) monitor...as my laptop is usually resting on a fairly low table for ergonomics of typing on the keyboard while seated.)My hunch is that due to some timing issue, the mouse pointer ended up in a split personality mode...may be I was moving it across the monitor boundary just while docking.Anyways, thanks for your keen observation. -- Manish"]},{"symptom":"Unable to upgrade to latest version of Windows 10        I have tried repeatedly to upgrade, without success.  I keep getting a message about not having enough storage space despite the fact that I have installed a brand new 124GB SD card to help with the temporary storage needs during the upgrade.  I have also deleted all unnecessary files, emptied recycle bin, etc.  I don't know what else it wants me to do. I tried to do a chat with Tech Support, but they were suggesting installing  something else to clean up space.  I did a  complete scan today, tried the upgrade again, and it still doesn't work.  Any suggestions from the community would be welcome.  I'm not too savvy about the technical end of my PC so please don't get too technical with any suggestions.....thank you!","solutions":["How much free space on the C:\\ drive?External space is of no use.","Hi Jersey, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Try updating to 1909 using Media Creation tool and if it fails, share the logs. The fastest way to get the upgrade is through Media creation tool or ISO file. Please download Media Creation Tool from the link below and select Upgrade this PC at the first screen.https:\/\/go.microsoft.com\/fwlink\/?LinkId=691209All steps, including upgrading using ISO file and Media creation tool, are covered here:https:\/\/www.yourwindowsguide.com\/2019\/05\/update...Content on the above blog is written by a Microsoft MVP so it is safe. Meanwhile, if the update fails with MCT as well. Let us check the Installation log to find why the update failed. Please share the logs as mentioned in this article. You should use a File sharing service like Onedrive or Media Fire to upload files and share the link in the next reply.https:\/\/answers.microsoft.com\/en-us\/windows\/for...The Panther logs. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\PantherThe Rollback logs: These usually are created if Windows Update rolls back. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\Rollback[Only if the error code is 0xC1900101-0x30018] The Device Install Log from C:\/$Windows.~bt\\Sources\\Rollback\\setupapi\\setupapi.dev.logAs the log size might be large consider zipping before uploading.","Well yesterday I had 1.5GB free (out of 32GB) but this morning (after trying to free up disk space yesterday by cleaning up temporary files, recycle bin, etc.) I now have only 345MB.  I don't understand what's going on with my PC.","To upgrade you need 25+ GB free space on the C:\\ drive to upgrade.  If you can not get that much you have to do a clean install on that computer."]},{"symptom":"On-screen Keyboard won't Load Passed Startup        I just got this computer from Digital Storm on Christmas day.  I am disabled and use the on-screen keyboard.  It worked fine until I went to bed last night.  The last thing I did was install Realtek audio drivers and move my documents folder to my storage HHD.  Now the on-screen keyboard won't work when I enable it, and as you can see from the full screen snip, it is not on the screen nor on the taskbar.  It does appear when before logging in, when pressing ctrl+alt+del, or when running a program as administrator before clicking \"yes\", then disappears when I return to the desktop.  Interestingly, I CAN get the touch keyboard icon to show up by the clock and come up, by right clicking the Taskbar and clicking \"Show touch keyboard button\" and while it doesn't have a number pad or navigation options, it works for the meantime (I am using it now).  However, I am very concerned about corruption and I don't want to proceed with installation of my programs until I get this troubleshot.  I already ran sfc \/scannow through the cmd and it reported no errors.  Any ideas are appreciated.","solutions":["Hi there My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Can you see if the ctfmon.exe process is running? Right click the taskbar and select Task Manager Processes tab Sort by Name by clicking on the Name column Look for ctfmon If it is not present, press windows key and type ctfmon and then click on the returned result of ctfmon run command.Try opening the on screen keyboard again. Hope this helps.","Thanks for your help.  I had to add the process name column, but I figured it out. Unfortunately, or fortunately for all I know, ctfmon.exe is there.  I attached a window snip.  Any other help is appreciated...","It's been quite a few days, I am not sure if this post has been forgotten; but as you can see from the post below, the on-screen keyboard executable (osk.exe) appears under Details in Task Manager.  It is still appearing whenever UAC is triggered, even if I close it while in UAC.  I think it is corrupted."]},{"symptom":"How to turn off \"your organization requires you to change your password\" in windows 10?        So my computer randomly said to me \"your organization requires you to change your password\", why and how do I change it?","solutions":["HI RR. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.It either means the Group Policy in Professional edition has been set this way, or if it's Home version or a private PC then it can mean account corruption:First try the steps here: To adjust group policy: https:\/\/docs.microsoft.com\/en-us\/office365\/admi... If Home or private PC: https:\/\/answers.microsoft.com\/en-us\/windows\/for... If none of those help then this can mean account corruption. Test by creating a new Local Admin account in Settings > Accounts > Family & Other People > Other, as shown here:http:\/\/www.howtogeek.com\/226540\/how-to-create-a... Sign into the new account, test if the problem persists, if not then move your files over, test that all programs work or else reinstall them, then when ready delete the old account in the same place.You can then change it to your Microsoft account if desired: https:\/\/www.tenforums.com\/tutorials\/5375-switch...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"How do I open a PNG file without loosing quality?        I have PNG image file stored on computer. When I double-click it, it gets opened in 'Photos' app. The app is not ideal for viewing PNG images, since it display it blurred. See below.I first thought the image itself had bad quality so I downloaded it again. Seeing that the quality is still same, I tried couple of other ways to download thinking that probably browser is re-encoding the image when downloading. Finally, I tried to open the local image on browser itself and found that there was no problem with the downloaded image. See below clip. It is 'Photos' app that probably over-compresses the images of any format to JPG first before displaying it.Is there an option in 'Photos' app to remove blurring? Is there any other app from Windows for viewing PNG images? Else I will need to use third-party image-viewer app or a browser, the latter is not ideal for viewing several images in the folder in quick succession.","solutions":["Hi Jatin. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I know of no reported issues of blurring in the Photos app of .png or any other files.Does this happen anywhere else? Let's check over your System and the app most thoroughly, then I'll also give you popular alternative apps to try and compare:1) Update the Display driver from the PC or Display adapter maker's Support Downloads web page for your exact model number, HP Serial Number or Dell Service Tag - from the sticker on the PC.While there check also for newer chipset, BIOS\/UEFI firmware (very important), network, sound, USB3 and other drivers, comparing to the ones presently installed in Device Manager reached by right clicking the Start Menu.If this doesn't give you the latest or ideal driver for what you need, compare it to the driver offered by the Intel driver update Utility here:http:\/\/www.intel.com\/content\/www\/us\/en\/support\/... or the Nvidia Update utility here: http:\/\/www.nvidia.com\/Download\/Scan.aspx?lang=e... or the AMD autodect utility here: http:\/\/support.amd.com\/us\/gpudownload\/windows\/P... For Display issues one fix that is working is to Roll back or Uninstall the Driver on the Display Device > Driver tab, restart PC to reinstall driver.You can also try older drivers in Device Manager > Display device > Driver tab > Update Driver > Browse > Let Me Pick.Then you will know you've tried everything in addition to Windows Update drivers.2) Then adjust the Screen Resolution at Settings > System > Display until it looks best.3) Reset and Repair Photos app at Settings > Apps > Apps & Features > Photos app > Advanced Options. Your pictures will be safe in the User Pictures folder.Make sure the Photos enhance feature is working: https:\/\/answers.microsoft.com\/en-us\/windows\/for...If that doesn't help try re-registering the Photos app from Option Two here: http:\/\/www.tenforums.com\/tutorials\/3175-apps-re... __________________ There are alternative Photos apps here to try and compare, even if you don't keep them:https:\/\/www.msn.com\/en-us\/lifestyle\/windowsstor...https:\/\/www.guidingtech.com\/best-alternatives-w...___________________ If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... If nothing else helps you can try a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Greg, instead of me trying a zillion steps that I am sure won't help, why don't you try following two steps and see the problem?1. Download image from https:\/\/jatinsanghvi.github.io\/assets\/img\/posts\/luxi-mono-font.png2. Open it in 'Photos' app.See that the text 'File' is rendered blurred.Anyway, thanks for the alternative apps. I would go with FastStone Image Viewer. My concern is that Windows does not have a default app for viewing PNG images without loosing quality. Windows 7 image viewer should not have this problem, since it need not require creating intermediate JPEG-images on the fly that's required if the tool needs to support image editing.","None of the files you've linked are able to be downloaded. Open the link to see yourself. Can you share them from OneDrive by rightclicking to Share with OneDrive?","Are you sure this link does not open up: https:\/\/jatinsanghvi.github.io\/assets\/img\/posts\/luxi-mono-font.pnghttps:\/\/isup.me\/jatinsanghvi.github.io says that the site is up, so if it still does not open, there must be a problem at your end.","Click it to see for yourself.  It opens to a code page, not a download.  To attach a file to download share a link with a file-sharing program.  ","Your link is opening a VIsual Studio code box. Is that what you want me to see or is it a picture you're trying to share?","Thanks. Yes, that's actually the PNG screenshot of Visual Studio Code. It renders well in browser but not in photos app. I think that unless a photo is opened for editing, the app should show it without reducing its quality."]},{"symptom":"Windows 10 PC 32bit won't boot        Suddenly one fine morning, my PC desktop with an SSD HD (500GB) which has Windows 10 32bit, stopped booting.It gives an error message \"Disk Boot Failure\" \"Insert System Disk and Press Enter\"Thinking that this could be a HD failure, I tried this HD in a laptop which worked fine. It seemed like it must have been doing an update which failed.Any ideas on how I can fix this???","solutions":["Hi Techie. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.There's a new button in the Repair Mode to Uninstall Updates that may be what you need, so watch for that as the steps sequenced below unfold:Unplug power and remove battery, press and hold power button for 30 seconds to release all power from circuitry, plug back in and power up to see if any change.I will give you steps to access the Repair Mode to try all repairs to get Windows started, and if not to do the automated Reset or the superior Clean Install after rescuing your files.1) Use whichever method works in this link to access Advanced Startup Options: https:\/\/www.tenforums.com\/tutorials\/2294-advanc.... Easiest may be to force shut down the PC (by holding in the power button) three separate times to trigger the Startup Options. If one of these methods work, then go to Step 3.2) If none of the other methods work it may be necessary to Create Windows 10 Installation Media on another PC following the steps in the middle of the downloads page here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... Make sure to uncheck the box for Recommended Settings to choose only the licensed version.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... Choose the boot device as a UEFI device if offered, then on second screen choose Repair Your Computer. If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first. There is always a way to get the media booted and I will guide you until it does, even if necessary to reset the BIOS to defaults via several methods.3) In the Advanced Troubleshooting options try to System Restore to a point before the problems began, try the new Uninstall Updates button, then Startup Repair, then if necessary from Startup Settings try to get into Safe Mode with Networking, or lastly Safe Mode. If Startup Settings aren't available you can force Safe Mode from the Command Prompt following Step 5 here:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf..., or using the command to unhide F8 Advanced Boot Options here:https:\/\/www.tenforums.com\/tutorials\/22455-enabl... where you can also try the old reliable Last Known Good Configuration.4) From Safe Mode w\/Networking work through the Windows 10 Install Integrity Checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... Update your drivers from the PC's Support Downloads web page. Compare the latest drivers with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.5) If Safe Mode doesn’t work or help stabilize things then return to Advanced Troubleshoot options. Next try Command Prompt to run through Windows 10 Install Integrity Checklist (above link) Step 10 repair commands including sfc \/scannow, DISM, a full Disk Check: https:\/\/www.groovypost.com\/howto\/check-hard-dri..., or return to Troubleshoot options to Reset Your Windows 10 PC.6) Better yet use the same booted media to do the vastly superior Clean Install following the steps in this link to delete all partitions down to Unallocated Space to get it cleanest:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... 7) There is a step to Rescue Files from the booted media or Repair Mode Command Prompt first:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... These steps are excerpted from my tutorial that compiles everything possible for Troubleshooting Windows 10 Failure to Start:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... You can continue with the other steps there.To test hardware, Dell and HP have onboard diagnostics triggered by powering up and pressing the F12 and ESC key respectively.Test the RAM overnight to stress it with the best bootable test memtest86, following these steps which test both the sticks and the slots:https:\/\/www.wikihow.com\/Test-PC-RAM-with-MemTest86Test the hard drive with diagnostics: https:\/\/www.lifewire.com\/free-hard-drive-testin...Best is to use the manufacturer's own if there is one, otherwise use Seatools bootable long test:http:\/\/blog.nowherelan.com\/2013\/04\/04\/boot-seat... Follow this up with a full Disk Check: https:\/\/www.groovypost.com\/howto\/check-hard-dri... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer There are links to a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Will this erase personal Data? How to stop it?        My computer has been giving me troubles ever since I first got it. Complete garbage and always causing problems.Today its given me a message that has really freaked me out because I do have personal data on it and I'm worried it will be deleted.\"Fatal Error C0000022 applying update operation 83232 of 85499 (\\Regi...)\"Will this harm my computer permanently?How can I cancel it?I think I'm running windows 10? But I'm not sure.Really freaking out here.","solutions":["What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK  .Run Windows Defender and Malwarebytes.","Hi Wrenadee. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.No, fatal software errors just means they can't resolve themselves. Software can't harm a PC which is made of hardware, software can always be repaired or reinstalled. From what you say, you may need to reinstall Windows to get a fresh start. There is also an automated Fresh Start that reinstalls Windows while shedding factory bloatware that can cause issues and affect performance, saves your files, but doesn't clear the drive to get it cleanest:https:\/\/www.howtogeek.com\/265054\/how-to-easily-... After that Update failure, are your Windows Updates working now? Go to Settings > Update & Security > Windows Update to Check for Updates and see if they install correctly. Do the restart when ready and then go back to check for more. If they are continuiing to fail I'll help you repair them which is not hard. If you want to write out what other performance problems you're having then I'll help you with those too. You can go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"All screens are black and white        How do I get back normal colours on my computer?","solutions":["Hi Rua. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See here how to restore color to your PC screen: https:\/\/www.digitalcitizen.life\/fix-problem-scr...To get color back on the task bar, Start menu, and window frames after Version 1903 turned the Light mode dull grey, see here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","How do I get back normal colours on my computer? I don't believe in vain boasts of expertise, so here's how to do what you want:Start buttonSettings appEase of accessColor filtersTurn on color filters'Off'The 'problem' is that people accidentally press the combination of keyboard keys that turns color filters on, and the default setting is black-and-white. Surprise!"]},{"symptom":"Video Editing App        Hi, I want to Edit Videos, hence looking for Good Video Editing App for My Microsoft Windows 10 OS. Which App would you suggest or recommend.","solutions":["Hi Gavin Windows 10 has a built-in Video editor, while it is basic, it does have some nice features, to access that, open the Photos App and at the top, click 'Create' to open the video editing capabilityIf you need something with more editing capabilities, then the totally free AVIDemux is probably the best out there . .","Hi  GavinMathos,Assuming you don't need any professional-looking video production like Premiere Pro, you can use the Windows 10 built-in Photos app, or Windows Movie Maker 2012. They are free offered by Microsoft. And I advise you to keep them both:Microsoft adds many preset font\/3D effects to Photos. So I often use it to make slideshows and small videos.  Windows Movie Maker 2012 is more advanced, and it organizes media files in a timeline (similar to many commercial-level editors). There are still some Youtubers using WMM to create videos for their channels. In case you need to find more information about Windows Movie Maker and Photos App, you can reachWindows built-in video editor tutorial. I found very detailed comparison and introduction in that post which may be helpful for you. BTW, Windows posts many official tutorials on YouTube which you can reach for help. For example:Importing Footage and Starting a New ProjectAlternatively, you can reach some Open-source software like Openshot and Shotcut. They are free, and more powerful. The steep learning curve is the only downfall (for me). Hope my answer works for you.Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"My Windows 10 won't update        I need help with an issue that I've been facing for months now and I really need someone's help.My issue is that my Windows 10 will not update due to a problem I may have caused this to happen. What I done a couple months back was my computer stopped working for a random reason and it didn't start up and kept on popping up with this sad face saying 'the pc ran into a problem'. So I decided to keep restarting it until it opened up the Windows desktop which it did. My Windows 10 update was ready but it skipped a little bit of it and it came up with an error code. I then decided to do a system restore (which was a silly thing for me to do) and now after I did the system restore, the windows update still didn't work. I knew I couldn't do a system restore as you have to wait for a certain amount of time to do it again. So I decided to uninstall an update which made it worse. I also tried to reset my computer completely but after a long wait, it said that it couldn't do it due to an error and it didn't change anything.After a while, I received a feature update for Windows 10 Version 1909, so I decided to update it to that but it came up with a different error code. It also skips a little bit of the update at the start and goes straight to 11%. Once it does that, it then finishes at 21% but doesn't finish the rest of this update due to an error and it also shows up the same error code.It now says 'Your device is missing important security and quality fixes.'It then shows this message below 'There were problems installing some updates, but we'll try again later.'The update I have been trying to install for months is a Windows 10 1903 Cumulative update and the error code is (0x80070057).The update is '2019-12 Cumulative Update for Windows 10 Version 1903 for x64-based Systems (KB4530684)'I'm hoping someone can help me as I am able to do intelligence updates for Windows Anti Virus but cannot do Cumulative or Feature updates.Overall I believe I have done something which made my system confused. Apart from that everything on my computer is working fine.So I'm hoping someone could help me with this problem as I have been facing this issue for more than 3 Months now.","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command prompt DISM \/Online \/Cleanup-Image \/RestoreHealth Run these commands on the command prompt to restart windows update services net stop bits net stop cryptsvc net stop wuauserv net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start bits net start cryptsvc net start wuauserv net start msiserver After successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig 2. On the system configuration window go to the services tab 3. Tick on hide all microsoft service so that this won't be affected 4. Choose to disable all services 5. Next, go to the startup tab and on the window choose to open task manager 6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok 8. A prompt to restart the computer will show up, choose to restart This should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo... 2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept. 4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)"]},{"symptom":"Staying sign in.on Outlook mail.        Hello,How do I stay signed in to Outlook Mail when usingFirefox\".I get signed out every few minutes on Outlook Mail.Putting a check in the box,\"To stay signed in\",does not work.Thanks,A.W.","solutions":["Hi again - I would not use Avast as we see many more problems with it than built-in Defender which always offers best Windows performance with least issues, and is from Microsoft who knows how to protect their OS best.One suggestion I'd make that will really improve things for you is to try Windows 10 built-in Mail app which is an easier way to access your mail with a huge inbox that lets you merge all of your Office and Web Mail accounts, and an even larger ad-free reading pane. See here How to get started with the Mail app on Windows 10 | Windows Central"]},{"symptom":"Samsung HMD Odyssey+ not displaying anything.        Haven't found any solutions to this yet. I set up my samsung odyssey headset in the wmr portal, and was brought to the testing segment where you usually put on the headset. (Area where you point the controllers at the crystal). I could tell by what was being shown on my monitor that it was picking up movement from the headset, but when I put it on I wasn't seeing anything. The led is a solid green, and the controllers are being tracked just fine. Why wont my headset display what's on my monitor?","solutions":[]},{"symptom":"Your phone app connection issue        I'm trying to connect Samsung Note 10+ to windows 10 using link to windows. It keeps getting stuck at 60% even after I've tried all troubleshooting steps. One more point, I've logged in PC with a different  Microsoft account then the one I'm using to connect my phone. However, I'm using the same account in phone and your phone app but it's different from the one running on windows. Any help will be highly appreciated. ","solutions":["I have a similar problem.  After updating to Windows 10 Version 1909, the Your Phone app stopped displaying the screen of my Note 10+.  Gives error message \"Your Android phone model isn't supported.\"  Worked fine before the update.  Other app functions continue to work now.Have any issues been identified with the version 1909 update?"]},{"symptom":"Headphones microphone is not being used.        I had selected for my computer to \"not ask again\" by accident to not use the microphone and I want for my computer to have the option of using the headphones microphone. I don't see it pop up when I plug it in anymore and I have looked up various ways to undo this but only to be disappointed. I have windows 10 and the headphones are Turtle Beach XOFOUR's.","solutions":["Hi Conner. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See how to re-enable the \"Which device did you plug in\" popup here: https:\/\/windowsreport.com\/you-just-plugged-unpl... (avoid ad links)https:\/\/h30434.www3.hp.com\/t5\/Notebook-Audio\/En...https:\/\/forums.tomshardware.com\/threads\/how-do-...https:\/\/www.dell.com\/community\/Windows-10\/How-g...https:\/\/answers.microsoft.com\/en-us\/windows\/for...I'll give you everything else possible to try for headset problems so at least something will work. If you need help performing any steps I am standing by here to help:First try the steps here: https:\/\/www.maketecheasier.com\/fix-headphones-n...https:\/\/www.windowscentral.com\/setting-your-hea...https:\/\/www.lifewire.com\/fix-headphones-not-wor...https:\/\/www.thewindowsclub.com\/headphones-not-w...https:\/\/merabheja.com\/fix-no-speakers-or-headph...https:\/\/troubleshooter.xyz\/wiki\/fix-headphones-...Go to Settings > Devices > Autoplay to look for the device and change the default behavior in it's Dropdown Menu.Right click Volume icon in System Tray at right end of task bar, Open Sounds Settings, in dropdown menus at top make sure Headphones are selected and Connected for both Playback and Recording Default Devices.If not again right click Volume icon in System Tray to choose Troubleshoot sound problems.Also try the Hardware Troubleshooter at Settings > Update & Security > Troubleshoot.Go to the Device Manager reached by right clicking the Start button, choose Sound controller device, on Driver tab choose Roll back or Uninstall, restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver. Do the same for the headset device and\/or it's microphone. Update the Sound driver from the PC or Device maker's Support downloads web page. While there also check that the Chipset, BIOS, Display, USB, Network and all other drivers are the most current.Sometimes it helps to unpair or disconnect all other Bluetooth devices from the PC in Bluetooth settings, then try again to connect the headset.If this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t...If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....To chck over the integrity of your install go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m...If you want to report this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems.If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it. If you are an Insider I can also vote it up with my MVP badge and track the issue for you.I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Using FSX with CH Products Flight Sim Yoke - Eyepoint View        I am using the CH Products Flight Sim Yoke with FSX.  I'm trying to be able to pan the eyepoint with the hat switch, but I can only assign the hat switch to one Eyepoint (move) event.  In other words, in flight, regardless of which way I move the hat switch, the eyepoint moves only in the direction selected in settings.  How can I use the hat switch to change my view?","solutions":["Hi Calabasas,As far as I know, Hat Switch positions don't need to be assigned.   You can check its movement (as with the yoke, throttle, etc.) in your Controller settings in Windows, but for using the Hat Switch in your Sim, you just need to make sure it is mapped in your Flt. Sim Controller Settings (under View (pan)) at Joystick with the Repeat slider to the far right.   Is this what you are referring to?Chris"]},{"symptom":"Win 10 upgrade issue        Hello Sir:I'm planning to upgrade my PC from Win 7 to 10. At first, I booted my PC with Win 10 CD, after the step I chose \"Upgrade: Install Windows and keep files, settings, and applications\", I got an error message that \"The computer started using the Windows Installation media. Remove the installation media and restart your computer so that Windows starts normally. Then, insert the installation media and restart the upgrade. (Do not select[Custom(advanced)] to perform an upgrade. [Custom(advanced)] installs a new copy of windows and deletes your programs and settings.]. I had to boot into Windows 7 and rerun the setup files from installation package, but when I got the step of \"Choose what to keep\", the option \"Keep personal files and apps\" was grey and can't be chosen. So Who can tell me what can I do for this Win 10 upgrade? I need to keep all apps from Windows 7. Thanks in advance.","solutions":["Hi Xion,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.There must be a message at the bottom why you cannot keep files and Settings. Can you recheck please?The message would be something similar to \"You cannot keep files and apps because Windows might be installed in an unsupported Directory\"","Sumit:Thanks for your quick response. Yes, the message is \"Your files, apps, and settings can't be kept because you're installing an edition of Windows that's different than the one you're current using.\" My now using Windows 7 is enterprise version, Win 10 is \"LTSB 2016\", so it there any conflict? I'm company user so must use LTSB.","Thank you. I suppose you need to use Windows 10 Enterprise. LTSB and Enterprise are different editions. There is a check on Windows 7 enterprise to Windows 10 Enterprise on the following page.Via https:\/\/docs.microsoft.com\/en-us\/windows\/deploy... From the same page, In-place upgrade from Windows 7, Windows 8.1, or Windows 10 semi-annual channel to Windows 10 LTSC is not supported.Please ask your company to provide a Windows 10 Enterprise ISO so that you can upgrade again.","Sumit:Very appreciate for your assistance. I'll try the Enterprise license, thanks in advance..","Your welcome. Let us know if there is anything else :)"]}]}