{"windows":[{"symptom":"Can't seem to be able to burn disc        Excuse me but I am not computer savvy. After Christmas I was able to burn our dvds from my memory stick. Since then I have tried to burn last years Christmas from the Windows Media Player using the same computer and dvds. Here is what keeps coming upAny suggestions?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. The error message suggests that there is some issue with Disc format. Please enter another blank disc which the DVD drive supports. For example DVD RW+ drive."]},{"symptom":"Can't expand my primary drive.        I recently transferred my data from SSD to SSD one being 250G and to one being 500G this caused my primary drive to be at 210G like on the original 250G drive. I cant expand the drive, when i hover over expand it it gray and i can not click on it. I looked at the post \"Unable to extend C drive\" and it kinda worked for me until it was a system\/Boot file i would have to delete. In order for me to be able to get access to the 254 unallocated data i need to move the Healthy (EFI System partition). I you have any tips or ways to solve my problem let me know and thank you for your time. ","solutions":["Hi Logan WIndows has very limited partitioning capability, you will need to use a 3rd party utility to extend C into that unallocated space . . .The free version of AOMEI Partition Assistant is fast, fully featured and easy to use, and will easily resolve this fro you . . .https:\/\/www.diskpart.com\/download-home.html________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi Logan, okay, please let me know how that goes . . ."]},{"symptom":"Can`t login to my acc in Win10, \"That Microsoft account doesn't exist. Enter a different account or get a new one.\" When my exist        Can`t login to my acc in Win10, \"That Microsoft account doesn't exist. Enter a different account or get a new one.\" When my exist <Screenshot removed for PII>","solutions":[]},{"symptom":"After last windows 10 update, my printer won't print in color.        After the last windows 10 update, my HP Officejet Pro 6978 won't print in color, inly black.","solutions":["Have you tried uninstalling, then reinstalling the driver?","I'm not really computer literate but will try whatever you recommend. Which driver do I uninstall and reinstall,and how do  I do that?","The driver should be here: https:\/\/support.hp.com\/us-en\/drivers\/selfservic..."]},{"symptom":"ACTIVATION ERROR        I  am having difficulty activating my Flight Simulator X","solutions":["Hi Ola. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.This covers everything needed to activate the product: https:\/\/support.microsoft.com\/en-us\/help\/925723...https:\/\/www.flightsim.com\/vbfs\/showthread.php?2...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi,depends upon which activation. That's usually the second step, the one for activating the Acceleration which is known for trouble. Check that, taken from my personal site about the Microsoft FS franchise:The registration of the FSX firstly installed does not pose troubles, generally as the one of the Acceleration Pack does. Once installed and launching back FSX you may get a 1-80004005 error, which will limit the use of your FSX at 30 minute of time. The solution, which is widely given on the Internet, resides into a faulty entry of the Windows Registry. To fix that, run 'regedit' from Cortana and launch that utility. It will show you the registry content. CAUTION, THAT CONTAINS SENSITIVE DATA! DO NOT CHANGE ANYTHING EXCEPT WHAT FOLLOWS! Expand HKEY_LOCAL_MACHINE\\SYSTEM\\CURRENTCONTROLSET\\CONTROL\\CLASS\\{4D36E967-E325-11CE-BFC1-08002BE10318}. In the left column, double-click the UpperFilters entry (note! there may be there several {4D36E967-E325-11CE-BFC1-08002BE10318} entries; just find the one which holds UpperFilters). Thence three possibilities: either you will just read 'partmgr,' and just change that into 'PartMgr' -- with capitals -- and exit the registry by clicking to the upper right as registry automatically saves. Either you will find a '0' value; change it too to 'PartMgr' and idem. Or, at last, you may find other values of which 'partmgr'; some advice to first backup tall those, then erase everything except 'partmgr' (you will turn to 'PartMgr'; exit idem, and once the registration performed, you may paste the backup back). In all cases, once the Registry entry fixed, restart your PC and then launch FSX. The registration panel will pop up!"]},{"symptom":"[Windows build 1709] PC crashing at 71% update to build 1909        Hello, I have a problem. I'm trying to update to the new build 1909 but whenever the Windows Update Assistant gets to 71% the computer crashes and restarts.I have tried deleting the $WINDOWS.~BT folder, but it did not help.I also tried installing and running the Update Troubleshooter for Windows 10 but also did not help.Has anyone encountered this problem before? I kindly request help if anyone can !","solutions":["Hi Tomasz. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I would manually upgrade to the latest version 1909 by opening the Media Creation Tool from this link:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m..., choose Download Tool Now, then open the tool and choose Upgrade This PC Now. This saves your files, apps and most settings in place, is the most stable method to change versions, brings your Updates current, resolves most problems. If any problems report back the verbatim error and number, then continue with these steps for overcoming Version Upgrade problems:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If the Version has problems I will work with you to try to resolve them. If the problems are unfixable for now, you have ten days to roll it back in Recovery settings. You can then hide it so it doesn't try to reinstall following this same method:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... Most problems are resolved by doing this gold standard Clean Install which should get you past all difficulties as it has millions of others who have followed the steps in this link and never come back to report another problem:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... . So read it over and see if its something you want to learn to do.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to rate my post, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Any 3rd party anti virus, security, cleanup programs ever installed on the computer?","Just so you know, there are files which may help with your problem in that $Windows.~BT folder, so please, keep them after the next time you try an upgrade.  Then go to the link below and download and run the setupdiag utility.  It needs the files in that specific folder for analysis.If you run the utility and get a listing, you might copy and paste the results.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/setupdiag","Hello Greg,I downloaded the tool and when I double click to run it, a Windows logo appears following an immediate shutdown of my PC.Therefore I can not install the tool or report any logs.This looks bad, should I be worried?","Used to run Avast!, but opted out when I read that Windows Defender is good enough.For antivirus I use Windows Defender plus malwarebytes (purchased on official site).As for cleanup I use Ccleaner.Other than those, I can not think of anything else.","Go to Avast and get their removal software an completely remove Avast code.  Programs and features does not remove all the code and that which is left can cause problems.","Hi again - How badly the Version Upgrades choke when using the media is a good measure of the quality of the underlying install - which means everything in Windows 10.But to be sure go to another PC to create the bootable media and then follow these steps for overcoming Version Upgrade problems:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If it still fails then I'd do the vastly superior Clean Install following the illustrated steps in this link which include everything that works best in Windows 10:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... To create bootable Windows 10 Installation Media (on another PC if necessary) install Media Creation Tool and follow the directions in the middle of the download page here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... Then try the steps to do the Version Upgrade one more time. If not take your time preparing thoroughly for the Clean install. When ready Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key for your PC maker given in this chart:https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, then on second screen choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, select the Unallocated Space, click Next to let it create and format the needed partitions and start install - this makes it foolproof.There is a step to rescue your files first using the booted media if you don't have them backed up:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC because you will learn everything that works best and how to apply it with your own hands.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"SATA cables        I just got my new SSD and i dont have a spare SATA cable. I dont live near a best buy or tech shop and ordering online would be a last resort. Im wondering if it is ok to borrow the SATA that connects my cd drive to my motherboard. ","solutions":["Hi richodude Rest assured,, that will be fine, you can connect the SSD to the SATA cable for your CD Drive, just make sure to connect to both the data cable onto the motherboard and the power cable to the PSU . . .","I did this but now my monitors have no signal. I put everything back where i had it, made sure all the cords were plugged insecurely inside and out, and i cleaned off my ram sticks. Any idea where the culprit may be?","Hi Richo Dude Swapping out a drive on SATA cables will have no affect on the signal going to your monitors, check that you video card (if applicable) is seated correctly in its slot, then check the cables at the back of your PC to see if they are connected correctly . . .","I checked all the cables and replugged in my gpu. Still nothing. I actually do have another power supply handy. Do i have to resort to that? I kinda doubt its that though.","I'm not an expert in this but with my desktop PC there is the power cable and there is the data cable.  Plug the data cable in near where your old hard disk drive is plugged in.  There should be other places on the motherboard near where your old drive is plugged in.  ","Not 100% sure what ur saying but there is already a data and power cable in my old drive","Just suggesting you try a different port (where the red cables are plugged in) but probably will not make any difference.","The problem ended up being a broken ram stick. Thank you for the help though"]},{"symptom":"Mouse Issue........Left handed setting periodically defaults back to right handed setting        I have a desktop and laptop and each has Windows10 installed.  On both, my mouse is set for left-handed operation  (i.e. primary button is set as the right button on my mouse)Yet, both units periodically (about once or twice a day) return to the default position.but not at the same time.  How do I stop this from happening?  This is a relatively recent event and is increasing in frequency of occurrence.  Advice will be sincerely appreciated.  ","solutions":["Report this in Feedback.","Hi Ken. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Are you using the same mouse or model mouse on both PC\"s? Did the problem begin at the same time on both?Take note at Settings > Update & Security > Windows Updates > Update History of all Updates installed since this began.Then System Restore to a point before it started: https:\/\/www.windowscentral.com\/how-use-system-r...Now observe closely the Updates which install and whether they cause the same problem. If so uninstall these and block them as shown here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...This should solve the mouse problems, targeting the most likely suspect. I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Greg,  Thanks for the advice, but at this point, I would rather live with the inconvenience ofswitching the mouse setting than going through the process of finding an updatethat might be causing the problem, especially since the occurrences are highly random, and I don't have a good sense of when this issue first surfaced.  My recollection is that it started at least six months ago, and I just ignored it becauseof the infrequency.  Right now, everything is fine and unless it gets to the point where I cannot set-up left handed operation, I will live with it.  Ken","OK, Ken. I perfectly understand the desire to minimize disruption. You can also change the mouse. I really like the Logitech M325 nano notebook mouse, very comfortable and reliable:https:\/\/express.google.com\/u\/0\/product\/Logitech...Let me know if there's anything else. Also when ready please mark the post which helped most as the Answer, to help others. A rating is also appreciated."]},{"symptom":"How to fix LiveKernelEvent Hardware Error        DescriptionA problem with your hardware caused Windows to stop working correctly.Problem signatureProblem Event Name: LiveKernelEventCode: 144Parameter 1: 1006Parameter 2: fffff0088eb95960Parameter 3: 0Parameter 4: 0OS version: 10_0_18363Service Pack: 0_0Product: 768_1OS Version: 10.0.18363.2.0.0.768.101Locale ID: 1033Files that help describe the problemUSBXHCI-20200111-1135.dmpsysdata.xmlWERInternalMetadata.xmlWERInternalRequest.xmlmemory.csvsysinfo.txtI get this every time im gaming I do have everything up to date Graphics, Windows updates, and drivers, and bios etc. So why does this keep happening. This is what i have so far.  Microsoft (R) Windows Debugger Version 10.0.19528.1000 AMD64Copyright (c) Microsoft Corporation. All rights reserved.Loading Dump File [C:\\Users\\GhostReaper2043\\AppData\\Local\\Temp\\WERC4CB.tmp\\USBXHCI-20200111-1135.dmp]Mini Kernel Dump File: Only registers and stack trace are available************* Path validation summary **************Response                         Time (ms)     LocationDeferred                                       srv*Symbol search path is: srv*Executable search path is: Windows 10 Kernel Version 18363 MP (16 procs) Free x64Product: WinNt, suite: TerminalServer SingleUserTS PersonalMachine Name:Kernel base = 0xfffff803`3e600000 PsLoadedModuleList = 0xfffff803`3ea48130Debug session time: Sat Jan 11 11:35:42.646 2020 (UTC - 7:00)System Uptime: 0 days 0:58:55.360Loading Kernel Symbols........................................................................................................................................................................................................Loading User SymbolsMini Kernel Dump does not contain unloaded driver listFor analysis of this file, run !analyze -vUSBXHCI!TelemetryData_CreateReport+0xcc:fffff803`4b2e8c84 488b03          mov     rax,qword ptr [rbx] ds:002b:ffffcb88`6b751460=????????????????4: kd> !analyze -v********************************************************************************                                                                             **                        Bugcheck Analysis                                    **                                                                             ********************************************************************************BUGCODE_USB3_DRIVER (144)This bugcheck usually happens when the USB3 core stack detects an invalidoperation being performed by a USB client. This bugcheck may also occurdue to hardware failure on a USB Boot Device.Arguments:Arg1: 0000000000001006, USB3_WER_BUGCODE_USBXHCI_CONTEXT_ERROR_AFTER_STALL_RESET_EP\tReset EP failed during an attempt to clear stall on control\tendpoint.Arg2: fffff0088eb95960, XHCI_LIVEDUMP_CONTEXTArg3: 0000000000000000, 0Arg4: 0000000000000000, 0Debugging Details:------------------KEY_VALUES_STRING: 1    Key  : Analysis.CPU.Sec    Value: 4    Key  : Analysis.DebugAnalysisProvider.CPP    Value: Create: 8007007e on GHOSTREAPER2043    Key  : Analysis.DebugData    Value: CreateObject    Key  : Analysis.DebugModel    Value: CreateObject    Key  : Analysis.Elapsed.Sec    Value: 5    Key  : Analysis.Memory.CommitPeak.Mb    Value: 79    Key  : Analysis.System    Value: CreateObjectADDITIONAL_XML: 1BUGCHECK_CODE:  144BUGCHECK_P1: 1006BUGCHECK_P2: fffff0088eb95960BUGCHECK_P3: 0BUGCHECK_P4: 0HARDWARE_VENDOR_ID:  VEN_1022HARDWARE_DEVICE_ID:  DEV_43D0HARDWARE_REV_ID:  REV_0001HARDWARE_ID:  VEN_1022&DEV_43D0&REV_0001PROCESS_NAME:  SystemSTACK_TEXT:  fffff008`8eb953e0 fffff803`4b2b0bb8 : 00000000`00000005 ffffcb88`6c6bc750 fffff803`4b2ec618 ffffffff`ffffffff : USBXHCI!TelemetryData_CreateReport+0xccfffff008`8eb95910 fffff803`4b2b1080 : ffffcb88`651f22e0 fffff008`8eb95a40 00000000`00000000 00000000`00000000 : USBXHCI!Controller_TelemetryReport+0x15cfffff008`8eb95a00 fffff803`42333fd9 : ffffcb88`651f21e0 00000000`00000008 00000000`00000008 ffffcb88`65968060 : USBXHCI!Controller_TelemetryReportWorker+0x290fffff008`8eb95a80 fffff803`42333e69 : ffffdf81`e5a00100 ffffcb88`651f21e0 ffffcb88`6df9d040 fffff803`3e6bd54c : Wdf01000!FxWorkItem::WorkItemHandler+0x7d [minkernel\\wdf\\framework\\shared\\core\\fxworkitem.cpp @ 371] fffff008`8eb95ac0 fffff803`3e667c0f : ffffcb88`6516ac30 00000000`00000000 00000000`00000000 fffff803`4232adc0 : Wdf01000!FxWorkItem::WorkItemThunk+0x29 [minkernel\\wdf\\framework\\shared\\core\\fxworkitem.cpp @ 439] fffff008`8eb95b00 fffff803`3e6bd095 : ffffcb88`5d698a20 ffffcb88`6df9d040 fffff803`3e667b10 00000000`0000000c : nt!IopProcessWorkItem+0xfffffff008`8eb95b70 fffff803`3e72a7a5 : ffffcb88`6df9d040 00000000`00000080 ffffcb88`5d67e040 ffffffff`00000001 : nt!ExpWorkerThread+0x105fffff008`8eb95c10 fffff803`3e7c8b2a : ffffdf81`e5c00180 ffffcb88`6df9d040 fffff803`3e72a750 fffff008`8eb95cd0 : nt!PspSystemThreadStartup+0x55fffff008`8eb95c60 00000000`00000000 : fffff008`8eb96000 fffff008`8eb90000 00000000`00000000 00000000`00000000 : nt!KiStartSystemThread+0x2aSYMBOL_NAME:  USBXHCI!TelemetryData_CreateReport+ccMODULE_NAME: USBXHCIIMAGE_NAME:  USBXHCI.SYSIMAGE_VERSION:  10.0.18362.476STACK_COMMAND:  .thread ; .cxr ; kbBUCKET_ID_FUNC_OFFSET:  ccFAILURE_BUCKET_ID:  LKD_0x144_CONTEXT_ERROR_AFTER_STALL_RESET_EP_USBXHCI!TelemetryData_CreateReportOSPLATFORM_TYPE:  x64OSNAME:  Windows 10FAILURE_ID_HASH:  {7f041737-6927-8fbc-f0ba-712e8ab3eb69}Followup:     MachineOwner---------","solutions":[]},{"symptom":"video card driver        we are trying to watch a dvd and we got an error to change to the region. we did change the region.then we got another error message ;windows media player can not play this dvd because there is a problem with digital copy protection between your dvd drive decoder and video card. try installing an updated driver for your video card ","solutions":[]},{"symptom":"Adding second SSD to desktop as first SSD is full        Hi.My current SSD is almost full on my desktop. The SSD is installed on the motherboard.  I have purchased and installed a second SSD but a 2.5\" as the motherboard does not have space for a second SSD. How do I now work with this setup when the first SSD becomes full? Running Windows 10 Pro on a Dell Precision 3620. SSD on Motherboard is 256GB, 2.5\" SSD is also 256GB. This is a temporary fix for running out of room until I can afford to buy new computers. Thanks in advance for any help!","solutions":["Hi.My current SSD is almost full on my desktop. The SSD is installed on the motherboard.  I have purchased and installed a second SSD but a 2.5\" as the motherboard does not have space for a second SSD. How do I now work with this setup when the first SSD becomes full? Running Windows 10 Pro on a Dell Precision 3620. SSD on Motherboard is 256GB, 2.5\" SSD is also 256GB. This is a temporary fix for running out of room until I can afford to buy new computers. Thanks in advance for any help!A $12-15 sata to usb cable would be a quick, cheap solution.A $20 - 30 external drive housing would be a step up.Either would be a workable solution IF you can live with the usb3.0 transfer rates ... you did say it was a temporary solution for data storage.BC","Get a larger SSD then clone the one in the computer to the new larger SSD and then change drives,Amazon has 1TB for $100. 500GB for $90","HI Morgan. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.What I'd do first is sort you files into their User folders (Documents, Pictures, Desktop, Downloads, etc) then move them to the new drive. See how here:http:\/\/www.dummies.com\/computers\/operating-syst...Then since it's an SSD you can even change the default install location for Apps in Settings > System > Storage > Change where new content is saved as shown here:https:\/\/www.tenforums.com\/tutorials\/23790-chang...This will only change the location for new apps, so if you want to move any presently installed see how here:https:\/\/www.thewindowsclub.com\/move-windows-10-...In addition there are other strategies for freeing up space on your Windows drive here:https:\/\/www.groovypost.com\/howto\/maximize-stora...https:\/\/www.pcworld.com\/article\/3040404\/windows...These should all add up to your having as much free space as you want with the data and apps distributed between your two drives as you please, using the recognized methods I gave here.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Greg,Thank you SO much for the quick reply. I just want to confirm.If I take the first option- What I'd do first is sort you files into their User folders (Documents, Pictures, Desktop, Downloads, etc) then move them to the new drive. See how here:http:\/\/www.dummies.com\/computers\/operating-syst...Then that would free up some space on SSD one and put some stuff on SSD two, correct?If that is correct then I DON'T have to install the operating system\/drivers\/etc., onto SSD two?","Why would you install Windows on the second SSD? Only if it's faster and you want to replace the one on the first SSD. Otherwise you'd have two Windows 10 installs requiring two licenses, for what reason?Yes, moving Files and then as necessary Apps off of C should make plenty of space.","Why? I don't know.....I am new to all of this and obviously wrongly assumed that I NEEDED to have my operating system on both drives in order for my programs to work properly. I'm having difficulty wrapping my head around how to use the second SSD and how it gets filled. On one hand I've been told that as the first SSD reaches its' capacity all writing will simply default to the second SSD on its' own. I'm not so sure that is true and rather than wait until the C drive is completely full I wanted to begin investigating for the correct way to do things.With all my installed programs on my C drive I couldn't fathom how any program could run if I was suddenly operating from my new drive that did not have an operating system or boot details or programs installed upon it. As I said - new to this.So, as a for instance, let's say I move photos to my new drive. I see that I can access them from file explorer. However, let's use my Office365 as an example. Office (the program) is installed on the C drive. All the items sit in the 'my documents' folder on the C drive. When I want to access any documents I click on the icon for Word or Excel on my taskbar and then select the file I want to work with. If I move the my documents folder over to the D (new) drive then am I correct to understand that I would now only be able to access them from file explorer? Clicking on the icon on the taskbar would no longer work? Correct? IF that is correct, THAT is why I assumed I had to have Windows and my programs on the second drive if I wanted to continue to access them from my taskbar . Hope that makes sense? Thanks for any further help.","No, it will not spill over into the second SSD automatically. That's why I carefully wrote out all of the ways to use the second SSD optimally so that you balance the space used on both drives.You would not install Windows to the second drive or you'd have another Windows to manage which you dont' need. Just use the second drive to offload files first as per the instructions I wrote out in first post, then when needed install new Apps to the second SSD via Storage settings. But having the User folders on the second SSD should cover it since everything you put in Documents, Downloads, Pictures, etc is going to go to the new SSD without any effort. Just keep your files in their User folders.I would not move Desktop folder off of the first SSD as it can cause problems. But all other User folders at C:\\Users\\Your User Name can be moved there per the tutorial I gave.Let me know how this goes and if you have any other questions."]},{"symptom":"Need to do a reset to change microsoft admin account name        I recently purchased a new Dell laptop and had my employee prepare it for me.  She made the mistake of using my microsoft account instead of creating a local account when first starting the computer. Now, I can't change my name on the admin account and can't be anonymous on the login page and my full name shows up on all files I create in the file info window. Is the only way to take care of this to actually have to do a factory reset? I find that hard to believe.","solutions":["Hi Azor The easiest method would be to backup your files, then create a new user profile as a local Admin account (do not provide Email address) then then delete that original user profile . . .Open the Settings App Go to Accounts - Family and other People Click 'Add someone else to this PC' Follow the prompts to create a new account (choose 'I don't know this persons login details')Close the settings app Log out of that user account Log into your new account Click the Start Button, type netplwiz and hit Enter In the resulting dialog, select the old account and click 'Remove' That's It, your new Admin Account will replace the old account","Sounds like your employee may know more about computers than you, so have you asked that employee to help you? Have you looked at Settings>Accounts? Be sure to read all information provided.","Thank you for your reply. I actually did something like that but when I logged into the new account the system started changing all sorts of settings I had made for my original account because I had installed a lot of things already.  For example, I installed Classic Shell and Dropbox (with lots of local files) and Adobe Acrobat and I made the latter my default for opening PDFs. As soon as I first logged into the new local account, I got a variety of messages changing my defaults back to MS Edge (which I do not use). So, I got worried that perhaps I would wreck my access to everything I set up on the original account (because I know very little about accounts) and logged out and logged into the original account and deleted the second account I created. I actually uninstalled most of the stuff I installed preparing for a factory reset so it probably makes no difference now (I guess I should have come here with this question first).  But I'm curious, if I had continued with the second account I described above and deleted the original admin account, would my view\/access have been the exact same as the original account except for these irritating default changes that the system did automatically?","My employee's grandfather just passed so I'm not bother her. Regardless, it was her first time ever dealing with Windows 10. She did not know about the local account option.  MS does not make this very clear that the user will have no option to change accounts names after the fact.","Creating another account worked BUT there was a step missing. You have to assign the admin type to the new local account you create before you can proceed with logging into the new one and removing the original account. Thanks! ","Hi Azor, I am really glad you resolved this!"]},{"symptom":"Display color became oversaturated after a MS account Sync        In Account>Sync I verified my Microsoft account then I synced settings, after that my Display colors straight up become oversaturated (no good looking).Ive searched in google to change back, get into color management, try to set default color profiles, not working, the display is not changing a bit of  a color even though im trying with different color profiles i could find in the system. I did perform restarting the computer many times. So please help me fixing this cuz i cannot stand a sight of it, it is more ugly and disgusting to see on the outside than the screenshots ive put in here, so pls save me, this is my one and only device. ","solutions":[]},{"symptom":"Terrible WiFi Problems        I built a new pc, and it wont let me connect to the internet. I have a little circle with a backward slash through it by my wifi symbol. I have checked so many people and contacted so many experts. It seems like i dont have a wifi drive in my pc for some reason. So i tried to download one for my motherboard, and it does nothing, nor change anything. Im getting really annoyed by this, and i dont know when ill ever get to use my new gaming pc.","solutions":["Hi RTV, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.Can you provide us with the manufacturer and model of your motherboard? Not all desktop PCs will have wifi capability but we can check for you with this information.If it does not have wifi, you may be able to use a wired Ethernet connection, or purchase a USB wireless adapter in order to connect to your wireless router.Please reply and let us know the model number and we would be happy to look into providing some suggestions!Regards, -Ashton","You say you have an icon next to your WiFi icon.  Have you clicked on the WiFi icon?  Do you get a popup with a list of networks?  If so is your network there?","I forgot to say, I am also using a brand new ethernet cable, and it's still not doing anything. It doesnt even try to find a network.","Do you have a router? 2.4 or 5 Ghz?  If so have you reset it lately?  Do you know the network addresses it has?","I have, it does nothing. And it doesnt even show networks. It just tells me to go to the Network and Internet in the settings. I've tried everything.","Thanks for the extra information. Would you be able to provide the make and model number of your motherboard and we can help you troubleshoot further.If possible, could you take a screenshot of Device Manager, with the Network adapters section expanded and showing?You might have already checked this support article from Microsoft, but if not it has some additional information:https:\/\/support.microsoft.com\/en-ca\/help\/400046...","I really dont know, im only 13, but a really smart 13 year old. And i wouldnt be able to check all that until the morning, because i dont want to wake anybody up. But i reset it today like 3 times. And you dont think its because it doesnt even show a wifi driver?","Trust me, i have installed drivers from the motherboard website, and there is nothing that says wireless in the network adapters.","What router?","Hi RTV. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything that works to fix Wifi so that at least something will work. Even if you've already tried a step please try or check it again in sequence. If you need any assistance I'll be standing by here to help:Update your network adapter drivers from the PC maker's Support Downloads web page using the full model number, HP Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.If you have the latest network driver then try on it's Driver tab also to Roll Back, or Uninstall and then restart PC to reinstall the driver. Try also all older drivers from Update Driver > Browse > Let Me Pick list working backwards.Go to Device Manager > Network Adapters, select Wifi adapter, then Power Management tab, clear the check box to \"Allow the computer to turn off the device to save energy.\" Then on the Advanced tab disable any energy-saving options.If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool explained here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them.If this was caused by Version update then you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool.For Wifi won't connect after Version 1903: https:\/\/windows101tricks.com\/fix-wifi-keeps-dis...https:\/\/www.techrepublic.com\/article\/wi-fi-and-...https:\/\/pureinfotech.com\/fix-wifi-problems-wind...Enable IPv6 in the network adapter settings: https:\/\/www.tenforums.com\/tutorials\/90033-enabl...Run the fixit from https:\/\/support.microsoft.com\/help\/929852 (Re-enable IPv6 on all nontunnel interfaces) and reboot.Right click the network icon in System Tray at bottom right end of task bar to Troubleshoot Problems.Try all of these steps: https:\/\/support.microsoft.com\/tr-tr\/help\/10741\/... https:\/\/www.kapilarya.com\/how-to-reset-network-...Go to Settings > Network & Internet > WIfi > Manage Known Networks, highlight and remove the network having problems, restart PC to see if it shows up again.Try plugging in by ethernet cable to the router to compare, then plug the ethernet cable into the modem (if separate) to see if this might be an issue with the router.Try powering off modem, router and PC and then restarting in that order with 1 minute in between each. You may need to reset your router or even optimize it following these steps:https:\/\/www.lifewire.com\/resetting-a-home-netwo...https:\/\/www.pcmag.com\/article\/258865\/how-to-set...Your router manual is always available from the manufacturer's website for your exact model.You also are entitled to Support from your internet provider to get online on all devices. This is always included in the monthly bill. If your router is less than a year old they will also Support getting it connected and optimized.Another option is you could replace the wireless adapter with an inexpensive USB nano adapter like this one:https:\/\/www.amazon.com\/OURLiNK-600Mbps-Wireless...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Why won't Windows 10 Pro Install        Greetings.      Via a media creation tool (USB), I was able to reinstall Win 10 Pro on computer #1 since I had Win 10 before.     I attempted to install, using the same tool on computer #2 with 32  bit O\/S which has a 64 bit processor. It was rejected: \"This Version of this file is not compatible with the version of windows you are running, etc\" As I have read, that if the version of the tool is 64 bit, which it is, it should be able to install on the computer using 32 bit if the processor is 64 bit. Am I correct and why won't it install.","solutions":["Are you clean installing Windows on the problem PC or upgrading to Win 10 Pro from a previous version?Tbh it wouldn’t make sense to install a 32bit OS on a PC with a 64bit processor so is there any specific reason why you wish to do this? 32bit programs will run fine on 64bit OS.","I think you misunderstood.     I attempted to use the Win 10 Pro (64 bit) media creation tool to install Win Pro 10 on a computer with Win 7 Pro operating on 32 bit O\/S but has a 64 bit processor. It was rejected & I interpreted the rejection as being because the tool & computer are using different bit O\/Ss.  Even with that, I have read that it should install if the tool O\/S is 64 bit & the computer processor is 64 bit, it should install even if the computer is using a 32 bit (incompatible) O\/S.","Does the media creation tool contain both 32bit & 64bit OS? Often the media will create just 64bit version unless you choose both.When you downloaded the tool did you choose to download media for another PC? Is there any specific reason why you wish to use 32bit as this will be slower on a 64bit PC & if you have more than 4GB ram it’ll not use the additional GBs?","Why do you insist that I want to keep using 32 bit? I do not.     Maybe another way;   My goal is to install Win 10 Pro 64 bit on a computer that is currently Win 7 Pro 32 bit. I tried using the install tool (Win 10 Pro 64 bit) but it got rejected because the tool at 64 bit & the computer at 32 bit are incompatible.      The processor in the computer with the 32 bit O\/S has a 64 bit processor and from what I have read, as long as the processor and tool are compatible, it should install. I don't know if that is true.","Sorry, I’m a bit tired so misread the question.Unfortunately you cannot change from 32bit to 64bit by upgrading Windows you must do a clean install of the OS.Edited via community.","I know the feeling & understand. Your reply creates a couple more questions;If I have a Win 7 Pro disc with a 64 bit O\/S can I use it to upgrade  from a Win 7  Pro, 32 O\/S bit that  has a 64 bit processor?Will I lose anything on the computer, files, etc.","You can use the disc to clean install Win 7 then upgrade to Win 10 but not to upgrade from 32 to 64bit.https:\/\/www.sevenforums.com\/installation-setup\/...You can clean install Win 10 64bit just as easily.","Your mean if I have the money to buy it.","Actually if you install Win 7 you can still upgrade for free via the media creation tool & choose upgrade now or if you clean install Win 10 you should be able to activate it with the Win 7 key if you have it.","In my original post on this, I believe I said that I tried to use the media creation tool which I have on USB & was denied based on incompatibility between the 64 bit in the tool & 32 bit that is on the computer."]},{"symptom":"Microsoft Family restrictions causing startup issues.        Upon restart, Microsoft Family service refuses to load properly on child's PC (Win 10). Window appears to load\/reload constantly (flashing rapidly in upper left screen corner) and prevents loading even of task manager to see what might be going on.Seems to occur after child's time runs out and parent has granted extra time or adjusted screen or app time from mobile or other PC.Eventually, the PC will boot fine, but this seems to be happening multiple times weekly.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. There might be some conflict in the registry with the changed settings for the Child account.1. I suggest you to kindly Back Up all the files from the Child account and Remove the child account from Settings.2. Then Add the Account again. Here is how you can remove an account: To remove a Microsoft account from your Windows 10 PC: Log in to the Admin Account (Adult) Click the Start button, and then click Settings. Click Accounts, scroll down, and then click the Microsoft account you would like to delete.Click Remove, and then click Yes."]},{"symptom":"Does downgrading Windows from Enterprise LTSC to Professional keep my personal files?        Hey there!My friend recently got back his PC that was formatted by a technician. The problem is that he installed Windows 10 Enterprise LTSC on it, which isn't okay with him, because he has to use the Microsoft Store.We want to downgrade it to Windows 10 Professional, and we want to use the Media Creation Tool, but we don't know if that is going to keep his personal files or not.So, does the media creation tool keep your personal files when downgrading from Windows 10 Enterprise LTSC to Windows 10 Pro?Thanks in advance,-Francesco","solutions":["Unfortunately you cannot downgrade from Enterprise to Pro but will have to clean install Pro.However there is something you can try if Enterprise was activated with a volume license. This is not guaranteed to work but worth a try.Run this cmd within powershell with admin powershell “(Get-WmiObject -query ‘select * from SoftwareLicensingService’).OA3xOriginalProductKey”Or wmic path softwarelicensingservice get OA3xOriginalProductKey if using cmd prompt.Or: Check this program to reveal if there’s a key embedded in the BIOS: https:\/\/neosmart.net\/OemKey\/Or: Download and run this: https:\/\/www.microsoft.com\/en-us\/p\/showkeyplus\/9... to find all keys used on the PC.1. Open an elevated command prompt Type slmgr \/ipk <ProductKey> (Replace <ProductKey> with one of these below) - The key you found when running oemkey program. -YTMG3-N6DKC-DKB77-7M9GH-8HVX7 – Use if you had Home. Even if you upgraded to Pro through Windows Store-VK7JG-NPHTM-C97JM-9MPGT-3V66T – Use if you had Pro. Purchased as Pro not upgraded from Home-BT79Q-G7N6G-PGBYW-4YWX6-6F4BT – Use only if you have a Single Language edition Reboot the PC. (Critical step. This will cause an activation event at next startup and will do many ‘background’ tasks necessary for successful activation)Once in the OEM\/Retail ‘channel’ activation will complete successfully using 1 of these methods1. Automatic - No user interaction required. If the hardware has not changed and they had Windows 10 successfully installed and activated on this hardware, the Digital Entitlement will be found and brought back down to the PC.2. Activation Troubleshooter – Automatic after customer presses button. 3. Manually changing to a OEM\/Retail product key using Settings > Update & security > Activation > Change Product Key.This is not the VLK you obtained from Amazon, eBay, Kinguin, etc. This will require a OEM\/Retail key. Comes from the OEM within the BIOS, from the packaging you bought in a Retail Store, or from the email you received from Microsoft Store.","Thank you for your quick and complete reply.I will try all of these steps once we see again.Thanks,-Francesco","Keep me updated."]},{"symptom":"downloads        Keep losing down loads .How do I retrieve past downloads","solutions":["Hi geopri71 The Downloads folder was never meant to be a long term storage location, Microsoft never enforced this, however, in version 1903 of WIndows 10, Microsoft added the Downloads folder to the Disk Cleanup process in WIndows 10So if you have run Disk Cleanup or if you use a PC cleaner like CCleaner, that will have deleted the contents of your Downloads folderIf that is what has happened, the only chance you would have to retrieve those files would be to use a 3rd party utility like the free version of Recuva or EaseUS to try to restore those files . .."]},{"symptom":"Windows 10 does not boot        Yesterday I turned on my computer and received an error code 0x0000017. I have tried all the options given in this error but I can't get anywhere.I don't have a Windows 10 diskAny idea what to do?","solutions":["Hi, Rubyalston485 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"No audio Output Device is installed        So a few days ago, my laptop was fine, audio was great and everything. I had Bluetooth speaker connected, after I turned off Bluetooth, I was trying to watch YouTube and noticed I had no sound, I deleted the audio driver and restarted my pc thinking it'll reinstall, but it didn't. So I factory resetted my laptop twice, clean wipe and everything and I'm still having the problem, I downloaded the realtek hd audio driver from the manufacture website and restarted my pc and it's still giving me this problem. I spent the whole day looking at diff methods to help me get my audio driver back and hear sound again. Can someone help me?  I gave a bad explanation but it's the best I can do right now. ","solutions":["Hi Ethan. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you all possible solutions for Sound problems in order of priority, so please try any you've already tried again in order. If you have any problems performing any steps I'll be standing by here to help you.1) Update the sound driver from the PC or device maker's Support Downloads webpage for your exact model, if it is newer than the one presently installed in Device Manager reached by right clicking the Start button. While there compare to make sure you also have the latest BIOS, Chipset, Display, Network and all other drivers. 2) Restore the Windows Audio Service which may have become disabled: https:\/\/www.tenforums.com\/tutorials\/57567-resto... 3) Next try these checklists: https:\/\/support.microsoft.com\/en-in\/help\/402699... https:\/\/www.howtogeek.com\/443702\/how-to-fix-sou...4) Right click Volume icon in System Tray, choose Sound Settings, from the Output and Input devices dropdown menus, choose then one(s) affected to see if that helps. If not use the Troubleshoot button nearby.5) Run the Playing Sound troubleshooter at Start button > Settings>Update & Security>Troubleshoot.6) Try rolling back the sound drivers in Device Manager reached by right clicking the Start button. Choose Sound controller and other audio devices, then Driver tab, then Roll back if available.7) If no newer sound drivers then uninstall the one presently installed in Device Manager, reached by right clicking the Start Button. Restart PC to reinstall.8) Try other and older drivers for your model Sound controller, too. For example, try the next oldest driver in the model's online Support Downloads list. To try all previous drivers installed on your system, in Device Manager choose Sound controller's Driver tab, then Update Driver, then Browse, then Let Me Pick. Finally, try installing the latest Sound driver in Compatibility Mode as shown here:https:\/\/social.technet.microsoft.com\/Forums\/win...9) If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 10) If this was caused by a Version update (which you can confirm at Settings > System > About) then you can roll back the version in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 11) You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... 12) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. 13) If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]}]}