{"windows":[{"symptom":"test microphone wont turn off        ive tried restarting, checking the cords, changing to a different mic but no, it wont turn offive even turned off what it says it was connected to. please help me","solutions":["Hi, Rather than restarting, have you tried shutting down? Thanks","Hi, unfortunately this did not fix the problem. "]},{"symptom":"TSP600 printer        I updated to windows 10 now my tsp600 receipt printer will not work...  Options??","solutions":["Hi Todddrei Have you tried re-installing the drivers for your Star TSP600 from the support page below?http:\/\/www.starmicronics.com\/support\/default.as...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]},{"symptom":"All apps \"not compatible with this device\" after SSD put in.        I recently put and SSD into my computer and set it as my boot drive and installed windows 10 on it. However, after installing I went to download BT Sport from the windows store but it said that my device is incompatible. I checked a couple of other apps and they were also incompatible. Is there a setting I need to change or have I done something wrong in setting up the SSD?","solutions":["Hi Tom, Most likely you have installed an older version of Windows 10 and that needs to be updated . . .Click your Start Button, type winver and hit Enter On the resulting dialog, what Version No. and build No. of Windows 10 are you running?","Never even thought about that, I'm only on version 1511 and build 10586.0. I'll get that sorted and go update now. Thanks a lot!","Glad to Help!"]},{"symptom":"connecting play station 3        I'm running windows 10 and  I can connect my xbox to wifi however I can't connect my ps3 does anyone know how to connect ps3 to a wifi?","solutions":["Hi, Try to follow the instructions on this Link. Link: https:\/\/www.playstation.com\/en-gb\/get-help\/help... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Network Adapter Issues        So Ive had my computer for a little more than a year now and it was doing fine. However, these past few days Ive run into several issues with my network adapter. As time has went on, it has gotten to the point where i can no longer find my network adapter in my device manager, thus rendering my computers ability to use internet useless. Ive tried several things including:1) Simply restarting my computer2) \"Show Hidden Devices\" in the the device manager3) Ive run command dvcmngr_show_nonpresent_devices (or something very similar to that in system info4) Network Reset5) And finally Factory Reset (with retaining personal files)This issue has caught me by suprise considering the quality of my computer hasnt been an issue until now. Just for context I have a computer starting on Windows 10 OS, so reverting to Windows 7 doesnt appear to be an option","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? What’s the make & model of the network adapter? Are its drivers up to date? In the end If it is permanently missing then it may be that the adapter\/card has failed.","Do you still require help?"]},{"symptom":"Microsoft .NET Framework error on sign in.         Hello,It seems every time I log on I'm getting this .Net Framework errorI've tried disabling both options following the control panel > Programs > Turn Windows features on and off, but this hasn't changed anything.Any ideas?_________________________________________________________________________________________________________See the end of this message for details on invoking just-in-time (JIT) debugging instead of this dialog box. ************** Exception Text **************System.BadImageFormatException: Could not load file or assembly 'ClientAppAPI5, Version=1.0.0.0, Culture=neutral, PublicKeyToken=null' or one of its dependencies. The module was expected to contain an assembly manifest.File name: 'ClientAppAPI5, Version=1.0.0.0, Culture=neutral, PublicKeyToken=null'   at emsclient.MainForm.workerSettings_RunWorkerCompleted(Object sender, RunWorkerCompletedEventArgs e)   at System.ComponentModel.BackgroundWorker.OnRunWorkerCompleted(RunWorkerCompletedEventArgs e) WRN: Assembly binding logging is turned OFF.To enable assembly bind failure logging, set the registry value [HKLM\\Software\\Microsoft\\Fusion!EnableLog] (DWORD) to 1.Note: There is some performance penalty associated with assembly bind failure logging.To turn this feature off, remove the registry value [HKLM\\Software\\Microsoft\\Fusion!EnableLog].   ************** Loaded Assemblies **************mscorlib    Assembly Version: 4.0.0.0    Win32 Version: 4.7.3324.0 built by: NET472REL1LAST_C    CodeBase: file:\/\/\/C:\/Windows\/Microsoft.NET\/Framework64\/v4.0.30319\/mscorlib.dll----------------------------------------emsclient    Assembly Version: 3.2.16.1    Win32 Version: 3.2.16.1    CodeBase: file:\/\/\/C:\/Users\/sbolin\/AppData\/Roaming\/Xink\/Xink%20Client\/emsclient.exe----------------------------------------System    Assembly Version: 4.0.0.0    Win32 Version: 4.7.3353.0 built by: NET472REL1LAST_B    CodeBase: file:\/\/\/C:\/WINDOWS\/Microsoft.Net\/assembly\/GAC_MSIL\/System\/v4.0_4.0.0.0__b77a5c561934e089\/System.dll----------------------------------------System.Windows.Forms    Assembly Version: 4.0.0.0    Win32 Version: 4.7.3324.0 built by: NET472REL1LAST_C    CodeBase: file:\/\/\/C:\/WINDOWS\/Microsoft.Net\/assembly\/GAC_MSIL\/System.Windows.Forms\/v4.0_4.0.0.0__b77a5c561934e089\/System.Windows.Forms.dll----------------------------------------System.Drawing    Assembly Version: 4.0.0.0    Win32 Version: 4.7.3056.0 built by: NET472REL1    CodeBase: file:\/\/\/C:\/WINDOWS\/Microsoft.Net\/assembly\/GAC_MSIL\/System.Drawing\/v4.0_4.0.0.0__b03f5f7f11d50a3a\/System.Drawing.dll----------------------------------------log4net    Assembly Version: 2.0.8.0    Win32 Version: 2.0.8.0    CodeBase: file:\/\/\/C:\/Users\/sbolin\/AppData\/Roaming\/Xink\/Xink%20Client\/log4net.DLL----------------------------------------System.Configuration    Assembly Version: 4.0.0.0    Win32 Version: 4.7.3056.0 built by: NET472REL1    CodeBase: file:\/\/\/C:\/WINDOWS\/Microsoft.Net\/assembly\/GAC_MSIL\/System.Configuration\/v4.0_4.0.0.0__b03f5f7f11d50a3a\/System.Configuration.dll----------------------------------------System.Core    Assembly Version: 4.0.0.0    Win32 Version: 4.7.3324.0 built by: NET472REL1LAST_C    CodeBase: file:\/\/\/C:\/WINDOWS\/Microsoft.Net\/assembly\/GAC_MSIL\/System.Core\/v4.0_4.0.0.0__b77a5c561934e089\/System.Core.dll----------------------------------------System.Xml    Assembly Version: 4.0.0.0    Win32 Version: 4.7.3056.0 built by: NET472REL1    CodeBase: file:\/\/\/C:\/WINDOWS\/Microsoft.Net\/assembly\/GAC_MSIL\/System.Xml\/v4.0_4.0.0.0__b77a5c561934e089\/System.Xml.dll---------------------------------------- ************** JIT Debugging **************To enable just-in-time (JIT) debugging, the .config file for thisapplication or computer (machine.config) must have thejitDebugging value set in the system.windows.forms section.The application must also be compiled with debuggingenabled. For example: <configuration>    <system.windows.forms jitDebugging=\"true\" \/><\/configuration> When JIT debugging is enabled, any unhandled exceptionwill be sent to the JIT debugger registered on the computerrather than be handled by this dialog box.","solutions":["Hi Ashley DotNet Framework errors rarely indicate a problem with the Framework itself, this is nearly always generated by an application installed on your PCIn your case, it is EMSClient by Xink that is causing this error to appear You should uninstall that from Settings - Apps Then if you need that software, download and install the newest version from their website . . ."]},{"symptom":"Wondows Update Service         - I have the update option switched to automatic, however when I try to check everything is up to date, I get a message stating that the Update Service is not running. Is this an issue linked to Windows 7 soon to be no longer supported , if not any suggestions on how to resolve same would be helpful.  Thanks.","solutions":["See reply #2 athttps:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/windows-update-cannot-currently-check-for-updates\/9ed15bdf-6f96-45bf-b8ad-5cc4a6d6e698Regards, VZ"]},{"symptom":"Cannot retrieve a File or document        Please advise how to retrieve a file or document that has been lost when Microsoft installed a new driver for Windows 10 Pro? I tried searching the cPanel files and could not find it.Please reply.","solutions":["Hi Paul, Can you please specify what type of file is this? Most likely, if a new driver is installed and a file or a document has been gone.Definitely it is a part of the previous driver that you installed more likely. However, I'll be waiting for your response to further identify this issue. Thanks and regards,","Hi Paul, Can you please specify what type of file is this? Most likely, if a new driver is installed and a file or a document has been gone.Definitely it is a part of the previous driver that you installed more likely. However, I'll be waiting for your response to further identify this issue. Thanks and regards, The file is a document it could be any file name. I guess this answers my question.Thanks.","Hi Paul, That's cool. Please let us know if you have concerns in the future. You have a good day!","Hi Paul, That's cool. Please let us know if you have concerns in the future. You have a good day! Richard I have another problem when I click in Start on my pc a display of apps is shown. My Mail apps moved to the top left corner. How do I drag it down to all the app displays in the left centre of the monitor? Is this app pinned or unpinned?Thanks for replying.Paul","Hi Paul, That's cool. Please let us know if you have concerns in the future. You have a good day! Richard I have another problem when I click in Start on my pc a display of apps is shown. My Mail apps moved to the top left corner. How do I drag it down to all the app displays in the left centre of the monitor? Is this app pinned or unpinned?Thanks for replying.PaulSomeone reply to the above question asap.Thanks.Paul"]},{"symptom":"Upgrade problem        After updating to win 10 unable to find wi fi connection only offers to connect via ethernet which is not possible","solutions":["Hi John Do you mean you upgraded from a previous version of Windows 10, if so, did you then install whatever device drivers Windows 10 could not find during that upgrade?Open Device Manager (accessible by right clicking your Start Button) Expand the Network Adapters section Do you see your WiFi card (WirelessLan) listed in that section, and does that or any other devices have an exclamation mark beside it?What is the Make and exact Model No. of your PC - that will be printed on a sticker on the bottom casing . . .","Hi Johnhoner1,Have you checked all the required drivers on you PC as suggested by DaveM121? If no drivers are installed, if you can't connect to the internet, connect your PC to the router via the WLAN cable. Your PC should be able to recognize the connection, and it will connect to the internet automatically. Upon connection, you'll be asked to enter the security keys of you WiFi router.When you have access to the internet, update the missing drivers required by your PC. Upon updating, the WiFi drivers will be downloaded. After the download is complete, disconnect the cable and see if the WiFi network bars on your PC appear."]},{"symptom":"calender        all of my calander events have disappeared from my Surface 3 with windows 10.","solutions":["What calendar?","The one under \"C\" in my start menu.","Hi keithmoulton, My name is Riccardo and I'd be happy to assist... Go to Start > type in Apps & Features Click Apps & Features icon Go down to Mail and Calendar Click Mail and Calendar Click Advanced Options Go down to Reset and click that to reset the app Are you using the Mail and Calendar App? Let me know if the above works, I will be here to assist.","reset says it will permanently the apps data including preferences and sign in detailsI will lose all my calander data? What does it mean by perfernces and sign in details?thanks","It means any customizations you made to the mail app. It should only reset app settings because it’s not working What kind of email do you have? Gmail? Outlook?","Yahoo mail. So I will not lose my calender events or any e mails, just any customization I made to the two programs?thanks","The reset did not restore my lost calender events."]},{"symptom":"Remove OneDrive and Email Account on Windows for Office365 Account I No Longer Have Access To        I was a contractor for a company, and they gave me an office 365 email address and one drive account that I used on my computer. I've since ended my contract with that company, and no longer have access to that office365 account. However, I can't remove the onedrive or account from my computer, resulting in warnings under email and accounts and onedrive.When I click on manage under email and accounts, it takes me to https:\/\/account.activedirectory.windowsazure.com\/r\/#\/profile, which I can't login to because I don't have access to the email. I have already deleted it from control panel\/email. With onedrive, I can close it, but I have to do that every time the PC boots. If I go to settings, it again requires logging into an account I can't access. How can I resolve this? ","solutions":[]},{"symptom":"Getting weird screen then freezes up        My computer is less then 2 weeks old and I got this message that covered the whole page and wouldn't let me do anything, it said bbleaguez.club port 443 telling me to contact them at Microsoft I am not giving out my password please help","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Sounds a lot like your computer is displaying a fake support message - as you've mentioned you should definitely ignore it and not enter any details or download any offered \"fixes\", etc.The message will be in a full-screen browser window - first thing you need to do is try and close it if it's still on screen.To do that try pressing CTRL-ALT-DEL, and choose \"Task Manager\". If you're able to get the list of tasks displayed look for any that mention a browser {(Edge, Chrome, Firefox, etc.) and try and End them. Once you hit the right one the message should disappear.In addition to that - or if you can get the message to disappear restarting the computer will usually clear it for the moment. Again press CTRL-ALT-KEY keys and use the power symbol at the bottom-right to choose RESTART.Once you get the message cleared run a scan with Windows Defender just to be sure there's nothing left over. START > Settings (cog symbol) > Update & Security > Windows Security > Virus & Threat protection. From there choose Quick Scan and wait for the results.Regards, David","And to prevent even getting these fake, so-called Tech Support warnings: install a good ad and tracking blocker...I use and recommend the free extensions uBlock Origin and Ghostery.Most browsers offer the same or similar extensions...  Also go through your browser's settings and adjust them to your wishes. For example, block 3rd party cookies etc.You might want to read: How to tighten security and increase privacy on your browser - Malwarebytes Labs | Malwarebytes Labs  and Answers to common security questions - Best Practicesespecially Beware of Phony Emails, Phone Calls & Tech Support Scamswhich explains various methods how to get out of those fake alerts etcincludes Resources to protect your browser, privacy & help prevent browser pop-up ads and scamsexplains what to do when you keep on seeing these fake sites despite having followed the above mentioned advices."]},{"symptom":"OneNote Screenshot        I am trying to find where One Note puts the screenshot.","solutions":["Hello gailg494, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemDo you mean the backups or saved files? The default location that one note saves the backups is under C:\\Users\\Your user profile\\AppData\\Local\\Microsoft\\OneNoteOr in Onedrive if you are signed in. Feel free to ask back any questions and let us know how it goes. Cheers! Farah"]},{"symptom":"Windows Hello error 0x801c004d        HiI am unable to enroll by laptop to use a PIN for login.I receive this error, 0x801c004d. This error is not listed on Microsoft's site.I have enable pin login, taken ownership of the ngc folder. Including several other options. The issue persists.Any ideas?Thank you***Moved From: Windows 10\/Security & privacy***","solutions":["Hi Adam,Thank you for writing to Microsoft Community Forums.I appreciate the troubleshooting you have done and let us know what other troubleshooting steps you have performed.In order to get clarity on this issue and assist you with appropriate troubleshooting steps, please reply with the answers to the questions below.Are you setting up PIN for the first time?What is the complete error message that you get when you try to add the PIN?Are you aware of any changes made to this computer prior to the issue?Meanwhile, try the below methods and check if this helps.Method 1: Checking for Windows Updates.Check if your Windows is up-to-date by going toSettings > Update and Security > Windows Updates and install all the Windows Updates if there are any.Restart the computer once after installing the updates and check if you are able to add the PIN.If you are getting the same error after installing the Windows Updates, then followMethod 2.Method 2: Checking The CNG Key Isolation Service.Please check if CNG Key Isolation Service is running and theStartup type is set to Automatic by following the below steps.Press the Windows and R keys > TypeServices.msc > Hit Enter.Look for CNG Key Isolation service > Double-click on the service > Change the Startup type toAutomatic > Start the service > Click on Apply > OK.Restart the computer once and check if you are able to add the PIN.If you are getting the same error after Starting this service, then followMethod 3.Method 3: Creating New User Account.If the above methods are not working, then I suggest you to create a new user account by following the steps fromCreate a local user or administrator account in Windows 10 and check if you are able to add the PIN from this new user account.Note: Your user data will be inC:\\Users\\YourUserName.If you have additional questions, or if the issue persists after performing the above troubleshooting steps, please let me know by replying to this thread. This way, I'll get notified and respond back to you as soon as I can.","Hi ShafeeqI have the latest Windows update patches installedThe CNG service configuration has not helped and I have confirmed it is runningI have tried a new account and get the same issueThank you","HiAny other suggestions?","Hi Team,Any *Suggestion on  0x801c004d this error?","subjugate means literally \"bring under the yoke\".This error is related to a configuration issue in ADFS, Device Registration","I'm having the exact same problem, tried all those exact same steps, and continue to have the same problem. This hasn't been updated in a week. Does anyone have any other articles to reference or suggestions?","Try following the steps outlined in this article, just the one pagehttps:\/\/docs.microsoft.com\/en-za\/windows-server\/identity\/ad-fs\/operations\/configure-device-based-conditional-access-on-premises","Thank you for the comment. But issue is is few machines. Not for all.","Read the entire post...","Same problem with same unlisted (still) error code for setting up PIN and has been for several months. I notice that Shafeeq_Khan of Microsoft has gone all silent since June 19th. My pin used to work but since yet another Microsoft update this has messed up PIN settings.In addition the Fingerprint log in now does not work however in attempting to set up a new fingerprint log in you have to have you PIN ! Which of course itself does not work. But Microsoft in its infinite wisdom does not allow you to set up your fingerprint with your normal log in. Does anyone live in the real world in Microsoft Towers?Has anyone got any bright ideas please!? Thank you         "]},{"symptom":"Audio cuts out and comes back        Ever since I got my computer (about a month ago) I've been having a very annoying problem. The audio from my headphones stops for 1-2 seconds and then immediately returns. There's nothing wrong with my headphones, I've tried using different ones and I kept having the same issue. I've also updated  to the latest Windows version, updated BIOS and audio drivers but nothing has solved my problem yet.","solutions":[]},{"symptom":"My windows 10 pro laptop is automatically lockdown in 5 minutes why        My windows 10 pro laptop is automatically lockdown in 5 minutes why. . ","solutions":["Hello RajiRaji1, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemDoes this happen when you are inactive on your computer? Regards! Farah"]},{"symptom":"turn off ease of access        how to turn off ease of access","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Ease of Access is a whole range of different features - it really depends which bit you want to change.If you click START > Settings (the cog) > Ease of Access - and then have a look at the various sections down the left-hand site you can control the various assistive features.Regards, David"]},{"symptom":"Unable to Download Standard PDF's Anymore        Hello,I used to be able to download PDF's (Not web-version Adobe Acrobate files) from Quickbooks directly to my laptop, then I was able to attach the PDF in an email; but for the past couple months, my clients are telling me they cannot open the Adobe Acrobat Files it has been sending out instead of the PDF's like it used to.I had other members of our company send out the PDF's from their computer, because they are still able to successfully download the PDF from Quickbooks and attach it in an email to send to our clients.Does anyone know what this could be? Thanks so much in advance for your help.--Nick Foster","solutions":["When you create your PDF can you save it and try to open it yourself.Please check the version and build of Windows 10, type winver in Search and select the top result. Post a screenshot of the result or quote the version and build in full.","Hello Nicholas, thank you for providing this question. I am a seasoned Windows expert with almost a decade in usage and support experience and hope to resolve your problems quickly.What program did you use to download export the pdf? Which filetype do you get? Can you open the downloaded file yourself using a pdf reader? When in acrobat having the file open can you export the file to a new pdf? If you consider your problem solved it would be very good if you marked the answer which helped you so others can find and use this thread.If this didn't solve your problem or you need further assistance please answer in this thread and i would be happy to help.kind regards F. Grobusch","Does this help?","It does in the sense it tells me you are up to date with Windows 10.Can you let us know about the other question and does QuickBooks create the PDF report for you. Is your version of QuickBooks the same as your colleagues. Is their Windows 10 using the same version & build as yours.","Thank you for your willingness to help!The filetype is: Adobe Acrobat File; This is the sign of the issue, because when it was working previously, it used to allow me to use filetype: PDF. The Adobe Acrobate File type is formatted in a much different way, and my clients aren't even able to view it. Prior to this, I am not sure how the settings were originally; I must have inadvertently changed the program or settings?I am able to open these documents myself, but it is very bulky; it does not just show the document, but also shows a bunch of other content(See photo I attached). Thank you for helping me through this! ","Corect, all of our quickbooks are up to date; 1 other user uses Windows (he is still able to download PDF's properly) and our other users use Mac (They are still able to download PDF's properly as well) so something tells me I must have inadvertently messed with a setting, perhaps?","On the right side you see: \"Export PDF\". What happens when you click that?","Unless I'm misunderstanding what QuickBooks is doing I would think it creates a PDF file for the report. What you use on a PC, Tablet, Phone or other device (like a Mac) depends on what program or app you use to open the PDF file and not how it is create.If you installed Adobe Acrobat on your PC and set it as the default to read PDF files then that would open the PDF if you saved it to your PC. The fact that other people, using a Mac can complete the task would suggest a setting has changed in QuickBooks rather than Windows 10.Can you create the report and save it then get it to a Mac user to see how it opens what you have created on your PC. Can you describe the process you go through to create the report, does it print to a PDF for example.","When I click \"Export PDF\", I am given a list of options; PNG, .doc, .docx, JPEG, powerpoint, .xlsx, .rft, and .tiff","It does save it as an Adobe Acrobat file for me, however my clients are unable to open that document (however, they used to be able to view the PDF when the filetype was PDF instead of Adobe Acrobat file). When I open it, I see a lot more clutter than just the document; some sort of web version.The process is as follows:1.) Create an estimate2.) Dowload the estimate to my computer3.) Select the File Type and Location to Save it to (Only Allows Adobe Acrobate File instead of how it used to save as filetype PDF)4.) Save.thank you so much in advance for your time and help"]},{"symptom":"custom fonts        I wish to make a custom font i downloaded online my default font. The font in question is \"Rogue Hero Regular\" the reason for this font is i wish to make my laptop deadpool themed. Yet when i set it as my \"default font\" through the .reg method it still reverses back to orignal\/back up font. How do i allow my laptop to support said font so it can be my default font?","solutions":["Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.Did you do this installation method? Unzip the folder containing the fonts first. Fonts cannot be installed if they are zipped.Right click on the font file and select Install. OR Search for Fonts in the search box by the start menu. Click on the Fonts (Control Panel) link to open the Fonts Manager Drag and Drop or Copy and Paste the unzipped fonts into the Fonts Manager to install.Then you go to the windows settings and personalization and \"font\"","Sor i believe you do not understand i wish for it to be my systems default font where its the font for my files\/taskbar\/apps the when added to the regristry as a .reg just sets it to a replacement font instead of the font i want on my system because it was not preinstalled by windows system","Is that how you changed it? -----> Take care to make a backup of your registry before <----- Step 1: Launch the Control Panel from the Start Menu. Step 2: Click on the “Appearance and Personalization” option from the side menu. Step 3: Click on “Fonts” to open fonts and select the name of the one you want to use as default.Step 4: Now open the Notepad application and paste the following code into the empty text file:Windows Registry Editor Version 5.00[HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Fonts]\"Segoe UI (TrueType)\"=\"\"\"Segoe UI Bold (TrueType)\"=\"\"\"Segoe UI Bold Italic (TrueType)\"=\"\"\"Segoe UI Italic (TrueType)\"=\"\"\"Segoe UI Light (TrueType)\"=\"\"\"Segoe UI Semibold (TrueType)\"=\"\"\"Segoe UI Symbol (TrueType)\"=\"\"[HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\FontSubstitutes]\"Segoe UI\"=\"ENTER-NEW-FONT-NAME\"Step 5: In registry code above, make sure to replace ENTER-NEW-FONT-NAME with the name of the font you want to use like Courier New.Step 6: Click on File on the top menu options and then save your file as a .reg file by using the extension option “All files”Step 7: From wherever your file is saved, double-click on it to merge it with the registry by clicking Yes and OKStep 8: Simply restart your computer to let the changes take effect"]},{"symptom":"Windows 10 update v1903        Unable to update my Aspire one 1-431 laptop. The update continually fails s it requires about 8GB to install and my laptop is unable to meet this requirement. I have stripped out all additional apps other that the windows installed ones, deleted any items in the recycle bin done disk clean and fragmentation and optimisation. Suggestions?  ","solutions":["Hi Ethan, you would be amazed how many users with 32GB (29.1GB usable) of internal storage ask the exact same question here on Community each day . . .Honestly, there is only one answer, backup your data and perform a clean install of the 32Bit version of Windows 10 - that will give you more internal storage space - I know this is not the answer you are looking for, but it is the only and best Answer. You will then have enough space for the next year of Windows 10 updates and your system will be faster . ..Any device with a 32 GB SSD is not good enough to run Windows 10, regardless of the system specs put out by Microsoft.I honestly don't know why the manufacturers produced these devices. The Windows 10 folder with a couple of updates will very quickly eat up 20 - 25GB of your hard drive, mine is currently 23GBYou can reinstall Windows 10 at any time and it will not cost you anything, however you will not have enough space to create the bootable Windows 10 media, you will need to do that on another working PCSince you previously had Windows 10 installed and activated on that PC during the installation process skip the steps which ask for a product key and select the option 'I am Reinstalling Windows 10 on this PC', and activation will not be an issue, your PC will have a digital entitlement stored on the Microsoft Activation Servers Make sure you install the same Edition of Windows 10 (Home, Pro . . . etc.) you previously had installed to avoid Activation issuesClick this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), you can create a bootable USB flash drive (min 8GB) using that toolThen, Boot your PC from the Installation Media you just created (change Boot Order in your BIOS) to begin installing Windows 10"]}]}