{"windows":[{"symptom":"Windows 10 won't go to sleep after recent fall update        Have checked there are no active wake timers Turned off wake via Ethernet and all drivers\/BIOS seem up to date. Any suggestion as to why this is happening and is this a known bug requiring a patch? Also via powercfg no application are preventing sleep*Modified title for accuracy**Original title: Desktop Computer won't go to sleep after recent fall update the PC will close the screen but immediately go to log on screen*","solutions":["I too had a similar issue. I'm posting because this thread is one of the top results Google gives for Windows 10 sleep problems.The solution that worked for two computers I had that were not sleeping was as follows:Run an admin command promptpowercfg -requestsThis command lists all processes or services currently running that are preventing the computer from sleeping. The list is helpfully broken down by categories. One of my affected computers had sleep blocked by the IncrediBuild component of Visual Studio, the other by a different TSR program."]},{"symptom":"REPLICATE_OC SAFE OS WINDOWS 10 ERROR        Tried multiple...multiple times.  Cannot upgrade this client's LAST PC to Windows 10, from Windows 7 PRO SP1.Windows 7 Pro x64 6.1.7601HP Compaq Pro 6300 SFFBIOS Hewlett-PackardBIOS Version K01 v02.83Intel i5-3470 4GB RamNO AV running.  I am trying to do this remotely..as every other PC I was able to.Any advice would really be helpful, so we don't have to run out to the client's location.","solutions":["Hi Anthony My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.What procedure are you using to upgrade from Win 7 to Win 10? Booting from install media or an in place upgrade?"]},{"symptom":"Microsoft Edge on Extended Desktop Monitor (2)        I have a laptop w\/2 monitors, total of 3. I've been using Edge for almost a year, it was on one of my extended monitors and stayed there, always opened up on this monitor. Now, after some update, or something, it opens up on the other extended monitor. Each time I boot up and start using my computer now and open Edge it opens up where I don't want it, I drag it to the 'original' monitor (where it's stayed put for a year) and close it from there. Edge refuses to stay put on this monitor, where I want it to stay. ALL other browsers; I can put wherever I want, I close them, reopen them and they open where I closed them. Why does Edge not comply? Thanks for any response.BTW; I found the 'answer' to the previous requester's question on this topic insufficient;\"you cannot directly launch apps on the extended screen\" (I've been launching Edge on my extended screen for 12 months.)","solutions":["Hi GB2018 My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Try opening edge. Move it to the monitor on which you would like it to open by default. Hit the Windows key + Shift + Enter. From now on, it should open each time on the monitor of your preference. Hope this helps."]},{"symptom":"My AMD Radeon HD 7400M on my HP Laptop Windows 8 is not working        Hello, I have tried everything (AMD Cleanup tool, re-instaled drivers, etc) to make my GPU work but nothing has worked.I enetered BIOS Setup and I can't see any option to enable the Radeon GPU and stop using thr integrated Intel graphics.When I install the latest driver for my GPU from the official amd.com web page, the installer show me some king of error log.I really can't think of anything else than asking for your help. Thanks","solutions":["You will have to ask in the AMD Community.But reading other threads there, I doubt that they have Windows 8 drivers for it.And do NOT use 3rd party websites to download drivers.https:\/\/community.amd.com\/thread\/235940"]},{"symptom":"My Hp All-In-One Desktop Has a black screen and the keyboard and mouse are not working. (I know this because the keyboard and mouse usually light up)        Context: My Hp All-in-One desktop that (does NOT have the weird box thing that has a lot of cables) has a black screen also the keyboard and mouse do not work. I know the keyboard and mouse do not work because they both usually light up.","solutions":["Hi A. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Try all other ports on the PC, often the front and back will have different USB controllersPower off by holding in the power button twice, on the third time it should enter Recovery Environment which has a better chance of the mouse and keyboard working.If so choose Advanced Troubleshoot Options to try to System Restore to a point when it was working:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... If that fails try to enter Safe Mode by whatever methods works here: https:\/\/www.intowindows.com\/boot-windows-10-in-...https:\/\/www.digitalcitizen.life\/4-ways-boot-saf...In Safe Mode enter Device Manager reached by right clicking the Start button, choose the Mouse and Keyboard devices, then from Driver tab try Update Driver > Automatically, then if that fails Update Driver > Browse > Let Me Pick to try all previous installed drivers. If that fails then try to Uninstall the driver and restart PC to see if device works now.If this fails then from Device manager try uninstalling the USB controllers, restart PC to reinstall. First program the power button to Shut down the PC at Settings > System > Power & Sleep > Additional Power Settings > Choose what Power button does so you can do the restart from it. If that fails try another mouse and keyboard. Repeat the above steps if necessary to see if they work better.If not then go into Troubleshoot Options to do a Reset, saving files if not backed up:https:\/\/www.zdnet.com\/article\/windows-10-tip-re..._________________ It may be necessary to create bootable media to access Repair Mode or do the Clean install since it relies on different drivers that will often cause the keyboard and mouse to work.To create Windows 10 Installation Media on another PC install Media Creation Tool and follow the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, on second screen choose Repair Your Computer, then Advanced Troubleshoot Options, then System Restore.If that doesn't help follow steps in the Safe Mode guides above to try to get into Safe Mode. If that fails go back to Troubleshoot Options to try a Reset.If that fails choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, click Next to let it create needed partitions and start install - this makes it foolproof. Everything needed to get the best possible Clean Install is here: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... It is a better install than any amount of money can buy and a great learning experience that will make you the master of your PC because you will learn what works best and how to apply it with your own hands. If you need to rescue your files use this method: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","None of those ways work I tried a different mouse and keyboard. I also have no bootable media. Also for more context, I have not used the computer for months or weeks or days then one day I used the computer then there was a black screen. I also don't get what you mean by\"Power off by holding in the power button twice, on the third time it should enter Recovery Environment which has a better chance of the mouse and keyboard working.\"Can you elaborate on that more? Sincerely, A Stupid Idiot"]},{"symptom":"Windows 10 can't control volume with Galaxy Buds connected        So I got my galaxy buds a few weeks ago. There are no connectivity issues with them. They will connect to my surface laptop 2, no problem, but when I try to adjust the volume, the slider will move but the volume doesn't actually change. I've read many forums, contacted Samsung (to which it was stated that there was no solution and I was told to contact Microsoft), contacted Microsoft (where they told me it was an issue regarding Samsung's drivers), and messed around with it on my own.When I went into my output devices I have noticed that it comes up as two different devices. One is stereo and the other is handsfree audio. I played around with enabling and disabling them and at one point I was able to adjust the volume! But then it went back to this issue and I have no idea what I can do. Please help!! I've also posted this on Samsung's forums but I have gotten no response.","solutions":[]},{"symptom":"how to set my Microsoft account        God is Able","solutions":["More information is required to assist you about your Microsoft Account."]},{"symptom":"How do I unpause OneDrive?        I am having trouble with my OneDrive system, it keeps pausing, and I can't unpause it.","solutions":["See if this assists you:https:\/\/support.office.com\/en-us\/article\/how-to-pause-and-resume-sync-in-onedrive-2152bfa4-a2a5-4d3a-ace8-92912fb4421ehttps:\/\/support.office.com\/en-us\/article\/turn-off-disable-or-uninstall-onedrive-f32a17ce-3336-40fe-9c38-6efb09f944b0Cheers."]},{"symptom":"storage issue        I just downloaded the new Call of duty onto my PC which needs 164gb of storage. I only have 109 available so I went to clear up some space and it says I'm using 64gb in apps but when I open that folder there only 15 apps and none are over 100mb? Where is the 64gb coming from?","solutions":["I have the same issue with my storage and what I like to know is how do we get more storage for windows?","Hi Owen 1 Run Disk Cleanup twice as explained below: Open File Explorer Click on your hard drive On the Manage Tab, click Cleanup Let Disk Cleanup do its initial scan Select Everything in the list and choose Delete Start Disk Cleanup again Let Disk Cleanup do its initial scan This time in the resulting dialog, click 'Cleanup System Files' Let Disk Cleanup run another scan Select Everything in the list and choose Delete 2 Windows Explorer is useless when it comes to working out where your hard drive space is being used . . .Click the link below to download a small free utility called Treesize. Using that tool, you will instantly see where this space is being usedhttps:\/\/www.jam-software.com\/treesize_free\/Once you have worked out where this space is being used, please let us know so we can advise on what is safe to remove . . .________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]},{"symptom":"Screen lock shortcut, Windows 10 function?        Before loading Windows 10, I used to lock my computer screen using the shortcut \"Windows symbol and the letter \"L\" Now it doesn't work. Is there a Windows 10 version of this function?","solutions":["Hi Alphonse.G, My name is Riccardo and I would be happy to assist... This may have inadvertently been disabled by a registry edit...please follow the instructions below and this should be able to assist.https:\/\/www.thewindowsclub.com\/enable-disable-w...Let me know if this fixes the issue for you; if it does not please let me know and I will work with you until the issue is resolved.I look forward to hearing from you. DISCLAIMER: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hello Alphonse, As Rick posted, you may have disable the lock computer feature somehow. You can also double check using the tutorial below to see if you may have.https:\/\/www.tenforums.com\/tutorials\/84631-enable-disable-lock-computer-windows.html"]},{"symptom":"Windows Black Screen        Sporadically, Windows will blink out my desktop to a black screen. This seems unlike other black screen errors I've seen.When this occurs, the whole screen goes black, but everything continues to work just fine. In fact, I can move my mouse around on screen (and still see it) just fine - including when it transitions to other states (such as when I hover over buttons or other things that would normally be displayed.) I can also still normally engage in any activities with Windows with no apparent negative impact (outside not seeing what I'm doing.)Additionally, I can access and view the start menu by pressing the \"Windows\" key. However, the moment I attempt to launch or do anything from the start menu it disappears again. It is only visible when it has focus. All applications and attempts (including forcing a driver restart) fail to affect results. This includes launching software and applications that engage full-screen use of the monitor. They fail to initialize screen, but still function as if they had (I can see them working via ALT+TAB). Speaking of which...I can also see what's on my desktop if I ALT+TAB; while ALT+TAB has focus it permits me to view the windows and general environment just fine - but the moment I select a window or otherwise attempt to re-engage my desktop the screen returns to black. CTRL+ALT+DEL also properly functions, and the interrupt menu shows up just fine - but again when I select an option that returns to the Windows environment the screen becomes black once more.The best way I can describe it would be if I were to have a video of absolutely nothing (just black), and I put that full screen. Everything is still functioning behind the video, but I simply can't see it and have no way of determining what I'm doing - I'm literally feeling around in the dark.Does anyone have any suggestions for remedy? This is extremely problematic and several times now has resulted in the loss of an extensive amount of work because I have to log off and back on to correct it.","solutions":["Hi, SupaShaD My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.First of all, check that the Video driver is installed or updated. https:\/\/support.microsoft.com\/en-us\/help\/402844...","To preempt these concerns in the future:I consider myself to be technically adept. That doesn't mean I'm error free here, rather that technical explanations are understandable to me and it's relatively safe to presume I've conducted \"routine\" troubleshooting.To that point:Video drivers are updated.Device manager indicates no issues with video hardware.Event logs give no indication as to the cause of the screen (there is a warning related to the Oculus Library Video driver but it doesn't correlate to the times of issue and this issue persists when the Oculus is disconnected. I don't think it's causal.)I don't believe it's related to drivers specifically because it's not predicated on any specific conditions. Instead, it happens randomly and only affects the Windows desktop environment and applications. It still properly displays the start menu (when I press the Windows key,) as well as the interrupt menu (CTRL+ALT+DEL). A driver issue to me would present globally, and preclude these specific parts that still function. Furthermore, forcing a driver restart (WIN+CTRL+SHIFT+B) fails to reinitialize (although the command runs successfully.) A logoff and back on, however, will resolve the matter. This further indicates to me that this is a Windows related issue and maybe not specifically related to the video drivers.","Hi SupaShaD, With this particular issue, it is possibly caused by one or more of the following factors:1. Explorer 2. Windows OS 3. Hardware (yes, unlikely but still possible) 4. Software (drivers) In line with this: - Explorer + Windows OS - have you tried to run SFC? What were the results? Going through all steps in this article may help:https:\/\/support.microsoft.com\/en-ph\/help\/408737... - Hardware - what are the specifications of your desktop? Have you tried to use another cable for the monitor?- Software - you mentioned that the drivers are up-to-date. Have you tried clean re-installation of the graphics drivers?You may also try view the Reliability history of the computer and see if that would give us any clues. Start > Reliability History.Best,","Richard,Thanks for the reply.Explorer. I have run SFC previously with no significant results. Running it again resulted similarly: \"Windows Resource Protection did not find any integrity violations.\"Hardware - ASUS TUF Z390M \/ Samsung 970 Evo \/ Intel i7-8700K \/ 32GB DDR-4 \/ nVidia GeForce 1080 Ti. I have attempted using a different cable for the monitor, yes.Software: Drivers are up to date as of time of writing. I always run clean installations of my drivers.Having said that - the Reliability History is news to me, and represents an excellent resource I wasn't aware existed. So I appreciate that just for cluing me in to a new tool to use. And a useful tool at that, as it's indicating some serious problems that may be worth investigating. It also suggests you may be on to something here hardware wise - but there's not enough information here for me to understand the issues. I'll paste a few of the \"Hardware Error\" reports here for review:These two occurred on the same day, within a minute of each other, around the time of the latest event. I wouldn't be surprised if one of these is the root cause:Problem signatureProblem Event Name:    LiveKernelEventCode:    117Parameter 1:    ffffda828f655010Parameter 2:    fffff80480c74858Parameter 3:    0Parameter 4:    17b8OS version:    10_0_18363Service Pack:    0_0Product:    256_1OS Version:    10.0.18363.2.0.0.256.48Locale ID:    1033Problem signatureProblem Event Name:    LiveKernelEventCode:    1a8Parameter 1:    1Parameter 2:    0Parameter 3:    0Parameter 4:    0OS version:    10_0_18363Service Pack:    0_0Product:    256_1OS Version:    10.0.18363.2.0.0.256.48Locale ID:    1033Unfortunately, the reliability monitor doesn't give any other supporting information - restricting the reports to their most basic form. For each event, I am simply told \"A problem with your hardware caused Windows to stop working correctly,\" and given the diagnostic readout.","Hi SupaShad, * Explorer \/ Windows OS: Have you also tried to run DISM scan+restore, Automated repair, full check disk?* Software: Since the issue has started, have you tried doing a clean uninstall of the video drivers?From Reliabiity Monitor > it will show the Reliability details per days at the bottom of the Window. From here you will have an option \"View technical details\" > this is especially helpful for Warnings and Errors.The challenge in this issue is we need to spend some time to further isolate the root cause of the issue. Are there any obvious patterns that triggers the black screen? Does it occur in safe mode or with other services disabled (clean boot)?Other than that our next option would be to do a repair install of Windows 10 with an inplace upgrade, which is to basically repairing the installation of Windows 10 OS without losing anything other than the installed Windows Updates:https:\/\/www.tenforums.com\/tutorials\/16397-repai... Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Richard,DISM Scan\/Restore won't function because there is no corruption - I hadn't run it because it's not indicated here. However, I did just attempt it in the spirit of \"trying everything\" and was told as much:\"Deployment Image Servicing and Management toolVersion: 10.0.18362.1Image Version: 10.0.18363.535No component store corruption detected.The operation completed successfully.\"On the software side, yes I have recently uninstalled and reinstalled my drivers. I fairly well dislike nVidia's garbage packaging system for their drivers (which are generally excellent.) Every now and then I will uninstall them and do a fresh install to make sure no vestiges of nVidia's \"Experience\" nonsense (as well as several other unnecessary drivers) hang around.Aye, those reports are from the technical details of the error - and as ambiguous as they've always been, unfortunately. They don't get more helpful than that raw text.I initially thought the issue was predicated by some YouTube video initialization hook failing. I don't think that's the case anymore, as this last event occurred on a raw desktop with no running video or anything else.I will say that it is sometimes preceded by a brief freeze - which I suspect is related to Windows improperly handling the onboard Bluetooth. I suspect that the odd crash this causes (which may be one of the two reports I had pasted previously) may somehow force a state change on the display. But I can't derive how; outside Windows panicking when the kernel goes unresponsive for the five or so seconds the intermittent freezes take. Although it's not what I am here for (originally) I'll take the time to describe this issue in case it serves to be useful in diagnosing (and if you happen to know how to fix it, I'm all ears):Windows will occasionally freeze on me. A full stop, lack of all input, that halts my activity for approximately 5-10 seconds (including Bluetooth signals.) I have no indicators as to why it might happen, or when another will occur. There is no pattern to it. Uniquely, it freezes my computer in its current state, meaning that if I were typing - for instance - and happened to be pressing \"space\" when it freezes, it'll resume having placed about a billion spaces in whatever text box I was typing in (or whatever other character.) Stopping it from spamming the character is a simple matter of pressing the key once. No activity is present on the computer while it's frozen, audio output stops, etc. It's like an extended stutter. This issue does not always lead to the black screen I've mentioned here - but I suspect it has triggered it before - since the black screen issue occasionally follows immediately afterward. Under normal circumstances, the freeze lasts for the specified range of time and then operations on the computer resume without issue.There are rare occasions when it appears to cause the black screen issue, but I don't think it's related specifically to the actual freeze. Instead, I think it may be related to how Windows recovers from the freeze. When it does happen, it happens like so:1.) Computer freezes (screen still displays as normal, just frozen.)2.) Computer unfreezes, a second or so later the screen flickers briefly, before cutting out to a black screen (again, though, I'm still able to see and access programs and the start menu while using ALT+TAB or when I put the focus on the start menu via the Windows key.) Under normal conditions, the computer would freeze and resume without issue. The flickering that occurs seems to suggest to me that some process is failing and re-initializing the drivers improperly or something. I was really hoping to avoid another reinstall or repair, as I've had to go through several now with these awful Windows updates - so I'm storing your link for a last resort. I would probably avoid just repairing, as my ancient tech brain abhors repairs. To me it always seems like \"repairing\" Windows causes more issues than just reinstalling the damn thing - and getting Windows 10 to function, despite itself, has been a chore.","Hello SupaShaD, I'm another independent advisor and wanted to check if there was a section with \"Extra information about the problem\" from the events you have captured from Reliability Monitor? If there is extra information about the problem, please post them.If the extra information contains references to nvlddmkm.sys under bucket ID, you might be experiencing a hardware issue with your NVIDIA GPU. To co-relate, try checking Event Logs - SYSTEM for similar entries. If so, I would like to ask if you will be able to remove the NVIDIA GPU from your machine as part of a test. I checked your motherboard specifications and CPU, you should be able to directly connect your monitor to your onboard display.","Hello SupaShaD, I'm another independent advisor and wanted to check if there was a section with \"Extra information about the problem\" from the events you have captured from Reliability Monitor? If there is extra information about the problem, please post them.If the extra information contains references to nvlddmkm.sys under bucket ID, you might be experiencing a hardware issue with your NVIDIA GPU. To co-relate, try checking Event Logs - SYSTEM for similar entries. If so, I would like to ask if you will be able to remove the NVIDIA GPU from your machine as part of a test. I checked your motherboard specifications and CPU, you should be able to directly connect your monitor to your onboard display.Comnuts,I posted the details included in the extra information in my original post. That's all extra information presented (which means, for these failures, Windows was not providing a bucket ID.)Since the date of my last post, I've experienced numerous additional freezes, but no additional entries to the reliability monitor indicating a failure, which says to me that my original suspicion was incorrect and something else is causing the issue.  In regards to the black screen effect, I couldn't say as I haven't experienced another - although those are fairly sporadic (but chronically occurring) by nature to begin with.I'll update as soon as I experience another and can check the reliability monitor logs to see if it corresponds with a failure.","The following report correlates with a black screen event that occurred today (03JAN2020 at 1439):DescriptionA problem with your hardware caused Windows to stop working correctly.Problem signatureProblem Event Name:    LiveKernelEventCode:    117Parameter 1:    ffffda828b295460Parameter 2:    fffff80480c74858Parameter 3:    0Parameter 4:    1988OS version:    10_0_18363Service Pack:    0_0Product:    256_1OS Version:    10.0.18363.2.0.0.256.48Locale ID:    1033That is the extent of the provided information.","Another report corresponding to another black screen event which just occurred (06JAN2020 at 1342):DescriptionA problem with your hardware caused Windows to stop working correctly.Problem signatureProblem Event Name:    LiveKernelEventCode:    117Parameter 1:    ffffda8294cce010Parameter 2:    fffff80480c74858Parameter 3:    0Parameter 4:    321cOS version:    10_0_18363Service Pack:    0_0Product:    256_1OS Version:    10.0.18363.2.0.0.256.48Locale ID:    1033"]},{"symptom":"Windows 10 login screen        Whenever I start my computer, I get this strange image.If I go on to where I would type my password, all it shows is a black screen. Any fixes? Please let me know.","solutions":["Hi Start your PC, just as Windows attempts to load (spinning dots), press and hold Power Button for 5 - 10 seconds to perform a Hard Shut DownDo this twice On the third start Windows will boot into the Recovery Environment and from there you can access System Repair, Safe Mode, Command Prompt . . . etc.Please try each option one at a time, then see of Windows will boot . . . Go to Troubleshoot - Advanced Option - Startup Repair See if Windows startup can repair itself Go to Troubleshoot - Advanced Option - System Restore Check to see if you have a restore point you can go back to If you do not have a Restore Point, go to Troubleshoot - Advanced Option - Startup Settings and click RestartUpon restart, press 4 to enter Safe Mode Once in Safe Mode, backup your data if you do not already have a backup Open Device Manager and check to make sure all your Drivers are up to date Reboot to see if Windows will start Normally If the above fails, go to Troubleshoot - Advanced Options - Reset this PC Choose to keep your files and apps, just your files or to keep nothing Then start the Reset"]},{"symptom":"CREATE Button missing?        I'm trying to edit a video already uploaded to YT. But my Windows 10 photo ap does not have a CREATE Button...Any help is surely appreciated and take it slow...I'm old! LOL ","solutions":["Hi natesmawmaw I'll try to help you out on this one. So you want to edit a video that is already on youtube ? As far as I know, you can't edit videos directly from youtube. You need to have the original file, and then edit it with the desired software, then upload it again on Youtube.Let me know if I can further help out. Regards","Hey natesmawmaw! Are you still seeing this issue? It would be helpful to know your app version number, found in Photos under ... > Settings, towards the bottom of the page. Thanks!"]},{"symptom":"Photos can't add video files        Photos is unable to add video files. It says \"these files have properties that can't be read, so we couldn't add them\". But just two days earlier \"Photos\" had no problem with adding them, trimming, splitting and editing in any other way. It is an issue that was reported here by other users BUT I'am reporting it AGAIN, because neither repairing nor resetting the app did not work. Powershell uninstall\/reinstall also did nothing. In its current state Photos app is useless. Are you able to provide working fix or should I abandon hope and look for a proper video editing software?","solutions":["Hi, le_vinsky My name is Aracely, I am an Independent Advisor. I would love to help you today. Follow these steps to repair the Store and your Applications, copy and paste these commands into Powershell.First enter Administrator Mode by clicking the mouse on the right side on Powershell.1) Set-ExecutionPolicy without restrictions 2) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$ ($ _. InstallLocation) \\ AppXManifest.xml\"}Then restart the computer Check this link: https:\/\/support.microsoft.com\/en-us\/help\/402749...Let me know if the information has been helpful in solving your problem.","Thank you for the instructions. They did not help.First of all I could not execute first command. \"Without restrictions\" is not a valid parameter - it resulted in an error. \"Unrestricted\" seems to be correct parameter.Second command also produced several screens of errors:Add-AppxPackage : Cannot find path 'C:\\WINDOWS\\system32\\$ ($ _. InstallLocation) \\ AppXManifest.xml' because it does not exist.At line:1 char:38+ ...  | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$ ($ _ ...+                 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~    + CategoryInfo          : ObjectNotFound: (C:\\WINDOWS\\syst...ppXManifest.xml:String) [Add-AppxPackage], ItemNotFou   ndException    + FullyQualifiedErrorId : PathNotFound,Microsoft.Windows.Appx.PackageManager.Commands.AddAppxPackageCommandI ran troubleshooter, just to be safe. It didn't help, as expected.So the Photos app still doesn't work.","I recommend you repair Windows completely, before you should make a copy of your files.https:\/\/answers.microsoft.com\/en-us\/windows\/for...","Are you serious?Why do you think my Windows is so messed up that it needs a \"repair\"?Did you read it in the error message?As I wrote earlier - photos worked fine just two days earlier. Are you telling me that Windows can become broken without any reason? I did not do anything that could cause severe changes to the OS - no huge updates, no app installs. I just tried to finish the project I was working on a couple of days ago - and I no longer could because Photos was unable to add video files to the project.I am worried that that this \"repair\" suggestion is a convenient way to avoid digging deeper into the problem and looking for a better solution than a complete Windows reinstall.","Check again the steps I had sent to repair Photos, it may be that some command was not well written, you also have the reference link.","I copied and pasted commands you gave me. How was I supposed to not write them well?You gave me a wrong command in the first place - \"without restrictions\" had to be changed to \"unrestricted\". Then it worked. Second command you gave me produced an error I pasted in the message above. Maybe this second command you gave me is also wrong? Can you give me a proper command or explain to me why I get an error message when I copy, paste and attempt to execute it?","Check this link, the commands are explained in more detail https:\/\/www.intowindows.com\/how-to-reinstall-st...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Seriously? I'm on answers.microsoft.com website and I am redirected to some other site to fix problems with Microsoft's own app??? I don't want to explore possible solutions and try them out only to find out they don't work. I already tried a few. I don't have time for that. I came here to get competent advice and 100% working fix. Are you able to provide that or is Microsoft unable to fix their own software with a method more subtle than full system reinstall. Are we back in 90's again?If you want more info, logs or whatever you need to give me more specific, error-free and working instructions I will do my best to provide that.","Photos is unable to add video files. It says \"these files have properties that can't be read, so we couldn't add them\". But just two days earlier \"Photos\" had no problem with adding them, trimming, splitting and editing in any other way. It is an issue that was reported here by other users BUT I'am reporting it AGAIN, because neither repairing nor resetting the app did not work. Powershell uninstall\/reinstall also did nothing. In its current state Photos app is useless. Are you able to provide working fix or should I abandon hope and look for a proper video editing software? I'm not sure if you got this resolved but here's what I did when encountering an issue.I right clicked the .mp4 file I wanted and used \"open with\" and selected \"Photos\".It opened fine and I went from there.","Thank you for your suggestion.The issue was resolved by doing... NOTHING.Instead of following **** suggestions like \"repair\/reinstall windows\" I abandoned what I was doing. And I tried it again about two weeks ago and guess what. It worked. I dunno why but no \"repair\" was necessary. It fixed itself. If the issue comes back I'll sure try to do what you suggest:)"]},{"symptom":"Deleting files        I would like to know how to change me delet settings from perment to my recycle ben","solutions":["I would like to know how to change me delet settings from perment to my recycle benDo NOT reply to that SCAMMER claiming to be from Microsoft Support.@@@@@@@@@@@@@@@@@@@@@@@@@@@@Right click on the Recycle Bin icon on the Desktop > select Properties > uncheck remove files immediately when deleted there.Cheers."]},{"symptom":"Windows 10 very brief audio stutter\/buzzing\/glitching everywhere        Hello,First, have my specs: Asus X550LN, Nvidia 840M 2GB, Intel i7 4500U, 8GB RAM, Windows 10 64bit (upgraded from Windows 8.1 64 bit).So I've upgraded to Windows 10 relatively easily and without any serious issues besides the odd bug here and there.By far the most annoying and the biggest one I have found is the weird audio buzzing or glitching, whatever you want to call it. It appears in any audio source, whether that's in Chrome on YouTube\/Soundcloud, in Edge, via local audio\/video files in Groove Music, MusicBee, VLC, the native Win 10 movie player, and even in games. I did not have this issue in Windows 8.1.To describe it in short: It appears at random, though fairly often. Sometimes every 10 seconds, sometimes every 30 - 60 seconds. It is a very short, micro stutter-like glitch in audio. Imagine the moment before a BSOD where audio buzzes and glitches out, but for a split second. I think video stutters as well while the audio does, which is most noticeable in games. (Though I may just be thinking that because I expect the video to stutter since the audio stutters as well. But I am fairly certain video does too).The problem persists whether I use my laptop's speakers, headphones, or external speakers.I tried many things, so I would appreciate it if you don't tell me to do those same ones again:I uninstalled and re-installed the latest Nvidia drivers, the latest Intel drivers, the latest Realtek audio drivers. Clean installed all of them by uninstalling specific devices from Device Manager and either installing the latest ones from the manufacturer's website or letting Windows download the best ones it sees fit. None of that worked. Troubleshooting in Windows did nothing either. Increasing and decreasing the default format in the playback device's properties did nothing. I disabled all background programs (all IM's, OneDrive, Antivirus etc) that I could to see if they are maybe the problem, nope.I do not see an option to share my dxdiag and msconfig info here, but if someone would want it I can provide it asap.I think this is simply an issue with Windows 10 which will need to be resolved via patch from Microsoft. It is very annoying and I sincerely hope a fix will be out very soon.But either way if anyone knows of a temporary fix or some other things I should do, please do let me know, I would appreciate it greatly!Thank you and kind regards.","solutions":["Hi Ivan,Thank you for posting your query on Microsoft Community.I would like to inform you that as Windows 10 is latest Operating System and it would be needing latest device drivers to work correctly, as the Driver Updates are not available on the manufacturer website I suggest you to install drivers in compatibility mode and check if it helps.Install the Driver in Compatibility mode:Older drivers can be installed in compatibility mode in Windows 10. I suggest you to download theLatest Drivers from Manufacturer website and install the in compatibility mode.Right click on the setup file of the driver and select Properties.Select Compatibility Tab.Place a check mark next to Run this program in Compatibility Mode and select the operating system accordingly from the drop down list.Let the driver to install and then check the functionality. I suggest you to refer to the article “Fix Sound Problems” and check if it helps.http:\/\/windows.microsoft.com\/en-us\/windows-10\/fix-sound-problems#v1h=tab01 Hope these information helps, please get back to us for future support, we’ll be glad to assist you further.Thank you.","Thank you for your response Prabhavathi Patil,Sadly, and as expected, none of those solutions have helped. I have even tried using Windows' default audio drivers by rolling back from the Realtek ones. The problem is still there nonetheless. I will try booting in safe mode and a doing a clean boot and see if the problem persists, if none of that will work maybe I will do a refresh\/clean install of Windows 10. And if not that, I will roll back to 8.1. ","I have since my last post tried literally everything besides opening up the laptop and checking for hardware faults which I doubt is the case because when I was on 8.1 everything was perfect.I have even refreshed Windows 10, so basically a clean install. The crackling and glitching is still there even after a completely fresh install.I can bet that it is Realtek or Microsoft's fault, because any non-audio related actions work *perfectly* fine. But anything with sound glitches.Please, Microsoft and Realtek, fix this.","I have a Toshiba Satellite L675 with Realtek and have the same issue.  I have gone through the same driver install\/reinstall sequences to no avail.  I have searched and found that this problem has been reported in numerous venues with the same useless advice given.  The problem is obviously with Windows\/Realtek and a solution would be greatly appreciated.","I have had the same audio and video issues.  Using compatibility mode I was able to make Real Times (RealPlayer) work for downloads for one instance, but the next time I logged on, it was back to the same audio and video clipping issue.  I have done numerous installs etc. Possibly also related to this is Photos not playing some of my videos, which work OK in other apps, apart from the clipping issue.Is the Settings non operational problem in any way related?","I am having the same issue, but for me when I unhook the hdmi cable that runs to one of my monitors it goes away.  I though it was that cable and have since tried 2 others with the same results.  All of my drivers are up to date and I have done a clean install on a new ssd to try and fix the issue.  Nothing has helped and I don't know what to do. Have tried everything to troubleshoot and even had the help of the Microsoft tech support. Any help will be appreciated because I am out of ideas.","Unhooking your hdmi cable would toggle digital audio \/ video out.  I have only analog, 15 pin video and mini jack audio, which make no difference.  I have used the Realtek Advanced speaker properties test, which resulted in the audio clipping (buzz) issue being heard regardless of which setting was selected.  It appears that some data threshold is being exceeded, the buzz and video stall happens, and the event clears, either automatically or by manual intervention.  Microsoft could check the Windows 10 coding for such events.I checked the Realtek website, which referred me on to Toshiba, but as yet no further available driver updates? ","Looks like this problem has been resolved.  Sound and video appear OK.  Have tested several apps, all now working as expected.  Cannot see as yet what has been done to fix this.","Tested apps again today and clipping problem has returned.  So why no problem yesterday?","It's very random and weird, it can seem like it stops sometimes but then appears again. I don't know if I mentioned this but the issue goes away for me after I disable Wireless and Ethernet network adapters in Device Manager (Ethernet is Realtek, Wireless is Qualcomm). Since I am a web developer and sys admin that is kind of useless because I listen to music while I do work.Asus couldn't help, Realtek isn't replying, Microsoft's tech support chat did nothing that I did not try 20 times over. This is just silly, and I have to say I am disappointed in Asus. Most people with this issue are reporting to have Asus laptops, and while I understand that Windows 10 was just released, it was in preview for a VERY long time and new drivers could have at least been worked on during that time.Either way, I am replacing this laptop with a custom built one from PC Specialist (because of other reasons, performance and gaming related), and I thankfully I already found a buyer who wants my current laptop. I made him aware of the issue and he is fine with it but hopes Asus\/MS\/Realtek\/whoever else fix the issue soon. And I do too.I hope everyone who has this issue finds a fix soon enough, I have OCD and I know how stressful such seemingly trivial problems can be."]},{"symptom":"Gaming makes my mouse stutter, causes lag and beeping sounds are coming out of my speakers (*FIXED* check last reply)        Hello, I recently bought a new PC and while playing some games I keep getting this weird beeping sound followed by my mouse stuttering\/lagging and being unresponsive which makes it basically impossible to enjoy gaming.Heres an example video of another person having a similar problem: https:\/\/v.redd.it\/74vlt0t1d0o31.The only difference to my problem though is, that I get a random amount of beeping starting at one in a random interval.I've already tried to switch to another mouse but the issue prevails. I tested different USB drives already and it didn't help aswell as updating everything I could find in the device manager.My specs:Operating System: Windows 10 Home 64-bit (10.0, Build 18362) (18362.19h1_release.190318-1202)Language: English (Regional Setting: English)System Manufacturer: HPSystem Model: OMEN by HP Obelisk Desktop 875-1xxxBIOS: F.11 (type: UEFI)Processor: Intel(R) Core(TM) i7-9700F CPU @ 3.00GHz (8 CPUs), ~3.0GHzMemory: 16384MB RAMAvailable OS Memory: 16258MB RAMPage File: 8185MB used, 11016MB availableWindows Dir: C:\\WINDOWSDirectX Version: DirectX 12DX Setup Parameters: Not foundUser DPI Setting: 96 DPI (100 percent)System DPI Setting: 96 DPI (100 percent)DWM DPI Scaling: DisabledMiracast: Available, with HDCPMicrosoft Graphics Hybrid: Not SupportedDirectX Database Version: UnknownDxDiag Version: 10.00.18362.0329 64bit UnicodeIf there is any other question please let me know and thanks in advance.","solutions":["Hi Meph1sto I am Vijay, an Independent Advisor. I am here to work with you on this problem. 1. Take actions related to Display Driver as the first level of troubleshooting Windows Key+X > Click Device Manager > Expand Display Adapter > Right click on entry below >A. Rollback the Driver Click Properties > Go to Driver tab > If there is rollback option, click it B. Update driver from manufacturer's website Go to the website of the driver's manufacturer or computer's manufacturer > See if some driver is released for your model and OS > If yes, download that > In previous option, click Uninstall > Install the downloaded driver > Restart your computerYou will need to restart your computer after the above steps. 2. Also check out https:\/\/support.xbox.com\/en-US\/games\/troublesho...https:\/\/support.xbox.com\/en-US\/games\/troublesho...https:\/\/support.microsoft.com\/en-us\/help\/815069...Do let me know if you require any further help on this. Will be glad to help you.","Hey, I just tested the rollback of my display driver but the issue wasn't solved. After that I tried the clean startup which also didn't help. I just remembered that while stresstesting there weren't any issues even at maximum cpu and gpu usage. I also tried everything else from the links you've provided. I'm pretty clueless right now on what to do","I am not getting your model number properly as forum software has replaced last few digits with xxxx - System Model: OMEN by HP Obelisk Desktop 875-1xxxOn HP site, for Desktop 875-1000 (I presume 1xxx = 1000), it is showing driver for NVIDIA GeForce Driver for VR (Windows 10 v1903).What is your graphics driver? Windows Key+r > Type msinfo32.exe and Enter > Post that part where model is written as a picture so that I can get complete model number.","Oh I'm sorry, for some reason the x's are there by default. The correct system model should be: OMEN by HP 875-1004ngand also: https:\/\/gyazo.com\/6410629fefc40b00fc879478fc353e92 I don't know if thats what you're looking for. Also I forgot to mention the GPU in case theres any relevancy: NVIDIA GeForce RTX 2070 8gb vram","Okay I've done some testing. It seems like the beeping+lagging only happens when I use the right mousebutton. As mentioned before I also tried to use the brand new mouse that came with my desktop and the beeping kept happening.I hope these informations are useful for you","Let's stake mouse related actions. Looks like you have already taken some of them.A. Try a different USB port B. In case of wireless mouse, pair it again with the computer C. In case of wireless mouse, check if batteries are not weak. 1. Take actions related to mouse (Check after each step A, B and C) Windows Key+X (Or right click on Start) > Click Device Manager > View (on top bar) > Show hidden devices > Expand Mice and Other Pointing Devices > Right click on the mouse listed there >A. Roll back - Click Properties > Roll Back - Under Drive tab, if Rollback Driver is enabled click it > RebootB. Uninstall - Uninstall > Reboot and the driver will be automatically installed C. Update - Update Driver > Click Update Driver Software > Click Browse my computer for driver software > Click Let my pick from a list of device drivers on my computer > Choose the driver > Click Next to update > RebootIf this does not work, select Search automatically for the updated driver in place of Browse my computer for driver software > Reboot2. Windows Key+x > Device Manager > Expand Universal Serial Bus controllers Right click on on an entry>Uninstall - Do it for all other entries Restart your computer and let the drivers be installed 3. Try running SFC \/ DISM and check after this https:\/\/answers.microsoft.com\/thread\/bc609315-d...Source - https:\/\/support.microsoft.com\/en-us\/help\/17417\/...","2. Windows Key+x > Device Manager > Expand Universal Serial Bus controllersRight click on on an entry>Uninstall - Do it for all other entriesRestart your computer and let the drivers be installedI did this and now my keyboard and mouse dont function anymore. I restarted multiple times and I cannot do anything nowLights on my mouse turn on but its still not working*after 30 mins of constant restarts I decided to do a cold boot and now my mouse and kb work again*ps. that scared the living **** out of me because I didn't know what to do if that failedpss. I already tried everything from step 1, well.. step 2 went kinda wrong and step 3 also didn't help either so I'm out of actions again.","Okay, it seems like I fixed the problem by killing the \"OMEN Command Center\" process whose correct name I cannot remember.. it's funny when HP themselves and their \"performance enhancing\" freeware causes all the problems... Anyways thanks for helping me","Okay, it seems like I fixed the problem by killing the \"OMEN Command Center\" process whose correct name I cannot remember.. it's funny when HP themselves and their \"performance enhancing\" freeware causes all the problems... Anyways thanks for helping me U R MY HERO!!!!!!!I searched whole internet but you actually saved me.Thanks a lot","No problem"]},{"symptom":"Changing sound\/music volume when creating videos        Hello,I need to know how to adjust the volume of the background music when I have videos playing within the project.For example the first slide might have louder music than the second slide etc.Is there a way to do this?Thanks!","solutions":["I should state that for example the first slide is a 'title slide' that is static with the volume at a higher level compared to the second slide where a video is playing therefore I would need the background music to reduce significantly whilst this slide is showing.Hope that's clear?","Hi Simon, I hope this guide help you, this article has a detailed guide how you can adjust volumes per apps including system sounds.Follow this link: https:\/\/winaero.com\/blog\/adjust-app-sound-indiv...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Many thanks - I will try it out now and provide feedback.Cheers,Simon","Hi Simon, Will wait for your feedback. Cheers! Have a good day!","Simon, I would recommend using the Custom Audio feature to accomplish this--you can add multiple audio files and set a volume level differently for each. Hope this helps! "]},{"symptom":"video editor adding background music        I've added a selected background music choice. However when I play the video (time lapse composed of 800 photos, it skips (has short sections of no sound) many times in the 3 minute duration. How do I make it play continuously?  Also it ends about a second or so too soon. How do I stretch it to play to the very end? Thank you. ","solutions":["Hey Mike! Sometimes the playback may lag when previewing the video--sounds like it's a big one :) If you export the video, hopefully that should correct the glitches when playing back real time, as the file is baked out into the exported version.As for the music ending too early, I'd suggest tweaking the timings of a few of your photos. Adding 1-2 seconds in length usually does it for me! A sneaky way to do this could be to add a black Title card to the end of the project, if you don't want to adjust any of the timings within the video itself."]},{"symptom":"AppData\\local\\temp\\tbff ,what is tbff file in this        at the time of installing the software, its shows the error message \"AppData\\local\\temp\\tbff.xpi\" could not be opened and also gives the message that \"could not communicate to the network server, error 3.\" 404 not foundplz help","solutions":["at the time of installing the software, its shows the error message \"AppData\\local\\temp\\tbff.xpi\" could not be opened and also gives the message that \"could not communicate to the network server, error 3.\" 404 not foundplz helpWe don't know what software you are trying to install."]}]}