{"windows":[{"symptom":"activation        I recently upgraded my pc involving a new motherboard,ram,cpu and graphics card. I carried over my hard drive got up and running and now windows wont activate with my new pc. I have signed into my Microsoft account with windows connected to it with no luck. I ran the activation trouble shooter with no luck even after clicking that o had a recent hardware change selecting the correct pc from the list I get a generic error of windows was unable to activate at this moment visit the microsoft store ect ect. if anyone can figure out why it's not activating I'd appreciate it! ","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,First, you'd need to identify if the product key for the windows 10 computer is either a retail or an OEM key.Normally OEM keys are solely embedded to one motherboard as they do not have transfer rights for other hardware, unlike retail keys which has transfer rights.For free upgrade licenses, the condition for these are relevant to an OEM key as the license is then considered a digital license once you upgraded free to windows 10.Under this link are reference to activation after hardware change https:\/\/support.microsoft.com\/en-ph\/help\/20530\/...For your windows 10 license, I'd recommend running the activation troubleshooter. Go to Settings>Update and security>Activation and run the troubleshooter. and select I recently changed hardware on this device.If the troubleshooter hasn't helped, you would have to call Microsoft during support hours to get more help.https:\/\/support.microsoft.com\/en-in\/help\/405170...Let me know how it goes. :)"]},{"symptom":"I tried to delete the schtext64.dll in windows explorer.        So I followed the advise of Pedro_2020 an Independent Advisor. He advise to type \"Regsvr32\/u\/s C:\\Path to file\\file.dll\"Then I type in my pc \"Regsvr32\/u\/s C:\\schtext64.dll\"The response I got . . . The module \"C:\\schtext64.dll\" failed to load. Make sure the binary is stored at the specified path or debug it to check for problems with the binary or dependent .DLL files. The specified module could not be found.Please advise how can I proceed to sort this out.Regards","solutions":["See your other post on the same subject."]},{"symptom":"windows sometimes loads very very slow sometimes works.        soo long story short. i  been having problems with my pc. i would record game plays then pc would freeze. hard reset try it again and it would freeze. then sometimes it would work fine no problems. now it would freeze after inputting my password to windows. it would load a few things then nothing. it takes such a long time to load anything. i would hard reset each time till it starts right. today it loaded slow then about 30 seconds then all a sudden all the apps started to load quickly. i have already updated bios and reinstalled windows with all drivers up to date, swapped around ram. i learned about event viewer and i have a lot of these errors in the wmi section.there are sooo many of these in a row and others are after a few that says informationSpecs: amd threadripper x1900asus x399-ecosair 32gb 16gb x2 sticks each 8 total 16, x4 sticks each stick 4gb total 16gbevga aio cpu coolerevga 1300w psupowercolor vega 64 red devilthis one is from something called application popup and there is a lotThe description for Event ID 56 from source Application Popup cannot be found. Either the component that raises this event is not installed on your local computer or the installation is corrupted. You can install or repair the component on the local computer.If the event originated on another computer, the display information had to be saved with the event.The following information was included with the event: ACPI15The message resource is present but the message was not found in the message tablethese are from wmiId = {00000000-0000-0000-0000-000000000000}; ClientMachine = DESKTOP-0NMH3PT; User = DESKTOP-0NMH3PT\\fpres; ClientProcessId = 984; Component = Unknown; Operation = Start IWbemServices::ExecQuery - ROOT\\CIMV2 : SELECT * FROM Win32_PnPEntity Where DeviceID='PCI\\\\VEN_144D&DEV_A808&SUBSYS_A801144D&REV_00\\\\4&39E0D1A1&0&0009'; ResultCode = 0x80041032; PossibleCause = UnknownId = {00000000-0000-0000-0000-000000000000}; ClientMachine = DESKTOP-0NMH3PT; User = NT AUTHORITY\\SYSTEM; ClientProcessId = 5680; Component = Unknown; Operation = Start IWbemServices::ExecQuery - root\\wmi : select * from WDMClassesOfDriver where ClassName = \"ProcessorThrottleStateEvent\"; ResultCode = 0x80041032; PossibleCause = UnknownId = {00000000-0000-0000-0000-000000000000}; ClientMachine = DESKTOP-0NMH3PT; User = NT AUTHORITY\\SYSTEM; ClientProcessId = 5680; Component = Unknown; Operation = Start IWbemServices::ExecQuery - root\\wmi : select * from WDMClassesOfDriver where ClassName = \"__namespace\"; ResultCode = 0x80041032; PossibleCause = UnknownId = {00000000-0000-0000-0000-000000000000}; ClientMachine = DESKTOP-0NMH3PT; User = NT AUTHORITY\\SYSTEM; ClientProcessId = 4132; Component = Unknown; Operation = Start IWbemServices::ExecQuery - ROOT\\CIMV2 : SELECT * FROM Win32_BaseBoard; ResultCode = 0x80041032; PossibleCause = UnknownId = {00000000-0000-0000-0000-000000000000}; ClientMachine = DESKTOP-0NMH3PT; User = DESKTOP-0NMH3PT\\fpres; ClientProcessId = 984; Component = Unknown; Operation = Start IWbemServices::ExecQuery - ROOT\\CIMV2 : SELECT * FROM Win32_PnPEntity Where DeviceID='PCI\\\\VEN_144D&DEV_A808&SUBSYS_A801144D&REV_00\\\\4&19426908&0&000A'; ResultCode = 0x80041032; PossibleCause = Unknown","solutions":["Hi Francisco. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) Compare the install you did with this gold standard Clean Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... The reason I ask you to do this is because no one of millions who have followed the install in that link has ever come back to report problems that I have seen. It is also a great learning experience that will make you permanently the master of your PC because you will learn what works best and have applied it with your own hands. 2) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 3) Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Let's also check the hardware: Test the RAM overnight to stress it with the best bootable test memtest86, following this guide to test both sticks and slots:https:\/\/www.wikihow.com\/Test-PC-RAM-with-MemTest86Run Crucial System Scanner to check the RAM is properly spec'd and configured: https:\/\/www.crucial.com\/usa\/en\/systemscanner?cm...Test the hard drive or SSD with diagnostics: https:\/\/www.lifewire.com\/free-hard-drive-testin...https:\/\/mashtips.com\/ssd-health-test-and-perfor...HP and Dell have hardware diagnostics triggered by tapping the ESC or F12 keys respectively as you power on.Best is to use the HDD\/SSD manufacturer's own if there is one, otherwise use Seatools bootable long test:http:\/\/blog.nowherelan.com\/2013\/04\/04\/boot-seat... Follow this up with a full Disk Check from the Command Prompt in Repair Mode or from bootable media:https:\/\/www.groovypost.com\/howto\/check-hard-dri... if necessary from the Command Prompt at boot:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... Run a bootable Linux distro with hard drive unplugged to see if the problems remain, which will narrow the problem to the remaining hardware and remove Windows and the hard drive as the cause."]},{"symptom":"User System File automatically named by Microsoft Account Sync        I don't know how to explain this clearly...Whenever I perform a new Win 10 install, the computer automatically names my User Account folder as \"desig\" because of a freak typo once upon a time. See embedded screen snip:I assume this happens because of Microsoft account sync settings, but how can I fix this?","solutions":["Microsoft uses the first 5 letters of the Microsoft account email as the user name.  Mine is lacru.","Hi Ohne. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.That's likely due to an issue when the Windows installer cannot connect to your MS Account during install to port the account Display Name over, so it uses the first five of the email address. I tried to get this changed early on via MVP channels but was told it wasn't being changed. You can change the Account name on the sign-in screen here: https:\/\/www.windowscentral.com\/how-change-accou... but that does not change the name on the User Account folder - attempts in the past to change it could cause fatal errors at startup.However MVP Shawn Brink has come up with a safe method to change the Account folder name which I've tested and it works. If you can't live with the old name then here's the fix:https:\/\/www.tenforums.com\/tutorials\/89060-chang...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.______________________________________________ Note: Linked tutorial is from Shawn Brink who is a trusted Microsoft MVP."]},{"symptom":"Windows 10 does not enable Realtek RTL8188FTV Wireless LAN 802.11n USB 2.0 Network Adapter        Hi,I am using Windows 10 Home 1909 version. I purchased a Realtek RTL8188FTV USB 2.0 Wireless adapter. My PC recognized the adapter, but it keeps it disabled. I updated the driver to it's latest version of 2018, yet the issue persists.I have also disabled \"USB Selective suspended setting\" in Advanced Power Options. The WiFi button in the Network icon of the taskbar appears sometimes, but only for a second. I need help.Vishal","solutions":["Did you go into Device Management, Network and check the status of the adapter?","Hi Vishal. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything that works to fix Wifi so that at least something will work. Even if you've already tried a step please try or check it again in sequence. If you need any assistance I'll be standing by here to help:Update your network adapter drivers from the PC maker's Support Downloads web page using the full model number, HP Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.If you have the latest network driver then try on it's Driver tab also to Roll Back, or Uninstall and then restart PC to reinstall the driver. Try also all older drivers from Update Driver > Browse > Let Me Pick list working backwards.Go to Device Manager > Network Adapters, select Wifi adapter, then Power Management tab, clear the check box to \"Allow the computer to turn off the device to save energy.\" Then on the Advanced tab disable any energy-saving options.If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool explained here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them.If this was caused by Version update then you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool.For Wifi won't connect after Version 1903: https:\/\/windows101tricks.com\/fix-wifi-keeps-dis...https:\/\/www.techrepublic.com\/article\/wi-fi-and-...https:\/\/pureinfotech.com\/fix-wifi-problems-wind...Enable IPv6 in the network adapter settings: https:\/\/www.tenforums.com\/tutorials\/90033-enabl...Run the fixit from https:\/\/support.microsoft.com\/help\/929852 (Re-enable IPv6 on all nontunnel interfaces) and reboot.Right click the network icon in System Tray at bottom right end of task bar to Troubleshoot Problems.Try all of these steps: https:\/\/support.microsoft.com\/tr-tr\/help\/10741\/... https:\/\/www.kapilarya.com\/how-to-reset-network-...Go to Settings > Network & Internet > WIfi > Manage Known Networks, highlight and remove the network having problems, restart PC to see if it shows up again.Try plugging in by ethernet cable to the router to compare, then plug the ethernet cable into the modem (if separate) to see if this might be an issue with the router.Try powering off modem, router and PC and then restarting in that order with 1 minute in between each. You may need to reset your router or even optimize it following these steps:https:\/\/www.lifewire.com\/resetting-a-home-netwo...https:\/\/www.pcmag.com\/article\/258865\/how-to-set...Your router manual is always available from the manufacturer's website for your exact model.You also are entitled to Support from your internet provider to get online on all devices. This is always included in the monthly bill. If your router is less than a year old they will also Support getting it connected and optimized.Another option is you could replace the wireless adapter with an inexpensive USB nano adapter like this one:https:\/\/www.amazon.com\/OURLiNK-600Mbps-Wireless...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows forced to change default app save location, can't change back.        Hey,A little while ago when I tried to install Reach through the Microsoft play store it forced me to change my default saved location from my D: drive where all my other games (Sea of Thieves, Forza, ect.) are located to my S: drive, my windows drive only. I don't know why it forced me to do it for Reach when other games from the store were already saved on a different drive with space. I go to change it back and I just keep getting the same error, not matter what programs I close (I have no anti-virus installed besides windows defender and I closed EVERY app I could in task manager) with no luck changing it back. Now my S: drive, only a 128gb drive is constantly near full and since its the default save location it fills up every other day or two and I have to go and delete random files. The constant \"drive near full\" pop-ups are getting out of hand and I all I want to do is change the default app storage BACK to my D: drive where it was originally. I attached a screenshot of the error and the page. I try to switch it every single day I've logged on for about the past two weeks with the same message. Any help would be appreciatedThanks in advance!","solutions":["Hi DP. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.There are a lot of complaints about this, which I believe is because the other drive(s) are detected as slower. For example, moving apps off of an SSD to a hard drive will slow them considerably, whereas moving files has no speed loss.So a solution for now is to move your User folders off of C to make more space, using this method which works best:http:\/\/www.dummies.com\/computers\/operating-syst...Other strategies to make more space are here: https:\/\/www.pcworld.com\/article\/3040404\/windows...https:\/\/www.groovypost.com\/howto\/maximize-stora...If you want to express your opinion on this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems. If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"My laptop cant extend monitor        I'm using Lenovo legion y520, at first, when I plugged the monitor to  the laptop it works, but when I unplugged it and try to connect, my laptop won't detect the second monitor","solutions":["I'm using Lenovo legion y520, at first, when I plugged the monitor to  the laptop it works, but when I unplugged it and try to connect, my laptop won't detect the second monitorFirst, update your graphics drivers. If it still doesn't work,  this recognition failure error may be caused by the static electricity on the mainboard.You need to discharge the static electricity restored on the mainboard (I don't mean you need to touch mainboard)To do so, press the reset key on your laptop for 10s. (ThinkPad X1 Carbon is a hole under the base)Note: the machine should be shut down before operation.","If you disconnect the monitor there is no way the laptop can connect to it unless you have installed equipment to both the laptop and the monitor.","Hi vincenthartantoo and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.Please advise what brand and model is your external display, and the type of connection used to connect it to the laptop.Please also try the steps within this article when your external display is connected:https:\/\/support.microsoft.com\/help\/4340331"]},{"symptom":"Touchpad and touch screen not working        I had a temporary storage error, so I tried to fix it to free up some space. I went and booted into safe mod and was stuck because I had forgotten my microsoft password. I tried booting into safe mode with network, but I still could not connect to the internet. My only option was to reset my laptop. In the process of doing so, it completely removed all of the program and features that had originally came with my laptop. I tried to reinstall windows, but perhaps I installed the wrong one. Now both my touch screen and touchpad are not working. I’ve tried looking in device manager but both the “hid compliant touch screen” and “mice and other pointing devices” were missing. I also tried to update the BIOS. Are there any other options left?","solutions":["Hey dazaidc, Evan here, an Independent adviser I hope I can assist you. Looks like you just uninstalled the factory-loaded software. All you would need to do is grab your serial number (under the laptop) visit your computer manufacturer's website and then download the drivers for your touchscreen.What kind of laptop is it?","HP Pallivion x360","Perfect. Head to HPs website (drivers section). Then search for and find your specific model to locate your drivers","I can’t seem to find the driver","I will do my best to find it!","If you search via Google you can download the HP Support Assistant to your device. It should automatically detect your serial number and allow you to download the drivers.","I have HP Support Assistant on my device, but I’m not sure where to download the drivers","Hi Dazaidc, thanks for keeping in touch, my name is David, an independent advisor and I will continue to help you with your question.Please use the following links to download the corresponding drivers to the Touchpad and the Fingerprint Sensor for your HP Pallivion x360:https:\/\/ftp.hp.com\/pub\/softpaq\/sp96501-97000\/sp... for Windows 10 1903https:\/\/ftp.hp.com\/pub\/softpaq\/sp96501-97000\/sp... for Windows 10 1903If you have a different version of Windows 10, please go to https:\/\/support.hp.com\/us-en\/drivers\/selfservic... and download the driver you need depending on the version you are using.Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let me know if the information has been helpful or you still need more help."]},{"symptom":"Driver has some problems to install to HP Envy        when I try install file: sp98547.exe","solutions":["Hi Jari 1 What driver are you trying to install, is that a fingerprint scanner driver? 2 What is the exact Model No. of your HP system - that will be printed on a sticker on the bottom casing of your PC","1.) Yes, that is the \"fingerprint-sensor\" driver.2.) This is the S\/N and Product number according to HP support assistant:The bottom print is almost too small to read (maybe if with looking glass).Some spec for the windows:","Hi Jari Click your Start Button, type winver and hit Enter On the resulting dialog, what Version No.of Windows 10 are you running? Is that version 1909? If so, HP have not produced a Fingerprint Scanner driver for that version of Windows 10 yet, the driver on that support page fro your laptop is only approved for versions 1809 and 1903 of Windows 10, hopefully they will release an updated driver in the near future . . . https:\/\/support.hp.com\/ie-en\/drivers\/selfservic...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","according to the hp site , 1909 18363 does not supported . you need 1809 or 1903 to install the fingerprint device driverftp:\/\/ftp.hp.com\/pub\/softpaq\/sp98501-99000\/sp98547.html","This is exact version (and it didn't seem specify here whether HOME or PRO at the 1st line).Then as this is 1909 there seem no changes get it through without any warnings.That is probably then reason, but no solution.","Hi Jari HP are usually very prompt in coming out with new drivers for each version of Windows 10, give it a day or two and they will have released that driver fro version 1909, that is the only thing you can do, because they produce specific drivers for each version (which is a better service than most other manufacturers) . . .","It seems the HP site finally has the new driver (for windows 1909)...-- Jari","It seems that there is no more compatible finger print driver available at all..."]},{"symptom":"linking MOE to iphone        i have march of empires on my win 10 pc and want to add my game to my iphone 7 , the game downloads on my phone  but when i try to link my PC  game it asks for a code . when I go to my game on pc and hit connection and then link device I sign in to my microsoft account my game comes up it asks if i want to save this game ,next window says i have to sign out and back in again with same info , i'm confused , I can't move on from there and I am going away for a week and my laptop is being repaired and may not be back in time ","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as you want to connect March of Empire game on iPhone 7, which have on your Windows PC. As you are facing sink issues on PC, we would suggest you to uninstall the game and then reset the Microsoft Store cache: Press the Windows Logo Key + R to open theRun dialog box, type wsreset.exe, and then select OK.Restart the PC and sign in with the same Microsoft account which you used to install the game previously. Later install the game and sign in with the same Microsoft account. On iPhone 7 sign in to the game with the same email account. If you still have issues on iPhone 7, we would suggest you to post your query inGameloft Forum support. Regards, Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"Your phone app        How do you get it OFF computer?? I have followed every direction and it won't uninstall!  Since I tried to put it on here, nothing works!! I want it GONE! UNINSTALLED!! Why won't it uninstall???","solutions":["Hi Michelle. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See here to uninstall Your Phone app: https:\/\/www.windowscentral.com\/how-uninstall-yo...https:\/\/news.thewindowsclub.com\/uninstall-your-...There may be some unintended consequences when you uninstall any app without an Uninstall button in Apps & Features, so set a System Restore point first:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Michelle,Search for Windows PowerShell from the Start Menu, right-click Windows Powershell and select Run as Administrator.Type the command below to uninstall the Phone app and press Enter:Get-AppxPackage Microsoft.YourPhone -AllUsers | Remove-AppxPackageHope this works for your."]},{"symptom":"Can we download DirectX 11 or 12 as Offline?        We have a gaming computer at home that was purchased for children to play games on it. It's not connected to LAN or wireless network connection. Many of DVD games are showing an error to update DirectX to latest version but there is no internet connection to update. Please suggest me where i can download DirectX 11 or 12 as offline so i can copy to USB and install it manually.Thanks","solutions":[]},{"symptom":"Certain Programs Unable To Open, And No Disk Space        Was working on a friend's laptop. He has an HP Stream Laptop, 32 GB drive capacity. It's in really bad shape as a whole. No disk space available whatsoever, no where to get it, and no evidence of malware or apps taking up the space on his drive. Checked all the file locations that could be hiding malware, no luck. Checked the registry for PUPS, but nothing. Can't perform a clean re-installation of windows because there's no extra space. I'm lost on what to do? Should I tell him to just get a new, cheap laptop, or just try to get a decent SSD so I can restore some things and download something like CCleaner or Avast Cleanup? What do I do?","solutions":["Tell him to get a larger SSD of at least 120 GB or more.  Preferably more.  They are not that expensive any more.Do not add any 3rd party AV or cleanup programs.Windows Defender and Malwarebytes can do the job.","Hi jamayaarmstead, thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.HP Stream laptop with 32 GB hard drive is intended to be used with cloud storage (e.g. OneDrive). It would be sufficient if there isn't many photos, videos, or other files and apps. Therefore please move additional photos, videos or other files to a cloud storage or external storage. If that's not your friend's intended usage, it will be better to get a new storage device or even a new laptop.I would also recommend to free up disk space using Windows built-in tools. Please check these articles and sections:https:\/\/support.microsoft.com\/help\/12425\/ - \"Free up space with Disk Cleanup\"https:\/\/support.microsoft.com\/help\/4013876\/ - \"Free up space on your device\", steps 1 to 5.Please let me know if I can help you further!"]},{"symptom":"Cannot Maintain Audio Stream From Radio Stations        Just bought a new Dell Windows 10 desktop. I often open a browser tab for a radio station and select \"listen live\" to start audio streaming. If the streaming occurs in a new browser tab, the stream will stop every 10 minutes or so and then start up again. Even more annoying, if several other browser tabs with streaming are open, but not steaming, all the audio streams start playing simultaneously! I have to then shut down the unwanted streams. Interestingly, if the audio is streaming in the background, whatever window I'm working with when this happens also stops and indicates \"no internet.\" I have 100Mbs Fios so it's not a bandwidth issue and I do this all the time in the Windows 7 computer with no issue. Happens in both Edge and Chrome.  So it is a Windows 10 problem. This problem does NOT occur if the streaming occurs in a new window or in the same browser tab as the radio station website.  It ONLY happens if the audio player opens in a new browser tab.  Is there a buffering problem in Windows 10?  This behavior is very annoying.  How do I fix this?","solutions":["Hi pacal(2), My name is Riccardo and I'd be happy to assist. Since you did a lot of troubleshooting steps already; can you try the clean boot method outlined below and let me know if the problem persists..I am wondering if a service or something is using up your bandwidth.https:\/\/support.microsoft.com\/en-ca\/help\/929135...","Many thanks for your reply.  I will try the clean boot up tomorrow and let you know what happens.","No problem let me know","Thanks again for the very clear instructions.  Before I do this, could you please verify something?  When choosing the System Configuration option should I continue to have \"Normal startup\" checked as on?  There are two other options i.e. \"Diagnostic startup\" and also \"Selective startup.\"  Interestingly, there are only four apps enabled in Startup and two of them are audio related viz. \"Realtek HD Audio Manager\" and \"HD Audio Background Proc...\"  Will audio still function with these two processes disabled?  The other two enabled processes are Windows Security notification and CCleaner (an app I installed).Many thanks again.","Hi there, you want to do selective startup. And yes they should work as those are generally apps to enhance audio.","Hello again and thank you.  Followed your procedure for the clean boot.  It seemed like the problem disappeared as the audio stream disruption did not occur for an hour or so.  It had never gone that long without the problem occurring.  However, while still in clean boot mode (i.e. startup disabled, services disabled) when shutting down and booting up (not just restart), the problem happens again although it seems to take longer to occur.  I'm back in normal boot mode but will next experiment with various combinations of enable\/disable and restart\/shutdown as well as time.  Would much appreciate any suggestions you might have.  Many thanks for your help.","What is the make and model of your computer?","It's a new Dell desktop model XPS8930 running Windows 10 version 1909 and is up to date.  Thanks again.","That is a very good computer - check this out: https:\/\/www.dell.com\/support\/home\/th\/en\/thdhs1\/...There is an update to the BIOS this may help...you can also get the drivers direct from them...Hi there,! DISCLAIMER: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","That's an excellent suggestion.  My old Windows 7 computer (still running) was also a Dell desktop and I'd occasionally check the Dell website for driver updates.  I also had the Driver Booster app on the system which would alert when new drivers were available.  The XPS8930 has an app for checking for driver updates but I haven't used it yet as the computer is so new.  I did have Dell tech support look at this problem some weeks ago.  I recall they may have reinstalled the audio driver but I don't think they updated the BIOS.  Bottom line is they couldn't resolve the problem.  I will check out the BIOS update and maybe talk to Dell tech support about it too.Many thanks again for your responsiveness.  I'll let you know what happens.  This has become a bit of a personal challenge for me now."]},{"symptom":"How To Install Drivers for Blutooth for Windows 10 Home Edition        Hello, and HNY!I would greatly appreciate feedback on how to install the necessary drivers for Bluetooth capability on my computer.  It is a Hewlett Packard PC that has Windows 10 Home edition.  It's a fairly new computer, and I tried accessing Bluetooth on the device,, even troubleshooted the issue, and the feedback from the computer indicated that it does not (currently) have Bluetooth capability.Thanks, in advance, for your assistance.","solutions":["Hi Due,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.We can surely help for that. What is the complete model of the HP computer?Right click Start>Run.Type in msinfo32 and Press Enter.Take a screenshot of the Window and paste in the next reply. Open Disk Management by typing in diskmgmt.msc in Run Dialog box.Get a Screenshot and paste back in next reply:https:\/\/answers.microsoft.com\/en-us\/windows\/wik...","Have you gone to Device Manager, Bluetooth and checked if there?Have you checked with HP to see if your computer has Bluetooth.I have some Lenovo laptops that do not have Bluetooth hardware and I have to get USB dongles to be able to hook up to the Bluetooth."]},{"symptom":"The New Windows 11        Windows has had a lot of success in the past, and it's doubtful they want to lose a lot of customers. Talk about the new Windows 11 update is out there and it's doubtful that Microsoft would deny a this new update due to the fact that, if they were to, they would lose a lot of customers over time. Surprisingly, they have said that there won't ever be a \"Windows 11\" either, which goes to tell that we don't know how open Microsoft is to the possibility in the future.As said in the past by Steve Kleynhans, “Every three years or so Microsoft would sit down and create ‘the next great OS’.” Since Windows 10 was released July 29th of 2015, it would be expected that they come up with something new in the summer of 2018. But why haven't they? Instead they have come out with updates when the public may not be feeling the same about the  OS that has been out for so long. If you really think about it, there might be reason to believe that there may be another OS coming, emphasis on may, because it may or may not apply and we do not want to make assumptions.Briefly describing, Apple previously had a really hard time picking up when Steve Jobs was removed from his own business. They lost a lot of customers and Microsoft had their great chance to grow in popularity, and they did. However, this was quickly reversed when Mr. Jobs was rehired. He made a lot of changes that made many workers of the company very upset, but his gamble was a great play.He completely redesigned the company and hired people through very strict, necessary processes. After doing this Apple finally released it's next product and boomed with business. Microsoft even had a little bit of a hard time, since Apple, their great opponent in the market, had just stole a lot of their customers. Now, let's take a step back for a moment and look at how each company uses their own strategy to keep their money going. Not to point the obvious, but both companies use very different strategies, and have their own reason for success. Probably the only thing they have in common as far as market strategy goes is the fact that they both use broad differentiation, which is something just about every company uses.First let's take a look at Microsoft. Microsoft's primary strategy is market penetration. Market penetration is used by selling more products to customers to keep them coming. This is a powerful, and often effective, way to keep a business in the market. It's an intensive strategy that ensures Microsoft’s growth through aggressive sales and marketing.Apple has a very different primary strategy. They use product development to keep their products looking very desirable, attracting customers like miners to gold. Apple has done a very good job with this too. However, the way they do this has a very large fault. With every new iDevice that comes out, it carries the same OS as the last, with only minor updates with subtle differences in the themes. Now, they did great with their new iPhone X, but many customers said that they would actually prefer the iPhone 8 over the iPhone X. This hints that Apple might be losing their grip on the community.With this all being said, let's come back to our point and use the information to further agree that Windows will need a new update to keep in business. Seeing how Apple is losing their grip, Microsoft is definitely going to want to take advantage of that. They can use the opportunity to create something brand new that the community has yet to see and draw in a lot of customers from Apple. Now this would be very difficult to do before this next summer hits because that is a lot of work on the part of Microsoft employees to come up with a whole new design to sparkle at their customers. But is it?You see, Microsoft actually doesn't have to worry about that at all. They won't have to lift a finger in part of coming up with a new design because their customers want that new Windows 11 update so bad they have already made tons of these designs, and all Microsoft has to do is pick one that the community likes and get to work. With that being accounted for, Microsoft could definitely have a new update for 2019. And they would make make consumers very happy.","solutions":["There will be no Windows 11. With Windows 10, Windows became a service and instead of a new standalone version, Microsoft is pushing bi-annual feature updates for Windows 10 every 6 months. In future, feature updates will be remain and forever and maybe Windows 10 will be renamed to \"Windows\". https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/update\/waas-overviewCurrent latest Windows 10 version\/feature update is version 1809 (aka October 2018 Update). Next Windows 10 version coming in spring 2019 is 1903 (codenamed 19H1, official name hasn't been announced, likely will be April 2019 Update).Windows 10 version history: https:\/\/en.wikipedia.org\/wiki\/Windows_10_version_history","While I understand there may be no Windows 11, I also understand that Microsoft will have to go about doing the same thing that Apple has done with their products, as I had mentioned previously in the article. Given their other products lose sales, they would want to rely on bringing these new features to Windows 10. Now I do not say this as a certain statement, but out of my own views. Microsoft has done a great job bringing out plenty of products to the community, and undoubtedly better than almost any other company. However, the problem poses when people tire of Windows 10 and tire of receiving all of these new features. The new features would take much storage from a device with each that comes out, and eventually, assuming they continue to do this, they are going to come to a point when they will want a whole new Windows version because of the inability to find new features that aren't deemed, for lack of a better word, stupid by the community.If you take a look closer, Microsoft revolves around their Windows 10. That is what defines Microsoft as a company, is it's unique operating system that is unlike any other. Coming out with these new features is great while it lasts, but, like I said before, eventually that comes to a point of disability. So, looking at our options versus creating a Windows 11, probably the best alternative would be coming out with a product that replaces Windows 10. If they were to do this, then it would actually be fairly hard to sell this product to people below the higher end of middle class. Because of the research and development that would be needed, this item would be extremely expensive. Especially if it is going to satisfy customers for what they could no longer find in Windows 10.Keeping Windows 10 will also have the possibility of becoming very retro. When you continue to have one name brand with a few features coming out on a 2 year term per update, it starts to become as I had mention before. However, if you were to have, say the New Windows 11, customers could get excited over the possibility of a whole, brand new look on their software. With this, Microsoft could even begin to launch various series of updates, supporting different products. They could program unique software for multi-monitor systems that could be added on to their fancy new Windows OS. They could develop exotic hardware for the use on enhancing the user's use of the product they own. They could design multiple interfaces, so that each user has a choice on which feel they like best. If they were to do this, they could majorly increase in sales. If you have multiple lines of products, each of which with its own unique property designed for further aiding and\/or improving the way a product is used, then people are going to want to go and buy these new products. It sure seems a lot more profitable than coming out with bi-annual updates for a set program that will never recieve an update for its own self. Even if you could do this with what will be called \"Windows\" instead of \"Windows 10\", the ability to have a variety in your selection as to what you are going to use just beats that single style.As I first said, I understand that Microsoft has said there will be no Windows 11. But I do strive to make a difference in the community of technology by providing better alternatives out of my own opinion. Any and all statements are not intended to be shown as the opinion of everybody. They are simply my own thoughts and arguments.","While I understand there may be no Windows 11, I also understand that Microsoft will have to go about doing the same thing that Apple has done with their products, as I had mentioned previously in the article. Given their other products lose sales, they would want to rely on bringing these new features to Windows 10. Now I do not say this as a certain statement, but out of my own views. Microsoft has done a great job bringing out plenty of products to the community, and undoubtedly better than almost any other company. However, the problem poses when people tire of Windows 10 and tire of receiving all of these new features. The new features would take much storage from a device with each that comes out, and eventually, assuming they continue to do this, they are going to come to a point when they will want a whole new Windows version because of the inability to find new features that aren't deemed, for lack of a better word, stupid by the community.If you take a look closer, Microsoft revolves around their Windows 10. That is what defines Microsoft as a company, is it's unique operating system that is unlike any other. Coming out with these new features is great while it lasts, but, like I said before, eventually that comes to a point of disability. So, looking at our options versus creating a Windows 11, probably the best alternative would be coming out with a product that replaces Windows 10. If they were to do this, then it would actually be fairly hard to sell this product to people below the higher end of middle class. Because of the research and development that would be needed, this item would be extremely expensive. Especially if it is going to satisfy customers for what they could no longer find in Windows 10.Keeping Windows 10 will also have the possibility of becoming very retro. When you continue to have one name brand with a few features coming out on a 2 year term per update, it starts to become as I had mention before. However, if you were to have, say the New Windows 11, customers could get excited over the possibility of a whole, brand new look on their software. With this, Microsoft could even begin to launch various series of updates, supporting different products. They could program unique software for multi-monitor systems that could be added on to their fancy new Windows OS. They could develop exotic hardware for the use on enhancing the user's use of the product they own. They could design multiple interfaces, so that each user has a choice on which feel they like best. If they were to do this, they could majorly increase in sales. If you have multiple lines of products, each of which with its own unique property designed for further aiding and\/or improving the way a product is used, then people are going to want to go and buy these new products. It sure seems a lot more profitable than coming out with bi-annual updates for a set program that will never recieve an update for its own self. Even if you could do this with what will be called \"Windows\" instead of \"Windows 10\", the ability to have a variety in your selection as to what you are going to use just beats that single style.As I first said, I understand that Microsoft has said there will be no Windows 11. But I do strive to make a difference in the community of technology by providing better alternatives out of my own opinion. Any and all statements are not intended to be shown as the opinion of everybody. They are simply my own thoughts and arguments.2 year term is traditional. Now Windows became a service, so no more 2y term, it's frequent instead.I also said, Windows is now a Microsoft service, not a product anymore.","Windows 10 uses a new periodical release system, so 2 years terms is gone.","I would agree with Mr. Yue Ling, that I foresee updates and no Windows 11. However, this is preposterous to believe, as Microsoft and Apple have never just created something without then looking at how they can recreate it, better, faster, and more capable than ever, and then send it to the consumers, \"us\" we decide what is the human element \"our personal likes and preferences\" and are the essential factor that fuels these mega-global technologies, to exist... for as huge as Microsoft and Apple are, every single $\/euro comes from you and I both (the public).Therefore, while correct... for the time being Mr. Yue LIng, the need to stay on top of the \"What's Cool!\" and how this drives the engines of capitalism, by the billions of dollars spent on technologies offered by these two, i.e, laptops, OS, cell phones, etc., can only be maintained by continued innovation.   Our desire must be interested in what is coming; It is absolutely necessary for Microsoft and Apple's continued dominance over this electronic, world wide web of economic growth.We all want the next big idea to be something we can buy. And we more often due to this via Amazon.com --- dropship it to us with little time waiting and minimal to no shipping charge. So it will be.People will expect a Windows 11, even in an update, update, update, reality... it has to happen. You will see, it announced, all over the web!The news will be front page across the global medias --- ignite the corporate world and rise some stocks, then saturate the rest of civilization.And it will be the buzz on everyone's mind, the everyday ho-hum daily grind of what people do during the productive hours of jobs-jobs-jobs, this will happen within a few more years. ","I absolutely love this reply. You seem to have hit every point I was covering as well as a few extra. It is unfortunate of the odds that it may not happen, but we can hope that Microsoft either goes through or comes up with something other, completely new and brilliant in its own design.","how to update to windows 11?","put Linux protection in Windows and more created look to windows future looks, also rename \"Windows\" to the name of \"Winux\" ","It seems obvious to me what Microsoft's strategy is when you look at what they are doing with Windows Server.  The trend is to eliminate the year (2008\/2012\/2016\/2019) in favor of \"Windows Server XXXX\", where XXXX = the build number.  They seem headed in this direction with Windows 10 as well, with lots of emphasis on the build numbers.  For now they still have the year for the full desktop versions of server, but they seem to be wanting that practice to end.In point of fact, most business software is now marketed with system requirements that have a minimum and maximum build number for the Windows 10 versions they are compatible with.I expect the trend to continue.  Unless Microsoft changes direction, which they've done in the past, Windows Server XXXX and Windows Pro\/Enterprise\/Workstation\/Education XXX are what I expect to see at some point.If they ever do, however, want to release the \"next big thing\", they could easily make the bi-annual upgrade \"Windows 11\" or some other marketing name with great fanfare and do exactly what they did with Windows 10...just reskin the existing OS and market the hell out of it to accomplish whatever the marketing people want to accomplish and just keep doing what they are currently doing...evolving the OS slowly under the hood (and outwardly too, as desired).","Tells us the date. When  this update will release?"]},{"symptom":"Digital License        I built a desk top computer for my self windows 10 and the computers at church started going bad a they needed up dated equipment any way so I donated several computers to them and one of them is still registered to my Microsoft account.I would like for them to register it to their account and remove it from mine. Is this possible without interfering with any of the information.  we run a projection graphics songs along with audio\/ video, pictures Microsoft office (which I Provide) I am afraid It will affect something in on form or another I do not run the sound support or the audio\/  visual any more. I thought that I wanted them off my account what are my options?    ","solutions":["Hello DanielHahn3, I am Andrew an independent advisor. You can remove the computer association via account.microsoft.com Find where it says DEVICES, should be at the top bar of the page. You can then remove the device. The device will be removed from your account, if you wanted to keep OFFICE for them it can stay under your account. If you need more help we're here for you.Take Care, Andrew","Hi DanielHahn3, in Win 10, go to your Microsoft Account by clicking 'Settings' - Account -Manage my MS Account and enter your Password.1. Locate the PC you want to donate to your Church and at the bottom of the name of the PC click 'show details'2. in the next window, top left corner, under the named PC, click 'MANAGE' and then select'REMOVE PC' in the next drop down listThis will permanently remove the PC you want to give away from your MS AccountRegardsGeorge"]},{"symptom":"Audio quality kinda bad?        After I removed all of my bluetooth audios, my old headphones and my recent speaker, I noticed how my audio quality with my headphones got kinda less bass and i can barely hear it. Is there something wrong with it? I need help please.","solutions":["Hi Kiron. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything possible to try for headset problems so at least something will work. If you need help performing any steps I am standing by here to help:First try the steps here: https:\/\/www.maketecheasier.com\/fix-headphones-n...https:\/\/www.windowscentral.com\/setting-your-hea...https:\/\/www.lifewire.com\/fix-headphones-not-wor...https:\/\/www.thewindowsclub.com\/headphones-not-w...https:\/\/merabheja.com\/fix-no-speakers-or-headph...https:\/\/troubleshooter.xyz\/wiki\/fix-headphones-...Go to Settings > Devices > Autoplay to look for the device and change the default behavior in it's Dropdown Menu.Right click Volume icon in System Tray at right end of task bar, Open Sounds Settings, in dropdown menus at top make sure Headphones are selected and Connected for both Playback and Recording Default Devices.If not again right click Volume icon in System Tray to choose Troubleshoot sound problems.See how to re-enable the \"Which device did you plug in\" popup which can solve headset issues:https:\/\/windowsreport.com\/you-just-plugged-unpl... (avoid ad links)https:\/\/h30434.www3.hp.com\/t5\/Notebook-Audio\/En...https:\/\/forums.tomshardware.com\/threads\/how-do-...https:\/\/www.dell.com\/community\/Windows-10\/How-g...https:\/\/answers.microsoft.com\/en-us\/windows\/for...Go to the Device Manager reached by right clicking the Start button, choose Sound controller device, on Driver tab choose Roll back or Uninstall, restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver. Do the same for the headset device and\/or it's microphone. Update the Sound driver from the PC or Device maker's Support downloads web page. While there also check that the Chipset, BIOS, Display, USB, Network and all other drivers are the most current.Sometimes it helps to unpair or disconnect all other Bluetooth devices from the PC in Bluetooth settings, then try again to connect the headset.If this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t...If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....To check over the integrity of your install go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m...If you want to report this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems.If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it. If you are an Insider I can also vote it up with my MVP badge and track the issue for you.I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Win 10 Activation?        I just installed 10 using a oem dvd with a valid key.  It never asked for the key & it shows active with digital license. How can this be possible?","solutions":["This key was entered into the Microsoft servers and is tied to that motherboard.","Hi, Thank you for writing to Microsoft Community Forums. I understand your query regarding Activation and I’ll help you with the details. As you have mentioned, that you used an OEM DVD to install Windows, I would like to inform that the installation media provided by the OEM i.e. DVD\/recovery partition comes with a pre-activated copy of Windows, which doesn’t require a key to activate. That is the reason you see activation status as activated with Digital license.  Note: The OEM DVD\/partition can only be used on OEM machines, we cannot use the disk on any other computer. For additional information, see Activate Windows 10.  Let us know if you need any further information, we will be glad to help you. Regards,Nikhar KhareMicrosoft Community - Moderator","Never heard of this, but makes sense. Thanks guys for the info.","You are welcome, Kevin.Please feel free to contact us back for any Windows related concerns, we will be glad to help you.Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Unable to activate Windows Enterprise        I have a Microsoft 365 – Nonprofit Cloud SubscriptionInstalled win10 Pro.  Change to enterprise version through changing product id.Login th office.com to install Office 365. And successfully activate it.Joined our organization by Azure Active Directory but not able to activate Windows.I did the same way on other 2 PC and the worked just fine. What went wrong? ***Modified title from: Not able to activate***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are unable to activate Windows on your computer.  Since you are using Windows Enterprise, I would suggest you to get in touch with our activation team by calling them. Please refer the article onMicrosoft Licensing Activation Center.  However, as you have a Microsoft 365 subscription you may want to refer the links mentioned below: Microsoft 365 Business frequently asked questionsMicrosoft Tech Community Regards,Nikhar KhareMicrosoft Community - Moderator"]}]}