{"windows":[{"symptom":"Windows 10 Home, Pro & Enterprise        I am at a complete loss here! I spent $139.00 to get an installation ofWindows 10 Home. The email receipt said I was purchasing Windows 10 Home, gave me a product key and a link to install the operating system on myWindows Surface Pro 7. I had previously purchased and install Windows 10 Pro, for $99.00, for my new Surface because that’s what’s on my desktop. However, I found after the installation Windows 10 Pro,it did not support some the hardware capabilities on the Surface. I decided I wanted to return to Win 10 Home to get those capabilities back. However, after taking that “Install” link from the email, and after the installation, I now haveWindows 10 Enterprise on my Surface and it cannot be activated. Where is my copy of Windows 10 Home? What must I do to get back to that? If that’s not possible, I want my $139.00 back! Anybody know how I can get this message to Microsoft Support?Thanks,Jimus40 ","solutions":["Hi Jim. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.It's a known issue we've been trying to get them to fix for months. To resolve it if you don't yet have a Pro Digital License assigned to the PC, go into Action Center by pressing Windows (flag) key + A and turn on Airplane Mode to go offline.Now insert the Pro Generic Version Key VK7JG-NPHTM-C97JM-9MPGT-3V66T in Settings > Update & Security > Activation > Change Product Key. This will change the version to Pro.Then go back online, insert the Pro Product Key in the same location to activate. If it already has a Digital License it should activate soon after going online.If any problems on Monday contact Microsoft Support by one of these phone numbers:https:\/\/support.microsoft.com\/en-us\/help\/405170...You can also go here: https:\/\/partner.support.services.microsoft.com\/... choose the link for Browser help, interact briefly about your exact problem, keep replying agent until it connects with an agent.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I gave you the exact solution for this which I give out several times a day and it works for every single person with this bug. May I ask why you rated my post unhelpful before you even tried it?","Greg,I appreciate your reply, but it's not Win 10 Pro I'm concerned about. It is activated. I want to go back to Win 10Home that came on my Surface because Win 10 Pro does not  support some of the Surface hardware. I wasn't aware of that problem when I installed Pro. I've spent $99. for Pro and now $139. for what was supposed to be Home. However, the link in the email receipt said it was for Home. However, after I followed the link and did the install, it put Windows 10Enterprise on my Surface.I have activation keys for both Pro and Home but not Enterprise. That doesn't matter though, because I want Home on my Surface. I just need to know how to get the install file forHome.Thanks,Jim","Jim, I've never heard of features that won't work in Pro on a Surface. These are the exact same operating systems which aren't even reinstalled when you Upgrade to Pro, just a few extra features unlocked. None of those features should interfere with anything.What type of install did you do of Home. It can't be downgraded with a key like it can be Upgraded. It must normally be Clean Installed, however there is a workaround Downgrade that is reported by most to be working here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...If not then follow the gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...","I'm sorry Greg. Maybe I didn't understand the directions. I thought it was a way to activate Win 10 Pro. I have Pro and it is activated. Home came on my Surface and when trying to get back to Home, it installed Enterprise.I'll go back and reread your earlier reply to see if I can figure it out.Again, sorry if I misunderstood.Thanks,Jim","Jim, I thought you had the known issue where an Upgrade to Pro registers as Enterprise. You can still use the fix I first gave if you want to test that all Pro features work on your Surface, as they should. If not then I subsequently have given you two paths to get back to Home."]},{"symptom":"Windows 7 processors        Hello there, i have a windows 7 computer that is almost a decade old but still capable of running in today's world. However, lately the computer has started to become spattered with lag even though i have already de fragmented the disk and cleared all the needless files to OneDrive and stop syncing them. Is there anything i can do to try help it? Also according to its Windows Experience Index the processor is at 3.9, RAM at 7.2, graphics at 4.4, gaming graphics at 5.5 and primary hard disk at 5.9, so the processors may be the problem, although i cant be sure.","solutions":["I run a oldie as well.What are your Computer Specifications ???Make \/ Model \/ Serial Tag ???Motherboard if you have built it yourself ???Intel \/ AMD \/ single core \/ core 2 duo or other and speed ???Memory quantity \/ size ???In general give the computer a bit of a tidy up.Uninstall any Programs that you have installed and don`t use often.If you have a full Task-Bar of Quick Launch Programs unpin any that you don`t require quick access to.If you have a full desktop of Shortcut Icons remove what you don`t need quick access to.Other.Depending on your performance option visual effects can also slow things down.To eke out a little more performance.Go to the Start Orb.Type in : view advanced systems settings and press the enter key.In the Performance category click the Settings Tab. In Visual Effects remove the check marks from whats not really required like Animate \/ Fade \/  Slide \/ Show Windows content while dragging.Or : use one of the predefined selections.Below capture of my custom settings and the visuals still look good.","I run a oldie as well.What are your Computer Specifications ???Make \/ Model \/ Serial Tag ???Motherboard if you have built it yourself ???Intel \/ AMD \/ single core \/ core 2 duo or other and speed ???Memory quantity \/ size ???In general give the computer a bit of a tidy up.Uninstall any Programs that you have installed and don`t use often.If you have a full Task-Bar of Quick Launch Programs unpin any that you don`t require quick access to.If you have a full desktop of Shortcut Icons remove what you don`t need quick access to.Other.Depending on your performance option visual effects can also slow things down.To eke out a little more performance.Go to the Start Orb.Type in : view advanced systems settings and press the enter key.In the Performance category click the Settings Tab. In Visual Effects remove the check marks from whats not really required like Animate \/ Fade \/  Slide \/ Show Windows content while dragging.Or : use one of the predefined selections.Below capture of my custom settings and the visuals still look good.These are the computer's current specs","Many of my clients' have similar systems.  If you want to keep it running and all else is good, there is nothing like a new hard drive and re-installation when it comes to performance improvements. I have documented the process I use and you can find it here:https:\/\/www.askwoody.com\/2019\/canadian-tech-how-to-rebuild-a-win7-system-with-minimal-snooping\/","Thanks for that.I see its a Laptop \/ notebook.CPU World considers this CPU to be entry level and suitable for basic office tasks.http:\/\/www.cpu-world.com\/CPUs\/Celeron_Dual-Core\/Intel-Mobile%20Celeron%20847.htmlIts still fine for most basic tasks if but a tad slow.Remove \/ un-install any unwanted software programs that you have added over time.Cut down on all the glitz and glamour in performance options.Have you added any software programs that you use to start automatically when you boot ???Some of these can be turned off. A link from CRUCIAL as what can be upgraded but for its age i am not sure if its worth it to throw more money at it.https:\/\/www.crucial.com\/usa\/en\/compatible-upgrade-for\/Samsung\/300e5ev-300e4ev-270e5ev-270e4ev-2470evAs Canadian Tech had mentioned possibly a new and larger Hard Drive + re-install of OS. A SSD (That would depend on the hard drives connection internally ),  Max out the RAM to full capacity of which it is capable of and use RAM of the max speed it is capable of. A new Hard Drive + OS re-install \/ refresh + RAM will speed it up a little.The only thing that holds it back a little is the CPU.As for the basic score that`s not to bad for its make and age.All up considering its age i am not sure if you would really want to throw to many $$$ at it."]},{"symptom":"Windows 10 Crashing after waking up from sleep        This happens every time I try to wake up my desktop from sleep. When I try to wake it up from sleep, the system crashes it tells me \"Your PC ran into a problem and needs to restart\". But once it restarts after collecting the data it tells me that \"Windows wasn't loaded correctly\" but every option I choose it just goes back into \"Windows wasn't loaded correctly\" until it no longer posts on my monitor.I have a Ryzen 5 2600 Processor, a B450 Tomahawk motherboard, an XFX Radeon Rx 5700 GPU, along with G.Skill Aegis DDR4 3000MHz 2x8gb.","solutions":["Hi Jesus. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I will give you all possible fixes for Sleep. If you need help performing any step just ask back:First confirm you have the Sleep options configured correctly as shown here: https:\/\/www.tenforums.com\/tutorials\/2843-change....You might want to try Hibernate to succeed Sleep, or use Hibernate in place of Sleep - it's just a deeper sleep that actually powers off because desktop stored in RAM during sleep is written to hard drive hiberfile then powered off.Most Sleep problems are caused by the Display driver, so try updating yours from the PC or Device maker's Support Downloads web page for your full model number, Serial Number or Dell Service tag. While there make sure you have the latest BIOS, Chipset, Network, Sound, USB and all other drivers by comparing those posted for download with the version and date of the corresponding ones in the Device Manager.If that doesn't help then in Device Manager on Display device Driver tab choose Roll back, Uninstall (then restart to reinstall) or try another one previously installed at Device Manager>Display adapter>Driver>Update Driver>Browse>Let me pick.In addition there are steps here to specifically troubleshoot Sleep mode problems:http:\/\/www.makeuseof.com\/tag\/fix-windows-10-sle... What I do is go into Advanced Power options and set Display and Sleep to 1 minutes, Hibernate to 2 minutes, then after completing each step restart the PC and observe what happens for 3 minutes.Also did it previously work? Do you have a System Restore point from when it did?http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t...This may have been caused by Windows Updates. Check which Updates were installed right before the problem began, and if necessary uninstall them from Settings > Update & Security > Windows Update > Installed Update History.You can also try to roll back using System Restore to a point before this began: http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... Then if an Update reinstalls and causes the same problem uninstall or roll it back again, then immediately hide it using the Hide Updates tool from Method Two here:https:\/\/www.askvg.com\/fixing-windows-10-automat... If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1903 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hey Greg, first I would like to thank you for helping me with this weird and very nerve-racking situation.The computer did work before this, I tried to recover from a point where it worked but somehow it didn't work.Every time I try to remove\/ uninstall the latest update to windows. It tells me that it is was unable to remove the latest update and to try another method. I need help on how to run a repair install by running the media creation tool choosing to upgrade now. ","No prob, Jesus: Follow the steps here for doing a Repair Install which is an upgrade over itself. It saves files, apps and most settings while reinstalling Windows to resolve most problems and even bring you to the latest version by the most stable method here:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If this doesn't help then most problems are resolved by doing this gold standard Clean Install which should get you past all difficulties as it has millions of others who have followed the steps in this link and never come back to report another problem:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... . So read it over and see if its something you want to learn to do.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to rate my post, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hey Greg, sorry for the late response. I was trying other methods to repair the computer all unsuccessful. I looked over the second option you gave me and I ran into a hiccup. When I go into the product key section it does not give me the option to reinstall windows on the PC. It just tells me that Windows 10 can't be downloaded to the computer and I would need to remove and reinstall it. ","Jesus, are you referring to the Repair Install in the first link in my last post?If so you can download the ISO or create the bootable media following the steps in the middle of the downloads page here, if necessary on another PC:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m...Transfer the ISO or media to problem PC, double-click the ISO to mount it, or open the media, right click Setup to Run as Admin. If problems follow these steps :http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...","Sorry Greg, I was talking about the second link you gave me. ","Are you referring to the Clean Install tutorial here: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...What Product Key section is telling you that you cannot reinstall Windows? You can always reinstall Windows using bootable media you create on that or any other PC, by following the steps I gave to create, boot the media, delete all partitions off the drive (which is what makes it clean) and then click next to let it auto-format and begin.","Greg, I have decided to install windows on my HDD and take out my SSD. It seemed to have worked. Windows booted up and I can use certain stuff normally. I do have a few questions. Sorry about going rogue and doing this. In my mind, it seemed that it would be the only thing that worked. Is there a way I can transfer the 'Windows' files from the HDD to the SSD? Also, how do I completely erase every single bit of windows on my SSD so that it doesn't somehow mess up again? Again sorry for going rogue and thanks for your help through this issue.","That's OK, Jesus. The only problem is the HDD wont' be as fast so you might want to move your files over to it, wipe the SSD and reinstall Windows with the SSD plugged in alone (so the HDD doesn't interfere).To transfer files from the SSD, plug it in internally and browse to it in Explorer, open each User folder, from Home tab Select all, then Copy, then open the same folder in the new install, from Home tab select Paste. Do this for each User folder.Once everything is moved over, run Diskpart Clean Command on the SSD to wipe it cleanest:https:\/\/www.tenforums.com\/tutorials\/85819-erase...Then when you're ready I'd unplug the HDD, boot the media and reinstall to the SSD following the gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...","Greg, when you said to wipe the SSD I should just plug it back into the motherboard and wipe it using command prompts, then transfer the files from the HDD to the SSD, restart the computer with the disconnected HDD and try to boot up from SSD? Just trying to confirm what I should do. "]},{"symptom":"Windows Update not working        HI,      Been having this problem for a while, But as the subject suggests, Windows 10 does not seem to be updating itself. I always get errors when i retry as well.  I did click on the get help button on the windows update settings page. However, the suggestions it provides do not seem to be working as well. errors received when trying to update windows in the past: below is the error i received after attempting to update again today:After clicking on get help:I then proceeded to launch command prompt in administrator in type in the commands. It didn't workbelow is what I saw:The sfc\/scannow option didn't really do anything either.I was then recommended by the 'get help' to download 'reset windows update agent' and to see if i  could install windows updates then.This is what i saw:Therefore, I hope i can get some help with my issue and resolve it soon. I don't windows has been updated since October of this past year. Weirdly, I have also noticed, When i right click on a file and select properties, nothing happens as well. Don't know if it's related.  Apart from these, Windows seems to be functioning completely fine. Any help is appreciated. Thanks in advance.","solutions":["Hi Moh. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything possible for fixing failed Windows Updates, so that at least something will work before you work through them all. Even if you've tried a step, please do it over in sequence:Some Updates will sort themselves out in a few days so I'd wait to see. If not or they are bothering you then here are steps you can take:1) Run the Windows Update Troubleshooter from Windows Settings > Update & Security > Troubleshoot.2) There is a new guided walk-through from Microsoft for repairing Windows Update that leads up to resetting components if necessary:https:\/\/support.microsoft.com\/en-us\/help\/10164\/.... Try running that first. 3) If that fails try manually resetting Windows Update Service: Open administrative Command Prompt and type following commands one-by-one followed by Enter key.net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Close Command Prompt and see if Windows Updates works then 4) You can also install the Updates manually that fail to install, which are logged at Settings > Update & Security > Windows Update > Installed Update History, and then search for those to download and install from this Catalog:http:\/\/test.catalog.update.microsoft.com\/v7\/sit... 5) If they continue to fail and interfere, then you can block them using one of these methods:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... 6) If problems with Updates have become chronic and especially if you have other performance problems, go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 7) If nothing else works then do a Repair Install, by installing Media Creation Tool, open installed Tool and choose to Upgrade the PC Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version 1909. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... _____________________ Good news! There are major changes in Version 1903 giving back control over Updates to the consumer. Microsoft has heard us at the highest level who announced this here:https:\/\/blogs.windows.com\/windowsexperience\/201..._____________________ I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"\"Activate Windows'        Why am I being requested to Activate Windows again after I have been using Windows Pro 8.1 for 7 years on this computer?  I've gone to 'PC settings', but when I click on Activate nothing happens.   Now what?","solutions":["Retail and OEM Licenses do not expire.But Volume Licenses have to be re-activated on a regular basis, but Volume Licenses are not for private use..Run this Command to see what type of license you have; also applies to 8.1:https:\/\/www.tenforums.com\/tutorials\/49586-determine-if-windows-license-type-oem-retail-volume.htmlGet help with Windows activation errors:https:\/\/support.microsoft.com\/en-au\/help\/10738\/windows-10-get-help-with-activation-errorsApplies to: Windows 10 Windows 7 Windows 8.1@@@@@@@@@@@@@@@@@@@@@@@@@Activate Windows 7 or Windows 8.1 - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@@@@With Windows 8\/8.1 The Product Key on preinstalled Operating Systems (HP, Acer, etc) is embedded in the BIOS in the Motherboard, so that the lost and\/or worn C.O.A. Sticker problem is no more.When you reinstall it will pick up the Product Key and activate the system automatically.If it does not or you have activation problems, follow these steps:\"How to Activate Windows 8 and 8.1 by Phone\"http:\/\/www.eightforums.com\/tutorials\/24636-activate-windows-8-phone.htmlFollow these steps and do a Phone Activation and hold on for a real person to assist you.OPTION TWOTo Activate Windows 8.1 by Phone1. Do step 2, 3, 4, 5, or 6 below for what you would like or able to do.2. Press the Windows + R to open the Rusluisn dialog, typeslui.exe 4, press Enter, and go to step 7 below.3. Open an elevated command prompt, typeslui.exe 4, press Enter, and go to step 7 below.4. Open the Power Users Tasks menu, click\/tap on System, and go to step 5A below.5. Open the Control Panel (icons view), and click\/tap on the System icon.A) Click\/tap on Activate Windows at the bottom right corner underWindows activation, and go to step 7 below. (see screenshot below)6. Open PC settings, click\/tap onActivate Windows on the left side. Etc.\"Get help with activation errors\"http:\/\/windows.microsoft.com\/en-us\/windows-8\/activation-errors\"How to activate a Microsoft product by using Microsoft Product Activation Center\"http:\/\/support.microsoft.com\/kb\/950929\/en-us_______________________________________________If phone activation is not available to you or does not let you contact Micosoft, you will have to use this method tocontact MS support _______________________________________________This information may interest you if you do wish to keep a record of it:\"Windows 10 Embedded Product Key Tool\"https:\/\/neosmart.net\/blog\/2014\/windows-10-embedded-product-key-tool\/\"We’re proud to introduce the immediate release of our newest utility for Windows users: the NeoSmart Technologies Embedded Product Key Tool. Designed for users of Windows 7, Windows 8, and Windows 10, our embedded product key tool will retrieve and display the Windows setup product key embedded in the BIOS or EFI, allowing you to store it for safe-keeping or use it to reinstall Windows with an official Windows setup image.\"You can also use:\"Belarc Advisor - Free Personal PC Audit (Version 8.5c)\"http:\/\/www.belarc.com\/free_download.htmlOr:\"Product KeyFinder\"https:\/\/www.magicaljellybean.com\/keyfinder\/Cheers.","          <  Product key removed by VM > please give me new activated code this not actived .","          <  Product key removed by VM > please give me new activated code this not actived .We have no product keys to give you.And if you have a question start a new thread.These are NOT chat rooms."]},{"symptom":"Microsoft Message locking my laptop        My laptop was locked, supposedly by Microsoft security requesting  that I call an 800 # to “correct the issue and unlock it. I contacted M-Soft on my ipad & was advised it is a scam; but I cannot get anyone to call me from Microsoft to tell me to safely unlock it. My screen is locked to the scam message; and I cannot navigate to any other setting. Can I do a reboot using my on\/off button to safely unlock (the scam screen says I will lose data if I do that).If anyone can please help me with this situation, I would greatly appreciate it.Thanking you in advance,Jim Timble","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Firstly, yes it's definitely a scam. Any warning or message on the screen is just nonsense and can be ignored.In order to do a controlled restart try pressing keys CTRL, ALT and DEL together - if you can get the security options to display you'll see a power symbol in the bottom corner - click that and then choose Restart. If you cannot get that to work then hold in the physical power button until the computer switches off and then switch back on.Hopefully it will then reload to your normal desktop without the message reappearing. Once you get back in click START, type \"security\", to find the \"Windows Security\" app, in there go to 'Virus & Threat protection\" and click Quick Scan and observe the results.Regards, David"]},{"symptom":"Brightness button        I'm not sure what caused this but whenever I press F11 to change my brightness, it instead makes my screen go to full screen. When I try to turn my brightness up with F12, it doesn't do anything. ","solutions":["How about Fn F4 and Fn F5?What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK  What computer?","F4 and F5 dont work either.Pressing the Fn key at the same time as them makes them work though. Os build is 18362.535.  Computer is a Lenovo G50-80"]},{"symptom":"Windows 10 Pro erroneous restart to update message blocks other updates        Windows 10 Insider Preview 19041.1 (vb_release) restart to update message appears continuously despite many repeated restarts and update and shutdown actions.So far MS advisors have not provided a solution. The MS Windows update assistant doesn't solve the problem because it reports the update is already installed.So far MS online advisors have not been helpful in resolving this.","solutions":["Hi Bron. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything possible for fixing failed Windows Updates, so that at least something will work before you work through them all. Even if you've tried a step, please do it over in sequence:Some Updates will sort themselves out in a few days so I'd wait to see. If not or they are bothering you then here are steps you can take:1) Run the Windows Update Troubleshooter from Windows Settings > Update & Security > Troubleshoot.2) There is a new guided walk-through from Microsoft for repairing Windows Update that leads up to resetting components if necessary:https:\/\/support.microsoft.com\/en-us\/help\/10164\/.... Try running that first. 3) If that fails try manually resetting Windows Update Service: Open administrative Command Prompt and type following commands one-by-one followed by Enter key.net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Close Command Prompt and see if Windows Updates works then 4) You can also install the Updates manually that fail to install, which are logged at Settings > Update & Security > Windows Update > Installed Update History, and then search for those to download and install from this Catalog:http:\/\/test.catalog.update.microsoft.com\/v7\/sit... 5) If they continue to fail and interfere, then you can block them using one of these methods:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... 6) If problems with Updates have become chronic and especially if you have other performance problems, go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 7) If nothing else works then do a Repair Install, by installing Media Creation Tool, open installed Tool and choose to Upgrade the PC Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version 1909. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... _____________________ Good news! There are major changes in Version 1903 giving back control over Updates to the consumer. Microsoft has heard us at the highest level who announced this here:https:\/\/blogs.windows.com\/windowsexperience\/201..._____________________ I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"How to turn off Norton Security and turn on Defender        I currently have Norton Security on my laptop supplied courtesy of my Comcast account.  It does the job as an Security program, but I suspect it's bogging down the laptop.    I want to try just using Defender as I've read that it's now as good as any other Security program out there.   My questions are:How do I turn on Defender and do I need to disable\/uninstall Norton first?If I disable Norton, do I need to disconnect from the internet first so I won't be without a security program til I activate Defender?Does Defender have a backup function?  If not, can I keep using the Norton backup function even if I turn the rest of Norton off?Thanks","solutions":["Download and run the Norton Uninstall Tool. https:\/\/support.norton.com\/sp\/en\/us\/home\/curren... Norton Backup and Norton Security should be different programs, but I'm not familiar enough with Norton Backup to be sure.Once the Norton security product is gone, you should be able to enable Defender."]},{"symptom":"Reactivating fails after hardware change        I changed out my motherboard and RAM due to my motherboard starting to die and spit out errors, and it was time for an upgrade anyways. Before I went through with the upgrade I made sure my Windows Activation was connected to my Microsoft account using the instructions here: https:\/\/support.microsoft.com\/en-us\/help\/20530\/windows-10-reactivating-after-hardware-changeI tried following the other set of instructions on that page to reactivate Windows... however even after selecting that I'm using this PC it just says \"Unable to activate\".I don't have a product code because this was originally a Windows 7 way back when that I upgraded to 10, and of course I have lost that little slip of paper over the years.I really don't want to have to buy Windows again. Is there anything I can do to fix this?","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,First, you'd need to identify if the license for the windows 10 computer is either a retail or an OEM key.Normally OEM keys are solely embedded to one motherboard as they do not have transfer rights for other hardware, unlike retail keys which has transfer rights.For free upgrade licenses, the condition for these are relevant to an OEM key as the license is then considered a digital license once you upgraded free to windows 10.Under this link are reference to activation after hardware change https:\/\/support.microsoft.com\/en-ph\/help\/20530\/...For your windows 10 license, I'd recommend running the activation troubleshooter. Go to Settings>Update and security>Activation and run the troubleshooter. and select I recently changed hardware on this device.If the troubleshooter hasn't helped, you would have to call Microsoft during support hours to get more help.https:\/\/support.microsoft.com\/en-in\/help\/405170...","This copy was originally a retail copy, as confirmed by Windows:I did try running that troubleshooter and selecting \"I recently changed hardware on this device\" as per the linked article, that's how I came to the screen I showed before.I guess my only option is to call Microsoft support?","Other users has reported that their retail copy of their previous version prior to upgrading to windows 10 works as an activation key for windows 10 when upgrading. If you still have a copy of your previous windows 7 product key, I'd recommend activating your windows 10 with it. Otherwise, I'd recommend reaching Microsoft support to validate your retail license."]},{"symptom":"windows media  player        hello,   I was using  windows 7 and was able to  transfer videos from Instagram, my email Facebook etc from my desktop to windows media player by  right clicking it and sending  to windows media  player. My windows 7 computer got messed up by Geek squad and they had to back up the data and reinstall  windows 7 operating system when  I got it back  I noticed that all my videos in  Windows media  player had disappeared. I  bought a windows 10 and  geek squad backed up the same data to it and again in windows 10 all the videos I had saved  were gone. I   had done a back up to  my external  hard drive using  Acronis  true image but apparently I had  done something wrong because it wiped out the operating system in 7 again now back to best buy Geek squad. I am now using windows 10 which the  geek squad data had backed up from  windows  7. I had over 50 videos in media player on  windows 7  ]. My question is there some way I can get  these videos back after all the data  backups and  reinstalling windows 7. It appears that  that the data ack up did  back up my desktop which is  where  I had windows media player. can any of those video be found or with all the restoring of windows 7  are they lost forever.  Again  afraid to run Acronis restore because of a bad back up. Noting appears in my windows media player in  music or videos  soe of the photos  come up but not  all of them either. Any  suggestion on how  or  if  it is possible to get the videos  I had saved back.","solutions":["Hi Mary. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.So it sounds like you had playlists in Windows Media Player of music you have stored elsewhere, usually in Music folder? Is that correct?See here how to transfer a Media Player playlist to another PC: https:\/\/www.howtogeek.com\/393256\/how-to-transfe...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows Cluster Hyper-v HA        Good day EveryoneI have an issue with live migration after create a virtua machine role with 3 vms, both nodes share Storage disk.When in try to execute the live migraton it doen't run and in the event viewer a saw this id  21502 the windows cluster is windows server 2019 standardI need to fix it cause is a productive enviromentMoved from es- es","solutions":["Your question is outside the scope of this Community.I suggest that you repost in the TechNet Hyper-V Forum.https:\/\/social.technet.microsoft.com\/Forums\/windowsserver\/en-US\/home?forum=winserverhypervOr in the TechNet Server Forums.http:\/\/social.technet.microsoft.com\/Forums\/windowsserver\/en-US\/home?category=windowsserverTechNet Forums: https:\/\/social.technet.microsoft.com\/Forums\/en-US\/homeOr MSDN Forums:https:\/\/social.msdn.microsoft.com\/Forums\/en-US\/homeCheers."]},{"symptom":"tablet        HI9i bought a tablet and it does not respond to my touch commands anybody helps freezes  ALL THE TIMETHANK YOU","solutions":["Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.Did you try a complete re-start? Hold down the power button for a few seconds and click 'restart'Otherwise, if you have nothing important in your tablet (photo video etc), you can do a system restore.I can guide you if you give me the exact model of your tablet."]},{"symptom":"Laptop powers off when not plugged in to power source        Recently my HP Notebook will not charge above 0%. It turns on when plugged in to power source but instantly turns off when disconnected from the charger. Any information regarding this issue would be appreciated. Thanks!","solutions":["Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.Your battery may no longer be functioning properly. Please follow the steps in this HP article to diagnose the issue: https:\/\/support.hp.com\/us-en\/document\/c04700771 Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Upgrading sofware of Windows 7 to 10,  (worried losing files)        Please reply,Am I going to lose my files if I upgrade my windows 7 to windows 10?","solutions":["Haven't you ever heard of hard drives failing, system file corruption, or systems not being able to boot into Windows, etc., etc.?You should always have your data backed up to at least two external media destinations (external hard drive, DVDs, flash drive) in case of system file corruption and\/or hard drive failure..@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@"]},{"symptom":",correct password for live.com but can not log into computer        Trying to help my nephew. He lost the password for his win8 laptop. At the login prompt, he is asked to go to live .com\/password\/ reset. we are able to do that and correctly changes his password  log into his live.com account with the new password but when on the laptop, when he tries to log in, it complains the the password is incorrect. his laptop is connected to the internet and we can actually see the failed log in attempts on the live.com website.any thoughts on what I can try","solutions":["\"What to do if you forget your Windows 8\/8.1 password\"http:\/\/windows.microsoft.com\/en-us\/windows\/what-do-forget-windows-password#1TC=windows-8If you've forgotten your Windows password, there are several ways to retrieve or reset it:If your PC is on a domain, your system administrator must reset your password.If you're using a Microsoft account, you can reset your password online. For more info, go to theReset your password webpage. If you're using a local account, use your password hint as a reminder.If you've tried these suggestions and still can't sign in:If you have Windows 8.1, you'll need to reinstall Windows. If you have Windows RT 8.1, you'll need to contact your PC manufacturer.@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Microsoft forbids any assistance being given in these Forums to help you bypass or \"crack\" lost or forgotten Passwords.Here is the Microsoft Information outlining that Policy:http:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_7-security\/keeping-passwords-secure-microsoft-policy-on\/39f56ef0-5d68-41ad-9daa-6e6019c25d37Cheers.","Thanks Bill for the comments.  I can appreciate the rules and I am not trying to circumvent them. What is interesting here is that he is using a gmail address as his computer login. When I reset his microsoft password, I can step through all of the steps and get to a point where we can log into in account on live.com. On the recent activity page under security in account, I can see the attempts to log in on the computer giving incorrect password entered. That seems to confirm that the laptop is on the network.Why is it not accepting the changed password configured in live.com?","You would have to ask Microsoft that.And we don't work for Microsoft.","How would I get a hold of microsoft for something like this?","To contact Microsoft Support:Contact support         http:\/\/windows.microsoft.com\/en-us\/windows\/contact-supportAlso: https:\/\/partner.support.services.microsoft.com\/en-us\/contactus\/windows\/tech-services\/\"Microsoft office locations around the world\"https:\/\/www.microsoft.com\/en-us\/worldwide.aspx\"Global Customer Service phone numbers\"https:\/\/support.microsoft.com\/en-au\/help\/13948\/global-customer-service-phone-numbers@@@@@@@@@@@@@@@@@@@@@@@"]},{"symptom":"Location is not available        Hi Everyone, I am having this issue of my location not being available. What makes it worse is that my screen goes on and off, with the error command and the taskbar appearing occasionally. The issue only arises when I have logged into my account, and my task manager and mouse cursor works fine.any help is greatly appreciated!","solutions":["Hi Naidu. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See fixes for the error here: https:\/\/www.thewindowsclub.com\/desktop-location...https:\/\/www.wintips.org\/fix-windows-system32-co...https:\/\/www.kapilarya.com\/fix-desktop-is-unavai...https:\/\/www.easeus.com\/storage-media-recovery\/f...If nothing else works enable the built-in hidden Administrator used only for emergencies:https:\/\/www.isumsoft.com\/it\/enable-hidden-admin...https:\/\/www.tenforums.com\/tutorials\/2969-enable...Sign into the Admin account, leave password box blank, press Enter. Create a new Local Admin account in Settings > Accounts > Family & Other People > Other, as shown here:http:\/\/www.howtogeek.com\/226540\/how-to-create-a... Sign into the new account, test if the problem persists, if not then move your files over, test that all programs work or else reinstall them, then when ready delete the old account in the same place.You can then change it to your Microsoft account if desired: https:\/\/www.tenforums.com\/tutorials\/5375-switch...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Workgroup Troubles (sigh...again)        Edit: Did I put this in the wrong forum or something?Hello,I cannot see my household server from my laptop.  Both are on Windows 10. The server can see the laptop.  But they are under different workgroups.  Our household workgroup is called SPEISERHOUSE.  My laptop was just upgraded to Win 10, but the dude forgot to change the workgroup from the default WORKGROUP.  Tried to do this  myself, but....Under Control Panel -> System and Security -> System, under Computer Name, Domain and Workgroup settings, it says Workgroup:  WORKGROUP.  I clickedChange Settings.  I get a System Properties dialog, but the Network ID button is greyed out.   So I cannot change the workgroup.  I suspect this has something to do with the fact that I am not treated as an Administrator on my own laptop. (!!) My user type is set to Administrator, but do I have to be logged in as an online user, through my Microsoft account, to be fully recognized?  Currently I seem to be a local-only user.  (And yes, I've gone through the steps to change this, only to run into yet another dead end, but we can cover that later...)Any help appreciated. ","solutions":["Hello?  Have I stumped everyone (again)?","Don't you have that 2nd button ?","Don't you have that 2nd button ?Ok, yes, you're right, I do. I probably didn't read it because I was so fixated on the first one being unavailable. I'll give that a try, and thanks.But I still would like to know if I'm correct about,not being recognized as an administrator because I'm not logged in to my Microsoft account?","A local user (without Microsoft Account) can act as Admin:https:\/\/support.microsoft.com\/en-us\/help\/4026923\/windows-10-create-a-local-user-or-administrator-account Network ID:https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/unable-to-see-pcs-on-my-workgroup-network-id\/896aac05-3df9-40f8-9a4b-5869d39d4418Bernd","OK, first off, yes, I DO have that second button, but on mine it reads simply, To rename this computer.  It says nothing about a Workgroup or Domain Name, which is probably why I missed it.  But I clicked it, and sure enough, I was able to change the Workgroup name.  Sadly, that did not solve my basic problem, which is that I still cannot see the machine NEW-ALPINE-SERVER in my laptop's network listing.  It doesn't appear in the Quick Access list, nor in the Computer list, nor in the Network list.  It just ain't there.  I will check out your links tonight to see if that helps.  Thanks."]},{"symptom":"App Crashes        Hey,Earlier I could download multiple big files from Telegram at the same time. After the update of the app, say if it is a 2GB file, download reaches 100 mb or 300 mb and the whole app crashes. This issue is the same with Telegram desktop app from the store and also the one from their website. What is this issue? Device specs: Processor- Intel(R) Core(TM) i3- 4005U CPU @ 1.70GHz 1.70GHzRAM- 4.00GB64 bit OS, x64-based processorPlease find me a solution.","solutions":[]},{"symptom":"Display problem        Just bought a new HP pc with windows 10 pro. It will not fill out my display. There is about 3\" of black on both sides of my screen. I have tried changing the resolution with no luck.","solutions":["Hi Leif. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) Is this in all windows or just the desktop? Try resetting the Theme at Settings > Personalization > Themes or from the many spectacular free slideshow Themes from the Store that will install to the Personalization > Themes panel to choose from:https:\/\/www.microsoft.com\/en-us\/store\/collectio... 2) Once you do that go into Settings > Personalization > Backgrounds scroll down to bottom to the menu for Choose a Fit, drop down menu to choose Fill.3) If this doesn't do it then Update the Display driver from the PC or Display adapter maker's Support Downloads web page for your exact model number, HP Serial Number or Dell Service Tag - from the sticker on the PC.While there check also for newer chipset, BIOS\/UEFI firmware (very important), network, sound, USB3 and other drivers, comparing to the ones presently installed in Device Manager reached by right clicking the Start Menu.If this doesn't give you the latest or ideal driver for what you need, compare it to the driver offered by the Intel driver update Utility here:http:\/\/www.intel.com\/content\/www\/us\/en\/support\/... or the Nvidia Update utility here: http:\/\/www.nvidia.com\/Download\/Scan.aspx?lang=e... or the AMD autodect utility here: http:\/\/support.amd.com\/us\/gpudownload\/windows\/P... For Display issues one fix that is working is to Roll back or Uninstall the Driver on the Display Device > Driver tab, restart PC to reinstall driver.You can also try older drivers in Device Manager > Display device > Driver tab > Update Driver > Browse > Let Me Pick.Then you will know you've tried everything in addition to Windows Update drivers.4) Adjust the screen resolution until it fits and looks best at Settings > System > Display.5) To get color back on the Taskbar, Start Menu and windows frames after Version 1903 turned the Light Theme dull grey, see here:https:\/\/answers.microsoft.com\/en-us\/windows\/for... Report back all results. I'll be here to help until it's resolved. ______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]}]}