{"windows":[{"symptom":"Audio stuttering - no idea, how to solve this isssue        Hey guys,i got a \"serious\" problem.First of all, the specs of my pc:Intel Core i7 8700KGigabyte Z370 HD316 GB DDR4 RamNvidia GeForce RTX 2080 Ti500 Gb SSD HarddriveSteinberg UR242 (Soundcard)When I'm playing games and sometimes out of nothing my audio is stuttering. That means, that the audio is silent for about 1\/2 - 1 second. The game works fine, but the audio doesnt work in that moment. Audio means -> Audio of game, of my music, of everything I can hear.The problem occured, since I upgraded to the RTX 2080. (Used a 1080 before) But the card works fine, no problems at all with graphics or frame drops. I used LatencyMon to get some information about the audio issue. Here is the result:_________________________________________________________________________________________________________CONCLUSION_________________________________________________________________________________________________________Your system appears to be having trouble handling real-time audio and other tasks. You are likely to experience buffer underruns appearing as drop outs, clicks or pops. One or more DPC routines that belong to a driver running in your system appear to be executing for too long. Also one or more ISR routines that belong to a driver running in your system appear to be executing for too long. One problem may be related to power management, disable CPU throttling settings in Control Panel and BIOS setup. Check for BIOS updates. LatencyMon has been analyzing your system for  0:12:02  (h:mm:ss) on all processors._________________________________________________________________________________________________________SYSTEM INFORMATION_________________________________________________________________________________________________________Computer name:                                        DESKTOP-R87R0TFOS version:                                           Windows 10 , 10.0, version 1809, build: 17763 (x64)Hardware:                                             Z370 HD3, Gigabyte Technology Co., Ltd., Z370 HD3-CFCPU:                                                  GenuineIntel Intel(R) Core(TM) i7-8700K CPU @ 3.70GHzLogical processors:                                   12Processor groups:                                     1RAM:                                                  16330 MB total_________________________________________________________________________________________________________CPU SPEED_________________________________________________________________________________________________________Reported CPU speed:                                   3696 MHzNote: reported execution times may be calculated based on a fixed reported CPU speed. Disable variable speed settings like Intel Speed Step and AMD Cool N Quiet in the BIOS setup for more accurate results.WARNING: the CPU speed that was measured is only a fraction of the CPU speed reported. Your CPUs may be throttled back due to variable speed settings and thermal issues. It is suggested that you run a utility which reports your actual CPU frequency and temperature. _________________________________________________________________________________________________________MEASURED INTERRUPT TO USER PROCESS LATENCIES_________________________________________________________________________________________________________The interrupt to process latency reflects the measured interval that a usermode process needed to respond to a hardware request from the moment the interrupt service routine started execution. This includes the scheduling and execution of a DPC routine, the signaling of an event and the waking up of a usermode thread from an idle wait state in response to that event.Highest measured interrupt to process latency (µs):   2004,50Average measured interrupt to process latency (µs):   3,714060Highest measured interrupt to DPC latency (µs):       1956,70Average measured interrupt to DPC latency (µs):       1,55190_________________________________________________________________________________________________________ REPORTED ISRs_________________________________________________________________________________________________________Interrupt service routines are routines installed by the OS and device drivers that execute in response to a hardware interrupt signal.Highest ISR routine execution time (µs):              2282,988636Driver with highest ISR routine execution time:       dxgkrnl.sys - DirectX Graphics Kernel, Microsoft CorporationHighest reported total ISR routine time (%):          0,166958Driver with highest ISR total time:                   dxgkrnl.sys - DirectX Graphics Kernel, Microsoft CorporationTotal time spent in ISRs (%)                          0,184708ISR count (execution time <250 µs):                   1060279ISR count (execution time 250-500 µs):                0ISR count (execution time 500-999 µs):                186ISR count (execution time 1000-1999 µs):              1ISR count (execution time 2000-3999 µs):              1ISR count (execution time >=4000 µs):                 0_________________________________________________________________________________________________________REPORTED DPCs_________________________________________________________________________________________________________DPC routines are part of the interrupt servicing dispatch mechanism and disable the possibility for a process to utilize the CPU while it is interrupted until the DPC has finished execution.Highest DPC routine execution time (µs):              2259,369048Driver with highest DPC routine execution time:       nvlddmkm.sys - NVIDIA Windows Kernel Mode Driver, Version 441.87 , NVIDIA CorporationHighest reported total DPC routine time (%):          0,057774Driver with highest DPC total execution time:         Wdf01000.sys - Kernelmodustreiber-Frameworklaufzeit, Microsoft CorporationTotal time spent in DPCs (%)                          0,186268DPC count (execution time <250 µs):                   3778548DPC count (execution time 250-500 µs):                0DPC count (execution time 500-999 µs):                148DPC count (execution time 1000-1999 µs):              7DPC count (execution time 2000-3999 µs):              13DPC count (execution time >=4000 µs):                 0_________________________________________________________________________________________________________ REPORTED HARD PAGEFAULTS_________________________________________________________________________________________________________Hard pagefaults are events that get triggered by making use of virtual memory that is not resident in RAM but backed by a memory mapped file on disk. The process of resolving the hard pagefault requires reading in the memory from disk while the process is interrupted and blocked from execution.NOTE: some processes were hit by hard pagefaults. If these were programs producing audio, they are likely to interrupt the audio stream resulting in dropouts, clicks and pops. Check the Processes tab to see which programs were hit.Process with highest pagefault count:                 msmpeng.exeTotal number of hard pagefaults                       41613Hard pagefault count of hardest hit process:          13379Number of processes hit:                              68_________________________________________________________________________________________________________ PER CPU DATA_________________________________________________________________________________________________________CPU 0 Interrupt cycle time (s):                       65,868739CPU 0 ISR highest execution time (µs):                2282,988636CPU 0 ISR total execution time (s):                   15,932888CPU 0 ISR count:                                      1035185CPU 0 DPC highest execution time (µs):                2259,369048CPU 0 DPC total execution time (s):                   14,908377CPU 0 DPC count:                                      3499026_________________________________________________________________________________________________________CPU 1 Interrupt cycle time (s):                       34,062110CPU 1 ISR highest execution time (µs):                342,326299CPU 1 ISR total execution time (s):                   0,071207CPU 1 ISR count:                                      25242CPU 1 DPC highest execution time (µs):                596,091450CPU 1 DPC total execution time (s):                   0,745576CPU 1 DPC count:                                      26877_________________________________________________________________________________________________________CPU 2 Interrupt cycle time (s):                       20,117987CPU 2 ISR highest execution time (µs):                3,495130____________________________________________________________________________________________________________________________________________I made a BIOS Update but the problem is still there.I hope somebody can help me here. Thank you!","solutions":["By the way, I used the newest driver for the RTX 2080 TI and updated Windows.Before I've done that, I installed Windows new on my PC.Sorry for my english by the way.","Hello DanielMicAcc, I'm Didi, an independent advisor. First check that you have updated Windows to the latest version : click on the Start button, type \"update\", click \"Check for updates\" and in the window that just popped up click on the \"Check for updates\" button.If any update is available install it and restart your computer. If this doesn't help check for any available driver for your computer and graphic card here :http:\/\/www.nvidia.com\/driversIf any new driver is available, install it and restart your computer. If this still doesn't help do the following : 1) In the NVIDIA Control Panel set PhysX processor to use your graphic card, do the same for \"Preferred graphic processor\" in \"Manage 3D settings\".2) Set your computer on best performance settings in Control panel > Power options3) Rollback your GeForce Game Ready Driver to version 417.22 available here : https:\/\/www.nvidia.com\/Download\/driverResults.a... 4) Enable VSYNC following this guide : https:\/\/support.enmasse.com\/hc\/en-us\/articles\/3... Regards, Didi -------------- Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thank you for that fast reply! I gonna test it now and gonna tell you, if it works!","Hi DanielMicAcc, You're welcome. I'll be waiting for your reply. Regards, Didi","Hey,I did everything. I even downgrade to 417.22.The issue is still there :(Regards and thank you for your help!","HI Daniel. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you all possible solutions for Sound problems in order of priority, so please try any you've already tried again in order. If you have any problems performing any steps I'll be standing by here to help you.1) Update the sound driver from the PC or device maker's Support Downloads webpage for your exact model, if it is newer than the one presently installed in Device Manager reached by right clicking the Start button. While there compare to make sure you also have the latest BIOS, Chipset, Display, Network and all other drivers. 2) Restore the Windows Audio Service which may have become disabled: https:\/\/www.tenforums.com\/tutorials\/57567-resto... 3) Next try these checklists: https:\/\/support.microsoft.com\/en-in\/help\/402699... https:\/\/www.howtogeek.com\/443702\/how-to-fix-sou...4) Right click Volume icon in System Tray, choose Sound Settings, from the Output and Input devices dropdown menus, choose then one(s) affected to see if that helps. If not use the Troubleshoot button nearby.5) Run the Playing Sound troubleshooter at Start button > Settings>Update & Security>Troubleshoot.6) Try rolling back the sound drivers in Device Manager reached by right clicking the Start button. Choose Sound controller and other audio devices, then Driver tab, then Roll back if available.7) If no newer sound drivers then uninstall the one presently installed in Device Manager, reached by right clicking the Start Button. Restart PC to reinstall.8) Try other and older drivers for your model Sound controller, too. For example, try the next oldest driver in the model's online Support Downloads list. To try all previous drivers installed on your system, in Device Manager choose Sound controller's Driver tab, then Update Driver, then Browse, then Let Me Pick. Finally, try installing the latest Sound driver in Compatibility Mode as shown here:https:\/\/social.technet.microsoft.com\/Forums\/win...9) If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 10) If this was caused by a Version update (which you can confirm at Settings > System > About) then you can roll back the version in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 11) You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... 12) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. 13) If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"New Laptop set-up        I have a desktop with my only e-mail address attached to my Microsoft acct.  I now have a new laptop and during set-up it asked for my e-mail address, I gave it the one I have, it states a Microsoft account is already associated with this e-mail address (I know)?  I do have an office 365 subscription, under this e-mail address.What do I have to do?  No Cell phone, Landline onlyA Dinosaur","solutions":["Glad to hear it, Bill. Let me know if there's anything else. Also when ready please mark the post which helped most as the Answer, to help others. A rating is also appreciated."]},{"symptom":"adding usb cd rom external drive         * * * *","solutions":["Hi, Thank you for writing to Microsoft Community Forums. In order to get clarity and to assist you accordingly, please reply with the answers to the questions below. What is the Windows 10 version and Build installed? (Typewinver in Windows search\/Run command)What is the make and model of the PC?What is the make and model of the CD ROM device?What is the error you receive, when you plug in the CD ROM? If the CD\/DVD drive is not recognized by the PC then please refer this article:Your CD or DVD drive is not recognized by Windows or other programs Note:  Important this section, method, or task contains steps that tell you how to modify the registry. However, serious problems might occur if you modify the registry incorrectly. Therefore, make sure that you follow these steps carefully. For added protection, back up the registry before you modify it. Then, you can restore the registry if a problem occurs.Follow the steps to take backup of registry.  We await your response. Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"Program list        How can I print a list of my programs with product keys before I change from windows 7 to 10?","solutions":[]},{"symptom":"Unable to login        I tried to login  but system says \" We can't sign in to your account \" . I  asked Tech support executive to resolve unfortunately they went off the screen . I made another Admin account and working . My question is How to get back to original account or get back all my settings from that account to new Admin account ?Thanks","solutions":["Hi Rajesh. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.You did the correct thing which is the only option we have now for a corrupted account. You can browse into the old account from the new one as long as you made it an Admin account. It will show the progress bar as it issues permission for each file and folder until all are available to copy over. The full procedure is here: Create a new Local Admin account in Settings > Accounts > Family & Other People > Other as shown here:http:\/\/www.howtogeek.com\/226540\/how-to-create-a... or here: http:\/\/www.kickiteasy.com\/add-a-new-user-accoun... If necessary enable the built-in Hidden Admin (used only for emergencies) to sign into to do this:https:\/\/www.isumsoft.com\/it\/enable-hidden-admin...https:\/\/www.tenforums.com\/tutorials\/2969-enable...Sign into the new account, test if the problem persists, if not then move your files over, test that all programs work or else reinstall them, then when ready delete the old account in the same place.You can then change it to your Microsoft account if desired: https:\/\/www.tenforums.com\/tutorials\/5375-switch...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thank you Greg  for your response . I have gone over your advice and done accordingly  but still unable to get the data . My primary intension is to get account specific data  not bothered by actual data on my hard drive.I have windows back up USB . Kindly advice ?","Rajesh - What happens when you try to access your data in the old account at C:\\Users? It should show a slow moving progress bar in the address box as it issues permissions for you as an Admin to access the data. When this is completed you should be able to come and go as you please to copy your data over to your new Admin account. The only reason this would not work I can think of is if the account is so corrupted the data is ruined, too. But that is rare. I help people copy their data over from corrupted accounts often here and it always works.If not then you can try to access it from Repair or Boot Mode to copy out to USB using this method:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"how do i turn on s mode in the microsoft store        when I was downloading an app it said it wasn't verified and that I needed to turn off s mode in the Microsoft store so I did so but now I want to turn it back on but not sure how.","solutions":["Hi AmaniIbrahim1, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with your question.Unfortunately, there is no way to reverse the process and go back into S mode without re-installing Windows from scratch.\"Switching out of S mode is one-way. If you switch out of S mode, you'll need to keep using the standard version of Windows 10.\"Source: https:\/\/support.microsoft.com\/en-ca\/help\/402008... If you do intend to restore your system to factory settings with S mode, please ensure you back up all important files and settings before doing so.I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","Hello again, Another advisor, Sumit, has informed me that you may also wish to look to disable the app Installation from Settings, which is something like S mode:https:\/\/www.tenforums.com\/tutorials\/78213-choos...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. -Ashton"]},{"symptom":"emails        im not getting any emails on outlook","solutions":["Go to the Office forum.","Hello gailmorphett, My name is Don, a Windows Independent adviser. Let me try and help you out with this problem.I just wanted to ask some questions to further isolate the issue. Is your computer currently connected to the internet at the moment and that your Microsoft Outlook is not saying \"Disconnected, Working Offline\"?Is your current email service provider working online and does not have any ongoing maintenance at the moment?Have you tried doing any basic troubleshooting steps at your end to try and resolve the issue?","just lost emails in outlook","Hello gailmorphett, Do you mean to say that you are trying to retrieve lost emails from your inbox and are the emails found on the Deleted Items or Trash folder?","no there going somewhere","where do i look for my replies","Hi gailmorphett, When you send an email reply to another email address it goes to the \"Outbox\" folder first and then when it is sent it goes saved to the \"Sent\" folder. Are there any email messages stuck in your Outbox folder?","STILL NOT GETTING EMAILS HOW DO I FIND YOUR REPLY."]},{"symptom":"Why Would Microsoft Give Windows Server 2019 and 2016 for Free?        For some reason, Microsoft gives Windows Server 2016 and 2019 product keys out in Azure. Why would they do such a thing? I thought Microsoft wanted to make money!","solutions":[]},{"symptom":"oxc000000f error code          my computer goes black screen my video card shuts off right before that then blue screen comes up saying    :  Boot Configuration Data lost                File :\\Boot\\BCD error code oxc000000fI have a Cyberpower P.C. I have the windows disk that came with it but I did the free upgrade from Windows 7 to the free 10 home edition I did it online so I don't have a 10 home edition disk my 7 disk won't work. I can do a reinstall but I don't know if I backed up my games correctly and don't want to loose them. what to do?","solutions":["Hi Gordy. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See fixes for the error here first:https:\/\/www.laptopmag.com\/articles\/fix-0xc0000034-error-windows-10https:\/\/windows101tricks.com\/fix-bcd-error-code-0xc000000f-windows-10\/You can reinstall Windows 10 as often as and in any way you want. The latest media is always available in the Media creation tool if needed for repairs or reinsall, here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m...What I'd try first is download the latest ISO file, or create the latest bootable media, then double click ISO to mount it or open media, right click Setup to run the ISO file as a Repair Install. This will solve most problems and bring you to the latest version by the most stable method. If that's not enough to sort out the boot problem then follow the gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...Make sure during the booted install to follow the illustrated steps to delete all partitions down to Unallocated Space to get it cleanest, then click Next to let it auto-create the needed partitions, format them and begin install - this makes it foolproof.______________________________________________Standard Disclaimer:   There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows 10 Night Light Not Working        Hey.For the past month or so I've noticed that Windows Night Light option isn't working. It's grey'd out and not clickable at all.  I'm not sure whether it's related to Windows Update or not, but I'm guessing it is.System:Laptop model: Sager np8153-s (Clevo P650RS-G) Windows 10 Version 1909I've updated Intel onboard graphics drivers.I've updated nVidia graphics drivers.I've deleted 2 registry lines that are connected to night light settings (as Instructed by fix guides).I've recovered to an earlier windows update.My wife also has Windows 10-1909 on a Asus laptop and has no issues whatsoever.I'm lost. Is there a solution? An official Windows fix? Thanks in advance.","solutions":["Please try this >>>>>>>>https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/night-light-not-working-in-windows-10-latest\/015d14ac-6856-4099-bc22-a5f85ee07b0c","Hi Clamant, Sometimes it doesn’t work as intended, however. The most common problem being that it doesn’t turn on at the scheduled time. If you’re having this or another problem with night light, this guide will help you fix it.For further steps on how to solve your concern, please follow this article: https:\/\/win10faq.com\/windows-10-night-light-not...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Fix 3: Disable Fast Startup to Bring Back Night LightStep 1: Find and open Control Panel in the search box, and then find Power Options in the Control Panel page.Step 2: Click on Choose what the power button does.Step 3: Click Change settings that are currently unavailable to go on.Step 4: Uncheck the Turn on fast startup (recommended) box, and then click Save changes.Step 5: Restart your PC.https:\/\/www.partitionwizard.com\/partitionmagic\/win-10-night-light-not-working.htmlThis worked for me after I updated my graphics driver!"]},{"symptom":"Automatic scaling changes for laptop\/tablet combos?        Is it possible to have a laptop\/tablet combo device set to automatically switch display scaling when switching between laptop and tablet modes? For example, having scale set to 100% when in laptop mode, and 150% in tablet mode, but not having to go into settings to switch it all the time.","solutions":["Do not know about automatic change.But instead of goings to Settings just right click the desktop and select Display settings.","Hi Keifer. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.There's no way to do that yet, but If you want to suggest this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback and may interact with you. But Microsoft will not even see it here because this is a tech forums where we are mostly volunteers trying to help solve your problems. If you want to post back a Share link from your completed feedback (see Share link in feedback box) others can vote it up and add to it, and if you have joined the Insider program I can access it to endorse it with my MVP badge and track the issue for you.I hope this helps. Feel free to ask back any questions and keep me posted."]},{"symptom":"Microsoft Password vs Windows Password        I am trying to sign in on another Win 10 PC under Settings>Accounts. It shows I have a local account and I chose the option to sign in with my MS password, which I use for all things Microsoft. Hence, I entered my username\/password (MS) and the dialog box asked me to sign into my computer using my MS account. It then says it needs my Windows password one more time. I assumed it to be the same as my MS password, but it came up incorrect. I didn't even know that I had a Windows password. How do I get over this hurdle? I do not wish to change my MS password if at all possible.","solutions":["When you try to switch from Normal account to Microsoft account it will tell you to enter the current password (windows password) before you change it. If you don't have any password just hit enter. ","Hi Jeff. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.So you're converting the Local Account to a MS Account at Settings > Accounts > Your Info > Sign in to a MS account Instead?If so when it asks for the password one last time, it's asking for your Local Account password. If you don't have one, leave the box blank and Enter.If that fails go into Settings > Accounts > Family & Other People > Other User to sign in there with the MS account which will create a new MS Account. Copy your files over, set it up and then when ready delete the old Local Account.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Disable auto enhance in Photos app        Hi,I'm having some problems with the Photos app as it automatically enhances my RAW photos, which is kind of ridiculous without actually giving me the option to disable it or not. I've searched online and people suggest to simply disable ''Automatically enhance your photos'' in the settings under Viewing and editing, but I do not have that option, as you can see in the screenshot I've attached below. Is there a fix for this?ThanksEdit: I might all add that once opening the RAW photos in the Photos app and after they are auto enhanced they also appear auto enhanced in other image viewing apps, which is completely ludicrous. Only app that displays the images correctly is QuickLook preview.","solutions":["I have the same issue here, after 4 seconds with my Raw picture, it still try to enhance the picture,but as a photographer we dont want to have it enhanced.At least give us the optionto turn off the function.","Any solution as this drives me crazy!!","Why are you using Photos to edit RAW?That's like asking a short-order cook to make a gourmet meal.","I dont but i preview most of them in there and every photo afte few seconds get darker or weird colours","Sorry, my point was\/is: RAW is a professional format, while Photos is for casual amateurs. Photos wasn't designed for RAW so it's not going to work well with it.","Raw is pro format and photos is casual? What is \"photos format\" lol btw you can shoot raw with your phone or drone etc so it does not matter what format you are viewing in photos app. I also have got two other laptops and it is ok in there. I can not figure it out what is different as same windows version and same photo app.","using the photo app to see the raw files is not for editing, is for evaluate them, yes we can use other software like lightroom or any other but sometimes you are in the fly to look any image so you just use the windows app but it never give you a real picture cause it changes the image color and sharpeness"]},{"symptom":"Windows 10 gaming pc wont sleep automatically anymore.        Hey guys, my pc used to sleep automatically and now it doesn't. I have no idea why, I tried every fix I could find online and nothing worked. I tried the multimedia settings fix, and many others. The multimedia settings fix solved my issue for a day then it went back to not auto sleeping. Any help would be appreciated because this is super annoying. I also can force it to sleep but I like not having to do that. My specs are- GPU- Gigabyte Aorus RTX 2080 TI Extreme Waterforce 11 GB (Liquid cooled)RAM- Corsair Vengeance RGB DDR4 16GB 3000 MHzMOBO- MSI Gaming Edge AC Z390CPU- i9-9900k @ 3.60GHzCPU COOLER- Corsair H150i AIO water coolerPSU- EVGA SuperNova P2 850wSTORAGE- 1TB Crucial M2 NVME, 2TB HDD","solutions":["Hi BC. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I will give you all possible fixes for Sleep. If you need help performing any step just ask back:First confirm you have the Sleep options configured correctly as shown here: https:\/\/www.tenforums.com\/tutorials\/2843-change....You might want to try Hibernate to succeed Sleep, or use Hibernate in place of Sleep - it's just a deeper sleep that actually powers off because desktop stored in RAM during sleep is written to hard drive hiberfile then powered off. When it starts up it loads the hiberfile and starts faster. Most Sleep problems are caused by the Display driver, so try updating yours from the PC or Device maker's Support Downloads web page for your full model number, Serial Number or Dell Service tag. While there make sure you have the latest BIOS, Chipset, Network, Sound, USB and all other drivers by comparing those posted for download with the version and date of the corresponding ones in the Device Manager.If that doesn't help then in Device Manager on Display device Driver tab choose Roll back, Uninstall (then restart to reinstall) or try another one previously installed at Device Manager>Display adapter>Driver>Update Driver>Browse>Let me pick.In addition there are steps here to specifically troubleshoot Sleep mode problems:http:\/\/www.makeuseof.com\/tag\/fix-windows-10-sle... What I do is go into Advanced Power options and set Display and Sleep to 1 minutes, Hibernate to 2 minutes, then after completing each step restart the PC and observe what happens for 3 minutes.Also did it previously work? Do you have a System Restore point from when it did?http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t...This may have been caused by Windows Updates. Check which Updates were installed right before the problem began, and if necessary uninstall them from Settings > Update & Security > Windows Update > Installed Update History.You can also try to roll back using System Restore to a point before this began: http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... Then if an Update reinstalls and causes the same problem uninstall or roll it back again, then immediately hide it using the Hide Updates tool from Method Two here:https:\/\/www.askvg.com\/fixing-windows-10-automat... If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1903 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"How Can I Copy My Data from Laptop to External Hard Drive?        Before I send my laptop computer to HP for repairs, I want to copy or back up my data (not programs or system) to my external hard drive which contains plenty of free space.  When I try to copy or drag&drop the Windows\\Users folder, the dialog box specifies fewer files (3500 when I know there are at least 180,000 in \"Users\") and size (402 MB when I know there are at least 11 GB) to be copied.  What should I do in order to be sure I will have copied ALL my precious data to the external HDD?  Is there a better way than copy or drag&drop to copy and preserve my data on my external HDD?","solutions":["Goto c:\/user\/username Select all the folders i.e. Music, pictures, desktops.... Copy\/cut itGoto your external hard drive and paste it. ","Hi Ben. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.The best way is always to sort your files into their User folders (Documents, Pictures, Music, Downloads, Desktop, etc) then copy each User folder to the external.Taking smaller bites like this should prevent it from missing any files. Then right click the Source and Copy folders to open Properties, set them side by side on screen to compare if everything copied.See all ways to copy or move multiple files in Windows 10: https:\/\/www.pcworld.com\/article\/2086566\/the-man...I would also always have a secondary cloud backup. With 11gb files you can use Google Drive backup which lets you sync your User folders to their cloud with 15gb included free. It works great and I wouldn't be without it here as it's saved my bacon several times when Onedrive or external backup failed me. Go here: https:\/\/www.blog.google\/products\/photos\/introdu...https:\/\/www.google.com\/drive\/download\/backup-an...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"ProblemSSSS with FSX Deluxe Edition        Hello,I've been having problems lately to the point where I uninstalled my FSX and re-installed it from scratch. After re-install, I installed SP1. Then when trying to install SP2, the only option I had was to un-install it... the problem is I hadn't installed it yet. So I ran the un-install anyway and then re-installed SP2, successfully. First problem: Throughout all this, I tried to enable the thrust reversers for jet aircraft. I think I remember that it is \"F2   throttle (decrease quickly)\"That didn't work well. It did on the very first attempt to use the reversers. Beyond that, the cones (A-321) hesitate to deploy, and vibrate. Beyond that, no reversers are available. So, thinking that my joystick (Logitech Extreme 3D Pro) was failing, I tried a different button assignment and the F2 key itself. Still no response. Then I remembered the SP2 problem. That is when I went along with the SP2 un-install and re-install. After this, the first attempt at using the reversers worked perfectly well. But subsequent attempts failed. No reversers. Second problem: The throttle levers shake at any setting, but the engines run fine  on MS planes like the A-321. I never had that problem before.The main reason why I un-installed FSX to begin with was a problem with and add-on, a gorgeous Il-76. When pulling the stick, the elevators didn't budge and the rudder turned instead. When twisting the stick, then the elevators worked, but not the rudder. On the Fly-Away website, there is no mention of this problem, except my own as yet unanswered question. On another plane, an An-124, pushing the throttle caused engine no. 2 to respond, ONLY. I have re-installed the An-124 and the throttles now work well, except for the shaking. The Ilyushin was the last one installed. But the other problems developed over that past couple of weeks. Before that, I had thrust reversers, and no aircraft gave signs of having Parkinson's Disease.Can someone please restore my sanity? Everything was fine until maybe 2 ~ 3 weeks ago. Then the problems started. There have been no changes to my PC for quite a while... One would think that a fresh install would fix such issues.Thanks,John","solutions":["😭  🙏Well, that is good news indeed.   Let’s hope that it stays that way – at least you have a clean slate to work with for the future.   Though, I’m still concerned with the Airbus and maybe your third party add ons.   Anyway, all the best with it and for this year John.   Thanks for letting us know the outcome.Chris"]},{"symptom":"Program will no longer load        I have Windows 10.  I've been using a software entitled QuiltPro for years.  I've upgraded every time one is offered.  My program worked fine until just recently.  Now it simply will not open.  I've uninstalled and reinstalled several times, but to no avail.  The QuiltPro technical support suggests that it is a Windows 10 problem.  I've updated Windows every time an update is offered.  What am I doing wrong?","solutions":["Any 3rd party anti virus, security, cleanup programs ever installed on the computer?.What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK","I have a Norton paide subscription, free Malwarebytes, freeCCleanerMy OS build is 18363.535Thanks for any advice you can give.","Norton is not needed.  Go to Norton and get their removal software.  Programs and features uninstall does not remove all the code.Remove CCleaner also.","Thank you so much.  I am hesitant to remove Norton, but I will remove CCleaner and Malwarebytes.","Hi pegmrow My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.According to the QuiltPro website and system requirements it is compatible with Windows 10.Do you receive any errors messages when opening the program? Try right-clicking the program's executable file and choosing run as administrator.Hope this helps.","Keep Malwarebytes.  Get rid of Norton.","No error messages.  When I click on the program, the curser spins for a couple of seconds and then stops.  I tried loading as Administrator from the executable file, but same response.  Very frustrating.","Method 1. Try the Windows' Program Compatibility Troubleshooter 1. In the taskbar search box, enter run programs, then click \"Run programs made for previous versions of Windows.\"2. Click Next and the troubleshooter will try to detect potential issues with your apps.3. Select the app that's having issues in the next window and click Next. 4. Select a troubleshooting option: use the recommended compatibility setting or choose compatibility settings yourself.If you choose to use the recommended settings, the troubleshooter will test the app using a previous version of Windows so you can see if that resolves the issue.If you choose the choose to troubleshoot the app, the troubleshooter will ask you which problems you're experiencing. Depending on your selection, the troubleshooter will offer tests and suggestions to resolve the problem, such as testing the display settings for the app. 5. Click the Test the program button and then click Next. You can then either choose to save the settings for the app, try different settings, or report the problem to Microsoft and view help articles online.Method 2. How to Run an App in Compatibility Mode Alternatively, you can go into a app's properties to change its compatibility mode settings. With compatibility mode, you can force an app to use settings from an earlier version of Windows -- helpful if you know the app ran well in, say, Windows 7 or Vista. You can also change the display and colour settings for the app. 1. Right-click on an app and select Properties. You can do this from the app's shortcut or by navigating in File Browser to the EXE file.2. Select the Compatibility tab, then check the box next to \"Run this program in compatibility mode for:\"3. Select the version of Windows to use for your app's settings in the dropdown box.4. Hit Apply, then run your app and see if this fixed your issues.","Thank you for the response.  While either one should have worked, they did not.  I tried numerous times.  So frustrating!!Following is I see the program really appears the program is on my computer.  I've uninstalled and installed again twice.  Nothing.The program worked on this computer in the current Windows 10 as recent as November.  However, when I tried to open it a week or so ago, I had this problem.  I read in some blog that one of the recent upgrades was causing havoc with some programs.  Could this be the case?-Peg","I’ve found this on the QuiltPro website which may be worth checking.https:\/\/support.electricquilt.com\/articles\/prob...I’d also recommend contacting Quilt Pro support."]},{"symptom":"Lost file        I downloaded a form from a web site , completed half of it and then saved it.  When I click on the file name I gave it in my recent saved files menu it says file cannot be found so where is it likely to be","solutions":["I had similar problem for large file download.  My default is at \"Download Folder\".  \"View Download\" will normally show the status of half downloaded files that \"cannot be Opened\".  And the file format .xxx differs.  It could be that you have just \"Copied\" from a Cloud Folder, ... where only the \"File Structure\" will come over but not the files proper. Though \"complete\" may similarly appear. "]},{"symptom":"Windows update can't install update after check        Dear Sir or Madam,I have problem with my server that can't install update from WSUS Server.This problem is.I have an exchange server and WSUS Server. when I click Check for updates in Exchange server the server didn't get any new update from WSUS server and it always show the36 important updates are available but those are very old and can't be installed. ","solutions":["Hi,Server and IT Pro questions are best handled on our sister Site Technet as this is only a Windows consumer only forum:https:\/\/social.technet.microsoft.com\/ForumsPlease choose the most appropriate category on Technet forums from the left.","Hi Sumi,Thank your link "]},{"symptom":"Documents not showing up after restore in the Quick Access Folders        I just restored a back-up from older Surface Laptop 1 to a new Surface Laptop 2, but none of the documents are showing up in the quick access \"Documents\" folder.I can find the restored documents under \"Local Disk (C:) > Users > MyName > Documents\", but this is a long way to access these documents.Is there a way to fix it?","solutions":["You probably moved your library folders at some stage. What is the full path to your \"Documents\" library?","Hi AToor When you restored WIndows, you would have wiped the Quick Access Cache (basically a list of recent items)It is only when you open those documents again that they will be added to the Quick Access sectionA quick way of doing this is if those documents are in a specific folder, right click that folder and choose 'Pin to Quick Access' . . .","This PC > Local Disk (C:) > Users > MyName > Documents\"","I am still having some issues where two of the folders under \"ThisPC\" are mapped to my OneDrive folders.These folders are (1) Documents (2) Pictures. (see the attached image and the cloud symbol next to these folders).When I right-click on the folder and \"Properties\" and \"Location\" and click \"Restore Default\" and \"Apply\", I get this message:When I click on \"Yes\", I get this error message:If I click \"No\" and then OK, I get the same message:Essentially, I am unable to change the location of this folder.Can this be addressed to change the location to default folders on my computer?Thanks.","You probably moved your library folders at some stage. What is the full path to your \"Documents\" library?Please see more details in my new post below."]}]}