{"windows":[{"symptom":"Windows 10 updates        I'm new to 10.  Why do Windows 10 updates take so long to download and install? It was a much easier and quicker interface in 7 Pro!","solutions":["Hi John Windows 10 does up date a lot and updates come in many forms, there are security updates, like you would have seen in in Windows 7 and they generally come down in seconds. Then there are cumulative updates (300MB - 800MM Approx.) released mostly on the second Tuesday of each month (patch Tuesday) and then there are Feature updates, those are released twice a year, generally in April and October, those can be up to 4.5GB of a download","Actually, most updates install quickly. However, the semi-annual \"feature updates\" are actually new versions of Windows 10, so you would compare them timewise to upgrading from Windows 7 to Windows 8, or Windows 8 to Windows 10.Moreover, since feature updates are cumulative, if your computer updated to v1909 from something earlier than v1903, updating could take quite a while.","Thanks for reply. At least I have 35-40mb download speed!","Thanks for reply."]},{"symptom":"0x80242016 after installing the Windows 10 updates. Help...        Hello , fellas.so, after reboot from installing Windows 10 v1809 December quality updates, Windows shows me this error code in update history and it says installing failed. But if I check the installed updates in control panel, this update is already there. Plus after the error, when I click check for updates button, it runs normally without any problems, it even installed several definition updates for windows defender. But that quality updates never shown, How weird.I did a little bit research, looks like 0x80242016 stands for WU_E_UH_POSTREBOOTUNEXPECTEDSTATE The state of the update after its post-reboot operation has completed is unexpectedly.which confusing me even more, I just did a completely clean install windows 10 and checking the updates is the 2nd move for me after windows install the drives automatically. How possibly could It be error. To make sure the healthy environment, I run the troubleshooter for Windows update, checked the disk [chkdsk], quick scan using windows defender, browsing the web like about 2 hours. All pretty smooth and normally. No fatal error, No reboot forcibly, No BSOD. Performance looking great.So...Since this is not my personal device. I want to make 100% sure that this is not a problem, at least doesn't have any bad influence to the future.What do you think in this situation about this error code?edit:  forgot to say, winver and system --- about in settings app shows me 18363.535 which is the build number after December quality updates.","solutions":["Hi GhostFairy My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Click on Start button and type cmd right click on the result command prompt and run as administrator Answer Yes to any prompts and enter the following commands followed by enter dism \/online \/cleanup-image \/scanhealth dism \/online \/cleanup-image \/checkhealth dism \/online \/cleanup-image \/restorehealth net stop wuauserv net stop cryptSvc net stop bits net stop msiserver net start wuauserv net start cryptSvc net start bits net start msiserver Then, execute the Windows update troubleshoot: https:\/\/support.microsoft.com\/en-us\/help\/402732...Hope this helps."]},{"symptom":"Webcam not working after windows update.        My computer recently updated windows 10 and since then my webcam will not work, when I try to use it the screen is blurred out with cam picture that has a line through it. What can I do to fix this? So irritating since I didn't really have a choice to update. Jennifer","solutions":["Hi Jennifer. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you all possible fixes that are working for others for webcam problems. If you need help performing any steps I am standing by to help.1) Try resetting the Camera app at Settings > Apps > Apps & Features > Camera > Advanced Options.2) Did you enable the Privacy setting to allow apps to use your webcam? https:\/\/privacy.microsoft.com\/windows-10-camera...https:\/\/www.lifewire.com\/fix-windows-10-webcam-...3) Try also these steps for when webcam isn't working: https:\/\/support.microsoft.com\/en-us\/help\/13753\/...https:\/\/www.lifewire.com\/fix-windows-10-webcam-...https:\/\/www.kapilarya.com\/something-went-wrong-...https:\/\/support.microsoft.com\/en-us\/help\/13753\/...4) Try Updating the webcam driver from the PC or webcam maker's Support Downloads web page for your full model number, Serial Number, or Dell Service Tag number from sticker on PC.Also compare all other drivers including Chipset, display, sound, etc to make sure you have the latest on the PC maker's Support Downloads web page.Additionally on Webcam Driver tab see if Roll Back is available, if not try Update Driver, first Automatically, then Browse, then Let Me Pick to try all previously installed Drivers.If these fail try to Uninstall the Driver, restart PC to reinstall. 5) If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool explained here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... 6) If this was caused by a Version Update then you can roll it in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool explained here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... 7) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. 8) If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... If there are any hurdles during install then these steps can overcome them: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Can’t turn airplane mode off, WiFi on.        While on my laptop on my home wifi my cat walked across my keyboard and somehow put me into airplane mode. Now I can’t get out of airplane mode or turn wifi on. When I try to turn wifi on I get a message “No Wi-Fi Networks Found”. I know the network is available, my phone is connected. ","solutions":["Hi RandyS99 I did a bit of digging, on the print screen key (PrnScr) to the right f the function keys on your laptop do you see a network icon?If so, press Fn + Prn Scr, if that does not work, try Alt + Prn Scr Again if the above does not work, please let me know . . . ."]},{"symptom":"Would I lose all data if I remove Microsoft account from Windows 10 login?        I mistakenly added my corporate account as Microsoft account on Windows 10. When I went to remove Microsoft account I got message it is going to remove all the data.I would like to switch back to using local user account. How can I accomplish this without losing my data.","solutions":["Go to Settings > Accounts and select Sign in with local account instead. This should get you back to using a local account but you need to look at things like Mail and Store to see if they are using you corporate account details, if so sign out individually.","Hi jackin Open the Settings App Go to Accounts - Sign-in Options Choose to sign in with a local account (in newer versions of Windows 10, this might be on the Your Info Settings Page) Enter your old password and either set a new password or leave the new password box blankClose the Settings App","Would it have all the data ( Excel, Word PDF files ) that I created while logging in with Microsoft account?","Hi jackin Rest assured, switching to a local account using the above method will not touch your data . . .","Thank you sir.One more question I does not create new user profile on Windows I will still have my same desktop etc folders, correct.Sorry I'm asking too many questions.","Hi jackin No problem, ask as many questions as you need to . . . No, a new user profile is not created, your Desktop . . etc. will remain the same, all that process does is change the login type on that user profile . ..","Hi jackin No problem, ask as many questions as you need to . . . No, a new user profile is not created, your Desktop . . etc. will remain the same, all that process does is change the login type on that user profile . ..Thanks"]},{"symptom":"Airpods pro connectivity to Surface Book 2        I can't connect my airpods pro headphones to my SB2. Any suggestions?Thanks.","solutions":["Hi Joanne. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See troubleshooting steps for connecting airpods to Surface here: https:\/\/www.lifewire.com\/how-to-connect-airpods...https:\/\/www.iphonefaq.org\/archives\/976177https:\/\/www.windowscentral.com\/how-pair-apple-a...https:\/\/www.thewindowsclub.com\/airpods-keeps-di...https:\/\/support.microsoft.com\/en-us\/help\/14169\/...If these do not work you can contact AirPods Support which is included for the first year under the included repair and replacement warranty from Apple. See here:https:\/\/support.apple.com\/airpodsI hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"permission        I wanted to copy files from my CD to my laptop, I cant do that because of some administrator permission is required.and why is that?","solutions":["Hello Danielprudence, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemwhere are you trying to copy the files to? Try creating a new folder in C and named Temp, and copy the files there. post a screenshot if any error occurFeel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolvedCheers! Farah"]},{"symptom":"Hidden content in folder user        The folder C:\/users\/thyge has grown to 54GB _ something is hidden, but what and how can I get to it?","solutions":["Hi Thyge Do you backup anything like an iPhone to your PC? Windows Explorer is useless when it comes to working out where your hard drive space is being used . . .Click the link below to download a small free utility called Treesize. Using that tool, you will instantly see where this space is being usedhttps:\/\/www.jam-software.com\/treesize_free\/Use TreeSize to dig down to find that missing data, if you have any trouble working that out, please provide ascreenshot of what you find andwe can work on that . . .________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thanks for this excellent program. It was my Audials 2020 Premium that cached all the music i had ripped from Spotify - showed up im appdata. Now I need an easy \/ automatic purge of that cache.yous","Hi Thyge, Glad to Help!"]},{"symptom":"Microsoft interrupts work on Windows 10  PC by film ads        Working on a local program on my Windows 10 PC my work was interrupted by a voice and display message advertising a filmsaying \"I found this for you\".  I found no way to turn off the intrusive screen image except by restarting the PC.How can I prevent this from happening?","solutions":["Hello Clawinus, Where you accessing any websites at the time? It could have been an advertisement popup from whatever website you were on. You can find adblockers in the microsoft store to help with this issue.","The advertisements do not come from Microsoft.If you are seeing the advertisements in a web browser window, install an ad blocker likeAdblock Plus.If you are seeing the advertisements even when your browser is closed, then you unwittingly installed adware on your computer. The first step in removing adware is to scan your computer with your antivirus software .","The advertisements do not come from Microsoft.If you are seeing the advertisements in a web browser window, install an ad blocker likeAdblock Plus.If you are seeing the advertisements even when your browser is closed, then you unwittingly installed adware on your computer. The first step in removing adware is to scan your computer with your antivirus software .My browser was not active when the ad appeared, but File Explorer was. I suspect that File Explorer lets synch connections appear.Among the File Explorer Options I have now inactivated \"Show Sync Provider Notifications\". I will see if that does help."]},{"symptom":"BSoD REFERENCE_BY_POINTER & SYSTEM_SERVICE_EXCEPTION        Hello,Recently I've been getting quite a lot of bluescreens while playing games and it has become quite a problem for me.  Since I'm not really experienced with software issues, I'd like to ask for help with this one.Basically while playing a game it will freeze from time to time and stutter until a certain point where i reach a bluescreen. I've used BlueScreenView to see what's causing the issue and I've gathered information about these 4 BSoD's:1st - REFERENCE_BY_POINTER caused by driver: ntoskrnl.exe (bug check code 0x00000018)2nd - SYSTEM_SERVICE_EXCEPTION caused by driver: ntoskrnl.exeand dxgkrnl.sys (0x0000003b)3rd - SYSTEM_SERVICE_EXCEPTION caused by driver: ntoskrnl.exeand win32kfull.sys (0x0000003b)4th - REFERENCE_BY_POINTER caused by driver: ntoskrnl.exe (0x00000018)If there is a need of sending the dumps, please tell me and i will try my best to deliver them.My question is, is there any solution to the following bluescreens?Thank you in advance.","solutions":["Hi empathicc, I would suspect your video card device driver, however, to diagnose the underlying issue, I need to analyse your Mini-dump file(s):Open Windows File Explorer Navigate to C:\\Windows\\Minidump Copy any minidump files onto your Desktop, then zip those up Upload the zip file to the Cloud (OneDrive, DropBox . . . etc.), then choose to share those and get a share linkThen post the link here to the zip file, so we can take a look for you . . .","here are the dumps: https:\/\/1drv.ms\/u\/s!AkMkT75lVYmGvXt3JEaW7UGjy_4b?e=54ZWzc","Hello empathicc, I am Andrew an independent advisor. Thank you for the dump files. To solve this BSOD problem I suggest updating your video card drivers via the vendors web site.In case it is another driver we cannot point out please run these scans to be sure we cover all possible causes.In the search bar, type cmd. Right-click on cmd.exe and select Run as Administrator. Type SFC \/scannow and press the Enter key.Re-enter Command Prompt as Administrator and run these:dism.exe \/online \/cleanup-image \/scanhealthdism.exe \/online \/cleanup-image \/restorehealthdism.exe \/online \/cleanup-image \/startcomponentcleanupIf you have updated your drivers, ran these scans and still have this issue please let us know.Take Care,Andrew"]},{"symptom":"Bug in Windows Server 2016 - SPNEGO        Hi,Can someone advise how I should best raise a potential bug in Windows Server 2016 with Microsoft?I maintain an open source library that integrates with kerberos. Some users have reported some strange behaviour when using Windows Server 2016 as a domain controller (not seen when using earlier versions of Windows Server or other KDCs). It seems that Windows Server 2016 is no longer adhering to part of the SPNEGO RFC specification. Specifically, RFC4178 which states that the initial negotiation message can optionally contain the initial mechanism token for the preferred mechanism of the client. We have been able to establish that Windows Server 2016 is either using the OIDs for LegacyKRB5 and KRB5 interchangeably or it is not ordering the mech type list in the negotiation token in order of preference, such that the first item in the list may not be the preferred type that has been proactively included in the initial negotiation token.For more information please see: https:\/\/github.com\/jcmturner\/gokrb5\/issues\/278Thanks!","solutions":["Hi JCM I am sorry, Community is just a consumer forum, due to the scope of your question (Server 2016) can you please post this question to our sister forum on TechNet in the Server 2016 section (linked below)Over there you will have access to a host of Server 2016 experts and will get a knowledgeable and quick answer to this question . ..https:\/\/social.technet.microsoft.com\/Forums\/en-..."]},{"symptom":"Windows 10 Hard Drive Recovery Software        Hello everyone! Yesterday I reset my computer because of some problems, and I was wishing to recover all my previous settings prior to the event, does anyone know a good hard drive recovery software that are reasonably priced and will help me with my current situation? Here's a a link to my previous question relating to the problem that I am currently experienceing:https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/windows-10-reset-restore-settings\/3ccd573a-dea4-4b88-b7d9-42629a3ff848","solutions":["Hi SX. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Recovery software is not what you need, as it's for rescuiing files that were left behind and lost. Plus it does not work if the drive was formatted over as a Reset does. Do you have files that were lost because they were not properly backed up first before the Reset you did? If not then let's take another approach. I would abandon the Reset which is an inferior install because it does not wipe the drive to get it cleanest. Instead do the gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... To create bootable Windows 10 Installation Media (on another PC if necessary) install Media Creation Tool and follow the directions in the middle of the download page here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key for your PC maker given in this chart:https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, then on second screen choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, select the Unallocated Space, click Next to let it create and format the needed partitions and start install - this makes it foolproof.You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC because you will learn everything that works best and how to apply it with your own hands.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows 10 Reset & Restore Settings        Hello everyone! So I was having problems with something so I had to reset my windows using the media software. So I made a backup drive and reset the it. After it was over some of the softwares and shortcuts were messed up, and the settings were reset as well. I was wondering if I could restore the previous settings before the reset using my backup drive, I did try it twice but it just seemed to restore my personal files, which I already chose to kept before the reset. Thank you!","solutions":["Hi SplustX, Unfortunately after a reset it is not possible to restore from a restore point. What I suggest is that if the reset didn't go well to do a clean install:https:\/\/answers.microsoft.com\/en-us\/insider\/for...I'm really sorry this happened; however, this is the best way forward.","So does that mean it's impossible to do it even with the backup drive?","Do you have one of the restore points on your backup drive? This should be possibleWhen you go to Start > type in Control Panel > click System icon Go to Advanced system settings on the left Click system protection tab Then click System restore - do you see one of the old ones in there?","Sadly, I don't see any... Is it possible to take it to a hardware store to restore my data?","That would be a significant cost, I will open this up to other experts to see if they can see something I did not. Another option is to use a third-party data recovery tool.","I guess that will be my remaining option... Thank you for the kind and quick replies!","Hi SplustX I'll try to help you on this issue. If I understand well, you made a reset, using the embedded tool in Windows, while keeping your personal files.But some softwares and some settings were messed up. Here is my thoughts : - If you tried multiple times to rewrite your disk (while resetting windows), don't bother to bring it to a store. As you need a complete file in order to recover it, you'll only get a corrupted one. Un-usable.- You can try to recover the drive by yourself, using a specific software, but you'll get thousands of thousands of files, and you'll have to sort them out, between corrupted ones, temporary ones and so on.If you can set again your settings, then do so. If something is wrong with your current Windows, reset it using a fresh copy of windows, using this tool (select \"download tool now) :https:\/\/www.microsoft.com\/en-us\/software-downlo...My best advice would be to save your files, and go for a clean install of windows.Regards Jay","Thank you for the advice Jay, I greatly appreciate your concerns! Do you reckon a third party recovery software would help me out with my situation? Or will it just return corrupted files as you said?","You can try with Recuva for example. The problem here is, on a hard drive with windows, there is thousands of thousands of files written every day. You access a website, it saves every pictures on your hard drive.You'll then return infinite number of various files. Also, be aware that it will take a long time (several hours, if not days, depending of the size of the disk), you shouldn't be using the drive before using the recovery software. As each file written on the disk is erasing something else that was here before."]},{"symptom":"Movie Maker glitch        My project looks great when editing and previewing. Everytime I save it in any format there are glitches\/green screens throughout the whole project. How can I save it so it doesnt do this?!","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please choose a lower resolution and try to save the Video and check if the same issue is appearing or not.","Windows OS has other Encoders to use\/edit configure Video-Audio...The simple  Windows Media Creator 9series.Download the encoder & its add-ons thru Microsoft download center,the Windows Catalog has security patches (1 or2) only..Once encoder is installed\/open\/set to Stream-Capture-or reconfigure to other formats..This encoder allows sound in,thru youre pc 1\/8 input jack on pc panel..Even if you still run Movie Maker,the encoder can convert it.Plus,Windows Media Player  &  Media center are all compatable..If Microsoft\/download center has no results but add-ons,use youre web browser to locate.https:\/\/social.technet.microsoft.com\/Search\/en-US?query=windows%2010%20movie%20maker&ac=5Use the Microsoft\/TechNet link above for help,looks as though movie maker is discontinued,1st line"]},{"symptom":"Windows Activation wont activate windows and troubleshooter not working        Hello,I tried to update my copy of windows home to windows pro using my old laptop serial but although it installed\/updated it would not Activate it. I ran the trouble shooter and its telling me it could not activate at this time and it can not connect to the internet. I could not find the windows serial that came preinstalled with the laptop so tried a factory reset install. The reset went well besides the serial is still the same and hasnt reverted back. Ive contacted Acer to see if they have it and maybe as I registered this device with microsoft they have it somewhere? Anyway while i wait i also have to get the troubleshooter working and a way to activate the serial as at the moment its telling me it cant connect to the internet even though its a fresh install of windows , factory reset, and no firewall is blocking it. The internet is otherwise working fine, i can update windows and browse etcAll help appreciated","solutions":["So currently it shows Windows 10 Enterprise, is this correct. This is a known issue when trying to upgrade to Windows 10 Pro and as previously quoted inputting the default Pro key should switch to Pro edition.VK7JG-NPHTM-C97JM-9MPGT-3V66T enter this in Settings > Update and security select Activation and Change product key. Does windows now show Windows 10 Pro. You can check what is shown under Activation but you may need to come out and go back in to refresh it or type winver in Search and select the top result.If it still shows Enterprise then you may have to clean install Windows 10 to return to Home edition (which should activate automatically, using the OEM embedded licence) you will need bootable media from Microsofthttp:\/\/www.microsoft.com\/en-us\/software-download\/windows10 download the tool and run it once downloaded run it. You will need a 8GB flash drive to create bootable media."]},{"symptom":"High CPU usage ONLY on Microsoft Xbox PC games, (xbox pass for PC beta)        Hello, I am in a very frustrating situation where I cannot play any of the xbox pc games I have from the xbox pass for pc because of insanely high CPU usage. The CPU is being used from 99 to 100% for Gears of War 5 or Halo MCC or any of the Microsoft games. I never have this issue playing games on steam, origin, uplay or epic launcher ONLY on microsoft games. I really like these games and would like to be able to continue playing them but right now the CPU load usage is causing stuttering and making the games unplayable. My specs are as followsWindows 10, 64 bitProcessor    Intel(R) Core(TM) i5-6600K CPU @ 3.50GHz, 3501 Mhz, 4 Core(s), 4 Logical Processor(s)16 GB RamGPU: Radeon r9 390BIOS Version\/Date    American Megatrends Inc. 0803, 9\/24\/2015BaseBoard Manufacturer    ASUSTeK COMPUTER INC.BaseBoard Product    Z170 PRO GAMINGBaseBoard Version    Rev X.0x","solutions":["I got the Same Problems... "]},{"symptom":"Play a sound when charger is connected        I want my laptop to play a sound when I connect a charger to it. How can I do that?","solutions":["Another expert made me a suggestion (thank you to him) he quoted me this \"\" That event will not be generated when the laptop is connected or disconnected from the mains, that just generates when a peripheral device like a USB device is connected \"\"So I was wrong I will let others with better knowledge on this subject help you :) happy new year!"]},{"symptom":"OfficeOrder#9197535914        Want to change to Personal","solutions":["You have responses on your other post."]},{"symptom":"Windows Activation Client        Anyone ever heard of a Windows Activation Client? I have been bothered with the constant presence of this rude, intrusive item, but cannot get rid of it, no matter how I try. It's there; but not there. It even has a placeon my notifications control with icons. It states, \"Your 7601 build of Windows is not Genuine. Go resolve this by registering a new package.\"When I click the link, it goes nowhere. ...?!Just Sayin...   Thank You,Rob","solutions":[]},{"symptom":"Screen keeps locking after 1 Minute        I had updated windows 10 in November for the November update and since then, after 1 minute of inactivity the screen would turn off then when I do something it would just show up on the lock screen. These are the current settings for my power plan. How could I fix this? It is really annoying!","solutions":["Hi SukhpalGosal. I'm Reinald, an Independent advisor and a Windows user like you.I appreciate you for providing details about the issue and we are happy to help you.You can try the solutions below to fix your issue: Solution 1: Kindly try to run the Power troubleshooter to diagnose the exact issue. Here are the steps:a. Press Windows Key and search for \"troubleshoot settings\" b. Scroll down and look for \"Power\" c. Click \"Run the troubleshooter\" d. Wait for the troubleshooter to finish and just follow the instructions. e. Restart your computer then check if you're still experiencing the issue Solution 2: Restore power plan settings to default You can also try try restore the power plan settings to default. a. Press Windows Key and search for \"power plan\" b. Select \"Edit Power Plan\" c. Select \"Restore Default Settings for this plan\" d. Select \"Yes\" and save the changes. Solution 3: a. Press Windows Key + R to open \"RUN\". Type regedit click OK or just press Enterb. In the left pane, Go to this path: HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Power\\PowerSettings\\238C9FA8-0AAD-41ED-83F4-97BE242C8F20\\7bc4a2f9-d8fc-4469-b07b-33eb785aaca0c. In the right side, double-click the Attributes DWORD and change the Value data to 2 and click OK to save.d. Click Start (Windows logo) and search for \"Power and Sleep Settings\". e. Scroll down and look for Related Settings. Just below it, click Additional power settings and the power plan window will open.f. Click \"Change Plan Settings\" on your current power plan. g. Click \"Change Advanced Power Settings\". h. Look for \"Sleep\" and expand it by clicking + symbol. i. Expand (+) System unattended sleep timeout and change the value from 2 to 20 minutes.After doing the steps above, save it and check if the problem is resolved. I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.","I have done all of the 3 different solutions, but the problem still persists.","Have you tried Settings, System, Power & sleep?","Yes, I have done that the settings for sleep are shown in the 3rd picture attached.","That is from the Control Panel.What I have asked does not go to the Control Panel but through Settings which is the new Windows 10 process.","It has the same values","Can you also double-check your screen timeout settings? Right on desktop > Select \"Personalize > Select \"Lock screen on the left pane\" Scroll down and look for \"Screen Timeout Settings\" and \"Screensaver\" settings Check your settings and make sure that it doesn't sleep or time-out too fast","I have turned off the screen saver set to \"none\"","How was it? Do you still have issues with screen timing out after a minute?","Sadly, yes"]}]}