{"windows":[{"symptom":"MS Store defaults to wrong Country        So, now that MS has abandoned Windows Mobile 10, we've all put our money into another phone platform.In my case - an iPhone.In order to be able to view my iPhone photos on my Windows 10 Home desktop, I need to download the Microsoft HEVC Video Extension at a cost of $0.99.When I click on \"Buy\" and verify my identity, I am redirected by the MS Store to a shell in which I am prompted to \"Add Profile Address\" (even though my address is already in my Microsoft Account profile information.When I click on the \"Add Profile Address\" it comes up with the format for a USA address.  The \"Country\/Region\" is set for United States and is greyed out.  I cannot change it to my country.Where is it picking up that I'm in the USA?  My machine and my MS Account both have another country identified as my location.Thank you for any suggestions you may have.B.","solutions":["Hi B. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See here how to change the country and region in Microsoft Store app: https:\/\/support.microsoft.com\/en-us\/help\/403926...Let me now if this helps."]},{"symptom":"Blue screen with winload.efi error after multi-boot black OS selection screen Windows 10        I added a new M2 drive to my computer that uses multi-boot (all Windows 10 on the drives).  When I choose to boot from the new drive, I get a blue screen saying that something couldn't load and a path points to winload.efi.  A strange thing is that if I go into repair mode and then choose Other operating system and this drive, it works fine.  I have been trying to fix the boot record with bootrec commands using the safe mode command prompt, but the bootrec \/fixboot command always gives an access denied error.  Bootrec \/fixmbr seems to work.  I think that this is a symptom of the problem.  I think that there is a problem with my boot record.  All of the other drives boot fine from the OS selection screen.  I have reinstalled Windows on the new drive, but it didn't resolve the problem.  I have secure boot disabled and set to work with legacy and UEFI.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I appreciate the efforts taken by you in resolving this issue. I understand that you receive a Blue Screen error on your computer. I’ll help you with this issue. However, please let us know: What is the complete error message you receive?What is the make and model of the computer that you are using? As you have already tried disabling Secure Boot and using the Bootrec commands to fix MBR, I would suggest you to refer the steps mentioned below and see if that helps. Disable early launch anti-malware protection: I would suggest you to try disabling anti-malware protection and see if that helps. Refer the steps mentioned below: Create a bootable media and boot the PC using the media.On the initial setup screen, select the language and otherpreferences and click on Next. (If you don't see the setup screen, your PC might not be set up to boot from a drive. Check your PC manufacturer's website for info on how to change your PC's boot order, and then try again.)Now, click on Repair your computer.On the System Recovery Options screen, selectTroubleshoot> Advanced options > Startup Settings >Restart.On the Startup Settings screen, press8 or F8 to select Disable early launch anti-malware protection. Rebuild BCD: You can try rebuilding the BCD file manually and see if the PC boots fine. Create a bootable media and boot the PC using the media.On the initial setup screen, select the language and otherpreferences and click on Next. (If you don't see the setup screen, your PC might not be set up to boot from a drive. Check your PC manufacturer's website for info on how to change your PC's boot order, and then try again.)Now, click on Repair your computer.On the System Recovery Options screen, selectTroubleshoot> Advanced options > Command Prompt.Now type in the commands and hit enter: BOOTREC \/FIXMBRBOOTREC \/FIXBOOTBOOTREC \/scanosBOOTREC \/rebuildbcdRestart the PC. Rebuild BCD Store: I would suggest you to export and delete the BCD store and rebuild the BCD store. Refer the steps mentioned below: Create a bootable media and boot the PC using the media.On the initial setup screen, select the language and otherpreferences and click on Next. (If you don't see the setup screen, your PC might not be set up to boot from a drive. Check your PC manufacturer's website for info on how to change your PC's boot order, and then try again.)Now, click on Repair your computer.On the System Recovery Options screen, selectTroubleshoot> Advanced options > Command Prompt.Now type in the commands and hit enter:bcdedit \/export C:\\BCD_Backupc:cd bootattrib bcd -s -h –rren c:\\boot\\bcd bcd.oldbootrec \/RebuildBcd Let us know how it goes. Regards,Nikhar KhareMicrosoft Community - Moderator","Two different errors:The application or operating system couldn't be loaded because a required file is missing or contains errorsFile \\windows\\system32\\winload.efiError code 0xc0000454A required device isn't connected or can't be accessedError code 0xc000000fDisable early launch anti-malware protection:  No observable effect.  Just caused laptop to rebootRebuild BCD:  Bootrec \/fixboot still doesn't work (access denied)Rebuild BCD Store:  Only the 128MB M2 drive (original drive that came with the laptop) has a boot directory.  I tried to follow the steps, but there is no bcd sub directory.  bootrect \/rebuildbcd ran but I didn't see any differenceMSI GT72S 6QE with original 128GB M2 drive and 1TB HD, previously added 1TB 2.5\" SSD, and new 1TB M2 drive.  All have Windows 10 installed for multiboot.  If I can get the 1TB M2 to boot properly, I will replace the 1TB HD with a 2 TB HD for data storage.  The 1TB HD currently has my games, which I want to install on the 1TB M2 drive.Tonight I noticed that every once in a while, the 1TB M2 drive will boot properly from the black OS screen after a reboot.  Every time from a cold boot and most of the time from a reboot, there will be the blue screen when trying to boot from the M2 drive and I have to go into recovery and select other operating system and select this drive and then it'll boot.  The frustrating part is this takes quite a bit of time.  I haven't encountered any problems running from the new M2 drive once I've successfully booted from it.  I'm sure there must be a way to get this resolved but nothing that I have tried has solved the problem and I can't get around the access denied problem when using \/fixboot"]},{"symptom":"Unlinking an account from Old Laptop        I Returned my laptop to Amazon and forgot to remove my info Is there a way I can unlink the account without the laptop?","solutions":["Hi Conndog. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.The only thing you can do now is abandon the MS account after moving your files out of it's OneDrive account to a brand new account.But I wouldn't worry about it because they usually don't even start it before they wipe the drive and apply the factory image or do a deep Reset.In the future do the deep Reset or at least change the MS Account to a Local Account in Settings > Accounts > Your Info > Sign in with a Local Account instead."]},{"symptom":"Minecraft Windows edition        I have Minecraft for my Xbox live account (xl lord konze) and for my pc (dboy1596). When i try to sign into my account on pc. (The Dboy1596 account, that i have redeemed on windows) it keeps signing me into my Xbox live account. I just bought a realm and have bin trying to fix this for over a day now. how do i resolve this?","solutions":["Hi Dboy. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Are you signing into apps individually or do you use a Microsoft Account to sign into Windows 10? Sometimes signing in to individual apps like Xbox with a Local Account will convert it to a MS Account if you mistakenly choose the wrong thing.So go into Settings > Accounts > Your Info to see if it's got the wrong account you don't want as Windows 10 account. If so choose the link to Sign in with a Local Account Instead, let it convert to Local.Then if you want the correct MS Account as your Windows 10 account, restart PC and go back to the same location to \"Sign in with a MS Account instead\" and sign in with the correct MS Account.If you want to keep the Local Account then watch that it doesn't prompt you with tricky choices meant to convert the Local Account to a MS account, and if you do make sure it's the one you want. This annoys a lot of people.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","It Worked but now it is signing my into a old xbox account with the same email as mojang account.","Sign out of Xbox Live app and sign in with the correct account. Here's how: https:\/\/beta.support.xbox.com\/help\/account-prof...Is the correct account now showing in Windows Settings > Accounts > Your Info?","It still defaults to the xbox live username and account ","1) What is the account you are signed into for Windows 10 at Settings > Accounts > Your Info?2) Did you sign out of the unwanted account in Xbox Live app as shown in the link I gave last post, then sign back into the desired account? What happens exactly?Please answer both numbered questions.","Sorry, I figured it out. my friend explained something wrong to me","Glad to hear it. Let me know if there's anything else. Also when ready please mark the post which helped most as the Answer, to help others. A rating is also appreciated.Happy New Year!"]},{"symptom":"Region setting date format: can it use different locale\/language?        Hi,The region setting starts with a format, e.g. English (United States).In additional setting -> Date, we can set the format string for the date. For example, dddd,MMMM d, yyyyIs it possible to force a different language for date? Thanks","solutions":["Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.It is possible to change the language date without changing your default language. You can check this article for instruction:https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this helps resolve your concern! Please let me know if you have further questions.","I have a bit different problem.The display language is set to English.Format though, is set as Chinese.  Without it, it would not allow the option to sort by pronunciation. For date, the desired format is in English.So the format has locale A.  Can the date be using locale B?Thanks","Hi, I apologize as I am a bit confused. Can you provide a screenshot of what you want to change?","See below.  The Long date format has Chinese character.  Can I switch it to English?  Note the sorting tab is only available if you set the Format to Chinese.","Hi, I'm sorry that currently, there's no such option. You cannot set it to English alphabet using the Chinese format, as sorting method is specifically designed only for Chinese formats in Chinese characters. You can either choose to display it in English date formats or in Chinese. I would suggest using your Feedback Hub for any suggestions so others with the same concern as you are can up vote and hopefully it will be included in future updates by Microsoft."]},{"symptom":"Prevent Windows 10 Sleep Mode        Monitor Turns Off Automatically | Computer goes to sleep automatically Goto start > settings > system > Power and sleep To turn off monitor sleep modeUnder the screen section 1. Set On battery power, turn off after \"Never\"       (Note: Battery Charger removed)2. Set When plugged in, turn off after \"Never\"     To disable automatic SleepUnder the sleep section 1. Set On battery power, Pc goes to sleep after \"Never\"      (Note: Battery Charger removed)2. Set When plugged in, Pc goes to sleep after \"Never\"     If it does not solve the problem. Please follow the instruction given below.Advanced settings to prevent sleep mode Goto start > settings > system > Power and sleep 1. On your right side select \"Additional power settings\"2. In that window select \"High performance\" and select \"Change plan settings\".    (if this option is not available then select \"balanced (recommended)\" and select \"change plan      settings\")3. Select everything into \"Never\"4.Drag the brightness slider to the right corner (If this option is not available in that window then ignore this step)5. select save changes and close.I hope this will help.","solutions":["On your last settings also go Change settings that are currently unavailable. Then clear the checks under Shutdown settingsSave changes.","On your last settings also go Change settings that are currently unavailable. Then clear the checks under Shutdown settingsSave changes.Hi lacrumb, thank you for your reply.Which settings is unavailable. I am confused.Did you mean \"High performance\"?","Then this.","yes, now i understand. its a good idea to change the power button behavior. thank you. "]},{"symptom":"Receive SpeechDiagnosticCalibrate with error code 0x80070057 from engin when I invoke voice recognition function in Win10 easy access program.        First of all,    my OS:   my computer is win10-64bit Chinese family version, v1903, OS built 18362.356.   my HW:  CPU: i5-6500 with 16GB RAMIt still works well with google voice input while the issue occurs.Below screen shots expalin my operations:I tried to google the solution but failed to find any related to SpeechDiagnosticCalibrate.May be I am in the wrong track.Please help.Thanks.Helen","solutions":[]},{"symptom":"Windows 10 Update 1903 - A current driver on your PC may be better than the driver we're trying to install. We'll keep trying to install.        I am trying to update my laptop to Windows 10 1903 but keep seeing the error \"A current driver on your PC may be better than the driver we're trying to install. We'll keep trying to install.\"How do I find out which driver is affecting the Windows10 update, so I can uninstall it","solutions":["Hi Ozpeg I am Vijay, an Independent Advisor. You should upgrade to 1903 through Media creation tool to have a successful upgrade.. Execute the below steps to go to 1903A. Optional but recommended step - Take a backup of your computer before you proceed.B. Disable any third party Antivirus (After update is successful, you can enable it again)C. You can go to https:\/\/www.microsoft.com\/en-us\/software-downlo... You can download the latest Windows 10 package from this link (media creation tool) and follow the instructions there to upgrade. Use the very simple instructions given under Using this tool to upgrade this PC to Windows 10D. Before update, remove all USB devices & SD card except mouse. Do let me know if you have any more question or require further help.","Hi VijayApologies for not replying until now, but have been busy travelling for workI tried your suggestions, and had no success. I am now getting the error \"0xC1900101 – 0x20017, The installation failed in the SAFE_OS phase error during Replicate_OC operation.\"* My BIOS is up to date,* My Drivers are all up to date* I have uninstalled my grapics driver (I can re-install it later* I have run a disk cleanup on the laptopAny suggestions how I can get around this error ?","I'm stuck on ver 1803 for x64-based systems (KB4530717). I've had all types of errors over the last many months.I've tried a few times over the last year to do the upgrade and troubleshoot; as advised by you and various other experts. Including the sfc and DSIM and its various types, including Editing group policy, removing secure boot, and even the Media creation tool; using the option to keep data and apps.Nothing works.Some experts have advised getting a copy of the full media for Win 10 Pro x64 (US English, ) for the version 1803. Use this to fix the corruption and then the subsequent updates will work.Is this an option?Where do I get one?The only option, otherwise, it seems is to do a clean install. And hours of work it requires thereafter.Thank youRocky"]},{"symptom":"loading iTunes on laptop        trying to download and install iTunes on windows 81 and pop up say no devices linked to Microsoft? how to I install this on my desktop","solutions":["If you don't have Windows 10, download and install the latest version from Apple's website.Read this from Apple:If you can't install or update iTunes for Windows____________________________________________\"Remove and reinstall iTunes and related software components for Windows 7 and later\"https:\/\/support.apple.com\/en-us\/HT204275Download iTunes 12.4.3 for Windows (64-bit - for older video cards)Use the Control Panel to uninstall iTunes and related software components in the following order:iTunesApple Software UpdateApple Mobile Device SupportBonjourApple Application Support 32-bitApple Application Support 64-bitOr try this free Revo Uninstaller Program to remove it.http:\/\/www.revouninstaller.com\/revo_uninstaller_free_download.html\"How-to-Use\" Instructions are included there: Read information in Tabs across the top.______________________________And after you download and save iTunes > right click on its setup.exe\/install.exe > select Run as Admin to install it._____________________________If the advice already given does not fix it, please contact Apple Support for further assistance.\"Trouble installing iTunes or QuickTime for Windows\"http:\/\/support.apple.com\/kb\/HT1926\"iTunes Support-How to use iTunes\"http:\/\/www.apple.com\/support\/itunes\/\"iTunes Contact Support\"http:\/\/www.apple.com\/support\/itunes\/contact\/Or ask in the Apple iTunes Community:https:\/\/discussions.apple.com\/community\/itunesCheers."]},{"symptom":"Facebook video & Skype video        I'm having weird problems using Facebook Video, Google Video & Skype Video. If I try either of these between two computers here, the video picture will come up on one but not the other. When we skyped someone from away recently, their picture would come up but the volume was so low we couldn't hear. We could get their picture but the volume was terribly low. If they shut off their picture, the volume would come up on ours where we could hear them. They were getting our picture (video) and hearing us but not so here. That I'm having the same problems on three different computers and with three different programs, I'm beaddled as to what's causing this. I've gone through the settings in Windows, on the Google Chrome Browser and nothing works. Therefore I'll ask you folks for assistance or at least a pointer where else I could find help with this. ","solutions":[]},{"symptom":"offline printer        How do I get rid of offline printer error? Using Windows 10 JAP and HP Coloe Laser JEt CP2025","solutions":["Hi David. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Rather than spending too much more time fiddling I'd simply Clean Install the printer which always works, lasts longer and actually saves time:1) Power up the printer, if wired unplug it's USB cable from PC. 2) Go to Settings>Apps>Apps and Features to find and Uninstall any printer software.3) Use one of these methods to remove all of the old printer drivers: https:\/\/www.tenforums.com\/tutorials\/101274-unin...https:\/\/helpdeskgeek.com\/how-to\/remove-uninstal...4) Now type Control Panel in Start Search, open CP, choose Icon View. In Control Panel open Devices and Printers, right click printer to delete Printer and any scanner or fax of the same name. Restart PC.5) Go to the printer model’s Support Downloads webpage to download and install the latest full software package. Now is also the time to check for any newer printer firmware to install which matters a lot.6) Extract Printer software, right click Setup file to Run as Administrator. Follow the setup screens closely as you install the software. For USB it should prompt when to plug in the printer.Older software may need to be installed in Compatibility Mode to run correctly: https:\/\/www.groovypost.com\/howto\/run-old-softwa... If you have further problems reply back with results of each step. Once it's installed and you've run a test print, then scanned it to see that it opens on the desktop, open the Printer software and go into its Settings to set the scan-to file location you prefer, also the email app you want opened for Scan to Email, if applicable.I hope this helps. Feel free to ask back any questions and let us know how it goes. If you will wait to rate my post until we are done, I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Issues with activating Windows 10.        Hi, during the free upgrade period I did the update to Win10 from 7.  I didn't realize you had to connect it to my Microsoft account, and I recently had some hardware issues and had to install a new CPU\/MB and after Windows repaired itself it's saying I need to activate it.  So, after trouble shooting and trying to re-activate it I cannot.  So, does this mean i'm going to have to spend 139 dollars to re-activate it now? ","solutions":["Hi Tim. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Linking a Digital License to the account is merely a convenience, you still have the license as long as it still qualifies after a motherboard change. In order to do that it must be premised on a retail license, not factory OEM which comes with preinstalled Windows. When you upgraded the new DL inherits the rights and restrictions of the underlying license.So if it's retail contact Microsoft Support by one of these phone numbers: https:\/\/support.microsoft.com\/en-us\/help\/405170...You can also go here: https:\/\/partner.support.services.microsoft.com\/... choose the link for Browser help, interact briefly about your exact problem, keep replying agent until it connects with an agent.Be aware they may ask for the retail key so I'd try to locate it. There have been reports lately that they're doing this now. But you'd always need the retail key anyway to reinstall the old OS and it hadn't been upgraded.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.","Does this still apply to that mass free upgrade (From Win 7 to Win 10) they had?  Because that's how I got my copy of Windows 10.","The free Upgrade issues a permanent Digital License that lasts for the life of the hardware. But as I wrote above, whether it can more to new hardware depends on if the original Windows install was retail or OEM. If it's retail then it can always change hardware, if it's factory installed or builder's OEM then it cannot."]},{"symptom":"Change admin        I am passing along my older laptop to a family member. How can I change the computer's admin status from my name, email and photo to hers?","solutions":["'Administrator' is not a status - it's a type of user account.It makes no difference to Windows who is the 'owner' or 'manager' or 'administrator' of the computer.If you want your family member to have their own Administrator account on the computer, create a new Administrator account for that person and delete your Administrator account.","Hi Marj. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Go into Windows Settings > Accounts > Family & Other People > Other Users to create a new account. Illustrated steps here:http:\/\/www.kickiteasy.com\/add-a-new-user-accoun... You can leave the password box blank and later she can create her own password in Settings > Accounts > Sign in Options > Change PasswordSign into the new Account, add an account picture in Settings > Accounts > Your Info > Create Your Picture.When ready go to Settings > Accounts > Family & Other People to delete your account. Make sure you've backed up all of your data first and removed any personal apps or programs you don't want to pass on.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Photos app won't open        My Photos app won't open. It was fine a couple of days ago.  When I click on the picture icon on the start menu I can see my pictures, but I cannot open them.  It won't open under another user profile either.  I have tried repair, reset and I uninstalled and reinstalled the app, to no avail. ","solutions":["Hi Debi. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Reset and Repair Photos app at Settings > Apps > Apps & Features > Photos app > Advanced Options. Your pictures will be safe in the User Pictures folder.If that doesn't help try re-registering the Photos app from Option Two here: http:\/\/www.tenforums.com\/tutorials\/3175-apps-re... If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... If nothing else helps you can try a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Wow!  Thanks for all of the possible solutions.  I'll try the easiest tonight, and if that doesn't work I'll attack in fresh in the morning.  I'll let you know how it goes. ","I'm glad to help, Debi. Keep me posted on your progress as I will be here to help until the case is resolved."]},{"symptom":"accidentally turn ed off messages in a website I use        I am a member of swapbot and when you go to delete messages or sign up for a swap you get a message and I accidentally said yes to no additional messages and now I can't sign up like I always did. ","solutions":["Hi Val. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.If you choose the FAQ page on the Swapbot Home Page and then the topic How Can I Receive Less Email Alerts, it explains how to go to Edit your Profile and then Preferences to adjust the amount of emails you want to receive. Read this section carefully and then adjust them to suit you: https:\/\/www.swap-bot.com\/faq.php#account-emailIf that doesn't get you what you want, then ask the Swapbot Admin here: https:\/\/www.swap-bot.com\/contact.phpLet me know if this helps. I'll be here to help until it's resolved.","It wasn't emails I turned off it was the pop up box to confirm deleting messages or signing up for swaps but I logged out and relogged in and it was fine. Thanks though.","May i ask why you gave me a bad rating for giving you exactly the correct answer based on what you wrote? That is not even a Microsoft site but I went ahead and looked it up for you to help you."]},{"symptom":"How to turn off Language switch bar        Hello!After last November update, when switching languages, I've started to get this bar with all languages i use (switch between)on the side of the screen.Why microsoft just adding stuff that I don't needand there is no instruction how to remove this trash!So extremely annoying that I have to tune mysystem and spend few hours and sometimes daysjust to search how to fix back to what is comfortable for me.This is my time and my money!I have only classical language bar and it is docked but as soon I start switching between languagesthe stupid floating window coming upon the side of the screen.Hope I'll get answer soon how to remove this stupid bar.","solutions":["Hi Yeye11, When you select more than one language as the input language, the Language bar will be displayed either on taskbar or desktop in Windows. If you wish to turn on or turn off the Input Indicator or Language Bar in Windows 10\/8.1, then this post will show you how to do it. For a detailed guide on how to this off, please follow this link: https:\/\/superuser.com\/questions\/909359\/windows-...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","First of all the link you gave is wrong - the topic there is: Windows 10 showing duplicate Folders under userSecond of all it is NOT a language bar but NEW pop up window on the side of the screen that appears when I switch between languages with help of Alt+Shift.So I need my classical language bar still to be seen docked in system tray, but I don't  want to see the NEW freaking popup window appear on the screen when I switch between languages!!!","* Duplicate. Merged.Is it possible to disable the popup list of input languages at the bottom right corner when having + pressed in Windows 10 version 1903?I do not want to disable the + hotkey (or + for that matter) or the ability to switch languages; I just want to switch offthis popup that was introduced in build1903.I've tried turning off the language indicator.  The indicator turns off, the popup stays.To add insult to injury, the popup often appears when I'm not even going to change the input language.  E.g., I'm editing text in a text editor, actively using and to select and move blocks of text, and the language popup keeps appearing._______________________________________________Until we find a solution>If I am pressing Shift first - the popup doesn't appear at all.But it is NOT a fix, it is just a temporary solution that doesn'tmakes it UNNECESSARY to find the way to switch off it completely!!!! __________________________________________________This is repost from superuser.com","seems no one knows the answer, neither microsoft itself.and they don't care to fix the trashy thing they do....","Tried MSDN Forum - but even there no answers what so ever!MSDN Mobile Apps Forum seems doesn't exist at all....Anyways about Windows 10 latestpopup sh....t (sorry can't call that stuff some other way,because it is fricking annoying, unnecessary, and enforced,destroys my working space dramatically!!!!)Some sick-heads could come up with idea to make it popping upwithout possibility to switch it off!Anyways -  the point is (again) - no answers what so ever...","The pop-up window makes it possible to select the input language you want. HoldingAlt and tapping left Shift (or holding Winkey and tapping the spacebar) cycles through the installed languages.If you prefer not to see the pop-up, assign a Ctrl-Shift-n shortcut to each language and use that instead: Settings  > Devices > Typing | More keyboard settings > Advanced keyboard settings > Input language hot keys.","Hello!Thank you for answer, but it is not a solution!To have to switch between languages and to add the third key for every switch isextremely ridiculous! It wouldn't really work even with 2 languages because it slows all work,but with 5 that I use it is just doesn't work at all.First of all this popup window doesn't make possible to select input languagebut makes it more obvious what language is chosen as it a huge window that pops up  on the side of the screen,and in previous versions it could be controlled if I want to see it or not,thou the functionality of the Alt+Shift was the same,now the so called developers that seems are underaged and not very smart people are makingit forced thru the convenient key sequence without the possibility to turn it off.We used Alt+Shift to cycle thru the languages in decades without needing this annoying popup stuffbut now all of a sudden they decided that flickering window is good for my eyes and good mood...There is not enough bad words to actually use to name all those so called developers....The only thing needed is to be able to use option to switch this popup off, but instead of making itthey just making people angry, irritated and sad.... and want to hate them for the way theytreat their customers...So thank you for your answer but it is not a real solution...I wait for some either registry trick or a real fix where I'll be able to work normally as I did before...Hope more angry customers write actively so that hopefully they fix stuff they broke!!!","... it is not a solution!... to add the third key for every switch is extremely ridiculous! It wouldn't really work even with 2 languages because it slows all work, but with 5 that I use it is just doesn't work at all.If you have configured five input languages, A, B, C, D and E, and you are currently typing in language A, how do you switch to using language E? If you set up a hotkey, say Ctrl-Shift-5 for E, that is a single keystroke to switch.   I'm not sure why you say 'it wouldn't work with 2 languages because it slows all work;' it takes no more time to type Ctrl-Shift-2 than to type Alt-Shift.  ... this popup window doesn't make possible to select input language ...Are you saying that if you press Winkey and tap the spacebar, you don't see the selection in the pop-up list change? If that is the case, there's something wrong with your installation.  ... it a huge window that pops up  on the side of the screen,I suppose that depends on your definition of huge. It seems to be the same width as the start menu, with each language occupying about the same height as the taskbar. ","OK!First - to switch between languages I just holding Alt and fast clicking shift x time to switch to desired language.it is much faster as it takes only 2 fingers to do it and I don't need to see what I switch cause I know exactly what number of times I have to clickto get to needed language.And I DON'T need to look on the keyboard to do it but in case of adding extra key especially with numbers I'll need to interrupt normal pace of typing and see what button to push... besides use another hand to push the extra button.And yeas pressing Ctrl+Shift+2 takes extra time as I need to use 2 hands or uncomfortable move my wrist to push those buttons. - Alt+Sift is the same movement that you can do repeatedly to switch between languages and basically it automatically made movement + MUCH more ergonomic. Second - I see the selection in the pop-up list, but it is not a \"thing that makes possible to switch between languages\" BUT it just makes it more visible and it may be good for those who uses computer seldom and\/or completely unprofessionally.....So it is not necessary thing, especially it was completely functional without this HUGE popup.And for the last about HUGE - it is very good definition as with 6 languages it is gigantic and event with 2 languages it flickers and destroyspeoples normal working process...I want as little things as possible that distracting on my workplace (screen) and THIS unnecessary thing only distracts and irritates eyes...(Even windows 10 start menu is disaster as it takes lots of place and very badly adjustable with all those big icons that are good onlyfor kids and may be for some older people - lots of people use Classic Shell to get back menu that looks like in windows 7 - compact and smallicons so we don't need to do long scrolling till we come to the end of the list)And Again the thing is that we lived very well without this trash - I'm sorry bur I can't call it other words because the great thing with windowswas the possibility to adjust things as it was comfortable and ergonomic for the individual work,but now it seems that windows becoming less and less adjustable just because it seems that developers now are some underaged teenagers that destroying functionality.It is not that difficult to add possibility to switch off this thing so that we don't need to change hotkey routine that thousands of people are used to.. There is many that reported irritation with this popup window and still there is no fix for it...Not even some registry tweak and this really sucks!!!!","This is what I mean HUGE if someone still doubts!!!! (this was before I needed to add one more language, so now it even bigger)!!!and as I need to switch fast between few languages during the chat sessions,and when I typing in few documents switching between languagesall extra button combinations are extremely distracting, besides as we used to use this combinationwithout stuff popping up this window should be assigned to the other hotkeys or made possible tocompletely switch off for thousands of users that don't want to see this trash..."]},{"symptom":"I have activated Windows 10 Home, but my pc still asks for the update        I have activated Windows 10 Home with digital license, but for some reason I am still constantly asked to update to Windows 10 (version 1903). Why I am getting this message?","solutions":["Hi TJ. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.What does the verison have to do with Activating Windows? Does it say? If you dont' even have Version 1903 then While you have me here to help I would manually upgrade to the latest version 1909 by opening the Media Creation Tool from this link:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m..., choose Download Tool Now, then open the tool and choose Upgrade This PC Now. This saves your files, apps and most settings in place, is the most stable method to change versions, brings your Updates current, resolves most problems. If any problems report back the verbatim error and number, then continue with these steps for overcoming Version Upgrade problems:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If the Version has problems I will work with you to try to resolve them. If the problems are unfixable for now, you have ten days to roll it back in Recovery settings. You can then hide it so it doesn't try to reinstall following this same method:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... Most problems are resolved by doing this gold standard Clean Install which should get you past all difficulties as it has millions of others who have followed the steps in this link and never come back to report another problem:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... . So read it over and see if its something you want to learn to do.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to rate my post, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"How to open url:microsoft-edge with for example Firefox?        Whereas, A. Firefox is set as my default browser. B. Edge still opens when using Cortana \/ the search bar in the lower right of the default Windows 10 graphic interface.C. It opens because of the prefix to the URL argument, e.g. \"microsoft-edge:http:\/\/example.com\".D. Whereas in Settings>Choose Default Apps by Protocol (at the bottom of \"choose Default Apps\", URL:microsoft-edge is set to open with the Microsoft Edge Browser, and I don't know how to choose firefox. That option doesn't seem to be there, but in theory it ought to be. They let you find another app in the microsoft store.I would like to know how to choose Firefox not as my default browser, which it already is, but for my default app for the URL:microsoft-edge protocol.Is this possible? If not why not? I just learned about Edge-Deflector and I'm going to install that, but it seems like that shouldn't be necessary, if I can link firefox with the protocl somehow.","solutions":["Do your search in Firefox and not in the search box.","Do your search in Firefox and not in the search box.That wouldn't make me more sophisticated.","Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Unfortunately search results do open in Edge exclusively, you are correct in saying that there is a work around that can be installed.My advice would be to go down that route. Regards, Ross","I just discovered the \"default apps by protocol\" area, and I got curious and I just didn't understand why you couldn't assign anything to anything, or at least a browser application to a browser application url, instead of writing a complex application of code. I looked at the solution to that code and it's not the most complex but it's not that simple either.Anyway installed it and it worked. I don't like windows trying to hijack my choices. Default browser = default browser. :)"]},{"symptom":"restore settings        How can i restore my settings to Jan 1st 2020?","solutions":["If a restore point was created on that date, you can.\"How to Do a System Restore in Windows 8 and 8.1\"http:\/\/www.eightforums.com\/tutorials\/4692-system-restore-how-do-windows-8-a.html"]},{"symptom":"AOL connection        I cannot connect to AOL Mail.","solutions":["Did you ask AOL?https:\/\/help.aol.com\/articles\/fFix-problems-reading-or-receiving-aol-mailAOL Mail is currently experiencing issues with specific web browsers. Google Chrome, Mozilla Firefox or Safari are not impacted and can be used until these issues are fixed.","Did you ask AOL?https:\/\/help.aol.com\/articles\/fFix-problems-reading-or-receiving-aol-mailAOL Mail is currently experiencing issues with specific web browsers. Google Chrome, Mozilla Firefox or Safari are not impacted and can be used until these issues are fixed.Problem fixed.","Glad to see you got it fixed."]}]}