{"windows":[{"symptom":"Signing my Account out of my old PC but keeping all documents and files        Hello,My dad has taken possession of my old PC with my Microsoft Account still logged in. He has his own business and would like to keep all the files, documents and pictures already saved in my documents from my account. He is afraid that having my Microsoft account on my old PC would cause problems for me because my Microsoft account is also linked to the Galaxy Book I am currently using.I tried adding his own account on my old PC, but that didn't have all the files that are currently in my old PC's log in from my account. How do I change the Microsoft Account to my dad's from my old PC while still having the current documents that are present on the PC from my account? I also saw that I can add a family member in my Microsoft Account. Is that a good alternative in sharing the files from my old PC between my account and my dad's? I need all the help I can get.Thanks,Leann","solutions":["Hi Leann My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help answer your question.Create a user account for your Dad and login then logout Login with the an administrator account Press Windows + X keys on the keyboard, select Control Panel. Select System and Security and then System. Click Advanced System Settings. Under User Profiles, click Settings. Select the profile you want to copy. Click Copy to, and then enter the name of, or browse to, the profile you want to overwrite. This will usually be in C:\\Users\\username, where username is the name of the profile to which you are copying.Click Permitted to use, and then add all user accounts to which you want to give full profile control.Click OK. or Backup your files manually to an external hard disk then restore in the new account. Here is a guide how to do that:How to manually backup and restore your files https:\/\/answers.microsoft.com\/en-us\/windows\/for...After backing up your files, you can log in to the new account, then follow the steps to restore the files.You can then delete the old account by following these steps: Click Start > Settings > Accounts > Family & other users select the account Click Remove Hope this helps.","Hi Leann Ab,If you put the files in the \"Public\" folder usually at \"C:\/Users\/Public\" then you can both easily access the same files.Have you considered purchasing Office 365 Home?  That would give each member in your family (maximum of 6 members) an additional 1TB of cloud storage each.  That is 6TB total.  Sharing is built-in to OneDrive.https:\/\/onedrive.live.com\/about\/en-US\/plans\/I hope that helps. "]},{"symptom":"Windows 10 corrupt on Laptop need to create install from usb        Hi basically the subject shows the problem after my laptop was stuck loading updates for 8 hours I shut it down. It will reboot but does not load the desktop the message windows\\systm32\\config system profile\\desktop missing appears. I have a blank usb and a working PC. What is the best way to create a usb I can reboot my laptop from","solutions":["Hi Geoff, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Let us try repairing the existing OS.On a working computer, create an Installation media of Windows 10 that allows you to repair existing Windows Installation.Create a USB Flash Drivehttps:\/\/www.tenforums.com\/tutorials\/2376-create...Boot from the USB Flash drive-Make sure you have disabled Secure boot\/Fast boot in BIOS Settings.https:\/\/www.tenforums.com\/tutorials\/21756-boot-...https:\/\/www.tenforums.com\/tutorials\/21284-enabl...Then open Advanced Startup options after the computer boots from USB. Click Repair your computer at the first screen that says Install now.https:\/\/www.tenforums.com\/tutorials\/2294-boot-a...Select Startup repair, let it finish the job and see if the computer can boot afterward.If that doesn't help, consider doing a clean install after rescuing your files.Rescue Files when Windows won't starthttps:\/\/answers.microsoft.com\/en-us\/windows\/for...How to do a clean installhttps:\/\/answers.microsoft.com\/en-us\/insider\/for...https:\/\/answers.microsoft.com\/en-us\/windows\/for...Disclaimer: Tenforums is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"Windows Media Player Problem in Windows 10        Windows Media Player does not work in my Windows 10 PC or laptop to rip an audio CD.  Error message \"Windows Media Player has stopped working  A problem caused the program to stop working correctly.  Windows will close the program and notify you if a solution is available.\"  The program worked as recently as two days ago on the laptop.","solutions":["Hi,Thank you for posting the query in Microsoft Community. I understand the inconvenience that you are facing. We are glad to help you.Let’s try the below steps and check if it works:Method 1: Windows Media player troubleshooterI would suggest you to run the Windows Media player settings and the Windows Media library troubleshooter and check.Windows 10 has a built-in troubleshooter to check and fix issues with Media player. I would suggest you to run this troubleshooter to check if the issue is with your Media player.Refer these steps:Press Windows key +X, select Control panelChange the view by option on the top right to Large iconsClick on troubleshooting and click on the view all option on the left panelRun all the Windows Media Player troubleshooters If the issue persist, I would suggest you to place the computer in a clean boot state and then check if it helps. You can start Windows by using a minimal set of drivers and startup programs. This kind of startup is known as a \"clean boot.\" A clean boot helps eliminate software conflicts.  To set the computer in clean boot, follow the steps from the link: How to perform a clean boot Disclaimer: After you have finished troubleshooting, follow these steps from section “How to reset the computer to start as usual after clean boot troubleshooting” to reset the computer to start as usual. Hope this helps. If you need further assistance with Windows, let us know and will be glad to help. "]},{"symptom":"Windows 10, version 1909 - Error 0x80073701        Trying to update Windows 10, version 1909 - and I get this error Error 0x80073701","solutions":["Hi DennisPappalard, You can try basic troubleshooting step below to check and fix any registry errors.1. Open an elevated command prompt. To do this, right click the Windows button, and then select Command Prompt (Admin). If you are prompted for an administrator password or for a confirmation, type the password, or click Allow or Yes.2. Type the following command, and then press Enter. - DISM.exe \/Online \/Cleanup-image \/Scanhealth - DISM.exe \/Online \/Cleanup-image \/Restorehealth - DISM.exe \/online \/cleanup-image \/startcomponentcleanup - Note It might take several minutes for the command operation to be completed. 3. Type the following command and press Enter. - sfc \/scannow Note It might take several minutes for the command operation to be completed. Let me know how it works for you.","This is the same cut-and-paste response that always get posted for this problem and it NEVER, EVER, N-E-V-E-R works. After doing all this I STILL get: Feature update to Windows 10, version 1909 - Error 0x80073701I've gotten this same error on updates for months and months...and NOTHING ever fixes it. NOTHING. C:\\WINDOWS\\system32> DISM.exe \/Online \/Cleanup-image \/ScanhealthDeployment Image Servicing and Management toolVersion: 10.0.18362.1Image Version: 10.0.18362.329[==========================100.0%==========================] No component store corruption detected.The operation completed successfully.C:\\WINDOWS\\system32> DISM.exe \/Online \/Cleanup-image \/RestorehealthDeployment Image Servicing and Management toolVersion: 10.0.18362.1Image Version: 10.0.18362.329[==========================100.0%==========================] The restore operation completed successfully.The operation completed successfully.C:\\WINDOWS\\system32>DISM.exe \/online \/cleanup-image \/startcomponentcleanupDeployment Image Servicing and Management toolVersion: 10.0.18362.1Image Version: 10.0.18362.329[=====                      10.0%                          ][==========================100.0%==========================]The operation completed successfully.C:\\WINDOWS\\system32>sfc \/scannowBeginning system scan.  This process will take some time.Beginning verification phase of system scan.Verification 100% complete.Windows Resource Protection did not find any integrity violations.C:\\WINDOWS\\system32>","I've followed the above instructions and haven't any success. When I attempt to run any of the commands it always fails with a Error 87 - dism option unknown.This update first failed in October when attempting to install update 2019-10 Cumulative KB4517389.  What I suspect caused the failure is that during the update my pc was mistakenly shut down and I guess likely caused file(s) to be corrupt.  At that time I received this error code 0x80242016.  ","I have the same problem. Both (KB4524570) and the 1909 Update don't work - I've tried many times. They both give me error code 0x80073701Rex A.s advice didn't change it.","I have the same problem. Both (KB4524570) and the 1909 Update don't work - I've tried many times. They both give me error code 0x80073701Rex A.s advice didn't change it. I just happened to stumble upon this link. There was a link for the November 1909 update which did finally work for me. It takes a while to run. https:\/\/www.microsoft.com\/en-us\/software-download\/windows10","Trying to update Windows 10, version 1909 - and I get this error Error 0x80073701Dear Sir\/Madam,The advised sequence of operations has been failed on the following stage:DISM.exe \/online \/cleanup-image \/ startcomponentscleanup with the error 0x800f0806,while two advised previous stages had been completed successfully. ","This is the same cut-and-paste response that always get posted for this problem and it NEVER, EVER, N-E-V-E-R works. After doing all this I STILL get: Feature update to Windows 10, version 1909 - Error 0x80073701I've gotten this same error on updates for months and months...and NOTHING ever fixes it. NOTHING. C:\\WINDOWS\\system32> DISM.exe \/Online \/Cleanup-image \/ScanhealthDeployment Image Servicing and Management toolVersion: 10.0.18362.1Image Version: 10.0.18362.329[==========================100.0%==========================] No component store corruption detected.The operation completed successfully.C:\\WINDOWS\\system32> DISM.exe \/Online \/Cleanup-image \/RestorehealthDeployment Image Servicing and Management toolVersion: 10.0.18362.1Image Version: 10.0.18362.329[==========================100.0%==========================] The restore operation completed successfully.The operation completed successfully.C:\\WINDOWS\\system32>DISM.exe \/online \/cleanup-image \/startcomponentcleanupDeployment Image Servicing and Management toolVersion: 10.0.18362.1Image Version: 10.0.18362.329[=====                      10.0%                          ][==========================100.0%==========================]The operation completed successfully.C:\\WINDOWS\\system32>sfc \/scannowBeginning system scan.  This process will take some time.Beginning verification phase of system scan.Verification 100% complete.Windows Resource Protection did not find any integrity violations.C:\\WINDOWS\\system32>In my case the following advised step:DISM.exe \/online \/cleanup-image \/startcomponentcleanup with the error: 0x800f0806 ","I have the same problem. Both (KB4524570) and the 1909 Update don't work - I've tried many times. They both give me error code 0x80073701Rex A.s advice didn't change it. I just happened to stumble upon this link. There was a link for the November 1909 update which did finally work for me. It takes a while to run. https:\/\/www.microsoft.com\/en-us\/software-download\/windows10I used windows update assistant to update to 1909 and  LCU. Thanks for the hint.","Thanks a lot indeed! Upgrade to Windows 10 version 1909 using Microsoft upgrade assistance works to me as well (though took quite a lot of time). Thereafter standard Windows update procedure had been carried out and accomplished in a completely  normal way, no more updating errors so far! Thanks again.","Ok this looks to have sorted my error code 0x80073701. Thanks for the info.I'm still not sure it's fixed my pc from restarting itself a few minutes after I've got on it. Wait n' see I s'pose."]},{"symptom":"How can I get my account unbanned        Pleas can you unban my xbox one account it wasnt me on the account when it was banned it was my freind cheating on it ***Moved from: Outlook.com \/ Email \/ Searching email ***","solutions":["Hi,Questions about Xbox are outside the scope of this Community.I suggest that you read the information below and repost in the correct Xbox Forum.Xbox Forums directory@@@@@@@@@@@@@@@@@@@@@@@@@@@@Xbox Support Home: Xbox SupportFor general support questions, visit theXbox Support Forums @@@@@@@@@@@@@@@@@@@@@@@@@@@@Some general information for Xbox, etc. that may assist you:For help with Enforcement Actions\/Suspensions:Enforcement.Xbox.com. For Xbox Live Policy & Enforcement Team Case Review: Xbox Enforcement | How Do I For help with your console hardware and accessories:Accessories - Xbox SupportFor help connecting to Xbox Live: Xbox 360 Can't Connect to Xbox Live - Xbox Supportor Xbox 360 Network Connection Help | Troubleshoot Xbox Live ... or Xbox Live Not Working | Fix Xbox Live Connection ProblemsFor help purchasing or downloading items on your console:How to Find Games and Game Content After You Redeem a Code ...,Store - Xbox Support   For help with your Xbox Live account:Manage account - Xbox Support orManage Your Subscription on Xbox 360 - Xbox SupportFor help with Xbox Games questions: Xbox One Games orXbox 360 Games. For help with Xbox Rewards: Xbox Rewards | Xbox Live – Xbox.com - Xbox Support, Xbox Live Rewards, FAQs - Xbox Live RewardsFor help with Promotions\/Sales:Sales & Specials | This Week's Xbox Live Deals orDeals with Gold | Xbox LiveFor help with Xbox on Windows: Getting started - Xbox Support For Xbox Subscriptions Billing, etc.: Xbox subscriptions - Xbox SupportFor Xbox suggestions, to submit your idea, or vote on others: Xbox FeedbackCheers."]},{"symptom":"Cumulative update KB4530684 fails with error code 0x800f0831        Hello. I'm currently on Windows Version 1903, build 18362.418. I've been trying for some time to install the latest cumulative update KB4530684, both via Windows Update and directly from the Microsoft Update Catalog, but it always results in failure, with error code 0x800f0831 shown in Update History.  On Googling this error, I found the following information from https:\/\/support.microsoft.com\/en-gb\/help\/4477073\/error-0x800f0831-when-you-install-an-update:-\"When you try to install a Windows update, especially a cumulative update, you receive the following error message in WindowsUpdate.log:FATAL: CBS called Error with 0x800f0831This issue is more likely to occur when there is no access to Microsoft Update.Additionally, you receive error messages that resemble the following in CBS.log:Store corruption, manifest missing for package: <Missing_Package>Failed to resolve package '<Missing_Package> [HRESULT = 0x800f0831 - CBS_E_STORE_CORRUPTION]Mark store corruption flag because of package: <Missing_Package> [HRESULT = 0x800f0831 - CBS_E_STORE_CORRUPTION]Failed to resolve package [HRESULT = 0x800f0831 - CBS_E_STORE_CORRUPTION]Failed to get next package to re-evaluate [HRESULT = 0x800f0831 - CBS_E_STORE_CORRUPTION]Failed to execute execution chain. [HRESULT = 0x800f0831 - CBS_E_STORE_CORRUPTION]Failed to process single phase execution. [HRESULT = 0x800f0831 - CBS_E_STORE_CORRUPTION]WER: Generating failure report for package:<Failed_Package> status: 0x800f0831, failure source: Execute, start state: Staged, target state: Installed, client id: DISM Package Manager ProviderNote <Failed_Package> represents the package that can't be installed. <Missing_Package> represents the package for which the manifest is missing.This issue occurs because the update that can't be installed requires the manifest of a previous update package.To fix the issue, follow these steps:Go to Microsoft Update Catalog.In the Search box, enter the package ID of the <Missing_Package>.Download the package and then install it.Reinstall the <Failed_Package>.\"The following are extracts from my CBS.Log, following the latest failed installation:-2019-12-25 17:53:56, Info                  CBS    Store corruption, manifest missing for package: HyperV-VID-Package~31bf3856ad364e35~amd64~~10.0.18362.12019-12-25 17:53:56, Info                  CBS    Mark store corruption flag because of package: HyperV-VID-Package~31bf3856ad364e35~amd64~~10.0.18362.1. [HRESULT = 0x80070490 - ERROR_NOT_FOUND](several lines later):-2019-12-25 17:54:06, Info                  CBS    WER: Generating failure report for package: Package_for_RollupFix~31bf3856ad364e35~amd64~~18362.535.1.6, status: 0x800f0831, failure source: CBS Other, start state: Absent, target state: Installed, client id: WindowsUpdateAgentI assume that 'HyperV' refers to Hyper-V which, from what I can gather, shouldn't apply to my Windows Home computer. Entering 'HyperV' in the Update Catalog's search box fails, but 'Hyper-V' results in a number of entries, none of which are clear to me and I don't want to make matters worse by trying to install the wrong thing!.  Can anyone shed any light on this please?","solutions":["Hi Rod, Yes, that's the same. A repair install keeps everything and reinstalls Windows and obviously, updates the device as well. I suggest going through this way as it is the last resort."]},{"symptom":"backup        How to backup files or folder that has changes or new files, only?","solutions":["How to backup files or folder that has changes or new files, only? What you are referring to is called an incremental backup. Most third-party backup programs can do this type of backup, however Windows 10 cannot.To do an incremental backup, you start with a full backup. Then, at the interval you determine (e.g., hourly, daily, etc.) the program backs up only hard drive sectors that have changed.An incremental backup only backs up sectors that have changed since the last backup; while adifferential backup backs up all changes since the original full backup.","Hi delfordwoodyard, This is possible...you want something called incremental backup that only does change files...Here is a good place to start: https:\/\/www.lifewire.com\/free-backup-software-t...Some are free and can allow you to do what you want. There is also File History built in Windows 10 which can do similar things:https:\/\/www.pcworld.com\/article\/2974385\/how-to-...Let me know if this helps. DISCLAIMER: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hello,You can try File History feature, that is also available in Windows 10:https:\/\/support.microsoft.com\/en-in\/help\/17128\/windows-8-file-historyHope this helps!","How to backup files or folder that has changes or new files, only? OneDrive is designed to do just that if you think it is a sufficient backup plan."]},{"symptom":"Error: Something happened on our end.  Waiting a bit might help.  The error code is 0x80070057, when purchasing Premium subscription for Microsoft Solitaire Collection        Just recently I have started getting ads for other Microsoft games when I try to play Solitaire.  I have got fed up with waiting until the ad finishes, so asked to pay the extra £12.49 annual sub.  However on the next screen I get an error message saying\"Something happened on our end.  Waiting a bit might help.  The error code is 0x80070057, in case you need it.[CV:d74gzpdUWkSuZJXq17.3]\"Well, I have waited and now tried five times. I wish to pay but can't.  This is becoming very irritating.  What can I do?  ***Original title: Microsoft solitaire collection ads: how do I pay to get rid of them?***","solutions":["Hi Andrew, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues while purchasing Microsoft Solitaire Collection premium pack. However, we do have a dedicated forum for Microsoft Solitaire Collection, let me point you in the right direction. I would suggest you to post your query in Microsoft Causal Games Community, where you will find support professionals to address your query. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"rollback from 10 to 8.1        HP Stream 14 came with 8.1 installed.  Updates to 10 but now cannot update to 1903.  Wish to rollback to 8.1, have product key, have 8.1 bootable ISO but it refuses product key. How do I resolve this?","solutions":["You clean install windows 8.1 to remove 10.And I don't know how you found the product key for 8.1. And do NOT post any product keys here.With Windows 8\/8.1 The Product Key on preinstalled Operating Systems (HP, Acer, etc) is embedded in the BIOS in the Motherboard, so that the lost and\/or worn C.O.A. Sticker problem is no more.When you reinstall it will pick up the Product Key and activate the system automatically.When you reinstall it should pick up the Product Key and activate the system automatically.There was no product key for the free upgrade to 10.This is for 8.1 too.\"Windows 10 Embedded Product Key Tool\"https:\/\/neosmart.net\/blog\/2014\/windows-10-embedded-product-key-tool\/\"We’re proud to introduce the immediate release of our newest utility for Windows users: the NeoSmart Technologies Embedded Product Key Tool. Designed for users of Windows 7, Windows 8, and Windows 10, our embedded product key tool will retrieve and display the Windows setup product key embedded in the BIOS or EFI, allowing you to store it for safe-keeping or use it to reinstall Windows with an official Windows setup image.\"","Thanks very much for replying to my question. I got the product key by Cmd  \"wmic path softwarelicensingservice get OA3xOriginalProductKey\"  .  But even when I try a clean install from ISO usb I get to the point where it asks for a product key, it does not auto fill and if I use the key generated it tells me the key is not correct and suggest I check for mistakes or use another key.  I would buy another key and cd but of course on the stream there is no cd player.","Use the program I gave you to find the product key if 8.1 came preinstalled.","Once again, many thanks for helping out. I have downloaded the tool and it generates exactly the same product key that I had before.  Not sure where I go from here. But thank you very much.  When I download the ISO does it matter if it is US English, or single language, I am not sure what the others are with N or K or NK if I remember correctly.","You have to reinstall exactly the same edition of 8.1 that was originally preinstalled.That could be the reason why the product key is not working.It is very important.https:\/\/www.howtogeek.com\/322112\/what-is-an-n-or-kn-edition-of-windows\/Microsoft distributes special “N” editions of Windows in Europe and “KN” editions of Windows in Korea. These are the same as the standard editions of Windows, except they don’t include Windows Media Player and other multimedia playback features","Thank you so much for your help. I will try downloading the N version and any others apart from the KN and try them. Let's hope you are right.  Once again, I really appreciate all the help you are providing.  Cheers","N is only if you bought your computer in the EU.If you live in the U.S., N is not for you.\"Create installation media for Windows 8.1\"http:\/\/windows.microsoft.com\/en-us\/windows-8\/create-reset-refresh-media\"Download Windows 8.1\"https:\/\/www.microsoft.com\/en-us\/software-download\/windows8A similar Tutorial which may also assist you\"Create Installation Media for Windows 8.1\"http:\/\/winsupersite.com\/windows-8\/create-installation-media-windows-81In the first screen of this very simple wizard, you need to choose the following:Language. English – en-us if you're in the United States.Edition. Windows 8.1 (Core), Windows 8.1 N, Windows 8.1 Pro, Windows 8.1 Pro N, or Windows 8.1 Single Language.Architecture. 64-bit (x64 ) or 32-bit (x86).","I downloaded version N and yried to install from that, but still the same problem, it will not accept the product key.  I guess the only thing to do is buy a new copy and try with that.  But will the embedded key in BIOS prevent that ?","Contact HP and ask them exactly what edition of Windows 8.1 come on your device.They should also have cheap recovery media for it, too.","Thanks very much I will try that next."]},{"symptom":"Updated to windows 10 yesterday - now monitor says \"no signal\"        Hi, Yesterday i updated from windows 7 to windows 10, and everything went smoothly. Today, ive turned on my computer, and im getting a 'no signal' message on my monitor. This has never happened before. Im using a Displayport to Minidisplayport cable, connecting an acer 40inch 4k monitor to a Nvidia gtx 970.  When i connect the monitor via VGA to the motherboard, it works fine.  Any ideas how i can get the displayport connection working again? It must be related to the windows 10 update surely? I have updated the nvidia drivers. Thank you in advance","solutions":["Hi meggerz, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.When you connect through VGA cable, is GTX 970 detected in BIOS? What is the make and model of the computer?","Hi Sumit,Im not sure if its detected in BIOS, how do i find out? The computer was custom made so doesnt have a make\/model","To see if it is detected, you need to check BIOS Settings. To open BIOS Settings, a specific key is required to be pressed at startup.We need the make and model of the motherboard to tell you what specific key needs to be pressed.","To see if it is detected, you need to check BIOS Settings. To open BIOS Settings, a specific key is required to be pressed at startup.We need the make and model of the motherboard to tell you what specific key needs to be pressed.Ok, this is my motherboard!","Thanks. When you turn on the computer, press Del repeatedly to open BIOS Settings.To correct this you may look for UMA\/Graphics Settings there - Unfortunately the instructions vary by mobo so we can't tell exact settings.Or simply you may first try to restore optimal defaults by pressing F7\/F6 key and see if it resolves the issue. For all changes Pressing F10 and then Y saves the settings.You can send a photo from your phone camera of BIOS settings if you need help to figure out settings.","So, in answer to your original question “when i connect through vga, is the gtx970 detected in the bios?”, (firstly, i assume you mean vga to motherboard?) well, im not even able to acess the bios when plugged into the motherboard via VGA. Nothing appears on the monitor until the welcome log in screen. I then switched back to an old monitor and a dvi-mini dp connection, and accessed the BIOS by pressing delete on start up. I could not find any mention of UMA\/graphics. I have taken a photo as you mentioned and appreciate any further instructions.","This does show that the GTX970 is being used though","The second screenshot clearly explains GTX 970 is being used, whenever it is needed for graphics processing.For example, when you play games you would see the use of the same. It is just an issue of GTX970 not being primary display card - not sure if it is by design or something else. In BIOS, pressing F2 would lead you to classic mode which can have that option to toggle - however it might require fiddling up settings."]},{"symptom":"My computer freezes every few seconds        My computer freezes every few seconds, and i don't know solution how to fix it. Has it ever happend to someone, and do you know how to fix it?","solutions":["Hi Grikis, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Does it freeze so do you have to restart the computer or it comes back to life after a certain period of time?","Hi Grikis, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Does it freeze so do you have to restart the computer or it comes back to life after a certain period of time?It freezes every 5 seconds for a second and it comes back to life, i don't need to restart the computer.","Thank you Grikis for the information. To isolate the issue please tell if the freeze occurs in a clean boot state as well.https:\/\/support.microsoft.com\/en-in\/help\/929135...A clean boot means no 3rd party applications are loaded at boot which helps us identify the reason.","Thank you Grikis for the information. To isolate the issue please tell if the freeze occurs in a clean boot state as well.https:\/\/support.microsoft.com\/en-in\/help\/929135...A clean boot means no 3rd party applications are loaded at boot which helps us identify the reason.Didin't worked, trouble shooting didint find anything, and after clean boot nothing changed still freezes.","Hi, To better understand the issue, Please see the article below on how to share Application and System logs.http:\/\/www.yourwindowsguide.com\/2017\/12\/how-to-...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads."]},{"symptom":"How to delete shortcut Ctrl + Shift?        I don't know how to delete his. Can you help me? Thank you!***Modified title from: I don't know how to delete shortcut on keyboard ctrl + shift***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. For better clarity, please help us with the details requested below: Have you assigned the “Ctrl + Shift” shortcut for any application? Ideally, the shortcut Ctrl + Shift is used to switch the keyboard layout when multiple keyboard layouts are available. If you have assigned the shortcut for a keyboard layout, you may try changing it by following the steps mentioned below: Press Windows Logo key + I, to openSettings.Click on Devices and select Typing on the left pane.Scroll down and select Advanced keyboard settings.Click on Input language hot keys.Select the layout for which you have assigned the shortcut and click onChange Key Sequence.Under Switch Keyboard Layout, selectNot assigned.Click on OK (Twice).  Let us know the results. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Updating gets stuck        I have just upgraded from Windows 7 to Windows 10, and Windows Update tells me that there are available updates. One of these is Microsoft Visual Studio 2010 Service Pack 1.Firstly, I don't have VS 2010 on my machine - I removed it ages ago. So why does it want a service pack?Secondly, the update is stuck on 0%. See screensnip below. And none of the other installs are starting, presumably because of this.The really useful Win 7 \"more information\" which allowed you to go straight to the relevant KB article seems to have disappeared and been replaced by a generic one which is useless.Windows Update Troubleshooter doesn't help - it tells me to use admin privileges, but when I click that button and give it an admin password nothing happens at all.Any ideas on how to unstick my update?","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command prompt DISM \/Online \/Cleanup-Image \/RestoreHealth Run these commands on the command prompt to restart windows update services net stop bits net stop cryptsvc net stop wuauserv net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start bits net start cryptsvc net start wuauserv net start msiserver After successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update servicesSee article below for instructions. https:\/\/support.microsoft.com\/en-ph\/help\/929135...This should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo... 2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept. 4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","It didn't go too well - the update service wouldn't stop :-(  See the following console output. I'll try a clean reboot and see what happens. I've a nasty feeling that a totally clean reboot may disable my firewall\/anti-malware (Kaspersky).Microsoft Windows [Version 10.0.18362.476](c) 2019 Microsoft Corporation. All rights reserved.C:\\WINDOWS\\system32>DISM \/Online \/Cleanup-Image \/RestoreHealthDeployment Image Servicing and Management toolVersion: 10.0.18362.1Image Version: 10.0.18362.476[==========================100.0%==========================] The restore operation completed successfully.The operation completed successfully.C:\\WINDOWS\\system32>C:\\WINDOWS\\system32>C:\\WINDOWS\\system32>C:\\WINDOWS\\system32>net stop bitsThe Background Intelligent Transfer Service service is not started.More help is available by typing NET HELPMSG 3521.C:\\WINDOWS\\system32>net stop cryptsvcThe Cryptographic Services service is stopping..The Cryptographic Services service was stopped successfully.C:\\WINDOWS\\system32>net stop wuauservThe Windows Update service is stopping......................................The Windows Update service could not be stopped.C:\\WINDOWS\\system32>","Further update. After a clean boot (and I also unplugged all non-essential USB devices), update still gets stuck, but on a different item - see screensnip.I'm  not sure how well your suggestion of doing an in-place upgrade would help. That's what I did yesterday when upgrading from 7 to 10, except that I did it from a downloaded image on a DVD rather than online.Also, after posting my initial comment, the machine became totally sluggish and got completely stuck when I was trying to open an app (I forget which) as admin - the screen greyed out but the request for an admin password never came up. In the end I had to do a totally hard reboot. So there's something very wrong with my machine (which I admit is quite old - I built it in 2011). Or it may have been something I did when trying to unstick the upgrade.[Edit] - the screensnip doesn't seem to have worked - trying again.","Gary - did you see my answers? And have you any more suggestions apart from the nuclear option - a clean OS install and reinstall all apps?","Hi ptoye, In that case, I would recommend hiding the said update by using the windows update tool from microsoftThis would be the link https:\/\/support.microsoft.com\/en-us\/help\/402672...Let me check with other experts in regards to this thread.","Well, it's getting very odd. When I switched off yesterday Windows said that there were updates pending a restart. On booting in this morning there was a very short \"Configuring Windows\" before the login screen. But the update history (see screensnip) is odd: lots of failures on 22nd, two successful installation of VS 2010 Service Pack 1 on 22nd and today (and I don't have VS 2010 AFAIK).I'm getting the nasty feeling that the nuclear option is the only one available :([Edited later]. Following a planned reboot, I looked at the update screen and there are apparently no pending updates, and the update history shows more successful installations.I can only assume that there's a bug somewhere that keeps the installation at 0% and fails to update it. And that updates are extremely sloooowwwww.","Hi My name is Lester and hopefully, this will help answer your question, upon reviewing all the troubleshooting steps that has been done, and upon checking the issue, we need to fully re-calibrate the Windows update, this will allow us to get and install all important updates for your device. Open a notepad and copy the command below: net stop bits net stop wuauserv net stop appidsvc net stop cryptsvc Del \"%ALLUSERSPROFILE%\\Application Data\\Microsoft\\Network\\Downloader\\*.*\" rmdir %systemroot%\\SoftwareDistribution \/S \/Q rmdir %systemroot%\\system32\\catroot2 \/S \/Q sc.exe sdset bits D:(A;;CCLCSWRPWPDTLOCRRC;;;SY)(A;;CCDCLCSWRPWPDTLOCRSDRCWDWO;;;BA)(A;;CCLCSWLOCRRC;;;AU)(A;;CCLCSWRPWPDTLOCRRC;;;PU)sc.exe sdset wuauserv D:(A;;CCLCSWRPWPDTLOCRRC;;;SY)(A;;CCDCLCSWRPWPDTLOCRSDRCWDWO;;;BA)(A;;CCLCSWLOCRRC;;;AU)(A;;CCLCSWRPWPDTLOCRRC;;;PU)cd \/d %windir%\\system32 regsvr32.exe \/s atl.dll regsvr32.exe \/s urlmon.dll regsvr32.exe \/s mshtml.dll regsvr32.exe \/s shdocvw.dll regsvr32.exe \/s browseui.dll regsvr32.exe \/s jscript.dll regsvr32.exe \/s vbscript.dll regsvr32.exe \/s scrrun.dll regsvr32.exe \/s msxml.dll regsvr32.exe \/s msxml3.dll regsvr32.exe \/s msxml6.dll regsvr32.exe \/s actxprxy.dll regsvr32.exe \/s softpub.dll regsvr32.exe \/s wintrust.dll regsvr32.exe \/s dssenh.dll regsvr32.exe \/s rsaenh.dll regsvr32.exe \/s gpkcsp.dll regsvr32.exe \/s sccbase.dll regsvr32.exe \/s slbcsp.dll regsvr32.exe \/s cryptdlg.dll regsvr32.exe \/s oleaut32.dll regsvr32.exe \/s ole32.dll regsvr32.exe \/s shell32.dll regsvr32.exe \/s initpki.dll regsvr32.exe \/s wuapi.dll regsvr32.exe \/s wuaueng.dll regsvr32.exe \/s wuaueng1.dll regsvr32.exe \/s wucltui.dll regsvr32.exe \/s wups.dll regsvr32.exe \/s wups2.dll regsvr32.exe \/s wuweb.dll regsvr32.exe \/s qmgr.dll regsvr32.exe \/s qmgrprxy.dll regsvr32.exe \/s wucltux.dll regsvr32.exe \/s muweb.dll regsvr32.exe \/s wuwebv.dll netsh winsock reset netsh winsock reset proxy net start bits net start wuauserv net start appidsvc net start cryptsvc - Then click save as and name it windows update.bat and Save as type : All files - right click on Windows.bat then click run as admin. -Once done restart the device and check Let me know how does it goes and we have sets of troubleshooting steps for you. Lester Independent Advisor","\"Firstly, I don't have VS 2010 on my machine - I removed it ages ago. So why does it want a service pack?\"- C++ 2010 is essential for numbers programs and games. None of the C++ versions or sub-versions that get installedby a software should be uninstalled. Year versions of C++ are not cumulative.  2005 & 2008 less so as there are also sub-versionsthat are not updates, but special sub-versions for the software\\game that installed themThey use very little drive space (about 180MB total with 25 different C++) and use no system resources when not being accessedby a program that requires that version.Although it may take a while before a problem due to a 'missing' version of C++ becomes apparent, uninstalling them has no benefit,and trying to block the Windows update, or run various arcane commands or Registry 'fixes' is likely to lead to other issues.I reckon it would be easier, and safer to reinstall C++ 2010 (both x86 & x64). Reboot and let WU do the update again.Download: Microsoft Visual C++ 2010 Redistributable Package (x86) - Microsoft Download Center - Download DetailsDownload: Microsoft Visual C++ 2010 Redistributable Package (x64) - Microsoft Download Center - Download Details","Sorry for the long delay. In the end I took the nuclear option and did a clean install. Took some time to reinstall all the apps but now it seems to be working well and updates seem to work OK.Thanks to you and everyone else for the help and the encouragement.","As you can see from my latest post, I've now reinstalled everything from scratch. This seems to include some Visual C++ components which I shall leave severely alone. Thanks for the pointers."]},{"symptom":"Re-activate windows 10 after hardware change        I just changed motherboard+cpu of my desktop so my windows needs a re-activation. Here's the problem.When I first used the troubleshoot, it said something like 'couldn't connect to server, try later blabla'Then I thought maybe I have to try something I else, so I removed the old device from my microsoft account, and thought maybe log in on the new hardware could simply take the place of the old one. Apparently it didn't work that way, so I still got the 'Activate Windows' watermark...Then I run the troubleshoot again, this time it connected, but since I have removed the old device from my account, the troubleshoot says there's no matching system on my account.Is there a way to fix my situation??Thank you!!!!","solutions":["Hi Weier, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Contact support if you have exhausted all options. Activation depends on what type of license you have of Windows 7\/8\/10. If Windows 7\/8\/10 came preinstalled with the computer, that is called an OEM license. For an OEM license, the license dies as soon as Motherboard dies. So essentially it is non-transferable. If that is the case you need to get a new license.However, this is not same for retail licenses i.e. you purchased the license through Microsoft store. That does carry transfer rights. If that is the case, please see the below steps:Run the activation troubleshooter on the new device using the below steps: Go to Settings>Update and security>Activation and run the troubleshooter. and select I recently changed hardware on this device.(Please note that Activation troubleshooter requires you to have digital license linked to Microsoft Account.)If the troubleshooter hasn't helped, you would have to call Microsoft during support hours to get more help.https:\/\/support.microsoft.com\/en-in\/help\/405170...Please let us know if you need any assistance."]},{"symptom":"Windows not asking for authentication from sleep\/lid close unless Windows Hello is enabled        On Windows 10 Pro, I noticed that Windows doesn't ask for password after the laptop goes to sleep or the lid is closed *unless* the account has Windows Hello set up for the account. Is there a way to change this behavior? I already changed the policy in the Local Group Policy Editor to prompt for password after sleep\/hibernate, but this doesn't seem to have an effect without Windows Hello enabled.","solutions":[]},{"symptom":"Credit card not working        There is a problem everytime i try to purchase something it says “there is a problem contact microsoft” an etc things like that ","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand how difficult it could be when things doesn’t work as expected. I’ll help you with this issue. I would suggest you to have a look at the article on Troubleshoot problems when paying for something from Microsoft Store and see if that helps. If the issue persists, we do have a dedicated team for issues concerning to purchase, let me point you in the right direction. I would suggest you to contact theMicrosoft Store support team and they will help you in completing the purchase. I hope your query gets resolved at the earliest. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Uninstalling OneDrive COMPLETELY        So i noticed after \"uninstalling\" onedrive, there is still a folder in users\/username\/onedrive and the fun part, is that pictures, documents, and desktop folders are all automatically in there, and you cant change it!! So i went looking for a solution. Didnt find one. So i came up with one:1. Press Win+R2. Type regedit3. Press Enter4. Press OK\/Yes5. Go to HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders and HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders6. Delete onedrive\\ in contents of files7. Repeat from step 6 for every file that contains onedrive in HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders and HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders if there are none, proceed to step 88. Restart yout device9. Move all folders from onedrive folder to one folder up10. Finally delete that onedrive folder that has been bugging you for the past ethernity, and never see it again in your life, until you acidentally click \"save my files to cloud\" when installing windows 10, because you didnt see the \"no\" buttonDont listen to people that say \"just change that thing from 1 to 0\", they are just telling you to hide the folder, but its still there.","solutions":[]},{"symptom":"Install Office Home & Student 2019        Should I delete earlier Microsoft programs prior to installing Office Home and Student 2019","solutions":["You have posted to the Windows 8 forums about installing Office 2019.https:\/\/products.office.com\/en-au\/office-system-requirements#coreui-contentrichblock-0fnhggfOffice Home & Student, Office Home & Business, and Office Professional 2019Operating systemWindows OS: Windows 10, Windows Server 2019"]},{"symptom":"Incorrect keyboard characters in \"Save\" dialog from browsers        A very weird thing happening with my keyboard characters - in the \"Save\" dialog box from my browser my keyboard is typing random incorrect characters. For example, pressing the \"T\" on the keyboard multiple times might give me a string of text like \"o8dkejhrs\". This is ONLY happening in the save dialog box on my browser, all other keyboard input is working correctly.Some background:Issue first occurred using Google Chrome and has now reoccurred using Firefox.Restart does not resolve the problem.All drivers are up to date.It is a Logitech wireless keyboard - batteries have been replaced, USB has been disconnected and moved to other ports.Running Windows 10 - all latest updates have been installed.Language settings all at ENGLISH - US.I recently performed a clean install of Windows 10. Prior to that I'd not experienced this issue.Dell XPS desktop PC.Does anyone have any ideas?","solutions":["Hi BelindaRoberts2 I am Vijay, an Independent Advisor. I am here to work with you on this problem. 1. Till your problem is resolved and you need to do urgent and limited typing, use Onscreen Keyboard - Type OSK in Windows Start Search Box (Cortana) > Click On-Screen Keyboard2. Run Keyboard Troubleshooter Type Troubleshoot in Windows Start Search box > Click Troubleshoot > Scroll down and click Keyboard > Run the troubleshooter > Follow onscreen directions3. Uninstall & reinstall Keyboard Driver Windows Key+X (Or right click on Start) > Click Device Manager > Expand Keyboards > Right click on Standard PS\/2 Keyboard > Uninstall > Reboot the computer to reinstallDo let me know if you have any more question or require further help.","Thank you for your reply.I have run the troubleshooter with no issues.I will try to remove and reinstall the driver.However I have now also discovered that the same issue is also occurring on my laptop, so replicated across two PC's. Which leads me to believe there is something within my Windows login\/profile that is causing it to occur?","I have the same problem on my Desktop when Save As in browsers (Chrome and Opera not Edge), keyboard types random characters instead of what supposed to type. eg if i hold a instead of aaaaaaaaaaaaaaaaaaa I get something like c8vh4o47itfdcxngbwqi9dlexgobt , completely random.i have a similar problem with my laptop, same behaviour but when I search in Windows 10 searchbar, not in browser window.The on screen keyboard workaround is a temporary solution but it should be fixed somehow.","What anti virus software do you use?I think that I have isolated my issue to Sophos (and a few google searches have supported my theory). But no resolution available from them at the moment.","I can confirm that. I am using sophos antivirus. It was the first I suspected so I contacted them in early May. I attach their answer maybe someone find it useful. What kind of keyboard are you using? Some keyboards that require third-party software will get picked up as keyloggers. You can test if this is the case by doing the following:Login to home.sophos.comFrom the dashboard click the system you're experiencing issues onClick 'Protection'Click 'Web'Under Safe Online Banking click 'Advanced Settings'Toggle 'Protect against Keyloggers' offIf that resolves the issue it confirms that third-party keyboard software is being picked up as a key logger. If this is the case you can either leave this setting off or use a keyboard that doesn't require third-party software. In my case at that moment I had a bloetooth software keyboard (like onscreen keyboard but with bluetooth support), which I uninstalled and problem seemed fixed for a while... but now I suppose maybe it was this sophos workaround.","capvar and Belinda - thank you so much for discussing this here, and steering me to a fix for the problem.I had the same problem, just recently - it was driving me insane because I could think of no obvious cause, and suspected Chrome itself. Sure enough, I use Sophos Home and turning off the \"banking - keylogger\" detection you mentioned immediately fixes the problem. No need for Chrome restart, so this I think is confirmation that it's the Sophos detection causing the problem in isolation - and likely confirmation that Chrome is tripping the trigger for whatever reason.I'll report this to Sophos via the usual channels, and hopefully they can figure it out. I can't see a way to drill into the cause via Sophos Home - the protection is clearly activating only during Chrome's \"Save As\" process, and affecting no other programs (that I've observed). There's no Sophos history as you'd get with clean\/quarantine operations, which is frustrating - if a type of protection has been triggered I'd like to know about it - even for false positives. It would also have helped get the the bottom of this problem sooner, I'm sure.Thanks again guys.","Thanks for identifying this problem\/fix. I also have experienced this recently. It looks like Sophos has documented this problem in their \"support\" knowledge base as follows:Windows 10 1903 - Keylogger protection can sometimes incorrectly encrypt keystrokes in applicationsApplies to: Sophos Home Premium for Windows 10 1903 version Customers running Windows 10 1903 version may sometimes see keystrokes get incorrectly encrypted in some applications, such as web browsers \"Save As\" dialogues, or files or documents.Cause When the feature \"Protect against Keyloggers\" is enabled under Banking Protection, Sophos Home will encrypt keystrokes in order to provide an additional layer of security when performing actions such as typing your credit card information.  However, this feature may sometimes conflict with \"Save As\" dialogues from web browsers, causing them to get encrypted when trying to name a file. This issue can also cause unexpected keystrokes in the Emoji Panel.WorkaroundsIf a reboot does not solve the problem, please follow the below listed options:Option 1 - Using On-screen keyboard:     Use the On-screen keyboard to type within the \"Save as\" dialog boxes     Click on Start      Type \"On-screen keyboard\" and hit Enter to launch it     Use the On-screen keyboard to type the file name within the \"Save As\" dialog     Close the keyboard when finished.     Option 2 - Using a text processing app such as Notepad to copy-paste:     Launch a text processing tool, such as notepad     Type the desired text in Notepad     Highlight the text and copy it     Paste the text in the Save As dialog window as needed    Option 3 - Disabling the Keylogger protection feature:     Log in to your Sophos Home Dashboard     Select the desired computer      Click on the PROTECTION tab     Click on Web and find the Safe Online Banking section      Click Advanced settings     Find Protect against Keyloggers and click on the right circle to disable it (turn it red).     mceclip0.png Related informationSafe Online Banking - Keylogger protection - feature compatibility Let's hope that Sophos sorts this out - FYI - I'm using a Microsoft Sculpt wireless keyboard (sounds like it might be something that affects wireless and BlueTooth keyboards, or is it affecting wired and laptop keyboards as well?)","Not Just Bluetooth.. I have a brand new Dell XPS 15 Laptop and its happening on my built in keyboard. Thank you so much for this fix! It was driving me insane.Turning off keylog protection is sketch tho, maybe we should switch away from Sophos if they cant get this fixed. ","I have been having this trouble for a long time, almost immediately after i switched from ESET. Every time I try to use the special character, it messes up the typing. Like for example, if i wanted to type the \"?\" - I would never be able to type it at one keystroke, it would take me three keystrokes to get the symbol and if i used the backspace key, it would just do random things. I disabled the keylogger protection on SOPHOS and MY PROBLEM SOLVED !!!! I scanned my system with so many different anti-virus software's thinking my system was infected. ALAS now i am at peace! Thank you @capvar !!!! You saved me a tonne of research and headaches! "]},{"symptom":"virus savemax store        Hello, On startup of my windows 10 Chrome browser automatically runs and open weird sites like savemax.store and others. I tried scanning it with Microsoft malware removal tool but nothing happened. Problem is there.Please help how I can get rid of this problem. thanks","solutions":["Go Task Manager, (Ctrl + Alp + Delete), Startup and remove Chrome from the list.","Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,First, I would recommend if there are any third party services or applications causing this1. Go to start menu\/search msconfig 2. On the system configuration window go to the services tab 3. Tick on hide all microsoft service so that this won't be affected 4. Choose to disable all services 5. Next, go to the startup tab and on the window choose to open task manager 6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok 8. A prompt to restart the computer will show up, choose to restart This should restart the computer with minimal third party services starting up right after windows boots up.Also, go to the control panel and see if there are unusual applications installed on the computer1. Press and hold the windows key and the R key to open the run command 2. Input this on the run command appwiz.cpl 3. Check for unusual applications I would recommend changing your google chrome browser's home page to your preferred website1. Open Google Chrome and open its settings which is located on the upper right corner which has 3 dots next to your profile picture2. Choose settings, and under appearance turn on show home button 3. From there, change your preferred homepage on the home page settings. I would also recommend changing your search engine in any case it has been changed as well.Under this link contains information on how to change different browser's search enginehttps:\/\/support.microsoft.com\/en-ph\/help\/402857...Let me know how it goes. :)","Go Task Manager, (Ctrl + Alp + Delete), Startup and remove Chrome from the list.Chrome was\/is never in the startup list :(","Is there any other thing on the Startup that would make Chrome automatically start at startup?","See if this guide helps: How to Remove Adware from a PC In addition I suggest reading:How to tighten security and increase privacy on your browser - Malwarebytes Labs | Malwarebytes Labs and Answers to common security questions - Best Practices which includes Resources to protect your browser, privacy & help prevent browser pop-up ads and scamsHope this helps.","Is there any other thing on the Startup that would make Chrome automatically start at startup?nothing suspicious"]}]}