{"windows":[{"symptom":"Windows 10 S        Hi, I wanted to know about replacing Chrome OS with Windows 10 S. I have a Lenovo Flex 11 with 2.10 GHz Mediatek ARM processor and 4 GB RAMIs it possible?","solutions":[]},{"symptom":"KB4524147 and VirtualHere USB 3 XHCI Controller made my Intel USB 3.1 XHCI Controller on the ThinkPad Thunderbolt 3 Dock Gen 2 failed.        KB4524147 and VirtualHere USB 3 XHCI Controller made my Intel USB 3.1 XHCI Controller on the ThinkPad Thunderbolt 3 Dock Gen 2 failed.Translated by Google Translate.All of my external USB devices failed after I went to work today. The result of the final check was that the Intel USB 3.1 XHCI Controller on the ThinkPad Thunderbolt 3 Dock Gen 2 failed. The error message is Object Name already exists. Code 31. Then I repeatedly removed the device and then did a hardware change scan several times. There was no way to solve this problem, then I started my debugging process.First of all, I removed the KB4524147 first, then it didn't work after rebooting. I also did several removals and hardware change scans. It didn't work, so I started to remove all the software related to Thunderbolt, from the software with the latest installation date. After I started the removal, and after the reboot, I started to update the latest major and recommended firmware and drivers with Lenovo Vantage, and all UEFI \/ Thunderbolt \/ Intel ME Firmwares were updated.After plugging in the ThinkPad Thunderbolt 3 Dock Gen 2, the above Intel USB 3.1 XHCI Controller is still in a failed state. I came to think of one thing. I recently tested the VirtualHere USB Server function, so I installed VirtualHere USB Controller on my computer. I guess I probably have this problem left. After I removed all the Intel USB 3.1 XHCI Controller with the exclamation mark and the VirtualHere USB 3 XHCI Controller, after the hardware change scan, the Intel USB 3.1 XHCI Controller function on the ThinkPad Thunderbolt 3 Dock Gen 2 returned to normal.So the war criminals are KB4524147 and VirtualHere USB 3 XHCI Controller, the victim is the Intel USB 3.1 XHCI Controller on the ThinkPad Thunderbolt 3 Dock Gen 2, and then I am the unfortunate lightning rod that Google can't find the result.ref:   http:\/\/500.wpa.tw\/2019\/10\/if-you-install-kb4524147-it-may-cause.html#KB4524147 #VirtualHere","solutions":["This is Michael from VirtualHere.I investigated this issue and its due to the 9th Jun 2019 Intel XHCI 3.1\/Thunderbolt driver always using HCD1 as its symbolic link regardless of if there is already an HCD1 link existing on the system.The virtualhere driver when loading will always use a spare HCD number by looking for whats already installed and adding one. Eg HCD2However there is a race condition when both drivers are loaded and this causes the conflict.The Intel driver needs to correctly allocate the next symbolic name, this is a bug in the Intel driver."]},{"symptom":"WerFault.exe - Application Error        The instruction at 0x00000000774e41c2 referenced memory at 0x0000000000000150. The memory could not be readI came back to my desk with my PC restarted at this error message every time i try to exit out of it it pops right back up and wont go away and then all of my other applications stop working like steam, discord, one drive, ect","solutions":["Hi EndrFX, My name is Riccardo and I would be happy to assist today with this issue. There are a few things we can do to fix this issue for you... Step 1: Checking Integrity of File System \/ Updates Go to Start > type in cmd > right-click Command Prompt and run as administrator. Type in the following: sfc \/scannow Let the above process run and complete. After that is done, type in the following: dism \/online \/cleanup-image \/restorehealth Let me know if this helps. I will be here to assist until the issue is resolved.","i did the first command sfc \/scannow  but it always stops at 89% and says Windows Resource Protection could not perform the requested operation.","Can you do chkdsk \/f \/x \/r and do a restart before we do sfc \/scannow - there is an issue.","still didnt work","Ouch, I would suggest at this point doing a reinstall or repair upgrade to see if this fixes the problem:https:\/\/answers.microsoft.com\/en-us\/windows\/for...","it wont let me reinstall it just puts out a error and idk how to do a repair upgrade","If this doesn't work, then I suggest getting a clean install done... Backup all your pertinent files and do the following clean install (a how to) https:\/\/answers.microsoft.com\/en-us\/insider\/for...It sounds like the file system is not in good shape."]},{"symptom":"gta v not being able to install        So my friend gifted me gta V from the microsoft store because he wants me to be able to play with him, but when i tried to install it on my pc from the microsoft store, it said you can only download it on xbox. Does anyone know a way to download the game onto pc without having to buy it again?","solutions":["Hi boisour That game only seems to be available for Xbox from the Microsoft Store, the only version I could find for PC was from Steam . . ."]},{"symptom":"explorer.exe Application Error        Lately my Samsung Notebook 7 Spin has been starting up extremely slow and once at the sign in screen it is even slower.Sometimes it runs a diagnostics and\/or repair disk at start up.I am running Windows 10 ver 1909.Now I am getting the message: The instruction at 0x00007FFA5643DE2D referenced memory at 0x0000000004BE9BF8. The required data was not placed into memory because of an I\/O error status of 0x000009c. Click on OK to terminate the program.I click on OK but nothing changes and my laptop goes into a repetitive loop of blacking out and reloading the desktop. It cycles about every 10 seconds. I can’t even initiate any actions.Please help as it is driving me crazy.","solutions":["Hi Jim. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Unplug power and remove battery, press and hold power button for 30 seconds to release all power from circuitry, plug back in and power up to see if any change.I will give you steps to access the Repair Mode to try all repairs to get Windows started, and if not to do the automated Reset or the superior Clean Install after rescuing your files.1) Use whichever method works in this link to access Advanced Startup Options: https:\/\/www.tenforums.com\/tutorials\/2294-advanc.... Easiest may be to force shut down the PC (by holding in the power button) three separate times to trigger the Startup Options. If one of these methods work, then go to Step 3.2) If none of the other methods work it may be necessary to Create Windows 10 Installation Media on another PC following the steps in the middle of the downloads page here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... Make sure to uncheck the box for Recommended Settings to choose only the licensed version.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... Choose the boot device as a UEFI device if offered, then on second screen choose Repair Your Computer. If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first. There is always a way to get the media booted and I will guide you until it does, even if necessary to reset the BIOS to defaults via several methods.3) In the Advanced Troubleshooting options try to System Restore to a point before the problems began, try the new Uninstall Updates button, then Startup Repair, then if necessary from Startup Settings try to get into Safe Mode with Networking, or lastly Safe Mode. If Startup Settings aren't available you can force Safe Mode from the Command Prompt following Step 5 here:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf..., or using the command to unhide F8 Advanced Boot Options here:https:\/\/www.tenforums.com\/tutorials\/22455-enabl... where you can also try the old reliable Last Known Good Configuration.4) From Safe Mode w\/Networking work through the Windows 10 Install Integrity Checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... Update your drivers from the PC's Support Downloads web page. Compare the latest drivers with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.5) If Safe Mode doesn’t work or help stabilize things then return to Advanced Troubleshoot options. Next try Command Prompt to run through Windows 10 Install Integrity Checklist (above link) Step 10 repair commands including sfc \/scannow, DISM, a full Disk Check: https:\/\/www.groovypost.com\/howto\/check-hard-dri..., or return to Troubleshoot options to Reset Your Windows 10 PC.6) Better yet use the same booted media to do the vastly superior Clean Install following the steps in this link to delete all partitions down to Unallocated Space to get it cleanest:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... 7) There is a step to Rescue Files from the booted media or Repair Mode Command Prompt first:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... These steps are excerpted from my tutorial that compiles everything possible for Troubleshooting Windows 10 Failure to Start:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... You can continue with the other steps there.To test hardware, Dell and HP have onboard diagnostics triggered by powering up and pressing the F12 and ESC key respectively.Test the RAM overnight to stress it with the best bootable test memtest86, following these steps which test both the sticks and the slots:https:\/\/www.wikihow.com\/Test-PC-RAM-with-MemTest86Test the hard drive with diagnostics: https:\/\/www.lifewire.com\/free-hard-drive-testin...Best is to use the manufacturer's own if there is one, otherwise use Seatools bootable long test:http:\/\/blog.nowherelan.com\/2013\/04\/04\/boot-seat... Follow this up with a full Disk Check: https:\/\/www.groovypost.com\/howto\/check-hard-dri... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer There are links to a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Recovery Blue Screen Error        How to fix this problem?","solutions":["HI Nurul. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Unplug power and remove battery, press and hold power button for 30 seconds to release all power from circuitry, plug back in and power up to see if any change.I will give you steps to access the Repair Mode to try all repairs to get Windows started, and if not to do the automated Reset or the superior Clean Install after rescuing your files.1) Use whichever method works in this link to access Advanced Startup Options: https:\/\/www.tenforums.com\/tutorials\/2294-advanc.... Easiest may be to force shut down the PC (by holding in the power button) three separate times to trigger the Startup Options. If one of these methods work, then go to Step 3.2) If none of the other methods work it may be necessary to Create Windows 10 Installation Media on another PC following the steps in the middle of the downloads page here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... Make sure to uncheck the box for Recommended Settings to choose only the licensed version.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... Choose the boot device as a UEFI device if offered, then on second screen choose Repair Your Computer. If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first. There is always a way to get the media booted and I will guide you until it does, even if necessary to reset the BIOS to defaults via several methods.3) In the Advanced Troubleshooting options try to System Restore to a point before the problems began, try the new Uninstall Updates button, then Startup Repair, then if necessary from Startup Settings try to get into Safe Mode with Networking, or lastly Safe Mode. If Startup Settings aren't available you can force Safe Mode from the Command Prompt following Step 5 here:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf..., or using the command to unhide F8 Advanced Boot Options here:https:\/\/www.tenforums.com\/tutorials\/22455-enabl... where you can also try the old reliable Last Known Good Configuration.4) From Safe Mode w\/Networking work through the Windows 10 Install Integrity Checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... Update your drivers from the PC's Support Downloads web page. Compare the latest drivers with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.5) If Safe Mode doesn’t work or help stabilize things then return to Advanced Troubleshoot options. Next try Command Prompt to run through Windows 10 Install Integrity Checklist (above link) Step 10 repair commands including sfc \/scannow, DISM, a full Disk Check: https:\/\/www.groovypost.com\/howto\/check-hard-dri..., or return to Troubleshoot options to Reset Your Windows 10 PC.6) Better yet use the same booted media to do the vastly superior Clean Install following the steps in this link to delete all partitions down to Unallocated Space to get it cleanest:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... 7) There is a step to Rescue Files from the booted media or Repair Mode Command Prompt first:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... These steps are excerpted from my tutorial that compiles everything possible for Troubleshooting Windows 10 Failure to Start:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... You can continue with the other steps there.To test hardware, Dell and HP have onboard diagnostics triggered by powering up and pressing the F12 and ESC key respectively.Test the RAM overnight to stress it with the best bootable test memtest86, following these steps which test both the sticks and the slots:https:\/\/www.wikihow.com\/Test-PC-RAM-with-MemTest86Test the hard drive with diagnostics: https:\/\/www.lifewire.com\/free-hard-drive-testin...Best is to use the manufacturer's own if there is one, otherwise use Seatools bootable long test:http:\/\/blog.nowherelan.com\/2013\/04\/04\/boot-seat... Follow this up with a full Disk Check: https:\/\/www.groovypost.com\/howto\/check-hard-dri... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer There are links to a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"How do I \"turn WiFi on, on desktop computer, win 10        How do I turn WiFi on, on desktop computer???","solutions":["Hi, Thank you for writing to Microsoft Community Forums. The Wi-Fi feature is available on all Laptops, only few Desktop computers have the feature of Wi-Fi. For better clarity, please help us with the details requested below: When you say, “How do I turn WiFi on, on desktop computer” are you using a laptop or a desktop?What is the make and model of the computer that you are using? If your computer has Wi-Fi feature available and if you want to connect to a Wi-Fi network, please refer the steps mentioned in the articleConnect to a Wi-Fi network in Windows 10.  However, if you are looking to setup a wireless network, please refer the steps mentioned in the articleSetting up a wireless network.  Let us know the results. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"File Explorer keeps rolling back to top        When there are a lot of files, File Explorer Windows 10 won't let me scroll all the way down to the bottom to look at them all, it keeps returning to the top.   This just started recently.  What do I need to do to fix it? Thanks.","solutions":["No, I'm referring to all of the steps I gave in this post:To remove carescan.exe uninstall DriverBooster program from Settings > Apps > Apps & Features:  What is CareScan.exe (by IObit)? Process description, threat analysis, and user feedbacks - Computer-Process.comIt could very well be the cause of your Explorer problem or at least why it won't fix.If you have a System Restore point or backup image before you installed the IoBit then I'd use it because there's no telling what other damage it caused: How to use System Restore on Windows 10 | Windows Central Download, install and run a full scan with the most powerful on-demand free scanner Malwarebytes Free Version In the Scan Settings first set it to include scanning for Rootkits.  If necessary run it in Safe Mode with Networking, or Safe Mode accessed by one of these methods:  7 ways to boot into Safe Mode in Windows 10 | Digital Citizen  Clean up anything found, restart PC and then run again until it comes up clean.Check for any remainders in Settings > Apps > Apps & Features, and also in each of your browser's Extensions, Home Page settings, Search service or Add-On's as shown here:  How To Disable Plugins\/Add-Ons\/Extensions In Multi... - Box Then check for damaged System Files:   SFC Scannow to Repair Windows System Files If it cannot repair them see Step 10 here to continue:   Windows 10 Performance and Install Integrity Checklist - Microsoft Community If you want to keep Malwarebytes as an on-demand scanner then you can turn off its Real Time trial version in it's Settings > Account Details tab. I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved. ______________________________________________Standard Disclaimer:   There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"realtek audio not found in device manager and will not open in folder.        i reinstalled the driver and i've looked everywhere. RkTNGUI64.exe wont open and Realtek Audio Manager wont appear in device manager as the image suggest belows.please help. i would love to have audio again","solutions":["Check Sound, video, and game controlers.","nothing there either:","Try realtek.com for software\/drivers.https:\/\/realtek-download.com\/download-hd\/looks like realtek goes to win 7,& that is all.Most pc mfg have current drivers,R.click on the file,save as,save to pc.Once downloaded,R.click on it Open as Administrator.If the file is compressed,R.click\/extract,extract to a new folder you created,open new,locate the installation icon & run.One can\/could,open device mgr,audio,update driver,use the Browse button,locate & enter the new folder you created,it should upgrade auto.","Hi FAD. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you all possible solutions for Sound problems in order of priority, so please try any you've already tried again in order. If you have any problems performing any steps I'll be standing by here to help you.1) Update the sound driver from the PC or device maker's Support Downloads webpage for your exact model, if it is newer than the one presently installed in Device Manager reached by right clicking the Start button. While there compare to make sure you also have the latest BIOS, Chipset, Display, Network and all other drivers. If necessary install the Realtek driver in Safe Mode with Networking (so you have internet), or Safe Mode, accessed by one of these methods:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... 2) Restore the Windows Audio Service which may have become disabled: https:\/\/www.tenforums.com\/tutorials\/57567-resto... 3) Next try these checklists: https:\/\/support.microsoft.com\/en-in\/help\/402699... https:\/\/www.howtogeek.com\/443702\/how-to-fix-sou...4) Right click Volume icon in System Tray, choose Sound Settings, from the Output and Input devices dropdown menus, choose then one(s) affected to see if that helps. If not use the Troubleshoot button nearby.5) Run the Playing Sound troubleshooter at Start button > Settings>Update & Security>Troubleshoot.6) Try rolling back the sound drivers in Device Manager reached by right clicking the Start button. Choose Sound controller and other audio devices, then Driver tab, then Roll back if available.7) If no newer sound drivers then uninstall the one presently installed in Device Manager, reached by right clicking the Start Button. Restart PC to reinstall.8) Try other and older drivers for your model Sound controller, too. For example, try the next oldest driver in the model's online Support Downloads list. To try all previous drivers installed on your system, in Device Manager choose Sound controller's Driver tab, then Update Driver, then Browse, then Let Me Pick. Finally, try installing the latest Sound driver in Compatibility Mode as shown here:https:\/\/social.technet.microsoft.com\/Forums\/win...9) If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 10) If this was caused by a Version update (which you can confirm at Settings > System > About) then you can roll back the version in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 11) You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... 12) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. 13) If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","It looks to me that you do not have Realtek audio but NVIDIA.","i used to have realtek audio. but this morning it disappeared, i cannot use nvidia because it comes up with this","listen can someone please help me ive tried many things but nothing works."]},{"symptom":"Windows processes taking up high ram.        Hey,I have a Fujitsu Lifebook A555 Laptop, Intel i3 5th Gen and 4gb of ram. When I look at the task manager, I see windows processes taking most of my RAM. When sorted by RAM usage, this is the order:Cortana, Superfetch, Antimalware Service Executable, and Desktop Window Manager take up about 300mb of RAM which results in lags during work and gameplays.So, what I really mean to ask is, if there is a way to stop them or make them use the minimum amount of ram?Thanks,Jyotirmay Kumar Jha.","solutions":["Hi Jyotirmay. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.You're using less than 50% so it's now alarming. You want to use the RAM or it's wasted. What you don't want is to have the RAM max out so it hangs or slows the PC.Read these to understand more about RAM usage: https:\/\/superuser.com\/questions\/1185130\/windows...https:\/\/lifehacker.com\/know-the-difference-betw...Type Resource in taskbar Search box, open Resource Monitor, click on Memory Tab to see how your RAM is apportioned to hardware and software.Test the RAM overnight to stress it with the best bootable test memtest86, following this guide to test both sticks and slots:https:\/\/www.wikihow.com\/Test-PC-RAM-with-MemTest86Run the Crucial System Scanner to check the RAM is properly spec'd and configured, what upgrade options exist for first quality RAM:https:\/\/www.crucial.com\/usa\/en\/systemscanner?cm... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I would suggest if you want faster response to your laptop you should increase the RAM to 8GB.I did this for my wife and she was amazed at the increase in speed.I have all my computers at 8 GB and have no problems with speed."]},{"symptom":"how do I open the cd\/dvd disk drive on the back of the HP envy all-in-one?        how do I open the cd\/dvd disk drive on the back of the HP envy all-in-one?","solutions":["Hello! I am an Independent Advisor, I would love to help you out! In Windows, search for and open File Explorer. In the Computer window, select the icon for the disc drive, right-click the icon, and then click Eject.Could you give the exact model number of the computer? HP Envy is a series of devices.","Hi, Thank you for writing to Microsoft Community Forums. For better clarity, please let us know: When you say, “how do I open the cd\/dvd disk drive on the back” are you not able to open the drive to enter a disk or trying to replace the drive?What is the exact model number of the HP Envy PC that you are using? To check type:msinfo32 in the search bar on the Taskbar and hitEnter. If the CD\/DVD drive is not getting detected on the computer, I would suggest you to refer the steps mentioned in the HP articleHP PCs - CD\/DVD Drive Is Not Detected (Windows 10, 8). If you are unable to burn CD\/DVD using the drive, I suggest you to refer the steps mentioned in the HP articleHP PCs - CD or DVD Drive Cannot Burn Discs (Windows 10, 8). Please provide more information on the issue that you are facing to help you with the appropriate steps. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Blue screen error        After leaving the computer on but unattended I get a blue screen saying they have found and error and the computer will have to restart.  I just did a refresh of Windows 10.  After last update my computer slowed down a lot.","solutions":["Hello! I am an Independent Advisor, I would love to help you out! Can you upload the dump files from the bluescreen then I may be able to look further into the root cause potentially.The dmp files should be located here: C:\\windows\\Minidump Zip any files and upload them to onedrive and link the download here. From there I can look at it further.","Hi, Thank you for writing to Microsoft Community Forums. I understand that you are getting a Blue Screen error on your computer. I’ll certainly help you with the issue. However, please let us know: What is the complete Blue Screen error message you receive?Are you aware of any changes made to the computer prior to the issue?Are you able to boot the computer to desktop? I would suggest you to unplug all the external devices from the computer except mouse and keyboard and try to boot the computer. If you are unable to boot the computer to the Desktop, I would suggest you toBoot your PC in Safe Mode: Try booting the PC to safe mode and check if it is still crashing. Refer the articleStart your PC in safe mode in Windows 10 In case, the PC is working fine in Safe Mode then you may try performing Clean Boot and see if the PC boots normally. Refer the articleHow to perform a clean boot in Windows Performing a clean boot will start the computer with minimal set of drivers and programs, to determine whether a background program is causing the issue. Some of the Startup programs will not load after performing a clean boot on the computer. However, that functionality will return when you reset the computer to start normally after finishing the troubleshooting. Note: Please refer the section Reset the computer to start normally after clean boot troubleshooting to boot the computer in to normal mode after troubleshooting. If the PC crashes after performing clean boot, I suggest you to perform hardware clean boot while in Safe Mode and check if that helps. Hardware clean boot: I suggest you to follow the steps mentioned below and disable the devices is Device Manager: Press Windows key + R. This will openRun. Alternatively, you can go to Start and search for Run.In Run dialog box, type devmgmt.msc and hit enter.Now, expand Display adapters, Printers, Sound, video and game controllers one by one.Right click on the devices inside the section and click onDisable device.If asked for restart click on restart later and disable all the devices.Close the device manager window and restart the computer. You may also refer the steps mentioned in the article Troubleshoot blue screen errors.  However, as Thagstrom has suggested, please share the dump files with us to get to the root cause of the issue. Let us know how it goes. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"error code 0xc0000098, blue screen        After running chkdsk c: \/r\/x for error code 0xc0000098  - message given failed to transfer logged messages to the event log with status 50, I am now running sfc\/scannow any suggestions?","solutions":["Hello! I am an Independent Advisor, I would love to help you out! Can you upload the dump files from the bluescreen then I may be able to look further into the root cause potentially.The dmp files should be located here: C:\\windows\\Minidump Zip any files and upload them to onedrive and link the download here. From there I can look at it further.","Hi, Thank you for writing to Microsoft Community Forums. I understand that you are getting a Blue Screen error on your computer. I’ll certainly help you with the issue. However, please let us know: What is the complete Blue Screen error message you receive?Are you aware of any changes made to the computer prior to the issue?Are you able to boot the computer to desktop? I would suggest you to unplug all the external devices from the computer except mouse and keyboard and try to boot the computer. If you are unable to boot the computer to the Desktop, I would suggest you toBoot your PC in Safe Mode: Try booting the PC to safe mode and check if it is still crashing. Refer the articleStart your PC in safe mode in Windows 10 In case, the PC is working fine in Safe Mode then you may try performing Clean Boot and see if the PC boots normally. Refer the articleHow to perform a clean boot in Windows Performing a clean boot will start the computer with minimal set of drivers and programs, to determine whether a background program is causing the issue. Some of the Startup programs will not load after performing a clean boot on the computer. However, that functionality will return when you reset the computer to start normally after finishing the troubleshooting. Note: Please refer the section Reset the computer to start normally after clean boot troubleshooting to boot the computer in to normal mode after troubleshooting. If the PC crashes after performing clean boot, I suggest you to perform hardware clean boot while in Safe Mode and check if that helps. Hardware clean boot: I suggest you to follow the steps mentioned below and disable the devices is Device Manager: Press Windows key + R. This will openRun. Alternatively, you can go to Start and search for Run.In Run dialog box, type devmgmt.msc and hit enter.Now, expand Display adapters, Printers, Sound, video and game controllers one by one.Right click on the devices inside the section and click onDisable device.If asked for restart click on restart later and disable all the devices.Close the device manager window and restart the computer. You may also refer the steps mentioned in the article Troubleshoot blue screen errors.  However, as Thagstrom has suggested, please share the dump files with us to get to the root cause of the issue. Let us know how it goes. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Unable to get sound after update        since  updates were done  I have no audio  or volume what can I do thanks.***Modified title from: since comp updates i have no audio or volume .what can be done .***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are unable to get sound on your computer. I’ll certainly help you with this issue. However, please let us know: May I know the update that was installed recently? To check go toStart >> Settings >> Update & Security >> Windows Update >> View update history.When you say, “I have no audio or volume” do you seered X on the Sound icon on the System Try (Right hand side of theTaskbar).Which build version of Windows 10 is installed on the computer? To check type:winver in the search bar on the Taskbar and hitEnter.What is the make and model of your computer? Meanwhile, I would suggest you to refer the troubleshooting steps mentioned in the articleFix sound problems in Windows 10 and check if that helps.  Let us know how it goes. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Unable to connect to Wi-Fi        my laptop network adapter is not working properly***Modified title from: i am unble to connect to wifi***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are unable to connect to Wi-Fi on your computer. I’ll help you with this issue. However, please let us know: What happens when you try to connect to a Wi-Fi network?Do you receive any error message\/code? If yes, what is the error message?Could you please provide us more information on, “network adapter is not working properly”?Are you aware of changes made to the computer recently?Which build version of Windows 10 is installed on the computer? To check type:winver in the search bar on the Taskbar and hitEnter. I would suggest you to refer the steps mentioned in the article Fix network connection issues in Windows and see if that helps. For additional information, see Fix Wi-Fi problems in Windows 10. Let us know the results, we will be glad to help you further. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Windows 7 Professional -> Windows 10 Professional upgrade failing with 0xC1900101 - 0x4000D at 90%        Hey all,I have a handful of stubborn PCs refusing to upgrade as Windows 7's life slowly approaches its demise that are refusing to do in-place upgrades to 1909. I'm getting the 0xC1900101 - 0x4000D error after it BSOD's at 90% after second boot. The stop code is just CRITICAL_PROCESS_DIED, then reverts back to Windows 7 x64.I'm tearing my hair out here, as I feel like I've followed every option found on the Internet. For practical purposes, we can't do clean installs on these.Here's what I've tried so far:sfc\/scannowBringing Windows fully up to dateRebuilding software distribution folderBringing all drivers\/BIOS up to dateDisabled drive that proved troublesome on other devicesUninstalled same driverRemoved AVDisk space is fineClean bootSystem Update Readiness ToolThere are no external devices attached. Just AC power cable for the batteries.Currently we are testing a solution that involved deleting all but one key from HKLM\\software\\microsoft\\ole, but based on previous behaviors I'm not too hopeful.I've uploaded both setupact & setuperr log files to Dropbox, which can be seen here:https:\/\/www.dropbox.com\/sh\/wsygvfducjmb67u\/AAD-xOpYXgw8j05MsXMgMRqwa?dl=0I'm not the best at reading logs, so I was hoping to get some assistance on this.Thanks in advance!Edit: If it helps, while it's still installing Windows 10 (before the first reboot), it seems to hang at 31% for quite a while each time on every device.Edit2: I FIXED IT. For ANYONE banging your head against this wall in the upcoming EOL, Deleting HKLM\\Software\\Microsoft\\OLE, reboot, then upgrade fixed the issue. I found one post describing someone who spoke with Microsoft regarding this fix. It's not advertised.For any concerns, OLE handles COM security and file permissions - The upgrade process rebuilds the key, and thus far on 5 machines I've seen no ramification from doing it.","solutions":["Hi,Thank you for writing to Microsoft Community Forums.We understand your concern as you are facing difficulties in upgrading the Windows 7 PCs to Windows 10, as you are getting the 0xC1900101 - 0x4000D error.In this scenario, we would suggest you to refer the steps as mentioned in this article:Get help with Windows 10 upgrade and installation errorsResolution proceduresSetupDiagBIOS Disclaimer:Modifying BIOS\/ complementary metal oxide semiconductor (CMOS) settings incorrectly can cause serious problems that may prevent your computer from booting properly. Microsoft cannot guarantee that any problems resulting from the configuring of BIOS\/CMOS settings can be solved. Modifications of the settings are at your own risk.  However, if the PCs are in domain network then we would suggest you to post your query inTechNet forums, where we have experts and support professionals who are well equipped with the knowledge on Domain connected PC to assist you with the appropriate troubleshooting steps.Regards,Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"A weird bar from microsoft keeps popping up when I type in roblox         i Have emailed Roblox about 8 times today using my gmail account. This bar has popped up before in the past and it copies the same color I use in my Microsoft settings. Last time this happened it was blue, this time its red due to my display settings. Is there a way to make this bar disappear when I'm typing because Rblox cannot find my problem.","solutions":["Are you in a browser?  If so which one?","Hi MickellMacLeod, Are you able to send a screenshot? I want to see if this is malware or something else."]},{"symptom":"White border flashes on taskbar icon when dragging jump list up.        I've got basically the exact same issue as these folks:https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-performance\/taskbar-icon-flashes-a-white-border-when-left\/e5309321-8625-410c-a08e-e79bd3a559dchttps:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-start-win_taskbar\/white-border-when-activating-jump-list\/af196f25-ad07-4df3-a696-7ff2d22383d0?page=1On a brand new laptop I just got (Dell XPS 13 2-in-1 2019). I actually just exchanged this laptop from the exact same model due to a hardware issue, but the last one didn't have this software problem.I can't seem to find any solution to this, and those threads unfortunately were inconclusive. Can anyone please help me figure out what to do?I've tried rebooting, making a new account, updating to the latest Windows. I tried the DISM thing from one of the threads as well. Nothing has gotten rid of the problem.I'd hopefully like to keep this laptop because it's otherwise great. However, if this is unable to be resolved I will definitely return it.","solutions":["Hi Versatile. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) Update the Display driver from the PC or Display adapter maker's Support Downloads web page for your exact model number, HP Serial Number or Dell Service Tag - from the sticker on the PC.While there check also for newer chipset, BIOS\/UEFI firmware (very important), network, sound, USB3 and other drivers, comparing to the ones presently installed in Device Manager reached by right clicking the Start Menu.If this doesn't give you the latest or ideal driver for what you need, compare it to the driver offered by the Intel driver update Utility here:http:\/\/www.intel.com\/content\/www\/us\/en\/support\/... or the Nvidia Update utility here: http:\/\/www.nvidia.com\/Download\/Scan.aspx?lang=e... or the AMD autodect utility here: http:\/\/support.amd.com\/us\/gpudownload\/windows\/P... For Display issues one fix that is working is to Roll back or Uninstall the Driver on the Display Device > Driver tab, restart PC to reinstall driver.You can also try older drivers in Device Manager > Display device > Driver tab > Update Driver > Browse > Let Me Pick.Then you will know you've tried everything in addition to Windows Update drivers.Adjust the screen resolution until it fits and looks best at Settings > System > Display.2) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 3) If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Versatile. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) Update the Display driver from the PC or Display adapter maker's Support Downloads web page for your exact model number, HP Serial Number or Dell Service Tag - from the sticker on the PC.While there check also for newer chipset, BIOS\/UEFI firmware (very important), network, sound, USB3 and other drivers, comparing to the ones presently installed in Device Manager reached by right clicking the Start Menu.If this doesn't give you the latest or ideal driver for what you need, compare it to the driver offered by the Intel driver update Utility here:http:\/\/www.intel.com\/content\/www\/us\/en\/support\/... or the Nvidia Update utility here: http:\/\/www.nvidia.com\/Download\/Scan.aspx?lang=e... or the AMD autodect utility here: http:\/\/support.amd.com\/us\/gpudownload\/windows\/P... For Display issues one fix that is working is to Roll back or Uninstall the Driver on the Display Device > Driver tab, restart PC to reinstall driver.You can also try older drivers in Device Manager > Display device > Driver tab > Update Driver > Browse > Let Me Pick.Then you will know you've tried everything in addition to Windows Update drivers.Adjust the screen resolution until it fits and looks best at Settings > System > Display.2) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 3) If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.So I just tested this problem on 4 different updated Windows 10 PCs and actually they all had this problem. Could it be a bug in the latest version? I don't recall this being a thing until recently.","Possible. More likely an anomaly with the display driver which governs this.Did you try all the steps I gave to see if it can be Updated, adjusted, reinstalled or downgraded?","When I drag up the white box is around the File Explorer icon.To get the list without dragging up all I do is to right click the icon where I want to see the list.This is the same in Version 1909 and in my Windows Insider build 19536."]},{"symptom":"I can't activate windows because it shows that I am not connected to organization network        please help me.I just added this because windows wanted me to do so","solutions":["Hi Dhruwa Are you seeing a 'Windows will Expire soon' error message in WIndows? 1 Do you know the history of your PC or version of Windows? Is your PC second hand or was Windows reinstalled by a PC Repair Shop? 2 Click your Start Button, type cmd then right click Command Prompt and choose 'Run as Administrator'Run or paste this command and hit Enter: slmgr.vbs \/dlv Please post a screenshot of the resulting dialog . . .","Hello,First, check the type of license installed on your system.1. Open administrative Command Prompt.2. Type slmgr \/dlv and press Enter key.3. Note the Product Key Channel section Windows Script Host box:If it mentions OEM <method>, you’ve OEM license installed.If it says Retail, you’ve retail license installed.If it mentions GVLK, VOLUME_<method> then you’ve volume license installed. Note that GVLK stands for Generic Volume License Key.---------In case if it reports that you've volume license installed, then it is not a valid license to be used by end users (correct me, if your system is part of organization). In this case, you need to buy genuine license for your Windows 10.Hope this helps!","Hey. I could use some help too.On mine it says \"Volume:GVLK\" and then just moves on to whatever else.If it helps, I had the PC custom built and when I got it, it already had windows installed and activated. For some reason, a year or so later it started giving me an error code.Whenever I try to troubleshoot it just sends me to useless guides.The error message is \"We can't activate Windows on this device as we can't connect to your organization's activation server. Make sure you're connected to your organization's network and try again...\" but I'm not part of an organization because this is a personal computer.I could use some help. Thanks in advance"]},{"symptom":"code oX80004005 while attempting to access att email        windows 10 is giving me this code while attempting to access att email account","solutions":["Hi Larry. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Where are you trying to access ATT Mail? Is this the WIndows 10 Mail app, or a browser the old fashioned way?I would try Windows 10 Mail app which is an easier way to access your mail with a huge inbox that lets you merge all of your Office and Web Mail accounts, and an even larger ad-free reading pane. See here how to get started:https:\/\/www.windowscentral.com\/how-get-started-... If you'll also tell me which ATT Mail this is (Verizon, Yahoo, etc) then I'll give you the special settings it may require to input to get it running.If you're wanting to stick with opening your mail in a browser via the ATT site, then try another browser. I would have several browsers on your task bar so there's always one that's best for the task. I use Firefox, Edge and Chrome in that order of preference. It's easy to share bookmarks between all of them in their settings under Import Favorites from another Browser, and Firefox and Chrome let you sign in to save and\/or sync your Favorites on any other device you sign into. Set the preferred browser as Default in Settings > Apps > Default Apps. If that doesn't help then reset the browser as shown here: https:\/\/www.howtogeek.com\/171924\/how-to-reset-y...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]}]}