{"windows":[{"symptom":"Case number        Hi,I called microsoft support, they said I need to give  a case number. I am in a que right now, on my phone, and wondered if I am giving this code to the person I get trasferred to, or simply write it  on the phonekeyboard. I am not sure what category a case number goes in, so sorry about that!Thank you.","solutions":["Hi MounirBanan give the case number to the person that you get transferred to they will then be able to access the details of the case.this is a peer to peer forum (users helping users), we have no access to the case details or case numbers, which is why there is no category for it.but we are willing to help with any issues."]},{"symptom":"Hello Microsoft        Hello, fellow Microsoft people, My name is Kobe I am currently using my Mother's laptop right now to ask you this question.I heard from my friend that he got a free PC from you guys and how thankful he is to get it, He did tell me that it was around Christmas time so I don't know if you guys are still doing it, it's okay if you can't but I would really like it since my current very old Windows Vista Home laptop has completely shut down. And I need one for school and I'm not going to lie to you guys but also for video games, I am currently 11 years old and actually really want a XBOX because I do think Microsoft is a good company (And no i'm not just kissing your guys butts), And also I know he is a really busy man but can you pretty please ask Bill Gates and\/or Paul Allen when the Scarlet (XBOX 2) is coming out, Or even the Windows 11 PS: I've had over 3 Microsoft computers that stopped working due to an error I could not fix, And no one else could either.Sincerely, Your friend Kobe. Thanks for being great. PSS:Tell Bill Gates that this is my favorite quote of his \"Success is a lousy teacher. It seduces smart people into thinking they can't lose.\"","solutions":[]},{"symptom":"Desktop Shortcuts        Why in the name of all hole heck can't Microsoft come up with a way of locking shortcuts in place?","solutions":["Hello HerbertAbrams, You can right click on your desktop, select personalize, click themes, then uncheck allow themes to change desktop icons.","You nave to do a couple of more steps to find that adoption but is it is already not allowed on my computer. For example Audible updated or something this.I don't know how or why.But pop there was suddenly an Audible app Shortcut on my desktop.So I had to delete it and move the others back.Not a overly arduous task but annoying. If they just made so any shortcut additions appeared at the 'End\" if you will that would help.","I don't even want to know what \"hole heck\" is ... but I can tell you that my desktop shortcuts are in the same place, day after day.The only time the position of my desktop shortcuts changes is when my screen resolution changes. For example, if I'm doing work in Safe Mode, where the monitor has a much lower resolution than its native resolution, all the desktop icons are going to move into their default positions for that resolution. And then when I start Windows normally again, I'm going to have to put the icons back to where they originally where.I don't know if you're referring to Safe Mode, but then you didn't tell us what circumstances you're referring to.","Nothing I do caused it. It is not a daily thing just happens sometimes. Generally with an update of installation of a program of some sort.Thanks for the time though.Herb","Hi HerbertAbrams I'll try to help you out. Have you already checked when you right click on the desktop : - View - Auto arrange icons (make sure it's not checked) I hope this helps Regards"]},{"symptom":"windows restore        after i installed several recommended updates, my windows startup disappeared. i'm unable to restore it. ","solutions":["Hi jlp53 Start your PC, just as Windows attempts to load (spinning dots), press and hold Power Button for 5 - 10 seconds to perform a Hard Shut DownDo this twice On the third start Windows will boot into the Recovery Environment and from there you can access System Repair, Safe Mode, Command Prompt . . . etc.Please try each option one at a time, then see of Windows will boot . . . Go to Troubleshoot - Advanced Option - Startup Repair See if Windows startup can repair itself Go to Troubleshoot - Advanced Option - System Restore Check to see if you have a restore point you can go back to If you do not have a Restore Point, go to Troubleshoot - Advanced Option - Startup Settings and click RestartUpon restart, press 4 to enter Safe Mode Once in Safe Mode, backup your data if you do not already have a backup Open Device Manager and check to make sure all your Drivers are up to date Reboot to see if Windows will start Normally If the above fails, go to Troubleshoot - Advanced Options - Reset this PC Choose to keep your files and apps, just your files or to keep nothing Then start the Reset"]},{"symptom":"WIndows 10 going to sleep disconnects Outlook from local Exchange (Does not do this with Win7 machines)        All my Windows 10 machines using Outlook 2016 or later are having this issue - when the computer goes to sleep, Outlook is offline and prompting for user credentials (even with Outlook settings are not to ask when opening - and credentials are not populated in the prompt). The only way to fix issue is to close Outlook and reopen it.I have disabled computer sleep in Power Settings and disabled power management on NIC card (wired desktop), but Outlook still keeps disconnecting from local exchange server when computer is left idle for extended period (over 2 hours) of time.From reading other community topics similar to this issue - this is not an Outlook or Exchange issue, but Windows 10 issue.This is a persistent problem on multiple machines in my office.","solutions":["Hi Charlotte, Based on your concern, there's a lot of people experiencing this kind of issue as well.What I can suggest is to rollback the updates: https:\/\/lifehacker.com\/how-to-undo-and-prevent-...And disable your windows update for the mean time, please follow this link for detailed guide:https:\/\/www.cleverfiles.com\/howto\/disable-updat...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","I just did a fresh install of Windows 10 on my computer (and fresh install of Office Home & Business 2019). The computer did updates after my install. Am I to roll back every update?Other computers in my office using Win 10 OS have Office 2016 or 2019 and are experiencing the same issues. These computers auto update. Am I to go to EVERY SINGLE computer and roll back all the updates? Very frustrating and something I don't want to do.","Hi Charlotte, You must try it at one computer first, once effective. You might have to do that on each and every single computer you have. Thanks and regards,","so Microsoft is basically forcing everyone to Windows 10 (with EOL for Windows 7), yet I won't be able to do any Windows 10 updates?so out of security risk, I am forced to Windows 10, but use it without updates (made to keep the OS safe).  isn't that a paradox?I do not wish to spend all my time at work going around to a dozen computers rolling back Windows 10 updates, modify update settings to NOT update (and be potentially unsafe OS) - this is unacceptable.  In order to use Outlook 2016 or 2019 (without having issues of being signed out constantly) I have to make all these non-recommended adjustments?  That cannot be the only fix.FYI, a few Windows 10 computers using Office 2013 do NOT have this issue."]},{"symptom":"PLUGGED IN HEADPHONE BUT SOUND IS COMING FROM SPEAKERS        I am using an ASUS laptop and I am having Windows10. My problem is that when I am plugging my headphone the notification is coming that the device has been plugged in but when I am watching or listening to something the sound is coming from the speakers instead of the headphones. What should I do now? Please provide the solution asap.","solutions":["click on the speaker icon bottom right of screen to show volume plus an up arrow.  Click on up arrow and it will show you the option of the headphones?  click on them and you're sorted.Otherwise right click speaker icon and explore from there.","Hi akshatshrivastava1 I'll try to help you out. Here is some solutions that you can try : https:\/\/support.microsoft.com\/en-us\/help\/452028...Try to run the embedded troubleshooter (right click on the audio icon, and select troubleshoot).I hope this helps Regards"]},{"symptom":"Windows 10 Pro Recovery Drive        I want to check the integrity of my recovery drive. I have 10 Pro. What size should the total files of the boot be be and what files should it contain? Thanks Desmond Last","solutions":["Hi Desmond, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.The size may vary depending on the configuration of the Windows and other factors.The best way to check it is to try booting from it and exit as soon as you see recovery options.","Thanks for the response. How do I boot from it when I am already in Windows? Regards Desmond Last","You need to restart the computer and press a specific key(found in the computer manual) to select the boot device, in this case is recovery drive.We can help you provided you tell us the make and model.","Hello info copied above. Thanks Desmond Last"]},{"symptom":"Windows 10 Screensaver        I have a brand new HP Desktop with Win 10. My issue is that after setting up a screensaver, when the screen times out, I get a blank black screen. This is regardless of the type of program I use (photos,mystify,bubbles) I have consulted both MS and HP with no luck. MS even had me download and install the MS Iso app to reinstall WinX. My question is this. There is a setting within Timing Out that says \"When plugged in turn off after XX minutes. It is set to 30. Then in screen saver settings it says \"wait XX minutes. I have set this to 15. How do these two settings affect the process? Which one actually determines when the screen times out and ostensibly goes to screensaver? One of the HP \"techs\" suggested I may have a faulty OS and need to reset to factory settings. Ouch!  Can anyone enlighten this old man?  Thank you, Jeff","solutions":["Hi Jeff. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) You referred to Power Plan settings so check them here to make sure they don't conflict with your Screensaver timeout:https:\/\/www.tenforums.com\/tutorials\/2843-change...2) See how to Customize Screensaver to your preferences: https:\/\/www.thewindowsclub.com\/customize-screen...3) See fixes for screensaver here: https:\/\/www.hightechdad.com\/2017\/09\/15\/windows-...https:\/\/www.4winkey.com\/windows-10\/how-to-fix-s...4) Update the Display driver from the PC or Display adapter maker's Support Downloads web page for your exact model number, HP Serial Number or Dell Service Tag - from the sticker on the PC.While there check also for newer chipset, BIOS\/UEFI firmware (very important), network, sound, USB3 and other drivers, comparing to the ones presently installed in Device Manager reached by right clicking the Start Menu.If this doesn't give you the latest or ideal driver for what you need, compare it to the driver offered by the Intel driver update Utility here:http:\/\/www.intel.com\/content\/www\/us\/en\/support\/... or the Nvidia Update utility here: http:\/\/www.nvidia.com\/Download\/Scan.aspx?lang=e... or the AMD autodect utility here: http:\/\/support.amd.com\/us\/gpudownload\/windows\/P... For Display issues one fix that is working is to Roll back or Uninstall the Driver on the Display Device > Driver tab, restart PC to reinstall driver.You can also try older drivers in Device Manager > Display device > Driver tab > Update Driver > Browse > Let Me Pick.Then you will know you've tried everything in addition to Windows Update drivers.Adjust the screen resolution until it fits and looks best at Settings > System > Display.5) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... 6) Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 7) If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Best wishes to you.I'm not part of the silly ratings game that some here play in, so you can go ahead and rate me like trash. I've probably got it coming anyway.  😉"]},{"symptom":"How can you make an app\/program install only for one user account in windows 10        Hi,How can you make an app\/program install only for one user account in windows 10? I don't want for example games that my children install, to appear in my profile, and the other way around.Also, I have 3 users who can log on (2 standard users, and my admin account) but can only see two under the Users folder.thx","solutions":["Hi,How can you make an app\/program install only for one user account in windows 10? I don't want for example games that my children install, to appear in my profile, and the other way around.Also, I have 3 users who can log on (2 standard users, and my admin account) but can only see two under the Users folder.Second question first: User profile folders are created during the first ever log on. If you miss one profile folder then this user has never logged on.In Windows you cannot have programs for certain users only. They are available to everyone. However, you can apply some restrictions, e.g. modify the permissions to the folder where the game resides, e.g. here: C:\\Program Files\\MyChessGame. Doing this is not entirely trivial.","Hi Jurg20 I'll try to help you on this question. During the installation of an app \/ software, if it's possible, you can select if you want to install it for the actual user, or for every user. But not every software is offering this option.I didn't find any workaround, except for the creation of the shortcuts in the start menu.I hope this helps Regards","During the installation of an app \/ software, if it's possible, you can select if you want to install it for the actual user, or for every user. But not every software is offering this option.Smart kids usually find out quickly how to create their own shortcut, even if the program was installed for the current user only."]},{"symptom":"Blue screen while booting from usb with win10        Hello,I am trying to reinstall Windows 10 on my PC. It was installed before, but I decided to dual boot with Ubuntu and broke Windows on the process. I can use Ubuntu fine. I have a usb with win10 iso, I tried it on a different PC and the installer starts well, but on my PC it just leads me to a blank blue screen with no text or anything else.I tried using legacy and UEFI booting, both with the same result. I have a Gigabyte motherboard, if that's relevant.Any ideas?Thanks a lot in advance!JM.","solutions":["Does this start after you install Ubuntu?Are you using x64 or x32 bit?","After installing Ubuntu for some reason I could not start windows again. I formated the partition where Windows lived and created a bootable USB with windows to reinstall it. Right now I can boot with Ubuntu, but when I try to boot with the USB I get this blue black screen.I use x64 bit.Thanks!","Hello Juan, I am Andrew an independent advisor. I have to ask first, did you install Ubuntu first or Windows?If you did Windows first great, while doing Linux did you allow the installer to create partitions on its own and are you using GRUB as your boot loader? There's been issues on Linux side with loading Linux then Windows as Windows eats away at the boot loader causing blue screens to happen. At what point are you getting blue screens?","Hello, indeed I had Windows first (bought the computer with it installed. I also allowed the ubuntu installer to create its partitions and I am using GRUB. Also notice that right now I do not have windows installed since I formated the partition where it was, I get the blue screen when booting with my USB with Windows10 iso.This are my partitions now:Thanks!","Looks like your partitions are ok. Where are you getting the blue screen during the install? It could of course be for any reason at all, first place I look for that happening during install is the USB. Make a new one if you can, even if its a few weeks old it could be out of date. Remember after reinstalling Windows you may need to repair GRUB through Linux, the live CD comes with a repair program or you can use gparted.Try a new USB and let me know where its blue screening during install.","Hi, I will try to reinstall the image on the USB (it takes me around 45 minutes), I will update on that. The blue screen happens at the very start of the installation, right after booting (I don't event get to the installation menu, which I can get to if I use the same USB on a laptop).Thanks!","Hello again, I created again the bootable USB with a new ISO image. The result is the same, I get a blank blue screen right after booting. I tried again on my laptop and the windows installer started alright. ","Hi Juan My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Is your USB formatted as FAT32, NTFS or GPT?","Hello, the USB is FAT32. In order to copy the iso to it I had to compress the install.wim file (I followed the steps here) due to its size since FAT32 only allows files up to 4GB."]},{"symptom":"Touchscreen stopped working.        Good afternoon,After a recent upgrade the touchscreen on my XPS13 9360 stopped working.  Around the same time the USB icon at the bottom of the screen started flashing when I turn the machine on.  The touchscreen does not show up in the HID list.  I have updated the driver and re-calibrated.  The infomation in settings says that touchscreen is not available on this device, which is right at the moment, but I had been using the touchscreen for well over a year.Does anyone have any ideas?  I would welcome any help.Thanks.Lynton.","solutions":["Hi Lynton, Is there any changes before you experienced this problem? Upon checking, most of the time this is caused by the Display Adapter (Driver) Can you please check and revert it to default and see if it will work. Please let me know if you already did. Thanks and regards,","Hi Richard,I hadn't tried your suggestion.  I have now, and unfortunately it didn't work.Thank you for helping.Lynton.","Hi Lynton, I do apologize, I'll be releasing this question in order for other experts may try to assist you.You have a good day"]},{"symptom":"why is this company so bad?        why? seriously, why? Nothing related to microsoft at all works ever not once.I am in the store fighting to buy and download a game wont workI am in account settings fighting to change settings wont workI see talk to virtual agent, another thing that does not workTHIS OS DOES WORKTHIS COMPANY DOES NOT WORKwhy am i the only one that sees this?","solutions":["Hi Christoph. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you the latest fixes working for Store, Settings, and direct way to contact Support if those don't help.STORE FIXES - I'll give you everything possible to repair the store. Even if you've tried a step please do it over in this sequence. If any steps cannot be performed then report it and move on to the next:1) Try updating Store apps: https:\/\/support.microsoft.com\/en-us\/help\/402625... 2) Make sure you have the latest Windows 10 version 1909 in Settings > System > About and if not skip to Step 10 to install it by the most stable method.3) See if the fixes here help: https:\/\/www.pcworld.com\/article\/3053099\/windows... 4) Try running the Windows Store apps Troubleshooter at Settings > Update & Security > Troubleshoot.5) Try resetting the Store cache: http:\/\/www.thewindowsclub.com\/reset-windows-sto... 6) If that fails go to Settings>Apps and highlight Microsoft Store, choose Advanced Settings, then Reset. After it resets, restart PC.7) If that fails then reinstall Store. Type CMD in Start Search, right click Command Prompt result to Run as Administrator, copy the following code and paste it into the box using the Edit tools from Box's top left dropdown menu, press Enter:PowerShell -ExecutionPolicy Unrestricted -Command \"& {$manifest = (Get-AppxPackage *WindowsStore*).InstallLocation + '\\AppxManifest.xml' ; Add-AppxPackage -DisableDevelopmentMode -Register $manifest}\"8) Clear the LocalCache Folder: Open Run by pressing the Windows key + R hotkey. Copy and paste %localappdata% in Run and click OK. Open Packages> Microsoft.WindowsStore_8wekyb3d8bbwe > LocalCache folder. Press the Ctrl + A hotkey to select all content within the LocalCache folder. Press the Delete button. SETTINGS APP - Re-register Settings from Option 2 here: http:\/\/www.tenforums.com\/tutorials\/3175-apps-re... If these all fail then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account because of the serious and persistent problem with corrupted accounts. Then continue with the other steps to go over your install most thoroughly.If nothing else works then do a Repair Install, by installing Media Creation Tool and then choosing to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... -------------------------------------------- But remember that in Windows 10 everything depends upon the quality of the install, and Factory or Upgrade installs are inferior installs which most enthusiasts won't even run because they'd expect endless issues. Consider now or later doing the Clean Install in this link which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... There is also an automated Fresh Start that reinstalls WIndows while shedding corrupting factory bloatware, saves your files, but doesn't clear the drive to get it cleanest:https:\/\/www.howtogeek.com\/265054\/how-to-easily-... I hope this helps. Feel free to ask back any questions and let us know how it goes. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","What does that have anything to do with a **** company offering **** services and **** content? It charged me for a subscription I did not authorize. I can not make a transaction until I cancel that. I can not cancel that until I pay it. I fought with all these useless microsoft websites to get any support. I finally after fighting found a number. Once again I have to fight to get any phone support. It kept hanging up on me. Finally after an 1 hour ordeal got ahold of a human being. That human being told me to go to xbox.com\/refund which in turn sent me right back to microsoft.so once again, store doe snot work, accounts does not work, support is awful and finally not one single element in windows 10 works. Office dont work, azure does not work, bing points does not work. Nothing works.So can your long list of instructions can help any of this, fix the embarrassment called microsoft?"]},{"symptom":"Stuck in s mode        I have a laptop in s mode. it is on windows home 10. I go to settings - activation but there is no option for switch s mode off. instead it wants me to upgrade to windows 10 pro in s mode.I go to the store and type s mode, there I can hit more info, but the get prompt is greyed put and it tells me to \"check with you IT or system administrator\" I bought this computer brand new off of amazon its the acer aspire 5.  I checked already, my account is administrator so it makes no sense, but because im in s mode I cant run command prompt or powershell. ","solutions":["Hi Dillons, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Are you using a standard account?You may try creating another account with admin rights and see if it resolves the issue.https:\/\/www.tenforums.com\/tutorials\/5440-add-lo...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads.","I have already tried this and it did not fix my issue","After countless hours of trying to make it work, i did a full reinstall of the laptop and went to activate In settings and instead of trying to get me to upgrade to pro it said switch to windows 10 home and it worked. thank you for your reply"]},{"symptom":"Windows 10 mail ..        Regarding Windows 10 Mail, how can I copy my Address book (People) to my tablet ?Thanks,Lou","solutions":["Hello LouDifinzio, You can easily export your contacts from your windows 10 mail to put wherever you like by following the instructions given here:https:\/\/www.lifewire.com\/export-contacts-from-w... Disclaimer: Please be aware that the link provided is not a microsoft link, it is advised to not download anything from this site as it is not verified by Microsoft.","I can't find the \"Select Tools |Windows Contacts from the menu in Windows Mail\" in windows 10.Lou","Hi Lou My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help answer your question.Contacts are stored in the People app in later versions of Windows 10. You can't export your contacts located in the People app of a Windows 10 computer to a CSV file. However, you can do this from your online Microsoft account and the online People app. From there you choose Manage | Export Contacts to export the contacts to a CSV file. Go to the other email service and use the Import command to import your contacts to that service.https:\/\/support.microsoft.com\/en-gb\/help\/14103\/...Hope this helps."]},{"symptom":"I lost Pro with new SSD install        I upgraded a Home version tp Pro. Did clean install and lost Pro. How do I get Pro back ?Thank YouKen","solutions":["Hi Ken Open the Settings App (Gear icon on your Starr Menu) Go to Update and Security - Activation Click Change Product key Enter this generic product key: VK7JG-NPHTM-C97JM-9MPGT-3V66T When prompted, click 'Activate Product' If the above does not work first time, temporarily disconnect from the Internet and click 'Activate' again . ..(Note the generic key will cause the Home Edition to upgrade to the Pro edition, then, your own legal licence will activate automatically after you restart (not shut down) your PC)"]},{"symptom":"PC won't boot after lastest Windows 10 update        Hi,Since I updated Windows 10 a few days ago my computer won't boot. It displays the Lenovo logo screen, but doesn't go any further. It doesn't load any Windows screen for me to attempt recovery environment.I don't know how to recover it. Can you help?Thanks","solutions":["Hi GavinCarroll I am Vijay, an Independent Advisor. I am here to work with you on this problem. A. Try to boot into safe mode Power ON your computer and as Windows \/ manufacturer's Logo appears, Power OFF - Repeat 3 timesNow your computer will go into Advanced Recovery Environment Advanced Options > Troubleshoot > Advanced Options > Startup Settings > Restart Press 4 or F4 to enable Safe Mode (5 or F5 to enable Safe Mode with Networking) Log in once Windows starts in safe mode See whether you able to login. If yes, come out of this and start normally. If you are not able to boot like above, You will need to boot through a Bootable USB drive. You will need to create this on another computer which is working -https:\/\/www.tenforums.com\/tutorials\/2376-create... How to Boot from a USB Flash Drive in Windows 10 - https:\/\/www.tenforums.com\/tutorials\/21756-boot-... B. Another option when you are in Advanced Options in previous step is to choose (Note - You won't lose any files in this step)1. System Restore - This will restore your system to a point when things were working fine.OR 2. Startup Repair - Startup Repair upgrade fixes all Windows errors and retains all files, applications and settings.C. Penultimate option could be Reset this PC. In Step A > Troubleshoot > Reset this PC - Keep my files and Remove everything. Choose this carefully as most likely you would like to keep your files.All apps will be removed and windows will be reinstalled. D. Last option could be a clean Install. This is the best method to perform a clean install of Windows 10. (If you want to rescue your files, there is a section Rescue Files when Windows Won't Start)https:\/\/answers.microsoft.com\/en-us\/windows\/for...If you want a very lightweight guide - Start fresh with a clean installation of Windows 10https:\/\/www.microsoft.com\/en-us\/software-downlo...Disclaimer - This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi Vijay,Thank you for your help.I have tried the options you suggested, but they didn't work for me.Option A - didn't boot into recovery mode, it just stayed on manufacturer logo screen.I successfully created a bootable USB on another computer, but when I tried to boot using the USB it just went to a blank\/black screen and stayed there. Option B - wasn't possible, as required A to work.Option C - again required step A access, which I can't get toOption D - I would rather avoid this option as this is my main freelance work computer, with a lot of important programs and apps I can't afford to lose. Also would it require me having to source a new Windows licence?I appreciate your help, but unfortunately I'm still stuck. Any further help you can offer would be appreciated.Thanks!","You should restore \/ repair\/ reset your computer using Media Creation Tool. You will have to cut Media creation tool on another computer if you can't do this on your existing computer.Recovery options in Windows 10 - https:\/\/support.microsoft.com\/en-in\/help\/12415\/... Note - You will get the option to keep your files during reset. But it will remove third party apps including Microsoft Office which will need to be reinstalled. Default Windows 10 apps will be automatically installed. But non-defaults Windows 10 apps will need to be reinstalled.","Hi Vijay,Thanks for your reply, but this is the same information you previously suggested.As I responded earlier \"I successfully created a bootable USB on another computer, but when I tried to boot using the USB it just went to a blank\/black screen and stayed there.\" Restore from media creation is not working for me.And the recovery options in Windows 10 are not an option, as I can't access Windows.Any other suggestions? This is my main work computer, which was working great until this Windows update - I desperately need it back up and running ASAP!!Thank you","Microsoft must release a fix for this problem. None of the proposed solutions work and \"clean install\" is not a proper solution.","Any other suggestions? This is my main work computer, which was working great until this Windows update - I desperately need it back up and running ASAP!!Thank youYour files are in the disk and you can copy them. Download Xubuntu ( www.xubuntu.org ), create a USB stick a do a live boot (option \"try before installing\"). Mount the partition (just click twice on the partition icon that you'll find on the desktop) and copy your files to an external disk. Unfortunately, I haven't found a solution to this issue - most things we find are copy and paste of the same information about bootrec and etc.","Updated this morning before going to work now this is happening to my pc as well.... why is an UPDATE causing my pc to become useless???? Fix this microsoft!!! Now!!!","Did you fix it? Same problem after update..","Yes, I let it do its automatic repair. Re-downloaded the update and restarted the pc (didnt shut it down after update) and it worked. Must be something to do with updating and shuting it down.","Automatic repair continues to fail for me.  I just got this pc on the 18th, some graphics glitches and software conflicts between windows and AMD. I did a complete update for both, twice, and my pc is locked with the Automatic Repair telling me that \"Windows failed to start correctly\" every option in the Recovery Environment comes back with that message."]},{"symptom":"Will there be anything other than Windows 10? Say Windows 11 or later? Or will it be Win10 with version patches?        Just wondering if there will be another Windows- I keep reading it will only be Windows 10 with version patches.","solutions":["Hi Angela Sadly, Windows 11 is an Internet myth, there will be no Windows 11 When support for Windows 8 ends, Microsoft will re-brand Windows 10 to just WindowsThe model Microsoft are using going forward is, twice yearly a new version of Windows (called a Feature Update) will be released. That feature update will include any new Functionality and features available for Windows and will deprecate older featuresThat way, once your PC is up to date, you will always have the latest version of Windows. This is something like the Office 365 model, with the one exception, Windows 10 feature updates are free and there is no subscription .","Sadly, Windows 11 is an Internet myth, there will be no Windows 11 'Sadly' - I wonder why.The newest version of Windows is called Windows 10 v.1909. You can call that Windows 11 if you prefer. Doesn't change anything.The next version of Windows will likely be Windows 10 v.2003 if it isn't called Windows 10 20H1. May as well call that Windows 12. All the same.They're just names."]},{"symptom":"How to reset pin        They are requesting my pin number, don't know it and don't know how to change it.","solutions":["Hi Need Help. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.To set up or change the PIN go into Windows Settings > Sign In Options > Windows Hello PIN.This can be used in place of the password, although the password remains and needs to be remembered since some functions will require it. But on the sign in screen it is faster to use a PIN, the password will still be there under other Sign-in Options.If you cannot Add or Remove the PIN in Settings > Accounts > Sign in Options even after a restart, then unhide Hidden Files in File Explorer > View tab > Options > Folder and Search Options > View tab > tick box to Show hidden Files.Browse to C:\\Windows\\ServiceProfiles\\LocalService\\AppData\\Local\\Microsoft\\Ngc Delete or rename to Ngc.old this folder to reset the PIN. **You may need to first take ownership of the folder: https:\/\/www.tenforums.com\/tutorials\/3841-add-ta... Once you delete or rename the folder it will recreate it so you can add a PIN normally in Sign-In Options. You may need to restart the PC first.For any unexpected problems see the full illustrated tutorial covering all possible problems here:https:\/\/www.askvg.com\/fix-unable-to-add-and-use...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Remove Microsoft Account I no longer have access to        I've recently been getting error messages about an old school account that I had set up. The messages were about needing to update the password, but I don't use the account anymore and just wanted to delete it.The problem is that I no longer attend that school. My previous password no longer works and trying to change the password just leads to an error message to \"contact the administrator\" but I am no longer affiliated with them and as far as they are concerned, the account doesn't exist.I've tried going into settings. I can still see the account under \"Emails and Accounts.\" When I click \"Manage\" it takes me to a login in screen, but I don't have a functioning password and no longer have access to the administrator for the school account because I am not a student anymore.I've tried deleting the account through every other avenue I could find through google and this is now the only place it appears, but the error messages continue to pop up and they are a nuisance.Is there any way to remove the account from my computer that doesn't require a password? It is not even my primary account, but I can't seem to get rid of it.","solutions":["Hi PC. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Guardian Moderator here to help you.One fix that works when a Settings > Accounts > Email and Accounts listing has no Remove button is to look below that to School accounts, choose it there and Remove or Disconnect it. Then the Remove button should appear above.You must also be doing this from an Administrator account. Check to be sure at Settings > Accounts > Your Info.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.","This worked for me thanks!","Hi Greg, I got the same problem with the Microsoft account. However, none of the accounts in the listing have a remove button. For all of them I need to log in into an account in the webbrowser, but I don't have acces to it anymore. When I try the option for if you have no acces it still doesn't work, because the account is disabled. Is there another way to remove it?"]},{"symptom":"Bluetooth connection issue        Hello, I am using windows 10 I have recently update my winodows. I am unable to connect bluetooth eare phone, to be perticular it's Bose soundsport free wireless. I have contated them for the connection issues, I have done some troubleshoots however, nothing worked. On their forum they've informed me this \"Microsoft has the issue up on their forumHERE.  We would recommend reaching out the manufacturer to check for hardware updates such as your Bluetooth adapter.\"So can you get help with this issue. Thanks & Regards.","solutions":["Hi Adarsh.Soni. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I will give you everything that's working for others with the known issues with Bluetooth and headsets:First HEADSET: First try the steps here: https:\/\/www.maketecheasier.com\/fix-headphones-n...https:\/\/www.windowscentral.com\/setting-your-hea...https:\/\/www.lifewire.com\/fix-headphones-not-wor...https:\/\/www.thewindowsclub.com\/headphones-not-w...https:\/\/merabheja.com\/fix-no-speakers-or-headph...https:\/\/troubleshooter.xyz\/wiki\/fix-headphones-...Go to Settings > Devices > Autoplay to look for the device and change the default behavior in it's Dropdown Menu.Right click Volume icon in System Tray at right end of task bar, Open Sounds Settings, in dropdown menus at top make sure Headphones are selected and Connected for both Playback and Recording Default Devices.If not again right click Volume icon in System Tray to choose Troubleshoot sound problems.See how to re-enable the \"Which device did you plug in\" popup which can solve headset issues:https:\/\/windowsreport.com\/you-just-plugged-unpl... (avoid ad links)https:\/\/h30434.www3.hp.com\/t5\/Notebook-Audio\/En...https:\/\/forums.tomshardware.com\/threads\/how-do-...https:\/\/www.dell.com\/community\/Windows-10\/How-g...https:\/\/answers.microsoft.com\/en-us\/windows\/for...Go to the Device Manager reached by right clicking the Start button, choose Sound controller device, on Driver tab choose Roll back or Uninstall, restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver. Do the same for the headset device and\/or it's microphone. Update the Sound driver from the PC or Device maker's Support downloads web page. While there also check that the Chipset, BIOS, Display, USB, Network and all other drivers are the most current.Sometimes it helps to unpair or disconnect all other Bluetooth devices from the PC in Bluetooth settings, then try again to connect the headset.BLUETOOTH Troubleshooting: See Fixes here: https:\/\/support.microsoft.com\/en-us\/help\/14169\/...http:\/\/superuser.com\/questions\/823894\/how-to-ma...Try the Bluetooth troubleshooter at Settings > Update & Security > Troubleshoot. Try turning off Fast Startup at Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change settings that are unavailable > uncheck Fast Startup.Try Updating the Bluetooth driver from the PC maker's Support Downloads webpage for your exact model. Install it even if it's the same or newer than the one in Device Manager reached by right clicking the Start button.Right click Start button to access Device Manager, locate Bluetooth device (if necessary from View tab Show Hidden Devices), on Driver tab see if Roll Back is available, if not try Update Driver, first automatically, then Browse, then Let Me Pick to try all previously installed Drivers. If these fail try to Uninstall the Driver, restart PC to reinstall. Then try pairing again, if necessary run the Bluetooth Troubleshooter again. If you think the BT adapter has failed, you can replace it easily with a USB nano adapter like this one:https:\/\/www.amazon.com\/ZEXMTE-Bluetooth-Receive... ___________________________ If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1909 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]}]}