{"windows":[{"symptom":"Bluetooth        Hello, I have a question about Bluetooth on my computer. I see the label \"Bluetooth and other devices\" in settings but when I open it there is no button to turn Bluetooth on and off. How should I connect my devises to my computer? Is it even possible?  ","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? Is there a button under Action Centre to turn on\/off Bluetooth? as far as I know the only thing that is required is to click the cross then search for a BT enabled device to begin the pairing process.","I am using the 1903 version. There is no button in the Action Center.When I do what you recommend a pops up a window that says \"Couldn't connect\".","Try downloading the latest version of Windows which is 1909. Do you have Bluetooth on your device? Is there an entry under device manager for Bluetooth?To add the BT icon to action centre: https:\/\/www.tenforums.com\/drivers-hardware\/1055...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Please do not download any repair tool which is offered by this site other than the ones I mention\/recommend..Thoroughly research any product which is mentioned here before you decide to download and install it.","Do you require any further help?"]},{"symptom":"Cant switch out of Windows S mode        I went into the Microsoft store and went to thing that switches me out of S mode. I pressed it and it said \"try again later, something went wrong on our end\" its been saying that for a week now. Is there something I can do to fix it? or do you need to fix the problem and i have to wait?","solutions":["Hi Leah_278, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.I understand, try the following: Right-click on the Windows taskbar >> Go to Task Manager >> Services >> wuauserv >> Right-click on this option, then restart the service, now go to the store and try again.How to Reset or Clear Microsoft Windows Store Cache in Windows 10 https:\/\/www.thewindowsclub.com\/reset-windows-st...Press the Windows key + I >> Settings >> Update & Security >> Troubleshoot >> Windows Store (Click on this option) >> Run Troubleshoothttps:\/\/www.tenforums.com\/tutorials\/128622-swit...Press Windows key + X >> PowerShell (Run as Administrator) >> Copy and paste using the mouse button: Get-AppXPackage * WindowsStore * -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$ ($ _. InstallLocation) \\ AppXManifest.xml\"} + EnterThis is a problem known to Microsoft on which it was working a few weeks ago, if the links cannot solve the problem, let's wait for news on this topic.Let me know if you have something else that I can help you with, I'd be happy to help.Happy Holidays Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"How Do I Install Minecraft Without Buying It Twice?  {was:  minecraft}        I bought Minecraft and i dont know how to get it on my computer without buing it twice","solutions":[]},{"symptom":"ekran na lap topu prekida siva pozadina sa linijama vodoravno kad rukom lalo zakrenem ekran pojavi se redovna slika        ekran na laptopu ima sivu pozadinu sa raznim linijama kad ekran malo uvijem odnosno pritisnem okvir pojavi se redovna slika i obratno kad pustim opet siva pozadina sa linijama kako da resim kvar u pitanju je neki kontakt-  -  -  -  - -Google translation:Title:the screen on the lap top is interrupted by a gray background with lines horizontally when a hand tally rotates the screen a regular imageBody:the laptop screen has a gray background with various lines when the screen is slightly twisted or I press the frame a regular image appears and vice versa when I release the gray background again with lines how to solve a malfunction it is some contact* Moved from Community Participation Center","solutions":["ekran na laptopu ima sivu pozadinu sa raznim linijama kad ekran malo uvijem odnosno pritisnem okvir pojavi se redovna slika i obratno kad pustim opet siva pozadina sa linijama kako da resim kvar u pitanju je neki kontakt-  -  -  -  - -Google translation:Title:the screen on the lap top is interrupted by a gray background with lines horizontally when a hand tally rotates the screen a regular imageBody:the laptop screen has a gray background with various lines when the screen is slightly twisted or I press the frame a regular image appears and vice versa when I release the gray background again with lines how to solve a malfunction it is some contact* Moved from Community Participation Center- -These forums are not available in Bosnian. Please select anotherlanguage from the Globe icon at the bottom of this page.Don"]},{"symptom":"Nov and Dec Monthly Rollup Security updates KB4525235and  KB4530734 do not install        The above updates install manually then fail when the PC re-configures on shutdown.  Both pre-requisite updates installed correctly.  Advice would be appreciated.","solutions":[]},{"symptom":"Alexa App for Windows 10 - Where is it?        Hi everyone, I received an Amazon Dot for Christmas (2019) and was assured there was a windows 10 app available, well where is it? The windows store says the app is unavailable, but there is no indication of when it will be available or why it isn't.","solutions":["Hello! I am an Independent Advisor, I would love to help you out! The Alexa app is available in the windows store. You can see it here: https:\/\/www.microsoft.com\/en-us\/p\/alexa\/9n12z3c...","When you go to that link or the Microsoft store what do you see? Can you upload a screenshot?","Hi I am trying to add a screen shot but cant see how.I go to this link, as I have been doing, https:\/\/www.microsoft.com\/en-us\/p\/alexa\/9n12z3cctcnz?SilentAuth=1&wa=wsignin1.0&activetab=pivot:overviewtab select the \"Get\" button, that takes you to the Microsoft store, where the app isn't available.If you could tell me how to add a screen shot I will.Thanks","You can create a screenshot with the snipping tool and then press the attachment button here and find that file and select it. Or you can upload the file to something like onedrive and send the link here.First, make sure that your windows is fully up to date by going to settings > update & security.Also, could you give me the version, edition and build of your OS? You can find this in settings > system > about.","Windows 10 Pro, Version 1809, OS build 17758.1I have checked my PC region and its correct Im in New Zealand.","That is the issue. Currently, Alexa app is not available to your country. If you want to download the app you would need to do a workaround of changing your region.Amazon has not made the Alexa app available to your country\/region yet.","Really?Well back to the store for a refund, and NO more shopping at Amazon. Ive searched high and low for any restrictions at Amazon and there is nothing about regional restrictions in New Zealand. They do have an out printed on the box that says services may be withdrawn without notice, and I suppose for corporate america thats good enough.Thanks very much for your help, and have a great 2020.","I believe the Alexa device itself should work, just the desktop application is not released for your location yet.I am sorry for the news\/inconvenience. I am sorry I do not have better news or information for you. Have an amazing 2020!"]},{"symptom":"Windows original product key        I am using hp laptop. My original product key got blurred and I have no idea about retailer. Please let me know how to get the original product key.","solutions":["Hello HardikTZ, my name is Farah and I'm an Independent Adviser. I can help you regarding this problem* Type in Start menu Powershell and open it. * Type this command in one line: powershell \"(Get-WmiObject -query ‘select * from SoftwareLicensingService’).OA3xOriginalProductKey\"Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolvedCheers! Farah","Hi Farah,Thank you for your reply and valuable time. I tried the same as you suggested but it is not working. Please see the attached image.","In this case, you should follow this KB article from Microsoft and see how you got your copy..https:\/\/support.microsoft.com\/en-us\/help\/10749","It could be also that you have a digital license linked to your account, and not an actual product key..see more information on this link: https:\/\/support.microsoft.com\/en-us\/help\/12440\/Regards! Farah"]},{"symptom":"Upgraded Motherboard, CPU, and RAM and now my windows de-activated itself        Today i upgraded my motherboard to an ASROCK B450 Pro4, Ryzen 5 3600, and Vengence LPX 2x8 GIG RAM, and after updating the BIOS my windows de-activated. Ive tried every troubleshooting method it had availible to me and just said to try again later. I am getting the error code: 0xC004F025, along with it saying in the troubleshoot menu,\"We found a Windows 10 Home digital license for this device running Windows 10 Pro. To activate using this digital license, you need to install Windows 10 Home.\" I dont know if this is a scam from microsoft trying to get me to buy windows or not but some help would be useful. Try not to link me to things saying to \"just troubleshoot\", becuase ive tried it all. Thanks","solutions":["Hi Brian Do you know the full history of your PC, was that originally installed with the Home or Pro version of Windows 10?Because that error you are seeing indicates you have the Windows 10 Pro version installed on a PC which is licenced to the Home version of Windows 10Was Windows 10 ever re-installed by a PC repair shop? Click your Start Button, type cmd then right click Command Prompt and choose 'Run as Administrator'Run or paste this command and hit Enter: slmgr.vbs \/dlv Please post a screenshot of the resulting dialog . . .","Hi Brian Do you know the full history of your PC, was that originally installed with the Home or Pro version of Windows 10?Because that error you are seeing indicates you have the Windows 10 Pro version installed on a PC which is licenced to the Home version of Windows 10Was Windows 10 ever re-installed by a PC repair shop? Click your Start Button, type cmd then right click Command Prompt and choose 'Run as Administrator'Run or paste this command and hit Enter: slmgr.vbs \/dlv Please post a screenshot of the resulting dialog . . . Just shut down my PC for the night, could it be I have 2 HDDs with Windows on them?","Yes, that is possible, if one of those is the Home edition and the other is the Pro edition . . .","Ok, I'll give that a try when I wake up.","im trying to uninstall program files x86, but its telling me i dont have the permissions for it. any idea on how to get past it?"]},{"symptom":"fancy letter fonts in the style of cersives        where can I get letter fonts in the style of cursives writing ?","solutions":["Hello DarylRiewe, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemYou can buy additional fonts in Microsoft store, as an example: https:\/\/www.microsoft.com\/en-us\/p\/cursive-fonts...Regards! Farah"]},{"symptom":"Older Windows application        Hello,I have an old 32bit Windows application that (unfortunately) have an 16bit installer. I tried installing under 32bit Windows 10 but got some issues post-installation. I tried installing on Debian with use of wine and it functions ok. The outcome from these two described scenarios are disturbing from the pointview of a consumer who have bought a Windows 10 Pro license, i.e me! What does Microsoft have to offer me if I really would like to get my old app function using Windows?Since I have Windows 10 Pro I could use Hyper-V and install old bullet proof Windows XP ... if that was available and possible to activate. Why do not Microsoft offer a virtual version of XP ready for Hyper-V plug-n-play?Any help for me out there?!?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.Windows 10 kernel is different from the older Operating Systems. Hence, some of the old software may not run on Windows 10.Definitely you can run a virtual OS to execute the software. If you have a valid product key you can Activate. However, you need to have the installation media too."]},{"symptom":"i cant update my win 10?        hi everyoneI have a problem when I try to update my win 10 :I don't have Avira antivirus on my computer, I uninstall it a long time ago,I try everything and everywhere to find Avira antivirus but nothing....does anyone know what should I do?","solutions":["Hi S.MR Most likely Avira was never installed on your PC, this is a known bug in the update process . .Open Windows File Epxlorer Navigate to : c:\\windows\\system32\\drivers Check for this file in that folder - avipbb.sys If you find it, delete it Try the update again If thta does not resolve the issue: Click the link below to download a zip file https:\/\/aka.ms\/AppRPS Unzip that file Double click appraiser.bat to run that batch file That batch will find the blocking file - delete the blocking file Then try running the update again . . . Source: https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"Built a new PC, but cannot activate windows        I just built a new computer, and my old one had windows on it. I did not manage to get the product key because i thought it was the product ID (which i now know are two separate things), and wiped my drives. My friend used a USB to put windows on this new computer, and  it prompted me to sign into my account and all that stuff, which i did. At first, i thought it was fine because it didnt prompt me to activate windows, but today when i turned it on it said to activate windows. I have my product ID and even found my order number from when i bought it a few years ago, is there any way i can use those to get my full copy of windows, because i really dont want to drop $140 on windows again.","solutions":["Hi XtremelyMaxxed Since you have your order No. you can prove you purchased Windows 10, your best option is to have that to hand, then contact Microsoft Support and have them activate Windows 10 on your new system:Choose a local Phone Number: https:\/\/support.microsoft.com\/en-us\/help\/13948\/..."]},{"symptom":"i cannot play my blue ray dvd on my pc        i cannot play my blue ray dvd on my pc","solutions":["Hello JosephOlphert , my name is Farah and I'm an Independent Adviser. I can help you regarding this problemWhich Program are you using to play Blue Ray? There's no Built in program in windows 10 that plays this format, I advice you to install VLC player, which is free and supports a wide range of formats and It plays Blue Ray smoothlyhttps:\/\/www.videolan.org\/vlc\/download-windows.htmlPlease note that this is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Regards! Farah","Do you have a Blue Ray player for your PC? Does it have a CD\/DVD\/BR (BD) player tray? I bought a USB connected Blue Ray player for use with my Desktop Computer. Here are my devices that show in Device Manager."]},{"symptom":"Troubleshoot Activation Problem        I've had my computer for about 3 years now, I haven't tinkered with it what so ever technically or physically yet as I don't see the need. But I've continuously done needed Windows 10 Updates.To make it clearer, I own a legitimate copy of Windows 10 Pro, it came with the Computer itself. Up until now it was running fine, no problem up until a month ago or something like that and the new update rolls out, eagerly and in anticipation I quickly rush to download the update. Behold! 'Please active windows', ... hold on. But I own a legitimate copy of Windows? What's going on? So I go and investigate into my activation settings, and see the following.This must be just an internet issue, right? So I go call my operator, and I see that the internet is fine nothing else. I reset everything leave it for a few days, come back. The problem is still there.. I guess I'll troubleshoot. Troubleshoot has completed.. but the problem persists; your copy of Windows cannot be activated, make sure you are connected to the internet and contact your system administrator.So I go to change product key, I dig in my old box find the list with all the needed info, I type it in and then.Something interrupted our troubleshooting, please try again later.To say the least, I am baffled, amazed and shocked at the same time, I am at a loss for words and have found no solution to my everlasting problem. Now I beg for you the community and someone else to help me in my time of crisis.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. I suggest you to kindly Reset the PC again. Log in with the same Microsoft Account. Open Windows Store. Download any free small app. Close Store. Go to Settings and check for Activation.","The problem persists, thank you for trying through with that one.It still says that the troubleshooting is being interrupted, or no internet connection.","You've mentioned that the Windows came pre-installed with the PC.As above methods did not work, you may need to ask the manufacturer of the PC to courier you the Recovery Media."]},{"symptom":"Slow file tranfers with Win 10 PCs        I am frequently having to move large amounts of data (several GB) between my Win 10 laptop and desktop. I have both connected to my router with Ethernet cables. The laptop does not have a dedicated Ethernet port but I am using a USB to Ethernet adapter. Under adapter settings I have both Wifi and Ethernet enabled on the desktop, but the laptop only permits wifi. The file transfers can take hours. Is there a faster way?Peter","solutions":["I am using a USB to Ethernet adapter. Under adapter settings I have both Wifi and Ethernet enabled on the desktop, but the laptop only permits wifi. The file transfers can take hours. Is there a faster way?When your USB to Ethernet adapter is properly installed then it will appear in your laptop as an Ethernet port as shown below (Ethernet 6). It will work at the speed specified for this adapter.","Can you tell me how to install the adapter?","There are three options:It comes with its own driver (like mine)It comes with a driver CDYou download the driver from the manufacturer's web site","What type USB port is on your laptop, is it 2.0 or 3.0? You say both the Laptop and Desktop have wi-fi, are they both gigabit wi-fi? What about the Processors on each one? SSD and HD can make a difference too.I got a new Laptop for Christmas and yesterday I copied all the pictures 184 GBs and Video 165 GBs from my Desktop to my Laptop and it only took a little over an hour. I was transferring the copies from a HD to SSD using wi-fi. Transfer speed during this went from 50Mbps to 70 Mbps.","Hi, what is transfer speed in fact? What exactly connection do you use? PC cable - router - USB-to-Internet adapter or PC WiFi - router - laptop WiFi?","The transfer speeds are about 350 kb\/s. For 8 GB its slow. I think I need to get a driver for the Ethernet USB adapter.Peter","Try another adapter. Seems current operates at USB1 speed. If it is connected to USB3 port try to reconnect to USB2 port if you have one.","I think my Laptop is USB 2. Another Insignia adapter I have is recognized by the computer, the Ebay one is not.","Try to find another adapter. You may use cable LAN, isn't it? Does you router allow access from one PC to another?","Yes, both computers are plugged into the router.  The issue is that the laptop does not have an Ethernet port. As I said, the Insignia adapter does work. I was trying with the other adapter purchased on Ebay. No \"ding\" when it is plugged in ."]},{"symptom":"How To Undo Custom Display Sizing From 500%        I increased my screen to 500% and now I can't take it back, I can't see anything","solutions":["Hi MacVilakazi try this winkey+I to open settings tab then enter to open system tab 10 times, that should take you to \"turn off custom scaling and sign out press enter","Correction, sorry if it is a laptop with version 1903 or 1909 try winkey+I to open settings tab then enter to open system tab 6 times, that should take you to \"turn off custom scaling and sign out press enter (if it is in the right place it will sign out)","It's really working.","I am glad you sorted it.","My bad, It's not working.","what did happen? did it sign you out? is it a laptop or desktop? do you know what version you are running? (microsoft keep moving things around)","No, it does not even open any tab after settings. I'm using a laptop (windows 10) I'm not sure about the version though.","sorry, i may not have been clear, lets try again. first press Alt+f4 this will close the active window, keep pressing alt+F4 until only the desktop is showing.winkey+i will open settings press the Tab key (normally on the left side of the keyboard just above the caps lock)press enter press the Tab key a further 6 times press enter if that does not sign out, lets see if we can show the windows version click start (or the start button on the keyboard), type winver press enter the version and build are close to the top of the window, hopefully it will show on the screen.","It dpes not sign out. Version 1903","strange, i have tried it again on my laptop with 1903 and 6 tabs worked. try with only only 5 tabs and see if you can identify what it shows on the screeni.e. press Alt+f4 this will close the active window, keep pressing alt+F4 until only the desktop is showing.winkey+i to open settings press the Tab key press enter press the Tab key a further 5 times press enter"]},{"symptom":"numeric keyboard error        since two weeks numeric keyboard showing error, when I type 7 it is type 79, also other numbers work same.   ","solutions":["Hi Dhanan, this may be keyboard fault. Please try another keyboard, the simpler the better."]},{"symptom":"No Instant Search Result in File Explorer        When searching in file explore search results are displayed right below the search bar in a list, but only when you hit Enter, the complete result is displayed.How do i restore it so i have Instant Search Results. Verson:  1909OS Build: 18363.535","solutions":["Hi Nigels, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.This is based on the new File explorer improvements shipped with 1909. Unfortunately, you cannot get back the older design. However, more search improvements are coming with the next patch in January so make sure to keep an eye.I hope that helps."]},{"symptom":"system restore        There is a glitch with system restore. if you use a pin to sign in to Windows then performing system restore by going to settings>update and security> recovery>.advanced startup> restart now and choose system restore to be in special environment for system restore to work best.Most times entering your password or pin will not work. In order for this to work you must restart and sign in with a password not a pin then itworks.Please escalate this to the appropriate tier for remediation.","solutions":["There is a glitch with system restore. if you use a pin to sign in to Windows then performing system restore by going to settings>update and security> recovery>.advanced startup> restart now and choose system restore to be in special environment for system restore to work best.Most times entering your password or pin will not work. In order for this to work you must restart and sign in with a password not a pin then itworks.Please escalate this to the appropriate tier for remediation.Were you able to verify this and did you get resolution from Microsoft?"]},{"symptom":"Alcor micro SD card reader driver not installing        I have hp touchsmart tm2 2102tu tablet pc. it has Alcor micro SD card reader, which windows 10 cannot detect. The driver available at hp website are for windows 7. While installing those I get error message from pc that an administrator is blocking installation. And nothing happens. I want that device to work for me. What should I do?","solutions":["Hello Raghvendra, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemCan you please try downloading this driver package from a 3rd party software, https:\/\/drivers.softpedia.com\/get\/CARD-READERS\/...It should support Win 10 64bit, If it didn't workout, let me know please Regards! Farah"]}]}