{"windows":[{"symptom":"Windows Update Error (0x80070424) & missing \"Windows Update\" in Services   | version 1909        Windows Update Error (0x80070424) & missing \"Windows Update\" in Services   | version 1909","solutions":["Hi, Mohd My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.If you have a third-party antivirus, you must disable or uninstall it. Try reset Windows update components: Right click on the start button and select Powershell (admin) or Command Prompt (admin)Write the next hit enter after each line. net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Restart and try again. You can also download the Windows Error Solver: https:\/\/support.microsoft.com\/en-us\/help\/10164\/...https:\/\/aka.ms\/wudiag You can do it manually by downloading the Windows ISO. When updating with the ISO, disconnect the Internet. https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/answers.microsoft.com\/en-us\/windows\/for...","I tried to reset Windows update components.for \"net stop wuauserv\" command, i got this","Try to update manually by downloading the Windows ISO, check the links I sent you."]},{"symptom":"Win 10 1903 update lost user profile        Windows 10 auto updated v1903 this morning (talking about 45 mins), and after completion, I could not access my pc on my normal user profile.After rebooting I could, but very sporadic behaviour, no defaults or user customisations (office, mozilla bookmarks etc)  and soon no programs would run.Have uninstalled \/ recovered to previous version and the system is fine now.What can I do to check or back up details, before retrying the 1903 uodate?Thanks","solutions":["Hi Mick Sorry, a poor choice of words . . . What I mean is to boot your PC to your Desktop, then choose Restart from the Power menu on your Start Menu - do that 3 or 4 timesIf the restart option is not available on your Start Menu, then on your Desktop, press Alt + F4 to bring up the Close dialog . . ."]},{"symptom":"how can i remove facebook from my home computer without closing my facebook account        I am having some issues with my home computer ,wish to remove facebook from it temporarily with out closing my account how do I do this ?","solutions":[]},{"symptom":"New Windows 10 family laptop used by a child        We have a new HP machine with Windows 10 that will be used primarily by a 12 yr old child in our family. I need to learn the basics of how to set up family so we can set controls with it. I just turned the machine on for the first time and stepping through the set-up and it is asking me to sign-in with an email, phone or skype. Should I sign in with my personal email or my child's email? I don't know how this info will be used later if I want to set controls on it. Can someone point me to so decent tutorials? ","solutions":["No.  To be in charge you need to set yourself as primary account holder.You will be able to place the controls on the child's account."]},{"symptom":"Disallow access to Location Services in Windows 10        Hi,I have sifted the whole net on how to prevent a user from modifying the settings found in the control panel and location services.  Basically we have an app that accesses Location Service information and is dependent on this information and thus needs to be available all the time.   In a nutshell, we do not want the user to alter Location Service settings. I have tried both options below in the registry and group policy settings.  I'm aware that I can ask the IT administrator to block access to the control panel, but I would prefer not to go down that road.  On the other hand, nothing seems to disallow the user from turning it off.  I'm sure that there should be some way, because some sites give the solution when this option is \"greyed out\" and allow access to it again.  Hence, my question which is the inverse of this is, how can I get it greyed out instead?Option 1:HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\CapabilityAccessManager\\ConsentStore\\locationValue string:Deny=OFF; Allow=ON Option 2:Group Policy --> Computer configuration-->Administrative templates-->Windows components-->Location and sensors-->Windows Location ProviderI have full access to the computer, hence I can use powershell scripts, batch commands, domain group policies or if need I can develop a piece of code that enables location services through .NET  coding.  Hence, I'm open to any possible solutions.","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.If you use group policy editor to enable the services as in this guide: https:\/\/www.thewindowsclub.com\/location-service...Then this will prevent the user from changing the setting. Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hello Ross and thank you.  I've seen and tried that post; with the exception of the \"Select the Key (folder) named as 3\" and delete it. The solutions provided didn't work and also the article is more focused on removing the \"greyed out\" issue. In my case, I want to grey it out for the user.; and even after modifying the registry and rebooting the tablet seems not to be doing its trick.. :(","What edition of windows are they using as some features are only available in enterprise or eduction?","Windows 10 Pro ","And it is a Surface PRO with in built GPS and LTE","The only other way I’ve seen reported of this working is using step 5 in this article:https:\/\/www.tenforums.com\/tutorials\/13225-turn-...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Yes,  tried that as described in my first post called \"Option 1\".  No luck with that :\/  The option didnt come as greyed out.  Maybe because he is in the administrators group this option will automatically be available no matter the registry settings?","Yeh I think because the user is also an administrator anything you change will just be able to be overridden"]},{"symptom":"Laptop hangs when i switch on and to use it        Hello.i have Acer nitro 5 ( AN515-52) and bought in Oct 2019.Lately, the display was flickering and notification pops showing \"display driver failed to start\".And at that time I thought it is because i haven't installed the antivirus, and luckily after installing the antivirus the problem was cleared.Then after 2 3 days( in regular use) when I turned ON my laptop, the laptop hangs when I try to open any folder or start menu.I restarted it 3 4 times, but nothing changed.In one try, one message came that \" Microsoft Windows is not responding\" or \" Microsoft windows isnt loading\" not sure which message was that. But it had two options  1. End process  2. Cancel. Sometimes the laptop also takes a long time in processing after entering password and before appearance of windows.Dont know what to do.Ctrl + Alt + Del is also not working. tried all other combinations.Please help. Guide me what else to try.","solutions":["Hi jaiminv9 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Thanks for the help.But as I mentioned, when I start the laptop, it doesnt let me open any of it.When I click on start, it hangs at that moment.Then the only thing I can do is to restart it and face the same problem again.Please can you suggest some other ways.","HI jaiminv9, I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/www.minitool.com\/news\/advanced-options-...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thanks! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Opengl errors in minecraft in windows 10        Hello Pals,I Need some help in fixing opengl errors in minecraft.I Recently Upgraded my PC OS to windows 10. When i installed minecraft and ran it, it crashed, Saying Its An Opengl error.I am using Intel® 82945G Express Chipset Family.Kindly Help Me","solutions":[]},{"symptom":"transferring licensed retail version of Windows 10 to a new computer        I have a full licensed retail version of Windows 10 on my old computer.Full details please of how this ma[y be transferred to my new computer.Am not an IT guru so need details of where to access the old  Product keyMany thanksCharlie #&","solutions":["Hi Charlie You will not need a product key, so long as that licence is linked to your Microsoft Account, work through the steps on this page to prepare your licence to be transferred to the new PC:https:\/\/www.groovypost.com\/howto\/transfer-windo...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]},{"symptom":"My HP ENVY keeps printing my sons school picture, with ALL BLUE eyes. No Pupil. Anyone know why?        I am so confused and appreciate any help.  My sons school picture we bout the CD and I am printing from home. My son has pupils along wigth his nlue eyes....then\/….I print it...and my HP ENVY dwecided to volor the wentire eyes blur.the ink levels are normal.  I've never has anything so strange happen to me before","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.It might be a case of needing to clean the print heads on the printer, this procedure varies by model so if you check the manufacturer guide for the steps.Regards, Ross","I am so confused and appreciate any help.  My sons school picture we bout the CD and I am printing from home. My son has pupils along with his blue eyes....then\/….I print it...and my HP ENVY decided to color the entire eyes blue.the ink levels are normal.  I've never has anything so strange happen to me beforeThank you so very much for an explanations and I am just not quite sure how to clean the head? I am afraid I will break something! hahaha If you happen to know of the HP ENVY 4520 and know this\/happened to. etc.  I am grateful you gave a solution....just gonna figure out how to do it! :)"]},{"symptom":"What is the secret to importing videos into the Windows 10 Photos app?        I have MP4 videos that I created using the camera on my cellphone stored in my videos folder on drive C.  When I pressed the Import icon on the Microsoft Photos app and selected the folder where my videos are stored, it did not allow me to import any files. I am stumped? What does Import mean?  I Googled YouTube training videos for Microsoft Photos and found 3 videos.  None directly answered my question.  So I have come here.  What should a newb do to learn how to import videos into Microsoft Photos app? ","solutions":["There are many possible reasons:The Photos app doesn't match the OS. Though it is an easy and basic viewer and editor built-in Windows 10, it features hardware acceleration. If your hardware is too old to catch up with this technology, failure to edit videos and images happens.Software conflicting. It is generally due to a programming bug and typically manifests when they compete for the same resource (memory, peripheral device, register, etc.)Video codecs are corrupted. Your video format, MP4 is compatible with almost all of media players and editors. But corrupted codecs make videos invalid with every app.I used to have the same question, and it turned out to have something to do with software conflicting. So I detected and removed the program, and then the problem was solved.Your problem may be caused by other issues. I believe you have tried to update, troubleshoot, and restore the app since you watched the YouTube videos (I found them, too). So now try to restore corrupted codecs, detect and delete conflicting software or malware, and <link removed>"]},{"symptom":"Windows 10 and HP PSC500 printer\/scanner\/copier        Is there any way to connect an HP PSC printer\/scanner\/copier to a computer with Windows 10?  Do I need  a Microsoft driver to make this work?Thanks in advance for your answer.CharlesPittsburgh","solutions":["Your printer has no Windows 10 driver. It is long obsolete, unfortunately. How does it connect? Does it use USB? If so, you may be able to use the print feature by installing another HP driver whose features are close. If the PSC 500 uses HP PCL for a language, there are numerous drivers that support HP PCL.","Brian - maybe you can advise why I can't get my new surface pro X with windows 10 to print to my HP color lazerjet pro MFP M477 printer? I've tried EVERYTHING and it won't print from my surface. it does print from my adjacent desktop so the printer is fine and working. HP finally told me there is no driver for this printer and referred me to MS. Any suggestions what I can do to get printing from my surface? thanks. Don"]},{"symptom":"KCleaner isn’t uninstalling?        This app called KCleaner is in my apps & features and it wont uninstall. Every time I click on it and try to uninstall, nothing happens. I’m not sure where it came from but it’s super frustrating not knowing if it’s malicious or not. I can’t find much online besides it being a PUP. The publisher says KCSOFTWARESCPRA. Can someone let me know if this hurts my computer and how to uninstall? Thank you.","solutions":["Run Windows Defender and Malwarebytes and see if they find it.","Hi, thanks for posting your question in the community! My name is David, an independent advisor and I am here to help you.The application to which you refer \"KCleaner\" is a third party software that theoretically optimizes your hard drive, which Windows already does on its own therefore may affect the performance of your PC and I recommend uninstalling it.Since you inform me that you can not uninstall it in the traditional way \"Control Panel> programs and features> uninstall\" I recommend using the following tool to remove such software from your computerhttps:\/\/support.microsoft.com\/en-us\/help\/17588\/... Let me know if the information has been helpful or you still need more help, I will be waiting for your response.","I wouldn't want to have that program on my computer....Try uninstalling it with free Geek Uninstaller .If necessary, see if this guide helps: How to Remove Adware from a PC In addition I suggest reading:How to tighten security and increase privacy on your browser - Malwarebytes Labs | Malwarebytes Labs and Answers to common security questions - Best Practices which includes Resources to protect your browser, privacy & help prevent browser pop-up ads and scamsand  Top 10 Ways PUPs Sneak Onto Your Computer. And How To Avoid Them.Hope this helps."]},{"symptom":"System Reserved disk is showing in File Explorer        I was detected one of my partition of my PC, after restarting my pc, System Reserved disk is showing in File Explorer.I want to hide it, and create a new partition for Unallocated space showing in Disk Management.","solutions":["Hi Abhishek in disk management right click on the system reserved partition (first partition of disk 0) and select \"change drive letter ant path...\"click the remove button to remove the drive letter. right click on the unallocated space and select new simple volume and follow the wizard to create the new partitionlet me know if you have any problems"]},{"symptom":"Foxit PhantomPDF Standard from Microsoft Store        I once purchased it from the store only to find that it was not nearly as capable as the 'same application' purchased directly from Foxit, which I was already using on my main computer.So, I requested and got a refund from the store and purchased it from Foxit again.Today, I again needed the same app for another computer while my main computer has Windws 10 1909 installed with only a black screen displayed, again, as has been the case after every feature update and sometimes after a cumulative update.  This time 10 days passed and I can no longer roll back to 1903, which eventually worked with drivers obtained via 'Check For Updates'.  The Microsoft Store told me that I already owned the 'Foxit PhantomPDF' App.  So, I downloaded and installed it on this computer.  But I am concerned that it might be just a trial and that I may be charged for it even though the store said that I owned the app. Have any of you had experience with this app purchased from the store?It appears that the app from the store still does not allow creating a PDF from, for example, the clipboard contents!Reviews at the store include numerous inclusions of the word \"Scam\".I consider this app a major SCAM!","solutions":[]},{"symptom":"Windows 10 1909 - Microsoft Store stuck on installing Visual C++ (2012, 2013 2015) and DirectX Runtime        Hi! I just set up a new PC and installed on them Windows 10 1909 (November Update) just from scratch. After installing drivers I noticed that everyday in background Microsoft Store is trying to install MS Visual C++ Packages and DirectX Runtime - without success. This installation just runs in infinitive loop. I tried Windows Troubleshooter by MS Store, during first scan it found a issue with installing these, but without solution. Second time it didn't found any issue.Whatever it block, it's doing a mess with other apps that require Visual C++ (like updating GeForce drivers).My PC: AMD Ryzen 7 3700X, 32 GB RAM, MSI MPG X570 GAMING EDGE WIFI motherboard (with X570) & GF 1070 GTX.","solutions":["Try run Windows Update and check for update in Windows Update and restart your PC.","I tried that too. Everything's up to date. edit: Any more ideas?","How long you are in this loop?Report this issue as bug in Feedback Hub app.","I think almost since the beginning - shortly after installing system on fresh hardware and some additional software (like for my graphics card, mb). Everything is up to date, software like CCleaner also didn't help. I will try Feedback Hub..."]},{"symptom":"Fix high CPU usage by TiWorker.exe process in Windows 10        on my computer there's a windows operating system called  Tiworker.exe how do I fix this issue on windows 10 platform? I have tried many ways Microsoft explained but cant figure out where the settings are located on mine due to their explanations referring to windows 8 being the platform they were referring toMoved from: Windows \/ Windows 10 \/ Windows update, recovery, & backup *Modified title for accuracy**Original title: High cpu usage caused by tiworker.exe*","solutions":["Hi Jacob,The TiWorker system process is related to Windows Update. This is one of the critical process included on in Microsoft Services and must not be mistaken for any malware issues. If there are any updates happening or if the computer is scanning for any update release, this system process may use resources on your computer, the reason why you see it has high CPU usage under task manager. This is completely normal. For your reference, kindly visit the link to a similar thread provided here:Windows 10 high disk usage caused by Tiworker.exe.If you think this was useful, you may \"mark it as an answer\" to help those who are facing the same concern."]},{"symptom":"When i start a program i get to see all the movements but my mouse and keyboard freezes. Pls help        Hello im CasperMy Problem is that when i start a program. It works but my mouse and keyboard freezes. After a few minutes or seconds i can move them again but not on the screen of the game. I can start google chrome with no problem and it doesnt freeze but only things like discord League of Legends..... all of the games and game launchers are freezing my mouse and keyboard. pls help!!!","solutions":["Hi Casper. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) Go into the Device Manager reached by right clicking the Start button, right click the Keyboard to uninstall, restart PC to reinstall. Then do the same for the Mouse, Restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver.2) Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.3) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 4) If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hello Greg,as soon as I read your answer, I was thrilled, so clearly, it is a real pleasure to read something like this.I love itEditI have now read your link to the Windows 10 Checklist for Performance and Installation Integrity and I agree that it is the best way to get a well-functioning system.Unfortunately there are often people who just want to let go of their anger and are unwilling to admit their own lack of understanding. I also believe that Malwarebytes is an industry standard and not harmful to Windows. Everything you write sounds plausible and understandable. I will use your contribution as a reference in the future and point this out. I am very happy with Win10 and it is the best win for me. Thank you for your contribution!","I wanted to add one thing i dont know if its relevant but i think its like everytime i want to watch YT or other things that moves it blocks my mouse and keyboard till the video is finished. I tried all the steps you wrote for me except the last one because then everything will be gone. But if this information that i added brings ideas up pls respond. When there is nothing to do i will do step 4 too.","Hallo Und diese Fragestellung führen wir nun im Deutschen Forum auf Englisch fort damit auch ein jeder versteht worum es gehtDanke @ AllLiebe grüße UWE","Please read Step 4 again as it clearly says that it will save your files, apps and settings while reinstalling Windows.But Your files should always be backed up because a hard drive can die at any time without notice. Some suggestions to help ease into this habit:1) You can sync your Desktop, Documents and Pictures folder using OneDrive Backup, or just drag valuable files into OneDrive folder, offering 5gb free with additional space for cheap:https:\/\/www.tenforums.com\/tutorials\/116029-turn... 2) Google Drive has a new Backup that allows you to choose User folders (Documents, Pictures, etc.) to sync up to 15gb for free to their cloud in real time so it always has the latest version.https:\/\/www.google.com\/intl\/en-GB_ALL\/drive\/dow... 3) In addition I'd have an on-site hard copy backup. The best way to do this is to sort all of your files into their User folders and then drag or copy them to another hard drive, USB external or flash drive. Here's how to drag, copy or move large groups of files: https:\/\/www.pcworld.com\/article\/2086566\/the-man... 4) Besides your files you should save a System Image back up to use in place of reinstall in 20 minutes. The best free alternative is Macrium:http:\/\/www.howtogeek.com\/howto\/7363\/macrium-ref... You can even use the Macrium program to mount and extract files from this image so it can serve as both image and file backup too.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Just an ideaThermal Throttling CPU or GPU?New thermal paste for the CPU and fan should also be checkedWhen your GPU takes on a heavy workload, such as gaming, it generates a load of heat. When your cooling solution can no longer dissipate heat fast enough to keep temperatures within a safe range, your graphics card starts to dump performance to shed heat.The core and memory frequencies begin to drop - along with your framerates - until temperatures drop to a safe operating range. All modern GPUs have this feature in place to protect the electronic components from damage. Unmanaged, thermal throttling can have a big impact on performance. And, while thermal throttling itself doesn’t cause any damage, the underlying cause of throttling, heat, can cause damage and shorten the lifespan of your video card.","Alright Uwe, just to finish the thread ok?","Hi Pepi du kannst gerne weiter machen der ist schon im Englischen Forum und werde jetzt das Abonnement aufkündigen und erhalte dadurch keine Mails mehrLiebe grüße UWE"]},{"symptom":"Windows 10 folder encryption        I have right clicked a folder -> properties -> advanced -> selected \"encrypt contents to secure data\".  A gold padlock appears on every document in the folder.  My question, when I attach a document out of that folder to gmail and mail it to someone, it is not encrypted, does not require a password to open etc.  So what is the point of folder encryption, it doesn't appear to be working for me.Thanks!Ben","solutions":["Hi Benjamin, this encryption works only when file is on the computer's storage and this storage has NTFS file system. So yes, when you send such file the encryption is lost. This is by design.The encryption is conceived to protect data stored on PC from unauthorized access not data one shares to other users.","I believe you can password protect OneDrive files if that is sufficient for you.  "]},{"symptom":"Put monitor to sleep (not the whole os) with keyboard shortcut        I long time back, on windows 7, I found a small light weight program which, upon execution, would turn the monitor screen off (sleep), but not the whole operating system. That was helpful as my physical button on the monitor was not very responsive. I am looking for a keyboard shortcut now. Is there any? ","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.You could try this free utility: https:\/\/www.softpedia.com\/get\/System\/System-Mis...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Signing my Account out of my old PC but keeping all documents and files        Hello,My dad has taken possession of my old PC with my Microsoft Account still logged in. He has his own business and would like to keep all the files, documents and pictures already saved in my documents from my account. He is afraid that having my Microsoft account on my old PC would cause problems for me because my Microsoft account is also linked to the Galaxy Book I am currently using.I tried adding his own account on my old PC, but that didn't have all the files that are currently in my old PC's log in from my account. How do I change the Microsoft Account to my dad's from my old PC while still having the current documents that are present on the PC from my account? I also saw that I can add a family member in my Microsoft Account. Is that a good alternative in sharing the files from my old PC between my account and my dad's? I need all the help I can get.Thanks,Leann","solutions":["Hi Leann My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help answer your question.Create a user account for your Dad and login then logout Login with the an administrator account Press Windows + X keys on the keyboard, select Control Panel. Select System and Security and then System. Click Advanced System Settings. Under User Profiles, click Settings. Select the profile you want to copy. Click Copy to, and then enter the name of, or browse to, the profile you want to overwrite. This will usually be in C:\\Users\\username, where username is the name of the profile to which you are copying.Click Permitted to use, and then add all user accounts to which you want to give full profile control.Click OK. or Backup your files manually to an external hard disk then restore in the new account. Here is a guide how to do that:How to manually backup and restore your files https:\/\/answers.microsoft.com\/en-us\/windows\/for...After backing up your files, you can log in to the new account, then follow the steps to restore the files.You can then delete the old account by following these steps: Click Start > Settings > Accounts > Family & other users select the account Click Remove Hope this helps.","Hi Leann Ab,If you put the files in the \"Public\" folder usually at \"C:\/Users\/Public\" then you can both easily access the same files.Have you considered purchasing Office 365 Home?  That would give each member in your family (maximum of 6 members) an additional 1TB of cloud storage each.  That is 6TB total.  Sharing is built-in to OneDrive.https:\/\/onedrive.live.com\/about\/en-US\/plans\/I hope that helps. "]}]}