{"windows":[{"symptom":"File Manager Problem in Windows10        Lately when using file manager with pictures (.jpg) the thumbnails will not show.  No matter which size choose picture thumbnails will not appear.   The problem is further complicated because a simple re-boot fixes the problem and thumbnails appear for while... then a day later disappear.  Two other pieces of info. 1- When I open a picture folder the thumbnails flash on for a split second then off.  2- Pictures folder and subfolder is on OneDrive.Not sure how this got started but any help is appreciated. ","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. There might be some issue with indexing the thumbnails. Please perform the following steps: Open Start. Search for Command Prompt, right-click the top result, and select the Run as administrator option.Type the following command and press Enter: sfc \/scannow Similarly, enter the following command once above command is executed successfully.DISM \/Online \/Cleanup-Image \/RestoreHealth Restart the PC at the end.","Thank you and I have performed this fix as instructed.    Thumbnails do appear but they always do after a re-boot so we will need to see if this is a permanent fix. ","Please observe the PC for a couple of days and let me know."]},{"symptom":"Microsoft store apps crashing (ONLY APPS, NOT MICROSOFT STORE ITSELF)        Self explainatoryWhat i tried:wsresetresetting apps and microsoft storepowershell commands","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,Method 1: Reinstall apps through powershell 1. Open powershell with admin permission 2. Type in the command below and enter. Set-ExecutionPolicy Unrestricted 3. Then type in the command below and press the enter. Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_. InstallLocation)\\AppXManifest.xml\"}4. Restart the computer and monitor if the same behavior occurs Method 2: Create a new user profile 1. Search for netplwiz on the start menu 2. Click on Add 3. Choose to sign in without a Microsoft account 4. Fill up the form and choose finish\/done 5. Highlight the newly created user account from the user account\/netplwiz window6. Hit properties and set it as an administrator 7. Sign in the account and check if the same behavior occurs Method 3: Inplace-upgrade To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo... 2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept. 4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)"]},{"symptom":"win 10 how to use bootable usb        tech spt not getting back to me - i did get a bootable usb made - i think now what?","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Reboot your PC with this plugged in. Sometimes certain models with load this automatically, other times your need to press a key whilst your PC is booting up to choose a boot device.There should be a prompt on screen for this (very briefly) Regards, Ross","thanks for your reply - without a working computer, it was 2 days hence that i found this by logging in elsewhere - better response than I have had from MSN - some half dozen promised phone calls never received - I guess it's obvious that I can\/waht to reboot with the USB file - but it's what comes NEXT that I am totally unsure of - have never done this before without tech support, and don't want to totally screw up things - the bi promise was that win 10 would install over top of win 7 and all my apps would still be there - I groan at the thought of having to reinstall 30 some apps - I have done it before - it takes weeks to get it all running again.....again - thanks for reply - at least someone is paying attention..."]},{"symptom":"JBL 600BTNC emits low battery warning sound but only on Windows        Hi there,My JBL 600BTNC (a bluetooth headset) emits a sound when battery is low with 5-10 mins (Idk the exact span) intervals until battery dies. But this does not happen on my Android phone. This behaviour is very annoying. The warning sound interrupts whatever audio coming from the computer. I contacted JBL, they recommended me to get in touch with Microsoft since this only happens in Windows. Is this a Windows feature? Is there any way to turn it off?","solutions":["Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.Windows does have a battery alarm notification for bluetooth devices. I'm linking you to this article that is focused on Keyboard and Mouse but it should be the same for bluetooth headset devices.https:\/\/support.lenovo.com\/us\/en\/solutions\/ht07...Please let me know if I can help you further!Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Windows 10 keeps freezing        For about a month now I have having issues with Windows 10 freezing. At first I thought it was Chrome so I did a complete uninstall and install a fresh copy. Before I installed it I attempted to use Firefox and was having the same issue. This happens at least a dozen times a day. Often freezing it so badly that I have to shut it down and restart. I have ran MalwareBytes, SUPERAntiSpyware & TrendAntivirus+ and all come up clean.Any help in fixing this is issue is greatly appreciated.","solutions":["Hi IB. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Make sure you only have one installed antivirus and if you want best Windows performance it should be only Defender gives best Windows performance, is built in, has least issues and is from Microsoft who knows how to protect their OS best.Malwarebytes is the undisputed best on-demand scanner and it has the best anti-spyware app built into it now, so you don't need dated SAS which no expert has recommended for 8 years.If any steps cannot be performed normally then try them in 1) Safe Mode with Networking (so you have internet) or 2) Safe Mode accessed by one of the illustrated steps in this guide:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... 1) Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.2) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 3) If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... -------------------------------------------- But remember that in Windows 10 everything depends upon the quality of the install, and Factory or Upgrade installs are inferior installs which most enthusiasts won't even run because they'd expect endless issues. Consider now or later doing the Clean Install in this link which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... There is also an automated Fresh Start that reinstalls WIndows while shedding corrupting factory bloatware, saves your files, but doesn't clear the drive to get it cleanest:https:\/\/www.howtogeek.com\/265054\/how-to-easily-... I hope this helps. Feel free to ask back any questions and let us know how it goes. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","GregThank you for replying so quickly and with such in depth advice. I really appreciate that and am making my way through the steps.This makes me uneasy as I've never done this before and don't want to make matters worse.Type msconfig in Start Search box, right click System Configuration Utility to Run as Administrator.  In the tab for Services tick the box to Hide all MS Services, disable everything except anti-virus, any sync, stickies, printer with scan.  All others are freeloaders on System Resources, cause conflicts , spy on you and do not need to Start with Windows unless you know for sure you need them on stand-by at all times.  If in doubt you can Google the name or ask back here.There are a ton of stuff in the listing so I want to be sure I don't disable the wrong things.If I read this correctly I can disable everything except my anti-virus, any sync, stickies (not sure what they are) and printer.Thanks","Yes, but double confirm you ticked the box that says Hide all MS Services. If you want to post back a screenshot of each ticked box thereafter, I will tell you what they are and why they aren't needed, or may be.See how to post a screenshot so we can see what you're seeing. Here's how: http:\/\/windows.microsoft.com\/en-us\/windows-10\/o.... Attach using Attach Image button in reply box.","Good Morning Greg,Sorry that it took so long to reply with the holidays I got sidetracked and couldn't go through the process. I got through all the steps and ended up installing the Media Creation Tool and doing the upgrade. I also did a complete uninstall of all three browsers, drivers are all up to date, checked apps to make sure they are working perfectly and spent a few hours cleaning unneeded pictures, documents, etc out of the folders. There were no damaged files found during the process which was a good thing but it was still freezing. So today will be the real test as far as if all these steps fixed the issue. I use the desktop version of Instagram and that is the only thing I can see that is still freezing. I completely uninstalled it and reinstalled but it still seems to freeze. Of course there is never a way to get help with program. It is the messenger part of it that is having the issue but I can live with that. I am thinking I need to increase the memory as it's a tad on the low side so I'll order that and see if that helps with the overall issue. I think the issue started after the last update and was hoping that after a few days everything would just settle in.Thank you for fantastic advice and if it starts acting up again I'll come back and post but for now it seems to be working great.Have a great New Year,Sandra","GregI see that you haven't read my post back from December. I assume like most of us your a busy person.Just something interesting. After I went through all of the process you suggested and things were working well they started up again.Like I said I did a complete uninstall of Chrome and Firefox thinking that was the issue. Every trace of those two were removed.Someone suggested Vivaldi because I don't use a cell phone and I have a Instagram account. Vivaldi if the only browser that allows you to upload images and send messages right from their browser. Otherwise you have to have a app which means each time you want to do something you have to bring the app up. I was having trouble with that crashing or freezing also. So I installed the Vivaldi and haven't had a issue since. No freezing, no crashing. And super fast with the addition of not having to launch the Instagram app each time. I was told by a few people that Windows doesn't like to play nicely with Chrome and I think in my case that was the issue. Again, thanks for your help.","hi my name annnmarie  iand try  updata window and said that im missing  improtnat scertiy device so how can get  that  deivce","im  try up date  window  it   keep  said  improtnat security device is missing  os   how   do I find   that device "]},{"symptom":"System restore in Win 10 taking a long time maybe idle        I had to system restore my desktop from win 10 but its stuck 4 hours now on \"file and settings are being restored system restore is initialising\".Has it crashed in which case in order to stop it I should kill the power? or shall I let it continue?How long is it likely to take if it should be left working on?many thanks","solutions":["Hi parthampatis It depends really on the amount of data, as a rule if that is stuck in the 'files and settings' phase, the best option is to let that continue, even though it has been 4 hours, it is only really if it gets stuck in the 'Restoring the Registry' phase for a long time, that would indicate the restore process is not going to complete . . .","thanks very much.The C drive is an 500MB SSD with minimal amount of data. Most of the data are sored in a separate 3T HDD. thanks again"]},{"symptom":"Settings not showing up in the taskbar        If you don't understand the title, if i open settings its not in the taskbar.Any fix for this?(Random topic because there isnt one for taskbar issues)","solutions":["Hi Soloaaaa, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.The closest topic for this is desktop, Start and personalization :) Nevertheless, As Start and Taskbar are a part of shell you should execute the following steps: https:\/\/support.microsoft.com\/en-in\/help\/12385\/...Let us know how that goes."]},{"symptom":"I can’t fix my PC        Hi, im DuoAbout three weeks ago, my PC got crash so i can not get access into my home screen. Then i download the window10 setup.exe and move them to my USB, after that I boot my crash PC  to Recovery Environment screen but i don’t see the button “Use another device” to boot the file setup to repair my computer. Then i boot into “Safe Mode” and try to run setup program but very disappointed that window couldn’t install in “Safe Mode”. I need help to fix my PC!ThanksDuo","solutions":["Hello Johny, You can create a bootable windows 10 usb stick to then reinstall windows fresh without needing to boot into safe mode. You can find detailed instructions on how to do this here:https:\/\/www.microsoft.com\/en-us\/software-downlo...","Hi MichaelIs there a only way to fix? If not, please tell me other option but still use that setup.exe to fix.ThanksDuo","If you are wanting to repair the existing windows already on your pc you can use the same instructions and just select repair my pc instead of installing a fresh copy of windows. However if that doesn't work its recommended to just do the fresh install using the method in the link provided. Using setup.exe will not work if you are unable to execute it in the windows environment. You will need to create a bootable usb as outlined above.","Hi MichaelThank you for reply me! Can you tell me the instruction of create bootable USB, I don’t know to create :\/ThanksDuo","Not a problem! Glad to help! And all the instructions to create and use the bootable usb are given here:https:\/\/www.microsoft.com\/en-us\/software-downlo... on the site there are instructions to get you going in no time! This should get your pc back to running like new!"]},{"symptom":"Windows Malicious Software Removal Tool x64 - November 2019 (KB890830) - Error 0x800711c7        How do I fix this; Windows Malicious Software Removal Tool x64 - November 2019 (KB890830) - Error 0x800711c7on my Surface running Windows 10 in S Mode.It happens every time that I try to run the Updates.Please, remember that I'm talking about a Surface Go running on Windows 10 S, most of the commands that run on a regular Windows it doesn't on S mode System.A lot of people are experiencing this issue on their Surface's since last November and still no fix is available.Note: Not interested in switching to Windows Pro Thanks in advance.","solutions":["Hi Hector, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues while installing update on your PC, and I certainly appreciate your efforts in trying to resolve the issue by running the troubleshooter. One of the things that you can try is resetting the Windows updates components manually, and see if that helps. You can run the script to reset Windows updates components by following the articleHow to:Reset Windows update components in Windows bySumit If the issue persists, then you may want to run System File Checker and DISM scan, and see if that helps in installing updates. Refer the articleUsing System File Checker in Windows 10  Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator","I can't use that on a Windows 10 S.","I have had the same issue sine November...l logged it on the feedback hub, stipulating that I am on Windows S mode.  Not changing to PRO as it is my 90 year old mothers surface go, so don't try telling her to do anything complicated.  Microsoft has to understand that some people do not know, nor do they want to know how to do anything technical.  Come on Microsoft lets fix this...for all the users who are not technical using your devices!!","I wonder why some possible answers are to switch to Windows Pro, then why Windows S in the first place. I consider my self very technical, I'm retired computer programmer after 30+ years dealing with mainframes and MS-DOS, Windows 95, 98, Vista, 7 & 10. And the main reason to get a Surface was it simplicity. So MS, please fix this.","\"Win10-S mode is not supported, there is no added value of running MSRT on this platform. Any install failures of attempting to install the package can be safely ignored.\"Source: https:\/\/support.microsoft.com\/en-us\/help\/890830\/remove-specific-prevalent-malware-with-windows-malicious-software-remo","Amazing that a 'Microsoft Agent' isn't aware of what can or CANNOT be run on windows 10 S...although explicitly pointed out that ONLY solutions for 10 S would be helpful...you had one job!!","Amazing, this issue appears to be sleeping, nobody cares about it.","Amazing, this issue appears to be sleeping, nobody cares about it. - If you've read my prior post (Windows Malicious Software Removal Tool x64 - November 2019 (KB890830) - Error 0x800711c7 (Ṣmeed Replied on December 15, 2019)), you will have seen that Microsoft is clearly aware of this issue.Otherwise they wouldn't have provided that linked statement.  ;) Why not just follow their advise and ignore those failed update attempts? I imagine that Microsoft is already working on some kind of fix and will do whatever they think needs to be done...","\"Why not just follow their advise and ignore those failed update attempts?\"Because it's the first time that I'm aware of those instructions.Now, I wonder if this issue will affect the installation of other updates. ","1. Because it's the first time that I'm aware of those instructions.2. Now, I wonder if this issue will affect the installation of other updates. -1. Sorry that you didn't see my first post of Dec 15, 2019... 2. As far as I know: The installation of other updates is not affected..."]},{"symptom":"Minecraft skin pack purchased but didn't unlock        I purchased the Teen hd skin pack in Minecraft but it didn't unlock, it just wants me to pay for it again?","solutions":["Hi Tahila, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.I suggest reaching out to Minecraft support if you think you have waited long enough.https:\/\/help.minecraft.net\/hc\/en-us\/articles\/36...Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","I paid for the skin pack teen h, it paid for it but I never received it, is it possible to refund it or receive it if I have screenshot proof of a recept, my bank account balance and my Minecraft account?","Hi Tahila, sure they would help. You can get a refund too, I think. Please ask Mojang support on twitter or fill up this form: https:\/\/twitter.com\/mojangsupporthttps:\/\/help.minecraft.net\/hc\/en-us\/requests\/newDisclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"Battery not charging        hello, today something went wrong, i don't know why. the battery is not charging, i plugged in for at least 5hours today But nothing is happening. and when i removed the charger the laptop shut down, i mean got locked. indicator showing 0% charging.","solutions":["That is the way that the pc is designed. You can change your power settings to high performance, but if the laptop is designed to run better plugged in then unfortunately theres nothing that can be done about that. I would recommend contacting the computer manufacturer as they will be able to further assist you with your questions."]},{"symptom":"Slow data transfer speed        I bought HP-15dk0045tx recently with 8 gb ram.Afer two months i have data transfer speed issue.My pc transfers data to USB at  less than 2  mbp.i have tried at 3.0 port but nothing changed.But same USB transfers data at good speed in other laptop.I m really worried about my laptop.Help me to get out. * Moved from Community Participation Center","solutions":[]},{"symptom":"BSOD        What is BSOD?","solutions":["Hello Dluncan, BSOD is a term for the blue screen of death, or the error screen given when windows encounters a major error."]},{"symptom":"Accidental email message storage folder deletion.        Hi: I believe that I have deleted one of my major folders from my email storage folders  and then from my deleted folder files. I am using Windows LiveMail. Is there a way to recover that folder from somewhere?????  ","solutions":["Hello Barry, It seems that this problem has been addressed here: https:\/\/answers.microsoft.com\/en-us\/windowslive... by a couple other advisors. Please follow the instructions given and see if that helps. It is possible however that they will not be recoverable at all."]},{"symptom":"game        can i return a game i bought?","solutions":["Hello.\"If you purchased a product from Microsoft or Microsoft Store, you can request a return. You'll then find out if your product is eligible for a return. If you purchased a product from another organization, contact that organization to request returns or refunds. You can check your Order history to verify what you've ordered from Microsoft.\"https:\/\/support.microsoft.com\/en-hk\/help\/10558\/microsoft-store-returning-items-bought-for-exchange-refundWindows game terms of sale :https:\/\/www.microsoft.com\/en-us\/storedocs\/terms-of-saleBest regards."]},{"symptom":"El sistema para reestablecer la contraseña no funciona        Hace unos días utilize este comando \"lusrmgr.msc\" y borre mi cuenta de administrador y ahora me pide una contraseña que no conozco así que cogi una USB y instale en esta el asistente para recuperar la contraseña pero siempre al finalizar me arroja un error ","solutions":["Hola Sergio Soy Edisson, un Asesor independiente dispuesto a ayudarte. ¿Qué error te arroja exactamente? Te sugiero revisar cada uno de los pasos indicados en el siguiente hilo de la comunidad, te pueden ser de gran utilidad para tu caso.https:\/\/answers.microsoft.com\/es-es\/windows\/for...Estaré muy atento a tus comentarios. Recibe un cordial saludo, te deseo un excelente día. Edisson V."]},{"symptom":"sales program  windows 10 da runtime error 217 at 004098aa  error        what could be the problemit works when you upgrade from windows 7 to windows 10 ... but it doesn't work when you install win 10 and run the program","solutions":["Hi, askonaskon My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.You could give more details about your problem."]},{"symptom":"Fix for legacy Lenovo Laptop dock with no sound from dock output jack        FIXED: RELOAD THE AUDIO SOFTWARE FROM YOUR COMPUTER MANUFACTURER.Problem: No sound from Lenovo mini dock headphone\/aux speaker jack. Laptop sound jack OK.Most Lenovo laptops, and many other brands, use Conexant 20672 Smart Audio. I believe mine was corrupted by one of the Microsoft updates. I am running Window 10\/64 v1809 on a Lenovo T420s. The T420 was originally a Windows 7 laptop that is not supported by Lenovo for Windows 10 but the Windows 7 Conexant software will work just fine if reloaded. The Windows 8 Conexant software will likely work also.You can check\/verify your Audio Software manufacturer using Device Manager and selecting Audio. Recommend uninstalling the Audio driver before proceeding with the following.Instructions for Lenovo laptop (similar for other laptops like HP): Go to Lenovo.com and navigate to Drivers and software…do not use the auto update! Have Lenovo self-detect your computer. The site may require installing the Lenovo Service Bridge. After detection of your proper model, select “Manual” on the top line and select “Software and Drivers”Pick Audio and open up the latest Windows Conexant Software. If , like me you had to use a Windows 7\/64 selection that’s OK Windows 10 will load the most current driver for Windows 10 on restart.Download the Conexant 20672 Smart Audio Software and install. Then Restart.","solutions":["Hello.Download and install this file :https:\/\/download.lenovo.com\/ibmdl\/pub\/pc\/pccbbs\/mobiles\/8aax04ww.exeRestart.Test your sound.Best Regards"]},{"symptom":"windows 10 update KB4530684 failed to install        Windows 10 update KB4530684 failed to install multiple times post upgrade from Windows 7 home to Windows 10 home.  Error code: 0x80073712.Any ideas how to get the update to install?","solutions":["Hi Arthur. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything possible for fixing failed Windows Updates, so that at least something will work before you work through them all:Some Updates will sort themselves out in a few days so I'd wait to see. If not or they are bothering you then here are steps you can take:1) There is a new guided walk-through from Microsoft for repairing Windows Update that leads up to resetting components if necessary:https:\/\/support.microsoft.com\/en-us\/help\/10164\/.... Try running that first. 2) If that fails try manually resetting Windows Update Service: Open administrative Command Prompt and type following commands one-by-one followed by Enter key.net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Close Command Prompt and see if Windows Updates works then 3) You can also install the Updates manually that fail to install which are logged at Settings > Update & Security > Windows Update > Installed Update History, and then search for those to download and install from this Catalog:http:\/\/test.catalog.update.microsoft.com\/v7\/sit... 4) If they continue to fail and interfere, then you can block them using one of these methods:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... 5) If problems with Updates have become chronic and especially if you have other performance problems, go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 6) If nothing else works then do a Repair Install, by installing Media Creation Tool, open installed Tool and choose to Upgrade the PC Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version 1909. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... _____________________ Good news! There are major changes in Version 1903 giving back control over Updates to the consumer. Microsoft has heard us at the highest level who announced this here:https:\/\/blogs.windows.com\/windowsexperience\/201..._____________________ I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","i tried the but still getting errors."]},{"symptom":"Unable to load DLL iaStorAfsServiceApi.dll        Hi there,My problem is small popup window which appears in right bottom corner of the screen each time when I am launching windows explorer.Would you please advise me how to eliminate the above described problem?Thanks & Best Regards","solutions":["Hi, PIOTR My name is Aracely, I am an Independent Advisor. I would love to help you today. You can use the System File Checker tool to repair damaged system files. Follow these steps: Press the Windows + X keys and select Symbol of the System (Administrator) or Windows PowerShell (Administrator), in the window that will open, you must type the commands in their respective order:• DISM.exe \/Online \/Cleanup-image \/Scanhealth • DISM.exe \/Online \/Cleanup-image \/Restorehealth • DISM.exe \/online \/cleanup-image \/startcomponentcleanup • sfc \/scannow Each of these actions may take a few minutes, so it is important to execute one at a time. At the end, you must restart the PC.Check this link: https:\/\/support.microsoft.com\/en-us\/help\/929833...Let me know if the information has been helpful in solving your problem.","Hi Piotr That error is generated by the Intel Optane Memory Pinning utility on your PC What is the Make and exact Model No. of your PC - that will be printed on a sticker on the bottom casing . . .","Hi there,Thanks for your prompt response.My PC is DELL Inspiron 17; 500 Series","Hi Piotr Check the support page for your model no on the Dell Support site for the Intel Optane utility, I cannot find the support page for that model, there is more information required on that site","Thanks for trying","Hi Aracely,Thanks for your assistance but my level of IT is to small to go so deep into the system","Check the link, there are the steps.","HI! I HAVE THE SAME PROBLEM RIGHT NOW... i wanted to know if you got this issue fixed? if so how? ","HI AracelyMy name is Siva manjith.I followed all steps mentioned below, still I have the same issue in my laptop.Model of the I am using is inspiron 5570.• DISM.exe \/Online \/Cleanup-image \/Scanhealth• DISM.exe \/Online \/Cleanup-image \/Restorehealth • DISM.exe \/online \/cleanup-image \/startcomponentcleanup • sfc \/scannowI am facing this problem soon after updating my laptop new version of Windows 10, version 1903. The date of updation of laptop 30-‎08-‎2019.","Hi there,Unfortunately still not fixed:-("]}]}