{"windows":[{"symptom":"Microsoft Store no internet connection, but I have internet.        I have searched the internet about this problem error ox800704cf.  I have tried everything it suggested.  Nothing works.  My husband plays the Solitare Collection and is up set that I can't get it to work.  Surely there is a simple fix for this problem.    Can't send feedback because its says no internet.  What's up with this.  Help please.","solutions":["Hi phatfield, please try this: Go to Settings, Network & Internet and click on Change connection properties. Under Network profile, click on PublicCheck to see if this is resolved . . . If not, you need to enable IPV6 Open the old Control Panel (click your Start Button, type control and hit Enter) Go to Network and Sharing Center On the left click 'Change Adapter Settings Right click your Internet Connection and choose Properties On the resulting dialog, scroll down and enable IPV 6 Save that and restart your PC","Did that and nothing happened.  Still says no internet. ","Hi phatfield and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.Open CMD as an administrator mode, type the following. ipconfig \/release <Press Enter> ipconfig \/renew <Press Enter> ipconfig \/flushdns <Press Enter> ipconfig \/registerdns <Press Enter> nbtstat -rr <Press Enter> netsh int ip reset all <Press Enter> netsh winsock reset <Press Enter> Restart the PC. I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"Laptop Account Help        I changed my user account settings to standard after typing Win+R. I want to reverse this but I cant because anything I try asks if I allow the program to change desktop settings but I don't even have a \"yes\" button to click and I don't know how to fix it. I would appreciate any help with this. ","solutions":["Hi MH. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See here how to deal with User Account control box with no Yes button: https:\/\/www.tenforums.com\/tutorials\/108280-fix-...https:\/\/winaero.com\/blog\/fix-yes-button-disable...Did you assure you still had one Admin account before changing yours to Standard? It should not allow you to do so unless you have an Admin.If not then enable the built-in hidden Admin used only in emergencies as shown here:https:\/\/www.isumsoft.com\/it\/enable-hidden-admin...https:\/\/www.tenforums.com\/tutorials\/2969-enable...Sign into Admin account, leaving password box blank, and either change your account back to Admin using one of these five methods:https:\/\/www.windowscentral.com\/how-change-user-... or create a new Local Admin account in Settings > Accounts > Family & Other People > Other, as shown here:http:\/\/www.howtogeek.com\/226540\/how-to-create-a... Sign into the new account, test if the problem persists, if not then move your files over, test that all programs work or else reinstall them, then when ready delete the old account in the same place.You can then change it to your Microsoft account if desired: https:\/\/www.tenforums.com\/tutorials\/5375-switch...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"upgrade to windows 10 from 7        im not sure if there is a way that i can find my upgrade key? is it in my computer ?, and last but not least is there a free download for it Thank u for ur time                           sincerely                                   A.A.","solutions":["im not sure if there is a way that i can find my upgrade key? is it in my computer ?, and last but not least is there a free download for it Thank u for ur time                           sincerely                                   A.A.","im not sure if there is a way that i can find my upgrade key? is it in my computer ?, and last but not least is there a free download for it Thank u for ur time                           sincerely                                   A.A.","im not sure if there is a way that i can find my upgrade key? is it in my computer ?, and last but not least is there a free download for it Thank u for ur time                           sincerely                                   A.A.thank you very much","Hi April. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Did you previously Upgrade to Windows 10 during the free Upgrade period which ended four years ago? if so then you should have a permanent Digital License so you can install the Media Creation Tool from this linkhttp:\/\/windows.microsoft.com\/en-us\/windows-10\/m... choosing Download Tool Now, install the tool, open it and choose Upgrade this PC Now. This will save your files and apps while bringing you up to the latest version by the most stable method.If you haven't yet Upgraded you'll need to buy a Product Key after the above process - unless by some chance it activates free which some report happening. If so then you're good to go. The free Upgrade was never shut off completely.See more in this article: https:\/\/www.zdnet.com\/article\/heres-how-you-can...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700Cheers."]},{"symptom":"Error: uninstall HP Drive Encryption when upgrading to Windows 10        I am trying to upgrade from Windows 7 Pro to Windows 10. When I go through the upgrade process, I am stopped and told I need to uninstall HP Drive Encryption. I have never used this software and my drive is not encrypted.I tried to remove it the traditional way, by uninstalling it using the tool, but I still get the same message \"uninstall HP Drive Encryption\" only this time it says to do it manually.I downloaded the free Revo Uninstaller tool and tried that too. Still the same problem.Can someone please tell me how to remove this program?***Modified title from: HP Drive Encryption***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that while upgrading to Windows 10, you receive an error ‘HP Drive Encryption app needs to be uninstalled.’ I’ll certainly help you with this issue. Ideally, if the installation is blocked by an app that doesn’t appear in the installed applications list, it is likely that the compatibility checker is detecting a file that is associated with the app. In this case, we will need to delete the file to continue the installation.  To find out which file is blocking the installation, I would suggest you to refer the suggestions byEdison Pus replied on February 9, 2018 from the thread Windows 10 upgrade can’t complete due to error: “Some apps need to be uninstalled.” You may also download run this batch file to automatically perform the steps above:https:\/\/aka.ms\/AppRPS(You should be prompted to download a zip file named AppRPS.zip) Let us know the results. Regards,Nikhar KhareMicrosoft Community - Moderator","I need to know specifically how to uninstall HP Drive Encryption. The installation is not blocked by an app that doesn't appear in the installed applications. It's blocked by HP Drive Encryption.Also, I am using Windows 7 Pro. These instructions are for Windows 10 I think.Your reply did not solve my problem.","Hi, Thank you for replying. I understand that you want to uninstall HP Drive Encryption form your computer. As you have already tried uninstalling the program using the uninstall Tool and using Revo Uninstaller, and still receiving the error, I would suggest you to try the steps mentioned in my earlier response and this will help you in removing the error. The instructions can be performed on a Windows 7 computer as well. Please try it and let us know of any changes.  We await your response. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"How Can I Copy My Data from Laptop to External Hard Drive?        Before I send my laptop computer to HP for repairs, I want to copy or back up my data (not programs or system) to my external hard drive which contains plenty of free space.  When I try to copy or drag&drop the Windows\\Users folder, the dialog box specifies fewer files (3500 when I know there are at least 180,000 in \"Users\") and size (402 MB when I know there are at least 11 GB) to be copied.  What should I do in order to be sure I will have copied ALL my precious data to the external HDD?  Is there a better way than copy or drag&drop to copy and preserve my data on my external HDD?","solutions":["Goto c:\/user\/username Select all the folders i.e. Music, pictures, desktops.... Copy\/cut itGoto your external hard drive and paste it. ","Hi BenDCooper and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.- Make a New Folder on the desktop and rename it \"Backup Files\". - Gather all the files that you need to backup. - After you gathered all the files, right-click the folder \"Backup Files\" then select properties and take down notes on \"size\" and \"Contains\".- Select the \"Backup Files\" right-click select copy then paste it to the external drive.- After the completion, right-click the \"Backup Files\" in the external drive and check the \"size\" and \"Contains\".- Cross-check both files from the desktop and the external drive base on the size and contains.I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"ERROR MESSAGE - STACK OVERFLOW AT LINE: 20        HI,I KEEP RECEIVING THIS POP UP MESSAGE \"STACK OVERLOW LINE 20\" WHEN I TRIED TO LOG IN MY TEAMS ACCOUNT I ALSO TRIED MICROSOFT TEAM WEB VERSION BUT STILL NO LUCK...  THANKS,YNI","solutions":["We have a couple of users with the exact same issues, first reported issue was on the 4th Dec, second issues was reported today on 12th Dec.I am wondering if there has been an update around the 4th which has caused this?One thing to point out, both users are on Windows 7","I have the same question,But i solved,you can upgrade IE to IE11.","HiSame error showing on windows 7 \"STACK OVERFLOW LINE 20\" in new update after showing this error... asking teams password again in new popup teams windows,... but after sometime logout automatically with same error. error showing on 24th dec 2019 Thanks","HI,I KEEP RECEIVING THIS POP UP MESSAGE \"STACK OVERLOW LINE 20\" WHEN I TRIED TO LOG IN MY TEAMS ACCOUNT I ALSO TRIED MICROSOFT TEAM WEB VERSION BUT STILL NO LUCK...  THANKS,YNIhiinstall IE 11 in yours windows 7 system.Thanks","Yes installation of IE11 solved my issue.RegardsManish  "]},{"symptom":"Thank You and Goodbye Windows 7        At this moment i don't want ask anything, i just want to say Thank You to Windows 7, specialy Microsoft who develop it. For this long Windows 7 become my friend, mentor, get income, fun, sad etc... Thank You Windows 7 n also Microsoft n Bill too :DFrom your Power User... :D14 January 2020","solutions":[]},{"symptom":"How to get windows activation key for windows 7 installed on pc (but lost the box with sticker that had the key)?        I have multiple pcs with windows 7 pc. we are trying to upgrade to windows 10. The process says that if you are upgrading from windows 7 to 10, you need to have a digital license. We had thrown away the boxes that usually had the sticker of windows activation key as they were purchased few years ago. With end of support from Microsoft for windows 7, for security reasons ; Now we have to upgrade to windows 10 from windows 7.We  had a legitimately purchased from dell. Besides us trying to get from dell the windows activation key; are there any other ways that Microsoft be able to get us the key that we have on currently installed windows 7 so we can use on same computer after we upgrade the same computer to windows 10? Any help appreciated.","solutions":["I have multiple pcs with windows 7 pc. we are trying to upgrade to windows 10. The process says that if you are upgrading from windows 7 to 10, you need to have a digital license.We had thrown away the boxes that usually had the sticker of windows activation key as they were purchased few years ago.With end of support from Microsoft for windows 7, for security reasons ; Now we have to upgrade to windows 10 from windows 7.We  had a legitimately purchased from dell. Besides us trying to get from dell the windows activation key; are there any other ways that Microsoft be able to get us the key that we have on currently installed windows 7 so we can use on same computer after we upgrade the same computer to windows 10? Any help appreciated.The product keys on preinstalled Windows 7 operating systems, Dell, HP, etc. are on the computer case.And you may or may not get 10 for free.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Read though this to sort out your Windows 7 product keys, if possible:Is it a Retail, OEM System Builders or OEM preinstalled (Dell, HP, etc.) license and is it still activated?@@@@@@@@@@@@@@@@@@@@@The Product Key consists of 25 digits, divided into 5 groups of 5 digits and the layout looks like this:xxxxx-xxxxx-xxxxx-xxxxx-xxxxxThe 24 used are:2346789BCDFGHJKMPQRTVWXYThe 12 unused are:015AEILNOSUZ@@@@@@@@@@@@@@@@@@@@@If installed and activated and a Retail or OEM system Builders license and you have lost the product key that came with the purchase use these free programs:http:\/\/www.belarc.com\/free_download.htmlhttps:\/\/www.magicaljellybean.com\/keyfinder\/@@@@@@@@@@@@@@@@@@@@@If you bought it from Microsoft:Find your downloads and product keysMost software you buy directly from Microsoft Store as a digital download, like Office, Windows, and Xbox games, can be downloaded, installed, or reinstalled inorder history. Find the software and then selectProduct key\/Install.@@@@@@@@@@@@@@@@@@@@@If OEM preinstalled (Dell, HP, etc.) license:The COA sticker, which has the Product Key on it, is either on the underside of the Laptop or in the Battery Compartment.With a Desktop it is either on the side, rear or top of the Computer Case.Product Key finder programs do NOT find a useable product key on OEM preinstalled operating systems (Dell, HP, etc.)Key Finder Programs used on preinstalled Operating Systems only find the Manufacturer's Product Key which was used on multiple machines during manufacture and what they find is not suitable to use for a reinstall or activation problems.Cheers.","I have multiple pcs with windows 7 pc. we are trying to upgrade to windows 10. The process says that if you are upgrading from windows 7 to 10, you need to have a digital license. We had thrown away the boxes that usually had the sticker of windows activation key as they were purchased few years ago. With end of support from Microsoft for windows 7, for security reasons ; Now we have to upgrade to windows 10 from windows 7.We  had a legitimately purchased from dell. Besides us trying to get from dell the windows activation key; are there any other ways that Microsoft be able to get us the key that we have on currently installed windows 7so we can use on same computer after we upgrade the same computer to windows 10? Any help appreciated.That was never an option with the free upgrade.The Windows Product Key\/License for the Qualifying Operating System, Windows 7, Windows 8.1, etc. is absorbed into the Windows 10 Upgrade during the installation process and becomes part of the Activated final install of Windows 10.The Qualifying Operating System License, whether it be Windows 7 or Windows 8.1, etc. can not be used elsewhere, or in a dual boot with Windows 10."]},{"symptom":"My bluetooth isnt working        This is all i see when i check my bluetooth adapter and it has been like this for like a week now and i am really frustrated at this point because i tried literally every method i can find  and nothing seems to be working. Hopefully someone can help me resolve this problem soon.","solutions":["Hi Zeyon. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give all possible steps for troubleshooting Bluetooth in order of priority, so even if you've tried them please do it over in sequence. Many problems right now are being solved by updating to the latest version so if you want to skip to that step see the Repair Install at bottom: Try Updating the Bluetooth driver from the PC maker's Support Downloads webpage for your exact model. Install it even if it's the same or newer than the one in Device Manager reached by right clicking the Start button.Right click Start button to access Device Manager, locate Bluetooth device (if necessary from View tab Show Hidden Devices), on Driver tab see if Roll Back is available, if not try Update Driver, first automatically, then Browse, then Let Me Pick to try all previously installed Drivers. If these fail Uninstall the Driver, restart PC to reinstall. If the BT driver is not there, access the View tab in Device Manager to \"Show Hidden Devices.\"Make sure you're pairing correctly as shown here: https:\/\/support.microsoft.com\/en-us\/help\/15290\/... See Fixes here which are all working: https:\/\/support.microsoft.com\/en-us\/help\/14169\/...https:\/\/superuser.com\/questions\/1017867\/make-wi...https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/www.lifewire.com\/fix-windows-10-bluetoo...Try the Bluetooth troubleshooter at Settings > Update & Security > Troubleshoot. Try turning off Fast Startup at Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change settings that are unavailable > uncheck Fast Startup.If this is a mic or headset right click Volume icon in System Tray to Open Sound Settings, make sure the correct device is selected for input or output in the dropdown menu.Then try pairing again, if necessary run the Bluetooth Troubleshooter again. If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....If you think the BT adapter has failed, you can replace it easily with a USB nano adapter like this one:https:\/\/www.amazon.com\/ZEXMTE-Bluetooth-Receive... Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1909 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Laptop and tower seem to be connected??        So I have a tower that I built years ago and it has been my daily user and just a few days ago I got a laptop. Signed in with the same Microsoft account because I don't know why you wouldn't and here's the issue. Every time my tower is hibernating because i don't like putting it into sleep or shutting down every night it will literally just turn on when I turn on my laptop. It makes absolutely no sense and I know for a fact my laptop is turning it on because my tower had been off all day and the second i turn on my laptop my tower just powers up. Someone please help me.","solutions":["Hi Hayden. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.The only thing I can think of that could cause that (and it's a long shot) is if you're syncing Account Settings between the two devices, in Settings > Accounts > Sync your Settings. So when you turn on the one device it may wake up the other to sync it. The same could possibly happen with OneDrive. To test these toggle off all Sync on both devices to see if it repeats. If problems repeats then unlink OneDrive: https:\/\/www.tenforums.com\/tutorials\/36246-link-... Based on results of the above I may have other suggestions. ______________________________________________ Note: Linked tutorial is from Shawn Brink who is a trusted Microsoft MVP."]},{"symptom":"error 0x000003e3        Hi,   kindly, need your support to fix my issue when adding an Epson plq 20  printer in the Network, both machines are windows 10. The issue came up with after the windows 10 update, it has shown me this error:","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,I'd recommend installing the printer's legacy drivers. (If you don't have the printer on the list, locate your the device's ip address via the printer's dashboard and proceed to step 6)1. Press Windows+R and type in control printers 2. Right click the printer with the issue and choose properties 3. Go to the web services tab, save and copy the IP address under troubleshooting information as a reference to the printer's IP address4. Close the window and right click the same printer 5. Choose to remove device 6. Go to start\/search and type in hdwwiz.exe and open the application 7. Choose the option \"Install the hardware that I manually select from a list 8. Locate printer and choose next 9. Choose to create a new port and choose standard tcp\/ip port 10. On the hostname type in the IP address from the printer that you've saved from step 311. Choose the option \"Replace the current driver\" 12. Choose printer name 13. Choose the option \"Share this printer so that others on your network can find and use it.14. Let the printer install for 5 minutes Let me know how it goes. :)","I can't find a web services tab on Epson plq 20\"3. Go to the web services tab, save and copy the IP address under troubleshooting information as a reference to the printer's IP address\"","Hi,In that case, please locate the printer's ip address from the printer's dashboard then proceed to step 6."]},{"symptom":"Stuck while resetting        Hi, my laptop is stuck while resetting because it was being slowed and the only way to boost the performance was to reset it. I accidentally closed my laptop while it was resetting over night and now it is stuck installing windows. Can anyone tell me how I can fix it please? Thank you.","solutions":["Hi SJR. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Open the lid and power on the laptop, what happens? You may need to create bootable media to access Repair Mode to try again the Reset or do the gold standard Clean install. The bootable media has it's own drivers, repair and installation files which often work when Windows or the other Repair Mode doesn't.To create Windows 10 Installation Media on another PC install Media Creation Tool and follow the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, on second screen choose Repair Your Computer, then Troubleshoot Options to try a Reset.If that fails choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, click Next to let it create needed partitions and start install - this makes it foolproof.Everything needed to get the best possible Clean Install is here: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... It is a better install than any amount of money can buy and a great learning experience that will make you the master of your PC because you will learn what works best and how to apply it with your own hands. If you have files that aren't backed up you can use the same bootable media to try to rescue your files using these methods:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hello, I have a separate but similar problem and you seem like a sensible guy. I'm somewhat of a gamer, so when one of my favorites ceased to properly function, naturally I was distraught and went searching for answers. All of the solutions I was able to find online produced inconclusive results. Left with very few options, I made an executive decision to just reset my PC and start over. Yet again, I was met with disappointment. Everything seemed fine up until I was brought to the final stage of the process; resetting at the Alienware load screen, the process would fail and cancel itself out somewhere between 25 and 33 percent. Yet again I went online searching for answers and yet again I found nothing that helped, so I came here. Thanks for going through the trouble of reading this far, what are your thoughts?"]},{"symptom":"Mystery files hogging a huge chunk of my drive space?        Hi all, I recently ordered a custom gaming PC. Received it and all, but I realized that a giant portion of my SSD was already in use by files I can't find. Image below is taken from WinDirStat. Everything in PF (x86) is from programs downloaded after receiving. Everything in the (Unknown) category was already taken up when I first booted. Any idea where the heck these files are? I've already deleted system restore points and all that. Is there any simple way to find a solution to this problem?","solutions":["Can you give a screenshot of Disk Management?","Hi TA. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Please post a screenshot of Disk Management, which I read like a doctor reads X-rays. Follow the steps here so I can see everything needed to advise you:http:\/\/answers.microsoft.com\/en-us\/windows\/foru... Those two unknown folders are highly unusual and suspect. I would contact the builder under the one-year warranty to ask what they are and insist they correct the mammoth error. This is not normal and as defective as it gets to have your drive space all used up on a brand new PC by mystery files. The screenshot may give more clues.","I have been in contact with the builders since mid-December trying to sort out this issue. They haven't been of much help but I am going to keep pushing seeing as I paid for a ~500 GB SSD. ","The config looks good but the unusual space usage is confirmed. You said the Program Files are accounted for? Is it possible one of those programs installed the other folder or had a log run out of control?Can you provide screenshots of the three folders' contents? You could always wipe the drive to reinstall Windows and then monitor the program installs like a hawk to see if anything becomes outsize as a result of each.Follow the gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... To create bootable Windows 10 Installation Media (on another PC if necessary) install Media Creation Tool and follow the directions in the middle of the download page here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key for your PC maker given in this chart:https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, then on second screen choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, select the Unallocated Space, click Next to let it create and format the needed partitions and start install - this makes it foolproof.There is a step to rescue your files first using the booted media if you don't have them backed up:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC because you will learn everything that works best and how to apply it with your own hands.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Can you give us a screenshot of C:\\ from File Explorer?"]},{"symptom":"Windows 10 activation problem after hardware changes.        After motherboard replacement i lost my windows 10 home originally came with my device, and seller(where i purchased my pc) tried to troubleshoot but nothing happend and he activated my pc with new key of windows 10 pro. It successfully Acivated Permanently.  after few days i noticed that the serial number of my pc is showing invalid , i had my serial number so i flashed it using some tools found on online forum of my pc discussion page.After flashing serial number my pc is showing windows is not actived.    I lOST BOTH WINDOWS 10 HOME AND PRO.   how can i get it back.PLEASE HELP ME.    (i have bind both win 10 home and pro with my microsoft account it shows up there but my machine is not activated i tried reseting ,re installing more than 10 times but the problem is not solved) Is there any one who can solve my problem or share some idea and openion with me.I NEED HELP.   (excuse me for bad english)                                                                                                                                                                      THANKYOU!","solutions":["Usually a licence supplied with a device is OEM and not transferrable to a new device, for the purpose Windows 10 activation this is a change of motherboard.So Windows 10 Home need a new licence and using Windows 10 Pro to try and activate just complicates things.Open a PowerShell (Admin) and type slmgr \/dlv then press return. Please post a screenshot of the resulting window. There is no sensitive information shown in the result.","Hi aseemad The original licence (Windows 10 Home) was most likely an OEM licence, which would be tied to the original motherboard and would not have transfer rights to a new motherboard.With regards to the second (Pro) licence, most likely that person installed a volume licence version of the Pro edition, and if that is the case, you will not be able to re-activate that . . .Click your Start Button, type cmd then right click Command Prompt and choose 'Run as Administrator'Run or paste this command and hit Enter: slmgr.vbs \/dlv Please post a screenshot of the resulting dialog . . .","Screenshot","I changed serial number and other things back  into invalid. Then windows activated successfullyIs there any problem  occour if i  leave the info invalid?"]},{"symptom":"I deleted my OS        I was trying to factory reset my computer. I deleted my OS and now when I turn on the PC it goes straight to a black screen once in a great while it would load up the bios screen but it would freeze. I do not know what else to do. I have windows 10 on a USB I had almost had it but then it froze on the windows screen. Please help","solutions":["Hi Isaiah. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.How exactly did you delete your OS? Unless you booted into media and deleted or formatted the partition it's not easy to do.I will give you all possible steps to troubleshoot installation failure which work in about 90% of cases. If not we'll go from there:Follow the illustrated Clean Install steps in this tutorial which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Make sure all other drives and peripherals are unplugged. Update the BIOS or UEFI firmware to latest, or reset to Defaults, making sure SATA controller is set to AHCI, UEFI is enabled, CSM or Legacy BIOS disabled, Windows Boot Manager set first to boot, if necessary disable Secure and Fast Boot until after install: https:\/\/www.mydigitallife.net\/comprehensive-lis... https:\/\/www.groovypost.com\/howto\/reset-pc-bios-...Create the latest new Windows 10 Installation Media by installing Media Creation Tool and following the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... If you're using another PC to do this then uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first. If you can start Windows enter UEFI firmware here:http:\/\/www.isunshare.com\/windows-password\/four-... Choose the boot device as a UEFI device if offered, on first screen press Shift + F10 to open a Command Prompt, type the following commands, each followed by Enter key:DISKPART LIST DISK SEL DIS # (replace # with the disk # of the Windows disk from list in previous command)CLEAN EXIT Close Command Box, on second screen choose Install Now, then Custom Install, then at the drive selection screen choose Unallocated Space, click Next to let it create needed partitions and start install - this makes it foolproof.Make sure to follow the setup steps in the first link tutorial to complete your install. Drivers are important enough that those steps are printed in red.You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the first linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC. If all else fails you can move the hard drive to another PC to do the install with it plugged in alone. Windows 10 is remarkably adaptive to new hardware without needing adaptive restore. If it will start it will swap out all drivers requiring several restarts. You can also try applying a same-version System Image to the intact SSD\/hard drive.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"upgrade from Win 10 home to Pro        I needed a product key to activate win 10 so I purchased Home. product key would not activate. Then I noticed I needed the Pro product key. How can I upgrade to the Pro purchase key? I just purchased the Win 10 home from Microsoft store a few hours ago and it was completely unsuccessful.your help is greatly appreciated.","solutions":["Hi Mike,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Did you purchase Windows 10 Pro as well?If so, try the activation troubleshooter. https:\/\/support.microsoft.com\/en-in\/help\/20527\/...If you want you may take a refund of Windows 10 Home if Pro successfully activates."]},{"symptom":"Where is my desktop?        What screen is my desktop screen?How do I delete all of the history I have visited?","solutions":["Hi Mary,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.The desktop screen is the screen having icons of the programs and files. It also has a bar at the bottom unless not hidden, called the taskbar.For browser history may I know what browser are you using?","Right click on the Windows icon on the left end of the taskbar.  There you will find at the bottom Desktop.  Click on it and you will get your Desktop.  Then if you click on the icon again it will get you the Start menu screen.  If you are in the Start screen and you click the Windows icon you will get the Desktop or the last opened window."]},{"symptom":"at window 10 ,How connect Window Fax and Scanner to Hp Printer  ?        at window 10 ,How connect Windows Fax and Scanner to Hp Printer  ?window fax and scanner show up on my computer bottom  desktop but, when I  click it,pop up window showed up and  \"cannot run as it can not access your document folder.please, ensure that windows fax and scan can access that folder\"what's wrong my computer system?","solutions":["Hi Hyong. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.You'll need at least a basic driver for Windows Fax and Scan. Much better to download from the printer manufacturer the full software package and get all of the features including ink levels on PC and scanning from printer top that are not available in Windows Fax & Scan. After trying this first then if you still want it see this guide to setting up Windows Fax and Scan:https:\/\/faxauthority.com\/windows-fax-and-scan\/Rather than spending too much more time fiddling I'd simply Clean Install the printer which always works, lasts longer and actually saves time:1) Power up the printer, if wired unplug it's USB cable from PC. 2) Go to Settings>Apps>Apps and Features to find and Uninstall any printer software.3) Use one of these methods to remove all of the old printer drivers: https:\/\/www.tenforums.com\/tutorials\/101274-unin...https:\/\/helpdeskgeek.com\/how-to\/remove-uninstal...4) Now type Control Panel in Start Search, open CP, choose Icon View. In Control Panel open Devices and Printers, right click printer to delete Printer and any scanner or fax of the same name. Restart PC.5) Go to the printer model’s Support Downloads webpage to download and install the latest full software package. Now is also the time to check for any newer printer firmware to install which matters a lot.6) Extract Printer software, right click Setup file to Run as Administrator. Follow the setup screens closely as you install the software. For USB it should prompt when to plug in the printer.Older software may need to be installed in Compatibility Mode to run correctly: https:\/\/www.groovypost.com\/howto\/run-old-softwa... If you have further problems reply back with results of each step. Once it's installed and you've run a test print, then scanned it to see that it opens on the desktop, open the Printer software and go into its Settings to set the scan-to file location you prefer, also the email app you want opened for Scan to Email, if applicable.I hope this helps. Feel free to ask back any questions and let us know how it goes. If you will wait to rate my post until we are done, I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Can't type in Windows 10 search bar        After I updated to Windows 10 the search box on the taskbar was working.A few days later I discovered that I couldn't search anything from this box.If you have fixed this or know how to fix please share your knowledge as I rely on the search box.-AnonymousFellow","solutions":["Hi,Thank you for posting your query in Microsoft Community. I understand that you are having a tough time working on the computer.I will certainly help you to resolve the issue.Do you receive any error code\/message?Is there are any update pending or failed to install?If any of these functions like Start Menu, Settings, Search, Cortana, Microsoft Edge, Action Center and other Windows components are not responding, follow these below methods and check if it helps: Method 1:Press Windows + X keys on the keyboard, selectCommand prompt (admin).Enter the below commands one by one and hit Enter key. PowerShell -ExecutionPolicy Unrestricted It will open the PowerShell window.Now enter the below command and hit Enter key.Get-AppXPackage -AllUsers |Where-Object {$_.InstallLocation -like \"*SystemApps*\"} | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}If the issue still persist, follow the below method.Method 2:Open the Task manager.  Here’s a tip:  Press CTRL+Shift+ESC. Click File > Run New Task Make sure you have a check mark beside “Create this task with administrative privileges”Type Powershell Type the following in the Powershell prompt:$manifest = (Get-AppxPackage Microsoft.WindowsStore).InstallLocation + '\\AppxManifest.xml' ; Add-AppxPackage -DisableDevelopmentMode -Register $manifestClose the Powershell windowReboot the computer and check if it helps.Hope it helps.Let us know the status, we are glad to assist you further.","Hello guys and search for a solution for this problem and its was the simple of things.I don´t know why it works but try it and tell if it works for you guys too.Press Win + R (to open Run )copy paste and press enter to run this program. \"C:\\Windows\\system32\\ctfmon.exe\". it brings back the language bar and for me it allowed me to type in windows search, start menu and WINDOWS 10 apps againI think it is due to missing Language bar or some think like that.But when you restart it may stopped working again, just create a task to run this program every time you start the windows and your good to go.Best regards."]},{"symptom":"Windows Live Essentials 2011\/12 ....Win 7\/8\/10 ....and Movie Maker        I have two older desktops with \"Windows7 Home Premium\" on them. The version of \"Movie Maker\" contained within \"Windows Live Essentials 2011\" (on both these towers) seems to work the same as the version contained in the \"Live Essentials 2012\" suite that I am currently using on my laptop ….which is running Windows 10.Is there a difference between the version of \"Windows Live Movie Maker\" offered within \"Windows Live Essentials 2011\" and the last available version of \"Windows Live MovieMaker\" that came in \"Windows Live Essentials 2012\" ....or are they essentially the same program?","solutions":["Hi axeroad Those are essentially the exact same software, with very little difference between them, you posted to the WIndows 10 forum, are you trying to get Windows Movie Maker working on Windows 10?","I have Movie Maker working in Windows 10.Thanks for the confirmation info on the software (WLM 2011 vs WLM 2012)My HP laptop came with an OEM Windows 8.0 key, that key was subsequently free upgraded to 8.1 ….and then upgraded one more time to Windows 10, during the free upgrade period. The original downloaded version of \"Windows Live Movie Maker\" continues to function in the updated Windows10 operating system ….just as well as it did before the two upgrades.I would guess then, that if I chose to upgrade either of the 2 desktop hard drives to Win10 ….that I could expect \"WLE 2011\" to remain present and functional ….we'll soon see.Thanks for all your help.","Remember upgrades to Windows 10 now may well require a Windows 10 licence.","FYI...In case anything goes wrong during upgrading, you can download Movie Maker again:Where to get a Safe Download of Movie Maker Perhaps you might even be interested in this vista version which some users preferred.... This version works also just fine on Windows 10...See https:\/\/movies.blainesville.com\/p\/wmm-60-on-windows-7.html","Thanks for that ....looks interesting.Downloaded MM6.0 to a 32 bit win7 system that runs an old scanner I use.Will try out some old 8mm film bits I digitized.","You're welcome."]}]}