{"windows":[{"symptom":"Updated from version 1603 to 1903, lost my license.        I just built a computer for Christmas, and my Windows 10 came on a USB stick. I finally got it all set up, went to settings, and it told me there was an update. It told me to update to 1903, so I did. After a while, it was done and I saw that little watermark in the corner of the screen. Went to settings, and I got error code 0xC004C003–my key isn't valid. I click Troubleshoot, and all it says is \"We weren't able to activate Windows on this device\" and shows me where I can spend another $100. I know it works because, when I first had Windows installed (before I updated to 1903), it was activated just fine.So far, I've tried:- The built-in troubleshooter- Resetting Windows- Downgrading Windows (which I can't do anymore now)- Using the Media Creation toolI had hope when I saw this article: https:\/\/www.groovypost.com\/news\/windows-10-redstone-build-14257-available-now-insiders\/. But that doesn't work anymore. I typed in \"test\" like it said to, but the bot just told me to rephrase my question.Really not sure what to do here. Hopefully I get what I paid $100 for.","solutions":["HI SAC. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Where did you buy Windows 10 from exactly? Hopefully it was a major retailer who back all sales, or from Microsoft? Can you provide a link because I can probably tell if it's legit or not.Try reinstalling the Product Key at Settings > Update & Security > Activation > Change Product Key. Make sure to proofread the key 3 times because often the issue is a transposed digit.What is the Activation Status and Edition showing at the top of the page at Settings > Update & Security > Activation?Run the Activation Troubleshooter in the same location and report back its findingsAlso be aware that at any time you can create the latest bootable media from Media Creation Tool so you don't need to use an older version:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I'll be waiting to hear back from you and we can go from there. You can verify the Product Key is legit by calling Customer Service here:https:\/\/support.microsoft.com\/en-us\/help\/405170... during weekdays.","Thanks Greg. I'll answer each question in order.I got it from Amazon. I pushed \"change product key\" like you said, and it gave me a new error. 0x803fa067. It says my code isn't valid.The edition is Windows 10 Home and the status is \"Windows is not activated\".Again, the troubleshooter gave me the same result: \"We weren't able to activate Windows on this device.\"","I would contact Customer Service here: https:\/\/support.microsoft.com\/en-us\/help\/405170... tomorrow to ask them to validate the key, so if it's used or bogus you can be armed with this information to go to Amazon Support.If it's an invalid key I would contact Amazon to make it good. They do not want to have a reputation of promoting software piracy.Keep us posted here on your progress. I will be here to help until this case is resolved."]},{"symptom":"XML Scan Engine task running multiple times and using up CPU memory.        XML Scan Engine running multiple times (3 or more) and slowing down my PC.  I end the tasks in Task Manager and PC runs faster and cooler.Questions:  1)How do I stop this task from running multiple times?2) What is the purpose of this task? 3) Can I \"turn off\" or \"delete\" this task?","solutions":["Hi Shar XML Scan Engine is generally a process named LM.Detection.exe, that is not a Windows component and not required by your system to run normally . ..Is your PC part of an organisation and if so, do they use KACE tools to provide updates to your system>If not, try to find that in your Windows Startup processes and stop that form starting with Windows 10 . .Task Manager and indeed Msconfig offer only limited control over Startup items . . .Click the link below to download a small free utility that does not require installationWhen the file downloads, unzip it. Depending on your system, run Autoruns or Autoruns64 as Administrator With that utility, you can right click and delete any startup item in Windows Just be careful not to delete any required process . . . https:\/\/docs.microsoft.com\/en-us\/sysinternals\/d...","Based on your further additional information of the LM... name, I was able to find the source of the XML Scan file.  It is an executable in my anti-virus program called VIPRE.  I disabled the executable and everything seems to be good so far.  I plan on contacting VIPRE about the issue.Thank you DaveM121!"]},{"symptom":"Cannot change color of Windows Taskbar        This is going to sound strange, but something happened that messed up my taskbar color settings.  I don't remember touching anything I shouldn't have, but when I went into my personalization settings to enable automatic change of my taskbar colors, my taskbar suddenly looked like this (in screenshot below) and the option that says to show accent color on start, taskbar, and action center is grayed out.  Any way to fix this and get my taskbar back the way it was??  I don't know what I did that caused my taskbar to look like this, and I don't want to reinstall my whole operating system from scratch in order to fix this problem.  Can anybody think of an easy way to fix the problem shown in the screenshot below:?Evan","solutions":["No, this is by design. A Light mode only would show the colors as white on the Taskbar, Action center etc.Let us know if there is anything else you need help with and if not, kindly mark the thread as answered. A rating is also appreciated."]},{"symptom":"taskbar        how do I get a hidden icons box to show on my taskbar?","solutions":["Hi SH. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.First try right clicking to Unpin from Taskbar. Then find the App in Start Menu apps list, right click to choose More, then Pin to Taskbar. Does it show up correctly now?If not see other possible fixes here for blank icons on taskbar: https:\/\/www.guidingtech.com\/fix-windows-10-invi...https:\/\/www.blogsdna.com\/27155\/fix-windows-10-t...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"recover encrypted data        Hello!I hope you can help me with the following situation:I encrypted a few files on an external hard disk, using an older laptop.That laptop does not boot anymore and cannot decrypt those files.From what I understood, those files can only be decrypted from that windows.I can access data from the hdd through an external rack.Is it possible to access the credentials and copy them to another computer or maybe to the same old laptop but with another windows?If I give windows repair, will my credentials be affected?","solutions":["Hello PACPACBUM, I am Andrew an independent advisor. I hate to tell you, unfortunately unless you saved a copy of the encryption key those files are lost.Do you have the entire system hard drive, or was this an external one you saved just these files to?","the entire system hard drive. So mabe I can find the encryption key. I must mention that I've used encription from windows (properties\/ advanced\/ encrypt data....)","In that case you could potentially put the hard drive in to a working computer and boot it. Since its the system drive most it needs to do is install drivers for the new hardware, it would still have the encryption key in place.This is the easiest method in my opinion as it requires no searching for the key, which would need to be exported in to a document in order to search for it.Be sure to disconnect the current drive in any computer you may put it in to avoid confusion with yourself and the computer.","I am afraid that the non booting problem it is a windows problem, so I am not shore that it will work on a working computer, but thanks for the Ideea. (I will try it these days after I will find a working computer that I can dissasamble).","Ok good luck. Sadly if it is a OS issue that caused the problem and it will not boot then the files have been lost."]},{"symptom":"Cursor Freezes When I Try to Download or Play Sims 4        I have tried EVERYTHING! About two months ago, I went to play my Sims 4 (which had previously worked fine) and my cursor froze when I opened the game. The game graphics still moved, and my keyboard worked, but my cursor wouldn’t budge. I’ve tried everything from deleting and reinstalling the game, to factory resetting my entire laptop. Still having the same issue. The only way to get the cursor back is restarting my computer. Please help! I just want to play my game! ","solutions":["Hi Victoria. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Does this happen in another game, app or Windows besides SIMS? If not it points directly to the app only. If so then we need to troubleshoot the mouse or touchpad. Which is it?As you have a laptop I'm going to assume touchpad, so try a mouse to see if it still happens.If not, update the Touchpad driver from the PC maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you also have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.If that doesn't help then enter Device Manager reached by right clicking the Start button, go to Mice > Touchpad and then Driver tab. Choose Update Driver, then Automatic to see if it gets a better driver that resolves the problem. If not try Update Driver > Browse > Let Me Pick to try all previously installed drivers. If that doesn't work then try uninstalling driver, Restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver.See the troubleshooting steps here: https:\/\/support.microsoft.com\/en-in\/help\/402786... Go to Settings > Devices > Touchpad to go over the Settings. Then choose Additional Settings which opens the Mouse properties box. The Touchpad software installs a tab onto it - usually the last one - that should have more settings to check, including a checkbox to Disable Touchpad when USB pointing device is attached. This prevents palm drag from causing the cursor to jumpIf this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Update History, then uninstall them from the link there, and immediately check for these again and hide with the Hide Updates tool explained here: https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...You can also go into Repair Mode by whichever method works here: https:\/\/www.tenforums.com\/tutorials\/2294-advanc... to use the new Uninstall Updates button in Advanced Troubleshoot Options:https:\/\/pureinfotech.com\/uninstall-updates-adva.... You can also use System Restore from within Windows or the above Repair Mode to get back before the problem began, then check for Updates with the Hide Update tool and hide them:https:\/\/www.windowscentral.com\/how-use-system-r...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Greg! Thank you so much for the information! My cursor only freezes when I am either downloading the Sims from Origin, or when I open the Sims to play it. I thought it was the game, but I tried many fixes for it and nothing worked. I am going to start on the fixes you suggested and I’ll report back! Thank you! ","Victoria - Keep me posted on your progress as I will be here to help until the case is resolved."]},{"symptom":"Downloading Windows 10 without Media Creation Tool        Hello,I'm pretty much a novice when it comes to computers, and that is why I need some help in downloading the Windows 10 OS without having to use the Microsoft Media Creation Tool. I'm upgrading from my old Windows 7 Home Premium Edition to the new Windows 10 Home Edition, but when I tried to download Windows 10 using the Media Creation Tool, the download never finished no matter how many times I tried to download it. Then I found out on the internet that my Windows 7 OS doesn't support the Windows 10 Media Creation Tool software and that's why I could never finish installing the Windows 10 OS. So, how do I install Windows 10 without the Media Creation Tool? Please remember I'm a novice, so having to use any kind of computer code or anything like that, would just go over my head!LOL By the way, I did find a Microsoft page that had the words Download Windows 10 Disc Image (ISO File) in the title, yet when I go to the Microsoft website, I can't find it anywhere. Below the title, I also saw some wording about being 'routed' to that page because my OS didn't support the Media Creation Tool. I can no longer find that page. I think that page would have allowed me to download the Windows 10 OS without the need of the Media Creation Tool. If someone could send me a link to this exact page I would really appreciate it. Thank you.","solutions":["If you know someone else who has a computer with Windows 10 on it, you could always ask them to create the flash drive installation media. If that's not possible, you have two other options. The Microsoft website detects what kind of operating system you are using and only allows you to download the media creation tool if you are on windows. However, if you have a mac or other device that can access the internet, and you go to the download page (here: https:\/\/www.microsoft.com\/en-us\/software-download\/windows10) it will allow you to download a disk image. You can then move it onto a disk from that device, or transfer it to your computer.Alternatively, if you do not have a device that uses another operating system, you can trick the website into thinking you are using a different OS, but it is somewhat complicated. The instructions are shown in this article: https:\/\/www.howtogeek.com\/427223\/how-to-download-a-windows-10-iso-without-the-media-creation-tool\/If you use this method, don't forget to change it back afterwards.Unfortunately, these are really the only options you have. Hopefully one of them works for you! Let me know if you have any other questions.","Hi EJP,Thank you for the quick reply! Since my Windows 7 seems to be way outdated (I bought my Toshiba laptop back in 2013) that even the Microsoft Media Creation Tool won't work with it, I'm dreading the fact that I will have to shell out big bucks to Microsoft for the retail version. I've been trying to find cheaper ways to get the Windows 10 OS, but nothing seems to work. From trying 'free' validation keys to finding sellers that have the OS on flash drives, I'm at my wits end. Would getting the Windows 10 on a flash drive really work, or are all of these methods just ripoffs to try and take your money. I'm on a disability pension and can't afford to spend close to $200 Canadian for a retail version of the OS for a computer that I still use and need but really don't use as much since getting a new ipad two years ago now. I also don't know of anyone with a computer that would be willing to burn a copy of their Windows 10 OS so I could use it, but I will ask around at work. Again thanks for the quick reply and I will keep looking","If you can get a flash drive with Windows 10 installation media on it, you shouldn't even need a key to activate Windows 10 once it is downloaded. The license from Windows 7 that is already on your computer should transfer over to Windows 10 without you having to pay anything. Also, you don't have to ask someone to burn a copy of their Windows 10 to a flash drive for you. All they have to do is download the media creation tool from the page on Microsoft's website (see my previous comment) and it gives you an option to create an installation media on a flash drive when you run it. Nothing on their computer is transferred onto the drive so they don't need to worry about their files being put onto your computer or anything. It just makes a flash drive that allows you to install windows on your computer. Note that you will need an 8gb or larger flash drive. Once you put the installer on the flash drive, you would then open the flash drive on your computer and start the installer. If you are confused at all about how exactly any of this works, just let me know.","Hi EJP,I already had downloaded and put a copy of the Windows 10 ISO file on a blank DVD disc and tried starting the download off of that. All the times that I tried, the OS download only got so far and then it stopped. Why would the installer work for someone else and not for me? I was also given the option to be able to download the ISO file either onto my computer, a USB drive or a blank DVD. I chose the DVD option but the download was never able to finish. I never even got to the validation key screen. Are you saying that the downloader would work for the other person because they have Windows 10 already installed on their computer. By the way, do you know how I can still get to the Microsoft page that says Download Windows 10 Disc Image (ISO File)? Someone sent me to this website address in my email on my ipad, but when I tried to copy and paste the same address on my computer using both IE and Firefox I only got sent to the generic Microsoft page where you download the Media Creation Tool. The other site also referred to being sent to that particular site because I guess it detected that my current Windows 7 OS wouldn't work with the Media Creation Tool. Was it because I tried to access the page while I was on ipad, which didn't have a Windows based OS on it? Thanks.","Oh, I misunderstood the issue. I thought you were having issues downloading the media creation tool, not Windows 10 itself. In that case, I would try using the media creation tool to download directly onto your computer. You can then just run the file that downloads and the installation should start. If that doesn't work you can also do the flash drive option. I don't know why it would randomly stop part way through installation though. It may be an issue with the disc you are using. I installed Windows 10 onto a Windows 7 computer (it was actually also a Toshiba laptop that I also got in 2013) and didn't have any problems.Also, yes, the reason that you can download the actual ISO on your iPad is because it isn't a Windows-based OS. If you are using Windows, it forces you to download the media creation tool. Just try using the media creation tool to directly download the installer onto your computer and let me know if that works for you. Sorry I misunderstood the problem in my previous comments.","Hi EJP,Thank you for the quick reply! Since my Windows 7 seems to be way outdated (I bought my Toshiba laptop back in 2013) that even the Microsoft Media Creation Tool won't work with it, I'm dreading the fact that I will have to shell out big bucks to Microsoft for the retail version. I've been trying to find cheaper ways to get the Windows 10 OS, but nothing seems to work.From trying 'free' validation keys to finding sellers that have the OS on flash drives, I'm at my wits end. Would getting the Windows 10 on a flash drive really work, or are all of these methods just ripoffs to try and take your money. I'm on a disability pension and can't afford to spend close to $200 Canadian for a retail version of the OS for a computer that I still use and need but really don't use as much since getting a new ipad two years ago now. I also don't know of anyone with a computer that would be willing to burn a copy of their Windows 10 OS so I could use it, but I will ask around at work. Again thanks for the quick reply and I will keep lookingIf you want to pirate the Windows 10 software, you will get exactly what you pay for.@@@@@@@@@@@@@@@@@@@@@@You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@","Hi Bill,Thanks for your help! I actually downloaded the free version of Windows 10 when the offer became available, but at the time, I didn’t like the new version so I uninstalled it and went back to Windows 7. (I looked to see if I had made any backup copies of Windows 10, but sadly I hadn’t). The OS did work with my Toshiba Sattelite laptop, which at the time, was only three years old. Now that the laptop has gotten a lot older, and I no longer really have a choice as to which system to use, I’m trying to find a copy that won’t set me back a lot. I will definitely look at all the ideas that you gave me, and maybe I will find a low-cost option that will finally work. I will also look at contacting Microsoft and see if they can still send me the free version since I had the free version before but forgot to make backup copies. Thanks again Bill for all the help you have given me! ","If your laptop was purchased in 2013 that would make it maybe 6 years old.Surely you have already checked the Toshiba Support site to see if they have Windows 10 drivers for your laptop of unspecified make and model, right?  Why has nobody suggested that yet?  Even manufacturers of some systems of later vintage don't have Windows 10 drivers and they are not going to create any.If they don't have Windows 10 drivers it doesn't make any difference where you get your Windows 10 or how you apply it since it will not work.","If your laptop was purchased in 2013 that would make it maybe 6 years old.Surely you have already checked the Toshiba Support site to see if they have Windows 10 drivers for your laptop of unspecified make and model, right?  Why has nobody suggested that yet?  Even manufacturers of some systems of later vintage don't have Windows 10 drivers and they are not going to create any.If they don't have Windows 10 drivers it doesn't make any difference where you get your Windows 10 or how you apply it since it will not work.FYI:You obviously never read earlier replies, did you?First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@","Hi Bill,Thanks for your help!I actually downloaded the free version of Windows 10 when the offer became available, but at the time, I didn’t like the new version so I uninstalled it and went back to Windows 7. (I looked to see if I had made any backup copies of Windows 10, but sadly I hadn’t). The OS did work with my Toshiba Sattelite laptop, which at the time, was only three years old. Now that the laptop has gotten a lot older, and I no longer really have a choice as to which system to use, I’m trying to find a copy that won’t set me back a lot. I will definitely look at all the ideas that you gave me, and maybe I will find a low-cost option that will finally work.I will also look at contacting Microsoft and see if they can still send me the free version since I had the free version before but forgot to make backup copies. Thanks again Bill for all the help you have given me! As you had the free upgrade to 10 before, that makes it easier.You have to get the same edition of 10 though that you had.The free upgrade to 10 is yours for the life of that device.The best method to upgrade back to 10 is to clean install it.Use the Windows 10 media creation tool on the Software download page \"Start fresh with a clean installation of Windows 10\"https:\/\/www.microsoft.com\/en-us\/software-download\/windows10startfreshReinstall Windows 10:https:\/\/support.microsoft.com\/en-us\/help\/4000735\/windows-10-reinstall\"How to Clean Install Windows 10\"http:\/\/www.tenforums.com\/tutorials\/1950-windows-10-clean-install.html_______________________________________________How to Create Bootable USB Flash Drive to Install Windows 10 fromThis tutorial will show you how to create a bootable USB flash drive that can be used to installWindows 10 with or without UEFI.________________________________________________To access BIOS\/UEFI - UEFI\/EFI configuration:https:\/\/neosmart.net\/wiki\/boot-usb-drive\/_____________________________________When your free upgrade to 10 was  originally activated Microsoft will have kept the Hardware Configuration details of your device on their Servers for recognition purposes if you have to reinstall 10.\"Activation in Windows 10\" (Digital entitlement)https:\/\/support.microsoft.com\/en-au\/help\/12440\/windows-10-activationCheers."]},{"symptom":"Windows 7 transfer to another computer        Hi all,My current comp HD is failing........it has windows 7 OEM installation on it. I want to install my windows 7 on a new computer, Can I do this....?????Thanks..........","solutions":["Hi all,My current comp HD is failing........it has windows 7 OEM installation on it. I want to install my windows 7 on a new computer, Can I do this....?????Thanks..........NO: You can't transfer an OEM license to a new computer.Buy a new hard drive and reinstall the operating system in the same computer that the OEM license belongs to.@@@@@@@@@@@@@@@@@@@@@@@The basic rules:If the Laptop\/Computer came with the Windows Operating System preinstalled (Dell, HP, Acer, etc) , that Product Key that came with the Laptop\/Computer is for the preinstalled OEM Licenseand is non-transferable.The OEM License\/Product Key (preinstalled Operating Systems on Dell, HP, etc machines) is tied to the first machine it is installed on and dies when that machine dies.The above rule also applies to OEM System Builders Licenses.Retail Operating System License, that you buy and install yourself, are allowed to be transferred to another machine.But Retail Licenses can also only be installed on one machine at any particular time.","Bill,Thank you for your complete answer.I have another question if you don't mind.I have no disc to reinstall windows 7 from, is there a way to download windows to a DVD or CD so I would be able to install it on a new hard drive..??????Thanks again.......","Microsoft does not supply Windows 7 ISO downloads for OEM preinstalled operating system Product Keys for Dell, HP, etc. machines@@@@@@@@@@@@@@@@@@@@@@@@@@You can borrow the exact same edition of Windows 7 Retail DVD and use your Product Key on the COA sticker to reinstall the operating system.@@@@@@@@@@@@@@@@@@@@@@@@@Or you can use this for preinstalled OEM or Retail Licenses. This is on a first come, first served monthly basis.Download the correct ISO file and make your own disk and use the Product Key that is on the COA Sticker.https:\/\/www.heidoc.net\/joomla\/technology-science\/microsoft\/67-microsoft-windows-and-office-iso-download-toolDownload: Windows ISO Downloader.exeAnd here are instructions on how to burn ISO images to disk:http:\/\/www.snapfiles.com\/get\/ISORecorder.htmlYou change the Boot Order in the BIOS to be able to boot from your installation media:How to Boot Your Computer From a Disc or USB DriveThen do a clean install:http:\/\/www.sevenforums.com\/tutorials\/1649-clean-install-windows-7-a.htmlThe COA sticker is either on the underside of the Laptop or in the Battery Compartment.With a Desktop it is either on the side, rear or top of the Computer Case.Using the downloaded ISO file Method may require phone Activation.\"How to Activate Windows 7 by Phone\"http:\/\/www.sevenforums.com\/tutorials\/18715-activate-windows-7-phone.htmlThe above method also will require you to go to your Computer Manufacturer's website > Support and Downloads Section > locate your Model Number and Operating System > then download and install the latest Drivers for it. ________________________________________________Using the USB method in conjunction with the above Windows 7 download:http:\/\/www.sevenforums.com\/tutorials\/2432-usb-windows-7-installation-key-drive-create.html\"How to Get and Use the Windows 7 USB\/DVD Download Tool\"http:\/\/www.sevenforums.com\/tutorials\/31541-windows-7-usb-dvd-download-tool.html________________________________________________And this is very good and easy to use:Rufus - Create bootable USB drives the easy wayCheers.","It is also still not too late to do the \"free\" upgrade to Windows 10. Google, there are lots of current articles on the subject.Upgrade current drive to Win10, then after you install the new drive you can re-install Win10 from MS without having to worry about activation. MS will handle the new Win10 activation automagically for you.","If the current hard drive is failing you are going to have fun installing 10 on it!@@@@@@@@@@@@@@@@@@@@Besides that:You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700Cheers.","As Microsoft\/TechNet says,a good way to transfer\/save user data is to open C: drive\/locate users\/make a new folder on desktop,drag the user data files to new folder 1 at a time,once thru,and folders are in new,,Right click on new,send to cd..Once thru,return data back to C: HD.If its a desktop pc,one can use XCOPY  or  RoboCopy software,already installed in windows by default.Install new HD,once in desktop,go to run type:  diskmgmt.msc  in msc,locate the new HD,R.click\/delete partition\/re-right click\/create one\/format,use defaults.Once thru,exit msc,go to run type:  XCOPY C:\\*.* D:\\ \/c\/h\/e\/k\/r  agree to all in the DOS window,once thru,youre finished,also D: being the new HD letter,if given difrent,then use it instead.Youre new HD is a bootable drive,reset it in BIOS,1st boot device.To learn more follow the link.https:\/\/docs.microsoft.com\/en-us\/windows-server\/administration\/windows-commands\/xcopyhttps:\/\/social.technet.microsoft.com\/Search\/en-US?query=XCOPY&ac=2both get you info... ","You should always have your data backed up to at least two external media destinations (external hard drive, DVDs, flash drive) in case of system file corruption and\/or hard drive failure.If you don't, it is easy to plug in a USB drive and either drag your data across or copy\/paste it to the USB"]},{"symptom":"Directory name invaid        I used a template in word, edited it and saved it gone to re open it now I get directory name invalided. do I need to redo the letter or can I open it some how?","solutions":["Hi 7hippy9 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.Just copy the file to a different location then re-open again. I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"Cant activate my windows        I recently upgraded my motherboard and CPU, it wont let me activate windows it says when i troubleshoot that the servers are down please try again later. I linked my Microsoft account with Windows but it still will not let me activate it. please can someone help ","solutions":["Hi CEnglish2112 Is your Windows 10 licence based on an OEM licence (came pre-installed on a PC) or Retail (purchased separately to a PC)If it is a Retail licence, then it will have transfer rights to a new Motherboard or PC, if it is OEM it will not . ..Is your Windows 10 licence a retail licence?","its retail ","Great, in that case, your best option is to contact Microsoft Support and ask them to help you re-activate your Windows 10,because that activation troubleshooter rarely resolves activation after a major hardware change . . .Choose a local Phone Number: https:\/\/support.microsoft.com\/en-us\/help\/13948\/..."]},{"symptom":"Font issue on windows 10        Hello everyone. it has been a couple of months that my windows 10 font has changed, and what is quite annoying is the fact that my browser all of the setting fonts look the same. i tried changing the font in control panel but they all goes back to this thin ugly looking font which it looks more like my labtop is trying to lower the image quality.i am not sure if this is related to the display setting or something else. firstly i tried to update the display drive and even tried to put the fonts in default but none of that made any changes to my labtop. ","solutions":["Hi Sahab.sam and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.1. Can you please provide a screenshot of the problem you encountered? 2. Navigate here: 2a. Press the Windows key type in \"Regedit\" and hit enter 2b. Go to. HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\WindowsNT\\CurrentVersion\\Fonts 2c. Also, take a screenshot and attached it to our thread.2. Also, take a screenshot and attached it to our thread.Feel free to ask back any questions and let me know how it goes. Thank you!"]},{"symptom":"Please help!        I have a little problem...Some days ago I've gotten a laptop, from which I am writing this. Firstly, it was a locked up Windows 7 laptop on foreign language. I had to get my brother to fix it. 2 days and it was ready. I was checking settings and said: Everything is OK. But i forgot to check one thing: account type. As I've discovered, I am a standard user of my own laptop. How can I get myself admin privileges??Sincerely,A Windows 10 user.","solutions":["It was that way: my brother signed in to his ms account in oobe. Then had done some drivers or other important stuff. Then he added my account and asked me to check, if everything is ok. I've forgotten about checking account type and said OK, not knowing that I have a standard account. Now I search whole web for a workaround.All you need is to ask your brother for the admin password for hisMS account, as DaveM121 suggested. You can then log on and create your own admin account."]},{"symptom":"Microsoft To-Do - Duplicate Recurring Tasks        All my recurring tasks in the To-Do app are being duplicated. So when I mark a recurring task complete, an exact copy of that occurrence appears on the list with the same due date and sub tasks, but the task and all sub tasks are marked incomplete. This means that I have to check every sub task and main task complete twice for every recurring task I have. Before marking the next occurrence complete, only one instance of that recurring task appears on the list.I tried deleting all my recurring tasks (including all previously completed occurrences) and creating the recurring tasks again from scratch, but I am still encountering the same problem.How do I get rid of the duplicate occurrences permanently and prevent them from being created again?","solutions":["I have the same problem.  Any updates on this?  If not, I can't use it.  I've been using repeating tasks for years with other task management apps and may have to switch back.","I also have the same problem. It drives me crazy. I check off a task and it pops back up in my list as being due today. I check it off again and it finally pops up but with the due date set for the next recurrence. Not sure if I'm doing something wrong with how I set up the recurring tasks or if it's a bug. It's been doing this for months. ","I reached out to Microsoft To Do Support on November 25th, 2019 and received the following response on November 26th, 2019:Hi Devin Walz,Thank you for letting us know about this. Our apologies for the trouble.We're aware of this issue and are working on a fix. A lot of other users also reported that recurring tasks are creating duplicate entries. We hope to get the issue resolved as soon as possible. We appreciate your bearing with us in the meantime.Regards,WaseemI've been waiting for an update, but I haven't heard anything since. :("]},{"symptom":"Clean Reinstall Windows 7        Technical Level : Basic SummaryA Clean Reinstall is often better than getting a new computer since most PC's come larded with sponsors' bloatware and duplicate utilities that interfere with much better versions built into Windows 7. For this reason most tech enthusiasts Clean Reinstall using the Product Key on the COA sticker affixed to machine. This guide compiles everything that works best in tens of thousands of installs I've directly helped with in forums since Windows 7 beta, and continues my Seven Forums web tutorial with 2+ million views.DetailsPlease read over all steps to be sure you understand them before beginning. Ask back any questions in the Comments section below. For example, it is important enough to understand exactly how drivers are handled in the first mostly driver-complete OS that these steps are printed in red.To save pages of space I provide blue links to illustrated tutorials instead of illustrating them in-line. You can open these in a new tab using your middle mouse button (scroll wheel) or from the right-click context menu.  Please notify me in Comments section if any link is faulty, then google the name to get an alternate link for that operation.Step 1Find the right Windows 7 .iso There is a stable source for the WIndows 7 installation media ISO to download your licensed versionhere. I would use 64-bit for 4gb or more RAM, 32-bit (x86) for 3gb or less RAM.You can slipstream the latest Updates into the installer ISO to save at least an hour's Updating after install usingUpdate 7 installation media.  However it may take an hour to do this so consider how much you want this.  Due to problems with Updates which have recently grown more serious, MS has also just released a rollup you can install or slipstream into media here: Simplifying updates for Windows 7 and 8.1 | Windows for IT Pros . Burn ISO to DVD or to USB flash stick (minimum size of 4GB required)using Windows 7 USB-DVD Download Tool or alternatively to DVD using ImgBurn  at 4x speed, to flash stick usingRufusselecting UEFI for GPT for UEFI BIOS, or Legacy MBR for Legacy BIOS.For UEFI installs format flash stick with Option One of  UEFI Bootable USB Flash Drive - Create in Windows  making sure the settings shown in picture don't jump around after adding the ISO.You have a UEFI install if Disk Management shows an EFI System partition on the hard drive, the BIOS shows UEFI settings and it's Boot menu offers to boot the DVD or a UEFI-formatted flash stick as an EFI device.Step 2 Backup your user data If your files are not organized now is a good time to sort them into the User folders for yournamed User account using one of The many ways to copy, move, or delete multiple files.  I find  the easiest way to do this is to browse on the left-hand Explorer bar to C:\\Users\\[Your User Account] to expand User folders, then in right hand pane browse to all locations with unsorted files and drag them separately or in groups to the desired User folder on Explorer bar. Finally delete unwanted files from each User folder.For all browsers other than IE which stores Favorites in the User folder of that name, exportyour bookmarks to Documents now.  Most browsers will also let you set up a sync to store your browser settings, Favorites and history in a Google account, Firefox Sync, or similar:Import or export bookmarks - Chrome HelpSync Chrome data across devicesExport Firefox bookmarks to an HTML file to back up or transfer bookmarksHow do I set up Sync on my computer? | FirefoxIf your email is stored on computer, Google how to back up specific mail and account settings to get solutions likeHow do I import and export email, contacts, and calendars with Windows Live Mail? - Microsoft Windows Help.Backup Quickbooks 2010+ Company files from where you keep them, the default location User\/Public\/Documents, or google your version's file location, or run a QB backup to Documents before backing them up.De-authorize I-Tunes. You can back up your Sticky Notes to keep the one currently on your desktop followingSticky Notes - Backup and Restore.Then back up your files externally by dragging or copying your named User account or active User folders to another hard drive, external drive, flash stick or disk.▶ Copying files to an external drive - YouTube. An alternative is to upload files to the cloud using Microsoft OneDrive which offers 15gb free storage for each Outlook\/Live ID. Install and use the OneDrive app to drag User folders into OneDrive folder, monitor uploading progress by clicking Cloud icon in System Tray on bottom right end of taskbar. Once files are all uploaded, rightclick the Cloud Icon again to choose Settings and Unlink so that any accidental file deletions are not deleted in the Cloud. Step 7 will pick up with reinstalling OneDrive to recover your files. Remember that any accidental deletions always end up in OneDrive's as well as your PC's Recycle Bin. For unbootable Windows copy data to another HD or USB device using the Windows 7 disk toCopy & Paste in Windows Recovery Console, free Paragon rescue disk, or a Linux boot disk. You can Run and print an audit of hardware and software including installed Product Keys usingBelarc Advisor.  This audit assures you won't lose any paid software keys like Office. Note that the Windows 7 Product Key found by Belarc or another key finder will be an SLP batch key used at factory, if it has not yet been activated from COA sticker Key used for a Clean Reinstall. This SLP batch key cannot be used for reinstall. Methods for backing up Factory SLP Activation if the COA Product Key is not readable are not supported here but can be found on the web. For unbootable Windows, you can read the installed Product Key and any Office key you don't have backed up usingProduKey - Recover lost product key (CD-Key) of Windows\/MS-Office\/SQL ServerStep 3 Save essential system data If you have a Recovery partition it may not run after clean reinstall. You may want to make your Recovery Disks so you have a path back to factory condition, following the steps given in your PC's setup literature or in the Manual located on the Support Downloads webpage for your model computer. As an alternative to Recovery Disks you cansave a Windows 7 Backup Image or more flexible Macrium Reflect Freeimage of the entire HD. You can wait until afterward to see if Recovery or (Diagnostics) Tools partitions will run from boot to decide if you want to delete those partitions and recover the space into C or elsewhere (using Step 3here). This information may be provided for your brand PC in the Special Notes at the end of this tutorial.Write down the Product Key from COA sticker located on back or side of PC tower, bottom or under battery of notebook. Make sure you get the characters correct as this is a main cause of activation failure. You can input or Skip the key during install then afterwards activate at Control Panel>System, which may require a quick robocall. But put the key in a safe place so you have it for the life of the PC, which may outlast the sticker's readability.The COA sticker looks like this: Step 4 Manage installed programs Gather your program installers. For those lacking disks, you may find them on the program's Support Downloads webpage. Favorite pre-installed apps may be found on the Downloads webpage for your model computer or manufacturer-provided Apps Disk. Others may be found by googling.  Some pre-installed apps may not be available for clean reinstall - more about this for your brand PC in the Special Notes at end.If needed, Office reinstallation media can be obtained viaManage, Download, Backup, & Restore Microsoft Office Products and activated with the Product Key you originally bought with it or audited usingBelarc Advisor orProduKey.  A good free compatible alternative to Office isLibreOffice Free Office Suite or OpenOffice.  You can also Try Office 365 for free to trial the new subscription Office suite fully integrated into the cloud.Many of the favorite apps needed and desired for reinstall are available in the terrific appNinite - Install or Update Multiple Apps at Once.  This makes a custom installer you can save which keeps all app installers updated within.Just in case, save in advance your Wireless or Ethernet LAN (wired) driver in your backup so if it isn't provided during install you can install it to get online quickly to install all Important and Optional Windows Updates - which will also provide most drivers. Your network LAN driver can be found on the Support Downloads webpage for your model PC. The exact make\/model will be listed in your Device Manager under Network Adapters.Step 5 Install the Windows 7 .iso Unplug all other HD's and peripherals except ethernet cable to increase chances of it starting up connected after install. If not prompted for wireless key during install it's likely you'll need to install the wireless driver immediately after getting to the desktop, or if ethernet LAN is working wait for wireless driver to come in via Windows Update.Follow How to Enter Your PC's BIOS, near the storage settings make sure SATA controller setting is AHCI, then under Boot tab set the hard drive first to boot (unless you don't have a BIOS boot menu key in which case you need to set your Installation media device first to boot), Save Settings and Exit. If in doubt about whether you have a UEFI BIOS, comb the settings for UEFI, EFI, CSM, Legacy BIOS, Secure Boot - if none of these are present then you don't have a UEFI BIOS.  If you have UEFI, check the PC or mobo's Support downloads webpage for latest firmware to install if necessary now.  Reboot tapping BIOS boot menu key to trigger installation media, as a UEFI\/EFI device if you have a UEFI BIOS.  Choose Custom Install, then at the \"Where do you want to Install Windows?\" screen access the Drive Options (Advanced) to delete all partitions to Unallocated Space, create New and Format as desired, or just click Next to let the Installer auto-create and format needed partitions and begin install. Whether to use more than one partition depends largely if you want your data in the OS partition, or have it linked from another partition to make C partition backup image smaller - this way if Windows 7 becomes irreparable you can re-image the OS\/Programs to C and the data will be current and waiting safely in its own partition. Due to lack of SP2 Win7 has no USB3 drivers so use a USB2 port for flash install; it may be necessary to disable USB3 controller in BIOS setup for install. If you're prompted for drivers for any other reason during install it almost always means a bad installer, so make sure ISO download completed and create another one.If you have an UEFI BIOS, or receive an error that Win7 cannot be installed to disk because of its formatting, and cannot overcome the error by deleting all partitions, then you may need to follow the special steps toInstall Windows 7 with UEFI (Unified Extensible Firmware Interface)including if necessary to Create UEFI Bootable USB Flash Drive, or mayBypass UEFI to Install WIn7.  Remember to boot installer as UEFI Device.  We can help troubleshoot UEFI problems as we do here every day.Other Steps here to Troubleshoot Windows 7 Installation Failures - Windows 7 Help ForumsStep 6 Get online to run all Windows Updates Immediately after install check bottom right System Tray network icon to connect to your network if necessary. If only a TV icon with a red slash appears then open and extract network LAN driver, right click on Setup to Run as Administrator, install LAN driver watching System tray icon to choose network if required. Why can't I connect to a network? - Windows HelpImmediately after getting online install your AV. I suggest using a lightweight free Antivirus likeMicrosoft Security Essentials or the more aggressive Panda Cloud which perform well with the Windows 7 Firewall. Bloated AV's cause problems with Win7; if you're infected while using MSE I suggest adding inexpensive Malwarebytes Real Time Protection which also work together well.Next enable hardware driver auto-updating,open Windows Update to Check for Updates, select all Important and Optional Updates (except Bing, unless you prefer it) to install. After requested reboots, go back again to Check for Updates until there are no more. These Updates deliver drivers, critical system, hardware and security patches. I would accept them all to be safest, keep Updates set to Automatic and regularly check for Optional to install because often needed Updates are queued there.If Updates stall or balk check your Start menu's Shutdown button for a \"!\" signaling there are Updates queued there for install at Shutdown. Perform a Shutdown to install them and then keep an eye on the Shutdown button if further rounds of Updates stall to clear them there first before proceeding to again Check for Updates. Most Update jams can be resolved by several reboots - real problems are one in a million.If Updates will not install at all or endlessly Check for Updates, go into Windows Update \"Change Settings\" and set it to Never Check for Updates,  download and install manuallyWindows Updates KB3020369, followed by a restart and then KB3172605, then restart again.  Now Check for Updates and they should appear.  Install all Important and Optional, with necessary Restarts.  Once all Updates are installed you can Change Settings again to Install Updates Automatically. Any drivers still missing in Device Manager after all Important and Optional Updates are installed can be found on the Support Downloads webpage for the model PC or device, along with other OEM software which you can wait to see if you need. I would not replace any drivers given by the installer or Windows Update unless performance problems point to that specific driver. We can help you troubleshoot these issues. If you install a driver and it performs badly you can Roll Back on its Driver tab in Device Manager.\"Standard VGA\" Display driver is a placeholder driver which only should be used when no other possible driver will install as it will not allow Sleep or Hibernate. So if Updates don't provide a better driver, import it from the PC model's Support Downloads webpage - if necessaryeven Vista, or XP driver installed inCompatibility Mode. If this fails check the device maker's Support Downloads webpage to let it scan for the needed download to install.Unknown Devices are often card reader drivers posted on the model's Support Downloads webpage along with other drivers which may be revealed by a function still missing on the PC such as laptop function keys or keyboard lighting, or can be traced using Device Manager - Finding Unknown Devices - Windows 7 Help ForumsCo-processor, SM Bus controller, USB and Storage controllers are often elements of the chipset. If no chipset is posted on your model's Downloads page, use theIntel Drive Update Utility orAMD Auto-Detect to find your chipset, or ask in our Drivers forum. You can also trace any missing driver using Hardware Identification. It's often faster to google the Driver Detail's Hardware ID than to look it up.I would not re-import any of the OEM software until you run for awhile to know for sure you need it. There may be patches on the PC's Support Downloads webpage needed to improve performance so browse them to be aware what's available as you test performance to decide if they're needed. But keep in mind re-installing OEM bloatware besides that which is absolutely needed for good performance ora specific function you need defeats the purpose of a Clean Reinstall.Step 7 Reinstall your programs Install programs slowly over time to gauge performance changes after each. You can roll back bad effects of a Program install or Update(s) by uninstalling it or usingSystem Restore.Install your preferred Reader and Flash Player declining the Optional offer. I no longer recommend installing Java unless you know you need it or are prompted to install it to run a program, as it is an infection path.Don't let programs write themselves into msconfig>Startup as they slow startup, become freeloaders on your RAM\/CPU, can spy on you and cause conflicts. No video, sound or other driver software needs to start with Windows 7 unless you know you need special settings on these. As illustrated in Startup Programs - Change  uncheck everything except AV, gadgets (aka \"Sidebar\"), Sync program, printer which scans from printer top, and Flash player updater (needed for safety and performance) in msconfig>Startup.Then after reboot do the same in msconfig>Services after checking the box to \"Hide All MS Services.\"Check back with both lists periodically to see if anything writes itself back in, turn it off in its Program Preferences.If you have any questions about a listing, Google it to learn what it does or ask us.However I would not install any Google programs which are relentless spyware. Only use the stable Google search box in your browser and don't stay signed into any Google web apps.Avoid spyware tracking cookies placing annoying interest ads by periodically Opting Out of Network Advertising.This will greatly relieve the banner ads which track your shopping habits and web searches.The most important thing you can do to avoid spyware creeping in is to watch your program installs like a hawk at every step, because freeware authors have found ingenious ways to sneak in spyware with tricky check box choices - even in the License Agreement. Always do a Custom install and only allow the features you know you want, check later to remove anything extra in Control Panel>Programs and by running a full Malwarebytes andAdwCleaner scan (Step 12) which roots them out as deep as they can go.Keep an eye also on your Browser Add-Ons or Extensions to only allow the ones you know you want or are required to make a page display correctly, including Flash, Shockwave, WMP or Quicktime plug-in, a reader, Silverlight. Also under Add-Ons monitor Search services to remove any but Google in the stable browser search box, tick the box to disallow any others to replace it.Strange search service are often spyware.If you're prone to infection add the inexpensive paid real-time protection forMalwarebytesto run alongside a lightweight recommended AV, otherwise use its excellent free scanner as needed.Step 8 Recover your user files Before copying your files into the new install, now would be a good time to download, install (declining trial), update and run a scan on them withMalwarebytes to make sure no infection is being re-imported.If you backed up to OneDrive, reinstall the OneDrive App, wait for files to download from OneDrive into the OneDrive folder completely, then copy them into User folders, ormove the User folders of the new Install into the OneDrive folder to Sync, Backup and Store your Files to the Cloud with OneDrive.To copy your files into the new install, open the storage folder, open each User folder (Documents, Pictures, etc.). Next from the Organize tab choose Select All, drag the group to the corresponding folder on Explorer bar at left.Wait until the bar stops unfolding and hypertext confirms the precise copy location before releasing the left click.If this method makes you nervous, right click on the Select All file group to Copy, then open the corresponding target user folder, in an empty space right click to Paste.Do not copy hidden AppData folders from User Accounts as these are a corruption path- another reason not to use file transfer apps which can also lose files.If you're using a separate data partition copy your User folders to it, then you can either move the new install's active User folders location to there followingUser Folders - Change Default Location, or right click each to link it to the related Library - Include a Folder then set it as default for that Library - Set Save Folder - Windows 7 Help Forums. Keep the empty C User folder in each library so you can easily see if something lands there and simply drag it to the linked User folder.If you move the User folders use another Backup Imaging app like free Macrium Reflectas the built-in one will want to include the data drive which now holds System files.A simple free method is here to Sync, Backup and Store your Files to the Cloud with Onedrive - Windows 7 Help Forums that shows how to move your User folders into OneDrive folder on C or data partition for instant backup to the cloud and simultaneous synching across all of your devices using this method.The User Favorites folder will populate IE Bookmarks. Import another browser's Bookmarks from HTML file backed up previously. Copy Quickbooks and other Program data into it's default folder location.Step 9 Activate the OS Activation at Control Panel>System may in rare cases require an automated robocall to MS the first time to record your hardware signature in their servers.  It willalways work as long as you install the correct version and input the key accurately which is a frequent stumbling block - taking a well-lighted phone pic of COA sticker key to enlarge may help, or use a magnifying glass.You should be offered to stay on the line to speak with an agent if the automated system fails toActivate Windows 7 by Phone.  Another method is to open a Command Prompt, type slui 4, press Enter and follow prompts.  If it fails stay on the line to speak with an agent.Step 10 Housekeeping You can easily configure and share files between PC's on the same network usingHomegroup - Create.On my installs users are most impressed by the spectacular beauty of the collected national editions' 120 Windows 7 Backgrounds slideshow. You can download the folder fromhttp:\/\/1drv.ms\/1shAWUu. Type Personalize in Start search box, choose Windows 7 Aero Theme, from Slide Show link Browse to Pictures Location, Select folder, Select All as a 30 minute random slideshow, Save Changes.With gadgets no longer being supported due to supposed risk of infection we've never seen, what works better now for millions who love them is to install v.12 or higher of8GadgetPack which supports Windows 7. It works the same except you'll need to hide the Sidebar.The MSN weather gadget similar to Win7's popular weather gadget can be easily installed to open from the same gadget pack.When finished, clean and order the HD perfectly using state-of-the-art free CCleaner \"Run Cleaner\" button and Registry tab. Type \"Defrag\" into Start Search box to run a Windows defrag and set its schedule to your liking.Never defrag an SSD!Periodically run the above as well as a full scan with free Malwarebytes and AdwCleaneron-demand scanners, declining the trial unless you're prone to infection - in which case purchasing MBAM Real Time protection at $29 for life almost always resolves this, when run in tandem with your AV. Always check that you are running the latest version of the scanner and it is fully updated.Take advantage of the perfected  Windows 7Power Options. Most users only need the Balanced Plan, ideally to Sleep at 30, Hibernate at 45-90, with Hybrid Sleep enabled. Many users prefer Hibernate to Shut Down as it keeps in place your open work and starts up much faster while still powering down. Note that timing out to Sleep without a Hibernate safety net will wear your RAM indefinitely until you come back (vacation?). Sleep and hibernation: frequently asked questionsHibernate Shortcut - CreateAfter reinstall I always scan the logs to resolve repeat errors, check System Resources, search for Problem solutions, Generate a System Health Report - as shown in these basicTroubleshooting Steps for Windows 7 to bookmark.Step 11 Make your first system image Finally, save a Windows 7 Backup image to external or another internal HD so you never have to reinstall again - just do aSystem Image Recovery to the HD or it's replacement from booted DVD\/Repair CD and the stored image.I would save at least one baseline image after reinstall to replace needing to do a reinstall in the future. However some users like to have a more current image to choose from in which case I'd save a separate one as often as you want. Win7 imaging will save past images as long as there is enough room on the storage drive for a new image.Note that built-in Win7 backup imaging is limited to restoring the OS to the exact same partition structure, so if you want a more flexible app try favorite freeMacrium Reflect.  Once you load the image and target hard drive, use the links under each existing partition to delete those you're replacing, then just drag your desired partitions to the target drive, note the new link created just below each to use sliders to adjust its size, then click Next using the default settings.Step 12 Notes for specific PC makes Henceforth if required to contact your OEM Tech Support do not tell them you Clean Reinstalled but troubleshoot as if you have the factory install. Otherwise they may refuse to support Clean Reinstall, but cannot void Hardware warranty. If you must ship the unit back for repair under Hardware warranty save a Windows 7 backup image and then run Factory Recovery beforehand.Special notes for HP owners:On newer models HP System Recovery  may offer a Minimized OS Recovery option. This retains only the OS, Recovery Manager, HP Support Asst, HP Wireless LAN, drivers and activation, and is as close to a clean reinstall as you can get without doing one yourself. I would uninstall HP Wireless to use Win7's superior wireless manager.If you format and reinstall only to C leaving all other partitions intact, F11 Recovery key should still work later if you need it. The helpful hardware diagnostics also listed on the ESC or F9 boot menu may also run after reinstall, so if they will run now from boot, I would save the small HP Tools partition to see if they remain bootable after install.Problems with volume control lighting and HP Quick Launch buttons have been dealt withhere and here. Specific HP software which might be worth reimporting is discussed in HP Bloatware, or useful system utilities? Some HP Recovery disks can have their files extracted to access favorite program installers usingAccessing HP Recovery Disc Files.Special notes for Dell owners:If your Recovery partition is triggered at boot from the F8 System Recovery Options  then it will no longer run after clean reinstall, somake your Recovery disks first, delete Recovery partition during reinstall. The bootable Dell Diagnostics often will run after Reinstall so are worth saving if they will boot. Try it now to test your hardware and see if these work, choosing on F12 menu Diagnostics and then Utility Partition which sometimes has a fuller suite. If they run save the Dell Utility partition during install, if not delete all partitions. These tests can also be run online atDell PC Diagnostics | Dell USUseful tips for Dell re-installation plus access to their forums to resolve questions can be found atDell Community .  The Dell Reinstallation DVD has only activation and a Dell logo added and can be used as long as it is labeled to include SP1.Special Note for Sony Vaio Owners:Software which enables F-key functions and illumination must be reinstalled from the Sony Support Downloads webpage in the order as shown here:Function keys don't work after clean install - Windows 7 Forums Special Note for Samsung Owners:Software which enables F-key functions and illumination may be labeled Easy Display Manager.Special Note to Acer OwnersThere is an OEM Preload folder hidden in the C:\/ drive that holds all the pre-loaded software, including the eRecovery software.Special Note for Lenovo OwnersThe only OEM software I've found to be valuable is Lenovo Energy Management's features to preserve battery by maintaining a 60% charge when plugged in, and fan reversal to clean out dust. Download from your model's Support Downloads webpage orPower Manager for Windows 7 (32-bit, 64-bit), Vista (32-bit, 64-bit) - NotebookOffice Word version here.","solutions":["Hi Greg,This should probably be noted http:\/\/www.zdnet.com\/article\/sticking-with-windows-7-the-forecast-calls-for-pain\/Pretty much confirmed with this thread and all of the issues with windows updating aroundhttp:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_7-update\/windows-update-remains-at-checking-for-updates\/ff3c442e-79a6-40d3-ac35-29e130cebef1","Thanks, Mike, Added.  See what you think of the updated section on Updates balking.","Greg,Not quite sure that I understand this...In Step 6 you mention:\"To get Windows Update to run correctly open Windows Update, change Settings to Do Not Check for Updates, uncheck the box to “Give me recommended Updates the same way I receive important. Next install KB3102810 andKB3083710,  April 2015 Servicing Stack update, then install the Convenience Rollup of all Updates since SP1 downloadable from CR x64CR x86.After these are installed and you do a restart, you can Check for Updates, expect a wait for up to several hours, but it should bring up any remaining Updates including important drivers and other Optional Updates.\"Are the items in bold above just supposed to be installed, but not run? They will be put to use after restarting and checking for updates?Have an issue described here:http:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_7-windows_install\/clean-install-of-windows-7-pro-64-bit-turns-into-a\/3c55ff86-2a50-4e7e-b36f-c79e220c7493?msgId=25c49762-b73e-4e98-afb7-ea7c32d07a47Thanks for your help.","They actually install Updates needed to prevent Windows Update from stalling interminably. ","Folks,Have a question about HashTab.On checking an ISO's SHA1 signature got a green checkmark. Presumed that is good, hopefully?It also mentioned it was not for commercial distribution (or something similar).Guess that is also OK?","Yes the green check mark means the HASH matches as should also be evident by comparison.Commercial distribution doesn't apply to consumers.","Thanks for the explanation, Greg!Good program to increase comfort level on whether an OS ISO is OK, or not.","Hi Greg,Doesn't step 6 still need the Prerequisite updates for Internet Explorer 11 ?https:\/\/support.microsoft.com\/en-us\/kb\/2847882","This is the first I've heard of that, Mike.  Won't Updates provide these in the right order?  Seems recent installs I've helped with or done have not had any problem getting IE11 installed via Updates.","Greg,Whenever you update this article, anyone who is subscribed to it gets a notice.Is  it possible for you to make a short comment mentioning the portion of it that you updated?I have tried to keep up, but whatever this latest update was, I can't find it. The article is rather extensive and very thorough, and to try and remember all its changes is more than what this old mind can handle. However, I do want to know what change was made.Thanks!!"]},{"symptom":"Forza Horizon 4 Deluxe Edition Download issue        So I just bought Forza Horizon 4 Deluxe Edition, and it has 46 downloads at queue. I know thats normal, but is it supposed to download Forza Horizon 4 and Forza Horizon 4 Deluxe? Because for me, its downloading the deluxe version and the normal one. The Deluxe Version download is also taking forever while the normal version bar is moving fast. Do you know whats the problem with this glitch?","solutions":["Hi, BryceHwang My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Can you go back to your old edition of windows        I have a windows 10 pro product key that i'm not sure is genuine. It says it works, it sends me to the upgrading screen when i put it in, but i'm worried that it won't be genuine. Would there be any way to go back to home edition if this key doesn't work? If not, is there a way to make sure  a key works? I'd appreciate an answer. Thanks!","solutions":["If the computer was activated there is no longer a need for a key.If asked for a key just go to the bottom of the page and click on Skip, Do this later, or I do not have one.","Did you even read my question? I want to upgrade my edition of windows from home to pro. Please respond after actually READING my question, thanks!","Hi 1980Soviet Thanks for participating in Microsoft Community, I'm Skypper G. I'm Independent advisor, let me help you with thisYes you can go back to windows 10 home from a clean install. There is another method by change some key on the Windows registry, however this is not effective all the time. You can find more info about this on the previous forum here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...","I don't think anyone here is quite grasping my question. I don't WANT to clean install, my windows IS activated and I HAVE NO PROBLEMS CURRENTLY. All i want to do is upgrade from home to pro. I have a key that i'm not sure is genuine or not. All I want to know is if I can check if my key is genuine, and if not, can I revert back to my activated windows 10 home from non activated windows 10 pro. That's all i'm asking. ","Hi 1980Soviet Upgrading Windows 10 Home to Pro is very easy and painless, you simply apply a new product key and the upgrade takes maybe 20 minutes and that is thatDowngrading Windows 10 Pro to the Home Edition, is not so easy, the only way to do that is to backup your data and clean install the Home EditionThere is no way to verify that licence key without trying to use it to upgrade . . .If that key is genuine then no problems, you will very quickly have an upgraded systemIf that key turns out not to be genuine, then you will have a lot of work on your hands to revert your system back to the legitimate Home Edition you currently have installed. . ."]},{"symptom":"factory reset question        I have a windows 7 laptop that was upgraded to  10 with free upgrade. I am selling it and i am wondering if i perform factory reset will it revert back to 7 or stay with 10?","solutions":["Hi Karen The truth is, the laptop may well revert to Windows 7 and there is no real way to know if that will happen, there was a user on here an hour ago and their system reverted to Windows 7 and they lost all their data, while that is not a concern for you, it just shows, your system may revert to Windows 7 . . . The best thing to do would be to create a bootable Windows 10 installation media on a flash drive, then reset Windows 10If that reverts to Windows 7,you can always re-install Windows 10 from that flash drive and it will self-activate . . .Click this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), you can create a bootable USB flash drive (min 8GB) using that tool","Thanks for the info. I will give it a shot."]},{"symptom":"windows 10 won't load pictures from my nikon d7100        windows 10 will not upload pictures from my nikon d7100","solutions":["HI Woody. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See here for how to import pictures to Windows 10 from nikon d7100: https:\/\/www.dummies.com\/photography\/cameras\/nik...https:\/\/www.dummies.com\/photography\/cameras\/nik...https:\/\/www.nikon.co.uk\/en_GB\/product\/software\/...https:\/\/www.addictivetips.com\/windows-tips\/impo...Troubleshoot import from camera: https:\/\/answers.microsoft.com\/en-us\/windowslive...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"BSOD        after turning off hyper v and virtualization it via windows features or bios will fix it.... but i need virtualization on for other things. minidump:    https:\/\/drive.google.com\/file\/d\/1h_2P6BeDvV3fF0bQDXoXdhgDPw_Q7fFf\/view?usp=sharingstop code: page fault in nonpaged areai got it to work until i restarted my pc once more but doing bcdedit \/set hypervisorlaunchtype offin command prompt... but a windows update made that temp fix not work. i do not remember if that was the most recent update ive had for windows 10 (which uses the nov. version rn.)please and thank you.","solutions":["Hi Interiorhood, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved.The latest minidump was dated in August, 2019 and most of them were corrupt (which is not totally unknown with BSOD events).BugCheck 50, {ffff9a8aae0ff110, 11, ffff9a8aae0ff110, c} Probably caused by : aow_drv_x64_ev.sys ( aow_drv_x64_ev+41421 ) aow_drv_x64_ev.sys dated is either malware, part of TenCent Gaming Buddy, or unknown depending...…1. Either remove the malware, update or remove TenCent, or research what it actually is.2. If no joy, check with HP support and forums about similar known issues. Update the BIOS, chipset drivers, and all the major drivers. HP Support\/Troubleshooting & Drivers http:\/\/www8.hp.com\/us\/en\/drivers.htmlContact HP http:\/\/welcome.hp.com\/country\/us\/en\/contact_us....HP Forums http:\/\/h30434.www3.hp.com\/psg\/3. As well as the above, this issue can certainly be hardware. Remove ALL power then reseat all the cards, memory, and cables (on both ends when possible) - actually remove and replace - do not just snug.4. Run the memory tests (see methods below). 5. As needed use ALL the methods in the troubleshooters below. 6. After ALL the above if needed run Driver Verifier to see if it can indicate a CAUSE (see Driver Verifier methods below).==================================================== Troubleshoot blue screen errors <-- read this link http:\/\/windows.microsoft.com\/en-us\/windows-10\/t...BCCode: 50 0x00000050 Have you added any hardware lately? Have you updated any driver just before these started? (Check Control Panel - Windows Updates to see if any drivers were updated there about the time this started) Main likely culprits are Video driver, other major drivers, memory, and antivirus\/antispyware\/security products could be at fault as well as drive issues.BCCode: 50 0x00000050 <-- read this link http:\/\/www.faultwire.com\/solutions-fatal_error\/...*1095.html?order=votes - OR -https:\/\/tinyurl.com\/y27tgkjo================================================== This utility makes it easy to see which versions are loaded : Run DriverView - set VIEW to Hide Microsoft drivers - update those without Dump in their names (and update BIOS and chipset).DriverView - Free - utility displays the list of all device drivers currently loaded on your system. For each driver in the list, additional useful information is displayed: load address of the driver, description, version, product name, company that created the driver, and more. http:\/\/www.nirsoft.net\/utils\/driverview.htmlFor Drivers check System Maker as fallbacks and Device Maker's which are the most current. Right Click Start Button - Device Manager - Display Adapter - write down the make and complete model of your video adapter - double click - Driver's tab - write down the version info. Now click UPdate Driver (this may not do anything as MS is far behind certifying drivers) - then Right Click - Uninstall - REBOOT this will refresh the driver stack.Repeat that for Network - Network Card (NIC), Wifi, Sound, Mouse and Keyboard if 3rd party with their own software and drivers and any other major device drivers you have.Now go to System Maker's site (Dell, HP, Toshiba as examples) (as rollback) and then Device Maker's site (Realtek, Intel, Nvidia, ATI as examples) and get their latest versions. (Look for BIOS, Chipset, and software updates at System Maker's site while there.)Download - SAVE - go to where you put them - Right Click - RUN AD ADMIN - REBOOT after each installation.Always check in Device Manager - Drivers tab to be sure the version you are installing actually shows up. This is because some drivers rollback before the latest is installed (sound drivers particularly do this) so install a driver - reboot - check to be sure it is installed and repeat as needed. Repeat at Device Makers - BTW at Device Makers DO NOT RUN THEIR SCANNER - check manually by model.Manually look at manufacturer's sites for drivers - and Device Maker's sites. http:\/\/pcsupport.about.com\/od\/driverssupport\/ht...==================================================== Memory tests do not catch all errors such as mismatched memory (possible even for sticks that appear to be identical) and when faster memory is placed in system behind slower memory. So it is best to also swap sticks in and out to check for those even if all memory tests fail to show a problem. To test RAM check here - let it run 4+ hours or so. <-- best method www.memtest.org MemTestX86 - Test RAM With http:\/\/www.tenforums.com\/tutorials\/14201-memtes...For the Windows Memory Diagnostic Tool. Type in Cortana's search box -> Windows Memory Diagnostics at top of list - click it. in Windows 8\/8.1\/10 the name is \"Windows Memory Diagnostic\". ================================================ After doing ALL the updates you can, and if the issue continues, then run Driver Verifier. Driver Verifier can help find some BSOD issues : Using Driver Verifier to identify issues with Windows drivers for advanced users http:\/\/support.microsoft.com\/kb\/244617How To Troubleshoot Driver Problems in Windows Vista or 7. (8\/8.1 and 10 are essentially the same). http:\/\/www.winvistaclub.com\/t79.htmlUsing Driver Verifier https:\/\/msdn.microsoft.com\/en-us\/library\/window...WINKEY + X - RUN - type in -> verifier \/reset hit enter to disable If DriverVerifier creates a minidump upload it and post the link here so we can analyze it.======== Although this might not be a straight virtualization issue, you might get additional suggestions at Microsoft's TechNet - Forums which are also free forums.Hyper-V and Windows virtualization are supported by Microsoft's TechNet so check with the Experts there.TechNet - Windows 10 IT Pro Virtualization https:\/\/social.technet.microsoft.com\/Forums\/win...TechNet - Forums http:\/\/social.technet.microsoft.com\/Forums\/en\/c...TechNet - Where is the Forum For…? http:\/\/social.technet.microsoft.com\/Forums\/en\/w...Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all.","ok so first i uninstalled several apps i dont use anymore or dont know what it is (dont worry i was still careful). found one that, when i clicked uninstall, had the pop-up just be 100% covered with ?s. pretty sure that was some pretty bad stuff and i found 2 apps of which the installer couldnt be found in the files it seems but i couldnt find much else or the previously installed tencent thing (i might have uninstalled it earlier.)i will now try to turn on vtx. then if that works, hyper-v. note: an odd app ive had alot of trouble trying to find was in another language and could be found in task manager and, with admin, can be disabled. well i did some research and found out that the aow_drv_x64_ev.sys ( aow_drv_x64_ev+41421 ) you were talking about can be disabled in task manager too! and it isnt popping up anymore!!!!!","ok it didnt bsod when i booted so i went into windows features to turn it on.i didnt touch anything yet but here:   while waiting i did some more research i reset my browsers and checked for the app multiple other ways. found only one instance on firefox... if that was the app then i had this damn thing for a long time","If you think a problem is being caused by a installed driver from an App then use Driver Verifier (indicated above) and\/or a Clean Boot.Try the Clean Boot method to see if a startup program is involved - if so it is a process of elimination :Right Click the start button - Command Prompt (Admin) OR Windows PowerShell (Admin) - at the prompt type inMSCONFIG and hit enter How to perform a clean boot in Windows https:\/\/support.microsoft.com\/en-us\/kb\/929135Other programs to help : Autoruns - Free - See what programs are configured to startup automatically when your system boots and you login. Autoruns also shows you the full list of Registry and file locations where applications can configure auto-start settings.http:\/\/technet.microsoft.com\/en-us\/sysinternals...Process Explorer - Free - Find out what files, registry keys and other objects processes have open, which DLLs they have loaded, and more. This uniquely powerful utility will even show you who owns each process.http:\/\/technet.microsoft.com\/en-us\/sysinternals...Process Monitor - Free - an advanced monitoring tool for Windows that shows real-time file system, Registry and process\/thread activity. It combines the features of two legacy Sysinternals utilities, Filemon and Regmon, and adds an extensive list of enhancements including rich and non-destructive filtering, comprehensive event properties such session IDs and user names, reliable process information, full thread stacks with integrated symbol support for each operation, simultaneous logging to a file, and much more. Its uniquely powerful features will make Process Monitor a core utility in your system troubleshooting and malware hunting toolkit.https:\/\/docs.microsoft.com\/en-us\/sysinternals\/d...------- If you suspect malware use Malwarebytes - Free and Hitman Pro - Trial to double check.A good utility to do full uninstallations of problem apps is Revo Uninstaller - Free (note that to totally uninstall some apps using Revo it needs to be fully installed and then run Revo).Revo Uninstaller - Free https:\/\/www.revouninstaller.com\/products\/revo-u...Be sure and check with the official Hyper-V Support at TechNet as there may be known issues involved.Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all.","i found a way to remove the malware manually in system files.","It would still be a good idea to run Malwarebytes just to be sure. If you don't have any additional questions, feel free to mark as Answer and choose a rating which helps others find the right info.Glad to have helped, and have a great day! Rob"]},{"symptom":"Windows 10 won’t boot & can't access advanced boot options        I accidentally disabled startup programs by msconfig last night, and I cannot boot up my pc now. The screen says boot configuration missing and gives the error code: 0xc0000024.  I already tried to press f8 or f12 or any keys, sadly nothing works. I cannot even get access to advanced boot setup.It’s a windows 10 laptop.I want to back up my files, what should I do? Please help me.","solutions":["You’ll require another PC to download this PC .iso which contains various tools to fix & backup your PC:https:\/\/www.tenforums.com\/software-apps\/27180-w...You can use this to boot your PC & run Macrium to try & fix your boot configuration or image your system amongst other things.","Often fixboot may fail. Glad to hear this fixed the problem though. :) Best wishes to you & yours for 2020. If you don’t have any further questions please feel free to mark one of the replies as the answer &\/or rate my help: 1 star means you are very unsatisfied with my help and 5 stars means you are very satisfied with the help I gave you."]}]}