{"windows":[{"symptom":"Windows 10 Update 1909 doesn't work on my computer        I have been trying to update my computer first of all from 1803 to 1809 and now 1909 since May 2019 and it won't work for either. Microsoft have tried every possible method and they say only a clean install can now be tried.  Why should I have to go to all this bother trying to back up all my data and printing out all my e-mails as they will be lost? I don't want the features these updates offer anyway but I can't seem to turn them off. Microsoft rung me over 30 times so it has been a waste of manpower resources too.One of the problems is that my computer won't restart and so every time it tries during the updates I have to power off and on again. This I have to do twice and it continues with the installation but then stops at 87% every time. This time when I power off it goes back to the previous version. The error code is always the same -it is during the 'Migrate data' phase.If anyone can offer any suggestions I would be grateful. Also, if restart doesn't work, will a clean install work?","solutions":["Hi, Apologies if you have tried this already. But have you tried using the \"Upgrade now\" option from the Windows 10 download site? Windows will use a disk image that's stored in your system files for feature updates manually. If this is corrupt it can cause issues updating, this is why we typically recommend repairing with windows boot media when there are other Windows issues. Upgrade now will use a clean image from the latest version to perform the upgrade without needing to repair with a boot disk first.As for whether a clean install would work, in theory it should. As any thing it's having trouble migrating from an old version wouldn't be moved with a clean install. But we can't guarantee that will be the case.I hope that helps."]},{"symptom":"Kernel Mode Heap Corruption in WIndows 10 Pro        The last few days my computer has crashed at random points and given me the same blue screen error labeled: Kernel_Mode_Heap_Corruption. I need help remotely or with a qualified tech to get to the bottom as to why my computer is crashing like this, please. And it does not always restart. It often sits there with the message, and I have to force the computer off by holding down the power button and then start it up again. I have attached a screen shot below for your review. I appreciate all the help in resolving this issue. Thank you very much.Ernie M","solutions":["Hi Ernie, BSOD's are generally caused by a corrupt or incompatible device driver, to diagnose the underlying issue, I need to analyse your Mini-dump file(s):Open Windows File Explorer Navigate to C:\\Windows\\Minidump Zip up the contents of that folder If you have problems zipping those files, copy them out onto your Desktop and zip them from thereUpload the zip file to the Cloud (OneDrive, DropBox . . . etc.) Then post a link here to the zip file, so we can take a look for you . . . I solved the problem on my own by doing research. I ran a memory scanning utility and somehow the problems of the BSOD issues have never returned since the last 3 weeks. why these issues happen is a mystery"]},{"symptom":"Screen saver        My screen saver used to work with my Photo Gallery folder in File Explorer then I had to make a\" Photo screen saver\" folder.  Now it tells me I have no Picture Library.  I made one but it won't  acknowledge it.  What do I do now to get my screen saver to work.","solutions":["Hi Alice, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.See the information in this link that some Windows MVPs share. As recommended in the first points of the link, the main thing is to make sure that Windows is updated.https:\/\/www.lifewire.com\/fix-non-working-screen...If they do not work, you can start Windows through a clean boot, it is an error-proof process, so we can detect if it is a third-party program or driver that causes the problem.https:\/\/support.microsoft.com\/en-us\/help\/929135...We can complement the previous process, with a scan to the computer in search of corrupt files that interfere with the operation of Windows, if they are detected, they will be repaired automatically.https:\/\/support.microsoft.com\/en-us\/help\/402652...Let me know if you have something else that I can help you with, I'd be happy to help.Happy new year Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"muted app has sound        Store app is muted in volume mixer. Ad appears in that app and there is a sound in it. There is no way to mute it nor decrease sound volume. And of course, there is no way to block that ad. This problem is not only annoying, it forces you to turn the sound off, or stop using certain apps.","solutions":["You're welcome, Rale. It's most likely being done by the app. You can try disabling or removing Comodo to test it, since it's known to cause issues that Defender doesn't.Just in case I'll give you all possible solutions for Sound problems in order of priority, so please try any you've already tried again in order. If you have any problems performing any steps I'll be standing by here to help you.1) Update the sound driver from the PC or device maker's Support Downloads webpage for your exact model, if it is newer than the one presently installed in Device Manager reached by right clicking the Start button. While there compare to make sure you also have the latest BIOS, Chipset, Display, Network and all other drivers. 2) Restore the Windows Audio Service which may have become disabled: https:\/\/www.tenforums.com\/tutorials\/57567-resto... 3) Next try these checklists: https:\/\/support.microsoft.com\/en-in\/help\/402699... https:\/\/www.howtogeek.com\/443702\/how-to-fix-sou...4) Right click Volume icon in System Tray, choose Sound Settings, from the Output and Input devices dropdown menus, choose then one(s) affected to see if that helps. If not use the Troubleshoot button nearby.5) Run the Playing Sound troubleshooter at Start button > Settings>Update & Security>Troubleshoot.6) Try rolling back the sound drivers in Device Manager reached by right clicking the Start button. Choose Sound controller and other audio devices, then Driver tab, then Roll back if available.7) If no newer sound drivers then uninstall the one presently installed in Device Manager, reached by right clicking the Start Button. Restart PC to reinstall.8) Try other and older drivers for your model Sound controller, too. For example, try the next oldest driver in the model's online Support Downloads list. To try all previous drivers installed on your system, in Device Manager choose Sound controller's Driver tab, then Update Driver, then Browse, then Let Me Pick. Finally, try installing the latest Sound driver in Compatibility Mode as shown here:https:\/\/social.technet.microsoft.com\/Forums\/win...9) If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 10) If this was caused by a Version update (which you can confirm at Settings > System > About) then you can roll back the version in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 11) You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... 12) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. 13) If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Administrator account access        Do not have administrator account access and cannot make changes to settings without it.  Keep getting access denied message.  How do I fix this","solutions":["Do not have administrator account access and cannot make changes to settings without it.  Keep getting access denied message.  How do I fix thisEvery Windows installation has an admin account, no exception. What happened to yours? Did you demote it? Delete it? How long since you noticed this problem?","Hi Rick109, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.These are recommendations of websites that belong to Windows MVP, check if the instructions help you find the solution to the problem.https:\/\/www.thewindowsclub.com\/lost-administrat...If the above indications do not work, another option is, start in safe mode, you must press and hold the Shift key while restarting the computer, in this way you will observe the advanced recovery screen. Follow this route:https:\/\/support.microsoft.com\/en-us\/help\/12376\/...Click on option >> Troubleshoot >> Advanced options >> Click on Command Prompt >> At the command prompt, type:net user administrator \/active:yes + Enter, then close the command prompt, restart, then try to log in to the administrator account.Let me know if you have something else that I can help you with, I'd be happy to help.Happy New Year Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"hotspot problem         I have tried many ways but cant fix the hotspot problem. I cant find microsoft hosted network adapter in network adapter.There is mobile hotspot option but not working.please help me.","solutions":["Hi Asaduzzaman Please see the reply marked as answer on this thread on the HP forum, they found a version of driver for the Realtek RTl8723BE card that will support hosted network . . .https:\/\/h30434.www3.hp.com\/t5\/Notebook-Wireless...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","Thank you . but mine is ASUS X556U","That driver should still work on your system . . .","Still shows this.","Hi AsaduzzamanAsad,from the screenshot you sent, it appears that you are not connected to the internet.How do you connect with your PC to the internet, via ethernet, wi-fi or via cellular network?Do you use a modem \/ router to connect to the internet?If you haven't already done so, try restarting your pc and router and then try again.","pc is connected via broadband connection.","But how are you connected, via ethernet or wi-fi?Do you use a modem \/ router, yes or no?Specify better.","Look this","No. With that type of connection you cannot enable the Windows 10 mobile hotspot. Some Windows 10 apps, including Hotspot Mobile, in order to function correctly need to \"see\" a gateway, then a router.Try to get around the problem by connecting to the internet through a VPN software.I noticed that you have the Opera browser, this browser should have integrated VPN software, try using that."]},{"symptom":"printing problem since last update        Everything I try to print goes into 'Print to File' mode, even though I made sure that box wasn't ticked in each program I tried to print from.  I followed instructions on videos but no luck.  So much wasted time!","solutions":["Hi VictoriaShaw2, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.I suggest you consult and apply these official steps to solve this problem, apply them in the established order, if it does not solve the problem, continue with the next one, step #4 you can execute it directly from Windows, or from the manufacturer's website device. Does the problem occur at all times? Or only with Office documents? Can the Windows test page be printed?https:\/\/support.microsoft.com\/en-us\/help\/401540...If no previous step, managed to solve the problem, please inform us what is the brand and model of your printer? If it is by wireless connection or USB cable?Let me know if you have something else that I can help you with, I'd be happy to help.Happy New Year Regards, Marc M."]},{"symptom":"Account amministratore corrotto        Come faccio a cancellare un Account amministratore Primario a favore di uno Secondario, questo perchè entrando col Primario e stando su internet ormai ho errori di BitLocker che diversamente non riesco a rimuovere ...","solutions":["OK, sulla nuova installazione non abilitare quello superadministrator, o comunque non navigare con quello, in modo da essere sicuro di non corromperlo.Ti auguro buon lavoro di ripristino e un buon anno!"]},{"symptom":"display driver is not working        Dear  Concern person greetingsi have installed all the necessary updated driver in the system but it is not working properly and this information is showing in the device manager. Please help me how can i get rid of this issue.thanks.!Driver Management concluded the process to install driver u0349781.inf_amd64_a9a51f30a2be0d77 for Device Instance ID PCI\\VEN_1002&DEV_731F&SUBSYS_2398148C&REV_C1\\6&F397DEA&0&00000019 with the following status: 0x0.Information 31-12-2019 07:34:47 PM UserPnp 20001 (7005)Error 31-12-2019 07:34:46 PM Kernel-PnP 411 NoneInformation 31-12-2019 07:34:46 PM Kernel-PnP 400 NoneInformation 31-12-2019 06:50:53 PM UserPnp 20001 (7005)Information 31-12-2019 06:50:53 PM Kernel-PnP 410 NoneInformation 31-12-2019 06:50:53 PM Kernel-PnP 400 NoneInformation 31-12-2019 06:50:52 PM Kernel-PnP 430 NoneInformation 31-12-2019 06:45:10 PM Kernel-PnP 420 NoneInformation 30-12-2019 08:02:17 PM UserPnp 20001 (7005)Error 30-12-2019 08:02:17 PM Kernel-PnP 411 NoneInformation 30-12-2019 08:02:17 PM Kernel-PnP 400 NoneInformation 30-12-2019 07:33:14 PM UserPnp 20001 (7005)Error 30-12-2019 07:33:14 PM Kernel-PnP 411 NoneInformation 30-12-2019 07:33:14 PM Kernel-PnP 400 NoneInformation 30-12-2019 07:18:22 PM UserPnp 20001 (7005)Information 30-12-2019 07:18:22 PM Kernel-PnP 410 NoneInformation 30-12-2019 07:18:21 PM Kernel-PnP 400 NoneInformation 30-12-2019 04:32:59 PM UserPnp 20001 (7005)Error 30-12-2019 04:32:59 PM Kernel-PnP 411 NoneInformation 30-12-2019 04:32:59 PM Kernel-PnP 400 NoneInformation 30-12-2019 04:19:59 PM UserPnp 20001 (7005)Error 30-12-2019 04:19:59 PM Kernel-PnP 411 NoneInformation 30-12-2019 04:19:59 PM Kernel-PnP 400 NoneInformation 30-12-2019 12:34:12 AM Kernel-PnP 410 NoneInformation 30-12-2019 12:34:12 AM UserPnp 20001 (7005)Information 30-12-2019 12:34:12 AM Kernel-PnP 400 NoneInformation 30-12-2019 12:34:12 AM Kernel-PnP 440 NoneInformation 30-12-2019 12:33:51 AM Kernel-PnP 430 NoneInformation 30-12-2019 12:33:48 AM Kernel-PnP 430 None ","solutions":["Hi TheBanjaraMan, Just to clarify, upon checking your screenshots, this relates to AMD. Are you able to install AMD Catalyst as well? It should be automatically calibrated since AMD drivers are integrated with Vulkan.Please try to check again and see if you also installed correct Chipset Drivers. Thanks and regards,"]},{"symptom":"Lost email adress books        I have a new computer (HP all in one Windows 10}  When transferring to new computer my contact list and  their email addresses disappeared.  Can they be restored?","solutions":[]},{"symptom":"upgraded from Window 7 to windows 10        I have just upgraded from Windows 7 to Windows 10 but Microsoft Outlook will not open and I cannot access mt emails or Contacts List","solutions":["http:\/\/www.outlook.com to get i to your e mail","Hi ouchie, I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.I find this article would be useful for you: https:\/\/support.office.com\/en-us\/article\/i-can-...I would ask that you try \"Run the \/resetnavpane command\" solution in the article. Do note that this removes all customizations to the navigation pane you had before the upgrade.Let me know if I can help you further!","I have just upgraded from Windows 7 to Windows 10 but Microsoft Outlook will not open and I cannot access mt emails or Contacts ListHi. Please perform the basic troubleshooting to repair your Outlook by going to Control Panel clickPrograms - Programs and Features - Look for Microsoft Outlook or Microsoft Office, right click on it and hit repair or change. ","Many thanks to the three quick responders who have offered a series of useful suggestions to resolve my query. I had already tried the navpane and compatibility ideas and have now run through the new proposals in your replies without success. Trying to open the Outlook App, which was carried over to my new desk top in Windows 10, continues to give the message \"Cannot start Microsoft Outlook. It requires MS Outlook Express 4.01 or greater. Install by running IE5Setup.exe from the Windows Update Web Site\" I finally located and downloaded this file but it will not run or install.I have resolved my immediate problem by opening an email account with the new  Mail App although the presentation is not as convenient as in Outlook. My main problem now is that I have lost  my extensive  Contact List. Is there any way of getting a copy from the inaccessible Outlook programme!!! I do have a back up copy of Widows7 on another drive although I am not too keen on switching the drives just to get at the list.I was quite pleased and impressed with the upgrade from Windows 7 which completed smoothly, everything worked (except Outlook) and all the new drivers for my devices appear to have been installed.","Did you check your 'People' App and the Settings in both your 'People' App and 'Mail' App also for the Account itself?Also the email and account settings in the Settings (the 'Wheel' above Start when you click it). It may not be the ultimate solution to the fault but it may be useful to check and get to know all of these complex locations anyway:'People' App > Settings'Mail' App > SettingsSettings > AccountsSettings > AppsSettings > Privacy > ContactsSettings > Privacy > EmailSometimes running an old (setup) program in the administrator Compatibility mode may help also (Right-Click Context Menu > Compatibility, or Properties) and sometimes Compatibility mode should NOT be in use.Just mentioning this; I do not know enough about what you already know\/did\/tried exactly.It may also be helpful to others at some point if you tell us which version of Outlook we are talking about?You may want to backup your local Outlook contents (an Outlook.pst and maybe an Archive.pst file also) to be safe later? For an older Outlook probably located in: Users\\ ... \\AppData\\Local\\Microsoft\\Outlook\\ (where ... is your profile-name). For Outlook 2010 and later probably located in the subfolder Outlook-files in your personal (Users\\ ... \\Documents) 'My Documents' folder (check this default location if you know that you did not change this to an other location yourself). Some Outlook users may have them in: Users\\ ... \\Roaming\\Microsoft\\Outlook.","I have just upgraded from Windows 7 to Windows 10 but Microsoft Outlook will not open and I cannot access mt emails or Contacts ListHello,What is the error you got?Regards.","Thank you for your interest I have already posted a reply detailing the error message when trying to open Outlook"]},{"symptom":"I'm getting weird scrambled and missing letteres on the windows Menus - Is this a virus? A Bug?        Can any one tell me what the fudge is happaning? Look at the text inside the yellow boxes.. I did a Full Virus Scan, Offline Virus Scan.. all comes back clean. So maybe it's a bug?","solutions":["Hey Lucas, Please follow the guide in this article on how to clear the font cache manually and rebuild it.https:\/\/winaero.com\/blog\/rebuild-font-cache-win...Please note, that this is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"OneDrive files sync status icon is very small (Surface Book 2)        Hello,I've started using OneDrive however, on my Surface the icons indicating status of the sync are crazy small (see below)Now this is with 3240x2160 175% scaling and medium icons. I actually use small icons but to demonstrate the sice of the sync icons I used medium ones. I tried: change resolution, change scaling, change icon size but none helped. Any ideas how I could get larger icons on my surface? (On my desktop the icons are fine)Winver: 2004 OS Build 19041.1Onedrive sync client version: Build 19.222.1110.0004Moved from: OneDrive with Office \/ Windows 10 \/ Office 365 Home","solutions":[]},{"symptom":"Win 10        Win 10 is such a User Unfriendly POS.","solutions":[]},{"symptom":"Win 10 update        Updated desktop pc from win 7 to win 10 but after completion system keeps freezing at various points. Performed system file checker and scannow from command prompt but found no errors.","solutions":["Hi John,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.When you say freezes, do you mean it locks itself up and you have to Restart or does it get alive after a while?To better understand the issue, Please see the article below on how to share System logs.http:\/\/www.yourwindowsguide.com\/2017\/12\/how-to-...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads."]},{"symptom":"If I change my laptop password will it change my entire microsoft password?        My brother got a new laptop and I have his old one. Basically, I am still using his microsoft account on this laptop and I want to change the password but I think it might change his microsoft account password rather than just my laptop. I have had this laptop for a year and I don't want to make a new account with my email because there is way to much stuff on this account. Thanks","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.It would change the Microsoft account password as it is linked. I suggest you try convert the account to a local account this way you won’t have to move anything to a new account. Follow the steps in this guide:https:\/\/www.windowscentral.com\/how-switch-local...Once complete, if you wish, you could link this local account to a new Microsoft account.Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thank you for replying. I checked the site and followed the instructions but I have no option to switch to a local account. ","Personally, i think you should start using your own account. Reset the PC to factory, then set it up again using your account. That way, you cannot accidentally affect his account and there will be no legal issues with using software licensed only to him because it will be removed."]},{"symptom":"Keyboard, mouse, screen and power button not working        I had my windows 10 dell laptop repaired 3 weeks ago and everything was working perfectly (whole laptop was reset) and today the keyboard stopped working, the screen froze, the mouse froze and when i tried to turn it off, the power button done nothing forcing me to have to wait for it to run out of power, i them turned it back on and it was working perfectly, 20 mins later same thing happened again but this time the mouse wasnt frozen, i looked on google and done something like \"sf \/scannow\" to try and fix any file corruption but it said there was nothing wrong with it, someone help?","solutions":[]},{"symptom":"ZaloCall.exe Error:  memory could not be written {was: Help me, thanks}        Khi cài onedrive vào máy tính bị lỗi: the instruction at 0x011e2be6 referenced memory at 0x00064. the memory could not be written. Help me, thanks","solutions":["This is an English-language forum.  Unfortunately, there is no Vietnamese forum in Microsoft Community.  If you are not comfortable using English, perhaps one of the other languages will be better.  Click the \"globe\" icon at the lower left of any page in Microsoft Community to see a list of the supported languages.  Đây là một diễn đàn tiếng Anh. Thật không may, không có diễn đàn tiếng Việt trong Cộng đồng Microsoft. Nếu bạn không thoải mái khi sử dụng tiếng Anh, có lẽ một trong những ngôn ngữ khác sẽ tốt hơn. Nhấp vào biểu tượng \"quả địa cầu\" ở phía dưới bên trái của bất kỳ trang nào trong Cộng đồng Microsoft để xem danh sách các ngôn ngữ được hỗ trợ.****************************************************************************Although you state that your problem occurs \"when installing OneDrive\" (\"khi cài onedrive\"), the error message in your screenshot indicates a problem with ZaloCall.exe.  Zalo is an app that is primarily intended for smartphones, although it can also be installed on a Windows computer.The \"Zalo Desktop\" app available in the Microsoft Store (https:\/\/www.microsoft.com\/en-us\/p\/zalo-desktop\/9nlspxn6g2jl?activetab=pivot:regionofsystemrequirementstab) is only for Windows 10.  If you have Windows 7 and are attempting to use this app, it won't work.There are several web sites that offer instructions on how to install the Zalo Android app by first installing an emulator such as the BlueStacks App Player.  See for example:https:\/\/softstribe.com\/app\/pc\/download-install-com-zing-zalo-windows-mac-oshttp:\/\/www.webtech360.com\/detail\/zalo-for-pc-download-and-installation-guide-zalo-for-pc-windows-computer-2148.htmlMặc dù bạn nói rằng sự cố của bạn xảy ra \"khi cài đặt OneDrive\", thông báo lỗi trong ảnh chụp màn hình của bạn cho thấy có vấn đề với ZaloCall.exe. Zalo là một ứng dụng chủ yếu dành cho điện thoại thông minh, mặc dù nó cũng có thể được cài đặt trên máy tính Windows.Ứng dụng \"Zalo Desktop\" có sẵn trong Microsoft Store (https:\/\/www.microsoft.com\/en-us\/p\/zalo-desktop\/9nlspxn6g2jl?activetab=pOLL:regionofsystemrequirementstab) chỉ dành cho Windows 10. Nếu bạn có Windows 7 và đang cố gắng sử dụng ứng dụng này, nó sẽ không hoạt động.Có một số trang web cung cấp hướng dẫn về cách cài đặt ứng dụng Zalo Android bằng cách cài đặt trình giả lập đầu tiên như Trình phát ứng dụng BlueStacks. Xem ví dụ:https:\/\/softstribe.com\/app\/pc\/download-install-com-zing-zalo-windows-mac-oshttp:\/\/www.webtech360.com\/detail\/zalo-for-pc-download-and-installation-guide-zalo-for-pc-windows-computer-2148.html","Sorry, I send again","As near as I can determine, the \"procedure entry point EventSetInformation\" is only in versions 6.2 and higher of ADVAPI32.dll.  Because ADVAPI32.dll version 6.2 is for Windows 8, I can only assume that your problem is caused by attempting to install something meant for Windows 8 in a Windows 7 system.  Please see https:\/\/support.office.com\/en-us\/article\/onedrive-desktop-app-for-previous-versions-of-windows-850703dd-ea56-4c7a-bff5-6c2e4da227cf"]},{"symptom":"How to reconnect the File History for backup        I keep getting a message \"my File History drive is disconnected\" how do i reconnect?","solutions":["Hi Mary,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Please see the steps here:https:\/\/support.microsoft.com\/en-in\/help\/402656...Because Backup utilities in 10 are not being actively developed, you might see unexpected bugs. Switching to a 3rd party program like Reflect is what I and Microsoft recommend."]},{"symptom":"How to uninstall an old program in Windows 10        I have an old photo manager program which need to uninstall. It's a UK program created by a now defunct (since 2007) company, Pixology, called Jessops Picture Manager Version 1.0.0.13 part of Jessops Picture suite copyright date 2003. Jessops processed pictures taken on film and with the prints provided them also on CD for which this software was required to view them.This has been fine to view these old photos but this software has now hijacked the viewing of all and any photos on my Windows 10 desktop computer with its Picture Manager. Having now printed all the Photos and re-scanned them as modern scanned images, I no longer need this software so need to uninstall it.When I try to uninstall it I get the following message: 'Could not open INSTALL.LOG file'. I have tried to uninstall with the Jessops CD in the drive but this does not find this file. I have not been able to uninstall this program nor have I found a way to disable it. How can I now uninstall this program?","solutions":["Hi Stephen Click the link below to download the Free version of Revo Uninstaller, it can uninstall even the most stubborn of applications:https:\/\/www.revouninstaller.com\/products\/revo-u...Also, open the Settings App (gear icon on your Start Menu) Go to Apps - Default Apps At the top of that page, set the Default Picture Viewer to the Photos App . . . ________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","Hello Dave,Many thanks for your prompt response, much appreciated.By chance, I have just found a way to 'disable' this program which has solved my immediate problem. I'll look next at uninstalling the program following your suggestion.I had already ensured that 'pictures' always opened with the Photo App which was already set as the default but this didn't seem to stop this other program 'hijacking' my Pictures; not now an immediate issue but thanks for the suggestion.Stephen."]}]}