{"windows":[{"symptom":"Message  of undeliver email.        May I ask why I am getting the following message when I sent email through my outlook account as well as from my yahoo mailacount? The following message to <*** Email address is removed for privacy ***> was undeliverable.The reason for the problem:5.x.0 - Message bounced by administrator","solutions":["That error pretty much means what it says:  the \"administrator\" of the email service to which you message was addressed didn't like your message for some reason and refused delivery.Sometimes, the messages are more specific, such as \"Spam detected by content scanner. Message rejected\" or \"554 delivery error: dd Sorry, your message to xxxx@yahoo.com cannot be delivered. This mailbox is disabled (554.30).\"In your case, given that you get a bounce from two different sending accounts, the problem is likely to be either the content or subject line of the message (the receiving service thinks your message is spam) or something wrong with the recipient's mailbox (too full, closed account, etc.).You can try to send a very simple message to your addressee -- plain text, no attachments, nothing that sounds like a scam.  If that doesn't work, about all you can do is call your addressee and ask them to ask their email provider for an explanation or you can send an email to email support for the addressee's email service yourself.  Use Google to search it."]},{"symptom":"i need to reactivate windows but i dont know my product key        i just upgraded my motherboard and graphics card and after i booted up the system its saying i have to reactivate windows and enter my product key. windows came installed on the computer when i bought it and never had a key to begin with. how do i find out the key and no i dont have the paperwork still that came with the comp,","solutions":["Since you upgraded the motherboard it is a new computer and need a new license.  You need to purchase Windows 10 from Microsoft.","Hi Joe. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Unfortunately when you change the motherboard it removes the Product Key embedded in UEFI firmware chip at the factory. This is why Factory OEM licenses have never been allowed to migrate past the first motherboard.So you'll need to buy a new key. I suggest buying directly from Microsoft here: https:\/\/www.microsoft.com\/en-us\/p\/windows-10-ho...or from a major retailer who back all sales only. There are still also a few ways to get Windows 10 for free here: https:\/\/www.zdnet.com\/article\/heres-how-you-can...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it. Feel"]},{"symptom":"White and orange lights blinking successively on the battery indicator of my laptop.        Windows 10 Enterprise, 17134.1184 64-bit OS.Hey,I just experienced something unusual. The battery indicator of my laptop started to blink white and orange successively. I have attached a hyperlink to the video on my Onedrive :\"URL TO THE VIDEO\"At the same time, I have noticed that suddenly the battery of my laptop is stuck at 0% but still it shows it's charging. Plus, my PC goes off when I disconnect the charger.So, please if you can explain to me what caused these issues and how to solve them, I will always stand grateful to you.Thanks,Jyotirmay Kumar Jha.","solutions":["Hello Jyotirmay, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemThere's a big chance that your battery is dead and not able to charge at all, To see how many cells are alive in your battery, you have 2 options: * First option. download and install this tool, which will check your battery healthhttps:\/\/www.nirsoft.net\/utils\/battery_informati...Please note that this is not a Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. * Second option, Boot into your BIOS, and see if it supports checking the battery health, if the laptop is new, there should be an option to test and diagnose the battery.Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolvedCheers! Farah"]},{"symptom":"Microsoft Outlook        Message: Microsoft Outlook has stopped working.And it shuts down.What to do to restore or return to working condition.Also, as an aside. system freezez while using Family Tree Maker. Use Control\/Alt\/Del and lose all recent data.  Outlook problem followed this incident.","solutions":["\"Manage, download, back up, or restore Office products\"https:\/\/products.office.com\/en\/download-back-up-restore-microsoft-office-products\"Find your Office product key\"https:\/\/support.office.com\/en-us\/article\/Find-your-Office-product-key-12a5763a-d45c-4685-8c95-a44500213759\"Repair an Office application\"https:\/\/support.office.com\/en-us\/article\/Repair-an-Office-application-7821d4b6-7c1d-4205-aa0e-a6b40c5bb88b?ui=en-US&rs=en-US&ad=US&fromAR=1@@@@@@@@@@@@@@@@@@@@@@@@@","Message: Microsoft Outlook has stopped working.And it shuts down.What to do to restore or return to working condition.Also, as an aside. system freezez while using Family Tree Maker. Use Control\/Alt\/Del and lose all recent data.  Outlook problem followed this incident.Did you Open outlook in safe mode? What happened?"]},{"symptom":"Can't see computer in network        My laptop and desktop are connected via crossover cable, I can ping and remote connect between them with a response, but for some reason they aren't showing up in the file explorer network. Im running win 10 pro","solutions":["Hi Blue. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See how to set up an ad-hoc network with a crossover cable in Windows 10: https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/smallbusiness.chron.com\/hook-up-two-pcs...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi, thank you for the reply but neither of these have fixed my problem","Then let's look at other methods for file sharing: Windows sharing has been broken ever since they removed Homegroup, causing many to believe this was intentional to push us to OneDrive sharing. More about that option later.I'll give you everything possible to try for file sharing problems so at least something will work. If you need help performing any steps I am standing by here to help:See here for how to share files and printers over network after removal of HomeGroup in Version 1803:https:\/\/www.windowscentral.com\/how-share-files-...https:\/\/www.tenforums.com\/tutorials\/111783-shar...https:\/\/www.windowscentral.com\/how-access-files...To troubleshoot sharing problems: https:\/\/www.lifewire.com\/troubleshooting-window...https:\/\/windowsunplugged.blog\/2018\/03\/27\/networ...https:\/\/www.thewindowsclub.com\/network-computer...https:\/\/superuser.com\/questions\/1202441\/windows...If you cannot get past the password protected sharing prompt: https:\/\/www.isunshare.com\/windows-10\/fix-enter-...https:\/\/www.speedguide.net\/faq\/windows-is-askin...https:\/\/www.tenforums.com\/network-sharing\/61689...If Windows 7 is involved make sure if applicable you have the WIndows Update released to fix Windows 7 sharing issues here:https:\/\/www.bleepingcomputer.com\/news\/microsoft... Test if turning off Controlled Folder access helps: https:\/\/www.thewindowsclub.com\/controlled-folde... See these additional resources for when a PC does not show up on network: http:\/\/woshub.com\/network-computers-not-showing...https:\/\/www.thewindowsclub.com\/network-computer...https:\/\/social.technet.microsoft.com\/Forums\/en-...You may want to change to sharing via OneDrive: https:\/\/www.computerworld.com\/article\/3256907\/m... Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... If you want to express your opinion on this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems. If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Valid MS e-mail        Is msa at communication.microsoft.com a valid Microsoft address?  Where \"at\" is @.","solutions":["I'm happy to help, Arayk. Let me know if there's anything else. Also when ready please mark the post which helped most as the Answer, to help others. A rating is also appreciated."]},{"symptom":"win 10 can't find cd fix        I had that problem like so many other users. I did a factory reset and had cd in usb port. When all was said and done there it was. The problem being that the system couldn't find it because unlike laptops with cd installed windows 10 thinks it's not here. Windows 10 has to know that the cd\/DVD is connected. No need to go to the Regeditor, change atpi. Leave that to the pros. Just plug your device in USB port and reboot. Windows will not recognize if already running. You have to connect and reboot.","solutions":["Withe a CD\/DVD installed go to Disk Management (win + x).  It should show you the drive with a letter that you will find in File Explorer.","? was that a post. I fixed mine","Any reply is a post.","one up on me. I had a commodore 64 \/ boots with  fllopy disk 5 inch IBM 8088 fllopy boot heathkit-H-89 built my first 286 from scratch and used parts. I was in Korea in 1952 U.S Navy (\"FROGMAN\")"]},{"symptom":"Very Low Upload Speed on One Device Only        As you can see in the title, I have been experiencing an extremely low upload speed on my computer, ever since i had performed a factory reset. These are speeds ranging from 0.01 - about 0.08 mbps, whereas my other devices acheive a speed of >20mbps.I have tried updating and reinstalling my drivers, and even performing an in place upgrade, but none of these worked. I disabled Windows Management Instrumentation, which worked as a temporary fix and then the problem returned. Re-enabling it then temporarily fixed it again, but it came back the next day.I know this is not a problem with my ISP or modem, as all my other devices are perfectly fineMy dowload speeds are perfectly fine as well, with a speed of >40mbps","solutions":["Hi, Nayannaidu My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps to repair your Internet connections: Enter the Start menu or by pressing the Win + I key combination, open the Settings and click on the Network and Internet option. Once there, we select the Status option from the menu on the left side and, within the configurations and options that are loaded in the right panel, we have to look for the restoration of the network. When you click on this option, it will show us a new window from where we can restore the network in Windows 10. In this way, all network adapters will be removed and reinstalled, and the original configuration of other network components will be restored. net. This implies that if we were using some software, such as a VPN client or virtual switches, we will have to reinstall them.A process that the system performs automatically by clicking on the Reset button that is now displayed in Network Reset in Windows 10 settings. It is normal for the process to not take long, although we must wait until the end completely and restart the computer to continue with the network configuration in Windows 10 as we have done so far.https:\/\/www.kapilarya.com\/how-to-reset-network-...https:\/\/support.microsoft.com\/en-us\/help\/10741\/...You can also check that your drivers are updated. https:\/\/support.microsoft.com\/en-us\/help\/402844...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","This didnt work unfortunately.May I add that the speeds are fine over ethernet, it is only problematic over wifi"]},{"symptom":"Sound issues        Hi! Everytime i start my pc the sound doesn't work so i need to uninstall the drivers and restart my computer then it will work. But next time i starts up my computer i have to do it all over again. What can cause this issue? ","solutions":["Hi Emil. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Let's find and fix the problem. I'll give you all possible solutions for Sound problems in order of priority, so please try any you've already tried again in order. If you have any problems performing any steps I'll be standing by here to help you.1) Update the sound driver from the PC or device maker's Support Downloads webpage for your exact model, if it is newer than the one presently installed in Device Manager reached by right clicking the Start button. While there compare to make sure you also have the latest BIOS, Chipset, Display, Network and all other drivers. 2) Restore the Windows Audio Service which may have become disabled: https:\/\/www.tenforums.com\/tutorials\/57567-resto... 3) Next try these checklists: https:\/\/support.microsoft.com\/en-in\/help\/402699... https:\/\/www.howtogeek.com\/443702\/how-to-fix-sou...4) Right click Volume icon in System Tray, choose Sound Settings, from the Output and Input devices dropdown menus, choose then one(s) affected to see if that helps. If not use the Troubleshoot button nearby.5) Run the Playing Sound troubleshooter at Start button > Settings>Update & Security>Troubleshoot.6) Try rolling back the sound drivers in Device Manager reached by right clicking the Start button. Choose Sound controller and other audio devices, then Driver tab, then Roll back if available.7) If no newer sound drivers then uninstall the one presently installed in Device Manager, reached by right clicking the Start Button. Restart PC to reinstall.8) Try other and older drivers for your model Sound controller, too. For example, try the next oldest driver in the model's online Support Downloads list. To try all previous drivers installed on your system, in Device Manager choose Sound controller's Driver tab, then Update Driver, then Browse, then Let Me Pick. Finally, try installing the latest Sound driver in Compatibility Mode as shown here:https:\/\/social.technet.microsoft.com\/Forums\/win...9) If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 10) If this was caused by a Version update (which you can confirm at Settings > System > About) then you can roll back the version in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 11) You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... 12) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. 13) If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Microsoft Wireless Display Adapter        My Microsoft Wireless Display Adapter worked perfect to play Netflix and Amazon shows from my 4 year old HP laptop to my 7 year old TV. However, when I use my new Dell laptop, the video and audio on the TV works for a few seconds and then pauses and pixtulates (spelling??), then works fine again for a few seconds before pausing, etc. Is there a setting on my new Dell laptop that needs to be adjusted?","solutions":["Hi Bob, Can you please check if your Internet Connection has latency? This screen pixelation that you're experiencing is caused by buffering and video data downloading on your end that it doesn't suffice the needed speed to stream the specific video base on your resolution.You can try to lower down the Resolution of the video if you're streaming online.However, you can further clarify this issue. You can provide helpful information by sending a screenshot as well.We will be waiting for your response. Thanks and regards,","Hi Richard, I can watch the Amazon show on my laptop computer just fine. It's only when I try to send the show to my TV using the Microsoft Wireless Display Adapter that there is a problem.","Hi Bob, Most likely, if it's not the Adapter itself. It would be your Wireless Connection. Have you tried resetting your Wireless Network as well? Or if you have 5G connection, I guess that would be better. Please let me know if you consider this suggestions. Thanks and regards,"]},{"symptom":"Microsoft store cache        Hi All,I am trying to download an update of Disney Magic Kingdoms.  When I go to the App Store I get a never ending loop of download \/ install \/ download \/install ...  If I cancel the download and run the app, it says it needs to be updated and sends me back to the app store.  I have uninstalled the program and used WSReset to clear my PC's cache.  Despite having removed the program and cleared my PC's cache, the App Store recognizes my account and goes back to looping on downloading\/installing Disney Magic Kingdoms.  It seems to me that there must be an issue at the App Store.  Is there a way to clear requests or some cache at the App Store?Thanks in advance,LD_01","solutions":["Hi LD. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything possible to repair the store. Even if you've tried a step please do it over in this sequence. If any steps cannot be performed then report it and move on to the next:1) Try updating Store apps: https:\/\/support.microsoft.com\/en-us\/help\/402625... 2) Make sure you have the latest Windows 10 version 1909 in Settings > System > About and if not skip to Step 10 to install it by the most stable method.3) See if the fixes here help: https:\/\/www.pcworld.com\/article\/3053099\/windows... 4) Try running the Windows Store apps Troubleshooter at Settings > Update & Security > Troubleshoot.5) Try resetting the Store cache: http:\/\/www.thewindowsclub.com\/reset-windows-sto... 6) If that fails go to Settings>Apps and highlight Microsoft Store, choose Advanced Settings, then Reset. After it resets, restart PC.7) If that fails then reinstall Store. Type CMD in Start Search, right click Command Prompt result to Run as Administrator, copy the following code and paste it into the box using the Edit tools from Box's top left dropdown menu, press Enter:PowerShell -ExecutionPolicy Unrestricted -Command \"& {$manifest = (Get-AppxPackage *WindowsStore*).InstallLocation + '\\AppxManifest.xml' ; Add-AppxPackage -DisableDevelopmentMode -Register $manifest}\"8) Clear the LocalCache Folder: Open Run by pressing the Windows key + R hotkey. Copy and paste %localappdata% in Run and click OK. Open Packages> Microsoft.WindowsStore_8wekyb3d8bbwe > LocalCache folder. Press the Ctrl + A hotkey to select all content within the LocalCache folder. Press the Delete button. 9) If these all fail then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account because of the serious and persistent problem with corrupted accounts. Then continue with the other steps to go over your install most thoroughly.10) If nothing else works then do a Repair Install, by installing Media Creation Tool and then choosing to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Go to the Store, Click on the 3 dots ( . . . ) to the right of your picture, click on Downloads and updated, Get updates.","Thank you Greg!  I will go through the steps as you have said and report back.","Hi Lacrub.  Thank you for the reply.  The issue is that the download for the one program just keeps looping.  I am going through Greg's suggested steps","Keep me posted. I'll be here to help until it's resolved.","Hi Greg,I went through the steps, but still wind up in the same place.  When I go to download Disney Magic Kingdoms from the App Store, it gets stuck in a download\/install loop.  Should I try the sequence again?  It seems to me that the MS store is somehow remembering me and it is stuck in some way?  Appreciate your help very much!","I'm trying to install it here now. It may be a problem with the app. Was there any indication from the repairs that your Store was corrupted? Any other problems to report?","Won't download here. Error details below. Are you getting the same? This would indicate it's offline or buggy. Will anything else download for you?If you scroll down to the bottom of the App's Information page, it gives Publisher Info including a Support link. I would contact them there. You can also report the app to Microsoft in the adjacent link.","Hi again Greg,Thank you so much for your investigation and help.  To condense my replies to both of your emails, I didn't get indications of something corrupted at the MS App Store.  My error is just a download\/install loop and not that shown in your second message.  But the app seems buggy for you and me.Let me follow your suggestion of contacting the developer.  I think you have shown that the issue is not mine alone.  Please let me follow up with Gameloft and I ask that I can revive this conversation if needed.I very much appreciate your help!LD","I'm happy to help, LD. I'll monitor this thread if you need further help or you can always ask for me here.Let me know if there's anything else. Also when ready please mark the post which helped most as the Answer, to help others. A rating is also appreciated."]},{"symptom":"network        two win 10 home laptops same network can not share drive how do I do it what do I need to do","solutions":["Hi Mike. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Windows sharing has been broken ever since they removed Homegroup, causing many to believe this was intentional to push us to OneDrive sharing. More about that option later.I'll give you everything possible to try for file sharing problems so at least something will work. If you need help performing any steps I am standing by here to help:See here for how to share files and printers over network after removal of HomeGroup in Version 1803:https:\/\/www.windowscentral.com\/how-share-files-...https:\/\/www.tenforums.com\/tutorials\/111783-shar...https:\/\/www.windowscentral.com\/how-access-files...To troubleshoot sharing problems: https:\/\/www.lifewire.com\/troubleshooting-window...https:\/\/windowsunplugged.blog\/2018\/03\/27\/networ...https:\/\/www.thewindowsclub.com\/network-computer...https:\/\/superuser.com\/questions\/1202441\/windows...If you cannot get past the password protected sharing prompt: https:\/\/www.isunshare.com\/windows-10\/fix-enter-...https:\/\/www.speedguide.net\/faq\/windows-is-askin...https:\/\/www.tenforums.com\/network-sharing\/61689...If Windows 7 is involved make sure if applicable you have the WIndows Update released to fix Windows 7 sharing issues here:https:\/\/www.bleepingcomputer.com\/news\/microsoft... Test if turning off Controlled Folder access helps: https:\/\/www.thewindowsclub.com\/controlled-folde... See these additional resources for when a PC does not show up on network: http:\/\/woshub.com\/network-computers-not-showing...https:\/\/www.thewindowsclub.com\/network-computer...https:\/\/social.technet.microsoft.com\/Forums\/en-...You may want to change to sharing via OneDrive: https:\/\/www.computerworld.com\/article\/3256907\/m... If you want to express your opinion on this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems. If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Microsoft mixed reality portal is showing part of 2 lenses and deforming the view as the headset rotates        Hi,I have an issue I didn't find a fix for. I use a Samsung Odyssey since a while now, but, one of the last updates from mixed reality portal or windows itself, there was an issue, the screen was all black in my headset. I had to uninstall the mixed reality portal and reinstalled it, and since then, the display is strange. As described in the title, the view has 2 issues. The first from my right and my left eye I can see 2 projections that are displayed in the shape of the lenses (the left display is seen in full, the right display is only a small section). It's possible that I lost some width of display overall in the process.The second issue is that as I rotate the headset horizontally, while it rotates on the correct axis, the 3D perspective is either stretched or is compacted depending of direction of the rotation, skewing the view in the process.  When rotating my head vertically, the view tilts in the correct axis but with a small tilt in another axis, which as well deforms the view. I tried uninstalling the mixed reality portal again but it didn't fix it, it's still the same.It used to work well, I only have the issue since the last few days (after a couple of weeks without using the headset).Any tips for a fix or toubleshooting would help.Thanks","solutions":["Can anyone confirm that they've read this? is there any technical support from Microsoft here?"]},{"symptom":"Microsoft Solitare not working        When I click to play today's challenge I get taken to some screen that is horribly blurry and has the title Playgame.io on it.  I've uninstalled solitaire and reinstalled and still get it.  What's going on and how do I get rid of it.  Typically when the system takes me to view an ad it's runs it's course and then gives me the option to close the ad and return to the game.  Not so with this Playgame.io. ","solutions":[]},{"symptom":"Unknown USB Device (Device Descriptor Request Failed) Driver Error. Prior suggestion drom 2015 doesn't work & is locked now.         I have a Realtek USB Wireless Wi-Fi Network Adapter 1200 Mbps & Dual. When I set it up to act as my Wi-Fi (connecter) I guess you would say, instead of the built-in Adapter it usually fails because of that {Device Descriptor} message below: \"Unknown USB Device (Device Descriptor Request Failed) Driver Error\"Usually within a week or less. When I try to follow the directions from 2015 (Pre Windows 10) I type Troubleshooting into the Settings as it says to do below:I have NO troubleshooting to select after typing in Troubleshooting as it says to. Also, I have no Hardware and Sound to click on or Hardware and Devices. Like I'm supposed to in the steps below.Follow the steps:Click on the Start icon or hit the Windows logo and click on Settings.Type Troubleshooting and select troubleshooting.Click on Hardware and Sound and select Hardware and Devices and click on next and follow the on-screen instructions.          All I have is 5 of them below instead of about 15 I should and did have at one time. After typing in Troubleshooting in the box, below it is:      - 1: Recommended troubleshooting history - 2: Troubleshoot settings- 3: Troubleshoot activation- 4: Recommended troubleshooting- 5: Available Recommended troubleshooting - SORRY: I can't delete #4 thru #8 to the left so I typed in #1 thru #5 to show you the five selections under the Settings box. I guess because if above under Follow the steps: I put a 1, 2, & 3 I can't get rid of any numbers now. I hope the 1: thru 5: I typed in front od 4 thru 8 helps more than hurts. Just goes to show you I need a Recovery really soon (with the help of HP the manufacturer of course).Any helpful suggestions would be greatly appreciated!Respectfully,Barry","solutions":[]},{"symptom":"Windows 10 update messed up admin local user account        I had an update for Windows 10 hit the other day that could not be bypassed.  I then went to get back into my computer, and initially could not log into the computer at all.  I got a cycle where it was stuck and eventually gave me a message stating: \"C:\\WINDOWS\\system32\\config\\systemprofile\\Desktop is unavailable.  If the location is on this PC, make sure the device or drive is connected or the disc is inserted, and then try again.  If the location is on a network, make sure you're connected to the network or Internet, and then try again.  If the location still can't be found, it might have been moved or deleted.\"       <OK>So, I was able to find some community help to at least be able to get into the computer again and straighten that out.  The only problem now is that on the main Admin local user account, which is mine, it seems all my desktop stuff will not load.  I can find the directories for it in the Windows Explorer, arrived at via opening the Recycle Bin, but I am stuck on how to get that to come back.The Desktop folder, as seen from Windows Explorer (or File Explorer), when right-clicked and selecting Properties, says the location is \"C:\\WINDOWS\\system32\\config\\systemprofile\\Desktop\", instead of what I believe the default is, of \"C;\\Users\\Chris\\Desktop\".  When I try to change the location, I get the message:  \"The folder can't be moved here.Failed to update the paths for known folders.The system can't find the file specified.\"  I am afraid of losing data or other things if I play around with it too much...  As it stands, I can access most, if not all of my files, albeit through a roundabout way.  However, a number of programs either do not want to run or are acting like it is the first time I have used them, and are wanting patches or first-time setup.The other local user accounts on this computer do not seem to be affected that I can immediately tell.  Only mine is the one that's all screwed up.Help would be greatly appreciated, as I can't access a number of things I would normally do on the computer, including playing a few different games, nor access my bookmarks for my web browser.PS:  One weird thing I had noticed prior to this, is that I had a couple of ghost icons that were labeled \"Desktop\" appear on my actual desktop screen.  I'm not sure if that may have anything to do with this, or not.  ","solutions":["Hi Chris. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Congrats on being able to access those files in the Recycle Bin. Can you copy them out now so they're safe?Then follow Shawns tutorial here to restore the Desktop shell User folder: https:\/\/www.tenforums.com\/tutorials\/23504-resto...Once you have the files you can try the Restore Default button shown in Option One to see if it will work. If not Option Two to recreate it from scratch always works.Keep me posted on your progress as I will be here to help until the case is resolved.____________________________Linked tutorial is from a trusted Microsoft MVP.","Thanks for responding so fast, Greg.  It's much appreciated.  Based on the guide you linked me to, I think I found part of the trouble...  Somehow, not sure how, I have 2 folders labeled \"Desktop\"  How on Earth that happened, I have no clue.  So, I need to ask, do I just delete the \"Desktop\" folder that should not be there?One of them was created today, and the other one has been there for far longer.","Chris, the Desktop folder you want is the one with the desktop icon shown on it like is pictured in Shawn's tutorial. This makes it the official Shell User folder. Any others can be deleted after checking inside there's nothing you need.Where is the official Shell User folder, still in the Recycle Bin? I'm not sure it will Restore Default Location from Option One which requires accessing it's Properties box that may be inaccessible there. You may need to recreate it from scratch using Option Two.","Here's where it gets interesting.  Both of the \"Desktop\" folders have the shell icon with them. The one that was created today has the location of:  \"C:\\WINDOWS\\system32\\config\\systemprofile\"The older one has the location:\"C:\\Users\\Chris\"I should add that to be able to get logged back in, I found myself having to copy a \"Desktop\" folder from \"C:\\Users\\Default\" (a hidden folder) to the systemprofile folder.","Are you able to browse into the folder in System 32? Does it have your files? I'd copy them out and delete it.The only location that folder should be in is C:\\Users\\Your User Name\\Desktop. But let's check in the registry to confirm it. Exact location here: http:\/\/staff.wwu.edu\/hammonj7\/itnotes\/default-p...","Here's a screen shot to show you what I saw, if that helps for anyone else who may be in my predicament.I was able to open both folders.  The only thing in the system32 folder was something for the web browser that I'm using for this chat, in this instance, Google Chrome.  However, it will not let me delete the folder.  I'm guessing I may need to go to Safe Mode to do that, or log back in from another account.As for the guide, the registry entries seem to match up.","You can try Take Ownership first using this handy tool that will install to your right click mouse button:https:\/\/www.askvg.com\/add-take-ownership-option... If that fails then use this same method from Repair Mode Command Prompt to delete the file when Windows cannot protect it:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...","I think I was able to delete that errant folder.  However, I got the desktop error message that I originally got after the update showing up when entering the File Explorer.  Not sure if I'll get that until I reboot or not.","You may not be past the initial error yet. If not the fixes for it are here: https:\/\/www.wintips.org\/fix-windows-system32-co... Start from the top:","Alright.  Will try it, and either way, I'll let you know, sir."]},{"symptom":"Problem with Your Family asking me to update Windows 10        I'm receiving the following message on one of my children's names in Your Family in Windows 10:\"Update your child's Windows 10 device to get family features to work. \"We recently moved to a new computer. They had an account on the old one and I set them up on the new one too. I was getting this message when I logged on to check the Microsoft account. The old computer didn't update properly so I thought removing their account from the old computer would fix it. It hasn't.I've also tried removing their account from \"our family\" and that hasn't fixed it either.It still looks like the following.The new computer is fully updated.I have administrator access and my child's account is setup with her correct age.Anyone else have any ideas?","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you receive a message, \"Update your child's Windows 10 device to get family features to work.\" in Your Family page. I’ll help you with this issue. However, please let us know: Is the old computer listed under the Microsoft account for you child? It could be possible that the old account is still reflecting under your child account that is the reason you are receiving the error. I would suggest you to refer the steps mentioned below and make sure that the old computer is removed from the account: Login to https:\/\/login.live.com with the child account.Click on Devices.If you find the old computer listed there, click onShow details for the computer. Click on Manage, and select Remove PC.Now, click on I’m ready to remove this PC and selectRemove.  After removing the device, check if you receive the same error. Let us know how it goes. Regards,Nikhar KhareMicrosoft Community - Moderator","HiThe old computer is not listed under the child's account. I'd already removed it and it's definitely not there anymore.Kind regards","Hello there,I'm following this thread also because I have the same problem. The old PC isn't listed anymore but still I get warnings under the entrance of my son. The report are comming in though.Regards Hans","Is your son listed as a family member here?:  https:\/\/account.microsoft.com\/family\/","Yes, he is. It’s Daan.Hans","Hi, Thank you for replying. I apologize for the delayed response. I have been researching on this issue, and it seems that it could be a caching problem with the Family service. I would like to share few steps that might help. I would suggest you to remove the child account from the new device, then remove the new device from the Microsoft account, you can refer the steps mentioned in my earlier response. After removing the device from the Microsoft account, go back to the new device and add the Microsoft account. These steps should force a new probe of the device when the MSA is signed in on the new device.Let us know how it goes. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Microsoft mouse 3500 wireless how to install        How to install Microsoft mouse wireless mobile 3500?","solutions":["Hi Gerald, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Plug in the receiver to the computer and run the following Setup: https:\/\/go.microsoft.com\/fwlink\/?linkid=849754Also check in the following Product guide: https:\/\/www.microsoft.com\/accessories\/en-us\/pro...For the reference: Connecting a Microsoft Bluetooth:registered: device https:\/\/support.microsoft.com\/en-in\/help\/405228..."]},{"symptom":"MBR to UEFI conversion        When attempting to convert my 500 gb Western digital Black from Win 10 version 1909 MBR to UEFI using Microsoft's recommended procedure I keep getting, during validation attempts, the error message that the disk cannot be validated for conversion, and file size is 512 bytes.  MBR is on the disk, and Crystal Disk reports no disk problems. Any suggestions?","solutions":["Hi Dharman. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.What MS approved conversion process? The only absolutely stable method I know of to change from MBR to modern UEFI is to enable UEFI in the BIOS, boot the Windows installation media as as a UEFI device, wipe the drive of all partitions to reset the formatting, then click Next to let it auto-create and -format the needed partitions and reinstall. This invoke Windows Boot manager which must remain set to boot first.Any other conversions is going to be dodgy because you're pulling the table cloth out from under Thanksgiving dinner and then trying to replace it with moving or breaking any dishes.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.","In addition to the good explanation that Greg provided, I would like to add a technical distinction:The UEFI is akin to firmware while the MBR is a partitioning method. So you would compare the UEFI to the BIOS, and the MBR to the GPT. You wouldn't speak of converting MBR to UEFI.I said that the UEFI is akin to firmware, because it's not really firmware. The BIOS really is firmware, because it resides on a chip on the motherboard. But the UEFI is programmable software that sits between the computer’s hardware and the operating system.The only compelling reason to convert your hard drive from MBR to GPT is if you need to have more than 4 primary partitions on the drive. MBR is limited to 4 primary partitions. And then, since GPT can't be run from the BIOS, you would need to use the UEFI.The UEFI has many technical improvements over the BIOS, to be sure, but considering the uncertainty inherent in converting old hardware, there isn't really a good reason to attempt converting from BIOS to UEFI other than the satisfaction in pulling off a complicated maneuver.","Dear Greg,Thanks for your feedback. What you describe has been my understanding for some time, however, in a state of near exhaustion I read in Windows Central and on Microsoft Docs that there was a command line method of converting from Bios to UEFI sans data loss. There is no critical reason for me to convert at this time, but I plan to use UEFI in a future disk installation and so found this odd but interesting if it ideed worked. 'Plan to use a clean install on the future HD.","That's a good plan Dharman. Be sure to bookmark the Clean Install tutorial here: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... as it includes all the needed UEFI and other preparations and is a better install than any amount of money can buy.Let me know if there's anything else. Also when ready please mark the post which helped most as the Answer, to help others. A rating is also appreciated.","(I don't play in the silly ratings game here, so you can rate me like trash and we'll still be friends.  😉)"]},{"symptom":"Missing \"Connect\" App and \"Projecting to this PC\" function is missing        For some reason, my Windows 10 Pro on my laptop does not come with the \"Projecting to this PC\" features. On my other Windows 10 computer, I can find this features under \"Settings\/Projecting to this PC\" , but that settings is completely absented on my laptop.After some google, I found out that some people is missing this feature due to not having a folder name \"C:\\Windows\\SystemApps\\Microsoft.PPIProjection_cw5n1h2txyewys\". However, I checked my PC, and it does have that folder with all the files in there, so I really don't know why I don't have the \"Connect\" app.How can I get this feature back?","solutions":["Hi Max, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Did it appear before and was removed by a subsequent update? If the Wifi adapter supports Miracast likely you would see the option, if not the option would be absent.","Hi, thank you for your reply.I just found the solution for my problem.I follow the instruction in this link:https:\/\/community.spiceworks.com\/how_to\/163342-manual-install-microsoft-ppiprojection-when-its-missingNow the \"Connect\" apps and the \"Projecting to this PC\" show up.","Great, thank you for letting us know. Feel free to ask if there is something else :)"]}]}