{"windows":[{"symptom":"Impresión en negro        Mi impresora HP Ink Tank 315 no imprime en negro a pesar que el tanque de la tinta esta lleno","solutions":["Hola, Marlen. Mi nombre es Dante Martino, asesor de la Comunidad. No parece que sea un problema de Windows 10, sinó más bien de configuración de la impresora. Revisa las siguientes notas de soporte del fabricante:Especificaciones de la impresora HP Ink Tank 315 (Z4B04A) https:\/\/support.hp.com\/es-es\/document\/c05872466...Software y controladores para HP Ink Tank 315 https:\/\/support.hp.com\/uy-es\/drivers\/selfservic...También puedes contactar con un agente de soporte técnico desde esa página. O bien, descárgate la herramienta de diagnóstico:HP Print and Scan Doctor for Windows https:\/\/ftp.hp.com\/pub\/printers\/hppsdr\/HPPSdr.exe(nota: estos no son sitios web de Microsoft; ten cuidado con los anuncios o productos de estos sitios web, y accede bajo tu responsabilidad)"]},{"symptom":"Windows 10 transfer        I'm planning to upgrade the hardware for my pc and migrate from a SSD to a NVMe chip for my OS drive. Do I need to buy another key for windows 10 and to a freash install or can I just use my Acronis software to transfer the OS partition to the new hard drive?","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.You don't need a new license, the activation is tied to the mainboard - changing only the storage device will not cause a problem.Additionally if you use Acronis to image the drive over to your new one everything should just keep running fine. If you are leaving the SSD drive connected you may need to adjust your boot priority in the BIOS to make sure the NVMe is first.Regards, David","This depends on the license.  If Windows was preloaded on the old computer then it is OEM and tied to that motherboard.  If you purchased a license retail you have a key and some transfer rights.  you can transfer but you have to remove the license from the old computer.  The license is good for only one computer at a time.","I bought my licence retail. How would I remove the licence from the old computer? As I said earlier I want to just transfer my current OS to another hard drive when I upgrade my computer. I want to cover all the bases so I don't have to go and purchase another key.","Problem is that I was planning to replace everything but the video card and a couple of my secondary drives."]},{"symptom":"Print spooler not working. Jobs come out only upon Windows shutdown        a couple of days ago I began having problems with a networked printer when I attempt to use it from my primary Windows 10 machine.Jobs enter the print queue, but do not go the the printer. Upon shutdown of the subject Windows machine some of the jobs in the que will print. The same networked printer is usable from other Windows 10 and Mac machines and works correctly from all but my primary machine.To date I have ...Uninstalled\/reinstalled the printer in the Services\/Devices dialog.Tried several different print drivers, obtained from the manufacturerStopped the Spooler, cleared out all documents in the C;Windows\/System32\/Spool\/PRINTERS folder and restarted the Spooler.Run the Windows File Checker which found and repaired some corrupted files.Reinstalled Windows 10 in the 'repair' mode (ie. so my files and aps are not lost).The problem persists, and I am out of ideas. My next step is to wipe the hard drives and completely rebuild the system (I have backups of all my critical files).  I don't want to follow that path, if I can avoid it because of the amount of time required.Any ideas?","solutions":["Have you reinstalled the printer?","Yes, Uninstall\/Reinstall was in the list of things I've already tried.","You did that in the Services\/Devices dialog.Have you uninstalled the printer, unplugged it, used the software and instructions that came with the printer and reinstalled the printer.","You did that in the Services\/Devices dialog.Have you uninstalled the printer, unplugged it, used the software and instructions that came with the printer and reinstalled the printer.To me it seem like you have an issue with the printer spooler. Have you installed anything around the time your printer stopped working? Have you ran an antivirus and anti malware scan? Are there any errors in the event viewer related to the printer or spooler? you mentioned you uninstall the printer and software. Did you restarted it before doing the re-install? Maybe after the uninstall run you favourite registry cleaner.","Problem resolved, but not with any of the offered suggestions.  Seems something in a Windows update, earlier in the week, caused the problem.  Resolved by going back to an earlier restore point."]},{"symptom":"what is the fix for too much Blue Screen Of Death in windows 10        what is this?i am using windows 10 in dell laptop.i have seen at least 1 or 2 BSOD per day since when i bought this.i went to shop but that didn't helped.i have got all the types of bsod, i will list the codes of those that i remember1)PFQN list...etc2)non paging area. paging fault3)memory management4)and many like these.5)IRQL...etchow to fix this?i tried googling the fixes of each of them but after 1 week, the same type of bsod started to come.i am really frustrated and tired of windows 10 and thinking of using linux in this computer. but i have heard linux is too techy..please tell me what is the fix for this?","solutions":["Hi, in general blue screens are caused by incompatible or corrupt device drivers on your system . . .Open Windows File Explorer Navigate to C:\\Windows\\Minidump Copy any minidump files onto your Desktop, then zip those up Upload the zip file to the Cloud (OneDrive, DropBox . . . etc.), then choose to share those and get a share linkThen post the link here to the zip file, so we can take a look for you . . .","https:\/\/drive.google.com\/file\/d\/1znfVtO8-PIuaTsIF9o2twy1Ot7AxnohG\/view?usp=sharingthere is only one .dmp file. tell me if you need all files or which files?","Hello photos, I am Andrew a independent advisor. I'd like to help. I want to tackle the system errors noted first as they seem to be an issue. If you can please run these and let us know what happens. This should stop the blue screens.In the search bar, type cmd. Right-click on cmd.exe and select Run as Administrator. Type SFC \/scannow and press the Enter key. Re-enter Command Prompt as Administrator and run these: dism.exe \/online \/cleanup-image \/scanhealth dism.exe \/online \/cleanup-image \/restorehealth dism.exe \/online \/cleanup-image \/startcomponentcleanup Kind Regards, Andrew","even when i search cmd. i am getting nothing in windows 10...windows is make me frustrated","i have already posted the minidump file, but i am not getting any reply from you.why? do you want more information?"]},{"symptom":"USB stick not working on WIndows 10  -  Error 0x800701B1: A device which does not exist was specified        This usb stick from SanDisk seems to be working elsewhere but not on my laptop.  If I try using the USB ports with other devices the same happens.  The laptop recognizes the device but keeps on dropping the connection repeatedly.  I get the following:Error 0x800701B1: A device which does not exist was specified","solutions":["Hi Kostas My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.What is the exact make and model? Open Start, type: system information Hit Enter Click System summary Look in the right pane Copy the system sku info into reply here. See example: https:\/\/imgur.com\/qzektpAPress Windows key + X Click Device Manager Expand Universal Serial Bus controllers at the bottom Right click each entry then click uninstall Exit then restart Windows 10 will then redetect them. Check if they then work. Its possible you might need to update your BIOS and chipset drivers or connect to a slower USB 2.0 port to see if it works.","I tried all that you have mentioned and nothing.  The 2.0 port is the same.  Thank youOS Name Microsoft Windows 10 HomeVersion 10.0.18362 Build 18362Other OS Description Not AvailableOS Manufacturer Microsoft CorporationSystem Name KONSTANTINOSSystem Manufacturer ASUSTeK COMPUTER INC.System Model X551MASystem Type x64-based PCSystem SKU ASUS-NotebookSKUProcessor Intel(R) Celeron(R) CPU  N2840  @ 2.16GHz, 2159 Mhz, 2 Core(s), 2 Logical Processor(s)BIOS Version\/Date American Megatrends Inc. X551MA.513, 9\/9\/2014SMBIOS Version 2.8Embedded Controller Version 255.255BIOS Mode UEFIBaseBoard Manufacturer ASUSTeK COMPUTER INC.BaseBoard Product X551MABaseBoard Version 1.0Platform Role MobileSecure Boot State OnPCR7 Configuration Binding Not PossibleWindows Directory C:\\WINDOWSSystem Directory C:\\WINDOWS\\system32Boot Device \\Device\\HarddiskVolume1","I see some recommended updates for your make and model I recommend you apply.BIOS Update June 2019 https:\/\/dlcdnets.asus.com\/pub\/ASUS\/nb\/X551MA\/X5...See if the the BIOS update helps, if not, your best option is to rollback to the previous version you were running.Open Start > Settings > Update & security > Recovery > under Go back to my previous version of Windows 10, click Get started.or Press Control + Alt + Delete Click Sign out At the Sign In screen, hold down the shift key on your keyboard while clicking the Power button on the screenContinue to hold down the shift key while clicking Restart Continue to hold down the shift key until the Advanced Recovery Options menu appearsClick Troubleshoot Click Advanced options Click Go back to the previous version of Windows Windows Update might attempt to upgrade to Windows 10 1903 again. See instructions how to block it:https:\/\/www.groovypost.com\/howto\/block-windows-...Information in the above link is sourced from a trusted Microsoft MVP blog.","Hi Kostas My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.What is the exact make and model? Open Start, type: system information Hit Enter Click System summary Look in the right pane Copy the system sku info into reply here. See example: https:\/\/imgur.com\/qzektpA Press Windows key + X Click Device Manager Expand Universal Serial Bus controllers at the bottom Right click each entry then click uninstall Exit then restart Windows 10 will then redetect them. Check if they then work. Its possible you might need to update your BIOS and chipset drivers or connect to a slower USB 2.0 port to see if it works.System Model: HP Elitebook 8470pSystem Type: x64-based PCSystem SKU: A1G60AV","I have the same problem. The drive stays open just long enough to see that the folders and files are all still there, but not long enough to do anything with. I've tried uninstalling and reinstalling drivers and deleting all traces of the problem from the registry. I just want to recover my stuff","H6R39ES#ABV"]},{"symptom":"Windows 10 upgrade ( From 1709 to 1909 )        Hi,Working on upgrading Windows 10 1709 to 1909. Need to know on different methods or ways of Upgrading it and how SCCM CB 1910 can be used for up-gradation.Recently we have migrated Win7 to Windows 10 1709 by following traditional method (swapping of device).Please advice on different methodology and ways of upgrading Windows 10 from 1709 to 1909, Best Practice etcThanks & Regards,Balasubramanian.Murugesan","solutions":["Hi, Balasubramanian.Murugesan My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.If you have problems updating Windows, follow these steps: If you have a third-party antivirus, you must disable or uninstall it. Try reset Windows update components: Right click on the start button and select Powershell (admin) or Command Prompt (admin)Write the next hit enter after each line. net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Restart and try again. You can also download the Windows Error Solver: https:\/\/support.microsoft.com\/en-us\/help\/10164\/...https:\/\/aka.ms\/wudiag You can do it manually by downloading the Windows ISO. When updating with the ISO, disconnect the Internet. https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"screen and app activity daily details        I would like to see more screen time, and app activity timing details.  Not just total times, but what time of day and for how long for each time.  Is that detail available somewhere?","solutions":["Hi my name is Jay, I'm an independent advisor. I'd be happy to help with your inquiry.I regret to inform you that the functionality you are looking for is not yet available for Windows 10, you may send your feedback to Microsoft by following the steps on this link:https:\/\/support.microsoft.com\/en-ph\/help\/402156...You can also make use of Timeline to manage or view your activity history though it has limitations and not exactly what you are looking for.https:\/\/support.microsoft.com\/en-us\/help\/446822...I hope this helps, please feel free to ask questions and keep me on track. Thank you.Regards, Jay"]},{"symptom":"Left click opens drop down menu after upgrade to Windows 10        Hi, after upgrading from Windows 7 to Windows 10, whenever I left-click touchpad on anything (like inside a text or on a scroll bar), it pops open the drop-down menu (as if it was right click). Hitting ESC key closes this menu, but I have to do it every time. I saw other posts about this issue, but I have not seen any real solution.Right click opens the menu as it supposed to do, so the buttons are not switched. Reboot does not solve it.My laptop: Lenovo HODDTC9173 if it makes any difference.","solutions":["Defective mouse? Does the same happen with a different mouse too?","Hi Lazar_R, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Try to solve the problem by following the steps shared by the Windows MVP on your website, where this process is explained step by step.How to Change Mouse Primary Button to Left or Right in Windows 10 https:\/\/www.tenforums.com\/tutorials\/82696-chang...Complement the previous steps with those indicated in this article https:\/\/www.howtogeek.com\/428533\/mouse-left-cli...If the previous step did not work, start Windows with the error-proof process, through a clean boot, and reapply the steps from the previous link again.https:\/\/support.microsoft.com\/en-us\/help\/929135...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Cannot open email        I need to open an email that's important but I keep getting a box coming up that says 'The requested operation requires elevation'. Can anyone tell me what it means and what I can do to get rid of it so I can see the email as soon as possible?","solutions":["Hello GailGleeson, I'm Didi, an independent advisor. Can you please tell us with which software you are trying to open your email when you get this error box so we can help you better ?Regards, Didi","Hello Didi,          All I can tell you is that I have windows 10 and use Microsoft. It doesn't matter now as I have managed to get an app that allowed me to see the email okay. Thank you though for your reply.","Hi GailGleeson, I'm happy that your problem is now solved. Regards, Didi"]},{"symptom":"I cannot access files on my desktop        I cannot access files on my desktop wth the usual double click. I find that I can fiddle about and get access by right click and using the second \"open\" option, but this is a real pain in the butt. I believe this to have been caused by an update.I also had great difficulty opening Excel files, but after spending many hours, I managed to fix this myself.I seem to spend half my life fixing **** on computers. Please tell me how to get my desktop files back to where they wereTHERE ARE NO SECTIONS OPEN IN THIS NOTEBOOK OR SECTION GROUP. (this is what I get when I left click on a file)ThanksGlen.","solutions":["How about if you click on it and then press enter, will that work?Try restart your PC.Check for Update.Open start and search for Feedback Hub and open it and report this issue.","Hi GlenCrighton, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.See the configuration shared by the Windows MVP on your website. https:\/\/www.tenforums.com\/tutorials\/40271-open-...If the previous step did not work, start Windows with the error-proof process, through a clean boot, in addition to this process by scanning your computer (Link 2), with this we seek to detect and correct corrupt files that interfere with Windows processes.1.- How to perform a clean boot in Windows https:\/\/support.microsoft.com\/en-us\/help\/929135...2.- Use the System File Checker tool to repair missing or corrupted system files https:\/\/support.microsoft.com\/en-us\/help\/929833...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","no go joe"]},{"symptom":"BSOD Windows 10        Hello -I have been battling a BSOD originating from a Kernel Security Check error that forces restart over and over.I installed Easy Driver and updated all of my drivers.Here is a link to my DMP file, CBS.log and msinfo32.nfo files https:\/\/1drv.ms\/u\/s!AqmkBdwwSYhohG0RhuNspLRhytdd?e=9wy2HXI also used a tool called WhoCrashed and these are the two errors I received:Crash dump directories: C:\\WINDOWSC:\\WINDOWS\\MinidumpOn Thu 1\/9\/2020 9:53:06 PM your computer crashed or a problem was reportedcrash dump file: C:\\WINDOWS\\MEMORY.DMPThis was probably caused by the following module: win32kfull.sys (win32kfull!HandlePTPTelemetry+0x16B5)Bugcheck code: 0x139 (0x2, 0xFFFF8806DBF9AD70, 0xFFFF8806DBF9ACC8, 0x0)Error: KERNEL_SECURITY_CHECK_FAILUREfile path: C:\\WINDOWS\\system32\\win32kfull.sysproduct: Microsoft® Windows® Operating Systemcompany: Microsoft Corporationdescription: Full\/Desktop Win32k Kernel DriverBug check description: The kernel has detected the corruption of a critical data structure.The crash took place in a Microsoft module. Your system configuration may be incorrect. Possibly this problem is caused by another driver on your system that cannot be identified at this time.  The second error (now gone from the log for some reason) was related to ntoskrnl.exeAny help is greatly appreciated!","solutions":["Any 3rd party anti virus, security, cleanup programs ever installed on the computer","Hi Anthony, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.The crash was caused by Memory corruption, might be a 3rd party driver. The next step, Let us try finding any misbehaving driver Enable Driver Verifier: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...(Must create a Restore point before) Upload the newer dumps when you get Driver_Verifier_detected_voilation. Please note that the system might crash before you reach the desktop-if it does please let us know so that we can guide you to disable Verifier.","No third party software installed before the issues started happening, although I think a free version of Avast was installed as one of the trouble-shooting tools recently.","Go to Avast and get their removal software and completely remove.   Programs and features does not get all of the code removed."]},{"symptom":"How do you change the main photo for People in the photos app?        So for a few of my tagged people in photos it automatically chose a really bad picture for them. I'd like to manually set a photo to display for each person's album but can't seem to find a setting to allow me to.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.Please refer to the following page and expand \"Add or Change a Contact's Photo\" to have the steps to modify contact images.https:\/\/support.microsoft.com\/en-in\/help\/14103\/...","Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.Please refer to the following page and expand \"Add or Change a Contact's Photo\" to have the steps to modify contact images.https:\/\/support.microsoft.com\/en-in\/help\/14103\/...","Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.Please refer to the following page and expand \"Add or Change a Contact's Photo\" to have the steps to modify contact images.https:\/\/support.microsoft.com\/en-in\/help\/14103\/...","I'm having the same issue. The photo showing for the person in the photos app is different than in the people app on their contact card. To make it worse, it's not even a photo of the right person in the photos app. How can we change the main picture in the \"People\" part of the photos app?","I have the same issue as above. The problem is, that I can't edit the tagged person in photo app in Win10. The photo in People app is the right one, but a random photo is selected in Photo app!Very annoying, since the only option in Photo app is to \"remove the name\" or to edit contact in People app. But there everything is ok and it doesn't change anything!","Hello Arif Ahmed,You do not answer to the asked question... It is about how to change the main photo of tagged people in the \"Photos\" app, not the \"People\" app.(and there does not seems to have sync between theses apps for the photo)If anyone has the answer I'm interested as well :)"]},{"symptom":"System image restore EFI & BIOS conflict        I created my system restore image on the computer I'm now using a Dell 1525. The original hard drive with this computer was 80 gig and I upgraded to a 180 gig. My BIOS recognized the 180 gig hard drive but Windows did not, therefore my computer was still slowI just installed a 1tb hard drive hoping that I could readjust the system to recognize the one terabyte hard drive to speed up my computer. Unfortunately using my original system image restore CDs the error I'm get says the image was created on a computer using EFI and this computer is using bios. I created these CDs on this computer so I don't know how to fix this error.","solutions":["Hi Diana. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.In UEFI Setup it must be set to UEFI enabled, CSM or Legacy BIOS disabled, Secure and Fast boot (if present) enabled. See here how to access Setup:http:\/\/www.isunshare.com\/windows-password\/four-... You need to boot the disks as UEFI devices to install to UEFI. As I have no idea what type of System image you have used I can't advise you specfics on it. Windows imaging is very limited and will restore to the same offset (position) on the drive, if it will even restore to a different sized drive. This is why all experts prefer free Macrium which is adaptable and easier to use, will adjust partition sizes smartly during the process.If it's factory recovery disks you created then those contain all of the bloatware which will always make WIndows slower and cause issues.If the image will restore the drive, then you can try to adjust the partition sizes using Disk management or a partition manager. If you want me to advise you then post a screenshot of Disk Management, which I read like a doctor reads X-rays. Follow the steps here so I can see everything we need to advise you: http:\/\/answers.microsoft.com\/en-us\/windows\/foru... I'm not sure why you think a larger drive will be faster. Everything in Windows 10 depends on the quality of the install whether it's captured as a System Image or preferably done as a fresh new Clean Install following the illustrated steps in this link which include everything that works best in Windows 10: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... So unless the image is corrupted or doesn't install well, it should be adjustable to run better if that's necessary.Personally I would invest in the Clean Install above since it's one of life's great learning experiences that will permanently make you the master of your PC because you will learn everything that works best and how to keep it that way. It is a better install than any amount of money could buy. I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Able to make windows accept my 1 TB HD. Problem is I don't know how to \"merge\" C: with E:. Installed 3rd party software to help. Also notice disk 1 is MBR. Shouldn't it be GSR FOR WINDOWS 10? Here's pic. Thanks for your help!!","Sorry meant GTP not GSR LOL!","Diana - You have one disk there with C on a tiny partition beside E which is outsize and huge.  You also have an MBR install so if this is the modern UEFI BIOS I would strongly consider reinstalling to UEFI so you have all of the modern safety features of the new BIOS.  But you can wait if you want. Did you want a separate data partition? This is a popular configuration so that storage and even the User folders can be moved off of C, to keep the image smaller. This way if Windows ever becomes irreparable you can restore C in 20 minutes from recovery media using the stored image, and your files will be current and safe in their own separate partition. If they are left on C they will be dated from when the image was taken.Obviously your C drive is way too small but that can be adjusted by using a tool like free Partition Wizard's Extend feature which will let you redistribute space between the partitions. See tutorial here:http:\/\/partitionwizard.com\/video-help\/extend_pa...This saves having to manually do it by Resizing E from the left using a Partition manager, then extending C into the space using Disk Mgmt.The best free imaging app for saving the backup image externally is here: https:\/\/www.howtogeek.com\/howto\/7363\/macrium-re...To move User folders off of C see here: http:\/\/www.dummies.com\/computers\/operating-syst...If you do have a UEFI BIOS then Look over the steps for a gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy:   Clean Install Windows 10.   Remember to boot the media, delete all partitions during install to get it cleanest and convert to GPT, then click Next to let it auto-create and -format to begin the install - this makes it foolproof. Feel free to ask back any questions and keep me posted on your progress."]},{"symptom":"how to download Office 2019 home which I purchased and delete Office 2010        I bought MS Office 2019 but can't get it to download on Win 10 in order to replace Office 2010","solutions":["Hello! I am an Independent Advisor, I would love to help you out! Go to office.com and then make sure that you are signed into the account you purchased office with.There should be an \"install office\" near the top right corner of the screen."]},{"symptom":"Cortona        Hi,Is Cortona able to be used by a person aged 14?I tried but it says minor.But when switched my brithday so that I am 19.It worked.So are minors allowed to use it if over 13?","solutions":["Hello Shawn, I'm Didi, an independent advisor. You can use Cortana if you are 14 as it is possible for people aged 13 and older.Did your parents or your tutor set up Family Protection on your computer ? If that's the case the error could be caused by the age they gave you when they set up the protection.If that's not the case make sure your date of birth in your Microsoft account is correct:https:\/\/account.microsoft.com\/profile\/Regards, Didi","No family protection. It's my own pc and there is no family option.Yes, the birthdate on my profile shows that I am 14.Do you mean anyone 13 or older can sign in to cortona? It says minors aren't allowed to use their account here?Do I have to be a adult?I am living in Canada, would that casuse anything>","Hi Shawn, Are you running the Windows Insider Preview build ? If that's the case you should see it written on your desktop in the lower right corner of your screen above the time.Regards, Didi","No I am using the regular stable version of windows.","Hi Shawn, If you modify the age of your Microsoft account and you set it, for example, at 30 years old, does the problem persist ?In the meantime until your Microsoft account gets fixed you can switch from a Microsoft Account to a Local Account following this guide :https:\/\/www.zdnet.com\/article\/windows-10-tip-sw... If the previous guide didn't work create a new Local Administrative Account to sign into and move your files over following this guide :http:\/\/www.howtogeek.com\/226540\/how-to-create-a... After that you can delete the old Account in Settings > Accounts > Family and Other Users following this guide :https:\/\/www.howtogeek.com\/227763\/how-to-complet... You could also try to switch to another Microsoft account that you create specifically to solve your problem :https:\/\/www.tenforums.com\/tutorials\/5375-switch... Regards, Didi ---------------- Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I changed it to say I am 19 then it works.But should it allow me to use it as 13?","Hi Shawn, Yes, if you are 13 or older you should be able to use Cortana. Regards, Didi"]},{"symptom":"Windows 10 fails to update -- yet says it is up to date        My Windows 10 is saying it is up to date yet it tells me it is still on version 1803. When I check update history, it says \"1809 require a restart to finish installing\" yet doesn't install on restart. 1903 failed to install (probably because I haven't been able to upgrade it to 1809 yet. Not sure what is going on...also, perhaps unrelated but I am unable to see any bios prompts on restart now as well, this has been happening for a while. Sometimes my computer gets hung up in restart as well and i have to cold reboot it. Is there any way to get these updates to install, especially without having these restart issues? When I go to \"check for updates\" it tell me I am up to date...","solutions":["HI Nicole. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I would manually upgrade to the latest version 1909 by opening the Media Creation Tool from this link:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m..., choose Download Tool Now, then open the tool and choose Upgrade This PC Now. This saves your files, apps and most settings in place, is the most stable method to change versions, brings your Updates current, resolves most problems. If any problems report back the verbatim error and number, then continue with these steps for overcoming Version Upgrade problems:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If the Version has problems I will work with you to try to resolve them. If the problems are unfixable for now, you have ten days to roll it back in Recovery settings. You can then hide it so it doesn't try to reinstall following this same method:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... Most problems are resolved by doing this gold standard Clean Install which should get you past all difficulties as it has millions of others who have followed the steps in this link and never come back to report another problem:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... . So read it over and see if its something you want to learn to do.If after Upgrade you still have the BIOS problem reset the BIOS to defaults after taking note of your settings for UEFI, CSM, Legacy BIOS, Secure and Fast Boot and Boot Priority Order. See how here:https:\/\/www.groovypost.com\/howto\/reset-pc-bios-...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to rate my post, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Greg,Thanks for the response. I tried the first option in this list and I got an error:0xC1900101 - 0x2000DThe installation failed in the SAFE_OS phase with an error during the MIGRATE_DATA operationI am a bit nervous to do too much restarting of my computer with OS installation because my monitors do not become responsive until the log-in screen. I do not see any ASUS window or any screens with any quick keys (like F8 to start safe mode for example) at all. My monitors only become responsive at the log in screen after the computer has started up completely, where I put my password in to get into Windows.Can I get some advice on this? ","Is this a laptop? If so view the BIOS mode on laptop screen. If bot the BIOS or Repair Mode should show on primary monitor ot there is no way to repair from boot or reinstall Windows.","This is a desktop with an ASUS mobo. During start-up, my monitors are unresponsive until the Windows log-in screen. Do you know why this is happening? I need to get this resolved. ","Hi Nicole - Did the BIOS ever display on the monitor? What about when there is only one monitor?1) Try resetting the BIOS\/UEFI firmware to default in Setup: https:\/\/www.groovypost.com\/howto\/reset-pc-bios-...http:\/\/www.isunshare.com\/windows-password\/four-...First take note of the settings for UEFI (should be enabled), CSM or Legacy BIOS (should be disabled), Secure and Fast Boot, and Boot Priority Order.2) Update the Display driver from the PC or Display adapter maker's Support Downloads web page for your exact model number, HP Serial Number or Dell Service Tag - from the sticker on the PC.While there check also for newer chipset, BIOS\/UEFI firmware (very important), network, sound, USB3 and other drivers, comparing to the ones presently installed in Device Manager reached by right clicking the Start Menu.If this doesn't give you the latest or ideal driver for what you need, compare it to the driver offered by the Intel driver update Utility here:http:\/\/www.intel.com\/content\/www\/us\/en\/support\/... or the Nvidia Update utility here: http:\/\/www.nvidia.com\/Download\/Scan.aspx?lang=e... or the AMD autodect utility here: http:\/\/support.amd.com\/us\/gpudownload\/windows\/P... For Display issues one fix that is working is to Roll back or Uninstall the Driver on the Display Device > Driver tab, restart PC to reinstall driver.You can also try older drivers in Device Manager > Display device > Driver tab > Update Driver > Browse > Let Me Pick.Then you will know you've tried everything in addition to Windows Update drivers.Adjust the screen resolution until it fits and looks best at Settings > System > Display.3) Is the Motherboard within a year of purchase, so you can get Asus Support on it?"]},{"symptom":"Windows Defender Browser Protection        Hello...Windows  Defender Browser Protection gives this error since google update that changed how adblockers work.","solutions":[]},{"symptom":"Problems updating to windows 10        When updating to windows 10 the computer bogs down and screen flashes on and off repeatedly.  Nothing can be done on the computer to stop it.  Restarting the computer results in the same problem.","solutions":["Hi, Tracywoody789 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Desktop Text is not Responding to DPI Scaling Adjustments on Surface Pro 2017        This started when I plugged in my Surface Pro 2017 this morning. I didn't have this problem yesterday.My desktop, and menu bar font is not responding to DPI scaling adjustments and remains at seemingly the smallest setting possible.The icon size on the desktop, window size, and text in the settings app is responding correctly.Has anyone else seen this? or found a fix?I'm running Wind****d 18363.535 which was installed on 12\/5\/2019.The problem remains whether I'm plugged into multiple monitors or natively on my surface desktop.Things I have tried:Restarting my computerChecking for windows updates (none available)Adjusting the resolution and dpi scaling on my monitor (no change)Adjusting the font size in ease of access display settings (no change)Setting a custom scaling factor (no change)The picture is of my settings app (which shows the correct scaling) on top of a windows explorer window (which is not updating properly).The only update my computer has had in the last 24 hours is a windows defender definitions update.Any assistance or recommendations on this would be greatly appreciated.Thank you,","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues with font size when using DPI scaling on your PC. For further clarity on the issue, I would like to know that if the issue occurs on any other Windows application. If you are facing this issue only on File Explorer then, I would suggest you to run the Windows File and Folder troubleshooter and see if that helps. Refer the articleAutomatically diagnose and repair Windows file and folder problems Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator","Hi Prakhar,This issue also applies to the text size on the desktop, right click context menus, and some control panel items (like device manager and add\/remove programs)I ran the troubleshooter but this did not resolve the issue.Please note that this only happens on my user account, not on the other accounts on my computer.Thank you for your assistance!"]},{"symptom":"VirTool:Win32\/DefenderTamperingRestore was removed on my system Running Windows 10  still slow to open has high hd useage  never sleeps  **** do i do now        super slow already remved thisVirTool:Win32\/DefenderTamperingRestore","solutions":["Hi SteveMaturo and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.1. Check if you have installed multiple antiviruses on your PC. Disable the other and remain one antivirus only.2. Run SFC & DISM. You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]}]}