{"windows":[{"symptom":"how can i hide virtual cd icon        there is no driver in device manager for this cd room my lenovo laptop does n't come with but in cd driver it usb and this comes with windows installation how to remove it ","solutions":["Hi sinfulslave and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Hi sinfulslave, If the above methods did not work, try the following steps below. 1. Open \"File Explorer\" 2. Right-click \"This PC\" then click on \"Manage\". 3. Click \"Disk Management\". 4. Right-click \"CD-ROM 0\" then click \"Change drive letter and paths\". 5. Click \"Remove\" and click OK. 6. Restart PC. I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","neither of above solutions worked not found in disk management"]},{"symptom":"Windows 10 install bsod when reaching network tab        I recently downloaded the Microsoft media installer and started to download Windows 10 to install it as I was running Windows 7 and support for this discontinues on the 14th.I get to the screen where cortana start speaking to me and I choose my keyboard preferences and local area time.When I get to the point where I skip secondary keyboard layout settings It highlights 3rd tab across the top which is the network tab at which point the \"just a moment\" loader freezes then after several seconds I get a blue screen of death and I'm stuck in this continuous loop and I cannot get out of it. I've tried plugging in my laptop to a wired network connection hoping to bypass whatever error this is but I cannot get past this. I have reinstalled Windows twice now by entering the Microsoft recovery settings and reinstalling but this has been ineffective.Essentially Windows 10 has bricked my PC.How can i fix this?","solutions":[]},{"symptom":"Internet Explorer broken in Windows 8.1 on surface 2        when I try to use explorer I get this message \"a certificate was explicitly revoked by it\"s issuer\" and now I can't get into any web sites.[Original subject: windows 8.1 problem on surface 2]","solutions":["This bug was introduced with Windows Update KB4516067 and squashed by update KB4516041 a couple of days ago.","Je veux avoir plat stor","window 8.1 not activated"]},{"symptom":"How to install firmware in order to update windows        In order to update my windows, which is seemingly affecting me from other functions, I am being told to \"continue installing firmware.\" I am not sure where to go in order to do this. someone help. please :(","solutions":["Hi llyyyh What is the Make and exact Model no. of your PC - that will be printed on a sticker on the bottom casing . . .Please provide a screenshot of that error message you are seeing to provide a bit more context . . .","This keeps popping up when I try to update windows. I continuously try to restart and it does nothing.  I operate on the: Yoga 730-13IKB Laptop (ideapad) ","Hi llyyyh The latest BIOS update for your system can be found on this link to the support page for your laptop . . .https:\/\/pcsupport.lenovo.com\/ie\/en\/products\/lap...Also you may also run the automatic scan that can be found on this page to ensure everything is up to date:https:\/\/pcsupport.lenovo.com\/ie\/en\/products\/lap...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","didn't work but thanks anyways dave :("]},{"symptom":"windows update error  (0x80240fff)        try everything from troubleshoot , cmd code from net stop to powershell , recovery too still same error occur.","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command promptDISM \/Online \/Cleanup-Image \/RestoreHealthRun these commands on the command prompt to restart windows update servicesnet stop bitsnet stop cryptsvcnet stop wuauservnet stop msiserverRen C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.old net start bitsnet start cryptsvcnet start wuauservnet start msiserverAfter successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartThis should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)"]},{"symptom":"The Windows 10 \"Photos\" App is really slow.        I just got a fresh new Windows 10 PC lately and I've started transferring my files in it. Some of them are photos that I backup just in case. Sometimes when I upload a photoI tend to have multiple shots. I view them one by one, and if I find the best one I keep itand delete the others. Now my problem is, when I attempt to open one of these images,the new \"Photos\" app starts up. Nothing wrong with that except for one thing: IT IS BLOODY SLOW. The window opens immediately, but it shows me a black screen.I have to wait for 1 to 2 minutes just for it to show me the image. The \"Photo Viewer\" app that was on previous Windows versions start up immediately.I wonder if it can be fixed (maybe through an update) or have the old \"Photo Viewer\" apprun as default (if I can get it).","solutions":["Hi, Thank you for writing to Microsoft Community Forums We understand your concern as the Photo app is responding slow, while accessing the photos from the backup location. In order to get clarity and to assist you accordingly, please reply with the answers to the questions below.Where are these pictures saved\/backed up?Do you face the lag issue when accessing pictures that are saved on desktop\/Pictures folder in C drive? Try copying few pictures randomly on the desktop folder and access them using the Photo app. If you still face the same issue, then reset Photos app and check.Press Windows + I key to launchWindows settings.Click on Apps and selectApps & feature from the left pane.Scroll down and select Photos App on the right pane.Click on Advanced option and then click onReset.Restart the PC and check. We appreciate your interest on Photo Viewer app, this could be a valuable suggestion as there may be other users with a similar requirement. Hence, I suggest you to leave aFeedback for this product so that our developer team can look into this and check if it can be implemented in the future updates. Let us know how it goes. Aditya RoyMicrosoft Community – Moderator","Hi,Thank you for writing to Microsoft Community ForumsWe understand your concern as the Photo app is responding slow, while accessing the photos from the backup location.In order to get clarity and to assist you accordingly, please reply with the answers to the questions below.Where are these pictures saved\/backed up?Do you face the lag issue when accessing pictures that are saved on desktop\/Pictures folder in C drive?Try copying few pictures randomly on the desktop folder and access them using the Photo app. If you still face the same issue, then reset Photos app and check.Press Windows + I key to launchWindows settings.Click on Apps and selectApps & feature from the left pane.Scroll down and select Photos App on the right pane.Click on Advanced option and then click onReset.Restart the PC and check.We appreciate your interest on Photo Viewer app, this could be a valuable suggestion as there may be other users with a similar requirement. Hence, I suggest you to leave aFeedback for this product so that our developer team can look into this and check if it can be implemented in the future updates.Let us know how it goes.Aditya RoyMicrosoft Community – ModeratorThanks for the responseI tried what you said. The problem is still there, the app window opens, a black screen, and after a long time will it display the image."]},{"symptom":"downloading        can't download on my phone windows 8.1","solutions":["Ask in the correct Windows Mobile Devices forums:https:\/\/answers.microsoft.com\/en-us\/mobiledevices\/forum?sort=LastReplyDate&dir=Desc&tab=All&status=all&mod=&modAge=&advFil=&postedAfter=&postedBefore=&threadType=All&isFilterExpanded=false&page=1","Store problem email sing not working","Store problem email sing not working Start your own thread giving all details of your problem., instead of adding your problem to someone else'sThese are not chat rooms."]},{"symptom":"How to install Windows 8.1 from a bootable USB on another computer without a product key?        the other computer has no OS or data on any drives","solutions":["the other computer has no OS or data on any drives You need a Windows 8.1 product key to use the Windows 8.1 operating system correctly."]},{"symptom":"My Atari Risk II and Law & Order: Dead on the Money won't run in windows 10        Hello all.I'm struggling to get my Atari Risk II disk and Law & Order: Dead on the Money to work on Windows 10.  They worked fine on Windows 7 but when I upgraded - they stopped working.I've tried the compatibility wizard - while it works for other programs - not so much for these two.  They both install but when I click on them I get the \"User Account Control\" window, I click \"yes\", and then zip.  Nothing happens.I have yet to find a solution for Law & Order: Dead on the Money.  I have found solutions for Atari Risk II but they don't work either - see link below:Possible Risk II solutionAnyone have any ideas?  Very frustrated with this.  Thanks!","solutions":["Hi Cutepanda, Most likely, these games needs a little tweaking. Please check this article: https:\/\/answers.microsoft.com\/en-us\/windows\/for...Under \"JRsPCService's reply\" This might work on your end as well. Please let us know if it will. Thanks and regards,","My Direct Play is turned on.My game doesn't install in a Microprose folder - it actually installs in an Atari folder.  Inside of that folder is a folder labeled \"Risk II\".  Instead of changing the owner to Administrator should I change to my user account?Thanks!","My Direct Play is turned on.My game doesn't install in a Microprose folder - it actually installs in an Atari folder.  Inside of that folder is a folder labeled \"Risk II\".  Instead of changing the owner to Administrator should I change to my user account?Thanks!Nothing happened - despite the change.","Good News on Law & Order - I had to make a DEP exception for the Macromedia portion of the program.  The game is playing sound but no video.  Closer than I was.As for Risk II, I tried contacting Atari but have not had any luck hearing back from them.","- Is Direct Play enabled ?( Programs and Features > Turn Windows Features On or Off -  Tic box next to Legacy Components & Direct Play  )\"As for Risk II...\"- The main problem with the disc version of Risk 2 is outlined in my post in the thread linked above, regardless of the OP'srefusal to accept the reality.I have more details regarding DRM blocking, and a few other issues with copy protection systems in my post at  ---this thread ---Unfortunately the data bases I used to consult to find which copy protection system a  game uses have been taken down,so I don't know which one Law & Order uses, but from what I can find, it may not have any copy protection.- If permissions have anything to do with your games not running, a better fix than messing with ownership would be not toinstall them in the default Program Files (x86) folder. Installing games in the default loaction can cause permissions issues with some games now and then because the threeProgram folders are system protected.Installing these games in a new folder in C:\\, or better, in another Partition or HDD\\SDD can help.","Direct Play is engaged.  I'll try your suggestion with installing in a different location for Risk.  I've got a guy at Legacy Games trying to help with Law & Order but you're idea about installing in a different spot may help with that as well.Atari has refused to help - said they no longer support the game.So since I have Windows 10 - if relocating the install doesn't work - I should try the NoCD patch?","Ok so I relocated the install outside of the Program Files (x86) folder - did not help.I then tried the separate NoCD fixes from the website you suggested (not the one in German) - no help.On the disk, the file secdrv.sys doesn't exist - so that option isn't available.Since I upgraded from Windows 7 to Windows 10 on the same machine - I checked to see if the update KB3086255 still existed - it doesn't.  I have no idea what to do at this point.  ","I just downloaded the Risk2 noCD and see in the text file that comes with the first one that you still need to use a 'backup' CDto run the game. I've never come across this before, and have never tried making backup CD's for my games,  which I always assumedcircumvented the CD check as well.However, the second fix should not require a backup CD to run the game, assuming your game is v1.01\"Since I upgraded from Windows 7 to Windows 10 on the same machine - I checked to see if the update KB3086255 still existed - it doesn't. \"- That is correct, and I pointed out in my other post thatthe update only applies to Win7\\8\\8.1.DRM Blocking is built into Win10, so there is no way to remove or disable DRM Blocking in Win10. The only way to circumventitwith Win10 is to use a noCD fix.There may not be an secdrv.sys file that is readily accessible on the disc with Risk II, but I gave a specific Safedisk version in that otherthread, so I must have still had access to the data at that time.I believe a small number of games that use Safedisk tuck it away in a BIN file or other compressed folder.\"I relocated the install outside of the Program Files (x86)\"- By relocated, you uninstalled and reinstalled the game in the new location, yes ?- I don't have either game and don't know what issues they may have had in the past, but any fixes for other non-DRM issues thegames may have had with Win7 should also work with Win10. All you can do is trawl www in hopes of hitting on a fix thatworks for you. [EDIT: - Ah ha!  I just found this Win7 compatibility issue fix on PCGaming Wiki....\"If you are experiencing difficulty launching the game, right click Risk 2's shortcut and choose Properties.Edit the Target section of the shortcut's properties to read the game path, which should already be there, and then add -noavi  at the end. With that done, you should now be able to see the menu upon launch and play the game. \" The same page also mentions SafeDisk  . Note that you may need a space before -noavi       ]Good Old Games and Steam aren't selling these titles either, but I see Steam was selling Risk II in 2009, so it looks like the gamewas not popular enough. There is not a lot of information about Risk 2 on the www though.https:\/\/www.giantbomb.com\/risk-ii\/3030-18399\/releases\/#toc-release-92064- It may not help in this instance, but...I'm not clear if you are logging into Windows using an Admin account, but if you are using a standard account you shouldlog in with an Admin account. This is more reliable than R\\clicking on the games shortcut and selecting the 'run as admin' option,and many games require the elevated permissions of an admin account.- Also turn UAC down to  Never Notify.  UAC is a great PITA, imo.I turned it off in 2010 when MS introduced it on WIn7.There is no point leaving UAC on just to be clicking onYes every time it pops up a warning, or messing around changing permissionstoget around UAC messages.btw - I'm not at all surprised the developer\\publisher didn't offer help with Law and Order. With the exception of long runningon line multi-player, games don't get support after the first year or two.","I'm guessing since the second NoCD fix didn't work, my game must not be Version 1.01.  I checked the CD case but it doesn't list the version.  I probably would need to check the readme file but like I said since the fix didn't work....\"I believe a small number of games that use Safedisk tuck it away in a BIN file or other compressed folder.\"I don't remember seeing a BIN file on the CD either.  I have \"Show Hidden Items\" enabled so I would think it would be there - if there was one.  I can double check.\"- By relocated, you uninstalled and reinstalled the game in the new location, yes ?\"Yes - Installed it right in the old C:\\, in its own folder, that I created.\"[EDIT: - Ah ha!  I just found this Win7 compatibility issue fix on PCGaming Wiki....\"I don't remember having to change the target when I installed it on Windows 7 (things went pretty smoothly on Windows 7, as I can remember, which is why this is so frustrating).  However, it can't hurt to try.\"Good Old Games and Steam aren't selling these titles either,\"My disk is dated 2003.  If I had the 2008 version, I'd probably not be having trouble.  Oi.\"- It may not help in this instance, but...\"My laptop has only ever had one profile and that's mine so I would say that I should be the admin.  However, I'll double check.  That being said - I did notice that under the \"Security\" tab, everything is checked except \"Special Permissions\".  Could this be the issue?  Would the UAC be blocking access?Atari won't help with Risk - but I figured it was worth a shot - as you said since it's not a long running series then they won't bother.Legacy Games has offered to help with Law & Order.  I'm working with a guy to see what we can get to shake loose.  So far I've managed to get the game to launch but the display isn't working.  I know it's running but I can't actually see the game on the screen (just a black screen, until I hit \"Alt-Tab\", which shows the game menu, in the preview).","Just spoke with the guy who was helping with Law & Order - He's run out of ideas.  Looks like we're dead in the water on that one."]},{"symptom":"Windows 10 Pro Insider Preview Digital Key        I just purchased a Surface Pro X which came with Windows 10 Home. I have a Surface Laptop and a Surface Pro that has Windows 10 Pro Insider Preview, which was purchased via a digital key. The new tablet did not automatically update to Windows Pro, how do I activate it on the new tablet?","solutions":["Hi Angie, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.You need to buy Windows 10 Pro for Surface Pro X as each purchase is limited to a single machine.Go to Settings>Update and security>Activation and select Upgrade your edition of Windows.https:\/\/www.tenforums.com\/tutorials\/13986-upgra...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads.","Thank you for the quick response. I'm a little confused because I was able to use the digital key on my previous 2 machines.","Hi Angie, They might have come with Windows 10 Pro or Pro inherited from a pervious Windows license."]},{"symptom":"Operation is in progress message always pop up        Please advice me how to fix this error. Always pop up \"Operation is in progress\" in windows server 2012 R2. When I click OK button it closed but a few second later this message occur again. Open task manager and I found that this message is under wininit (32bit) shown as below picture. Please someone support me.","solutions":["Hi Moe Thet Community is just a consumer forum, due to the scope of your question (Server 2012) can you please post this question to our sister forum on TechNet in the Server 2012 section (linked below)Over there you will have access to a host of Server 2012 experts and will get a knowledgeable and quick answer to this question . ..https:\/\/social.technet.microsoft.com\/Forums\/en-..."]},{"symptom":"WINDOWS DEFENDER\/ANTI VIRUS PROTECTION        Do i need private virus protection if have Windows defender and real time protection on? When i attempt to turn Windows defender on it says \"TO ALLOW THIS APP TO RUN CONTACT YOUR SECURITY ADMINISTRATOR TO ENABLE THE PROGRAM VIA GROUP POLICY\"....What does that mean? Does anyone know how to do this? Could it be because i have McAfee Virus protection installed & running right now? McAfee is expiring in a few days & i really can't afford it this month & don't want to go without any protection so need the defender. ","solutions":["Hi Courtney,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Yes, Windows Defender protection disables itself if another AV is up and running. This is to provide you a good experience.Uninstall Mcafee and restart the computer. Windows Defender should automatically enable real-time protection.Over the years Windows Security suite has evolved greatly so there isn't a need of a 3rd party AV.Hope that helps.","Yes it could be because you have McAfee installed.  Go to McAfee and get their removal software and completely remove all traces.All you need is Windows Defender and Malwarebytes.","Do i need private virus protection if have Windows defender and real time protection on? When i attempt to turn Windows defender on it says \"TO ALLOW THIS APP TO RUN CONTACT YOUR SECURITY ADMINISTRATOR TO ENABLE THE PROGRAM VIA GROUP POLICY\"....What does that mean? Does anyone know how to do this?Could it be because i have McAfee Virus protection installed & running right now? McAfee is expiring in a few days & i really can't afford it this month & don't want to go without any protection so need the defender. Hello,Completely uninstall McAfee and see if this resolves the issue.Regards.","Uninstall McAfee. Use the specifc removal tool and reboot.Please see: McAfee KB - How to remove McAfee products from a PC running Windows (TS101331) McAfee Removal Tool - McAfee Uninstaller And then read: Supplementing your Anti-Virus Program with Anti-Malware Tools"]},{"symptom":"how to fix @ typing as \"        how to fix @ typing as \"","solutions":["Hi Pyrogenes This is caused by a Windows 10 update changing your keyboard input language . .. Right click your Start Button, choose Powershell (admin) If the @ symbol on your keyboard is above the 2, you have a US English Keyboard Paste this commend into Powershell and hit Enter: $1 = New-WinUserLanguageList en-US If the \" symbol on your keyboard is above the 2, you have a UK English Keyboard Paste this commend into Powershell and hit Enter: $1 = New-WinUserLanguageList en-GB Then, Paste this commend into Powershell and hit Enter: Set-WinUserLanguageList $1 Close Powershell and restart your PC That's It!","Thanks Dave - I'm just about to try it!    P","Okay, please let me know how you get on . ..","Didn't need to try it!! Took a telephopne call, then my daughter came and said she would fix it - and she did! As I understand it, she went to Settings, then Languages, then chose English UK  - because somehow my laptop had slipped into English USA. And that worked.But thanks for your suggestion. I've filed it for possible future use in case of further problems and my daughter is not available to rescue me!So HAPPY NEW YEAR -P"]},{"symptom":"updating from win10 1703 to newer version of win10 do i loose files ?        if i updated my win10 from 1703 to newer version do i loose files  and apps ? ","solutions":["Hi Marwan,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Everything would be kept if you use the media creation tool. The fastest way to get the upgrade is through Media creation tool or ISO file.Please download Media Creation Tool from the link below and select Upgrade this PC at the first screen.https:\/\/go.microsoft.com\/fwlink\/?LinkId=691209All steps, including upgrading using ISO file and Media creation tool, are covered here:https:\/\/www.yourwindowsguide.com\/2019\/11\/update...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads."]},{"symptom":"bought a xbox code instead of a pc one        meant to buy a pc starter pack code but like the idiot i am i bought a xbox one, i do not own an xbox so i linked my microsoft account to my epic games account, after that i redemeed the code on microsoft and on their website it says that i own it but i still didnt get the skin,backbling etc.","solutions":["We don't work for Microsoft.We are mainly volunteers here.Due to privacy restrictions we have no access to your private details to be able to assist you here.I suggest that you contact the Microsoft Store:Returning items you bought from Microsoft for exchange or refundStore help - Microsoft SupportContact Sales and SupportAnswer DeskMicrosoft Store Answer Desk - Help the way you want itMicrosoft Account:https:\/\/www.microsoftstore.com\/store\/mseea\/en_US\/DisplayHelpAccountPage\/Microsoft Support:https:\/\/support.microsoft.com\/en-au\/contactus\/ -Microsoft store sales & support Billing help:https:\/\/commerce.microsoft.com\/PaymentHub\/Help\"Microsoft office locations around the world\"https:\/\/www.microsoft.com\/en-us\/worldwide.aspx\"Global Customer Service phone numbers\"https:\/\/support.microsoft.com\/en-au\/help\/13948\/global-customer-service-phone-numbers"]},{"symptom":"Buy Win XP (VOL or VLK)!        I want a WinXP VLK or VOL CD, where could i purchase one. Also i believe that a XP Case or Box does comewith a license. I am looking for a XP CD\/DVD with vol license. Do you think its possible to get it now.I have an old pc at least 5 PC that can run XP sp2 or 3 whichever.You can Message me if you want to help me. PS: One main reason is i don't need to have internet to activate my copy. So inserting a license during the install processwould be easier. Yeah!","solutions":["XP is no longer supported or sold by Microsoft.And none of Microsoft's distributors sells XP Volume Licenses.Volume Licenses are not for private use; they are used by large corporations.You are on your own and anything that that you buy relating to XP; the chances are that it is pirated.We can't help you.","Actually Microsoft only cares about making money , which it has done. Gates is the wealthiest man on earth.It is still continuing to do it. And i don't think it will change its policy for some random guy who asks for XP CD. If they don't support XP why not give it for free to people to use it.But it doesn't do that too. The current trend seems in favour of Win7, which i don't think is going to change for another 10-20 years. Microsoft deployed its WIn 10 too early. Just because they introduced it doesn't mean that people will buy it. I ain't buying Win10, for another 10-20, provided i'll live that long.","Support for Windows 7 stops next week, too.So 7 joins XP now.But the code is not free.","I don't give a rat **** about support and updates. Yeah! They come and go. Doesn't matter to me.They don't affect your reality or the Govt of the country.Technically. I m on a dual boot, Winxp and 7. So i know how it is to own XP.Also one thing u say codes are not free, well i didn't ask for freebies, i said i was looking for a XP VOL or VLK to install on a 5 different pc that supporst xp. And i am willing to buy, that is what i said.I suppose u r using Win 10, just being confused about the start button and all hebee jeebies, don't pretend u were not.","I don't give a rat **** about support and updates. Yeah! They come and go. Doesn't matter to me.They don't affect your reality or the Govt of the country.Technically. I m on a dual boot, Winxp and 7. So i know how it is to own XP.Also one thing u say codes are not free, well i didn't ask for freebies, i said i was looking for a XP VOL or VLK to install on a 5 different pc that supporst xp. And i am willing to buy, that is what i said.I suppose u r using Win 10, just being confused about the start button and all hebee jeebies, don't pretend u were not.I suggest you don't suppose anything about me.I still have all the old Windows operating systemsI have  had my own computing business for decades and am not confused by anything with them.And we don't work for  Microsoft.There are no legal XP product keys for sale.You can take your chances buying them; up to you.If you had bothered to read my first reply to you:And none of Microsoft's distributors sells XP Volume Licenses.Volume Licenses are not for private use; they are used by large corporations."]},{"symptom":"MS Support Phils        How do I contact Microsoft support in the Philippines? I need some of the settings in my PC checked but I'm not a techie.","solutions":["Hi sakiguzman The local phone No.s for Microsoft Support in the Philippines are: 180011102363 800 6427 6738 If you think there is something we can help you with here, please explain the difficulty you are encountering and we can try to help you . . ."]},{"symptom":"Tips App?        I have just recently upgraded to the Windows Insider Program (Latest release (Fast Ring)). After i downloaded and installed i wanted to know what was new, so i went looking for the Tips app but it didn't exist.Are Microsoft removing the app? Is there an alternative?","solutions":["Hi Jayden Click your Start Button, then, just type tips Does the Tips App not appear in the resulting list on your PC? If not, click your Start Button, type winver and hit Enter On the resulting dialog, what Version No. and build No. of Windows 10 are you running?"]},{"symptom":"magnifier        I'm just now learning to use the Win10 Magnifier.  I need the inverted option, but I find it inverts everything.  I use Excel a lot and highlight cells with various colors.  I need to keep colors true (red=red\/blue=blue, not red=teal\/blue=orange).  Is there any way to set the invert colors option to leave hghilight colors true?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Windows magnifier has a feature to invert colors for bright light environment. However, there is no such option to customize the inverted colors.","Thanks for replying, Arif.  Is there any chance a future version might keep true colors when invert is selected?","Well, there is no official announcement of this kind. However, you can share this Feedback using \"Feedback Hub\" app."]},{"symptom":"BitLocker        what to do","solutions":["Hi Les,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.May I know the exact issue?Are you trying to turn Bitlocker on or having trouble finding the key?"]}]}