{"windows":[{"symptom":"Windows Update        Keep getting this error message.  2019-12 Cumulative Update for Windows 10 Version 1903 for x64-based Systems (KB4530684) - Error 0x800f0900.  How can I fix this error?","solutions":["Hi Raymond. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything possible for fixing failed Windows Updates, so that at least something will work before you work through them all. Even if you've tried a step, please do it over in sequence:Some Updates will sort themselves out in a few days so I'd wait to see. If not or they are bothering you then here are steps you can take:1) Run the Windows Update Troubleshooter from Windows Settings > Update & Security > Troubleshoot.2) There is a new guided walk-through from Microsoft for repairing Windows Update that leads up to resetting components if necessary:https:\/\/support.microsoft.com\/en-us\/help\/10164\/.... Try running that first. 3) If that fails try manually resetting Windows Update Service: Open administrative Command Prompt and type following commands one-by-one followed by Enter key.net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Close Command Prompt and see if Windows Updates works then 4) You can also install the Updates manually that fail to install, which are logged at Settings > Update & Security > Windows Update > Installed Update History, and then search for those to download and install from this Catalog:http:\/\/test.catalog.update.microsoft.com\/v7\/sit... 5) If they continue to fail and interfere, then you can block them using one of these methods:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... 6) If problems with Updates have become chronic and especially if you have other performance problems, go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 7) If nothing else works then do a Repair Install, by installing Media Creation Tool, open installed Tool and choose to Upgrade the PC Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version 1909. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... _____________________ Good news! There are major changes in Version 1903 giving back control over Updates to the consumer. Microsoft has heard us at the highest level who announced this here:https:\/\/blogs.windows.com\/windowsexperience\/201..._____________________ I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Excel        When I open a excel spreadsheet, I get a red banner stating product activation failed.  This started after installing Windows 10. How do I activate?","solutions":["You need to go to the Office forum.","Hi J Open a blank document in Word, go to File - Account What Office licence(s) do you see reported there? What Microsoft Office licence do you have, is that the one-time purchase of Office 2016 or 2019, or do you pay a subscription to Office 2019?"]},{"symptom":"Critical driver is missing while booting usb drive        There was a problem with my laptop . I tried to install new window 8.1 through usb drive and an error 0xc00000098 was showing up saying critical driver is missing ... I tried many methods like repairing my windows etc but error occurs on booting usb thats why i cant repair the window.Someone can recommend me any helpful article .","solutions":["  This is the Windows 10 Insider Preview forum.  We are testing preview builds not yet released to the public.The forum for the public release of Windows 10 is below.http:\/\/answers.microsoft.com\/en_us\/windows\/forum\/windows_10This includes Windows previous to Windows 10 also, XP, 7, 8 ,8.1, etc.Windows 10 help is found here; https:\/\/support.microsoft.com\/en-us\/products\/windows?os=windows-10","Hi sherisid. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Use these same methods for troubleshooting Windows 10 install. If you are installing Windows 8.1 because you mistakenly think it must be reinstalled to upgrade to Windows 10 then this is not necessary. You can directly install Windows 10 and it will reactivate with the Digital License issued when you first Upgraded. If not and you only want Windows 8.1 then these same steps for troubleshooting install still apply:I will give you all possible steps to troubleshoot installation failure which work in about 90% of cases. If not we'll go from there:Follow the illustrated Clean Install steps in this tutorial which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Special steps for reinstalling Windows 8.1 are here: https:\/\/www.eightforums.com\/tutorials\/2299-clea...Pay close attention to Step 4 for how to reactivate as it's different than most. Make sure all other drives and peripherals are unplugged. Update the BIOS or UEFI firmware to latest, or reset to Defaults, making sure SATA controller is set to AHCI, UEFI is enabled, CSM or Legacy BIOS disabled, Windows Boot Manager set first to boot, if necessary disable Secure and Fast Boot until after install: https:\/\/www.mydigitallife.net\/comprehensive-lis... https:\/\/www.groovypost.com\/howto\/reset-pc-bios-...Create the latest new Windows 10 Installation Media by installing Media Creation Tool and following the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... If you're using another PC to do this then uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Windows 8.1 media creation tool is here: http:\/\/windows.microsoft.com\/en-us\/windows-8\/cr...Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first. If you can start Windows enter UEFI firmware here:http:\/\/www.isunshare.com\/windows-password\/four-... Choose the boot device as a UEFI device if offered, on first screen press Shift + F10 to open a Command Prompt, type the following commands, each followed by Enter key:DISKPART LIST DISK SEL DIS # (replace # with the disk # of the Windows disk from list in previous command)CLEAN EXIT Close Command Box, on second screen choose Install Now, then Custom Install, then at the drive selection screen choose Unallocated Space, click Next to let it create needed partitions and start install - this makes it foolproof.Make sure to follow the setup steps in the first link tutorial to complete your install. Drivers are important enough that those steps are printed in red.You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the first linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC. If all else fails you can move the hard drive to another PC to do the install with it plugged in alone. Windows 10 is remarkably adaptive to new hardware without needing adaptive restore. If it will start it will swap out all drivers requiring several restarts. You can also try applying a same-version System Image to the intact SSD\/hard drive.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Remove An Account form \"Accounts used by other apps\" and From Office Pro Plus        HiI have 2 unwanted accounts on my PC 1 is  on the list for my Office apps and the other is also on this list and in the \"Accounts used by other apps\" section on Emails & Accounts setting page. I have removed the credentials form Windows Credentials, but they just will not go away and there is just a Manage button on \"Accounts used by other apps\" page for the 2nd accountThanks","solutions":["Hi I STILL can't remove these account. PLEASE HELP!!!!!!!"]},{"symptom":"Win 10 Enhancements not visible in all views--- change playback speed in Windows Media Player        ONLY the \"NOW PLAYING\" view allows the answer given in other posts- \"Right click and select 'enhancements' then use slider.\"IN OTHER VIEWS THE ENHANCEMENTS ARE NOT AVAILABLE","solutions":["Hi Peter Yes, that is the way it has always been in Windows Media Player for some unknown reason . . .The only setting in the other main view is if you right click the Play button, you will have the option of Slow, Normal and Fast Playback . . ."]},{"symptom":"Win Erx03 tab                        In internet explorer I'm getting a Win Erx03 tab showing up and can't get rid of it. When I try to x out another tab shows up as a windows repair download and then another popup appears saying my windows is damaged , corrupt or outdated which I know is b.s.. Please help as it's a daisy chain I can't get out of or remove.","solutions":["Hi Randy. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Download, install and run a full scan with the most powerful on-demand free scanner Malwarebytes:https:\/\/www.malwarebytes.com\/mwb-download\/.In the Scan Settings first set it to include scanning for Rootkits. If necessary run it in Safe Mode with Networking, or Safe Mode accessed by one of these methods:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... Clean up anything found, restart PC and then run again until it comes up clean. Check for any remainders in Settings > Apps > Apps & Features, and also in each of your browser's Extensions, Home Page settings, Search service or Add-On's as shown here:https:\/\/community.box.com\/t5\/How-to-Guides-for-... Then check for damaged System Files: https:\/\/www.lifewire.com\/how-to-use-sfc-scannow... If it cannot repair them see Step 10 here to continue: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If the above doesn't help continue with the other steps for removing the malware here:https:\/\/malwaretips.com\/blogs\/remove-win-erx03\/If you want to keep Malwarebytes as an on-demand scanner then you can turn off its Real Time trial version in it's Settings > Account Details tab.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"A blue screen often pops up on my computer        A blue screen often pops up on my computer with a lot of letters. At first I thought that some kind of program wasn’t working. But now I think more and more that this is a Windows error. How to deal with this?","solutions":[]},{"symptom":"error        why do i see this","solutions":["The problem was solved?"]},{"symptom":"dvd        I just purchased the DVD player from Microsoft and my dvd still will not play and I would like a refund. It was through my paypal account","solutions":["Hi Debbie, I'm an Independent Advisor here to help you out, Unfortunately we don't have access to accounts\/store information here so you will need to follow the process described in this article to request a refund:https:\/\/support.microsoft.com\/en-us\/help\/10558\/... Hope this helps, Thanks, Nick","I would like a refund due to the fact that i can not use the service","Hi Debbie, Thanks for getting back to me, As I mentioned above we are independent advisors and don't have access to things involving refunds.You will need to click the link above and follow the steps there. Thanks, Nick","Hi Debbie, Thanks for getting back to me, As I mentioned above we are independent advisors and don't have access to things involving refunds.You will need to click the link above and follow the steps there. Thanks, Nick","Hi Debbie, Thanks for getting back to me, As I mentioned above we are independent advisors and don't have access to things involving refunds.You will need to click the link above and follow the steps there. Thanks, Nick"]},{"symptom":"Malfunctioning Key        Hello! I have been plagued with a problem key as of late. Since the most recent update I believe.Whenever I press the CTRL Key, It will pull up the Taskbar Search. My ALT key also does not function properly, pressing it will cause it to switch rapidly between options in photoshop as well as open up the Search. This has gotten in the way of many of my programs. Any suggestions?","solutions":["Defective keyboard? Try a different keyboard (or an external USB keyboard in case of a laptop).","Sound like you need to clean the keyboard with canned air or liquid contact cleaner.","Hi, Have you tried to use another keyboard? Looks like your keyboard is defective."]},{"symptom":"SteelSeries Merc Stealth Keyboard and Windows Update        I think after 10 years Steelseries has a right to change thier formula for keyboards but why oh why do Microsoft then have to break trust?Why is it that Microsoft have chosen to distrust the Alpham driver that has worked flawless with Windows for 10 years?Give us back our keyboards...... This will not force me buy a new keyboard.....   I paid for a software licence for my OS   I didnt pay for it in order for you to break my equipment.I know I'm not alone in my grievances.","solutions":["Hi. I'm sorry you're having problems. What exactly is wrong with your keyboard?","Hi. I'm sorry you're having problems. What exactly is wrong with your keyboard?Thats the point   NOTHING is wrong with my Keyboard Hardware.If you read I'm inquiring as to the reason the Alpham driver for the Merc Stealth keyboard has been distrusted by Microsoft after 10 years of flawless operation.As every update since Creators fall update breaks the trust for the Alpham driver forcing me in to having to remake  .cat  .sys .ini files to get it running again.  What reason is this driver now deemed as unsafe when it has been safe for the last 10 years?","I understand, I just was wondering if this was causing any issues with the functionality of your keyboard. Have you tried simply downloading the driver again from the manufacturer's website?","Yes i have tried reinstalling the driver direct from Steelseries website this now fails to install. I can install it fine on windows 7 and on windows 10 only if it does not have Creators update. It is only after i update my windows 10 to latest cumulative update breaks 'trust' with the Merc Stealth Alpham Driver.This is crazy    its a keyboard  why break it?Many other people with this keyboard also have enquired as to what has happened and if there are any work arounds but not many are asking why.cant be too hard to add the Alpham driver back since it was removed after 10 years for no reason.The issues the update causes is for Win10 to distrust the Alpham driver for the Merc Stealth keyboard. It breaks the functionality of the keyboard's custom keyset that sits on the left side of the board.  After messing with the original driver (changing the file name from Alpham to Merc) and disabling driver signing it reinstalls and works until you guessed it Windows updates again. I dont want to disable Windows update service and leave my PC without updates but at the same time i dont want to have to change a perfectly good keyboard for no apparent reason.","Hi, I hope this article will be helpful to you. https:\/\/answers.microsoft.com\/en-us\/windows\/for...Please let me know, if that helps. Kind Regards: Engr. Malik Yasir","Malik that actually doesn't work anymore.The Steelseries software allowed users to map any button on the keyboard, however, since fall creators, and previous updates. It no longer works properly.I have tried the above, and it breaks the functionality of the numpad, as well as mapping abilities.I finally had to give up and doing the above because of subsequent updates breaking the fix, and having to do it all over again. Forcing the driver to work by allowing untrusted drivers, will open the software but not mapping, and of course the numpad issues where they are not mapped correctly at all.I gotta side with Law Sayer on this one. This issue has been around now for over a year, and uninstalling and hiding updates is not a solution.","Malik that actually doesn't work anymore.The Steelseries software allowed users to map any button on the keyboard, however, since fall creators, and previous updates. It no longer works properly.I have tried the above, and it breaks the functionality of the numpad, as well as mapping abilities.I finally had to give up and doing the above because of subsequent updates breaking the fix, and having to do it all over again. Forcing the driver to work by allowing untrusted drivers, will open the software but not mapping, and of course the numpad issues where they are not mapped correctly at all.I gotta side with Law Sayer on this one. This issue has been around now for over a year, and uninstalling and hiding updates is not a solution. All MS need to do is retrust the Alpham driver that was never broken or malware in the first place.Spookyjones if you would like a copy of the driver files i altered for use (I have 100% functionality) they are unsigned but do work  or if you would like me to share with you the method to change Alpham driver yourself please let me know.Come on Microsoft  give us back our Keyboards.  They cant even say its age as i have  1994 keyboard that works just as it did when new.....flawless","Malik that actually doesn't work anymore.The Steelseries software allowed users to map any button on the keyboard, however, since fall creators, and previous updates. It no longer works properly.I have tried the above, and it breaks the functionality of the numpad, as well as mapping abilities.I finally had to give up and doing the above because of subsequent updates breaking the fix, and having to do it all over again. Forcing the driver to work by allowing untrusted drivers, will open the software but not mapping, and of course the numpad issues where they are not mapped correctly at all.I gotta side with Law Sayer on this one. This issue has been around now for over a year, and uninstalling and hiding updates is not a solution. All MS need to do is retrust the Alpham driver that was never broken or malware in the first place.Spookyjones if you would like a copy of the driver files i altered for use (I have 100% functionality) they are unsigned but do work  or if you would like me to share with you the method to change Alpham driver yourself please let me know.Come on Microsoft  give us back our Keyboards.  They cant even say its age as i have  1994 keyboard that works just as it did when new.....flawlessDoes anyone have working drivers or a work around since the June 2018 update? The old method of changing the file names and allowing untrusted drivers seems to get the icon turning green for me but I cannot use any of my mods. The zboard is stuck using the default settings only. Does anyone know how to get it working with custom mods? Thank you. ","I dont know about anyone else all I keep seeing is problems with the Windows 10?? I Have the merc stealth z board also.. with the red icon never going off... So I have to just use the keyboard as a regular keyboard none of the buttons on the left work anymore.. and cant open to set up skins or macros. IM USING Windows 7 64bit. anyone know how to make it work with Windows 7?? Or is it the same problem as windows 10??","\" if you would like a copy of the driver files i altered for use (I have 100% functionality) they are unsigned but do work  or if you would like me to share with you the method to change Alpham driver yourself please let me know.\"Currently Steelseries Merch Stealth is reduces to an oversized Keyboard. If you have a way to program the Keyboard, please share!Can a 3rd part App like AutoHotkey be used to program Macros?"]},{"symptom":"Can not get through to Microsoft Support?        I have been trying to get through to Microsoft Support for over a week. I get to where you can get Call Back, Schedule a Call or Message a Windows Adviser but when I click any of them screen goes back to Virtual Assistant. It is possible that something is preventing my PC from connecting?I know my account was hacked since I received an email stating password was changed and show was done in Romania.I have the Assure Program but does no good if you can not get through to Support.","solutions":["Hi Charles Have you tried logging into your Account to see if you can access that? These Emails are generally Phishing scams and your account has not been touched . . .If you can access your account, you should change the password on that account, just to be on the safe side . . .If you cannot access your account, you can contact Microsoft Support on this page, choose a local Phone No. . . .https:\/\/support.microsoft.com\/en-us\/help\/13948\/..."]},{"symptom":"Desktop icons not opening        Many of my Desktop icons including browsers, email accounts and bank sites will not open.  I took the computer to a Tech and he hooked it up and everything opened.  I brought the computer home and the icons won't open.  Frustration has set in.Can anybody help?Care","solutions":["Hi Care and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"System Image Back Up        How should I prepare my hard drive for a system image back up to DVD\/CD?","solutions":["Hi Ed The only preparation you would need to perform is to remove any junk from your PC prior to making the System image . .Run Disk Cleanup twice as indicated below: Open File Explorer Click on your hard drive On the Manage Tab, click Cleanup Let Disk Cleanup do its initial scan Select Everything in the list and choose Delete Start Disk Cleanup again Let Disk Cleanup do its initial scan This time in the resulting dialog, click 'Cleanup System Files' Let Disk Cleanup run another scan Select Everything in the list and choose Delete Then you can begin the process of creating the Disk Image Please Note: creating a Disk image on DVD's is possible, but honestly, not the best method, backing up to a small cheap external hard drive is much more reliable . . .The process will break up your hard drive content into 2GB blocks, if any of those blocks or DVD's are damaged in any way, the whole Disk Image will be worthless . . .","Hi DaveM121:Thank you.  I'll do as you suggest.Regards,Ed"]},{"symptom":"\"We can't activate Windows on this device right now.\"        I have recently reinstalled Windows because something had happened to the Windows folder earlier that was causing the computer to function improperly. After Windows was reinstalled, I was informed that Windows wasn't activated on my computer, despite my account being a Windows account, and therefore not needing to purchase a digital license. (Or at least that's how I think it works.) When going to Activation in Settings, the problem was that I \"don't have a valid digital license or product key.\" When looking, I have also noticed that I do not have an activation status, and where it would have been is left blank. When I troubleshooted, the error I got was \"We can't activate Windows on this device right now. You can try activating again later or go to the store to purchase genuine Windows.\" Along with the error code 0x8007056c.How do I fix this error? I couldn't find anything about the error code when searching it up, so I decided to ask.","solutions":["Did you reinstall with the same version, Home or Pro, as was there before?","Hi MD. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.How was Windows 10 originally Activated on the PC? Did it come preinstalled from Factory, was it Upgraded with free or paid Upgrade, or was it a retail copy and license?For Upgrade when you first upgraded and it activated it assigned a permanent Digital License to the PC in Microsoft Activation Servers so you can reinstall any time and in any way you want as long as you reinstall the licensed version. It should reactivate soon after going online. Factory installs have the Product Key embedded in BIOS or UEFI firmware and should activate themselves, but you can check for the key by installing ProducKey and look for OEM-BIOS key:http:\/\/www.nirsoft.net\/utils\/produkey-x64.zipRetail keys must be reinserted for reinstalls during install or in Settings. What is the Status and Edition shown at the top of the page at Settings > Update & Security > Activation?Run the Activation Troubleshooter at Settings > Update & Security > Activation. If this fails you can contact Microsoft Support: https:\/\/partner.support.services.microsoft.com\/... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.","Hi Greg.I seem to have a similar problem but a different error code0xC004F012.History is:- I bought a new computer and loaded a retail Windows 7 pro on it just before windows 10 was released. I then did the free upgrade to Windows 10 pro. Everything worked well until recently. I had problems relating I think, to AVG anti virus. It needed a restart to upgrade itself. When the pc restarted it would not boot into Windows and came up with a simple 'file not found' message.I then reloaded windows 10 from the computer and elected to keep the files.Since then I have an activate windows display on the right hand bottom corner of my screen but windows will not let me activate.The software is showing that it is linked to my Microsoft account.Help.Dave.","You need to go to AVG and get their removal software and completely remove AVG.All you need is Windows Defender and Malwarebytes.","Thank you for your reply.I tried what you suggested but it made no difference. With AVG removed and windows defender running I still can't activate windows.Any more ideas will be welcome.Dave."]},{"symptom":"Software uninstall        I am trying to uninstall Quicken 2016.  I am running windows10. I get error code 1721 when I try to uninstall.","solutions":["Hi huntfish, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Use QcleanUI to uninstall Quicken if the Windows utility doesn't work. https:\/\/www.quicken.com\/support\/using-qcleanui-...Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","I am trying to uninstall Quicken 2016.  I am running windows10. I get error code 1721 when I try to uninstall."]},{"symptom":"Need Help Finding\/Fixing the problem.        To start this off, my laptop (Acer Aspire ES1-533 Series, Model N16C1), started having an issue a couple months back, where the screen would randomly black out for odd periods of time, with nothing but the cursor showing, and then come back on, all randomly. This makes using it nearly impossible. The computer also freezes much more often.After talking to a few people, I've managed to narrow down a little bit where the problem sits.- The problem IS resolved temporarily in safe mode, though network can not be accessed- Updating\/Uninstalling the graphics card has not been effective.- A full wipe of the computer has not been effective.- A clean boot has not been effectiveIf anyone knows what to do here, or what the problem may be, anything would be appreciated.","solutions":["Hello AblixJackblix! My name is Marco, I am an Independent Advisor. I will do my best to help you.When you say \"a full wipe\" do you mean \"format the computer\"? or cleaning for viruses and spyware?If it's a full format ok, but if it's an antivirus \/ antispywer scan, what software did you use?It is also very possible that the problem is a defective screen. To locate the problem, can you take an hdmi cable and connect it to a TV to duplicate the image on it?(Method to duplicate the image you must press the \"windows + p\" key) So if the laptop screen closes but not the one plugging into the hdmi port, this means that your screen is defective and that you have to go to a computer repairer.I expect from you. Good luck :) Marco","Hey Marco!To start things off, by a full wipe, I meant a reset of the computer where everything was erased, uninstalled, and then reinstalled, which may simply be called formatting, but I'm not totally sure of the correct phrasing.As for Antivirus, the computer comes with Norton, and has failed to detect any issues.On the defective screen side of things, I don't believe that could be the problem, because during login, and in safe mode, the screen acts completely fine, just as it should, and the freezing stops as well, while in regular operating mode, the blinking and freezing returns. All I can imagine is some kind of deeply routed virus, or malfunctioning program, or something similar that may be slipping past the reset and clean wipe, yet not safemode.Though, saying that, I'm not very bright in the tech world. It could very well be something I'd expect to be impossible. Let me know your thoughts! :)","If that doesn't happen in Safe Mode, can you see or send me a screenshot of your startup programs?To do this, right click on the task bar, click on \"task manager\" and then click on the startup tab.If possible, please send me the screenshot of what you see in full in the list. The easy method also to take a screenshot, is to click on the start menu and type \"snipping tool\". With this you can select an area and save the photo and then upload it here.","To start this off, my laptop (Acer Aspire ES1-533 Series, Model N16C1), started having an issue a couple months back, where the screen would randomly black out for odd periods of time, with nothing but the cursor showing, and then come back on, all randomly. This makes using it nearly impossible. The computer also freezes much more often.After talking to a few people, I've managed to narrow down a little bit where the problem sits.- The problem IS resolved temporarily in safe mode, though network can not be accessed- Updating\/Uninstalling the graphics card has not been effective.- A full wipe of the computer has not been effective.- A clean boot has not been effectiveIf anyone knows what to do here, or what the problem may be, anything would be appreciated.","Well, I would take a screenshot for you, but there isn't much of a point. There's only three things listed.1. Microsoft OneDrive Setup (Enabled) (Startup impact not measured)2. Realtek HD Audio Manager (Publisher is Realtek Semiconductor) (Enabled) (Startup impact not measured)3. Windows Security Notifications (Enabled) (Startup impact not measured.)I needed to look in safe mode of course, because it's next to impossible to operate on regular windows mode.. "]},{"symptom":"No available drive for restore system image        My hard drive crashed.  I bought a new one, used a bootable USB to restore a system image and got the error message.I searched online and received many options.  Tried them all to no avail.I reinstalled Win 10 Pro and tried to do it again.  No luck.What am I missing?","solutions":["You should create the Macrium boot USB for that or you can add the boot files to startup so you can use Windows boot menu to boot into the Macrium recovery system.To use the USB you would insert the USB & on startup press the key corresponding to changing the boot order temporarily to boot into Macrium recovery, click on restore an image & choose the image then follow the instructions - it’s very simple, after an hour or so you’ll have recovered your system. This works whether it’s the same hard drive or a new drive. Complete instructions here: https:\/\/www.tenforums.com\/tutorials\/61026-backu...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Please do not download any repair tool which is offered by this site other than the ones I mention\/recommend..Thoroughly research any product which is mentioned here before you decide to download and install it."]},{"symptom":"dvd        dvd (not responding)is all I receive when trying to use my dvd. Updated drivers  dvd  tried all the usual advice restarted. no joy windows 10","solutions":["Hi, Have you tried to reinstall the driver via Device Manager? Go to Device Manager then Expand the \"DVD\/CD-rom drives\", then right click the DVD device and click \"uninstall\". After That Restart your Computer, Win 10 will detect the drive, then reinstall it automatically."]},{"symptom":"Two direct access with the same name        The direct access to myPictures folder name change to videos and now redirects to myVideos folder. So now I have two same shortcuts and I can not change one of them because this cahnge will also affect the other one.I atach a picture of the problem","solutions":["The relevant registry key is:HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell FoldersThe relevant values for Picutures are:My Pictures{0DDD015D-B06C-45D5-8C4C-F59713854639}and for Videos:My Video{35286A68-3C57-41A1-BBB1-0EAE73D76C95}Double-click a value name to edit its path.If you're nervous about editing the registry, you can copy & paste the following code into aPowerShell window. It will delete the values. If you then sigh out & back in, the folders underThis PC will assume teir default locations and you can use the Loation tab in the Properties dialog to redirect them again.$USF = 'HKCU:\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders''My Video','My Pictures','{0DDD015D-B06C-45D5-8C4C-F59713854639}','{35286A68-3C57-41A1-BBB1-0EAE73D76C95}' |ForEach {Remove-ItemProperty -Path $USF -Name $_}Keith"]}]}