{"windows":[{"symptom":"Upon starting my PC, I get an error message. Unable to Find Boot Device        I have already attempted multiple fixes and keep finding new errors that send me into rabbit holes.- I have made a USB bootable drive for Windows 10 and run the automatic repair on the drive it returns an error code 00xc0000098- I then attempted to restore the MBR with bootrec cmd manually, and it gives me an access denied message when running the \/fixboot cmd. - To get the access denied error getting out of my way, I ran the diskpart in the cmd prompt. I can see my hard disk via the disk part feature. However, there appears to be no partitions on the drive. -Attempting to create a new partition gives me an uninitialized hard disk error.My question is: Is the HDD dead or just that my data is now unrecoverable? I am completely lost on what to do next other than reinstall windows.","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.It does sound like there could be a fault with your hard disc. If DISKPART cannot see any partitions, and you are unable to create a partition it doesn't sound good.The next think to try would be to use your bootable USB install media and attempt a reinstall of Windows - if that install thinks there are no partitions on your drive you have little option but to ask it to proceed and attempt to make one. It sounds like any data that was on the drive is already lost. If Windows will not reinstall it would be likely your hard disc is faulty. You can test your hard drive by using the free SeaTools app from Segate (even if it's not a Seagate drive). You can make a bootable USB drive to do this, or remove the HDD and conenct it as a second drive on another system to run the checks. Details here: https:\/\/www.seagate.com\/gb\/en\/support\/downloads... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Regards, David","Thank You, it is as I feared","You're welcome, sorry I didn't have better news! Let us know if there's anything else. If you don't have any more questions, feel free to choose a rating. Thanks!"]},{"symptom":"I've found the solution to the \"application has been blocked from accessing the graphics hardware\" issue (see if it works for you!).        For NVIDIA cards:So, after a long time with this problem, trying several procedures, hopeless and annoyed, I found the solution, at least worked for me.The problem can be with factory\/manually overclocked cards, according with NVIDIA.Simply go to NVIDIA Control Panel > Help > and check theDebug Mode. (that will set the default clock speeds to the NVIDIA reference clock speeds). And that's it! It seems like you have to do this every time that you boot your PC.I already sent a bug report on the same day that I found this solution. In fact, this solution is writen in the bug report formulary as a possible fix. I told NVIDIA to fix this and if it's a Windows problem, then they can let Microsoft know about this.If you don't have a NVIDIA card, try to lower the clock speeds of your card with MSI Afterburner, I don't have much knowledge on this matter but I guess you can lower the memory clock and core clock speeds. Do 50MHz and then test whatever game that you are having this issue, if didn't solve then lower by another 50MHz and so on (50MHz it's a example, you can lower 10, 20, 30 etc). It's best if you can do some research before messing with the clock speeds, but the important thing is that the problem can be related to the clock speeds.THERE YOU GO, LET ME KNOW IF THAT HELPED!","solutions":["Replying to my own thread to help xD","This issue it's really annoying so another post to keep it up '-'        ","Up!....","I would like to help this many people that were left without a solution:https:\/\/answers.microsoft.com\/en-us\/search\/search?SearchTerm=aplication+has+been+blocked+from+acessing+the+graphics+hardware&IsSuggestedTerm=false&tab=&isFilterExpanded=false&CurrentScope.ForumName=windows&CurrentScope.Filter=windows_10-hardware&ContentTypeScope=#\/windows\/windows_10-hardware\/\/1But sadly the topics are locked.","Updated description.","UP......","Let's go, another up! xD","Thanks for this. I installed castlevania: lords of shadows and got this message. I will try your solution tomorrow and tell you the results.","Looking forward for your results :D","Well, that didn't fix it... What DID fix it is installing and using the Riva Tuner Statistics Server.The reason why this happens is maybe because it overrides the graphics card settings? I don't know, just a guess, but it works now."]},{"symptom":"lost games        after Windows 10 was installed, 3 of my games were nowhere to be found.  Where do I go to find them?","solutions":["Hi Donald No problem, those games never transfer across in an upgrade . . . those games do not exist in Windows 10 by default, however the good news is you can download the installer for those for free and they will work in Windows 10 . . .Go to the page below, then click the link indicated below to download a zip file. Extract that Zip file and run the installer, that will give you all the classic Windows 7 games on Windows 10 . . .https:\/\/winaero.com\/download.php?view.1836Please note, keep a copy of that installer for future use, it may not always be available . . .________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]},{"symptom":"Licence key        Hello community,I am trying to find out if there is a way I can get my old windows 10 home key from my dead laptop (the hard drives and ram corrupt and couldn't even get past the bios, it's now taken apart and used for parts.) so I can use it in my newly built desktop rather than paying $225?EDIT: I found the windows 7 pro licence key on the bottom of the case but can i use that for windows 10, the computer was upgrade compatible because before it died it was upgraded from windows 7 to windows 10 for free.","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.The official answer is that you can't. As the product key is on a sticker on the bottom of the computer that means it's an OEM key - that is one supplied with the laptop, and that cannot be moved to a new computer as it was only licensed for that particular machine. However - you say the sticker on the case is for Windows 7 Pro, but the laptop has Windows 10 Home installed? Did you purchase Windows 10 Home at some point? If so that would possibily be a Retail version which CAN transfer to a new computer - but you'd need some details, such as product key which would have been supplied when you purchased.It might be possible to use your Windows 7 Pro product key to install Windows 10 Pro on your new computer - the code will be accepted and might activate. But this would be in violation of the license for that software (as it was only intended to run on your old laptop) Regards, David","Im not sure if it was upgraded to windows 10 Home or Pro but we never payed for either, it had said that the laptop could be upgraded as a pop up box and when i did it, it never cost us anything more","The free upgrade would keep the version the same - so Windows 7 Pro would go to Windows 10 Pro, and Home to Home.If the sticker on the bottom of the laptop says \"Windows 7 Pro\" that would have been the version of Windows it was supplied with.As I said - you could try installing Windows 10 Pro on your new device and use the code from the bottom of the old laptop - while it might work, it's not strictly correctly licensed!"]},{"symptom":"Blue Screen, not sure what prompted it.        I have an Asus Windows 7 laptop, about 7 or 8 years old now.  I wanted to upgrade to Windows 10 soI did a backup of my files and then attempted to do a system image , this is where my computer stopped. I got the blue screen saying something like \"checking 3 disks for problems\". I should have taken a photo!.  The computer was running very hot so I turned it off for some time to cool. I turned it back on, did start but very very slow. After a short time I got the blue screen again saying \"Fatal system error, Windows terminated unexpectedly with a status of 0xc0000006. The system has been shut down. Collecting data for crash dump.\" Turned computer off again to receive another blue screen saying \"problem has been detected and windows has been shut down to prevent damage. etc...……..Contact your technical support group. So now I have a backup of my files but not a system image ,not sure what to do here, if the machine will do it would a system restore fix the issue or do I need to take it to a computer expert? Hoping someone can help with this problem.Cheersasus1254","solutions":[]},{"symptom":"Microsoft Fax & Scan        I am using windows 10 fax and scan. When I am receiving a fax I have no problem the modem I am using receives fine. When I am sending a fax out the pages take so long to send. I sometimes have to wait almost 10 min for one page to send. Is their anyway of speeding up the sending out process?","solutions":[]},{"symptom":"windows 10 does not recognize my HP Scanjet 8250        Windows 10 64 bit does not recognize my HP Scanjet 8250 scanner. any ideas","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.HP do not have drivers for Windows 10 for this particular scanner. In many cases you can install drivers intended for older Windows versions and they will work fine. I see that HP have drivers listed for Windows 8.1 - if you visit their download page, and manually change your Windows version to 8.1 you can download the drivers and see if they will work. It won't do any harm to try them. Download page is here:https:\/\/support.hp.com\/za-en\/drivers\/selfservic... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Regards, David"]},{"symptom":"PC set up with child as administrator by mistake        I set up the first user of our PC with my child's name but my email address. Now he is the administrator and I can't add myself with my own email address. How can I delete his account or make myself the administrator?","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Best way is probably to keep the account you've set-up but change the name to your own, since it's been created with the correct email address this is the easiest way to resolve.I presume you used the initial \"Welcome to Windows\" screens to create a new Microsoft account and this has been made using your email address and your childs name? If that case you can rename the account from the Microsoft website which will then change the name you see in Windows... once that is sorted out you can carry on and add you child using their own email address (or create an address, etc.).https:\/\/support.microsoft.com\/en-us\/help\/402772... Regards, David"]},{"symptom":"BSOD with PAGE FAULT Random when gaming        I get random bsod when playing games etc or browsing internet.I tried SFC DISMno way to restore windows to previous versions - grayed outI am 1909 VERSION16GB RAM2700X AMD RYZENRTX 2070 SUPERGAMING OCX470 Asrock Master Slino AV software installled just windows defenderi tried memory diagnostic nothing founddrivers are updated i am running out of optionsif some expert can tell me whats going on i will be happyALSOMy volume icon randomly works - one boot it will work one not its a random.but BSOD is now more important Microsoft (R) Windows Debugger Version 10.0.xxx xx xxxx AMD64Copyright (c) Microsoft Corporation. All rights reserved.Loading Dump File [C:\\WINDOWS\\MEMORY.DMP]Kernel Bitmap Dump File: Kernel address space is available, User address space may not be available.Symbol search path is: srv*Executable search path is:Windows 10 Kernel Version 18362 MP (16 procs) Free x64Product: WinNt, suite: TerminalServer SingleUserTS18362.1.amd64fre.19h1_release.190318-1202Machine Name:Kernel base = 0xfffff804`6f000000 PsLoadedModuleList = 0xfffff804`6f448130Debug session time: Mon Jan 6 22:00:41.452 2020 (UTC + 2:00)System Uptime: 0 days 1:22:30.145Loading Kernel Symbols..........................................................................................................................................................................................Loading User SymbolsPEB is paged out (Peb.Ldr = 00000000`003fb018). Type \".hh dbgerr001\" for detailsLoading unloaded module list.............For analysis of this file, run !analyze -vnt!KeBugCheckEx:fffff804`6f1c14e0 48894c2408 mov qword ptr [rsp+8],rcx ss:0018:ffffef8c`01b875a0=xxxx-xxxx-xxxx-xxxx6: kd> !analyze -v******************************************************************************** ** Bugcheck Analysis ** ********************************************************************************PAGE_FAULT_IN_NONPAGED_AREA (50)Invalid system memory was referenced. This cannot be protected by try-except.Typically the address is just plain bad or it is pointing at freed memory.Arguments:Arg1: ffffef8b8d00bb03, memory referenced.Arg2: xxxx-xxxx-xxxx-xxxx, value 0 = read operation, 1 = write operation.Arg3: ffffcc2bf9e266c0, If non-zero, the instruction address which referenced the bad memoryaddress.Arg4: xxxx-xxxx-xxxx-xxxx, (reserved)Debugging Details:------------------KEY_VALUES_STRING: 1Key : Analysis.CPU.SecValue: 4Key : Analysis.DebugAnalysisProvider.CPPValue: Create: xxx-xxx-xxxxe on DATAHACKSKey : Analysis.DebugDataValue: CreateObjectKey : Analysis.DebugModelValue: CreateObjectKey : Analysis.Elapsed.SecValue: 24Key : Analysis.Memory.CommitPeak.MbValue: 67Key : Analysis.SystemValue: CreateObjectADDITIONAL_XML: 1BUGCHECK_CODE: 50BUGCHECK_P1: ffffef8b8d00bb03BUGCHECK_P2: 0BUGCHECK_P3: ffffcc2bf9e266c0BUGCHECK_P4: 2READ_ADDRESS: ffffef8b8d00bb03MM_INTERNAL_CODE: 2IMAGE_NAME: win32kbase.sysMODULE_NAME: win32kbaseFAULTING_MODULE: ffffcc2bf9e00000 win32kbasePROCESS_NAME: cheatengine-x86_64.exeTRAP_FRAME: ffffef8c01b87840 -- (.trap 0xffffef8c01b87840)NOTE: The trap frame does not contain all registers.Some register values may be zeroed or incorrect.rax=ffffcc08847c13f0 rbx=xxxx-xxxx-xxxx-xxxx rcx=ffffcc2bfa014710rdx=00000000000004b2 rsi=xxxx-xxxx-xxxx-xxxx rdi=xxxx-xxxx-xxxx-xxxxrip=ffffcc2bf9e266c0 rsp=ffffef8c01b879d0 rbp=ffffef8c01b87b80r8=0000000b869b0e01 r9=xxxx-xxxx-xxxx-xxxx r10=fffff8046f106020r11=ffffef8c01b87a30 r12=xxxx-xxxx-xxxx-xxxx r13=xxxx-xxxx-xxxx-xxxxr14=xxxx-xxxx-xxxx-xxxx r15=xxxx-xxxx-xxxx-xxxxiopl=0 nv up ei pl zr na po ncwin32kbase!CHMRefHwndByHandle::CHMRefHwndByHandle+0x1e0:ffffcc2b`f9e266c0 498b7340 mov rsi,qword ptr [r11+40h] ds:ffffef8c`01b87a70=xxxx-xxxx-xxxx-xxxxResetting default scopeSTACK_TEXT:ffffef8c`01b87598 fffff804`6f1e35d6 : 00000000`00000050 ffffef8b`8d00bb03 00000000`00000000 ffffef8c`01b87840 : nt!KeBugCheckExffffef8c`01b875a0 fffff804`6f072eef : 00000000`xxxx-xxxx-xxxx-xxxx`xxxx-xxxx-xxxx-xxxx`00000000 ffffef8b`8d00bb03 : nt!MiSystemFault+0x1d6866ffffef8c`01b876a0 fffff804`6f1cf520 : ffffcc8c`8a470680 00000000`xxxx-xxxx-xxxx-xxxx`xxxx-xxxx-xxxx-xxxx`00000004 : nt!MmAccessFault+0x34fffffef8c`01b87840 ffffcc2b`f9e266c0 : ffffef8c`01b87a90 00000000`0000c0a2 ffffcc8c`7aca1d20 00000000`00001001 : nt!KiPageFault+0x360ffffef8c`01b879d0 ffffcc2b`fa583db7 : ffffef8c`01b87b80 00000000`xxxx-xxxx-xxxx-xxxx`xxxx-xxxx-xxxx-xxxx`00000010 : win32kbase!CHMRefHwndByHandle::CHMRefHwndByHandle+0x1e0ffffef8c`01b87a60 fffff804`6f1d2d18 : 00000000`021cf5a8 ffffef8c`01b87b80 ffffcc8c`7acc7b00 ffffcc8c`7c48d4c0 : win32kfull!NtUserGetProp+0x57ffffef8c`01b87b00 00007ffd`d78b1264 : 00000000`xxxx-xxxx-xxxx-xxxx`xxxx-xxxx-xxxx-xxxx`xxxx-xxxx-xxxx-xxxx`00000000 : nt!KiSystemServiceCopyEnd+0x2800000000`021ced68 00000000`00000000 : 00000000`xxxx-xxxx-xxxx-xxxx`xxxx-xxxx-xxxx-xxxx`xxxx-xxxx-xxxx-xxxx`00000000 : 0x00007ffd`d78b1264SYMBOL_NAME: win32kbase!CHMRefHwndByHandle::CHMRefHwndByHandle+1e0IMAGE_VERSION: 10.0.18362.535STACK_COMMAND: .thread ; .cxr ; kbBUCKET_ID_FUNC_OFFSET: 1e0FAILURE_BUCKET_ID: AV_R_INVALID_win32kbase!CHMRefHwndByHandle::CHMRefHwndByHandleOS_VERSION: 10.0.18362.1BUILDLAB_STR: 19h1_releaseOSPLATFORM_TYPE: x64OSNAME: Windows 10FAILURE_ID_HASH: {xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx}Followup: MachineOwner---------","solutions":["Have you tried uninstalling your cheatengine software to see if that rectifies the problem?","Hi, WhiteLordTheReal Looks like it was caused by Cheat Engine. \"PROCESS_NAME: cheatengine-x86_64.exe\"."]},{"symptom":"sound         need to restore sound","solutions":["Hi, PatThorpe My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps. - Press ‘Windows key + I’ together to open ‘Settings’. - Click on ‘Update & Security’. - Click on ‘Troubleshoot’. - Click on ‘Playing audio’. - Click on ‘Run the troubleshooter’. You can also update the audio drivers. https:\/\/support.microsoft.com\/en-us\/help\/402844..."]},{"symptom":"WINDOWS 8.1 UPGRADE TO WINDOWS 10        Good afternoon,I'm in dire need of help!! My problem stems from me originally trying to fix Windows 10 Updates not installing. After unsuccessfully trying to fix that problem using the directions given for backup and creating a recovery disk, my pc is now back to using Windows 8.1. Thenew problem I'm incurring is Windows 8.1 is slow loading pages and freezes, which is so frustrating!! Do I try to perform a free Windows 10 Upgrade again, as I did originally have Windows 10 or Is there another fix that will allow me to use Windows 8.1 without incurring the slow page loading and freezing? I'm anxious to receive suggestions. Thanks,Christine ","solutions":["Good afternoon,I'm in dire need of help!! My problem stems from me originally trying to fix Windows 10 Updates not installing. After unsuccessfully trying to fix that problem using the directions given for backup and creating a recovery disk,my pc is now back to using Windows 8.1. Thenew problem I'm incurring is Windows 8.1 is slow loading pages and freezes, which is so frustrating!!Do I try to perform a free Windows 10 Upgrade again, as I did originally have Windows 10 or Is there another fix that will allow me to use Windows 8.1 without incurring the slow page loading and freezing? I'm anxious to receive suggestions. Thanks,Christine You mention having had the free upgrade to 10 already.If it was downloaded, installed and activated:The free upgrade to 10 is yours for the life of that device.The best method to upgrade back to 10 is to clean install it.Use the Windows 10 media creation tool on the Software download page \"Start fresh with a clean installation of Windows 10\"https:\/\/www.microsoft.com\/en-us\/software-download\/windows10startfreshReinstall Windows 10:https:\/\/support.microsoft.com\/en-us\/help\/4000735\/windows-10-reinstall\"How to Clean Install Windows 10\"http:\/\/www.tenforums.com\/tutorials\/1950-windows-10-clean-install.html_______________________________________________How to Create Bootable USB Flash Drive to Install Windows 10 fromThis tutorial will show you how to create a bootable USB flash drive that can be used to installWindows 10 with or without UEFI.________________________________________________To access BIOS\/UEFI - UEFI\/EFI configuration:https:\/\/neosmart.net\/wiki\/boot-usb-drive\/_____________________________________When your free upgrade to 10 was  originally activated Microsoft will have kept the Hardware Configuration details of your device on their Servers for recognition purposes if you have to reinstall 10.\"Activation in Windows 10\" (Digital entitlement)https:\/\/support.microsoft.com\/en-au\/help\/12440\/windows-10-activationCheers.","Hi Bill,Thanks for your prompt reply. Actually I did create a backup of Windows 10 prior to trying to fix my update problem. I also created a recovery disk; is there a way to check those disks\/usb to see if there is a problem with them prior to trying to reinstall windows 10? I'm totally confused as to how to proceed as that's what got me into this mess?!Christine","Microsoft brings out Feature Updates for Windows 10.So your Windows 10 disks are already outdated.That's why I showed you how to download the latest Windows 10, make disk\/USB, change boot order.etc."]},{"symptom":"Duplicate emails for family safety requests        When my child requests more time because of family safety time limits I receive 3 copies of the email requesting more time, and I receive these 3 emails on all adult accounts configured in the family. How do I configure notifications and stop the duplicate emails being sent?","solutions":["Hi David. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.We see a lot of problems here with Family Safety. What works most is to remove the Child account, sign out and restart PC, sign back in and add the child back:http:\/\/www.tenforums.com\/tutorials\/34763-child-...There's a guide to Family Safety here: https:\/\/www.lifewire.com\/microsoft-family-safet...FAQ's: https:\/\/answers.microsoft.com\/en-us\/windows\/for... Troubleshoot: https:\/\/answers.microsoft.com\/en-us\/windows\/for...Disable or even remove Family Safety: https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/www.wikihow.com\/Uninstall-Windows-Live-...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows Malicious Software Removal Tool x64 - December 2019 (KB890830) -Error 0x800711c7        * Previous thread.as subject","solutions":["In case you're using Windows 10 S mode:\"Win10-S mode is not supported, there is no added value of running MSRT on this platform. Any install failures of attempting to install the package can be safely ignored.\"Source: https:\/\/support.microsoft.com\/en-us\/help\/890830\/remove-specific-prevalent-malware-with-windows-malicious-software-remo"]},{"symptom":"My game vanished from laptop        Suddenly a game that I was playing disappeared from the PC. Help!","solutions":["Hi Khaoula, my name is Andrew and I'm an Independent advisor here to help you.Did you purchase this game from the Microsoft Store? What is the name of that game?Thanks, Andrew N.","From Miccrosoft store yes","Check the order history. Look through the article View your Microsoft Store order historyhttps:\/\/support.microsoft.com\/help\/4027310\/micr...You can download again any game purchased from the Microsoft Store. Please follow this guideline: - Press Windows + S - Type in Microsoft Store and click on it - Click on the Search Bar on the right pane and type in the game name - Then click on the game and install it. Thanks, Andrew N."]},{"symptom":"Shared Files Windows 10 Error        We have two computers running Windows 10 Pro that used to be connected via homegroup without any problems before this feature was removed.  The main computer has an external hard drive connected to it that wish to access to allow file coping and backups.   I have tried all of the solutions for file sharing access and workaround that can think of to try and get it to work but still run into problems.  The issue seems to be only with the shared drive. I am able to share the drive but then not able to connect to it even if set full permission access for everyone.  We can however set up a shared folder on the main computer and access this without any problems.  Any ideas how can get this working again?The solutions have tried are:https:\/\/www.windowscentral.com\/how-share-files-...https:\/\/www.tenforums.com\/tutorials\/111783-shar...https:\/\/www.windowscentral.com\/how-access-files...https:\/\/www.lifewire.com\/troubleshooting-window...https:\/\/windowsunplugged.blog\/2018\/03\/27\/networ...https:\/\/www.thewindowsclub.com\/network-computer...https:\/\/superuser.com\/questions\/1202441\/windows...","solutions":["Go Settings, System, Shared experiences.","Go Settings, System, Shared experiences.Thanks have tried this. However when I try to access the shared files. I get an error message saying that I don't have permission to access the selected folder.  The computers are using the same Microsoft Account to log in with and permission has been set for Everyone to have fully control access.  Any ideas?","The computers are using the same Microsoft Account to log in with and permission has been set for Everyone to have fully control access.  Any ideas?Which permissions, Share permissions or NTFS folder permissions?","Have you done this on al computers that you want to share?","The computers are using the same Microsoft Account to log in with and permission has been set for Everyone to have fully control access.  Any ideas?Which permissions, Share permissions or NTFS folder permissions?Both permissions are set to everyone.","Have you done this on al computers that you want to share?Yes have done this on all computers.The strange thing is that the users folder on the PC has been shared and are able to access this without any problems. The problem just seems to be with the folders on the external hard drive.","The strange thing is that the users folder on the PC has been shared and are able to access this without any problems. The problem just seems to be with the folders on the external hard drive.You must set the NTFS folder permissions on the external disk to \"Read\/Write\" for everyone.","The strange thing is that the users folder on the PC has been shared and are able to access this without any problems. The problem just seems to be with the folders on the external hard drive.You must set the NTFS folder permissions on the external disk to \"Read\/Write\" for everyone.Everyone is set to full control access for share and NTFS permissions. Have tried removing and re-adding these permissions but this didn't make any difference. ","Everyone is set to full control access for share and NTFS permissions. Have tried removing and re-adding these permissions but this didn't make any difference. What is the account name you use on the machine you're working on? This console command will tell you:set usernameWhat accounts do you have on the machine that hosts the share? This command will tell you:net usersWhat shares do you have on the machine that hosts the share? This command will tell you:net shareTo run these commands you must open a Command Prompt with cmd.exe.","Everyone is set to full control access for share and NTFS permissions. Have tried removing and re-adding these permissions but this didn't make any difference. What is the account name you use on the machine you're working on? This console command will tell you:set usernameWhat accounts do you have on the machine that hosts the share? This command will tell you:net usersWhat shares do you have on the machine that hosts the share? This command will tell you:net shareTo run these commands you must open a Command Prompt with cmd.exe.USERNAME-Bulman StrandsAdministratorBulman StrandsDefaultAccountGuestWDGAUtilityAccountShare Name Resource                    Remarkc$         C:\\                    Default Sharez$         Z:\\                    Default ShareIPC$                            Remote IPCADMIN$ C:\\WINDOWS            Remote AdminGAMING Z:\\GAMINGLAPTOP Z:\\LAPTOPUsers C:\\Users"]},{"symptom":"windows 10 scanner software        unable to scan from multi-function device  Brother MFC-J5830it is connectedis recognized as scanner and does printMessage from Windows 10 Scan   \"Problem Scanning\"  something went wrong please try again.All Brother drivers and Windows 10 are up to date","solutions":["Hi, Try to use the Scanning Application provided by the Manufacturer(Brother)."]},{"symptom":"Excel will not open at all and Word is saving documents as blank.  Also getting error message        I cannot open Excel at all.  Word documents will open but are saving blank and now I'm getting the following error:C:?Windows\/System32\/msxml6.dll is either not designed to run on Windows or it contains an error.  Try installing the program again using the original installation media or your system administrator or the software vendor for support.  Error status 0xc0000020I'm afraid to reinstall program not knowing if this will eliminate all saved documents.","solutions":["Your saved files, either Word or Excel are saved in your Documents folder and are safe.Go to Apps and Features and look down the list of installed programs. Locate Microsoft Office and select the entry. Select modify and then repair. This should reinstall office after it is completed check the programs again.","I tried the repair option and I got \"Something went wrongSorry, we ran into a problem.Go online for additional helpError Code: 30015-13 (2147942593)","What version of Office do you have installed, do you have the original install media.?","It's office 10 home.  I think that it was a download from Microsoft.  I have the physical install for Office 2010.  I can install that but would all of the doc I have saved work with that?  Would the expiration of Office 365 have anything to do with this?","What did you use to create the documents and spreadsheets.Normally if you are using Office 365 trial then you would just stop being able to edit the files but you can still open them as read only.If you think you have Office 2010 installed then it should be shown in Apps and Features as Microsoft Office 2010, is that the case and if so go ahead and re-installed Office 2010.docx and xlsx files should open with Office 2010.","Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.You can try running excel in safe mode. 1. Windows key + R 2. Type: Excel.exe \/safe or press and hold CTRL while starting Excel Check if it will open. For the error you're getting, you can check this link for the troubleshooting steps:https:\/\/appuals.com\/how-to-fix-system-restore-e...(Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.)I hope this helps with your concern! Please let me know if you have further questions.","It allowed me to open in safe mode, but when I tried to open a document it closed out the program","Hi, You might have a system corruption. Is it happening only on Office programs? If it is, try repairing the program. You can check this link for instructions:https:\/\/support.office.com\/en-us\/article\/repair...","I tried repairing using the online method and I received another error that told me it couldn't perform the repair.  ","When I tried to repair Windows it said I was running Microsoft Office Home and Business 2016"]},{"symptom":"product keys        Hi I do not have the requested Windows code and the company I bought that code from has closed down a long time ago Please help me where to get the code?","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Try the steps in this article to retrieve your key: https:\/\/www.groovypost.com\/howto\/find-your-wind...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Where do I locate my MS Office 365 Office subscription number?  So I don't have to dowload all the software on each of my PCs.        Where do I locate my MS Office 365 Office subscription number?  So I don't have to dowload all the software on each of my PCs.","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Office 365 is activated using your Microsoft account details rather than a subscription number. You would have to download the software on each PC.Regards, Ross"]},{"symptom":"How to play AVI files using Movies & TV app?        Can you suggest a way to play old AVI files. I have some restrictions so I need only native Windows 10 apps - for instance Movies & TV app.Thank you.","solutions":["Hi Alex, my name is Andrew and I'm an Independent advisor here to help you. The Movies & TV app brings you fast access to your video files and supports various video file formats including AVI. Look through the article to get more information File formats supported by the Movies & TV app in Windows 10https:\/\/support.microsoft.com\/help\/3078080\/file...Thanks, Andrew N."]}]}