{"windows":[{"symptom":"Cannot access certain sites on Windows 10        I am unable to open certain sites on Windows 10.  Sites that I have been able to access previously..","solutions":["Hi Lyn. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Are these websites? What browser are you using? Try another browser. I would have several browsers on your task bar so there's always one that's best for the task. I use Firefox, Edge and Chrome in that order of preference. It's easy to share bookmarks between all of them in their settings under Import Favorites from another Browser, and Firefox and Chrome let you sign in to save and\/or sync your Favorites on any other device you sign into. Set the preferred browser as Default in Settings > Apps > Default Apps.Reset the browser to see if that fixes it: https:\/\/www.howtogeek.com\/171924\/how-to-reset-y...Right click the Network icon in System tray, choose Troubleshoot Problems, then when prompted choose I'm trying to reach a specific website, input the URL to trace the problem with the site.Once you report back the results of the above steps and any other clarifying information, I'll possibly have additional steps as necessary.Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","The aptly named Down For Everyone or Just Me website will tell you whether the website itself has a problem or just your web browser.If it turns out that it's just your browser that can't reach the website in question, your next step is to describe exactly what happens when you try to open the website, including the complete wording of any error messages you see."]},{"symptom":"Office needs to be reactivated but will not allow me to enter a product key        I upgraded my computer to Windows 10 today. Office 2010, which I purchased with the computer (i.e. paid for, I paid upward of $100 when I bought the computer) no longer works and I received this pop-up when trying to run it.Microsoft Office Activation Wizard\"Microsoft Office Home and Business 2010 detected changes to the hardware on your computer. You must activate Microsoft Office Home and Business 2020. This wizard will guide you through the activation process.\"It then asks if I want to activate by phone or over the internet, but will not let me activate by phone. When I select Activate over the Internet, it tells me \"The product cannot be activated because the product key is not valid\" but it never even gave me a chance to enter the product key, which I have. WHen I click for more information, I get this worthless error message:  \"If you see this message, this means that your Office product key has been blocked and will no longer work.  If your Office product key doesn’t work, or has stopped working, you should contact the seller and request a refund. If you bought a product key separate from the software, it’s very possible the product key was stolen or otherwise fraudulently obtained, and subsequently blocked for use. Unfortunately, there are many dishonest sellers who offer stolen, abused, or otherwise unauthorized Microsoft product keys for sale. Sometimes these product keys are printed on counterfeit labels or cards with a download link to Microsoft software, and sometimes they’re distributed with software media that is unauthorized for resale, such as promotional media, original equipment manufacturer reinstallation media, or other Microsoft program-specific media.\" which does not address the fact that I paid for this product and now find it \"blocked.\"The bottom line is that this upgrade to Windows 10 has essentially rendered my computer unusable and forces me to revert to Windows 7 and associated security issues when support ends.","solutions":["Hi Bill. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Not to worry, you can still reactivate Office 2010 which many use in Windows 10. They only want to know it's being used only one one PC, so follow the process here:https:\/\/support.office.com\/en-us\/article\/Activa...Let me know how it goes. I'll be standing by here to help you.","Greg,I'm afraid I already rolled my computer back to Windows 7 but I looked at the web site. \"Important: When you select the option to activate Office by telephone, you might receive this error:Telephone activation is no longer supported for your product.\" I did receive that error message.The web page also says \"Activate Office 2010 on a different or restored computerYour Office 2010 license allows you to reinstall Office on the same computer, and some licenses allow you to activate Office on more than one computer. But if you try activating Office and you get a message that you have installed it too many times, use the telephone option in the Activation Wizard to contact a support technician.\" The Activation Wizard did not offer me a telephone option (or give me this error message either, it simply told me my product key is not valid).The activation wizard did say it detected a hardware change, and it is conceivable that it does not recognize the computer's C drive which I replaced a few years ago when I received a warning of overheating and therefore a potential hard drive crash. I didn't have to reactivate Office 2010, though, because  I used a system image to copy what I had on the failing drive onto the replacement drive.The activation wizard did not give me the opportunity to enter my product key which I had in fact written down in case I needed to use it.By the way, thank you for responding so quickly.","Another possible option that might work for me, depending on the price, as I do not particularly like the Windows 10 format. https:\/\/rcpmag.com\/articles\/2019\/03\/04\/windows-7-support-extensions.aspx \"Starting April 1, organizations can purchase Microsoft's Windows 7 Extended Security Updates plan to extend the life of their Windows 7 Service Pack 1 (SP1) implementations.\" Do you know where I can access this, and what the price is?","Yeah, I had the same reactivation issue happen with Office 2010 going from 7 into 10. With Office since it's a premium product (like paid Windows) they only put you through a process to make sure it's not on more than one device. So bookmark that tutorial if you go back to Windows 10 and follow it. You can also always ask for me here or one of the MVP's in the Office category will set you right.As to the new packages to extend Windows 7 Support those are for large businesses and organizations using a domain to deploy Updates.","Thank you, I will print out the web page at https:\/\/support.office.com\/en-us\/article\/Activate-Office-2010-1fe7340c-50e2-458f-8677-f57f5a140f46?ui=en-US&rs=en-US&ad=US and possibly give this another try.","Keep me posted on your progress as I will be here to help until the case is resolved."]},{"symptom":"Lost data when reset Windows 10        Hi everybodyI lost data when resetting Windows 10, is there a way to recover the lost data?thank you very much!","solutions":["Hi Vu Did that Reset operation succeed successfully and did you choose to keep your data while performing the reset?If so, open Windows File Explorer Navigate to C:\\Users Do you see two user folders that look like yours? Open those folders and check inside Pictures, Documents . . . etc. and see if your files are thereIf your files are there: Create a new user profile with Admin privileges Log into the new user profile Copy all your data from the old profile to the new profile (Documents Library, Pictures Library . . . etc.)If you still have not found your files, look for a Windows.old folder on your C Drive, expand that to open the users folder contained inside - check there for your files, icons . . .etc.If you do find your files . . . etc. there, copy them out as soon as possible as Windows will remove the Windows.old folder in time","Hi DaveM121Thank you for answering my questionThat reset was successful and I didn't choose to keep my data during the reset.Now all my data is lost. Is there any way to retrieve lost data?Thank you very muchHello,As you didn't opted for keeping your data during reset, unfortunately, it can't be recovered. Regards."]},{"symptom":"Stuck in safe mode and now can’t see to even login on my computer        My computer screen was flickering so i put it in safe mode and when i turned my computer back on i see my background to my login but nothing pops up so i can actually log in and i don’t know what to do to get out of safe mode or to even get back into my computer","solutions":["Hi, thanks for posting your question in the community! My name is David an independent advisor and I am here to help you.If you can log in to your user profile, please perform the following process: press the \"Windows\" + \"R\" keys, in the \"run\" window type \"msconfig\" and select accept, in the system configuration window, select the \"Boot\" tab and make sure that the \"Safe boot\" and \"Make all boot settings permanent\" options are disabled, restart your computer and test if it enters in normal mode.Let me know if the information has been helpful or you still need more help, I will be waiting for your response."]},{"symptom":"Microsoft Surface Pro 7        In the middle of watching videos or even browsing, my screen goes black, but my backlit keyboard still glows. There are also instances where the brightness increases or decreases on its own and I'm sure it's not the \"automatic brightness change as lighting changes\" button because I turned that off in hopes of solving the problem to no avail. Can someone please help me or tell me what is going on?","solutions":["Hey MeganLe1, Evan here an independent adviser perhaps I can assist you. There's many reasons why this could be happening from your GPU having a certain power setting to your PC\\s power settings set to shut off your display after a certain amount of time.Before we delve into that...could you possibly check if your browser and windows versions are fully up to date?","yes i have checked my browser and windows and they say that everything is currently updated","Can you give one thing a try? Go to your display settings and turn of adaptive contrast as well? Then if you are using Chrome turn off GPU\/Hardware Acceleration.I've also heard that using the Edge browser decreases the chance of this issue occurring while using Surface Laptops.","Actually I stopped being able to adjust brightness completely with the laptop. I can change the numbers or levels but the actual brightness never changes and it automatically changes by itself. This whole thing has been frustrating and confusing.","Therefore, please disable adaptive brightness under Settings > System > Display > \"Change brightness automatically when lighting changes,","I did that long ago, but the brightness just changes on its own.","I also stopped being able to use face recognition to sign in"]},{"symptom":"Uninstalling an app        While trying to install snapseed, chromium got installed and now i have a search bar at the top of the screen. While trying to uninstall its not allowing me to saying it requires me to enter admin username and password but not getting any option to do so.","solutions":["Hi Nikhil, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Chromium is a nuisance and you may have to use multiple tools to correct the same. Execute the steps here;How to remove Unwanted Chromium Browsers https:\/\/www.bleepingcomputer.com\/virus-removal\/...Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"after update ,suddendly the MIC needs to be ON for audio software to work,it wasn't this way before update        I have windows 10 and recently went from version 1903 to 1909  ,afterwards all of my software that uses audio would no longer work unless I turned the mic on ,how come ?Why did this software work without having the mic on before ,now after the upgrade Microsoft is telling me I have to turn the mic on to make this software work ? ","solutions":["Hi, AlTeeVX My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps. - Press ‘Windows key + I’ together to open ‘Settings’. - Click on ‘Update & Security’. - Click on ‘Troubleshoot’. - Click on ‘Playing audio’. - Click on ‘Run the troubleshooter’. You can also update the audio drivers. https:\/\/support.microsoft.com\/en-us\/help\/402844...","Jeffrey,I have tried to update drivers , it dosen't work.  Why would I need to update drivers anyway ?  Why did this work before the update for 4 years ! , now it works different after the update.There is no need to have my MIC on with these programs that now suddenly tell me it has to be on or the program will not work, Again ,they worked percect for the last 4 years without the MIC on ?How about you finding out directly from Microsoft why suddenly this is doing this ,I see they don't let average people like me deal directly with their tech people via E-mail , since you work for them maybe you can ask them directly and get back to me.Please let me know if you can and will do this.Thank You,looking forward to a response & answer.","I will redirect your question to another partner hoping I can solve the problem","Hi AITeeVX, Based on your concern, there's a lot of people experiencing this kind of issue as well.What I can suggest is to rollback the updates: https:\/\/lifehacker.com\/how-to-undo-and-prevent-...And disable your windows update for the mean time, please follow this link for detailed guide:https:\/\/www.cleverfiles.com\/howto\/disable-updat...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"Laptop headphones v quiet on webcasts - when I sound cehck youtube are perfect        Hi - thx for help ;-)I tested my headphones on this linkhttps:\/\/www.youtube.com\/watch?v=lfgWv3ypEIYPerfect - so that eliminates hardware issues. But, if I try to listen to the Tesla webcast - just click onto webcast - it is super quiet even at 100% sound. https:\/\/ir.tesla.com\/events-and-presentationsTroubleshooting says something about Windows media centre etc but I don't seem to even have that on my laptop. I have windows media player but the webcast doesn't play through that - it plays in the browser. I've tried chrome and firefox - no difference. Both super quiet. Barely audible. Yet on youtube above at 100% I'd blow my ears off.Really desperate to solve thisFingers crossed - thx","solutions":["Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.An error that often happens when the volume is lowered in the \"volume mixer\" Right click on the small speaker icon at the bottom right of your screen and open \"open volume mixer\". Now see if there are volumes that are reduced.","Hi - thanks for helping. I did look at this but the volumes are all at 100% too. ","Press the \"windows + r\" key and enter \"mmsys.cpl\" (without the quotes). Double click on the name of your headset. Go to \"advanced\" Is the default format 16 bit 48,000 Hz? and press TEST to see if it works well there too.","Hi, it was 24 bit, 48,000 Hz. I changed to the above. Super clear (like youtube test). But, the Tesla webcast is still vv quiet.","Not sure if this helps - got it to work in ie11. But not chrome nor firefox. ","Hi, I can live with using ie11 for listening to webcasts rarther than spending hours trying to figure out why this isn't working in chrome and Firefox. ;-) Thx for your help. If you do see this and think of a reason though I'd still prefer to run through those browsers as chrome is my default. :-)","Let's try something just in case it works. Go back to Tesla's Events & presentation website and click on the little padlock located at the beginning of the address bar.Click on \"settings \" Then in this page, at the top erase cookies then after click on \"reset permissions\"Try this in Chrome first .","Hooray - yes that worked. Chrome now plays at proper volume. I tried the same thing with firefox and that is now working too.Great stuff - thanks for your persistence and help;-)","Nice, happy for you, it took a while I'm sorry but at least we found the problem. Good luck and happy new year!"]},{"symptom":"Upgrade to windows 10        I was a windows 8 user and I upgraded to windows 10, I used the Microsoft website to do this and this didn't seem to have any cost. In afraid I may be charge any cost since (I still underage and obviously don't have any money) ","solutions":["Hi EstefaniaGuzman, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.Can you verify that your Windows is activated successfully? To check activation status in Windows 10, select the Start button, and then select Settings > Update & Security and then select Activation . Your activation status will be listed next to Activation.If it is activated, then you should be fine until the next version of Windows is required.I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","Thank you! My windows was activated successfully, but I have one more question, I didn't buy any kind of license but it says I have been connected to an electronic license, was there a mistake? The account in which my Microsoft is linked will be charged any cost?","Hello! Thank you for getting back to us. Does it say: Windows is activated with a digital license or Windows is activated with a digital license linked to your Microsoft account Microsoft was offering free upgrades to Windows 10 and while that ended in 2016, the method still provides valid activation and if it provides one of the messages above, your copy of Windows has been activated.","No, there would not be any cost charged to your account unless Microsoft retroactively is able to charge for these upgrades.","It say: Windows is activated with a digital license Thank you for the problem of replying ","You're welcome! Your copy of Windows 10 is activated and it should work fine going forward.If you have any other questions, please do not hesitate to ask :) Have a great day!","Thank you!","Hi Estefania, We're glad that Ashton was able to assist you with your concern. If ever you need further assistance, please let us know. You have a good day. You can set this question as resolved now. Thank you"]},{"symptom":"White noise        When I turn on a Microsoft game app like Microsoft Mahjong my computer speakers make a very loud white noise. It turns off when I close the app the sound stops. It is very loud!","solutions":["Hello KimHimmelmann, thank you for providing this question. I am a seasoned Windows expert with almost a decade in usage and support experience and hope to resolve your problems quickly.This could have two causes: 1) The game outputs some weird kind of white noise. Go to the sound mixer and mute the game to see if it makes a difference. Also try muting the system altogether to see if it makes a difference.2) Your integrated graphic processor is located near your sound output and when it computes the thus created strong electromagnetic field gets caught by the aux socket and transmitted to the speakers. It was a big problem in my previous pc where graphic card and sound card sat just next to each other. Graphic intense applications would then put noise onto the aux out. I solved the problem by using a v-dac for my hifi related concerns.If you consider your problem solved it would be very good if you marked the answer which helped you so others can find and use this thread.If this didn't solve your problem or you need further assistance please answer in this thread and i would be happy to help.kind regards F. Grobusch","So does muting the game or the system altogether make a difference? How is it going?","Hello KimHimmelmann, thank you for providing this question. I am a seasoned Windows expert with almost a decade in usage and support experience and hope to resolve your problems quickly.This could have two causes: 1) The game outputs some weird kind of white noise. Go to the sound mixer and mute the game to see if it makes a difference. Also try muting the system altogether to see if it makes a difference.2) Your integrated graphic processor is located near your sound output and when it computes the thus created strong electromagnetic field gets caught by the aux socket and transmitted to the speakers. It was a big problem in my previous pc where graphic card and sound card sat just next to each other. Graphic intense applications would then put noise onto the aux out. I solved the problem by using a v-dac for my hifi related concerns.If you consider your problem solved it would be very good if you marked the answer which helped you so others can find and use this thread.If this didn't solve your problem or you need further assistance please answer in this thread and i would be happy to help.kind regards F. Grobusch This machine is a one year old HP Specter Laptop so I don't really have any access to where components are located. The system is muted for all audio outputs but that has no impact nor do volume settings have any effect. When I opened the above email that also caused the sound to start so apparently it is not just games. I ran a quick virus scan with no threats shown. In some ways it sounds like radio interference with bursts of noise punctuated by silence like someone is keying a mic somewhere. This has never happened before and I travel with the laptop frequently. At the moment I am at my home.Thanks for any advice you my have.Regards,K. Himmelmann","No impact from muting. For example the machine is operating normally at the moment and the system is muted. If I start a game the sound starts almost immediately. Close the game and things return to normal.Kim","Try disabling wifi, bluetooth and everything else. Unfortunately this does very much sound like the problem described above. Signal interference of whatever kind being caught in the analoge socket. When the sound additionally is linked to the system being under load (when doing graphic processing) then the aux socket is not properly shielded\/grounded and does catch interference. Since it is analoge there is nothing you can do on the software side to stop this. Try using a digital output like hdmi or an usb to connect to a shielded DAC.","Try disabling wifi, bluetooth and everything else. Unfortunately this does very much sound like the problem described above. Signal interference of whatever kind being caught in the analoge socket. When the sound additionally is linked to the system being under load (when doing graphic processing) then the aux socket is not properly shielded\/grounded and does catch interference. Since it is analoge there is nothing you can do on the software side to stop this. Try using a digital output like hdmi or an usb to connect to a shielded DAC.Disabling wifi and bluetooth make no difference. I'm not sure what \"everything else\" would be. I did discover that if I plug in some ear buds into the audio jack the sound shuts off and you can't hear it through the ear buds either. So for now I will use the computer with ear buds plugged in. ","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Did you try reinstalling the Game and check if this loud noise is still occurring?","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Did you try reinstalling the Game and check if this loud noise is still occurring?Good morning,Thank you for your offer of assistance. There have been no changes made to the computer since 12\/17\/2019. I have not tried uninstalling and reinstalling any programs. Further experience suggests that any programs or apps requiring sound causes this problem whether it be games  or input from websites or other types of programs. I have discovered that plugging in a set of ear buds to the audio jack prevents the white noise in most cases and makes the computer much more usable. When I spoke with HP support they theorized that the issue is software related but I have my doubts. Any suggestions would be appreciated.Regards,Kim Himmelmann","As HP suggested this is a software issue, let us reset the Audio Driver and check.If the issue persists, we have to consider this as a hardware fault. Please perform the following steps to reset the audio driver. Go to Device Manager Locate and Expand \"Sound, Video and Game Controller\" Right click on the Audio Driver and select Uninstall ( Do Not click on any check box)Restart the PC. The driver will reinstall automatically. Then check if the issue persists or not.","I don't play Microsoft Mahjong, but anyway, does the game normally begin with a sound or a melody? The sound file might have been corrupted, in which case all you need to do is to replace the sound file."]},{"symptom":"Forced from windows 7 to windows 10        Windows 7 might be 10 years old but my $2000 laptop is not.  Windows 7 works just fine and I've already had to retire one hardware platform.  It is unfortunate that Microsoft routinely terminates support for working software at will and washes their hands of responsibility.  In addition to the hardware platform, I'm sure I don't have to mention the plethora of applications and software projects that will undoubtedly require hours of maintenance to ensure they continue to function.Thanks a bunch.  I'm sure I'm not alone. ","solutions":["7 Support was not \"terminated at will\"If you're looking for information for home users, see Windows 7 support will end on January 14, 2020.With end of support Microsoft is not telling you that your operating systems won't work.What they are saying is that after a certain date they will no longer support them.Whether they still work or not with particular programs is up to the particular program manufacturers.Example: Google Chrome is no longer supported for security updates in XP or Vista by Google and Mozilla Firefox is following the same path.What this basically means with Microsoft no longer supporting an operating system is that even though hackers may find \"holes\" and vulnerabilities to be able to access the operating systems and cause security problems, Microsoft will no longer be monitoring or rectifying those problems by way of Security Updates each month.You are on your own in regards to maintaining the Security of your operating systems.What does it mean if Windows isn't supported?____________________________________________________This will show you when support (Mainstream and Extended Support) for the various operating systems ends.Windows lifecycle fact sheet - Windows Help - Microsoft SupportAnd these FAQs show you how Microsoft arrived at the Support Lifecycle Policy:Microsoft Lifecycle Policy FAQhttps:\/\/support.microsoft.com\/en-au\/help\/17140\/lifecycle-faq-general-policy-questions@@@@@@@@@@@@@@@@@@@@@@@","Follow the detailed guide you will find here.  It is a guide to re-install and keep Windows 7 working.https:\/\/www.askwoody.com\/2019\/canadian-tech-how-to-rebuild-a-win7-system-with-minimal-snooping\/","Regretfully you are not alone. I upgraded my older laptop to Windows 10 that resulted in a total hard crash. IT staff spent 2 weeks trying to uninstall 10 and reinstall 7, but without any success. Luckily my files were backed up. We scrapped my older laptop and purchased a new, but installed Windows 7 verses 10."]},{"symptom":"Failed in handling the PowerEvent        I have a windows error event: The search in google\/bing didn't point to a similar error on windows so I'm posting here.Any help would be apreciatedevent error:Log Name:      ApplicationSource:        Service1Date:          30\/12\/2019 1:25:55 p. m.Event ID:      0Task Category: NoneLevel:         ErrorKeywords:      ClassicUser:          N\/AComputer:      DESKTOP-RE1A1ECDescription:Failed in handling the PowerEvent. The error that occurred was: System.ArgumentOutOfRangeException: Time-out interval must be less than 2^32-2.Parameter name: dueTm   at System.Threading.Timer..ctor(TimerCallback callback, Object state, TimeSpan dueTime, TimeSpan period)   at OTBSurvey.Controller.SetSurveyRequestTimer()   at OTBSurvey.OTBSurveyService.OnPowerEvent(PowerBroadcastStatus powerStatus)   at System.ServiceProcess.ServiceBase.DeferredPowerEvent(Int32 eventType, IntPtr eventData).Event Xml:<Event xmlns=\"http:\/\/schemas.microsoft.com\/win\/2004\/08\/events\/event\">  <System>    <Provider Name=\"Service1\" \/>    <EventID Qualifiers=\"0\">0<\/EventID>    <Level>2<\/Level>    <Task>0<\/Task>    <Keywords>0x80000000000000<\/Keywords>    <TimeCreated SystemTime=\"2019-12-30T18:25:55.110475200Z\" \/>    <EventRecordID>22119<\/EventRecordID>    <Channel>Application<\/Channel>    <Computer>DESKTOP-RE1A1EC<\/Computer>    <Security \/>  <\/System>  <EventData>    <Data>Failed in handling the PowerEvent. The error that occurred was: System.ArgumentOutOfRangeException: Time-out interval must be less than 2^32-2.Parameter name: dueTm   at System.Threading.Timer..ctor(TimerCallback callback, Object state, TimeSpan dueTime, TimeSpan period)   at OTBSurvey.Controller.SetSurveyRequestTimer()   at OTBSurvey.OTBSurveyService.OnPowerEvent(PowerBroadcastStatus powerStatus)   at System.ServiceProcess.ServiceBase.DeferredPowerEvent(Int32 eventType, IntPtr eventData).<\/Data>  <\/EventData><\/Event>","solutions":["Hello CHIMUEL, I am Andrew an independent advisor. From what I can see perhaps a system process timed out. This can be for many reason, most common is driver and system failure. Lets fix that. Please follow these steps.In the search bar, type cmd. Right-click on cmd.exe and select Run as Administrator. Type SFC \/scannow and press the Enter key.Re-enter Command Prompt as Administrator and run these:dism.exe \/online \/cleanup-image \/startcomponentcleanupdism.exe \/online \/cleanup-image \/scanhealthdism.exe \/online \/cleanup-image \/restorehealthLet me know the results. Take care,Andrew"]},{"symptom":"metro exodus        I've been playing the game for awhile.  Made it to Caspian.  Fun game. Problem is now it will not load.  Goes through the intro, but it cuts out a second into the train sound and never makes it to the select screen.  The screen goes black and crashes the computer.  This is the second install; I do not want to go through the reinstall and replay again.  I know this is beta and am willing to uninstall\/install, but is there a way to save my data?  ","solutions":["Hello NEWDRAGOON89405, I am Andrew an independent advisor. Is the computer only crashing when playing this game? As it is a beta at this point it could be a software code flaw and unrelated to Windows, especially if the computer doesnt crash at any other time.If its only the game causing it report the issue to 4A games. If this problem persists throughout Windows I can certainly help.Andrew"]},{"symptom":"Missing Status Bar        I recently had to reset my windows 10 pc. Everything is working better and properly except my status bar is missing. I have already looked and the \"show status bar\" optioned is checked. Need help please and thank you.","solutions":["Hi, Please try force stopping WIndows explorer from Task Manager > WIndows explorer > restart. This will redraw the taskbar and desktop and might help with the issue.I hope that helps.","Hi Biff, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.Are you referring to the status bar within File Explorer? (When you are viewing and navigating folders\/files)If so, when you have a window open, click on the View tab. Then click on \"Options\" in the ribbon menu, and this should bring up Folder Options.Under Advanced Settings: there is the \"Show status bar\" checkbox, which you indicated you have already checked.However, at the top under the Folder views section, you could click the \"Apply to Folders\" which would make it the default.Can you let us know if you already tried this? Or is it a different status bar you might be referring to? Please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"My computer keeps crashing (blue screening)--potentially because of drivers for new keyboard.        I recently got a new keyboard (Razer Huntsman Elite) and installed the drivers correctly (I think?). Along with it I got the software Synapse 3 to control certain aspects. It seemingly conflicted with other programs so I uninstalled it. However, this did not solve the issue as my computer is still crashing. I looked up some of the codes (they seem to always be different) and it may be related to the drivers? I would greatly appreciate help on this issue! I have attached the minidump file below. Thank you in advance! https:\/\/1drv.ms\/u\/s!Ags9isZD6GJIiUo6hWBZY_mUKZ2x?e=ZqMQbM","solutions":[]},{"symptom":"Windows 10 Video Editor        After opening the video editor I tried to input a MP4 video from a file. The file contained several MP4 videos previously converted from VHS tapes. The video will play without problems using any number of \"players\" such as media player, etc. However, the video editor will not input the MP4 video for editing. When I open the file containing the MP4 videos, a message comes back \"no items match your search\". This is weird and makes no sense. I am marginally \"literate\" with windows, having played with it since the 1990s, but this problem has me stumped.","solutions":[]},{"symptom":"Hidden Admin        I have been trying to install a non-Microsoft program on my new laptop with windows 10 pro.  The program has a certified Microsoft certification and is provided by a large brokerage firm. To do the install it, I realize it requires to be able to work in the hidden admin account  (net user...).  The account is now asking for a password and I don't ever remember setting a password.  I assume the name is \"administrator\".  Can you please explain how I can get a new hidden admin password?My windows 10 pro version is 10.0.18363.535Thank you  ","solutions":["Using an account with administrator permission, have you tried right-clicking the installer and selecting \"Run as Administrator\"?","Using an account with administrator permission, have you tried right-clicking the installer and selecting \"Run as Administrator\"?Yes I did.  It starts to download the program and then I get the \"an administrator has blocked you from running this app…\" error message.Prior to trying to run the program I did all the normal stuff as an extra effort, temporarily turning off all my antivirus, disabled Windows Smart Screen  (also marked file as safe by unblocking) and under App & Browser control, I changed \"blocked\" to \"warn\".  Next I tried command prompt (run as admin) I typed, “net user administrator \/active:no, and received the “completed  successfully”.  I tried opening the app (as admin) and still received \"an administrator has blocked you from running this app\" error message. So next I tried command prompt (run as admin) typed, “net user administrator \/active:yes. Next I signed out of my admin account and tried logging into the hidden admin account and it asked for a password.  Is that normal? I never saw or changed any passwords.  Can I change the password in command prompt?  Does the Windows 10 (Pro) have additional security that requires additional settings? I have been told the hidden admin account is stopping me from downloading programs as an extra security measure.  I am absolutely sure this program is okay.  It has a Microsoft security certificate (Windows 10) and is a widely used program.  I used the program on one of my Window 7 computers for 8 years and am in the process of updating tall computers to Windows 10.Thank you.","Using an account with administrator permission, have you tried right-clicking the installer and selecting \"Run as Administrator\"?Yes I did.  It starts to download the program and then I get the \"an administrator has blocked you from running this app…\" error message.Prior to trying to run the program I did all the normal stuff as an extra effort, temporarily turning off all my antivirus, disabled Windows Smart Screen  (also marked file as safe by unblocking) and under App & Browser control, I changed \"blocked\" to \"warn\". I have been told the hidden admin account is stopping me from downloading programs as an extra security measure.  I am absolutely sure this program is okay.Firstly I would not recommend disabling anti-virus and smartscreen - a correctly built installer should run past these even if you have to confirm that it's ok to run (hardly a problem clicking yes).  You are disabling core security which leaves you at a higher risk.Is this a domain joined or workgroup PC?  Does your account have full administrator rights?  It sounds to me more like a permissions problem with the account you are trying to run the installer from, provided you have full admin rights \"run as administrator\" should authenticate your admin permissions and run accordingly.","Hi Speedy442 My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.1. Try disabling windows smart screen? Locate the file you want to run or install, right-click on it, and select Properties.Locate the checkbox next to “Unblock” and check it. This should bypass SmartScreen since we have marked this file as safe. Try running the file now. If the issue persists, you might want to consider disabling Windows SmartScreen briefly in order to run the file. Please re-enable it again or you risk exposing your Windows PC to malware.Open Windows Defender Security Center by searching for it or by right-clicking on the shield icon in the right part of your taskbar and selecting “Open”.Expand the menu on the right by clicking on top of it and open “App and browser control”.Locate the “Check apps and files” section and turn it Off. Try running the file now. 2. Try running the File via Command Prompt First of all, locate the problematic file, right-click on it, and select Properties.Copy the full location of the file. After that, run Command Prompt with admin rights by right-clicking on it and selecting this option.Paste the location of your file and add the name of the file with .exe at the end.Click Enter and check to see whether it will run. 3. Try disabling Antivirus If you are using a third party Antivirus on your computer it is possible that it might be blocking you from accessing the files and the “An Administrator has Blocked you from running this app” error message might be triggered. Therefore, it is recommended to disable the Antivirus installed on your computer and check to see if the issue goes away. If it does, add an exception for the application that you are trying to run or keep the Antivirus disabled.For Disabling Right–click on the “Antivirus” icon in the system tray. In most antivirus software there is an option to disable the antivirus from thereIf no option is available, search the web for the directions to disable your antivirus.Adding an Exception Open the Antivirus software and click on the “Scan” option. Click on the “Add an Exception” option and select the “Add Folder” option. Select the folder in which the application has been installed. Try to run the application and check to see if the issue persists. Hope this helps.","Hi Mark, Your questions:1. Is this a domain joined or workgroup PC? It is a workgroup.2. Does your account have full administrator rights? I have “administrator” rights.     I am not familiar with difference between full admin and admin?3. \"run as administrator\" – Yes, right click, run as admin.4. Perhaps it doesn’t mean anything, but the installer details page states the setup    application has a “Microsoft copyright”. Thank you for the advice regarding disabling anti-virus and smartscreen. I guess I am getting desperate because this program is a required necessity for my profession. I have been running the same program for years on Windows 7 without any problems. I needed to update to Windows 10 and purchased a new dell Precision but cannot figure out what I am doing wrong. Any more ideas would be greatly appreciated.  ","Hi Jon,Thank you for your ideas.  I carefully tried all your suggestions twice but the program still will not install.  It keeps giving me the message, \"Your administrator has blocked this application because it potentially poses a security risk to your computer\"I did enter the exceptions as you suggested which was a good idea.Any more ideas are greatly appreciated.   "]},{"symptom":"Did trim works with encrypted ssd drive?        Hi did trim works on Ssd encrypted drive? Windows 10 Pro os","solutions":["Hi ن٢يف . I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Yes, this is confirmed by respected former Microsoft Windows President Stephen Sinofsky here:https:\/\/social.technet.microsoft.com\/Forums\/Lyn...The built-in automatic maintenance tasks in Windows 10 also maintain SSD trim via regular scans. See here to confirm it's enabled:https:\/\/www.tenforums.com\/tutorials\/107171-turn...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows 10 Features        I had just purchased and downloaded Windows 10 2 days ago.  I did have windows 7 before. Is there a way to get the games that where on Windows 7 that where (free) to be downloaded on Windows 10 or are they already there and I just don't know how to access them???? Also Windows 10 seems to be going much slower than my PC was on Windows 7 is there a way to speed it ??  WITHOUT spending more money? I'm really PC stupid and right now Windows 10 has me really overwhelmed. Can anyone assist??  Thank You. John","solutions":["Hi John. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Winaero has provided a free download of all the beloved Windows 7 games to install from here:https:\/\/winaero.com\/download.php?view.1836It sometimes requires a simple repair that pops up after Version Updates, but the install continues to work and be used by millions.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"UI Host not responding        Hi,I'm currently trying to apply for a job and every time I go to upload my resume I get the loading symbol eventually I have to close the file browser and I get UI Host not responding error. Than my web browser freezers and I have to ALT-CTRL-Delete and close program. I have tried both Microsoft Edge and Google Chrome. This has seem to happen since my last Windows 10 update last night.  I lost my job in November so I'm desperate need a job and I need to finish this application before the deadline. TIA","solutions":[]}]}