{"windows":[{"symptom":"Weird folder hierarchy in File Explorer.        I have Windows 10 version 1903.   The file structure as revealed by File Explorer seems to be recursive. This is so because, in File Explorer, DESKTOP contains THISPC which contains DESKTOP, which is shown to be at the top of the folder (directory) tree, so that DESKTOP contains everything, including itself.This is nonsense. Explain, please.","solutions":["Hi Ray. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.There's often mistakes appearing in Explorer Bar under This PC which are hard to explain. But you can edit them here:https:\/\/www.howtogeek.com\/222057\/how-to-remove-...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","The root-level Desktop, This PC, Network,Quick Access and various others are all virtual folders, not actual file system folders (though some contain files and\/or folders from the file system. This is a feature of the the Shell Namespace. The folders seen underThis PC act as shortcuts to your corresponding folders in your user profile folder.REad more here: https:\/\/docs.microsoft.com\/en-us\/windows\/win32\/shell\/namespace-introKeith"]},{"symptom":"Copy & Paste Paint 3D        I have cropped my image in Paint 3d.  How do I copy that image and paste it in an email?  I don't want it as an attachment.","solutions":["Hi Jill, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.See the instructions of the MVP on its website explains step by step the operation of the application, you can go directly to the section >> How do I select multiple objects in my project? where the copy and paste option is shown.https:\/\/www.groovypost.com\/howto\/microsoft-pain...If this feature does not work exactly as you want, you can use the clipping tool that does have the option you need.https:\/\/support.microsoft.com\/en-us\/help\/402721...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I did it with my @yahoo.com mail to my @charter.net mail. Hi I'm Alan just a user. In the 3D work space select the image by clicking the Canvas option on the top tool bar. With your mouse, place the pointer at the top left outside perimeter of the image left click and hold while dragging the pointer to the lower right outside perimeter of your image and release this will give you a moving dotted line around the image. Now look at the tools to the right you will see a pair of scissors next to it is your clipboard (looks like sheets of paper) this will copy the image you have selected, Now you can go to your email and right click inside the email and the paste option should appear left click paste.Note: The tool for the clipboard will not appear until you have selected the image. I think you can only select and copy one at the time unless you go to setting then system then clipboard and you will see an option to save multiple copies to the clipboard. The email I sent to myself was around 1MB I think there is a limit  to the size file you can email so a larger file you will have to save to file explorer and share it through a  Onedrive link or a share option you are a custom too    I hope it works for you ","Thank you!!  That was very helpful!  The issue comes in when i try to crop my image first, then copy it.  For some reason I am not able to do that.  I used to do it in paint all the time,  but i can also do it in Word so i guess i will be using that going forward."]},{"symptom":"Taking long time to for preparing automatic repair        When I was about to open my window, I was not able to. A notice that there was some problem with my PC and it will be repaired automatically by automatically shutting down and getting the PC restarted. But the \"preparing automatic repair \" is taking a long time. It has been a day already and yet nothing happened. I cannot do anything except shut down and restart to set he same notice again.","solutions":["Hi, sonamchoki My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Windows 10 upgrade        Long ago I bought Laptop (Windows 8.1 Home) and Desktop (Windows 7 Pro)at the same time.When Windows 10 was introduced for Free Upgrade, I upgraded both PC’s accordinglyto the Windows 10 Home and the Windows 10 Pro.PC’s still working good and fully updated and upgradedNow windows specifications are:   Edition Windows 10 Home              Version      1909   OS build     18363.535and   Edition Windows 10 Pro                   Version     1909   OS build    18363.535If Version and OS build are the same, what is the different between  Windows 10 Home and Windows 10 Pro?","solutions":["Do you still require help?"]},{"symptom":"compromised \"Windows\" account        Long story short. ish.Some (sick individual) who understands more than I do about computers, etc. is determined to ruin my life. Since March, 2018 this person (whom I lived with for 12 years and knew everything about me and my life) decided that (she) was going to affectmy life in horribly negative ways (as if 12 years wasn't enough). She unleashed her one person wrecking crew on me (do the initials NPD mean anything?). Wait... this isn't short but you get the rest.This person had 24\/7 access to everything I own (like say, my computers). I think this is important because she spent lot's of time on my computer while I was away I'm told (unusual). Beginning in July, 2018  until today she has haunted my every move and has had access to everything I do and say if done on my computer or on another one if I sign in to my accounts (not just microsoft, but every app, etc.). She's very smart, but not too nice.I have changed phone numbers several times, phones several times, and even my computers (however, I think she took one of them with her in May when I saw her last- important? I think so, but I'm not sure, except that for a long time it showed up on my account as a device. The location was not where I lived at the time, but about a half mile away, I just figured it was not precisely located by GPS. I've seen it until about two weeks ago it disappeared from my account, for no apparent reason. New strategy in case I finally figure it out? I have good reason to believe that she has been since we split she has been connected to an \"underground\" group of hackers and thieves that permeate this area. I believe they are hacking many people here and everywhere.Now, let me say that I've re-installed windows, re-set my microsoft account and every password countless numbers of times. I've spent at least 30 hours on the phone with Microsoft support. All to no avail. My account gets continuously taken over by this person or people, sometimes to the point that my emails are filtered and I am \"allowed\" to only see unimportant ****. It has cost me lots of money on lost opportunity, many times I find out months after the fact. I cannot really prove anything (which is the only way the police will help me because I have no ability to save, print, email others, etc. when it comes to important stuff that would show the proof. They say they will look at my computer but in essence may never get it back. I'm considering it.Seriously, this is like a VERY bad movie (which when I saw similar ones, I thought, \"that could never happen\". It can. It does. It is happening. No one up to now has been able to offer me a viable solution.Now, for my question: In attempting to create a new Microsoft account, everything goes well until I get to the last thing. We need your Windows password. I don't have it or know it. It is controlled by my what has now become my only administrator account, an account which I don't believe I setup in the first place. How can I get around this?","solutions":["Sorry to hear that you have a compromised account. You should follow this to recover it & then as well as changing the password to something hard to guess you should turn on two-factor authentication, that way even if someone has the log in details they still can’t access your account as they won’t have your phone.: https:\/\/support.microsoft.com\/help\/10494\/micros...Check too for any keylogger or malware software on the PC: Try running these programs: MBAM free: https:\/\/www.malwarebytes.com\/mwb-download\/Eset online scanner: http:\/\/www.eset.com\/us\/online-scanner\/ Adwcleaner: https:\/\/www.malwarebytes.com\/adwcleaner\/If these find one or more infections but do not fully remove them it will be wise to register with a malware removal site to receive dedicated malware removal instructions, an expert will remain with you throughout the process until confirmation that your PC is 100% clean. Malwarebytes virus\/malware removal forum: https:\/\/forums.malwarebytes.com\/forum\/7-windows...Bleeping computer malware\/virus removal forum: https:\/\/www.bleepingcomputer.com\/forums\/forum22...Disclaimer - This post contains reference to non-Microsoft websites and there may be ads on the page for products & services including products frequently classified as a PUP (Potentially Unwanted Product). Please thoroughly research any product \/ service advertised on the page before you decide to use them. Your discretion is very much advised.","You should also clean install Windows after doing the above. This will remove the unknown account.","Do you have any updates for me?"]},{"symptom":"windows activation failure after device removal from Microsoft account        I am having problems that probably stem from the fact that I did not get clear directions on what to do, so now I think I have mistakenly ruined my windows activation for good, please help.I changed my motherboard and CPU lately, and today I noticed that watermark on the screen telling me to activate windows.So I went to the settings and tried to activate it, it just kept asking me for a product key, which I dont have. I just bought win 10 and it got linked to my account I guess...So I went onto my Microsoft account to look for answers there. Maybe I can find my product key there somehow?What I found instead was that there where TWO devices linked to my account, instead of just one. They both had the same name, so I figured that Microsoft thought that me getting a new motherboard + CPU was me getting another computer.So I thought that the most logical root cause of this problem probably was that I have paid for Windows Pro for one device, my account now has two devices... clearly I must remove the first device! right? So I did. Now there is just one device linked to my account. great.But still windows was unable to activate! The stupid support bot had no idea what I was trying to tell it and just kept telling me to call their call center that closed one and a half hours ago...I kept clicking around and finally found the part where is says how to activate windows without a product key!now I think what happened was that my \"windows activation\" diapered with my -now removed- linked device.So I guess that means that my license is lost forever? Windows 10 Pro is expensive and I dont know if I can buy ANOTHER license...Is there some way to fix this? or do I have to get used to being an Ubuntu user from now on? ","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? Was the original Windows 10 Pro an upgrade from a previous retail version or was the PC bought with 10 Pro?If the PC came with Win 10 pro or was upgraded from Win 10 Home then it may be OEM which cannot be transferred.Right click on start & choose powershell with admin & enter: slmgr.vbs \/dlv This will show a popup showing whether your license is OEM, Retail, or Volume amongst other information.If this doesn’t work then we’ll need to look further. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Do you still require help?"]},{"symptom":"New ISP, cannot change account settings because I cannot get verification emails.        I keep getting “account problem” messages on my PC from MS. I can log into my PC, but I cannot change or verify my account settings with MS because my ISP has changed and I no longer get emails that are needed to verify the changes. Is this something I can fix or do I need to call MS and talk to a human? I cannot change the email because it wants to send verifications to the old address first. Catch 22.","solutions":["Hi Bidens, You need to verify your outgoing mail server with your ISP. You can also check this article before doing so: https:\/\/mediatemple.net\/community\/products\/dv\/2...(is-port-25-blocked)Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Perhaps I did not make it clear. The old isp is no longer available. I moved to a new town over a year ago and the old account is not active. They don’t forward emails. MS is sending to the old address, effectively the bit bucket. Checking mail settings won’t help. Email on my PC works fine. The problem is that MS keeps wanting use an invalid address for verifications.","Have you added another verification email address to your Microsoft account or is this too blocked?Tbh as the original account no longer exists you may need to call Microsoft & have them change the details.https:\/\/support.microsoft.com\/\/help\/4051701\/https:\/\/support.microsoft.com\/contactUshttps:\/\/partner.support.services.microsoft.com\/...","Do you still require help?"]},{"symptom":"Minecraft Windows 10 Edition Microsoft Account Disconnected        This is a problem occurring in Minecraft, that seems to have no fix as far as I've seen. I play on Windows 10 edition and the Xbox one, and this only happens on the windows edition. Everything else works fine, so it's not my Microsoft account. In the main menu, the account connects perfectly fine, but once I join a world it does not. When I start a game, the image below shows what happens. It makes it so that I cannot invite any of my friends to my worlds, and sometimes glitches save files. The game also boots me the first time joining a world after about 5 minutes, and then runs smoothly. Given enough time, the issue sometimes resolves itself (usually about 15-20 minutes), and I can invite some people to join worlds, but not all. Most of the time if they try to connect, it times out, and they still can't join. Any help on fixing this issue would be appreciated. I've also attempted uninstalling and re-installing the game. Thank you for your time! (I didn't entirely know what category to put this in).","solutions":["im not good at what i do but did every think not a enough memory the Run online game I noticed that some of the Call of Duty games play Anywhere games","I have 16gb of RAM, so I don't think that's the problem. I play bedrock on a gaming PC.","This problem was resolved in Minecraft's latest update (1.14.1)."]},{"symptom":"How do I transfer file folders from desktop to taskbar        How do I transfer file folders from desktop to taskbar?","solutions":["The Taskbar isn't intended to hold files. It holds pinned shortcuts. Can you explain in more detail what you want?","I have a business file folder that is displayed on my desktop that contains Word and Excel documents for numerous clients. I also have a separate folder on my desktop containing various personal documents, including Word, Excel and bills, etc. I have been able to pin the personal folder to my taskbar, but have not been able to do so with my business folder.  Having the business folder on the taskbar simplifies accessing information in my business folder, rather than going to the Start button and proceeding from there."]},{"symptom":"Headset Microphone not recognized Laptop Windows 10        Alright so I recently bought a Sennheiser g4me one Headset. When I tried it out the sound was working perfectly well but when I did the audio test I wasn't getting any response from my Headset microphone and was instead getting sound from the built in mic. Also I can't find my headset device name anywhere on the computer. The sound is coming from the headset but it's still called Speakers (Realtek high definition Audio).I was using the 3 stripe headphone jack that came with the headset, I also tried using the 2 stripe microphone jack but It didn't make a difference (apart from making the sound disappear as well.I would appreciate any help!","solutions":["Hello mitsokotronias, I am Andrew an independent advisor. When your headset is plugged in right click the audio control in the taskbar to open the settings. Check where your microphone is coming from. It should say your headset. If not click the dropdown menu and set it to your headset.","I tried this but the headset doesn't show up :\/","Hi, I think I know your problem. 1 plug on your headset is for audio, the other is for the microphone. You need to have both plugged in to the appropriate plugin.","Hi, I think I know your problem. 1 plug on your headset is for audio, the other is for the microphone. You need to have both plugged in to the appropriate plugin.I have 2 types of cables that come with my headset, one cable that only has one output and one that has 2 outputs. On the cable that has 2 outputs I tried only using the one labelled with Microphone and It didn't work, But the one with Headphones labelled worked. The cable with only one output makes the headset work but not the microphone."]},{"symptom":"should I downgrade from windows 10 to windows 8?        I have been using windows 10 ever since I purchased my laptop and it worked fine though, after some time, my habits changed and I started checking updates on a daily basis and this is when the multiple problems started to occur and mostly I had to reinstall windows.This time, windows suddenly freeze and when I turn it off forcefully, it gets stuck at the welcome screen.This happened twice. First, I logged windows in safe mode and that too got successful after the second attempt to boot in safe modeThe second time was today when suddenly, while HDMI was connected, windows froze completely and I had to restore it to the last state.Another thing I noticed was that since the last reinstallation of windows, I could not connect to anycast. I tried terminating and resetting it but it did not work.plus, even though the firewall is turned on, but notification to turn it on appears frequently.","solutions":["I would definitely up the RAM - the laptop is 5 years old so it was out right around the time Windows 10 came out.Have you looked at updating your drivers with the ones from the manufacturer? https:\/\/www.dell.com\/support\/home\/th\/en\/thdhs1\/..."]},{"symptom":"White screen appears        Mostly, when I pick my laptop up, the screen acts really weird. I tried reinstalling the windows and even changed the SSD but nothing worked. Plus, when I extend the display with HDMI, the laptop gets really slow.","solutions":["Hi Muhammad Wow, before you do anything else, you should try getting that laptop casing secured correctly, that will resolve a lot of the problems . . ."]},{"symptom":"MS attempting to download invalid updates        This started with Windows 7 and I thought when I upgraded to Windows 10 the condition wouldn't exist but it does.    When I check on MS update progress,  I see a dozen or more updates for a 32 bit system and mine is a 64 so the updates never install and instead, hang around forever.I guess it doesn't matter but it bugs me to see the pending updates that will never install because they can't.   Is there some manner in which to clear the invalid updates?Thanks!","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as you are getting more updates for a 32 bit system but you are having a 64 bit system. This could be possible, if you have installed apps with 32 bit on your 64 bit system. To investigate the issue, we need to know what updates you are receiving and their KB number. Meanwhile, we would suggest you to follow these steps and troubleshoot on Windows updates.Press Windows Key and type CMD then right click on CMD and selectRun as Administrator from the menu.Stop the BITS, Cryptographic, Windows Installer and the Windows Update Services. Type the following commands at a command prompt. Press the “ENTER” key after each command.net stop wuauservnet stop cryptSvcnet stop bitsnet stop msiserverNow rename the SoftwareDistribution and Catroot2 folder. You can do this by typing the following commands in the Command Prompt. Press the “ENTER” key after each command.ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldren C:\\Windows\\System32\\catroot2 Catroot2.oldRestart the PC and then restart the BITS, Cryptographic,Windows Installer and Windows Update Services. Type the following commands in the Command Prompt for this. Press theENTER key after you type each command. net start wuauservnet start cryptSvcnet start bitsnet start msiserver5.    TypeExit in the Command Prompt to close it.6.    Then check for Windows updates and see if you still get the 32bit system updates. Let us know how it goes. Aditya RoyMicrosoft Community – Moderator"," Thanks, Aditya!    I'll give that a try as soon as I can access my computer.   Thanks for the suggestion.   I'll definitely let you know the results!Gene","What are the updates, what KB numbers or can you post a screenshot of Settings > Update and security and select View update history.Also a screenshot of Control Panel > System please.","That Worked!     At least I think it did.   I don't see any pending updates like I was.   So, if nothing shows up in regards to 32bit updates, I'm good.Thanks!Gene","Unfortunately, the 32bit attempt to update came back.   Here's a screenshot of what I get....  I couldn't get them all:","If you need more, I'll need to scroll down.","Do you have Office 2010 installed, if you do the ref to 32 bit is quite valid as the program can be 32 bit and not 64 bit. This is not a reference to your Windows 10 operating system.Pick one KB number as a test and use the download catalog https:\/\/www.catalog.update.microsoft.com\/Home.aspx to try an update manually.","Do you have Office 2010 installed, if you do the ref to 32 bit is quite valid as the program can be 32 bit and not 64 bit. This is not a reference to your Windows 10 operating system.Pick one KB number as a test and use the download catalog https:\/\/www.catalog.update.microsoft.com\/Home.aspx to try an update manually.Before I bother with manually downloading the update, which I think I have tried before, what is the end result if the program is 32bit?    I use Word all the time and Office is an expensive suite so if the only cure is to buy a new program that is 64bit, I ask myself if the update failure is really hurting anything.   Does it keep the valid updates from updating?     If it isn't really causing a problem,  I don't want to spend big bucks on a new Office program.    If it is causing a problem,  I'll need to bite the bullet.","There is no problem with Office being 32 bit and the 32 bit updates should install for Office. I wasn't sure if you actually had Office 2010 installed but made the point in case you were getting mixed up with your operating system being 64 bit but windows update was trying to install 32 bit updates.Having Office 32 bit is no problem, why the updates fail to install is difficult to say. I would try one of the earlier failed update KB numbers and see if the manual method works.","Okay, I'll give it a try!"]},{"symptom":"Does OneDrive automatically convert HEIC files to jpg's?        Windows 10 Pro Build 18362I've seen articles describing a Setting in OneDrive for HEIC to JPG conversion.And I've also seen articles that indicate OneDrive does the conversion automatically.Wanted to ask here to get a definitive answer:Does OneDrive automatically convert HEIC to jpg? Or is there a Setting?Or another question I should be asking?Thanks for any help or advice!","solutions":["Apparently all you have to do is Go to the OneDrive website & then to Settings > Advanced and turn on the Upload Most Compatible feature on OneDrive.Your HEIC photos will be converted to JPG without using any HEIC to JPG converter.","Hi, Time Lady!When I go to Settings on the OneDrive website I don't find an Advanced option.Here is what I get:fwiw, there is also no Advanced under Options.I'm using Chrome as my browser to access the website.Can you tell me your configuration and path so I can get to that Setting?Thanks, I appreciate it.","Try Edge. If no luck then the feature may have been removed.","No luck with Edge.It feels like we are both trying to determine which articles are correct.And exactly how OneDrive processes HEIC files. ","Contacted OneDrive Support.They responded that there is no automatic conversion of HEIC’s to JPG’s.There is a Setting in iOS OneDrive for Camera Upload that determinesif the Camera Roll should be jpg or heic. This all seems correct to me.","The autoconvert is an option only in the iOS OneDrive app. The website won't automatically convert your pictures.Personally, I leave .heic on as I run Windows 10 on all my devices, which can read them. HEIC files are also smaller.If you save a copy of the picture in the Windows 10 Photos app, it will be saved as JPG though...","I’m sorry to see that you marked my reply as not helpful but I’m glad to hear that you found the answer.","Hi, Entegy!Thanks for the response.That all makes sense.Yes, my goal was\/is to switch to just HEIC files.I use the Windows iCloud product to get my photos from my iPhone (reallythe only camera I use now) onto Windows & OneDrive.iOS products (like iPhone\/iPad) can also just create HEIC files now.But it looks like when they come across iCloud for Windows a jpegalso gets created. Just curious, how do you get your images into Windows initially?I’m open to suggestions. I’ve thought about putting all my images into iCloud.That’s about 15K of photos.I’ve thought about turning on the Camera Roll function in OneDrive.Thanks again!","Thanks for thinking of me, Time Lady. ","I don't use iCloud at all since Apple gives me a stingy 5GB if space, but I have over 1,200GB on OneDrive. I let the OneDrive app for iOS make the camera upload. That way, it's straight to OneDrive as HEIC."]},{"symptom":"Possible scam        I received an email thanking me for ordering Microsoft Defender Pro Security at a cost of $499.99.I did NOT order this!","solutions":["No 'possible' about it, that's a definite scam.","Definitely a phishing email. Scam!Please read: https:\/\/support.microsoft.com\/en-us\/help\/4033787\/windows-protect-yourself-from-phishing"]},{"symptom":"Someone used my computer with their Microsoft Account        Someone used my computer with their Microsoft Account , now my computer is recognizing them as the Administrator and I can not remove them. How can i get this person removed ? I have tried everything I know including setting my computer back to an earlier date. I have entered a new account for myself but I want this person completely removed from my Microsoft account on my computer. PLEASE HELP","solutions":["If you can get into that account on your laptop, go to accounts and change it to a local account. Then log in again and go to accounts, now choose to log in with an MS account and use yours this time.","Thank you for replying to my question . As to yours... No I can not get into that persons account. This person was only here 1 time (with a family member) she asked to barrow my computer to get into her phone that was locked for some reason. Apparently she  fixed it and they left shortly after arriving.  I have never seen that person again, and honestly I do not even remember her name. ","You might find ways using the search engine of your choice. Here in the Community, we do not discuss the possibilities to circumnavigating the passwords or accounts. All I can say, it is possible.And you can always save your data, and install fresh. Windows 10 will activate itself if it was on the machine before.That is if you have Windows10 or 8.1. You never told."]},{"symptom":"trackpad works on lockscreen but not on main logged in screen        This is a new issue. It follows:I know the trackpad hardware is functional, because the trackpad works perfectly fine on the login screen ( lockscreen) but after I login a couple of minutes later the trackpad stops working and you can see this symbol I am the only user of my PC and have not changed any settings. This just suddenly happened midday.I have tried the recommended uninstalling and reinstalling the driverI have windows 10 on ASUS X555L. Have never dropped it and it still in great shape despite being couple years old.So any physical breakage is ruled out. The only explanation is this is an issue with a driver or new update","solutions":["Hi Melika. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Update the Trackpad driver from the PC maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you also have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.If that doesn't help then enter Device Manager reached by right clicking the Start button, go to Mice > Touchpad and then Driver tab. Choose Update Driver, then Automatic to see if it gets a better driver that resolves the problem. If not try Update Driver > Browse > Let Me Pick to try all previously installed drivers. If that doesn't work then try uninstalling driver, Restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver.See the troubleshooting steps here: https:\/\/support.microsoft.com\/en-in\/help\/402786... Go to Settings > Devices > Touchpad to go over the Settings. Then choose Additional Settings which opens the Mouse properties box. The Touchpad software installs a tab onto it - usually the last one - that should have more settings to check, including a checkbox to Disable Touchpad when USB pointing device is attached. This prevents palm drag from causing the cursor to jumpIf this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Update History, then uninstall them from the link there, and immediately check for these again and hide with the Hide Updates tool explained here: https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...You can also go into Repair Mode by whichever method works here: https:\/\/www.tenforums.com\/tutorials\/2294-advanc... to use the new Uninstall Updates button in Advanced Troubleshoot Options:https:\/\/pureinfotech.com\/uninstall-updates-adva.... You can also use System Restore from within Windows or the above Repair Mode to get back before the problem began, then check for Updates with the Hide Update tool and hide them:https:\/\/www.windowscentral.com\/how-use-system-r...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Have you checked in Device Manager to see if there is a driver problem?","As per my post. Yes.","I'm guessing this is an auto response based on select words in the question.As mentioned in the question, I have tried the driver steps provided by microsoft. As mentioned it works on login screen after startup, but as soon as I login, a couple minutes later it disables itself. So the pad itself is not broken. This just happened today.I will do a video recording of it happening real time and post it","I wrote that reply to you and it is still the steps that need to be followed to fix your problem.If you have not assured you have the latest drivers from the PC manufacturer's Support Downloads web page then you have not even begun yet. I said I would help you until the problem is fixed.  May I ask why you gave me an unhelpful rating before you even tried the steps which work for everyone else?  Did you still want my help, as everyone who works with me gets the problem fixed and 90% of those who follow the steps I gave resolve trackpad\/touchpad problems.","Your post did not say you went to Device Manager.","\"I have tried the recommended uninstalling and reinstalling the driver\" followed by screenshot of steps outlining going to device manager to accomplish this task","People have done that without going to Device Manager.","This doesn't even begin to properly install the trackpad driver.  That's why I took the time to write out the detailed steps to properly install your driver - steps you didnt' even bother to reply to except to tell a senior Moderator and MPV here that I was an automated response!  The most basic thing we need to learn to maintain a PC is how to keep the latest manufacturer's drivers current.  Windows Update drivers are never enough."]},{"symptom":"Code 0x80070002 When Moving Forza Horizon 4 From One Hard Drive to Another        The way i usually delete stuf is by going into settings then the storage tab and finding the app that i want to move. but when i hit \"move\" on Forza Horizon 4 all i get is \"Operation did not complete successfully. Try again in a bit. The error code is 0x80070002 if you need it. im at a dead end ive tried to move this game so many times over the past few months and i dont know what to do. if anyone has any tips of a solution for this it would be very much appreciated.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.The game might not work if you change the location as the game data consists the existing file location of the game.I suggest you to change the Download location of apps & games of Windows Store to wherever you want. Then download the game again.Here are the steps to change the download location of Store.https:\/\/www.intowindows.com\/change-download-loc...Note: This is a non-microsoft website. However, it is potentially safe. (User's discretion required)"]},{"symptom":"Bug in detecting communications activity        Hello all,is there some sort of fix for this issue:I have 2 sound cards1 - used for communications (Skype)2 - used for regular soundconfiguration is set as on images bellow, but every time I start the call sound volume on Default Device goes down (option on image 3 is ignored) so I need to change that option to something else, than again return it to : Do nothing. As I tend to have a number of calls throughout a day this issue started to be pretty annoying. Does anybody has some suggestions?","solutions":["Hey SrukMS, Evan here an Independent adviser here to assist you. I attached an image....is this box checked or un-checked? Should not be checked on sound card you do not wish to be affected. This is highly preliminary first step but I wan't to eliminate the obvious first..."]},{"symptom":"Error 0x80244018 while trying to update Windows 10        Trying to update Windows 10 version 1903 on my Dell Laptop Inspiron 3185 to Windows 10 version 1909.  Everytime I try to update I get error 0x80244018.","solutions":["Hello keithstancliff, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemDo you have a 3rd party antivirus installed on your PC? the error says that the update were blocked from download,So wither an Antivirus has tampered in the download process, or you have a proxy or a VPN software that stopped the update.a workaround would be, to download the last windows update using windows media creation tool , as described in this b article from Microsoft:https:\/\/www.microsoft.com\/en-us\/software-downlo...Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolvedCheers! Farah","No I don't have enough memory, says I need 8gb free on c drive even though I have 28 gb avail on usb drive.  Already tried deleting suggested files.","If you don't have enough space on C: you need to increase the size or create the media creation tool on another PC, then use it to upgrade your system"]}]}