{"windows":[{"symptom":"Error: 0x80072ee7 when trying to sync emails in BT account        When I try to syc my emails  I get an error code: ox80072ee7  What can I do to fix this?Moved from: Outlook.com \/ Email \/ Sending, receiving, and reading email***Modified title from: BT Email account ***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you receive an error, ‘0x80072ee7’ when trying to sync emails. I’ll certainly help you with this issue. However, please let us know: Which application are you using to check the emails?Were you able to sync the emails earlier?What type of internet connection are you using i.e. Wired or wireless?Are you aware of any changes made to the computer prior to this issue? The error “0x80072ee7” indicates an internet connectivity issue. I would suggest you to try changing the network connection and check. If you are using Windows Mail app to check the emails, I would suggest you to refer the steps mentioned in the articleResolve sync issues in Mail and Calendar apps in Windows 10 and see if that helps. You can also try reconfiguring the account using the Advanced setup menu. Please refer the steps mentioned in the section Add an account using advanced setupfrom the article Set up email in the Mail app for Windows 10. You may also want to check the BT article on Setting up your email.  If you are using Microsoft Outlook to check your emails, I would suggest you to post your query inMicrosoft Office forums.  Let us know the results. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"How can i use a hik connect app on my windows pc        Hi, I have a windows 10 laptop and in my premises 45 CCTV cameras install and i want to see them on my laptop. Please tell me the solutions.","solutions":["After 5 days research finally i got the solution in form of the software. This is an official software provided by the Hikvision CCTV. The software name is IVMS 4200. After download this i am able to see my camera on my PC."]},{"symptom":"Query related to using BitLocker and TPM on PC        Questions about bit-locker and TPM-security for latest windows 10 version 1909 and up or lower.I’m looking on the web some answer confuse more then it resolves anything.and i want something to easely fall back for myself and other people1)      Do you require to clear TPM and take ownership of TPM?                   a)  In which versions of windows ?                   b) What about other versions of windows ?2)      What are the group policy that need to be enabled for bit-locker                   a) How does each policy need to be configured for use with         i)        TPM ?         ii)       Without TPM ?         iii)     PIN or password ?         iv)     USB Startup -key?         v)       Use of both pin and startup-key?3)      When creating USB startup and\/or recovery key which format is best used in situation:                   a) Use with only windows? NTFS, FAT, EXFat, FAT32. Why?                   b) Use with mac and windows? NTFS, FAT, EXFat, FAT32. Why?                   c) Can startup key fungate as recovery key? If not why not?4)      How do you enable bit-locker: with settings                  a)  Use of pin only?                  b)  Use of USB startup-key?                  c)  Use of pin and startup-key?***Original title: Bitlocker and TPM-Security***","solutions":["Hi Robin, Thank you for writing to Microsoft Community Forums. I appreciate your interest towards BitLocker and TPM on Windows 10.  We do have a dedicated forum where you should be able to find answers to all your queries related to BitLocker and TPM. Let me help you in pointing towards the right direction, I would suggest you to post your query on TechNet forums, where we have support professionals with expertise on BitLocker and TPM to assist you with your query. Articles for reference: BitLockerDevice encryption in Windows 10BitLocker frequently asked questions (FAQ).Trusted Platform Module Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Issues while playing videos on YouTube        Whenever I try to watch videos on youtube, my laptop won't play them and just keep loading. Every time I try, the audio function stops working and then the video will play. I have ran the troubleshoot for the audio and it says it's fixed but then the video won't play again. It's not my wifi since my roommates are able to load youtube fine as well as my phone. Any suggestions on what I should do?***Original title: Video Playback & Audio Problems***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues with Video and Audio playback on the PC. For further clarity on the issue, please respond to the questions below: Which build version of Windows 10 are you using currently?Are you aware of any changes made to the PC prior to which you weren’t facing this issue?Does this issue occurs only with YouTube or any other websites?Have you tried using any other browser to play videos?Which browser are you using to access YouTube? Refer the article Which version of Windows operating system am I running? Meanwhile, I would suggest to try clearing the cache and cookies of the browser and see if that helps. If you are using Microsoft Edge then:  Open Microsoft Edge and go to Settings and more > Settings > Privacy & securityUnder Clear browsing data, selectChoose what to clear.Select the Cookies and saved website data check box and then selectClear If you are using Internet explorer then: Press Windows key + R. This will openRun. Alternatively, you can go to Start and search for Run.In Run dialog box, type inetcpl.cpl and hit enter.Select General tab and under Browsing history click on Delete.Select Temporary Internet files and website files.Select Cookies and website data.Click on DeleteClick on Apply and OK If you are using Chrome then refer the article Clear, enable, and manage cookies in Chrome If you are using Firefox then refer the article Clear cookies and site data in Firefox You may also want to use in-private browsing on the browser and see if you are able to play videos properly. If you are using Edge, then refer the article toopen in-private browsing.If you are using Internet Explorer, thenright–click the Internet Explorer icon on the taskbar, and selectStart InPrivate Browsing.If you are using Google Chrome, then refer the article Browse in privateIf you are using Firefox then refer the article Private Browsing - Use Firefox without saving history Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Paint font        Greetings, I know my problem is not high priority, but maybe someone could help me a bit, I have an problem with changing font in paint,  as soon as I type font turns back to default one. thanks, M. ","solutions":["Hi M, Don here, Windows 10 Independent Adviser. Have you tried any troubleshooting steps from your end in able to resolve the issue?Has the issue been happening recently eventhough you have tried to restart the computer?Have you also tried to reinstall Paint and see if the issue occurs?","Hi, thank You for respondI did restart computer, but I cannot uninstall and re-install paint. Simply no option in control panel\/programs, to do so... Same problem occures in paint 3d . but in simple txt document, I can change fonts ect...   "]},{"symptom":"Windows xp        I have an old hp pavillion laptop running windowa xp 64 bit and i am needing to upgrade but not sure to wich","solutions":["Vista is no longer supported since 2017.Support for 7 ends on the 14th of this month.Support for 8 ended in 2016.That leaves 8.1 or 10, neither of which come for free.And most times they won't run on older computers' hardware@@@@@@@@@@@@@@@@@@@@@@@@Follow these steps before you buy  Windows 8.1; extended support ends January 10, 2023 .Check to see if your Computer\/Laptop Manufacturer has Windows 8.1 Drivers available for your Model.If not available, Windows 8.1 will not install and work correctly for you.\"Windows 8.1 system requirements\"http:\/\/windows.microsoft.com\/en-us\/windows-8\/system-requirementsWindows 8\/8.1 does not come for free; you have to buy itMicrosoft no longer sells 8\/8.1.Try amazon.com, etc.Warning:You do not buy a Product Key by itself, as they are normally stolen\/pirated, Volume Licenses which are not for private use, or MSDN keys which are not to be sold by the original subscription holder.Make sure that you buy the complete sealed package (DVD, license)https:\/\/www.microsoft.com\/en-us\/howtotell\/Shop.aspxRead Section: Beware of Product Keys sold separately.@@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.https:\/\/support.hp.com\/au-en\/drivers\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:HP Products Tested with Windows 10@@@@@@@@@@@@@@@@@@@@@@How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700"]},{"symptom":"Problems with the mouse... stops moving all the time, moves very slowly...        stops moving all the time, moves very slowly...* Moved from Mobile Devices\/Accessories* Original title: problems with the mouse ,","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues with mouse cursor movements on your computer. We will certainly look into this for you. For better understanding, please let us know:What is the version of Windows that is installed on your computer?What is the make and model of your PC and the mouse?Are you aware of any changes after which you are facing issues with the mouse cursor movements? We can go ahead and try a few steps to isolate the cause of the issue.I would suggest you to try booting the computer in Safe Mode and check if the issue persists in Safe Mode. If you do not encounter this issue in Safe Mode, then go ahead and try to put the computer in Clean Boot. Method 1: Check in Safe Mode with clean boot environmentPlease refer this safe mode article and start the PC in safe mode. If the issue persist in safe mode then perform clean boot in safe mode environment, please follow the steps mentioned in thisclean boot article. A ‘clean boot’ starts Windows with a minimal set of drivers and startup programs, if the issue doesn’t persist in safe mode, then try clean boot in normal mode, so that you can determine whether a background program is interfering and causing this issue. Clean Boot Disclaimer:A “clean boot” starts Windows with a minimal set of drivers and startup programs, so that you can determine whether a background program is interfering with your game or program. Your computer may temporarily lose some functionality while in a clean boot environment, however that functionality will return when youreset the computer to start normally after you have finished your troubleshooting. Method 2: Uninstall driver from device managerPress Windows + X and click onDevice Manage.Expand or double-click Mice and other pointing devices.Right-click on the listed driver, and then selectUninstall deviceSelect Delete the driver software for this device, and then click Uninstall.Follow the onscreen steps and restart the PC.Upon restart, plug in the mouse and install it. We await your response. Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"my pc is asking \"wia driver\"while scanning        my pc is asking \"wia driver\"while scanning.i am unable to scan the files","solutions":["You do have a scanner, or a printer\/scanner?Does the printer\/scanner manufacturer supply windows 8.1 drivers for it?Go to your all-in-one Printer or scanner Manufacturer's website > Key in your Printer \/scanner Model Number and Operating System.Uninstall\/reinstall your Printer or scanner using the latest Drivers from there for your Operating System.Most Printer\/scanner Manufacturer's will also have troubleshooting steps for you to take listed there, too."]},{"symptom":"Win10 pro key from win 7 upgrade licence        Hi GuysI just replace mobo and cpu. I need to reactivate I purchased win10 pro upgrade from win7 back in 2017, I still have the Order and is its in my purchase history but I can not find the key anywhere to reactivate.Logged in with my account but still wont reactivate.Cheers","solutions":["Hi,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.It is a retail license so should activate. Activation depends on what type of license you have of Windows 7\/8\/10. If Windows 7\/8\/10 came preinstalled with the computer, that is called an OEM license. For an OEM license, the license dies as soon as Motherboard dies. So essentially it is non-transferable. If that is the case you need to get a new license.However, this is not same for retail licenses i.e. you purchased the license through Microsoft store. That does carry transfer rights. If that is the case, please see the below steps:Run the activation troubleshooter on the new device using the below steps:Go to Settings>Update and security>Activation and run the troubleshooter. and select I recently changed hardware on this device.(Please note that Activation troubleshooter requires you to have digital license linked to Microsoft Account.)If the troubleshooter hasn't helped, you would have to call Microsoft during support hours to get more help.https:\/\/support.microsoft.com\/en-in\/help\/405170...Please let us know if you need any assistance.","Hi SumitSorry for the late reply.It was a purchased copy of windows 7 home, upgraded it to win10 home (FREE upgrade), then brought win10 pro license upgrade through the windows store due to the need for Hyper V.No longer have the original Win 7 key any were, unable to run trouble shooter as PC died.I have payed for a copy of win7 home and upgrade to win10 pro and I need to reinstall win10 on new PC and SSD's.Any help would be great :)Cheers  "]},{"symptom":"Google Chrome asking for admin\/adult approval        I've removed myself from the family and it still asks for parent's approval. I dont know what to even do anymore.","solutions":["Does it give you the option to reset it under advanced? If not, can you remove by add remove programs in the control panel?","What do you mean?","You get reset Google Chrome by going to the cof in the top right, then go to settings\\Advanced then use the option to reset Chrome. If that doesn't work, fully uninstall Chrome and re-install it","full reinstall didnt work","Hi Kodez123 I'll try to help you out. Can you give me a screenshot of the error message ? I think it's not related to google Chrome, but more to a Windows Child account if I'm guessing right.If this is the case, you will have to go to the adult account, and unlock the child account.Regards","Heres the screenshot. Its in Finnish but i think you will get the idea.","I definitively think it's related to Windows child \/ parent account. I think there is an adult account somewhere.","Im set as an adult in the family","If it's always when using Google Chrome and you use a Google account when you use Chrome then what is your Google account age set to.Or do you see this in other windows screens.Do you use a Microsoft account to sign-in to windows, what is your age set to.","Have you already tried to disconnect \/ reconnect your microsoft account ?"]},{"symptom":"Windows 10 agenda doesn't show many events (that correctly appear in the calendar)        Hello there,I'm facing this issue lately (also my sister has this problem, so it's not isolated): lately we have noticed that the Windows 10 Agenda in the system tray doesn't show many events, while they are still present in the Windows Calendar App. I tried something and I have noticed that Agenda doesn't show:1-Events created from the mobile Google Calendar App (which they appear in the Windows Calendar App, anyway);2-Some shared calendars that showed some time ago;3-Recurring events (holidays, birthdays…).I tried something else and I have noticed that events appear correctly if:-I create events on PC from Google Calendar;-I create events from Windows Calendar App (or from the Agenda itself).I attach a screenshot (I removed the non important parts). The blue event that doesn't show up in the Agenda is a recurring one from a shared calendar, but the same problem is there also with the second event (the red one), which is a single event added from smartphone Google Calendar App; every holiday and birthday is missing as well.I tried also restoring Mail & Calendar, tried forcing syncing and much more: I did all the \"routine check\". It's strange that the events are there if I open the Calendar (so everything is syncing correctly), and they are missing only from the Agenda.Windows is updated to the 1909, and has been recently installed (less than a month ago; 1903 and then updated to 1909; my sister had the 1903 installed from a longer period, instea. She is on 1909 as well).I reported this on the Feedback Hub as well.","solutions":["I have the same problem. The agenda is empty:yet, the event is in the calendar:i received a notification about the event, it shows up on the lock screen:And as it is a recurring event (birthday) it shows up if I go to Jan 2019 or older:I tried resetting the Calendar app, re-adding my Microsoft account, syncing, removing the calendar and adding it back."]},{"symptom":"markets.books.microsoft        What is markets.books.microsoft","solutions":["Hello Tanya_T, thank you for providing this question. I am a seasoned Windows expert with almost a decade in usage and support experience and hope to resolve your problems quickly.I will need some context to answer this. Where did you encounter this name? It could be a software library path since it has points inbetween. If this solved your problem i am very happy if you would provide feedback and mark this as solved.If this didn't solve your problem or you need further assistance please answer in this thread and i would be happy to help.kind regards F. Grobusch","The following endpoints are used to communicate with Microsoft Store. If you turn off traffic for these endpoints, apps cannot be installed or updated from the Microsoft Store. Additionally, the Microsoft Store won't be able to revoke malicious apps and users will still be able to open them.TLS v1.2.md.mp.microsoft.comHTTPS*displaycatalog.mp.microsoft.comHTTP \\ HTTPSpti.store.microsoft.comHTTPstoreedgefd.dsx.mp.microsoft.comHTTPmarkets.books.microsoft.comHTTPshare.microsoft.comhttps:\/\/docs.microsoft.com\/en-us\/windows\/privacy\/manage-windows-1903-endpoints","My antivirus keeps blocking:   markets.books.microsoft.com  saying it has an expired security certificate.  But I have never tried to  enter the site.  I have never heard of that site except for my antivirus's notification.  Thus I am very suspicious that this is some type of malware.","My antivirus keeps blocking:   markets.books.microsoft.com  saying it has an expired security certificate.  But I have never tried to  enter the site.  I have never heard of that site except for my antivirus's notification.  Thus I am very suspicious that this is some type of malware. My BitlockerBox is saying the samething. That the certificate is expired. ","Bit Defender says the certificate is expired.","I would like hep resolving this. Bitdefender is constantly blocking this as a suspicious connection because of an expired certificate.","Hello, I have Bitdefender 2019, and I had this same expired certificate error that you are seeing. Bitdefender blocks it because expired certificates are backdoors for malware. I couldn't get emails into my Outlook 365 account because of Bitdefender blocking the connection to markets.books.microsoft.com. When I added the markets.books.microsoft connection to Exceptions in Bitdefender, all of my emails from my server flooded in! Just add the markets.books.microsoft.com to Bitdefender Exceptions list, and Outlook 365 will import emails.","I also have Bitdefender and receive 3 to 5 of these blocked transactions, every 2 to3 days. My stem from Windows Edge. You say you simply permitted markets.book>etc access. But you have not stated if it's safe to do so!","It is not safe.I got following message\" MicrosoftEdge.exe has attempted to connect to markets.books.microsoft.com based on an expired certificate.\"Regards.","I agree- it does not seem safe to allow the connection. Can someone help resolve this issue?"]},{"symptom":"Windows 10 activation        I have purchased this computer with Windows 7 Home prem for Asus and it was automatically updated to the Windows 10.Then my Hard drive (SDD) got unservicebel (broken). After repair of my laptop, technician has installed windows 10 in my laptop.I have only original key of Windows 7 with me. How I can activate Windows 10 now?Thanking you in advance!!!","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,First you need to identify if the product key is either retail or an OEM key. Is the hard drive the only hardware that was changed on the device?Normally OEM keys are solely embedded to one motherboard as they do not have transfer rights for other hardware, unlike retail keys which has transfer rights.For free upgrade licenses, the condition for these are relevant to an OEM key as the license is then considered a digital license once you upgraded free to windows 10.Under this link are reference to activation after hardware change https:\/\/support.microsoft.com\/en-ph\/help\/20530\/...For your windows 10 license, I'd recommend running the activation troubleshooter. Go to Settings>Update and security>Activation and run the troubleshooter. and select I recently changed hardware on this device.If the troubleshooter hasn't helped, you would have to call Microsoft during support hours to get more help.https:\/\/support.microsoft.com\/en-in\/help\/405170...","Thank you Mr. Gary!! Yes, only hard drive (SSD) was changed in this device.","You can use your Windows 7 licence key if it is not activated but it should have auto activated if the correct edition is installed.Enter winver in Search and select the top result, the resulting window has the Windows 10 edition, for your licence it should be Windows 10 Home. If it is anything else then the repair shop has installed the wrong edition. The easiest way is to ask the repair shop to install the correct edition.A Windows 10 licence is supported for clean installs on either the existing SSD\/HDD or a new one as the licence is for the life of the device, for Windows 10 that is the motherboard.","As another check you can check activation at Settings > Update and security select Activation and see the right hand pane.","My pleasure! Some users has indicated that their previous product key prior to windows 10 was able to re-activate on the same motherboard. This is possible if your previous product key is retail as well. :)","Hi.When i click the activate botton, iam getting this type of Error code: 0xC004F074 please solve the problem","I have similar problem. I bought my toshiba laptop in 2015 with already installed windows 8.0 on it. Later on Microsoft offered me free legal installation of Windows 10 and it was connected to my Microsoft account. Now, my laptop died actually the motherboard crashed and I bought a new laptop without system on it (it was cheaper for me because I have already Windows connected to my Microsoft account). I downloaded from Microsoft website Windows 10 Home 64x (like my previous version) but I can't activate it. Where is the problem? I removed from my devices the old laptop but still there is a problem telling me I need to buy a new Windows? Why is like that when I have a Windows 10 connected to my email Microsoft account?Regards,Stojan","Your problem is that you are not allowed to transfer a OEM Windows 10 licence (which is what your previous device would be) you need to buy a new licence for Windows 10.","Thanks!!! I have contacted MS support and it should be 10-Home!! You are correct, repair shop has installed some other. So will solve it!!!","Product key was checked by MS support and its genuine. problem is.... the free upgrade fm 7 to 10-Home only. Thanks!!"]},{"symptom":"Games crashing after 15 minutes?        Hi all, recently built a pc consisting of the followingGigabyte Aorus B450m BoardRyzen 5 3600xRadeon 5700xt16gb Corsair vengeance rg pro 3200mhz (2x8gb)Samsung m.2 500gb 970 proThermaltake BX1 750W Bronze power supplyNzxt Kraken AIO coolerUnfortunately after 15 minutes of gameplay on any game i'm having the game, and sometimes the computer crash.I've tried nearly everything, reinstalling drivers and software, uninstalling software, running games in compatibility mode. I've even done a clean windows reset and install and unfortunately I'm still having the same issue.Here's a snapshot of BSOD I've been getting:==================================================Dump File         : 010720-7234-01.dmpCrash Time        : 7\/01\/2020 7:38:53 PMBug Check String  : SYSTEM_SERVICE_EXCEPTIONBug Check Code    : 0x0000003bParameter 1       : 00000000`c0000005Parameter 2       : fffff807`152ed7d8Parameter 3       : ffff8101`afdc1710Parameter 4       : 00000000`00000000Caused By Driver  : dxgmms2.sysCaused By Address : dxgmms2.sys+6d7d8File Description  : Product Name      : Company           : File Version      : Processor         : x64Crash Address     : ntoskrnl.exe+1c14e0Stack Address 1   : Stack Address 2   : Stack Address 3   : Computer Name     : Full Path         : C:\\Windows\\Minidump\\010720-7234-01.dmpProcessors Count  : 12Major Version     : 15Minor Version     : 18362Dump File Size    : 1,391,780Dump File Time    : 7\/01\/2020 7:39:49 PM====================================================================================================Dump File         : 010720-7593-01.dmpCrash Time        : 7\/01\/2020 6:35:31 PMBug Check String  : SYSTEM_SERVICE_EXCEPTIONBug Check Code    : 0x0000003bParameter 1       : 00000000`c0000005Parameter 2       : fffff805`75e31e99Parameter 3       : fffff382`0da0cfa0Parameter 4       : 00000000`00000000Caused By Driver  : ntoskrnl.exeCaused By Address : ntoskrnl.exe+1c14e0File Description  : Product Name      : Company           : File Version      : Processor         : x64Crash Address     : ntoskrnl.exe+1c14e0Stack Address 1   : Stack Address 2   : Stack Address 3   : Computer Name     : Full Path         : C:\\Windows\\Minidump\\010720-7593-01.dmpProcessors Count  : 12Major Version     : 15Minor Version     : 18362Dump File Size    : 1,068,292Dump File Time    : 7\/01\/2020 6:36:21 PM====================================================================================================Dump File         : 010620-7187-01.dmpCrash Time        : 6\/01\/2020 6:43:46 PMBug Check String  : MEMORY_MANAGEMENTBug Check Code    : 0x0000001aParameter 1       : 00000000`00041792Parameter 2       : ffff943f`fde6b2c0Parameter 3       : 00000000`00000008Parameter 4       : 00000000`00000000Caused By Driver  : ntoskrnl.exeCaused By Address : ntoskrnl.exe+1c14e0File Description  : Product Name      : Company           : File Version      : Processor         : x64Crash Address     : ntoskrnl.exe+1c14e0Stack Address 1   : Stack Address 2   : Stack Address 3   : Computer Name     : Full Path         : C:\\Windows\\Minidump\\010620-7187-01.dmpProcessors Count  : 12Major Version     : 15Minor Version     : 18362Dump File Size    : 813,516Dump File Time    : 6\/01\/2020 6:44:35 PM====================================================================================================Dump File         : 010520-7265-01.dmpCrash Time        : 5\/01\/2020 9:49:48 PMBug Check String  : PAGE_FAULT_IN_NONPAGED_AREABug Check Code    : 0x00000050Parameter 1       : ffffb08e`a8207420Parameter 2       : 00000000`00000003Parameter 3       : fffff807`1aafbc93Parameter 4       : 00000000`00000002Caused By Driver  : ntoskrnl.exeCaused By Address : ntoskrnl.exe+1c14e0File Description  : Product Name      : Company           : File Version      : Processor         : x64Crash Address     : ntoskrnl.exe+1c14e0Stack Address 1   : Stack Address 2   : Stack Address 3   : Computer Name     : Full Path         : C:\\Windows\\Minidump\\010520-7265-01.dmpProcessors Count  : 12Major Version     : 15Minor Version     : 18362Dump File Size    : 988,740Dump File Time    : 5\/01\/2020 9:50:38 PM====================================================================================================Dump File         : 122919-9109-01.dmpCrash Time        : 29\/12\/2019 9:10:19 AMBug Check String  : SYSTEM_THREAD_EXCEPTION_NOT_HANDLEDBug Check Code    : 0x1000007eParameter 1       : ffffffff`c0000005Parameter 2       : fffff806`5c13f321Parameter 3       : ffffbf06`f473eac8Parameter 4       : fffff806`61480930Caused By Driver  : ntoskrnl.exeCaused By Address : ntoskrnl.exe+13f321File Description  : Product Name      : Company           : File Version      : Processor         : x64Crash Address     : ntoskrnl.exe+13f321Stack Address 1   : Stack Address 2   : Stack Address 3   : Computer Name     : Full Path         : C:\\Windows\\Minidump\\122919-9109-01.dmpProcessors Count  : 12Major Version     : 15Minor Version     : 18362Dump File Size    : 800,692Dump File Time    : 29\/12\/2019 9:11:17 AM==================================================","solutions":["Hi lllJB3lll Can you please upload your minidump files for further analysis, to see if those can shed any light as to the cause of your system crashes . . .Open Windows File Explorer Navigate to C:\\Windows\\Minidump Copy any minidump files onto your Desktop, then zip those up Upload the zip file to the Cloud (OneDrive, DropBox . . . etc.), then choose to share those and get a share linkThen post the link here to the zip file, so we can take a look for you . . ."]},{"symptom":"Phase 10 wont let me play        I have played phase ten online for about a month now.When i open it now i get error message to update game to be able to play online.I did that as well as delete it and reinstall it but I still get same message.How can I fix this?","solutions":["This is a forum for those testing Windows 10Insider builds.You should contact the maker of your game.","What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK","Hi Patricia,As others have said, the Windows Insider Program forum is just for discussing preview builds of Windows 10, so I have moved your post to the Gaming forum."]},{"symptom":"USB stick is write protected        Hello all,I've buy a USB Stick and formatting.After formatting i copied few files and folder.Next day I can't append more files or folders in to USB Stick.I tried with diskpart to \"clean\" but get error msg and there is also no entry in entviewAlso tried with registryI dont know what I can do else?I'm very thankful for any helps and best regards","solutions":["Hi SuperSymetrics If there is no physical 'Lock' button on that USB Flash drive, then I am really sorry, that flash drive has failed . . .Any flash drive that shows a 'Write Protected' or 'Please Insert Disk' error has failed and while you will find plenty of 'fixes' on the Internet, sadly none of those will work . . .Since that is a new drive, you should return that to the retailer and obtain a new flash drive.Flash drives are volatile, they can and do corrupt at any time, they are not suitable for long term storage, though that is what most people use them for, because of their volatility, they are really only suitable for moving files form one PC to another.A small and in-expensive external hard drive is must more reliable and more suited to long term file storage . ."]},{"symptom":"thumbnails in pictures are greyed out        when I tried  to open \"pictures\" from either my \"This PC\" or from OneDrive results in an endless loop of downloading;I eventually stopped the process but now my thumbnails are greyed out","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query related to thumbnails not showing up on your PC. For further clarity on the issue, please respond to the questions below: Which build version of Windows 10 are you using currently?Are you aware of any changes made to the PC prior to which you weren’t facing this issue?What is the file type that you’re trying to access?Are you syncing the files with OneDrive? Refer the article Which version of Windows operating system am I running? In addition, please share the screenshot of the thumbnails that you are trying to access. Refer the articleHow to include a screenshot in your postPlease get back to us with the detailed information to assist you further. Regards,Prakhar KhareMicrosoft Community – Moderator","I am not aware of any changes to my Windows before this occurred.My photos are on my PC:well, I can't attach the screen shot because my computer just frozeand I can't attach an image of my frozen screen that I took with my phone because my computer is frozen.  Help.","I turned off and restarted my computer.In I guess a related development, every time I open up my computer, quick access starts doing something, I don't know what. Here is a screen shot showing the green bar in motion... it continues to fill the bar and never ends whatever it is doing.","Here is the screen shot of my frozen computer with greyed out photos.","I also have the same problem on OneDrive:","Hi,Thank you for replying.Please help us with the below information to assist you better.Does this issue occur with all the formats of image or only specific formats?What happens when you try to open the images?One of the things that you can try is clearing the thumbnail cache and see if the thumbnail appears.Press Windows+ S key together to openSearch.Now type CMD and selectRun as administrator.Accept the UAC prompts.Type in the following commands one by one and hitEnter:taskkill \/f \/im explorer.exedel \/f \/s \/q \/a %LocalAppData%\\Microsoft\\Windows\\Explorer\\thumbcache_*.dbstart explorer.exeRestart the PC.However, if the issue persists, try creating a new user account and see if you are able to see the thumbnails of the images. Refer the articleCreate a local user or administrator account in Windows 10Let us know how it goes.Regards,Prakhar KhareMicrosoft Community – Moderator","I am copying below a different problem with file explorer being greyed out that developed on my computer after the thumbnail problem developed. I followed the advice from the below email \"In this scenario, we would suggest you to refer this article and check: Automatically diagnose and repair Windows file and folder problems\" and it fixed both the thumbnail  problem and the file explorer problem.  Thank you.Hi KarenLongo-Baldwin,Aditya_Roy has replied to your question in file folder view options for changing the view are greyed out in Microsoft Community.Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as you are unable to change the view options in File Explorer as it’s greyed out. In order to get clarity and to assist you accordingly, please reply with the answers to the questions below.What is the Windows 10 version and Build (1903\/1909) installed? (Type winver in Windows search\/Run command)Are you aware of any recent changes on the PC, prior to this issue? In this scenario, we would suggest you to refer this article and check: Automatically diagnose and repair Windows file and folder problems Let us know how it goes. Aditya RoyMicrosoft Community – ModeratorPost a replyDid this resolve the problem? Give feedback","Hi, Thank you for replying.Glad to know that the issue is resolved by running the troubleshooter for File Explorer.If you have any other queries related to Windows, please post it in an appropriate forum, and we will be glad to assist you.Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"on Windows 10 The data area passed to a system call is too small        I am trying to run a defrag program on Windows 10 and getThe data area passed to a system call is too smallWhat is this, and how do I clear it up ?","solutions":["Hi Don,Thank you for replying.Glad to know that the issue is resolved and everything is up and running. We appreciate your time and effort that you have provided to get the issue fixed. Let us know if you got the help you needed by clicking‘Yes’ or ‘No’. As this will also help other people with similar issue in future.Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"date formatting without installing additional language pack        Hi,I have following problem:1. I need both US keyboard and Czech keyboard2. I prefer date formatting dd\/MM\/yyyy (UK format)When I install US and Czech language pack I can't choose dd\/MM\/yyyy date format. When I want this date format I must install UK language pack and then I have third keyboard which I don't want as I am swapping quite often between US and Czech and this makes one more swap for me.Is there any solution to this except installing other languages instead of US (Australian English, etc.)?Thanks.Regards,Zdenek","solutions":["Hi Zdenek You should be able to set a custom date format, regardless of the Languages installed on your PC . . .Open the old Control Panel (click your Start Button, then just type control and hit Enter) - these settings will not be accessible form the new Settings AppAt the top right of Control Pane, make sure View is set to icons Click the Region icon On the resulting dialog, click 'Additional Settings' Choose the Date Tab on the second Dialog On that tab, you can manually type your preferred Date format, you do not need to choose from the presets . .."]},{"symptom":"RDP connection disconnects        Hi,I use RDP to connect to a windows terminal server and for 5 years never had any issues until now. As of a few days my session cuts off and the window closes after a few minutes of having a successful connection. I restart the connection again and it just happens repeatedly. Other users are connecting to this same server with no issues and i have timed a couple times at 6.5 minutes and 8 min, so doesn't seem like a timer.If I use the windows 10 app route then the connection holds and doesn't have the same issue but I'm trying to avoid using it for other reasons (in the old RDP you are prompted with a window that gives you settings where on the Experience tab you can change performance settings and that is what I need in which I'm unable to locate on the windows 10 App) 1. how can I ensure old rdp does not TO? I did update video drivers2. how can I adjust performance settings for the windows 10 app? (choose connection speed, desktop background, font smoothing, desktop composition, show window contents when dragging, menu and window animation, visual styles)","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues with Remote Desktop disconnecting after a successful connection. However, for issues related to Remote Desktop, let me help to point you in the right direction. I would suggest you to post your query inTechNet Forums where you will find professionals with expertise on RDP for Windows 10 and that would be the appropriate forum. Meanwhile, you may also want to check the following links and see if it helps.Microsoft Remote Desktop APP Windows 10 - Timeout issueRemote Desktop application for Windows 10 Regards, Aditya RoyMicrosoft Community – Moderator"]}]}