{"windows":[{"symptom":"Windows 10 Clean Install Crashing        Issue:So I've just completed a custom computer rebuild and I booted my computer to make sure everything was fine. I ended up running updates just to protect the computer, but after a few updates the computer just shut down and rebooted. I thought it was normal since there was a motherboard, GPU, and RAM change, so I just went ahead and reinstalled Windows (also bought Windows 10 Pro key from the MS Store, since mine was ancient and wouldn't work anymore). I got through the install and setup Windows 10 and it was running for a while. I started updates again, and after a few moments the computer shut down again. When it rebooted this time it didn't even make it past the Windows initialization (the spinning dots). I let it fail to Automatic Repair and booted to safe mode, the computer was able to get into safe mode fine and is stable there about 80% of the time.TL:DR - Computer isn't stable in a Normal Windows environment, but is usually stable in Safe Mode.Troubleshooting:- I've reinstalled Windows multiple times- tried a DISM repair from a shared Windows folder from the computer I'm on right now- Ran checkdisk and sfc (chkdsk found errors and attempted a repair but didn't get back into Windows cleanly, sfc showed no issues)- adjusted CSM support from Legacy only to UEFI First in the UEFI for the motherboard (this makes an initial Windows 10 install more stable, but it still crashes)- Tested different RAM and GPUs (even though everything has been working fine in other computers)- Installed WIndows 10 to a different drive (NVMe to SATA 2.5\" SSD)- System is currently running Fedora 31 installed to the NVMe drive and the computer is stable there.- Disabled all non-Microsoft startup items and tried to boot into Windows 10 with only Microsoft startup items- Updated UEFI from version 0801 to 1301-ntbtlog file was showing NOT_LOADED components for the following (listing unique)-- BOOTLOG_NOT_LOADED @kdnic.inf,%kdnic.devicedesc%;Microsoft Kernel Debug Network Adapter-- BOOTLOG_NOT_LOADED @cpu.inf,%intelppm.devicedesc%;Intel Processor-- @oem3 Nvidia graphicsI don't have the bootlog file anymore since I used the flash drive for the Fedora installer, but I will gladly reinstall Windows on another drive I have to get this computer running with Windows 10. There may be others that were NOT LOADED in there, like dgx****.System components:Intel Core i7 6700KAsus ROG Maximus IX Extreme4x8GB G.Skill Trident Z Royal @ 3333 MHz (this is a 3600 MHz CL17 kit, but that XMP profile isn't working with my board)Gigabyte Nvidia GTX 980 ti Xtreme Gaming Waterforce256GB Samsung 950 Pro NVMe1TB Samsung 840 Evo (was disconnected during most Windows installs, also the other drive I tested to make sure it wasn't a drive issue)1TB Samsung 850 Evo (was disconnected during most Windows installs)Corsair AX1200i power supply9x Lian Li Bora Digital RGB fansThe rest is just a bunch of watercooling components like, Pump, reservoir, radiators and all the components to connect that to the CPU monoblock.The CPU is idling at ~25-30 C. There have been no leaks in the system, and I know this because I've been checking on it every couple hours that I'm home.Any help is greatly appreciated!(edited for additional troubleshooting performed)","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please create another installation media (Flash Drive) using the media creation tool. You may need to use another PC is this one is not booting.Go to the following page and download the media creation tool. Run the tool, insert a flash drive and create the installation media. https:\/\/www.microsoft.com\/en-in\/software-downlo...Use this installation media to perform a clean boot.","I've done that and it's still didn't work. I've used the Windows Media creation tool to create\/recreate USB media on 2 different USBs and created an ISO and used Rufus 3.8 to create a bootable USB. All result in the same behavior described above. I also downloaded the tool separately for each installation.","Here is the problem. Please do not use Rufus. Simply format the flash drive as FAT32. Mount the ISO. Simply select all contents and copy them to the flash drive. Restart the PC and boot it from the flash drive.","It doesn't matter. It was the last thing I tried for my Windows installation as a potential solution. I've installed Windows 6+ times from 3 different flash drives in the past 24 hours with 5 of those installations using the Windows media creation tool and every installation has had the same issue. I just tried it again using your India link download and the computer is still doing the same thing.","Hi,Does this by chance happen after, or while attempting to install Nvidia drivers ?There have been tons of issues with some of them lately..","Hi,Does this by chance happen after, or while attempting to install Nvidia drivers ?There have been tons of issues with some of them lately..It does seem to coincide with the Nvidia drivers. If I pause Windows update, I can usually install all of my motherboard drivers and reboot back into Windows without a problem. I've tried the last 2 WHQL drivers, but I haven't gone further back. Any suggestions for a working version?","Hi,Sorry... I don't.. I encountered a problem last year with a much older card and don't even have the machine hooked up anymore... I don't remember what driver version solved the problem and because of the age of the card it probably would not be usable with your card..I do remember reading about one of the optional features associated with the Nvida Driver package as being a potential source of the problem, but don't remember what it was.. All of my current cards are AMD..It seems to me that it may have been one of these, or both..  PhysX System Software or GeForce Experience....You might check out this link and see if anything might be useful..https:\/\/www.ghacks.net\/2017\/06\/30\/install-only-the-driver-for-nvidia-graphics-cards\/There is a tool called WindowsUpdate Show\\Hide that can be used to block installation of most updates..https:\/\/support.microsoft.com\/en-us\/help\/3183922\/how-to-temporarily-prevent-a-windows-update-from-reinstalling-in-windoIf you use this tool be sure to click \"Advanced\" button and uncheck \"Apply Repairs Automatically\" to avoid anything accidental being done...","Thanks for the info, at the least! I'll give it shot and see if I get it fixed.","Did you try Legacy Boot at BIOS?","Hi Arif,Yes I did try Legacy boot, as that’s what my motherboard defaulted to out of the box. I’m pretty sure its narrowed down to the Nvidia drivers at this point. At one point I was able to get Windows installed, Nvidia drivers installed (and updated) and Windows updated and the computer was working, until I added another User - then the computer crashed and Winload.efi corrupted. I tried restoring to a restore point and it crashed again, then tried again, but Windows wasn’t even detected on the C: drive for system restore to revert changes."]},{"symptom":"Desktop Icons will not execute        Some Icons on desktop and start menu will not execute when I click on them, i.e. games. calculator, etc","solutions":["Hi Dukey5, My name is Riccardo and I would be happy to assist today with this issue. This sounds like you may have a system file issue...There are a few things we can do to fix this issue for you... Step 1: Checking Integrity of File System \/ Updates Go to Start > type in cmd > right-click Command Prompt and run as administrator. Type in the following: sfc \/scannow Let the above process run and complete. After that is done, type in the following: dism \/online \/cleanup-image \/restorehealth Step 2: Do a Repair Upgrade If after doing all of the above, it is still not functioning properly, do a Windows 10 Repair Upgrade. Although your files should stay intact; we always suggest backing them up as a precaution.https:\/\/answers.microsoft.com\/en-us\/windows\/for...Let me know if this works for you as I will be here to assist with any further issues.","Thanks for your help.  When I did the scan I got this message: Windows  resource protection found corrupt files but was unable to fix some of them. For online repairs, details are included in the CBS log file  located at windir\\logs\/cvbs.log. When I did the:  dism \/online \/cleanup-image \/restorehealth I got a   error 87. The online\/cleanup-image\/restorehealth option is unknown.  At this point do I go ahead and do a Windows Repair upgrade. Thanks Dukey  ","Ricardo Thanks for your help.  When I did the scan I got this message: Windows resource protection found corrupt files but was unable to fix some of them. For online repairs, details are included in the CBS log file located at windir\\logs\/cvbs.log. When I did the:  dism \/online \/cleanup-image \/restorehealth I got a error 87. The online\/cleanup-image\/restorehealth option is unknown. At this point do I go ahead and do a Windows Repair upgrade. Thanks Dukey"]},{"symptom":"Can't print A3 from Epson WF 7710 with Windows 10        Trying to print on A3 through Windows 10 to Epson WF 7710. The option for A3 doesn't come up, only A4, Letter, Postcard and 2 other small sizes.I've installed the latest software from the Epson website, restarted both the printer and laptop. I can choose the A3 option from the printer paper preferences, but not on the laptop.Simple help please, I'm not very tech savvy. I expected an A3 printer to actually be able to print in A3 when I bought it...","solutions":[]},{"symptom":"bing rerouts searches, cut & paste of sent emails        Can no longer cut & paste email sends.  bing replaces info. with bing ads.  searches are rerouted politically.  I comprehend very little technically.  Google searches are also hacked.","solutions":[]},{"symptom":"Is Microsoft Windows 10 Pro 64-bit (OEM Software) the right package to replace win7 ulimate?        Is Microsoft Windows 10 Pro 64-bit (OEM Software) the right package to replace win7 ulimate?","solutions":["Is Microsoft Windows 10 Pro 64-bit (OEM Software) the right package to replace win7 ultimate?Is Microsoft Windows 10 Pro 64-bit (OEM Software) the right package to replace win7 ulimate?That is the correct path.OEM software is for a clean install, not upgrading.There is preinstalled OEM software on a Dell, HP, etc. device and there is OEM System Builders software.And you can not transfer OEM software licenses to a different device from what they were originally installed onWindows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.      Windows 10 HomeWindows 10 ProWindows 10 Pro EducationWindows 10 EducationWindows 10 EnterpriseWindows 10 MobileWindows 10 Mobile EnterpriseWindows 7Starter✔✔✔✔Home Basic✔✔✔✔Home Premium✔✔✔✔ProfessionalD✔✔✔✔UltimateD✔✔✔✔Enterprise✔✔"]},{"symptom":"Windows 10 update freezes at 48%        A popup says that support for the currently installed version of Windows 10 on my laptop will loose support in November and that I need to reboot my machine to upgrade to a new version.  I have tried to do this several times and each time it freezes at 48%.  I am finding that I am not even close to the only one having this issue.I am computer literate and could do what ever suggestions are out there, but this is not my problem, this is Microsoft's.  They need to make sure their software works before they thrust it on the general public.  This is totally unacceptable.How do I stop this popup from coming up until Microsoft actually makes their software work?","solutions":["Hi, Thank you for writing to Microsoft Community Forums. Every Windows version has a lifecycle. The lifecycle begins when an update is released and ends when it’s no longer supported. Before an update is going to expire, the user will be prompted, so that the user can update the version to the latest one. As you mentioned that you receive popup stating support will end in November, it could be possible that you are using Windows 10 1803 build, which was released on April 30, 2018 and the support for the version will end in November 12, 2019. However, we would like to know the version of Windows that is installed on the computer. To check type:winver in the search bar on the Taskbar and hitEnter. Since, the update freezes at 48%, there could be multiple reasons for it. We would like to know if you receive any error message\/code. You may want to refer the steps mentioned in the articleTroubleshoot problems updating Windows 10 and see if that helps. For additional information, you may refer the article Fix Windows Update errors.  Note: While performing chkdsk on the hard drive if any bad sectors are found on the hard drive when chkdsk tries to repair that sector if any data available on that might be lost Note: The last step in the above mentioned article talks about performing a clean installation of Windows.Please do not perform a clean installation of Windows. Let us know the results.  Regards,Nikhar KhareMicrosoft Community - Moderator","I have tried this several times and with the exception of a fresh install, have done all of the steps in the troubleshooter tech note.  Windows tries to update, and stops doing anything at 48%.  I even left the PC on overnight, but nothing happened.  Finally, I have to hold down the power button for several seconds to shutdown the machine.  When I start up again, Windows will revert back to build 1803.  Then Windows waits a few days and wants me to upgrade windows again to the latest build.  I am stuck in an endless loop. Jonathan","Hi Joanathan,Let us check the Installation log to find why the update failed. Please share the logs as mentioned in this article. You should use a File sharing service like Onedrive or Media Fire to upload files and share the link in the next reply.https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/troubleshoot-feature-update-install-failures\/eaf4ff24-64d6-4c72-824c-3ba3df716fc3The Panther logs. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\PantherThe Rollback logs: These usually are created if Windows Update rolls back. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\Rollback[Only if the error code is 0xC1900101-0x30018] The Device Install Log from C:\/$Windows.~bt\\Sources\\Rollback\\setupapi\\setupapi.dev.logAs the log size might be large consider zipping before uploading.","I tried everything, but the update still froze at 48%.Log files:  https:\/\/1drv.ms\/u\/s!AtMt2E_wOgswgSAmGdu2dKnGHYTa?e=OkPbW0","I'm having the 48% . Fed up with trying to sort it now. Why are these things made so difficult to do ?My version is 1803  17134.1184"]},{"symptom":"original product key not working        when I bought my laptop a few years ago,it had windows 8 on it then I upgraded to windows 10 free when the free windows 10 offered by microsoft still ongoing. After that, my laptop was incredibly slow and it was so hard to start simple programs and use them. It would take me 15 minutes for my laptop to start up and be functionable. I formatted my laptop using recovery disk and returned to windows and now working well. however windows is asking me to enter a product key because it's expiring soon.(I tried to enter my previous key but it told me to try another one)","solutions":[]},{"symptom":"Has Microsoft removed File Indexing (File Contents) for OneDrive in the latest release of Windows 10?        The OneDrive location is no longer visible or selectable from within File Indexing options. This seems like a deliberate choice as that folder can be seen by other apps and settings panels. I fear Microsoft has disabled this feature. Am I right?","solutions":[]},{"symptom":"Windows 10 update fails at 48 percent        Split from this thread.I've been having the 48% problem as well , i'm absolutely sick of tring every method i'm advised to do only for it not too work , i'm not particularly good on a PC but i can see it's also a problem for people far more adept on one than me .Why do they make these bloody updates so difficult to install ? Waste of my sodding time trying to figure this out !","solutions":["Hi,Try updating to 1909 using Media Creation tool and if it fails, share the logs.The fastest way to get the upgrade is through Media creation tool or ISO file.Please download Media Creation Tool from the link below and select Upgrade this PC at the first screen.https:\/\/go.microsoft.com\/fwlink\/?LinkId=691209All steps, including upgrading using ISO file and Media creation tool, are covered here:https:\/\/www.yourwindowsguide.com\/2019\/05\/update-windows-10-may-2019-update-manually.htmlContent on the above blog is written by a Microsoft MVP so it is safe.Meanwhile, if the update fails with MCT as well.Let us check the Installation log to find why the update failed. Please share the logs as mentioned in this article. You should use a File sharing service like Onedrive or Media Fire to upload files and share the link in the next reply.https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/troubleshoot-feature-update-install-failures\/eaf4ff24-64d6-4c72-824c-3ba3df716fc3The Panther logs. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\PantherThe Rollback logs: These usually are created if Windows Update rolls back. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\Rollback[Only if the error code is 0xC1900101-0x30018] The Device Install Log from C:\/$Windows.~bt\\Sources\\Rollback\\setupapi\\setupapi.dev.log"]},{"symptom":"Want to add Microsoft products to my website        Hello there I want to add Microsoft products on my website: Free Online Tools. But don't know about copyright. I want users to buy from my site and then I will return 70% to Microsoft and 30% mine","solutions":["Hi Saqib, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Please check out the FAQ: https:\/\/www.microsoftaffiliates.com\/en-US\/faqRemember, the terms are applicable for all websites. It isn't like it would be different for your website."]},{"symptom":"Windows Not Activated        I had my PC custom built for me and it already had windows 10 pro installed for me. The error message states that I can't activate windows because it can't connect to organization network.Did some more searching and found out that I have a partial product key and it's GVLK which to my understanding is not a genuine key. Now Since I already have windows 10 pro installed but not activated and I went and bought a key, can I do a fresh reinstall of windows 10 pro and activate it with the key I bought?","solutions":["Hi SnuggedBear You can if you wish clean install Windows 10 Pro and use your new licence key, however, there is no need to do that, if you wish, you can simply change the licence key on Windows 10 Pro, if you are happy with your current installationTo change the licence key, open the Settings App (gear icon on your Start Menu), go to Update and Security - Activation, then click 'Change Product Key' . . .","Hi SnuggedBear You can if you wish clean install Windows 10 Pro and use your new licence key, however, there is no need to do that, if you wish, you can simply change the licence key on Windows 10 Pro, if you are happy with your current installationTo change the licence key, open the Settings App (gear icon on your Start Menu), go to Update and Security - Activation, then click 'Change Product Key' . . .Oh! It was that simple?! I really hate seeing the watermark at the bottom right of my screen. So when I do change the product key that watermark should disappear? Will my files be okay since I'm not doing a fresh install? ","Hi SnuggedBear Yes, you can just change the Product Key, and Windows 10 will activate, rest assured, your files and Apps will remain untouched by this process . . .","Hi SnuggedBear Yes, you can just change the Product Key, and Windows 10 will activate, rest assured, your files and Apps will remain untouched by this process . . .Okay great! That really answered all my questions! Thanks!"]},{"symptom":"Certain Games Frame Skip Whenever A Key Is Pressed        It seems to only happen with a couple games I've tried on the Microsoft Store so far. I recently purchased the game pass so have been downloading games for my PC to try out.But for Halo and Dead by Daylight, I started up the game just fine and everything runs smoothly until I press any key on the keyboard or click the mouse, then the game freezes for about half a second then continues as normal, if I press a lot of keys in quick succession the game freezes for a much longer period of time.If I use a controller there is no issues and the game runs smoothly, but for games like Halo mouse and keyboard would be preferential. I've tried running as admin, lowering graphics (despite the graphics not being the issue, just in case there's something doing it), but can't seem to find any solution.Any help would be appreciated!","solutions":[]},{"symptom":"usb dvd-r drive not working, please help        Hi all,I am hoping that someone will be able to help me with a problem I am having.I bought a usb cd drive from amazon that states it works with windows 10, it is plug and play so there was no software cd provided.My pc recognises the drive and I can play audio cd's through the drive but when I put a blank dvd or audio disc in it will not recognise the disc, it says that Windows cannot recognise the disc and it may need to be formatted.Windows media player wont recognise the drive as a burner at all.I have checked the driver and it is up to date but on the event log it states that the drive has failed to migrate due to partial or ambiguous match.The full error is:Device USBSTOR\\CdRom&Ven_hp&Prod_DV-28S-V&Rev_A.0F\\313030313237323332303038&0 was not migrated due to partial or ambiguous match.Last Device Instance Id: IDE\\CdRomATAPI_iHAS124___B_______________________AL0S____\\5&E8041DD&0&1.1.0Class Guid: {4d36e965-e325-11ce-bfc1-08002be10318}Location Path: Migration Rank: 0xF000FE00E000F130Present: falseStatus: 0xC0000719I have tried changing the usb ports and they are all working fine.I cannot find a manufacturers website to search for a driver, the brand is cabletrans.If I cannot get it working I will return it to the seller but if I can get it working I would rather save myself the hassle.Any help would be greatly appreciated","solutions":["Hi mcginnstuart, You can try these suggested steps: Method 1: Check System Files If the system files have been corrupted, you can follow these steps to fix them. ① Search [cmd] in Windows. Then, right-click at the search result [Command Prompt] and select [Run as administrator].② In the window, type [sfc\/scannow] and press Enter to run this command. ③ It will take 15 to 45 minutes to scan the system. If any error is found in this process, the system will fix automatically.④ Reboot the computer and check whether the device can be recognized. --------------------------------------------------------------------------------------------------------------------------Method 2: Update Chipset Drivers If the Windows chipset drivers are outdated, the computer or the some parts will be faulty, and then the computer will have no capacity to recognize external devices. It is suggested that you log in the official web pages of the chipset suppliers and check whether the drivers should be updated. --------------------------------------------------------------------------------------------------------------------------Method 3: Uninstall and Reinstall Drivers Perhaps, the data transfer error is caused by the corrupted or incompatible drivers. It is not suggested that you update the drivers through the third-party software because the software can lead the device fail to be recognized.① Right-click at the Start menu and select [Device Manager]. ② Locate at the target device. Right-click at it and select [Uninstall device]. ③ Reboot the computer. During this process, the operating system will reinstall the driver. Finally, check whether the device can be recognized.Please let me know if you're able to fix the issue using these steps. Thanks and regards,","Hi Richard,Thanks for the response :)I have tried all of the above suggestions but unfortunately it is still not working.The scan did find corrupted files and fixed them but the problem still persists.My PC isn't new but I have recently done a completely new install of windows 10 after wiping the drives so it is a fresh PC.I don't know if you need this information but the set up is:Gigabyte ga-78mlt-usb3 r2 M\/boardAmd fx-6300 cpuNvidia gefore gtx 960 gpu120gb Intel ssd1tb Hitachi hdd16gb ram.The drive is recognised and shows as working normally through device manager but the event log still shows a failure to migrate. I have tried both usb 2 connectors on the front and both usb3 connectors on the rear, they are working as my keyboard and mouse both work with them.I will get my partners laptop and try the dvd-r drive on there and see if it works.Thanks","Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? I suspect the drive is only a CDROM judging by the information posted. Does the device have 2 lasers or 1?","Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? I suspect the drive is only a CDROM judging by the information posted. Does the device have 2 lasers or 1?HiThanks for the reply.I am running windows 10 pro version 1909.I tried the drive on a laptop as well with the same issue.It is listed as a dvd cd-r drive, stating that it can read DVDs and burn cds.I have contacted the seller and asked to return as I cannot find a solution to the problem, bit of a hassle but I have no use for it if it doesn't write cds.Thank you for taking the time to reply and offering assistance.","Where is it listed as a rw drive? If on the Amazon listing then it may be wrong. Is there a sticker on the drive? This would say whether the drive is a rw or not if there is.It may be the rw laser has failed. The device descriptor states CDROM, if so then it doesn’t write\/burn.","Where is it listed as a rw drive? If on the Amazon listing then it may be wrong. Is there a sticker on the drive? This would say whether the drive is a rw or not if there is.It may be the rw laser has failed. The device descriptor states CDROM, if so then it doesn’t write\/burn. Yes it is an Amazon listing, the front of the drive has the compact disc re writable logo and the dvd rom logo. The photo on Amazon shows a DVD-r logo which is obviously wrong as the listing states it is not. Even if the rw laser had failed then surely it would still read a blank cd? It does play audio but I have tried different blank audio and dvd cds and every time it stated that windows cannot read the disc and it may be corrupted or need formatting and the migration failed error is still there but when I connected to the laptop it wasn't but still wouldn't read a blank disc","The black drawer cover can be changed, I’ve done this myself when they’ve broke.No the RW laser will read & write those discs, the ROM laser will read standard discs once they’ve been finalised.If this is a private seller then they’re mis-selling the drives imo. If this is being sold by Amazon themselves then there should be no problem with returning the device."]},{"symptom":"Windows 10 Magnifier App on laptop with second screen        HiIs there a way to configure the Windows 10 Magnifier App to magnify 100% of the laptop's built in screen but to ignore the second screen connected to the laptop's VGA port.IE. I would like to set the Magnifier view to Full screen with inverted colours but only for laptop's built in screen.The Multiple display setting is currently set to 'Extend these displays'.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Well, as of now there is no option for for such settings. When you choose the option \"Full Screen\", it recognizes both screens and the settings is applied for both screens. (Extended and Duplicate)However, you may choose the Magnifier type. For example Lens and Docked. It will only show the Lens or Dock area in inverted colors in that case.","Thank you for your suggestions.Lens doesn't work as this follows the mouse pointer onto the second screen.Docked almost works but I cannot use the mouse pointer to click on anything in the magnified zone as the mouse pointer changes to  in the docked magnified zone."]},{"symptom":"Delete System Language        Hello There, I am Myself (wut do u mean xd) anyways, I have a problem about System Language, And I have to change system language to English (united states) but it says I can't delete System language, So anyone knows how to? ","solutions":["Hello, i'm Timon and i'm glad to help you. You might also change the region settings and delete the unwanted language. You will find further information here: https:\/\/www.windowscentral.com\/how-properly-cha...Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products).","It removes but not on the Lpksetup \/u --cmd command. It means I have to fully delete the language. Like (look at the picture down below) these are still korean and I have to remove.P.S I think Lpksetup \/u is fully removing the language. Also, I just updated to version 1903."]},{"symptom":"c:\\WINDOWS\\System32\\Logfiles\\Srt\\SrtTrail.txt.        Ola boa tardemeu notebook  i5 55008gb ram920m nvidiaEsta com o problema  de recuperação do sistema e dando sempre o mesmo problemac:\\WINDOWS\\System32\\Logfiles\\Srt\\SrtTrail.txt.Ja tentei de tudo mas tudo que eu faço ele acaba voltando nessa telaja reinstalei o windows umas 4 vezes e ele sempre volta ja fui no CMD usei os comandos     bootrec.exe \/rebuildbcd    bootrec.exe \/fixmbr    bootrec.exe \/fixbootmas ele fala que esses codigos sao restritos pro sistema ou alguma coisa assimOntem eu ele estava funcionando (travando um pouco) mas ele travou e deu tela azul( Critical process die) E VOLTAVA NA TELA DE RECUPERAÇÃO sempre dando o mesmo erro","solutions":["Saudações AugustoEleutério ! Sua postagem é muito bem vinda em nossa Comunidade Microsoft. Gostaria de sugerir as orientações e\/ou procedimentos de outro membro da comunidade no link a seguir para sua soluçãohttps:\/\/answers.microsoft.com\/pt-br\/windows\/for...Atenciosamente. Rubens Junqueira Consultor especialista independente e membro da Comunidade Microsoft"]},{"symptom":"file explorer view options        View layout options are not showing in file explorer. This means when looking at pictures I change the current selection, eg from large icon to extra large, or to details  to see when the photos were downloaded from my camera. How can I restore the layout options?","solutions":["Hi Anna At the top of Explorer, do you not see the View Ribbon, and if that is not expanded, if you double click that is should stay expandedAnother option, in Files Explorer is, navigate to a folder, then press Ctrl and scroll up or down, that will work the view through all options (List, Details, Small Icons, Large Icons . . etc.)"]},{"symptom":"File vanished from desktop        Hi,I was using a program file and it vanished from my desktop. there are shortcuts and evidence of its' existence but no file. I didn't delete it, I didn't move it on to another storage medium and it isn't a hidden file it just vanished and there is no auto save version of the file. Because the file is weeks of work I don't want want to restart the project all over again. Is there a hidden windows file it may have relocated itself to? I already searched the entire ssd and there was no sign of the file just shortcuts to the file.  ","solutions":["Hi,Thank you for writing to Microsoft Community Forums.I understand the situation as you are unable to find the file that was on the desktop folder. In order to get clarity and to assist you accordingly, please reply with the answers to the questions below.What is the Windows 10 version and Build installed? (Type winverin Windows search\/Run command)What is the app\/program that you were using to create\/edit the file?Are you aware of any changes on the PC, prior to this issue?Did you check if the file moved to recycle bin or is there any copy saved in OneDrive?We await your response.Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"Only Use Mouse Keys when Num Lock is on defaults to checked with every windows restart        As stated in the subject. I would like to have this permanently unchecked. Every time I restart the computer these setting goes back to the checked default.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please reset the Mouse driver and Uncheck the Default settings. Then restart the PC and check if the settings is saved permanently. Go to Device Manager. Locate \"Mice and Other Pointing Devices\" Double tap on it. Right click on the Touchpad Driver and select Uninstall (Do Not click on any check box)Restart the PC.","Hello Arif,Thanks for your reply. I tried what you suggested and uninstalled the mouse driver. On restart, the setting goes back to checked as always...","Okay, please try this registry fix. Press Start Type regedit and hit Enter Go to the following registry location HKEY_CURRENT_USER\\Control Panel\\Accessibility\\MouseKeys Find this string value: (REG_SZ) Modify the string value to 250 (250 = Disable)","Hi Arif,I have 4 entries in that registry path, all of them of the type REG_SZ:(Default):(value not set)Flags:131MaximumSpeed:68TimeToMaximumSpeed:3000Which one should I change to 250?Thanks!"]},{"symptom":"Bluetooth        I recently upgraded my Acer Aspire 57332-4633 from Windows 7 to Windows 10 used to have or so I thought Bluetooth but now I can't find it anywhere what do I do or how do I install something to be able to have Bluetooth","solutions":["Hi Christina If you previously had Bluetooth on that device, then the upgrade has most likely corrupted the Bluetooth driver, and possibly others as wellGo to the support page for your PC on the Acer website, then from there, download and install the Bluetooth driver they recommend . .If you have any difficulty locating that support page, what is the exact Model No. of your Acer Aspire, that will be printed on a sticker on the bottom casing . . ."]}]}