{"windows":[{"symptom":"How does a local account get associated with the Microsoft personal account used to sign in with?        Currently, when I sign in with my Microsoft account \"*** Email address is removed for privacy ***\" and do whoami I see that I am local user dave. Also when I run netplwiz I see that \"*** Email address is removed for privacy ***\" shows as local user dave along with the Full Name I setup for user dave.Unfortunately I created the local account dave right after setting up a new Windows 10 Pro system and did not check whoami or netplwiz before I setup that dave local account.My questions are 1) what would the default account be if no local account was setup and 2) when signing in with a Microsoft account, does Windows create a new local account using the portion of the email address before the @ character?So in general, how does signing in with a Microsoft account associate with a local account in order to support NTFS and other classic Windows permissions like file shares etc.Thanks, Dave","solutions":["Hi Dave. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.The two are entirely separate. This article explains the difference: https:\/\/www.digitalcitizen.life\/should-you-use-...There isn't anything you can't do in Sharing with a Local Account vs. a Microsoft Account, except that the MS account is an easier way to connect to OneDrive. But you can connect to OneDrive or any other app by signing into it individually with a Local Account.At any time you can switch from a Local Account to a MS account in Settings > Accounts > Your Info > Sign in with a Microsoft Account Instead, or vice versa.There is no other default account besides the one you set up when you install Windows (always an Admin acct, btw, which is wise) or set up a new PC that comes with Windows. It can be a Local or Microsoft Account. To set up a Local Account during install or Setup after Version 1909 disconnect from the internet to force the choice. I hope this helps. Feel free to ask back any questions and keep me posted. ________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Greg,I'm not wanting to understand the difference between local and Microsoft accounts. Please reread the questions, and try the whoami and netplwiz commands to understand what I am asking.What account does whoami show when you sign in with a Microsoft account?What account does netplwiz show underneath the Microsoft account?Microsoft accounts are kind of like a new veneer on top of the classic Windows permissions system.For me it shows my local account and its Full Name even though I logged in with my Microsoft personal account. Unfortunately it is too late to see what accounts those commands show had I not created that local account. I'm not sure how they got associated w\/ each other is my question.Also, I would argue the legacy\/classic accounts are properly called local accounts, not local offline accounts...who's offline anymore? And you can create the same local account (user\/pw) on multiple computers which helps workgroup file sharing work w\/o domains.Dave","Dave, perhaps I misunderstood your question which is not really clear. You asked what would the default account be if no local account was setup? The answer is that you must set up a Local Account or a Microsoft Account, there is no default account other than a built-in hidden Admin account used for emergencies.Under my MS account I see the Guest Account which is hidden. If netplwiz shows a Local Account for you in addition to a MS account then it means you created a Local Account. It doesn't create a Local account or anything else as default for a MS account.I don't know what you mean by offline account. You use your same account whether you're online or offline. You can go offline during Setup to force it to let you create a Local Account, which ability was removed in V.1909.I hope I made this clear. But if I am not understanding the question then please clarify.","Greg,I setup both a MSFT acct \"*** Email address is removed for privacy ***\" and a local account dave on a new Win10 Pro install.When I sign in using my MSFT acct -1) netplwiz shows administrator which I enabled, and my MSFT account. It does not show the local dave account that I also setup. When I double click the MSFT acct it shows the local acct \"underneath\".2) whoami however shows my local dave account.Did you try running the above two programs? What did you get?I am wondering 1) what would have happened if I never setup the local dave account and what would whoami say then? That acct is likely what is used for classic\/legacy permissions I should think but am not sure. And 2) is there a default account created to \"back\" the MSFT account under the covers if no local acct was setup? Does it somehow match a local acct using the first part of the email address in the MSFT acct if one was setup such? What would Users and Groups show after logging in with a MSFT acct had no local account been setup?I've done detailed complex software development on Windows in about every language since the very first release of Windows in 1985 but I did retire a couple years ago, and never dug into this new sign in system very deep, but now want to know how it works under the covers.Basically it seems quite the kludge underneath and I want to know how it works esp. in conjunction with the legacy permissions that are still there and still used. And don't get me started on the different types of Microsoft aka Personal, and Business aka Work or School accounts as I think only one MSFT type of account should have been created but that is a whole 'nother discussion...Thanks, DaveP.S. \"Under my MS account I see the Guest Account which is hidden\" - I don't know what you mean by this. How do you see it, if it is hidden? And what are you looking at where\/when you see it?","The built-in Admin should remain hidden except in emergencies. It should not be used as a regular operating account of any kind.WhoamI command shows my one and only account, but by an older name. It's not really that useful for Windows, meant for Linux mainly.","Greg,That would be quite the Catch-22 if by hidden you mean disabled since if I needed the account, I could not use it when disabled, and I needed it recently, and never use it as a \"regular\" account. There is no more risk to the Administrator proper than any other administrator account imo. In any event, not my concern here and my computers and accounts are well protected.So back to the subject, what does netplwiz show when you double click it? The same local account as whoami? Your Guest account? If so it seems that the whoami user is who you are really running as per the old Win32 framework. Not sure that it matters though depending on what all they did to support the MSFT sign ins which is what I'm trying to figure out.Humor me, and tell me -* what the name of the whoami user account?* what is the name of the underlying account of the MSFT account that netplwiz shows when double clicking?* does the local acct name shown by whoami and netplwiz match your email MSFT acct sign email in in any pattern or fashion? The only local account, only local enabled account etc.?* does the Local Users and Groups have that account as a user and is it enabled or disabled?* does the Group column that netplwiz shows for your MSFT account show the same groups that the whoami account belongs to in the Local Users and Groups?P.S. it was the article you referenced that called local accounts, local offline accounts, not me.Thanks, Dave","Whoami shows \"Dell\/Old\", a Local Account User name from a time when I briefly changed MS account to a Local Account, and then changed it back.Netplwiz shows MS Account User name. In Netplwiz, if I tick the box to force use of password, then doubleclick on the one existing User (MS) account, it shows the old User name and cannot be edited.\"Old\" name used briefly for User account doesn't have any relation at all to my MS Account email address.When accessing the User Profile as shown in Option One here: https:\/\/www.tenforums.com\/tutorials\/69127-delet... it shows a Default Profile and Dell\/Old which is the Local Account I'd briefly changed into from my only MS Account and then changed back. Netplwiz shows my one listed account as a member of Admin group. There is always confusion about Local Profile vs Local Account because they differ slightly, Shawn's tutorial above explains it somewhat but I try to stay away from it in forums because it quickly confuses visitors.","Thx Greg, I'll read that article.","keep me posted on your progress as I will be here to help until the case is resolved.","Greg, thanks for sticking with this. I'm going to re-stage my Win10 Pro system and do some experiments and will report back results. Given the time of the year it may be a bit before I finish.Happy Holidays!"]},{"symptom":"I my pc won’t restart        My pc wont reset to factory settings snd i have tried everything that has been advised! I cant load cmd with admin i cant get no where with the codes sent by microsoft help, start up repair doesnt work and im just ready to give up","solutions":["Hi, Criptek My name is Evelyn and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Windows. To activate the automatic repair mode, you must interrupt the normal boot process three or more consecutive times: use the reset or power button on your Windows 10 PC to stop it during startup, before you finish loading Windows 10. Yes use the power button, you may have to hold it down for at least 5 seconds to force the power off Then you proceed to repair the computer: With a restart, all your installed applications are lost, but you have the option to save your files if you wish. If there is an OEM system image, called a recovery partition, it also offers you the option to restore it. It would cause your PC to load to factory default settings. Go to the Troubleshooting section, again. Select Reset. If you choose to keep my files, your files will be preserved. You can also get the third option: restore factory settings, which is not applicable on the PC.After selecting the desired options, you will be presented with a confirmation, something like this: this indicates what you have chosen.Click Reset and the reset will begin. If after the previous steps you cannot recover Windows. You can repair Windows download the ISO: I recommend you borrow a PC to create a USB to repair Windows Microsoft Official Website to download and create Windows 10: https:\/\/www.microsoft.com\/en-us\/software-downlo...See here the correct way to recover your files when repairing Windows: https:\/\/www.backup-utility.com\/windows-10\/reins...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Why, again, is my one of my apps (photo app in this case) not working?        Hello,I am trying to trim a video. But, when I try to Save a copy it tells me that I do not have the permission to edit the file. The video isnot open in any other app. It also tells me to try to save a copy instead... Alright! I thought that Windows 10 and it's app were out their BETA phase...?Also, when typing this post, the app just closed itself. Great application.How long is it going to take to make a stable product?","solutions":[]},{"symptom":"my desktop computer will not wake up from update from windows 10        please tell me why after I updated windows 10 my desktop computer went to sleep ?  I can not wake it up !","solutions":["Hi Connie, please update BIOS and all drivers you'll fine on computer manufacturer's site."]},{"symptom":"I don't know what I am doing        I want to learn about Windows 7 and then Windows 10.My friend tried to help me to understand basic skills and I think I have got that down. She said that it might be better to do it this way or safer for me. IS THERE ANY BODY OUT THERE?.                                       Norren Radd","solutions":["I want to learn about Windows 7 and then Windows 10.Getting a copy of Windows 10 for Dummies might be a good idea. These books are written for beginners and have an excellent reputation.","I suggest going straight to Windows 10.There's no point learning Windows 7, it will be no longer supported as of this month [JAN 2020] and the system stuff that remains the same is just as easily learned on 10.Remember google is your friend, or Bing. There is a wealth of information available on the web (not all of it is good however).Avoid crappy 3rd-party software and especially maintenance optimizers, registry cleaners, and 3rd-party anti-virus.","@ Lambchops56Your question has been moved into a new thread.  It is here:  https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-security\/change-microsoft-account\/e46361d3-f652-41cb-9998-f3e5458cb385?tm=1578003364354","If you want to learn how to use either 7 or 10 read through these tutorials:https:\/\/www.sevenforums.com\/tutorials\/https:\/\/www.tenforums.com\/tutorials\/Cheers.","Thank you."]},{"symptom":"Forced to go to Edge        I am a slow adapter and trying to convert to Edge after getting pretty good at meeting my own needs with IE.Why can't I find the IP address for Edge's home page? I've read all about settings and options like custom home page but try as I will I can't get anywhere using About:home in the address search blank.Janell","solutions":["Hello JanellLarocque, thank you for providing this question. I am a seasoned Windows expert with almost a decade in usage and support experience and hope to resolve your problems quickly.Edge's home page can be found under this URL: https:\/\/www.msn.com\/spartan\/dhpEdges new tab page however has no IP address because it is a synthetic page generated out of your bookmarks \"top pages\" and news from msn.comIf i write about:home into my edge adress bar i get taken to the start page. If i open a new tab i get taken to the new tab page. If you write about:home but do not get taken there but somewhere else then you configured the start page to be different at some point.See how you can configure the start page here: support.microsoft.com\/help\/4027577\/windows-change-your-browser-home-page If you consider your problem solved it would be very good if you marked the answer which helped you so others can find and use this thread.If this didn't solve your problem or you need further assistance please answer in this thread and i would be happy to help.kind regards F. Grobusch","Use the link below and then look under Settings>Change your home page!https:\/\/support.microsoft.com\/en-us\/hub\/4337664\/microsoft-edge-helpIf you are just trying to open Edge click on Start and scroll down to the M's and look for Microsoft Edge.","There is no need to go to Edge. Besides Edge,  IE comes with Windows 10. Or, if you prefer you can use any of the available third-party browsers. As far as I'm concerned they are all better than either Edge or IE. My personal favorite is  FireFox, but you should use whatever  browser you prefer.","Thank you. I was not explicit enough. I use Spectrum for cable TV and Internet. For the last month they have been warning that IE is not a supported browser and we should choose something else.  Today I loaded what has been my home page at Spectrum and it was totally blank with IE however, it was populated when I used Edge to display it.  I've heard good things from family about Firefox and using it would allow me to confer with them on usage.  ","I have Spectrum too. While they provide my internet I choose the apps I want to use. For browsers I have Edge, IE, Firefox, SeaMonkey and Chrome. I mainly use Edge.I also own my own Modem and Router, I do not use theirs."]},{"symptom":"drive not showing up in devices        I have a HP Envy23 that has 2 drives but only one shows up in disk drive. it is a SDSA5dk-016GB-1006 and has no more space.There is another drive that has 1TB ST1000LM024 HN-M101MBB but I cannot get it to merge with the other one because it keeps disappearing in the disk management. I bought the computer in 2013 and WIN8 was installed and after a week I upgraded it to Win10.  All has been well till October-2019 when I kept getting Low Disk Space messages.      anyone have this happen to them???? thanks, Nancy","solutions":["Hi Nancy. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Does the HDD show up in device Manager under Disk Drives at all? If so right click to Uninstall, restart PC to reinstall it's driver.Please post a screenshot of Disk Management, which I read like a doctor reads X-rays. Follow the steps here so I can see everything needed to advise you:http:\/\/answers.microsoft.com\/en-us\/windows\/foru... If the drive is not detected in Explorer or Disk Mgmt, enter UEFI Setup by one of these methods:http:\/\/www.isunshare.com\/windows-password\/four-... to look for the drive under Storage or elsewhere, scouring all of the Tabs' settings. If it is not detected there then try reseating the drive more firmly in its port to get it detected. If it will not be detected then try slaving it to another PC to see if you can access the data, do a surface test with HDD diagnostics.If the drive is detected in Setup then Test the hard drive or SSD with diagnostics:https:\/\/www.lifewire.com\/free-hard-drive-testin...https:\/\/mashtips.com\/ssd-health-test-and-perfor...HP and Dell have hardware diagnostics triggered by tapping the ESC or F12 keys respectively as you power on.Best is to use the HDD\/SSD manufacturer's own if there is one, otherwise use Seatools bootable long test:http:\/\/blog.nowherelan.com\/2013\/04\/04\/boot-seat... Follow this up with a full Disk Check from the Command Prompt in Repair Mode or from bootable media:https:\/\/www.groovypost.com\/howto\/check-hard-dri... if necessary from the Command Prompt at boot:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... You wouldn't merge a data drive with a Windows drive. Instead keep your apps and programs on the Windows drive, sort your User files into their shell User folders and move those to the data drive since they suffer no speed loss from SSD>HDD while apps would. Here's how: http:\/\/www.dummies.com\/computers\/operating-syst...This way if Windows ever becomes irreparable you can restore C in 20 minutes from recovery media, and your files will be current and safe in their own separate partition. If they are left on C they will be dated from when the image was taken.The best free imaging app for saving the backup image externally is here: https:\/\/www.howtogeek.com\/howto\/7363\/macrium-re...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi greg, i am using windows10 .. disk is not showing up (attachment) and UEFI boot does not make sense.","The Disk Mgmt screenshot looks right except the 1tb hard drive is missing as you can see.The BIOS Boot menu key you gave looks correct but is not BIOS setup. Try these methods to get into BIOS setup to see if you can find any trace of the hard drive located under Storage drives:http:\/\/www.isunshare.com\/windows-password\/four-...If it cannot be found there or in Device Manager under Disk Drives (which step I gave earlier), then I'd carefully access it's port to try to get it reseated so it shows up. If not then I'd replace it.","Greg, I reseated the hard drive (or at least I think I did. is it the square on top right? so I left it in its cage but unhooked it then reinserted it.) Question:the black thumbdrive looking thing on the bottom right (what is that, and why does it still have plastic on it. is that my 16GB SSD????thanks for all your help, I am learning lots.... Nancy","The drive in picture does look like the HDD, you can tell for sure by googling the serial on it to see what it is. The USB adapter in the bottom right could be your network or bluetooth adapter. Doesn't look like the SSD. Do you see another drive bay?Once you reseated firmly the hard drive does it show up in UEFI Setup under Setup or in Device Manager under Disk Drives? If not then will it be detected by any of the hard drive testing tools? If not then I'd replace it.May I ask why you rated me unhelpful before I had a chance to reply?","Greg, of course you have been helpful , I must have done that by mistake... is there any way I can correct that??  as you must have realized by now I am a novice at this so the questions I ask must seem basic to you but I am just trying not to mess up.       so when you ask about another bay, isn't that another one on the left of the pic I sent you.  thanks,Nancy","No worries, Nancy. We just need to solve this as the marked Answer erases the bad rating.The left side of screenshot isn't clear it's another port from what I can see on my phone. I'll look on bigger screen when I get home. You can confirm the drive you reseated is HDD when you remove it by googling serial or model.Any sign of HDD in Device Mgr or BIOS\/UEFI Setup?","Greg , I shows up then goes away.  I just uninstalled it and restarted my computer. what do I do when it restarts. ","That's a Seagate Hard Drive. If you can get it recognized try running Seatools long test on it from my first post. You can run the Windows version from the SSD. If it can't be found I'd replace it. You know how now."]},{"symptom":"Change Microsoft Account        Split from this thread.My problem might be related to this. Keep in mind I am not a techie. Newly retired, one of the IT guys at my previous employer offered to set up my new laptop in order to transfer files from my work laptop and drives to my new HP laptop. Unfortunately, he misspelled my email. I have tried for hours to change the administrator. I finally created an email account using the misspelled email address, so I could at least recover the password! That worked, but I want to change the laptop admin name and change the MS account to a valid one. I do have MS accounts under another email, but when I try to use that one, I get a message that the email is not available. I know that because it is already mine! I'm so frustrated, I feel like I'm back in the office! Augggh! ","solutions":[]},{"symptom":"Upgrade Windows 7 to Windows 10        computer currently on windows 7....is it possible to upgrade to windows 10?[Original Title: Upgrade]","solutions":["You will need to purchase Windows 10 and then you could upgrade from Windows 7 to Windows 10.","Maybe. It depends on what hardware you have. Some of is probably compatible with Windows 10, but some may not be.You also may need Windows 10 divers for some of your hardware, and some of those may not be available.","You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700Cheers."]},{"symptom":"After Installation of Update KB890830: Desktop, Taskbar and Startbar load with a delay of 5 to 10 minutes.        Hello,After Installation of Update KB890830: Desktop, Taskbar and Startbar load with a delay of 5 to 10 minutes. Happens after each system start.The mouse cursor is still visible.The Task Manager can be called with the Keyboard shortcutsand i can start with it processes like Mozilla or games.Starting Explorer.exe does not work. Uninstall or reinstall of GPU Drivers did not helpUninstall of KB890830 does not work, Recover windows to the last working point works.Although there is lots of stuff on the system, it was formatted and reinstalled newly a couple of months ago.Any Idea how this can be fixed?Kind regardsSystem Specs:OS Name Microsoft Windows 10 Pro Version 1903Build Version    10.0.18362 Build 18362CPU   Intel(R) Core(TM) i7-4930K CPU @ 3.40GHz, 3401 MHz, 6 Kern(e), 12 logische(r) Prozessor(en)Mainboard   ASUSTeK COMPUTER INC  RAMPAGE IV FORMULARAM    32,0 GBGPU 2 x AMD Radeon RX 480OS on SSD 77 GB Free","solutions":["Hello, FriendlyGuy2k,What is the make\/model of the computer?Which anti-virus software are you using?Have you checked Event Viewer?What third-party utilities have you installed on the system? It may be necessary to uninstall some or all of these utilities. 1. Try booting into Safe Mode with NetworkingStart > Type msconfigClick on Boot TabSelect Safe BootSelect NetworkingClick Apply, OkReboot and Windows will load into Safe Mode with Networking.Does the system load faster using this method?When finished booting into Safe Mode with Networking for testing purposes, go back to Msconfig > Boot Tab and Uncheck Safe Boot. Click Apply, Ok Reboot and Windows will load normally.If the issue persists using this method it could be attributed to a third-party utility.2. Try Clean Boot procedure to determine what may be causing the issue.https:\/\/support.microsoft.com\/en-us\/help\/929135\/how-to-perform-a-clean-boot-in-windowsEdit: I'd forgotten to mention you might also try going to Msconfig > Microsoft Services and disable App Readiness. You should boot faster.If you find this solution causes issues with Windows Updates, go to Services.msc.Change App Readiness startup to Manual"]},{"symptom":"I need to close my msn e-mail account permanently - please advise        I need to close my msn e-mail account permanently - please advise","solutions":["Read though this:https:\/\/support.microsoft.com\/en-au\/help\/12412\/microsoft-account-how-to-close-account"]},{"symptom":"Windows 10, System Time Dizzles Away, System time synchronized with the hardware clock Seen in Log        Hello,The OS is Windows 10.  The PC is NOT connected to any network, no LAN, no Internet.  However, the system time is still moving away.  There are \"System time synchronized with the hardware clock\" messages seen in the event log every now and then, which could be related to why the system time is going incorrect.The Windows PC is a Zotac PC, used for industrial control purposes, and there is no LAN connections available, not to mention Internet access.  In such a configuration, it's hard to imagine the OS could try to sync with any time server or anything, but it's just making itself wrong.The event log in both text format and .evtx are available upon request.Please help find out what could be the root cause and help with a resolution.Thanks,Charles","solutions":["Have you considered replacing the onboard CMOS\/RTC battery of that hardware? If that battery is failing, it can be reporting and updating the incorrect time\/date to the OS.","Hi Flee, how significant it time change in each event? Do you turn off your pc for the night? If yes, please verify system (bios) time after the night."]},{"symptom":"Surface Pro will not start        My local sign in pin OR password no longer work.   Error message:  Incorrect passwordI was connecting the Surface Pro to my TV when this happened.  The mouse quit working at the same time.What can I do to remedy this?","solutions":["Hi, IanLeask1 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to enter the safe mode with the network function to repair, it may be that the network controller is outdated.Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. As soon as you see the Windows logo with the rotating dots, press and hold the power button until the computer turns off. Do this process twice..-Turn on your computer for the third time, and let it load. .-You should receive this message: Preparing Automatic Repair. After entering Mode Update the network driver may be outdated","Will try... Thanks","Glad to Help!"]},{"symptom":"Windows 10 1607 update to 1903 fail        My girlfriends kid brought his old computer from his dads house to ours..Problem is that they've never heard of windows update or computer management ever, so when we tried to reinstall windows to reset is it to new it failed doing so after trying multiple solutions.. So we dropped it since it was his old computer anyways...Now he complains that his computer keeps restarting for no reason, and I found out that it's because it's trying to update windows which is now running version 1607, and it wants to update to 1903.It starts to update and reboots a few times after which it says that it goes back to the old version again. And so it goes again and again if you try to update it...His father gave him this computer, and I don't know how or where they got this Windows, but when I try to alter different things on his computer, it sometimes say that I dont have permission because of some kind of group policy..Anyone know how to fix any of this, reinstalling windows or getting the updates?And what about installing a new windows.. Could I use the same as I'm using on my own computer?","solutions":["Hi, SørenHansen4 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.If you have problems updating Windows, follow these steps: If you have a third-party antivirus, you must disable or uninstall it. Try reset Windows update components: Right click on the start button and select Powershell (admin) or Command Prompt (admin)Write the next hit enter after each line. net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Restart and try again. You can also download the Windows Error Solver: https:\/\/support.microsoft.com\/en-us\/help\/10164\/...https:\/\/aka.ms\/wudiag You can do it manually by downloading the Windows ISO. When updating with the ISO, disconnect the Internet. https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"Windows 10 LAN network connection - one computer can't see one other computer        We are a small office with a LAN peer to peer network.  All computers are running Windows 10 Pro.  Suddenly, one computer is unable to see one other computer.  Computer #2 is able to see Computer #1.  All other office computers are able to see Computer #2 (and Computer #1).  Computer #1 is able to see all the other network computers.  Rebooting both computers did not help.  Both computers are up to date with updates.  This is a new problem, Computer #1 was able to see Computer #2 just fine before the holidays.  A search for Computer #2 by name does not find it.  Troubleshooter did not find any issues. We need to resolve this.  I'm running out of ideas! ","solutions":["Hi BeckyBR, My name is Riccardo and I would be happy to assist today. Sometimes the network sharing \/ discovery module decides to shut itself off. If this is one computer, what I suggest is just checking if this is enabled:Go to Start > type in Control Panel > go to Network and Sharing Center On the left click Advanced Sharing Center Turn on network discovery if it is clicked to off. Let me know if this assists."]},{"symptom":"suspicious apps        a suspicious app shows up on my pc; looks like a virus","solutions":["Hello! I am an Independent Advisor, I would love to help you out! What is the app? Could you provide more details? Could you upload a screenshot? Where do you see the app? Does it open, or what does it do if anything?"]},{"symptom":"Display is TOO big        Am I the only person with this problem??  I've hunted everywhere!I recently got a new computer with Windows 10.  I also got a new monitor.The monitor I got is a 32\" very wide screen. I don't know if my issue is due to the screen or W10.I've adjusted my size to as low as it will go (100%).Everything is so big, it's giving me a headache.I guess I just assumed there should be options for below 100%.When getting a bigger screen, my goal wasn't to have larger data.It was to have the same size data, but more of it in front of me!!!Any ideas???Thanks!!","solutions":["Hi UFCWjess Find the native resolution of that new monitor from the manufacturers website Right click your Desktop and choose Display Settings Is the resolution set on that page the same as the native resolution of your monitor?If so, because the resolution is correct and you have the Scale factor set to 100% it will not be possible to reduce the size of objects on your screen, because you would need a screen with a higher resolution setting to do that . . .","DaveM121,Thanks for your help.My resolution is set to the highest with (Recommended) next to it.I assume that's what you are referring to.I'm afraid this might just be a case of a **** monitor.Ugh!Thanks anyway!!"]},{"symptom":"MICROSOFT ACCT NUMBER        I HAVE LOST MY MICROSOFT ACCOUNT NUMBER HOW CAN I GET ANOTHER I CANT GET INTO MY EMAIL.","solutions":["Hi, Microsoft Accounts don't have Account Numbers only the email address associated with the account and the password are required to login. If you can't remember your email or password you can recover them from the sign in page at account.microsoft.com > Sign-in options > forgot my username. For your password enter your email then choose \"forgot your password?\".I hope that helps."]},{"symptom":"Why did microsoft remove my wifi?        when Microsoft did updates it removed my wireless wifi , Why and how can I get it back?","solutions":["Hi RitaLewis1,if in Device management> network adapters, your wi-fi adapter is present, select it, go to the Driver tab> Roll back driver.","when Microsoft did updates it removed my wireless wifi , Why and how can I get it back?You have posted to the Windows 8 forums.There are no updates for Windows 8.Support for 8, including updates, ended in Jan 2016.What operating system do you have installed?Which Windows operating system am I running? - Windows Help"]},{"symptom":"Task Bar Orientation        I was trying to print  a document and some how I can the orientation on my home screen instead and having trouble getting it to the correct orientation. My task bars are now on the right an left side of my home screen","solutions":["Great news Cyndy.","Hello Cyndy,The tutorial below can help show you how to move the taskbar back to the location you want instead.https:\/\/www.tenforums.com\/tutorials\/57280-change-taskbar-location-screen-windows-10-a.html"]}]}