{"windows":[{"symptom":"VIDEO CARD DRIVER DOESN'T SUPPORT AERO EFFECTS.        VIDEO CARD DRIVER DOESN'T SUPPORT AERO EFFECTS.","solutions":["VIDEO CARD DRIVER DOESN'T SUPPORT AERO EFFECTS. If it doesn't support it, it doesn't support it.We can't do anything about that.You get the drivers from your computer\/laptop manufacturer's website if Windows 7 came preinstalled on the manufacturers supplied hardware, or from the graphics card manufacturer's website.Cheers."]},{"symptom":"VLSC for Windows 10        HellloI have an open license with Microsoft VLSC for Windows 10 but can't find it when I sign in.  I apparently have two microsoft accounts but can't find it on either one.***Modified title from: techsoup download ***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query regarding Microsoft VLSC for Windows 10.  You have reached the Windows Consumer level support. As you are having a Volume License for Windows 10, I would suggest you to get in touch with theMicrosoft Volume Licensing team and they will help you with all the details. For more information, see How to contact the Microsoft Volume Licensing Service Center. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Gears 5 won't open. Re-directs to \"Gaming Services\"App        After successfully playing Gears 5 through the Windows Store (with Game Pass subscription) for a number of days, the game stopped launching. When trying to launch it, I am redirected to a Windows Store page for \"Gaming Services\", something it says I already have installed. This is true if I try to launch the game from the start menu, or from the store page for Gears 5 itself. Trying to launch Gears 5 from my list of \"Installed\" apps on the Windows Store does nothing. I have tried resetting the app a number of times, in addition to signing out and back into my windows store account associated with the game pass subscription. One snag I may be causing here is that my primary PC account is different from my Xbox Live \/ Windows Store account I am using to play. I have not however seen any postings similar to this issue online after many searches, and I'm unsure how to address this issue if thats the case. Thank you!","solutions":["Gaming Services, literally just had an update, try have a look on the pc windows 10 store to see if you can download the update. I do not have this issue, but thought i'd let you know https:\/\/i.imgur.com\/z6EPySk.png","Had the exact same problem, and this fixed it for me:Update windows with all patches, then...Reinstall the gaming services using the following steps:Launch powershell as an administrator and enter “get-appxpackage Microsoft.GamingServices | remove-AppxPackage -allusers”In the same powershell window, enter “start ms-windows-store:\/\/pdp\/?productid=9MWPM2CQNLHN”Install the app on that page, including accepting the UAC prompt when shown. Try launching the game again. Re-install the game if necessary.","Any update?? I'm having the same problem.","Did you try my suggestion above?As said, it fixed it for me.","thanks for your comment, you solve my problem m8","I tried this and it worked but the next day when i tried to launch the game the exact same thing happened","I have the same problem and it's January 2nd 2020. Furthermore, I can't even reinstall XBox Gaming Service. It just hangs on the install. My XBox Game Pass expires in 4 days. I've been trying to play Gears 5 and finish it before my pass expires, but haven't been able to even start the game. Does anyone have a solution for this?"]},{"symptom":"old model labtop        I have Asus X54HY laptop if I update for win 10 I will get an issue on the driver because it doesn't have any driver to support win10.what is your suggestion to my model which OS for me best?","solutions":["Stay with Windows 7.That's all Asus supports on that Model Number.Look under \"Please select OS\": https:\/\/www.asus.com\/Laptops\/X54HY\/HelpDesk_Download\/@@@@@@@@@@@@@@@@@@@@@@@@@@@If you're looking for information for home users, see Windows 7 support will end on January 14, 2020.With end of support Microsoft is not telling you that your operating systems won't work.What they are saying is that after a certain date they will no longer support them.Whether they still work or not with particular programs is up to the particular program manufacturers.Example: Google Chrome is no longer supported for security updates in XP or Vista by Google and Mozilla Firefox is following the same path.What this basically means with Microsoft no longer supporting an operating system is that even though hackers may find \"holes\" and vulnerabilities to be able to access the operating systems and cause security problems, Microsoft will no longer be monitoring or rectifying those problems by way of Security Updates each month.You are on your own in regards to maintaining the Security of your operating systems.What does it mean if Windows isn't supported?____________________________________________________This will show you when support (Mainstream and Extended Support) for the various operating systems ends.Windows lifecycle fact sheet - Windows Help - Microsoft SupportAnd these FAQs show you how Microsoft arrived at the Support Lifecycle Policy:Microsoft Lifecycle Policy FAQhttps:\/\/support.microsoft.com\/en-au\/help\/17140\/lifecycle-faq-general-policy-questions@@@@@@@@@@@@@@@@@@@@@@@"]},{"symptom":"Unable to install KB4530684 tried 10 times ?        i have a brand new HP OMEN plugged it in a few windows updates where ready to install so i went ahead and clicked update now all good except for KB4530684  it keeps saying as the customer above points out gets to 30% and says cannot complete then uninstalls the 30% and back to square one. i have tried this 10 times? i should not have to try and sort this on a new £3000 computer.HP have apologized and said Microsoft will send out a fix to resolve it.I would say it is not right to say to customers with no advanced computer skills click this run this sequence of events do this then try that? why can,t Microsoft sort it they sold windows 10? they know customers are having problems they must have the expertise to sort it out....many thanks,","solutions":["Run the troubleshooter, select Settings > Update and security select Troubleshoot and then Windows Update. Run through the process and then restart using Start > Power > Restart, no matter what the result.See if that helps.","Hi BENQAV and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that might help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Run the troubleshooter, select Settings > Update and security select Troubleshoot and then Windows Update. Run through the process and then restart using Start > Power > Restart, no matter what the result.See if that helps.Hi neilpzz  i tried that no joy still stops at 30% then says could not complete undoing changes,,,many thanks anyway","Hi BENQAV and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that might help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! tried this no joy...many thanks.Open an elevated command prompt. To do this, right click the Windows button, and then select Command Prompt (Admin). If you are prompted for an administrator password or for a confirmation, type the password, or click Allow or Yes.Type the following command, and then press Enter.DISM.exe \/Online \/Cleanup-image \/RestorehealthNote It might take several minutes for the command operation to be completed.Type the following command and press Enter.sfc \/scannowNote It might take several minutes for the command operation to be completed.Close the command prompt, and then run Windows Update again.","Try the download catalogue from Microsofthttps:\/\/www.catalog.update.microsoft.com\/Search.aspx?q=KB4530684 make sure you download the update relevant to your system. Once downloaded the run it from your download location.","Hi BENQAV, The link I send you is not about SFC and DISM. Have you tried these steps? Open administrative Command Prompt and type following commands one-by-one followed by Enter key.net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Full details are in this thread please read. https:\/\/answers.microsoft.com\/en-us\/windows\/for...Thanks.","Try the download catalogue from Microsofthttps:\/\/www.catalog.update.microsoft.com\/Search.aspx?q=KB4530684 make sure you download the update relevant to your system. Once downloaded the run it from your download location.No joy with the update catalog, downloaded the right x64 based update, it said installing..(done) restart your computer got to 30% then said could not complete this update undoing this installation do not turn off your computer the same as all the other now 16 attempts? This is mad for a company to sell you something and then get us to sort out there failings.Still the value of Microsoft went up to some 800 billion this year?.that what you get with a  monopoly....Many thanks as always.","I was going to suggest the system file scans but I see you may have already tried them, here they are anyway.Method 1: Run DISM tool and check the issue. Please follow these steps:a. Press Windows + X keys and click command prompt (admin). Or PowerShell (Admin).b. Type the following command in command prompt and press Enter.DISM.exe \/Online \/Cleanup-image \/Scanhealthafter the scan is complete type the following and press EnterDISM.exe \/Online \/Cleanup-image \/Restorehealththen use method 2.Method 2: System file checker is a utility in Windows that allows users to scan for corruptions in Windows system files and restore corrupted files.Run system file checker (SFC) and see if it helps. Please follow these steps:a. Press Windows + X keys and click command prompt (admin). Or PowerShell (Admin).b. Type the following command in command prompt and press Enter.sfc \/scannowAfter completing the scans restart using Start > Power > Restart.More extensive than what I saw listed previously. If that doesn't find anything then try a clean boothttps:\/\/support.microsoft.com\/en-gb\/help\/929135\/how-to-perform-a-clean-boot-in-windows then run the catalogue download again.","I was going to suggest the system file scans but I see you may have already tried them, here they are anyway.Method 1: Run DISM tool and check the issue. Please follow these steps:a. Press Windows + X keys and click command prompt (admin). Or PowerShell (Admin).b. Type the following command in command prompt and press Enter.DISM.exe \/Online \/Cleanup-image \/Scanhealthafter the scan is complete type the following and press EnterDISM.exe \/Online \/Cleanup-image \/Restorehealththen use method 2.Method 2: System file checker is a utility in Windows that allows users to scan for corruptions in Windows system files and restore corrupted files.Run system file checker (SFC) and see if it helps. Please follow these steps:a. Press Windows + X keys and click command prompt (admin). Or PowerShell (Admin).b. Type the following command in command prompt and press Enter.sfc \/scannowAfter completing the scans restart using Start > Power > Restart.More extensive than what I saw listed previously. If that doesn't find anything then try a clean boothttps:\/\/support.microsoft.com\/en-gb\/help\/929135\/how-to-perform-a-clean-boot-in-windows then run the catalogue download again.Hi the girl from HP is going to ring me i will get her to sort it i have done scannow and DISM  no joy  i am right in what i say if it was a brand new car and the garage said do that try this if not try the other you would take it back or if it was a brand new TV you would take it back. There are thousands of people with windows problems they just dont care.Why should you pay for something brand new and fix it yourself?many thanks as always","I hope they can help, if you don't mind let us know how it goes. They are after all your support as they supplied windows with the device."]},{"symptom":"Windows activate        I have 2 new product keys for Windows 10 pro and both are not working, No cd to install. I have tried and tried.I can't get on the internet as the licence had expired while I was away. I have found an Error code: 0xC004F074,I have no idea what I am doing wrong here?I did have Windows 8 but upgraded to Windows 10 when it was free to do so.","solutions":["Retail and OEM Licenses do not expire.But Volume Licenses have to be re-activated on a regular basis, but Volume Licenses are not for private use..Run this Command to see what type of license you have; also applies to 8.1:https:\/\/www.tenforums.com\/tutorials\/49586-determine-if-windows-license-type-oem-retail-volume.htmlGet help with Windows activation errors:https:\/\/support.microsoft.com\/en-au\/help\/10738\/windows-10-get-help-with-activation-errorsApplies to: Windows 10 Windows 7 Windows 8.1@@@@@@@@@@@@@@@@@@@@@@@@@Here is what your error code means:0x8007232B, 0xC004F074, 0xC004F038, 0x8007007BYou might see this error if you entered a product key for the Enterprise edition of Windows to activateWindows 10 Home or Windows 10 Pro. Try entering a product key that matches the edition of Windows on your device.Or, you might see this error if you're trying to activate your work device but aren't connected to your workplace's network. If you're connected to your work network and still see this error, you might need to change the network settings. Contact your organization's support person for more info. If your organization doesn't have a support person, you might need to enter your product key again:More information required as to what type of license 8 was and what the new keys were supposedly for.Warning:You do not buy a Product Key by itself, as they are normally stolen\/pirated, Volume Licenses which are not for private use, or MSDN keys which are not to be sold by the original subscription holder.Make sure that you buy the complete sealed package (DVD, license) https:\/\/www.microsoft.com\/en-us\/howtotell\/Shop.aspx Read Section: Beware of Product Keys sold separately.","Hi Bill,Thank you for your Answer.After trying everything you said to do, I found out I have Volume Licenses (now it has expired and can't get on anything).  plus it shows Windows 8.1 when I did upgrade to Windows 10 while it was free,Don't know what to do here ?","You used the free upgrade, so reinstall 10.The same edition that you got with the free upgrade is what you now reinstall.Read the parts I bolded and underlined.The free upgrade to 10 is yours for the life of that device.The best method to upgrade back to 10 is to clean install it.Use the Windows 10 media creation tool on the Software download page \"Start fresh with a clean installation of Windows 10\"https:\/\/www.microsoft.com\/en-us\/software-download\/windows10startfreshReinstall Windows 10:https:\/\/support.microsoft.com\/en-us\/help\/4000735\/windows-10-reinstall\"How to Clean Install Windows 10\"http:\/\/www.tenforums.com\/tutorials\/1950-windows-10-clean-install.html_______________________________________________How to Create Bootable USB Flash Drive to Install Windows 10 fromThis tutorial will show you how to create a bootable USB flash drive that can be used to installWindows 10 with or without UEFI.________________________________________________To access BIOS\/UEFI - UEFI\/EFI configuration:https:\/\/neosmart.net\/wiki\/boot-usb-drive\/_____________________________________When your free upgrade to 10 was  originally activated Microsoft will have kept the Hardware Configuration details of your device on their Servers for recognition purposes if you have to reinstall 10.\"Activation in Windows 10\" (Digital entitlement)https:\/\/support.microsoft.com\/en-au\/help\/12440\/windows-10-activationCheers."]},{"symptom":"PLease Help im not an experienced computer guy , but i know there is big problem        IM kep being asked to update my windows 10 to latest whatever .. i generaly go ahead after reading few little headlines , so whent ahead and did this big update .. once it finished and rebooted the system looked at the new install and said need to reverse all the updating just done ..man it ook long time iv had to go throught this over ten times because ever hour pop up comes up and sais you need to install latest upgrade so iv just been pushing the one hour more button so i can get through movie or work whtever ..the results are predictable you must have some safegaurd for people like myself who dont mess around with thier pc much just basic functions so i havent done anything to create this madness please help me and i will not trust that remote access pc to pc as iv no idea who u are ,please u must understand my predicament . Thank you Mark Hancher","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as you are unable to install the Windows update.In order to get clarity and to assist you accordingly, please reply with the answers to the questions below.What is the Windows 10 version and Build installed? (Type winver in Windows search\/Run command)What is the make and model of the PC?What is the error you are getting after the installation fails?What is the KB number that is failing to install? Meanwhile, we would suggest you to follow these steps and troubleshoot on Windows updates.Press Windows Key and type CMD then right click on CMD and selectRun as Administrator from the menu.Stop the BITS, Cryptographic, Windows Installer and the Windows Update Services. Type the following commands at a command prompt. Press the “ENTER” key after each command.net stop wuauservnet stop cryptSvcnet stop bitsnet stop msiserverNow rename the SoftwareDistribution and Catroot2 folder. You can do this by typing the following commands in the Command Prompt. Press the “ENTER” key after each command.ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldren C:\\Windows\\System32\\catroot2 Catroot2.oldRestart the PC and then restart the BITS, Cryptographic,Windows Installer and Windows Update Services. Type the following commands in the Command Prompt for this. Press theENTER key after you type each command. net start wuauservnet start cryptSvcnet start bitsnet start msiserver5.    Type Exit in the Command Prompt to close it.6.    Then check for Windows updates  Let us know how it goes. Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"clickfree deleting files        The problem I have is that the same  photos  have been saved on clickfree multiple times. I've tried to delete them, both leaving the tick in and taking the tick out, on the deletion process. However all it does is to create more and more copies .Is there a way to properly delete these  so I end up with just one copy of each photo?My model no is C2N. Is there a more up to date version of clickfree.","solutions":["The company that made Clickfree, Storage Appliance Corporation, doesn't appear to be around anymore. The most recent mentions of then I could find were from about 2008 and the most recent posting in their Twitter feed is 2013. The clickfree.com website doesn't have any mention of the Clickfree backup product. I don't think you're going to find any newer versions.","Clickfree is not active anymore. I would suggest you to check if you can delete the images by pressing the Del key of your keyboard."]},{"symptom":"Microsoft store won't install anything        This is all started when I tried to install games on the Xbox app with game pass pc. Every time I would start an install it would say preparing and then after a few minutes give me the error 0x80080005. I had tried a number of solutions to fix this, none of them working. Eventually one person had said they luck by simply reinstalling the app. I tried this and now the app itself won't install at all. Went to Microsoft store to see if i could install it there and i'm greeted to 30 apps trying to install but all stuck on pending, none of them starting. Once again i have gone through pretty much every solution posted. These include messing with services, power shell, command prompt, clearing the cache and resetting the app. I have game pass ultimate and I am on Windows 10 version 1909. Just to check it definitely a Microsoft problem, I installed a steam game perfectly fine. How can it be so hard to download an app and some games, seriously?","solutions":["Hi Erin. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.There's a specific issue now with Game Pass installs that's solved here: https:\/\/www.reddit.com\/r\/theouterworlds\/comment...I'll give you everything possible to repair the store. Even if you've tried a step please do it over in this sequence. If any steps cannot be performed then report it and move on to the next:1) Try updating Store apps: https:\/\/support.microsoft.com\/en-us\/help\/402625... 2) Make sure you have the latest Windows 10 version 1909 in Settings > System > About and if not skip to Step 10 to install it by the most stable method.3) See if the fixes here help: https:\/\/www.pcworld.com\/article\/3053099\/windows... 4) Try running the Windows Store apps Troubleshooter at Settings > Update & Security > Troubleshoot.5) Try resetting the Store cache: http:\/\/www.thewindowsclub.com\/reset-windows-sto... 6) If that fails go to Settings>Apps and highlight Microsoft Store, choose Advanced Settings, then Reset. After it resets, restart PC.7) If that fails then reinstall Store. Type CMD in Start Search, right click Command Prompt result to Run as Administrator, copy the following code and paste it into the box using the Edit tools from Box's top left dropdown menu, press Enter:PowerShell -ExecutionPolicy Unrestricted -Command \"& {$manifest = (Get-AppxPackage *WindowsStore*).InstallLocation + '\\AppxManifest.xml' ; Add-AppxPackage -DisableDevelopmentMode -Register $manifest}\"8) Clear the LocalCache Folder: Open Run by pressing the Windows key + R hotkey. Copy and paste %localappdata% in Run and click OK. Open Packages> Microsoft.WindowsStore_8wekyb3d8bbwe > LocalCache folder. Press the Ctrl + A hotkey to select all content within the LocalCache folder. Press the Delete button. 9) If these all fail then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account because of the serious and persistent problem with corrupted accounts. Then continue with the other steps to go over your install most thoroughly.10) If nothing else works then do a Repair Install, by installing Media Creation Tool and then choosing to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Repeatedly Netwtw06.sys failure        The stop code error message is PAGE_FAULT_IN_NONPAGED_AREA and shows the Netwtw06.sys failure message.It keeps crashing every 10-15 mins and shows this error, I checked other forum threads and their answers did not help.","solutions":["Hi, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.We need log files(called dump files) that tell us what lead to crash. Please share them with us for a better analysis of the problem. Instructions can be found here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Please let us know if you need any assistance about posting dump files.","https:\/\/1drv.ms\/u\/s!Ag3h7g-cHdJGnysc9NS1zqwO5Tm0?e=4Jj8k2","Hi, As expected related to Intel WiFi driver. km:av_invalid_netwtw06!prvmvmmanagertimeeventresponsehandler You should download an older version of the driver from the manufacturer website and remove the existing one. It should resolve the issue.Remove the driver completely: https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"shut down option        In the menu only 2 options namely 1) shut down and 2) restart are available. the other option \" sleep \" not available. how to get it","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.I’ve linked to a article which gives steps on how to enable this: https:\/\/www.isumsoft.com\/windows-10\/fix-sleep-o...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"\"Program not responding\" tracker?        I work with a program that frequently reports \"Program not Responding\" for a few minutes and then seems to \"snap out of it\". I would like to track how much of my day is spent looking at a frozen program.Is there any way to track how much time a program spend unresponsive? Thank you in advance for any help.","solutions":["Hi Daniel-sån i am sorry, there would be no way to calculate how much of your day is taken up by that application being in an unresponsive state . . .May i ask what is the software package are you experiencing this difficulty with?","Hi Dave, Thank you for responding. Due to the fact that this program is created by my own company and i would prefer not to divulge my place of work, i cannot say what software i am having trouble with, I'm sorry.What i can say is that i have been trying to convince my superiors that our software needs a rework to improve efficiency by showing some data on all the time wasted. A tool that automatically logged the unresponsive status of the program would allow me to quantify how much they spend per year for me to wait around while the software loads.Do you have any idea how i might accomplish this, short of having a stopwatch at my desk that i manually start\/stop? Thank you,Dan","Hi Daniel-sån Windows does not log non-responsive applications and there is no utility on the market, that I know of can access or track that information, sorry . . ."]},{"symptom":"No bluetooth driver in device manager        I tried to turn Bluetooth on and off and then the switch icon was no longer there I looked in device manager even under hidden devices but there is no Bluetooth icons anywhere.","solutions":["Hi Justin,I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Are there any devices listed under unknown devices?What is the make and model of the computer?","I tried to turn Bluetooth on and off and then the switch icon was no longer there I looked in device manager even under hidden devices but there is no Bluetooth icons anywhere.Hi Macumber,Reopen your computer, Enter the device manager when the Bluetooth icon appears.Click on Bluetooth, then select the network card. For me, I choose\"Intel(R) Wireless Bluetooth (R)\". Then you set properties for it.Close \"Allow the computer to turn off this device to save power\" in power management.Also, you'd better close up the quick launch","No there are no Bluetooth devices listed anymore i Forgot them all hoping it would somehow reaolve the problem how do I find model #?","There is no bluetooth in device manager anymore","Go to device manager ---> Universal Serial Bus controllers --->Unknow USB device(Port Reset Failed)Right click to disable it, and then enable it. Besides, check the drivers. Keep it to the latest version J","Hello,See if this fix helps you:https:\/\/www.kapilarya.com\/bluetooth-missing-in-device-manager-for-windows-10Hope this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP. ","Right click Start>Run. Type in msinfo32 and press enter. Take the snip of the System summary and post in the next reply. Get a Screenshot and paste back in next reply: https:\/\/answers.microsoft.com\/en-us\/windows\/wik..."]},{"symptom":"When installing new chipset drivers windows 10 is incompatible.        When I try to install new chipset drivers for my Asus Prime X470-Pro mobo it says my windows is not compatible. The error is, \"Does not support this Operating System: WNT_10.0H_64\".My version of windows is, \"Version 1909 (OS Build 18363.535)\"Any ideas on how to fix?","solutions":["Hi Lord, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.The drivers may have not passed quality checks if you are trying to do it from Intel's website(certain mobo manufacturers make customizations to the board).Is it the case?","ASUS only supports the 64-bit version of Windows 10 on that motherboard.If you have the 64-bit version of Windows 10, and you're having trouble installing Version 19.30.28 of the chipset driver, only ASUS technical support can help you."]},{"symptom":"Dell Latitude 7400 with 3 external monitors - 3rd monitor not active        Hi, I normally don't post anything because it seems like every question out there is asked and answered, but I've been searching on this topic and can't find anything that solves my problem.  - I have a Latitude 7400 and Dell WD19 docking station, running Windows 10 x64, with Intel Corei7 vPro 8th Gen- I have two Acer  K222HQL (DVI-D) and an HP 22m (HDMI) monitors that I'm trying to connect together with my laptop LCD for a total of 4 concurrent displays. The problem is that the HP 22m (HDMI) isn't active and I didn't find a configuration to have 4 monitors working together as shown in the picture below.  Does anybody have a clue on how would should I set it up to have 4 displays working together?PS: I had this same configuration and it was working perfectly when using the old graphic driver in an older Dell laptop. I've figured out that Intel® Graphics Settings option is no longer available when using Windows DCH Graphics drivers. I had this in my older laptop.Thanks all","solutions":["Hi Anderson, You might want to clarify your concern here in this article: https:\/\/www.dell.com\/support\/article\/ph\/en\/phbs...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Hi, thanks for your reply.I saw this article, and this is how I had in my old set up, but unfortunately, I don't have Intel® Graphics Settings control panel which is no longer available when usingWindows DCH Graphics drivers.Once again thanks!","Hi Anderson, I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.Based on your CPU, you are using Intel UHD Graphics 620. According to specifications, it will only support up to 3 displays (including built-in Display).https:\/\/www.intel.sg\/content\/www\/xa\/en\/support\/...The following is a list of supported configurations. You can find that HDMI + DVI + DVI combination is unsupported.https:\/\/www.intel.sg\/content\/www\/xa\/en\/support\/...Let me know if I can help you further! Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"BSOD DRIVER_VERIFIER_DETECTED_VIOLATION What failed: iocbios2.sys        I followed the instructions in the two links below and came up with some minidump files. BSOD happens about every 48-72 hours. I'm not overclocking anything. I purchased this HP Omen refurbed and swapped out brand new 32gb RAM and 1tb SSD. It looks like the problem is probably a driver in the SSD. I did do a full windows reset (keeping files) but the problem persists. https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-update\/driver-verifier-tracking-down-a-mis-behaving\/f5cb4faf-556b-4b6d-95b3-c48669e4c983https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-update\/bsod-finding-and-fixing-them\/1939df35-283f-4830-a4dd-e95ee5d8669dRelevant files:https:\/\/www.dropbox.com\/sh\/xc5sx468fbg5q31\/AADqnoWKq0s0DjHzo8-PIs1ja?dl=0Thanks for the help.","solutions":["Hi VCR23, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.It appears that Kaspersky is causing the crash as klif,sys is being named. You may uninstall it and use Windows Security in its place.Secondly the verifier blamed driver iocbios2.sys is from Intel Overclocking utility. Are you overclocking? If Kaspersky uninstallation doesn't help revert back to defaults.Technical Information: *** WARNING: Unable to verify timestamp for klif.sys klif+0x47fa0","Super duper not overclocking, unless the machine came that way. It was a refurb from HP and came with Win 10 installed, fresh.Should I also uninstall all Intel software from Add\/Remove and then Windows Update?Thanks so much for the quick reply and Happy Holidays!","Unless the crashes were before Kaspersky was installed you may do the same. Otherwise, there isn't a need. Let us know how that goes,Happy Holidays to you too!","Ok, crash happened again even after verifier refresh and Kaspersky uninstall. Here's what I found from Event Viewer:The computer has rebooted from a bugcheck.  The bugcheck was: 0x0000007e (0xffffffffc0000005, 0xfffff8053513f321, 0xffffef8dfb7699c8, 0xffffa101aa0df930). A dump was saved in: C:\\WINDOWS\\MEMORY.DMP. Report Id: fcbbb495-8729-4d91-8559-3fde0953800e.Anything else I can pull for you to address this issue?","Ok, crash happened again even after verifier refresh and Kaspersky uninstall. Here's what I found from Event Viewer:The computer has rebooted from a bugcheck.  The bugcheck was: 0x0000007e (0xffffffffc0000005, 0xfffff8053513f321, 0xffffef8dfb7699c8, 0xffffa101aa0df930). A dump was saved in: C:\\WINDOWS\\MEMORY.DMP. Report Id: fcbbb495-8729-4d91-8559-3fde0953800e.Anything else I can pull for you to address this issue?here are a couple of new dump files createdhttps:\/\/www.dropbox.com\/sh\/48d1ip12ifde5u4\/AADjChNKsp83xoIHjU7F4yKNa?dl=0","Hi, it keeps happening! Here's another DMP file. Is it the same occurrence?https:\/\/www.dropbox.com\/s\/oaf9r9z8dgpqtdq\/010120-14734-01.dmp?dl=0"]},{"symptom":"Contents of documents folders        How can I rearrange the order of the files in a folder?","solutions":["How can I rearrange the order of the files in a folder? You can click View, then Sort by."]},{"symptom":"Printer off line        How do I turn my computer on so that it will print anything.  The que has 4 documents, but says;  \"Printer off line\".  How do I get it On Line??","solutions":["Hi GeorgeMasters1, You can try running the printer troubleshooter to identify the issue or try clearing the print queue and restarting the print spooler service. Please see link below for further reference in troubleshooting printer issues.https:\/\/support.microsoft.com\/en-ph\/help\/401540...https:\/\/support.microsoft.com\/en-ph\/help\/449687...","Have you done an update since installing the computer?  If so you can try by reinstalling the printer.Also;What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK  What printer?","Thanks.  I haver my old computer and it prints fine.  I had the GEEK Squad come and download the drivers on a hard USB connection, so it should be there.   It just is off line.  Wondering if there is just a 'setting' for turning it on line in printers and devices or somewhere?    Thanks again.","Hello.   Thanks for trying here.  I had ther Best Buy Geek Squad come and do a hard download of the computer to the printer via USB cable.  It just says 'Off Line\".  I'm thinking, in my little brain, I just need to take the printer \"On-Line'.   Is there a setting for getting it on line?","Hi GeorgeMasters1, You can try steps below and see if it can change the status to online. 1. Open Windows Settings 2. Navigate to Devices > Printers and Scanners 3. Select the printer of which you want to change the status, and then click on Open queue4. In the Print Queue window, click on Printer Offline. It will display a message saying, “This action will change the printer from offline to online.”5. Confirm, and the status of the printer will be set to online. Below is the link for your reference. https:\/\/www.thewindowsclub.com\/change-printer-s...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","How do I turn my computer on so that it will print anything.  The que has 4 documents, but says;  \"Printer off line\".  How do I get it On Line??Hello,Please refer: https:\/\/support.microsoft.com\/en-in\/help\/4027988\/windows-10-change-a-printers-status-from-offline-to-onlineHope this helps!","How do I turn my computer on so that it will print anything ...Just re-install the printer. It takes less time to do that than it takes to figure out what caused your printer to go offline, particularly since printers can go offline for many different reasons.'Offline' means that the printer is no longer on your network. Installing the printer puts it back on your network. There's no 'switch' to press that puts an offline printer back on the network."]},{"symptom":"Microsoft App Store Xfinity        When will Microsoft make the Comcast Xfinity app available in the app store?","solutions":["Hi JeffH7, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.Unfortunately we are not sure when the app is scheduled to be released, however, have you tried logging in throughhttps:\/\/tv.xfinity.com\/ ? This appears to be the current method to log in from a Windows computer.It looks like the app has not been available for a couple of years already, and Comcast may be able to provide more information on a potential release date, if there is even an app under development.According to the following post from January 2017, a Comcast employee states there was no current plan to develop a Windows 10 XFINITY TV application. However, this is now 3 years ago!Source: https:\/\/forums.xfinity.com\/t5\/Stream-TV-App\/Xfi... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","When will Microsoft make the Comcast Xfinity app available in the app store?The correct question to ask is: When will Comcast make an Xfinity app for the Microsoft Store?Microsoft can't make an app for Xfinity - only Comcast can do that."]},{"symptom":"delete        how to delete everything on a old laptop","solutions":["First I need to know what you plan to do with the laptop.  Different answers depending on the answers.For example:  destroy it, give it to a friend, donate it, it does not work any more","Reinstall the operating system.During that process you can delete the existing Windows 7 partition and make a new partition to reinstall it on._______________________________________Or if you just want to wipe everything from the Hard Drive, including the operating system:Use this: Data Removal: Darik's Boot and Nuke - DBANHow to Erase a Hard Drive Using DBAN@@@@@@@@@@@@@@@@@@@@@@@@@@How to reinstall:If it came preinstalled:Here are the Key\/s to press at Boot to reinstall the operating system (new condition). Under each Manufacturer in the list below are the instructions in the respective links for you to follow on how to use their Recovery PartitionAcer – Press Left Alt + F10 Keys.http:\/\/acer.custhelp.com\/app\/answers\/detail\/a_id\/2631Advent – Tap F10 until Starting System Recovery appearshttps:\/\/answers.yahoo.com\/question\/index?qid=20081221054701AAJT8YVAsus – Press F9http:\/\/support.asus.com\/Troubleshooting\/detail.aspx?SLanguage=en&m=X53E&os=&no=1775Dell – Press F8 which will bring up Advanced Boot OptionsHow to restore a Windows 7 Factory Image on your Dell PC | Dell USDell Alienware:What is and How to use AlienRespawneMachines: Press Left Alt Key + F10http:\/\/techchannel.radioshack.com\/emachines-system-recovery-1747.htmlFujitsu – Press F8https:\/\/forum.ts.fujitsu.com\/forum\/viewtopic.php?f=64&t=39428http:\/\/support.ts.fujitsu.com\/WDB\/FAQContentstart.asp?ID=233412526&WDBStatID=&INFO=SA&quest=&Sprache=en&SprachID=&SecID=&lng=COM&Todo=FAQGateway: Press Alt + F10 Keys - As Acer owns them: press Left Alt + F10 Keys as per Acer eRecoveryhttp:\/\/www.ehow.com\/how_6960920_restore-computer-using-recovery-partitiion.htmlHP – Press F11 repeatedlyhttp:\/\/support.hp.com\/us-en\/document\/c01867418#AbT3Lenovo – Press F11http:\/\/support.lenovo.com\/en_US\/detail.page?LegacyDocID=MIGR-4M7HWZLG – Press F11https:\/\/answers.yahoo.com\/question\/index?qid=20090304161820AAiyvMnPackard Bell: Press and hold the ALT key while pressing repeatedly the F10 key. Release the keys when a message displays that Windows is loading files.http:\/\/packard-bell-scandic.custhelp.com\/app\/answers\/detail\/a_id\/3068\/session\/L2F2LzEvdGltZS8xNDA2MjgyMjczL3NpZC90Z205SDktbA%3D%3D\/~\/use-packard-bell-recovery-management-to-restore-your-system-or-create-recoverySamsung – Press F4http:\/\/www.samsung.com\/us\/support\/howtoguide\/N0000137\/6375\/93514Sony Vaio – Tap F10 until the Edit Boot Options screen is displayedhttps:\/\/ca.en.kb.sony.com\/app\/answers\/detail\/a_id\/35585\/p\/48903,49902,71663,71664\/c\/65,67\/kw\/recovery%20using%20f10Toshiba – Press 0 (zero)http:\/\/forums.toshiba.com\/t5\/System-Recovery-and-Recovery\/How-To-Perform-system-recovery-Windows-7\/ta-p\/279643@@@@@@@@@@@@@@@@@@@@@@@@@And if you do have a Manufacturer's Recovery Partition on your Hard Drive and you can Boot into Windows, you should be able to make and have your own Recovery Disks from it to reinstall the Operating System in case of Hard Drive failure.Look under Programs > your Computer Manufacturer's name > then their System Tools or Recovery Software Headings for them, depending how it is worded.If you can not find any reference to it, contact the Manufacturer for advice on how to make those Recovery Disks.@@@@@@@@@@@@@@@@@@@@@@@@@You can borrow the exact same edition of Windows 7 Retail DVD and use your Product Key on the COA sticker to reinstall the operating system.@@@@@@@@@@@@@@@@@@@@@@@@@Or you can use this for preinstalled OEM or Retail Licenses. This is on a first come, first served monthly basis.Download the correct ISO file and make your own disk and use the Product Key that is on the COA Sticker. This is on a first come, first served weekly basis.https:\/\/www.heidoc.net\/joomla\/technology-science\/microsoft\/67-microsoft-windows-and-office-iso-download-toolDownload: Windows ISO Downloader.exeAnd here are instructions on how to burn ISO images to disk:http:\/\/www.snapfiles.com\/get\/ISORecorder.htmlYou change the Boot Order in the BIOS to be able to boot from your installation media:How to Boot Your Computer From a Disc or USB DriveHow to access Boot Menu:https:\/\/neosmart.net\/wiki\/boot-usb-drive\/Then do a clean install:http:\/\/www.sevenforums.com\/tutorials\/1649-clean-install-windows-7-a.htmlThe COA sticker is either on the underside of the Laptop or in the Battery Compartment.With a Desktop it is either on the side, rear or top of the Computer Case.Using the downloaded ISO file Method may require phone Activation.It may require that you use phone Activation.\"How to Activate Windows 7 by Phone\"http:\/\/www.sevenforums.com\/tutorials\/18715-activate-windows-7-phone.htmlThe above method also will require you to go to your Computer Manufacturer's website > Support and Downloads Section > locate your Model Number and Operating System > then download and install the latest Drivers for it. ________________________________________________Using the USB method in conjunction with the above Windows 7 download:http:\/\/www.sevenforums.com\/tutorials\/2432-usb-windows-7-installation-key-drive-create.html\"How to Get and Use the Windows 7 USB\/DVD Download Tool\"http:\/\/www.sevenforums.com\/tutorials\/31541-windows-7-usb-dvd-download-tool.html________________________________________________And this is very good and easy to use:Rufus - Create bootable USB drives the easy wayCheers.","how to delete everything on a old laptop Depends on what you want to do.Some other ideas depending on its age and type of Hard Drive.You could also remove the Hard Drive.Put the old Hard Drive in a Hard Drive Caddy and use it for backups or storage.","how to delete everything on a old laptop Hello,You can reinstall or make clean install of the operating system by formatting the drive.Regards."]}]}