{"windows":[{"symptom":"A look at running older versions of Microsoft Office on Windows 10        Technical Level : Basic SummaryBill Gates once said you could purchase a license for a version of any software from Microsoft and never have to purchase another version. It is the responsibility of the company to make newer releases more enticing by adding further value through improved features and functionality. Microsoft Office has been one of the company's biggest successes. For more than 20 years, the company has released new revisions with unique features that make it an enticing upgrade. At the same time, there are users who fall in love with a revision and never decide to upgrade again, simply because that version is good enough.Since Microsoft announced the launch of Windows 10, a lot of persons are asking, if the license for the version of Microsoft Office they own will work on the new version of Windows. In this article, we'll find out.DetailsUpdate: Microsoft recently updated the requirements for running Microsoft Office on the Windows 10. Starting with Windows 10, version 10 1607 or later, Office 2007 is no longer certified compatible. This does not mean you can't run Office 2007 on Windows 10; as evidenced by the fact that versions as old as Office 95 still work on Windows 10, you should still be able to install and use it. It is possible future updates and revisions to Windows 10 might break the suite or functionality might no longer work. Source: Which versions of Office work with Windows 10? - Microsoft OfficeWhich versions of Microsoft Office are officially supported Windows 10?The following versions of Microsoft Office with the latest Service Packs have been confirmed to be compatible with Windows 10:Office 2019 or Office 365 subscriptionsOffice 2016Office 2013Office 2010 (exception Office Starter 2010)Older versions of Office such as Office 2007, Office 2003 and Office XP are not certified compatible with Windows 10 but might work with or without compatibility mode.Please be aware that Office Starter 2010 is not supported. You will be prompted to remove it before the upgrade starts.Is Office included for free with Windows 10?No, desktop Office 2016\/Office 365 or any prior version will not be free. Microsoft Office Team has developed a special touch optimized version of Microsoft Office for Tablets running Windows 10. This will be a free limited functionality version gear towards basic editing in Tablet mode. It lacks many of the capabilities of desktop Office. You can download it from the store.UPDATE: The Touch Optimized versions of office Learn more:The next chapter of Office on Windows - Office BlogsWhat about older versions of the suite though, such as Office 2000, Office XP (2002) and Office 2003?Recently I came across an article by noted Windows extraordinaire Paul Thurrott discussing a recent Twitter tease fromGabe Aul (Engineering General Manager for Data and Fundamentals team in Microsoft's Operating Systems Group) showing a vintage version of the suite; Office for Windows 95 running on Windows 10. I thought this was interesting to know that 20 year old software runs just fine on the latest version of Windows. Talk about bringing your investments forward!Word for Windows 95 running on Windows 10 - sourcehereWith a volume of questions on the Windows 10 Reservation forum asking whether their Office 2000, 2003 or XP version is compatible; I decided to do so some test for users who would like to know. So, I went in the garage and looked for those exact copies to try them out on Windows 10. Based on Gabe Aul's screenshot, we can pretty much confirm Office 95 and Office 97 will likely run. If I have the time, I will update this article and give those versions a try at a later date.SetupAll three versions started setup nicely with exception for Office 2000 setup which presented an error message during the install:Error 1904. Module C:\\Program Files (x86)\\Common Files(System\\OLE DB\\MSOLAP.DLL failed to register. HRESULT -2148024714 Contact yoru support support personnel.Running Office setup for 2000, XP and 2003 on Windows 10I promptly clicked Ignore a couple times and setup completed successfully. Later versions such as Office XP and Office 2003 never gave any problems. Please note, I did not make any modifications to setup such as compatibility mode, they all ran and installed without any problem.All three versions installed successfullyTesting Office programsAll apps with the exception of Outlook ran great on Windows 10. I was able to open, create and save documents in all versions of apps such as Word, Excel, PowerPoint, Access and Publisher.Outlook was the only problematic app in the suite.Outlook 2000 required using compatibility mode to run properly, it kept crashing each time I launched it. So thats something to keep in mind. Oulook 2002 never gave any problems at all and ran successfully without any modifications. Outlook 2003 was another story, I tried compatibility mode and it seem to make it worse. So, if you depend on Outlook, you should consider upgrading to a later version such as Outlook 2007 or 2013.Office 2000Office XP (2002)Office 2003Publisher versions 2000, 2002 and 2003Publisher 98Installation:You will get the following error regarding the custom dictionary when you launch Publisher 98. Apart from that, it works and functions just fine:There you have it, Publisher 98 running on Windows 10 November Update without issue and no need for compatibility mode:ConclusionThis was not a thorough test, apps like FrontPage or OneNote were not evaluated. Core apps such as Word, Excel, PowerPoint, Access and Publisher work just fine on Windows 10. By the way, I used Windows 10 64 bit, so users won't have to worry about compatibility issues with this architecture. It remains to be seen if future updates to Windows might break the suite. I will say, I used the RTM versions of each suite. So, I would recommend users of these versions make sure the latest Service Packs, updates and security updates are applied. Keep in mind, Microsoft no longer supports these older versions of the suite, so you weigh the risk of running such versions. Apart from the Office Assistant displaying a rose pink box; there should be no problems running older versions of Office on Windows 10. Happy computing!","solutions":["The most enduring feature of Ms Office 2000 is the short cut bar. To me it was and is simply the fastest way to find and load my most commonly used applications whether within the office umbrella or not - much better than any other method lnvolving File Explorer, a start menu or  even a desktop icon. It worked fine on Windows 8.1 but something has happened with it's ability to show icons and open the corresponding  link files in Windows 10. I think is is something related to file and folder ownership? I am working on rectifying it and I can just about get by with a right click and  click on \"open\". However, the speed and ease of use advantage is lost - a real shame!  ","Thank you Mr Da Costa. This is an informative write up and it does give confidence to users like me who still use old Office.","My Office 2003 works after the Windows 10 download, but each of my documents come in as read-only.  When I go to properties, there is no check in the read-only box and the box is gray.  I had backed up all of my documents onto an external hard drive.  These backups can be pulled up by my Office 2003 and I can edit them and save them back to the external hard-drive.  If I try to save the edited copy to my c drive document folder, I get a message that I cannot save it because it is a read-only file.  I even tried changing the name, so that I would be saving it as a new document.  It still gives me the same message.  This is incredibly inconventient.  Can something be done about it?","The most enduring feature of Ms Office 2000 is the short cut bar. To me it was and is simply the fastest way to find and load my most commonly used applications whether within the office umbrella or not - much better than any other method lnvolving File Explorer, a start menu or  even a desktop icon. It worked fine on Windows 8.1 but something has happened with it's ability to show icons and open the corresponding  link files in Windows 10. I think is is something related to file and folder ownership? I am working on rectifying it and I can just about get by with a right click and  click on \"open\". However, the speed and ease of use advantage is lost - a real shame!  I also have this problem. Did you find a solution?","I loaded the Windows 10 and now I have lost use of my MSOffice97 suite.(word, excel, access, power point, etc.).  I am bummed as I can no longer open any of my saved data.  I wish I had known that would happen before agreeing to down load Windows 10.","According to all Microsoft information I've seen, you have 30 days to revert to your prior version of Windows.","Try partitioning your main hard drive so that you have C and D  drives; then try saving your documents to the D drive.","No not yet to the MS short cut bar issue directly. However, I can get FreeBar_0.9.2.7 to run on Win 10 that  does the same task in almost the same way. (So far Freebar is only working in a horizontal way rather than as the MS shortcut bar worked before win 10 as a vertical display and hide column on the right edge. Maybe I can tweak FreeBar a bit further yet?","What are the security risks of running office 2003 on windows 10 given that Microsoft has stopped issuing patches for quite some time now?","I am running office 2007 and my concern is with my outlook. I have a ton of messages and attachments in there, will this all still be there after the win 10 upgrade ? I cant lose any of it !HELP !!!!"]},{"symptom":"Slow Internet Speed on Windows 10 1809        Dear Community,I am getting a very slow speed internet after updating to 1809.I raised the issue Microsoft but have heard from them, it's been more than 45 days.I am on 100 Mbps plan, I am getting the speed on my mobile phone but on my laptop, I am getting max download speed of 5 Mbps and upload around 30 Mbps.I have tried updating the driver but it says I am on latest version.Please, help.Best,H","solutions":["Hello, Please run Network Adapter troubleshooter from Settings app > Update & security > Troubleshoot. Let us know what it reports back.Regards.","Hi, My name is Angel. I am an Independent Advisor. Thank you for posting in Microsoft Community.1. Close the Peer to Peer Update Process on Your PC to Fix Slow Internet after Windows 10 UpdateShut down the peer to peer update process on your PC. That is to say, you need to close the channel which you can download applications and system updates from other PC’s connected to the server since it limits your internet bandwidth seeding to other users.Step 1. Click Start menu and then type Settings to open it. Step 2. Select “Update and Security“. Step 3. Click the “Advanced Options” tab. Step 4. Click the option “Choose How Updates are Delivered\". Step 5. Turn off the On button. 2. Adjust the Internet Bandwidth Settings Since windows 10, by default, reserves 20% of the internet bandwidth for the system applications and its operating system, you can’t browse or surf on the internet with 100% internet connection. This solution speeds up the dropping internet speed by trimming down the bandwidth which is reserved for Windows 10 and system applications. Follow the step-by-step guide to tackle slow internet after Windows 10 Update.Step 1. Press Windows shortcut keys Win + R to open Run dialog box. Step 2. Type gpedit.msc and then hit OK. Step 3. Give permissions. A pop-up window will open with title of Group Policy. Step 4. Click on Computer Configuration on the right side of the window. Step 5. Navigate to: Administrative Templates -> Network – > Qos Packet Scheduler – > Limit reservable bandwidth.Step 6. Click on Enable. Step 7. Change the Value from 20 to 0. Step 8. Apply and then click OK. 3. Disable Window Auto-Tuning Window Auto-Tuning which is enabled by default improves performance for programs by receiving TCP data over a network. Slower internet speed after Windows 10 Update could hit your computer when Window Auto-Tuning feature is “ON”. While luckily, you can disable Windows Auto-Tuning level to improve the internet speed for the Windows 10 update. Use administrator privileges to process the following steps.Step 1. Press Win + X and then select Command Prompt (Admin). Step 2. Type the command netsh interface tcp show global in the window. Step 3. Check for Receive Window Auto-Tuning Level and if it is normal, you will need to disable it.Step 4. Type the command netsh int tcp set global autotuninglevel=disabled to disable it.You can perform an internet speed test to see whether those adjustments improve your internet speed or not. If not, you can re-enable the Window Auto-Tuning level by typing the command netsh int tcp set global autotuninglevel=normal in the Command Prompt (Admin).Source: ***Link Removed by Moderator*** Hope the information provided is useful. If the issue persists, reply here and we will be glad to help you.Angel. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi HARSHITGOEL07,specify what is the exact model of your PC and what is the model of your wireless network card.Go to the site of the manufacturer of your PC, download and then install the latest recent driver available for your network card of your Operating System.","Hi HARSHITGOEL07, I suggest you to reinstall your driver, after have removed it. To do so: 1. Press WINDOWS + X 2. Select \"Device Manager\" 3. Click on \"Network card\" 4. Right click on your Network card 5. Click on \"Remove\" 6. Click on \"Detect hardware changes\" (monitor icon) Then you can also do that: 1. Digit \"cmd\" in windows search bar 2. Right click on \"command prompt\" 3. Click on \"Run as Administrator\" 4. Digit \"ipconfig \/flushdns\" without quote and press ENTER 5. Digit \"ipconfig \/renew\" without quote and press ENTER Please let me know if that resolve your issue. P.s: if that answer resolve your issue, please click Yes. Thanks.","Dear Community,I am getting a very slow speed internet after updating to 1809.I raised the issue Microsoft but have heard from them, it's been more than 45 days.I am on 100 Mbps plan, I am getting the speed on my mobile phone but on my laptop, I am getting max download speed of 5 Mbps and upload around 30 Mbps.I have tried updating the driver but it says I am on latest version.Please, help.Best,HDid you solve the problem? I'm having the same error after upgrading to 1809.","I've had this same exact problem and I finally know the solution.  I noticed my download speed was at a crawl and I had almost normal upload speeds but the upload speeds were way faster than my download speeds.1 .Uninstall the network adapter driver from within device manager2. Unplug the adapter from your machine3. Reboot and login4. Plug the adapter into a DIFFERENT port. 5. Let it install the drivers.Check your speed.  Should be good to go again and back up to proper speed. I hope this helps. So many questions about this online with no answers.  This fix works for me every time.","I've had this same exact problem and I finally know the solution.  I noticed my download speed was at a crawl and I had almost normal upload speeds but the upload speeds were way faster than my download speeds.1 .Uninstall the network adapter driver from within device manager2. Unplug the adapter from your machine3. Reboot and login4. Plug the adapter into a DIFFERENT port. 5. Let it install the drivers.Check your speed.  Should be good to go again and back up to proper speed. I hope this helps. So many questions about this online with no answers.  This fix works for me every time.Thanks for the reply, but does not this only apply to offboard adapters? I use the onboard adapter, Intel 1219-v. There would be no way for me to plug the adapter into a different port if you talking about PCI in the case, and I have only one ethernet port on onboard adapter, 3 on modem.","I've had this same exact problem and I finally know the solution.  I noticed my download speed was at a crawl and I had almost normal upload speeds but the upload speeds were way faster than my download speeds.1 .Uninstall the network adapter driver from within device manager2. Unplug the adapter from your machine3. Reboot and login4. Plug the adapter into a DIFFERENT port. 5. Let it install the drivers.Check your speed.  Should be good to go again and back up to proper speed. I hope this helps. So many questions about this online with no answers.  This fix works for me every time.Thanks for the reply, but does not this only apply to offboard adapters? I use the onboard adapter, Intel 1219-v. There would be no way for me to plug the adapter into a different port if you talking about PCI in the case, and I have only one ethernet port on onboard adapter, 3 on modem.I am not sure how to resolve this with an onboard adapter.  I've never had a problem with one internally.   Perhaps it's possible to remove the drivers and reboot.  Or, remove the drivers and install a new updated driver.  It's a driver issue and how windows configures it. For whatever reason it does this I don't know.  What you can try....Go to Intel's site and download the latest drivers for that adapterRemove the old driversManually install the new drivers.Sometimes this requires you to select Browse My Computer For Driver Software then Let Me Pick From A List Of Available Drivers On My Computer.  Choose the new driver files you have.  Sometimes this lists several drivers including ones Microsoft thinks are a better fit. You may have 2 or more in the list to choose from.  Try it for each driver listed for the adapter.  You can see the driver version you are using in device manager by double clicking the driver listed under network adapters and going to the driver tab.  Same place you remove\/uninstall the driver.  Use the latest one provided by Intel and retest the speed.  Many times Windows chooses an off driver.I'm not sure what else to try.  As I mentioned, I have yet to have this problem happen with an internal adapter.  It's only occurred with external USB adapters on my desktop.Good luck.","I've had this same exact problem and I finally know the solution.  I noticed my download speed was at a crawl and I had almost normal upload speeds but the upload speeds were way faster than my download speeds.1 .Uninstall the network adapter driver from within device manager2. Unplug the adapter from your machine3. Reboot and login4. Plug the adapter into a DIFFERENT port. 5. Let it install the drivers.Check your speed.  Should be good to go again and back up to proper speed. I hope this helps. So many questions about this online with no answers.  This fix works for me every time.Thanks for the reply, but does not this only apply to offboard adapters? I use the onboard adapter, Intel 1219-v. There would be no way for me to plug the adapter into a different port if you talking about PCI in the case, and I have only one ethernet port on onboard adapter, 3 on modem.I am not sure how to resolve this with an onboard adapter.  I've never had a problem with one internally.   Perhaps it's possible to remove the drivers and reboot.  Or, remove the drivers and install a new updated driver.  It's a driver issue and how windows configures it. For whatever reason it does this I don't know.  What you can try....Go to Intel's site and download the latest drivers for that adapterRemove the old driversManually install the new drivers.Sometimes this requires you to select Browse My Computer For Driver Software then Let Me Pick From A List Of Available Drivers On My Computer.  Choose the new driver files you have.  Sometimes this lists several drivers including ones Microsoft thinks are a better fit. You may have 2 or more in the list to choose from.  Try it for each driver listed for the adapter.  You can see the driver version you are using in device manager by double clicking the driver listed under network adapters and going to the driver tab.  Same place you remove\/uninstall the driver.  Use the latest one provided by Intel and retest the speed.  Many times Windows chooses an off driver.I'm not sure what else to try.  As I mentioned, I have yet to have this problem happen with an internal adapter.  It's only occurred with external USB adapters on my desktop.Good luck.I will try this, basically I already tried with 3 drivers, the native, the listed on the motherboard site, and the latest intel version. Another curiosity is that it is in Upload my problem, my plan is 75\/75, Download and my ping are perfect, but the upload fluctuates between 5 and 40 depending on the service\/site.Another strange thing is that in the resource monitor or network reading programs, they say that the speed is coming, eg: Chrome.exe = 9.3 Mbps, but when you look in the browser the speed is not there, it's like if the speed came on the port, but the computer was \"lost\" to use the speed.However, just like the original post, if I use a Android smartphone, or even use a Live Linux USB on my computer in a wired way, it works normally.Only in Windows this upload bug.","I will try this, basically I already tried with 3 drivers, the native, the listed on the motherboard site, and the latest intel version. Another curiosity is that it is in Upload my problem, my plan is 75\/75, Download and my ping are perfect, but the upload fluctuates between 5 and 40 depending on the service\/site.Another strange thing is that in the resource monitor or network reading programs, they say that the speed is coming, eg: Chrome.exe = 9.3 Mbps, but when you look in the browser the speed is not there, it's like if the speed came on the port, but the computer was \"lost\" to use the speed.However, just like the original post, if I use a Android smartphone, or even use a Live Linux USB on my computer in a wired way, it works normally.Only in Windows this upload bug.It's a windows adapter driver bug. What gets configured wrong I do not know.  But, that original fix I posted has worked for me every time and came from the manufacturer of one of my USB wireless adapters.  It has happened with 2 different brands of adapters.  It works fine in Linux for me also and my smartphone all have the proper speeds when it occurs.My upload speeds would be faster than my download speeds.  And download speeds would be at a crawl.The main speed test i use is at www.speakeasy.net\/speedtest.  Another one, fast.com is good but it only lists download speeds."]},{"symptom":"Accidentally deleted office 365.        I accidentally deleted all my office 365 programs. Is there any ways to recover them? Can't recover through Settings>Recovery, becuz my protection was off.  ","solutions":["Hello, I'm Didi, an independent advisor. Follow this guide to reinstall your Office 365 programs : https:\/\/support.office.com\/en-us\/article\/downlo... Regards, Didi","Thanks for help! But I can't buy office 365. ","Hi Woxie, So you didn't buy Office 365 before ? Was it preinstalled on your computer when you got it ? Regards, Didi","Frankly, the seller installed office 365, when i bought my laptop.","Hi Woxie, If Office 365 came pre-installed on the system it might be a trial version of Office or what we call an OEM copy of Office 365. If Office 365 was a trial program then you won't be able to re-install trial again on the same system and if it’s an OEM copy then you have to get in touch with the system manufacturer to re-install Office 365. I'm sorry. Regards, Didi","Okay, thanks a lot for the help!","You're welcome !"]},{"symptom":"Unable to replace corrupt file in cmd        I have been playing Apex Legends for a while now. But recently when I tried to run the game there was an error message saying\"application could not start correctly 0xc0000142\" followed by \"untrusted system file: C:\\Windows\\WinSxS\\amd64_microsoft.windows.gdiplus_6595b64144ccf1df_1.1.18362.356_none_17afa2626da1a19a\\GdiPlus.dll\".After checking out forums (and a bit of YouTube) I understood how to replace the corrupted .dll file in an elevated command prompt. However, when I performed the steps to do so and typed and confirmed the final command, there was an error saying \"the process cannot access the file because it is being used by another process\". When I tried to find a way to fix this online, I couldn't find a solution for command prompt. How do I resolve the issue?","solutions":["Hey there ApexFootends, Evan here and Independent adviser I hope I can help. IF this is installed via origin....please navigate to Apex Legends and then right click the app...then click repair. That will verify your game files and *hopefully* will repair your corrupt file.Besides that, personally, I would just re-install.","I managed to do it and I can assure you it doesn't fix the problem and it driving me crazyThis BS easy anti-cheat software is so dumb and useless even submitting a ticket to their support did nothingI advise you to do it anyway maybe they'll fix it"]},{"symptom":"Changing user name in my onedrive\/ computer        Okay, so, funny thing is I was a dumb teenager when I got my laptop and named it something super awful, and I can't figure out how to change it. Its the name that pops up everywhere, for instance. In OneDrive, it says something like \"\/\/user-xxxxxxx\/\/\" and I really need to change it. Please help me! Thank you!","solutions":["The only (safe) way to change the user name for the account is to create a new account and copy all files from the old account name to the new account.Do you use a Microsoft account to sign-in to windows and therefore use the same on OneDrive.Or are you talking about the actual name of the system. If that is the case then open the old Control Panel (type control in Search and select the top result) then go to System. Select Advanced system settings and then the Computer name tab. Then to rename this computer. click Change.","Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.Here's a guide for you to rename your computer. Just follow the instructions provided in this linkhttps:\/\/www.groovypost.com\/howto\/rename-windows...(Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.)I hope this helps with your concern! Please let me know if you have further questions."]},{"symptom":"Power Management Plan        What is the need for 'Power Saver' and 'High Performance' Plan when the 'Balanced' plan is available to automatically control power as per computing demand?","solutions":["Actually, there isn’t very big difference among these 3 modes. High performance will cause over-heat and potential harm to hardware. For me, I set high performance mode for a desktop computer. Laptop doesn't used to do advanced developing work, you can use balance mode.","Hello,Refer this support article, as it mentions about details of power plans available in Windows 7:https:\/\/support.microsoft.com\/en-us\/help\/980869\/about-how-to-troubleshoot-power-plans-in-windows-7Hope this helps!","Suggest reading: https:\/\/www.howtogeek.com\/240840\/should-you-use-the-balanced-power-saver-or-high-performance-power-plan-on-windows\/","My query is what is the need for other plans when the Balanced Plan automatically reduces or increases configuration as per the demand of application?What is the disadvantage of Balanced Plan?","Hi Kapil,This document shows very basic information like the Balanced Plan scale the performance level to match the current workload. That means it will scale high when high performance is required in the current workload automatically.  What is the need of a High Performance plan and other configuration given in an advanced setting?","Thanks for completely ignoring my post.","Under the Balanced plan, your computer will automatically go to sleep mode when it detects no user performance applied for a period of time.Though there may be programs that run in the background and shouldn't be interrupted. For example, your computer may have entered sleep mode and failed to patch against threats under a Balanced plan. Sometimes, you need to go with developing work and wait for the result of running the background programs. Once it enters sleep mode, all your efforts go in vain.","Thank you CamileD . It seems new information. Can you give me a reference from where I can read about it in detail? You have mentioned earlier that you preferred to set High-Performance Plan on Desktop.  Can you describe a case where it is suitable and but Balanced Plan is not?","Smeed,I have referred your URL. But, it gives me very basic and known information like Balanced Plan adjust CPU's speed as per needs. My Query is that What is the need for other plans like High Performance to set CPU Speed highest; while the Balanced Plan will increase CPU speed when such speed required?","Depends on the type of computer.Desktop or Laptop.Its internal hardware and configuration.For instance gamers with high end rigs may choose the High Performance Mode to eke out every little bit of power and prevent it from going into Sleep or Hibernate.High Performance may also not let the computer go to Sleep \/ Hybrid Sleep or Hibernate as many other internal hardware items may be set to stay on. "]},{"symptom":"\"Do this for all conflicts\" when copying \/ moving files using Windows Explorer        When I copy files using Windows Explorers and the same files already exist in the target folder I get a dialog that says \"There is already a file with the same name in this location.\" At this point I have two options: \"Copy and replace\" or \"Don't copy\", with a checkbox at the bottom of the dialog for \"Do this for all conflicts\" and a \"Cancel\" button. My experience has been that if I check \"Do this for all conflicts\" and then click \"Don't copy\" Windows Explorer will not copy the file in question (desired behavior), but then it won't copy any subsequent files regardless of whether or not they exist in the target folder (undesirable behavior).My questions are Am I missing something in how copy should work if there are duplicate files in the target folder?Do I misunderstand the meaning of the \"Do this for all conflicts.\"? Is Windows Explorer broken?","solutions":["Hi Rick My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.There should be a compare files option that lets you choose to 'Keep both files' if you want. Are you not seeing that?","Andre,Your question made me realize that I had neglected to provide some information, but also made me think the behavior may be different depending on the source and destination device(s).In the instance I described, I am copying from a Windows 10 Laptop to a phone mounted as a USB Device for file transfer.So, to answer your question:If I am copying from a folder to a folder on a Windows 10 laptop, then yes, I see the dialog you show in your example.However, when I copy from my Windows 10 laptop to a phone (Samsung Galaxy Note 9, mounted to allow USB file transfer), I do not see the dialog you show in your example, and the options are worded differently. In your example (and what I observed just now on my laptop for a folder to folder copy on a Windows 10 device) the options are: \"Replace the file in the destination\" and \"Skip this file\" with the additional option of \"Compare info for both files\" Instead of \"Copy and replace\" and \"Don't copy\".So it appears that if the source folder and the destination folder are on different device types, the options are different.However, my original question still remains: \"Why does the copy\/move appear to stop without processing any other files?\" if the \"Do this for all conflicts?\" is selected and \"Don't copy\" is clicked. As near as I can tell, Windows receive sufficient information from the USB device that it can tell if the files are the same date \/ time and the same size.Thanks,Rick.","Microsoft, this is a legit bug that you need to fix.  When copying files to a phone SD card over USB, checking \"Do this for all conflicts\" then clicking \"Don't copy\" will inappropriately abort the entire copy operation.","Well, just here to say that I've run into the same bug. So yey.","Same thing happens to me, and I'm also copying files from a PC folder to a folder on my phone, connected via USB.","I have noticed this behaviour several times now, I cant believe Microsoft havent sorted what is a pretty fundamental bug. There are posts back to 2016 highlighting this, and the each time the answer given by Microsoft is just a complete misunderstanding of what is being reported. Ive experience d this bug 2 laptops and my desktop, all with Windows 10 fully updated. How can microsoft not know about this, and not addressed it in 3 years or more? Shocking"]},{"symptom":"My text keeps disappearing in Paint 3D        I am trying to simply type some text onto a picture that I took.  I open it in Paint 3D, type in the text and adjust the text box so it is placed correctly, then tap my pointer outside the text box.   At that point either the right half of the text is completely cut off or the entire text disappears altogether.  I have tried making the text box big enough to cover the entire picture as well as making it small enough to just fit the text.  I've also changed fonts but that doesn't help, either.   I've worked on this for about an hour and it's frustrating that it should be so difficult.  The picture is a panorama type. I am not trying to make this a 3D image.  I just want a 2D picture with text printed on it.","solutions":["Hello Ann. Try an uninstall and reinstall please check if you can uninstall Paint 3D through Settings > Apps & features > Look for Paint 3D and Uninstall. You can re-download Paint 3D using the Windows Store.","For some reason my computer won't let me uninstall it.  I was able to \"reset\" it but that didn't help.  When I try to uninstall the button is grey so it won't work.","Open Start. Search for Windows PowerShell, right-click the result, and select Run as administrator.Type the following command to verify the app information and press Enter: Get-AppxPackage Microsoft.MSPaint Type the following command to uninstall Paint 3D from your computer and press Enter:Get-AppxPackage Microsoft.MSPaint | Remove-AppxPackage","Hello.  I followed your instructions for uninstalling and reinstalling, and I am having the same issue.  No matter what font or size or position, I am getting my text cut in half when I complete editing the text box.  I am forced to undo and then redo my work in slightly different positions until I finally get it to work, so a simple job takes much longer.  Is Microsoft including bugs like this on purpose to get people to purchase premium products or to see how much people use these functions, or do they just not want to put time and money into supporting their products?  I am also getting a bug when I export from Microsoft Video that makes it unusable.  These issues have been reported for months by multiple users without a fix.","Another report of the same issue","another report of the same issue","I had this same issue with part of the text being cut off.  So I played with my picture by cropping it to around 2155 x 1640 from 4608w x 3072h and zoom to add text.  Was able to keep all the text on the picture for my computer wallpaper. ","Same problem.  Please fix this or give us back regular Paint.  As weak an editing tool as it was at least it worked!!!!","Same problem. I have tried the so called \"solutions\" offered by Microsoft. None work. One Microsoft suggestion is to uninstall & re-install the app. The uninstall option for 3D Paint is permanently greyed out, so can't do that. I am a lifelong Microsoft user, frequently defending MS against many complaints from others. I am now losing patience and am constantly amazed that such an incredible company are allowing their products to be tainted by lack of attention to detail and lack of proper support. Come on Microsoft, you can do better, and I know you have developers who could fix the Paint 3D text issue. Let 'em do it, please....","Same problem here. I've tried everything. So frustrating. "]},{"symptom":"Windows 7 Extended Security Updates, who to contact?        I am a user with Win7 Pro. I also have Microsoft 365 and understand I am eligible to purchase extended updates yearly starting in January 2020. Where do I go to see pricing and details?","solutions":["Amy Babinchak  https:\/\/www.harborcomputerservices.net\/meet\/https:\/\/www.linkedin.com\/in\/amybabinchak\/Fellow MVP:https:\/\/mvp.microsoft.com\/en-us\/PublicProfile\/33230?fullName=Amy%20BabinchakThat means nothing.I have posted a thread to you in the Mod forum.You don't post to Windows 7 forums; whereas we have been dealing with this for months.And we go on what Microsoft says.There seems to be some confusion about this, so this is from Microsoft  Last Updated: Last Updated: 10 Jan 2020 .Home users are excluded from this offerN.B. Volume Licensedhttps:\/\/support.microsoft.com\/en-au\/help\/4497181\/lifecycle-faq-extended-security-updatesHow can I purchase ESUs?Extended Security Updates are available through specific volume licensing programs. Contact your Microsoft partner or account team to learn more. ESUs for select Embedded products are available via your embedded device manufacturer.Coverage will be available in three consecutive 12-month increments following End of Support. Customers cannot buy partial periods (e.g., only 6 months). Extended Security Updates are transacted per year (12-month period), commencing with the End of Support date.Eligible customers can use the Azure Hybrid Benefit (available to customers with active Software Assurance or Server Subscriptions) to obtain discounts on the license of Azure Virtual Machines (IaaS) or Azure SQL Database Managed Instance (PaaS).___________________________________________________FAQ about Extended Security Updates for Windows 7: Last Updated: Last Updated: 9 Jan 2020 https:\/\/support.microsoft.com\/en-gb\/help\/4527878\/faq-about-extended-security-updates-for-windows-7This article is intended for use by IT professionals. If you're looking for information for home users, seeWindows 7 support will end on January 14, 2020.__________________________________________________Now we also have this at October 9, 2019, 6:40am EDT :https:\/\/www.howtogeek.com\/443573\/how-windows-7s-extended-security-updates-will-work\/The average Windows 7 user can’t buy these updates, however. They’re only available to businesses and other organizations.Some good news: Instead of just being available to large companies with volume licensing agreements, Windows 7 Extended Security Updates (ESUs) will be available to businesses of any size—even small or mid-size companies.Microsoft won’t sell you these updates directly, and they’re not available through normal retail channels. According toMary Jo Foley, Microsoft officials said these ESUs must be purchased “from qualified Cloud Solution Provider partners.” AMicrosoft blog post about Windows 7 support invites interested parties to “Please reach out to your partner or Microsoft account team for further details.”","Amy Babinchak  https:\/\/www.harborcomputerservices.net\/meet\/https:\/\/www.linkedin.com\/in\/amybabinchak\/Fellow MVP:https:\/\/mvp.microsoft.com\/en-us\/PublicProfile\/33230?fullName=Amy%20Babinchak"]},{"symptom":"brightness is not working        brightness is not working what can i do every thing i try ","solutions":["Hi Sachidanand,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.What is the make and model of the computer?Did you make any changes to computer before the issue started?What troubleshooting steps you have tried?Please see the below options:Option 1.Try Rolling back if you have an option:Go to Device Manager by typing in Devmgmt.msc in Run dialog box. Navigate to Display devices and right click ATI Radeon HD or Similar device you have. Choose Properties.On the Driver tab, hit rollback Driver to go back to the previous version. Option 2. Remove drivers completely and Install the the newest ones available from the OEM or the maker.What you need to do:1. Uninstall everything of Display driver using DDUhttp:\/\/www.guru3d.com\/files-details\/display-dri...2. Reboot.3. Make sure your device manager shows Microsoft Basic Display adapter.4. Download the driver from the OEM or the maker like AMD5.Run the Setup and you should be good to go.Disclaimer:Guru3d.com is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","Please call this no <REMOVED PII>","The forum policy states not to contact any user outside this forum.Also it is not a good idea to share your phone number on a public forum. I see you marked my post as not helpful - may I know the answers of my questions I asked?","brightness is not working what can i do every thing i try Hello,Please refer these suggestions:1. Run Power troubleshooter from Settings app > Update & security > Troubleshoot.2. Open Device Manager (run devmgmt.msc command), try uninstalling your display adapter and then click Action > Scan for hardware changes.3. Update your display driver to latest version.You can refer this fix for additional suggestions:https:\/\/www.kapilarya.com\/fix-cant-change-screen-brightness-in-windows-10Let us know if this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP."]},{"symptom":"Random Mouse lagging And beeping sound        Random mouse beeps and lag randomly happen whatever I am doing on my PC, especially when clicking fast, not my mouse as issue happens whatever mouse I seem to use. Started happening a couple months ago.Specs: Omen LaptopGTX 1060 6GBI58GB DDR4","solutions":["Hi Toby. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.If any steps cannot be performed normally then try them in 1) Safe Mode with Networking (so you have internet) or 2) Safe Mode accessed by one of the illustrated steps in this guide:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf.... You will need to use your password to get into Safe Mode as a PIN is not accepted.1) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 2) Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.3) If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... -------------------------------------------- But remember that in Windows 10 everything depends upon the quality of the install, and Factory or Upgrade installs are inferior installs which most enthusiasts won't even run because they'd expect endless issues. Consider now or later doing the Clean Install in this link which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... There is also an automated Fresh Start that reinstalls WIndows while shedding corrupting factory bloatware, saves your files, but doesn't clear the drive to get it cleanest:https:\/\/www.howtogeek.com\/265054\/how-to-easily-... I hope this helps. Feel free to ask back any questions and let us know how it goes. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","None of that helped :\/","Toby, what is the version number showing at Settings > System > About? Did you read over the Clean Install which would be the last resort if none of the other steps I gave work?Where did you get your latest drivers? Can I see a link to the page? What is the PC make and model? If you type System Information in search box, what is the BIOS version showing? What is the BIOS type, UEFI or Legacy?","Version number is 1909. Already tried re installing windows. latedt driver from nvidia Geforce experience application. Hp Omen, AMI F.08, UEFI","Have you trouble shot Hardware by pressing the HP Escape key upon power on?","You will find hardware Diagnostics and also utility partition with different Diagnostics Suites for both. Run those and report back results.","You will find hardware Diagnostics and also utility partition with different Diagnostics Suites for both. Run those and report back results.Pardon?"]},{"symptom":"Device Descriptor Request Failed        I have a Dell Alienware 51m Laptop running Windows 10 build 1909. I have been facing a very weird problem for quite some time now and there seems to be no fix to it.At any point of time the mouse, the keyboard and any other device like Bluetooth speaker freeze and I see Device Descriptor Request Failed in device manager. The internal keyboard and mouse stop working. I have to restart the device.I have tried the following standard steps alreadyUpdated windows with the most recent version.Updated all my driversI have tried the following fixes as wellFound out the Device Instance Path from device manager of the failed device, disabled enhancedpowermanagementenabled in RegistryTurned off Fast Startup in power settingsDisabled \"Allow Computer To Turn Off This To Save Power\" option in device managerDisabled and Enable USB sleepUninstalled the failed deviceUninstalled the drivers and installed them freshlyFresh install of Windows 10 twiceI have literally tried every single fix and trick I could find on the internet for Device Descriptor Request Failed. This has become a very complicated issue to fix because the error\/failure of device can happen at any time. There seems to be no specific trigger for this. The Dell customer support tried everything they could think of and couldn't come up with any solution.I noticed earlier when my laptop was shipped with Windows 10 build 1903 it had no such issues. All these issues started when I updated to Windows 10 build 1909 after installing it on a SSD. I cannot afford to again do a fresh install of 1903 and hope for this to work. I observed something weird happening in the registry when the devices fail, the failed devices go into this folder VID_0000&PID_0002. I am attaching screenshots of the device manager and registry. If someone could solve this for me, it will be of great help.","solutions":[]},{"symptom":"Upgraded motherboard - Activate Windows 10        Hey! I recently upgraded my motherboard because it fried. Now I am trying to activate Windows 10 and it gives a fault code: 0xC004F211. I can't activate Windows from the computer settings, it wont let me. I got the free upgrade from Windows 7. I found my digital license key with ShowKeyPlus and now it gives fault code: 0x803FA067. Is there anything I can do? I wouldn't want to buy new one. ","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,First, you'd need to identify if the product key for the windows 10 computer is either a retail or an OEM key.Normally OEM keys are solely embedded to one motherboard as they do not have transfer rights for other hardware, unlike retail keys which has transfer rights.For free upgrade licenses, the condition for these are relevant to an OEM key as the license is then considered a digital license once you upgraded free to windows 10.Under this link are reference to activation after hardware change https:\/\/support.microsoft.com\/en-ph\/help\/20530\/...For your windows 10 license, I'd recommend running the activation troubleshooter. Go to Settings>Update and security>Activation and run the troubleshooter. and select I recently changed hardware on this device.If the troubleshooter hasn't helped, you would have to call Microsoft during support hours to get more help.https:\/\/support.microsoft.com\/en-in\/help\/405170...Let me know how it goes. :)","New motherboard is a new computer.  If your Windows was purchased retail then you can transfer the license.  If it came preinstalled on the old computer when you bought it it is an OEM licrnse and is tied to the original motherboard and can not be transferred.","Hey, I've tried everything with the activation after hardware change link. It says it is: Win 10 RTM Core Retail EULA Type: Retail OEM Key: OEM key not present in firmware Would this mean that I can't use the license for the new motherboard? Can I still use this computer without activation of the Windows? ","What you've most likely have there is a windows 10 generic license from the free upgrade. I'd suggest using your previous windows 7 key to try activating the windows 10 system with it as users has reported that a windows 7 retail license that was used to upgrade to windows 10 worked on activating windows 10."]},{"symptom":"no idea how to add videos in photos without them becoming photos        making a video using photos and i've been trying to add clips to my video. everytime i upload them onto the storyboard, they seem to become pictures. i cant use them as videos. for reference, i'm downloading these clips from my google photos onto my laptop","solutions":["Hi LS. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See here how to use the video editor in Photos app: https:\/\/www.howtogeek.com\/355524\/how-to-use-win...https:\/\/turbofuture.com\/graphic-design-video\/Fr...Then there is also Story Remix which is a video slideshow using pictures here: http:\/\/www.thewindowsclub.com\/story-remix-edito...https:\/\/www.windowscentral.com\/how-start-using-...https:\/\/www.pcworld.com\/article\/3196464\/windows...I hope these help. If not just ask back any questions and I'll be happy to answer.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Fault in non-paged area BSOD after upgrading to Windows 10 from Windows 7        I've just upgraded from windows 10 from windows 7. Now every time I either try to restart or shutdown I get the \"fault in non paged area\" BSOD. I also can't put the computer to sleep. I've tried going back to windows 7 and then back to win 10, and it still didn't fix. I've also tried many online solutions, such as check disk. I've tried doing windows memory diagnostic, however because it needs to restart and my computer gets BSOD when it restarts, it hasn't been possible.Please Help.","solutions":["Hi d3m0nz All the minidump files indicate Usbcharger.sys as the device driver causing your system crashes . . .Check the support page for your PC\/motherboard for any USB device drivers, then download and install those to see if your system stabilizes . . ."]},{"symptom":"losing internet connection        i made a post about my hp envy 360 losing connection to the internet after a recent update. was told to re set network adapter, that worked for a while, issue is back again. re setting adapter doesnt work. yet im making this post on my surface and dont lose connection, along with my phone & firestick. any help finding my original post or new suggestions would be helpful,THANKS!!!!","solutions":["Hi, JamesWMcDonald My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps to repair your Internet connections: Enter the Start menu or by pressing the Win + I key combination, open the Settings and click on the Network and Internet option. Once there, we select the Status option from the menu on the left side and, within the configurations and options that are loaded in the right panel, we have to look for the restoration of the network. When you click on this option, it will show us a new window from where we can restore the network in Windows 10. In this way, all network adapters will be removed and reinstalled, and the original configuration of other network components will be restored. net. This implies that if we were using some software, such as a VPN client or virtual switches, we will have to reinstall them.A process that the system performs automatically by clicking on the Reset button that is now displayed in Network Reset in Windows 10 settings. It is normal for the process to not take long, although we must wait until the end completely and restart the computer to continue with the network configuration in Windows 10 as we have done so far.https:\/\/www.kapilarya.com\/how-to-reset-network-...https:\/\/support.microsoft.com\/en-us\/help\/10741\/...You can also check that your drivers are updated. https:\/\/support.microsoft.com\/en-us\/help\/402844...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"apps        why can't I download any apps. from google play or any where microsoft store. When I try it always says I have no device set up for any of them. I just want to download one app for my computer. I have windows 10, but that doesn't help. Can someone help me. I don't know a lot about this stuff so I need someone who can tell me step by step. Thank You  ","solutions":["Hi,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.The message likely means your Windows version is not up to date. The fastest way to get the upgrade is through Media creation tool or ISO file.Please download Media Creation Tool from the link below and select Upgrade this PC at the first screen.https:\/\/go.microsoft.com\/fwlink\/?LinkId=691209All steps, including upgrading using ISO file and Media creation tool, are covered here:https:\/\/www.yourwindowsguide.com\/2019\/11\/update...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads.","Hi this is little bit and I just wanted to say thank you for your help. I'm going to do the upgrade and see what happens. Once again thank you,","Great - let us know how that goes."]},{"symptom":"Error 0x803F81F5 when trying to download apps from Microsoft Store        It started just today when in forza horizon 4 the game told me fortune island DLC wasnt installed (but it was) so i tried to reinstall but it gave that error, for EVERY app i tried to install, i have only 1 device, ive tried everything from updating store, windows, deleting cache but google gave no help, someone suggested turning off offline mode but that doesnt work for me as it keeps resetting***Original title: Microsoft store 0x803F81F5 error***","solutions":["Hi Denis, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues while downloading apps from Microsoft Store app on your PC, and I certainly appreciate your efforts in trying to resolve the issue. For further clarity on the issue, please respond to the questions below: Which build version of Windows 10 are you using currently?Are you aware of any changes made to the PC prior to which you weren’t facing this issue? Refer the article Which version of Windows operating system am I running? Usually, the error 0x803F81F5 indicates you have reached the maximum number of devices that can be used with games and apps from the Store. Refer the articleError codes for Store operations However, as you have mentioned that you have only one device linked to the Microsoft Account, I would suggest you to follow the suggestions mentioned below and see if that helps. Method 1: Try resetting the Store and see if that helps. Press Windows key + R. This will openRun. Alternatively, you can go to Start and search for ‘Run’.In Run dialog box, type ‘wsreset.exe’ and hit enter. Note: A blank Command Prompt window will open, and after about ten seconds the window will close and Microsoft Store will open automatically. Method 2: Run the Store App troubleshooter to identify and fix problems. Press Windows + I key together to openSettings.Click on Update &Security and then click on Troubleshoot.On the right hand pane scroll down and look for Windows Store Apps.Click on it and select Run the troubleshooter.Follow the on-screen instructions. Method 3: Run the PowerShell command to re-register store. Press Windows + X keys together and click onWindows PowerShell (Admin).Now type in the command and hit enter: Get-AppXPackage *WindowsStore* -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register “$($_.InstallLocation)\\\\AppXManifest.xml”}Restart the PC. Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator","Hi Denis,Thank you for writing to Microsoft Community Forums.I understand that you are facing issues while downloading apps from Microsoft Store app on your PC, and I certainly appreciate your efforts in trying to resolve the issue.For further clarity on the issue, please respond to the questions below:Which build version of Windows 10 are you using currently?Are you aware of any changes made to the PC prior to which you weren’t facing this issue?Refer the article Which version of Windows operating system am I running?Usually, the error 0x803F81F5 indicates you have reached the maximum number of devices that can be used with games and apps from the Store. Refer the articleError codes for Store operationsHowever, as you have mentioned that you have only one device linked to the Microsoft Account, I would suggest you to follow the suggestions mentioned below and see if that helps.Method 1:Try resetting the Store and see if that helps.Press Windows key + R. This will openRun. Alternatively, you can go to Start and search for ‘Run’.In Run dialog box, type ‘wsreset.exe’ and hit enter.Note: A blank Command Prompt window will open, and after about ten seconds the window will close and Microsoft Store will open automatically.Method 2:Run the Store App troubleshooter to identify and fix problems.Press Windows + I key together to openSettings.Click on Update &Security and then click on Troubleshoot.On the right hand pane scroll down and look for Windows Store Apps.Click on it and select Run the troubleshooter.Follow the on-screen instructions.Method 3:Run the PowerShell command to re-register store.Press Windows + X keys together and click onWindows PowerShell (Admin).Now type in the command and hit enter: Get-AppXPackage *WindowsStore* -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register “$($_.InstallLocation)\\\\AppXManifest.xml”}Restart the PC.Let us know how it goes.Regards,Prakhar KhareMicrosoft Community – ModeratorIm on the latest version of win 10 1909 and store is updated, i tried all of those above and some others from other threads, up to no avail"]},{"symptom":"Switching dead key        Hi! Is there a way to change the dead key from '\/\" to `\/~?","solutions":["Hi Janis Do you mean there is a key on your keyboard not working and you want to swap that to another key?If so, that can be done, you need to remap that key using a 3rd party utility, the best free utility to use is SharpKeys available form the link below:https:\/\/www.randyrants.com\/sharpkeys39.msi________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","I just want to change the language input settings for using the `\/~ button instead of '\/\" as the dead key for writing letters with diacritical marks.","Solved.","Hi Janis, I am really glad you were able to solve this!"]},{"symptom":"USB headset driver now \"Lync Audio\" not \"Logitech,\" but no sound        I have a Logitech USB headset that had been working fine until we went on vacation in December; Windows 10 64 bit on two machines, multiple USB jacks, it all worked great.  Came back from vacation, and Windows now says that instead of that device being a \"Logitech headset\" it is a \"Lync Audio Device (Headset earphone)\", and NO sound output occurs.I've tried it on two machines, multiple USB ports (on the laptops, on docking stations, on monitors), and.... no sound output.  Microphone is detected and used by Skype just fine, but, no sound output.Help?thanks!","solutions":["What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK","Hi Lacrumb,V1809 os build 17763.805Update history showsPending install waiting on 2019-12 Cum update for .NET, Malicious Software Removal Tool, 2019-11 Cum Update for Windows 10 KB4523205, and another ASP.NET security update.Thanks,notonyourtintype","You need to use the Media Creation Tool and Upgrade.Media Creation Toolhttps:\/\/www.microsoft.com\/en-gb\/software-download\/windows10","I'm sorry, but could you explain a bit please?I'm not sure how generating an installation \/ upgrade media is going to solve the problem of why a specific USB device (Logitech USB headset) now shows up as \"Lync Audio.\" Using that media to then rebuild an entire system, for what seems to be one device driver issue, seems extreme.Thanks."]}]}