{"windows":[{"symptom":"Can an Android phone be a Windows firewall?        Suppose I have a file on an Android phone. Maybe I created it on the phone. Maybe I saved it from an e-mail on the phone, or \"printed\" it from a website, or got it out of a cloud. If I use Bluetooth to send that file to a Windows 7 or Windows 10 PC, could that file infect the Windows PC with a virus or malware?","solutions":[]},{"symptom":"Windows 10 no brightness options        I freshly installated windows 10 on my laptopBut there are no options available to adjust brightness ( no slider, no option in power controls, keyboard brightness buttons also not working)(Btw i'm unable to install intel hd graphics though nvidia drivers are installed, can this be the cause of the problem)Since the brightness is set to max, my eyes are hurtingDoes anyone has a solution for this problem.","solutions":["Have you tried running the default Drivers from HP website for your model? This is a direct link: https:\/\/ftp.hp.com\/pub\/softpaq\/sp72001-72500\/sp...They are not the latest drivers, if you have tried them and they failed, then Let Intel directly detect your chip and display adapter and it will download the latest driver.auto detect is in this link: http:\/\/www.intel.com\/content\/www\/us\/en\/support\/...Please note, that both links belong to Intel and not Microsoft. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Let me know how it goes Farah"]},{"symptom":"Recent Activities Display        Is it possible in Windows 10 to not show recent activity in Windows Explorer while keeping the lists of recent files for apps in the task bar?John49","solutions":["Hi John. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.It should not affect right click menu on TaskBar icons when you turn off Recent Files in Explorer, by changing Quick Access to This PC in File Explorer > View tab > Options > Change Folder and Search Options > General tab > Open File Explorer to: This PC. Restart PC. Now test if you still have the Frequent and Recent items when right clicking Task Bar items.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved."]},{"symptom":"Deleting empty file folders from windows 10 following onedrive backup        Hi,Can anyone tell me if it's safe to delete the empty folders left on my computer if the file from those folders are backed up onto onedrive? I didn't want to take the chance on also deleting them from one drive online.Thank you.","solutions":["Hi Tammy. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.How exactly did you back up the files to OneDrive so that their folders are left behind? Where were these files exactly?Did you copy the files out of these same folders into OneDrive and have confirmed they safely made it to OneDrive now?Have you sync'd your Desktop, Documents and \/or Pictures folders to OneDrive using Folder Protection backup as shown here:https:\/\/www.tenforums.com\/tutorials\/116029-turn...? Have you enabled Files on Demand so that the files are only kept in OneDrive with just links to them on the PC, as shown here:https:\/\/www.windowscentral.com\/how-use-onedrive... ?Once you answer these questions I can answer your question for sure. ______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"звук        При нормална работа с Уин-10 включително когато вървят филми и видеа на втори план през 15-30 секунди се чуват кратки \/като звън на камбана\/ звуци ! Много дразнещо е ! Благодаря предварително !","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I see that you are looking for Bulgarian language support. I would like to inform that you have reached the English support forum. For better clarity, we would appreciate if you could post your query in English. However, upon translating your query, I see that you are getting a sound while playing movies and videos. It could be possible due to a USB device connected on the computer. We would like to know if you have any USB device connected to the computer. If any, please disconnect it and check.  I would also suggest you to check the USB suspend setting and see if that makes a difference. Refer the steps mentioned below: Press Windows Logo key + R, to openRun dialog box.Type control powercfg.cpl,,3 and click onOK.Expand USB settings.Under USB selective suspend setting selectDisabled.Click on OK. If the issue persists, you may want to check in the user account and check if that helps. Refer the article onCreate a local user or administrator account in Windows 10. You may also want to get in touch with our Live Technical Support team by calling them. Please refer the articleGlobal Customer Service phone numbers to get the Customer support number as per your country. Let us know how it goes.  Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"0x80070057 Error when updating from Windows 7 Pro to Windows 10        I am trying to update a friends PC from Windows 7 to Windows 10.Installation seems to go fine until I get 0x80070057 error.Can anyone provide an explanation of the problem and what I can do to fix it ?ThanksDavid ","solutions":["Hi, I understand that you are trying to upgrade Windows 7 Pro to Windows 10 Pro and you are seeing the error 0x80070057. We will certainly assist you with this issue. Usually, we see this error if there are any third party antivirus installed on the system. For better clarity, please let us know:What is the make and model of your computer?Do you have any antivirus installed on your computer? Before we proceed, make sure to disconnect external devices such as printers, scanners (except keyboard and mouse) Method 1: Software and Hardware clean bootPut the PC in clean boot, refer the article How to perform a clean boot in Windows. A ‘clean boot’ starts Windows with a minimal set of drivers and startup programs. Note: After you finish troubleshooting, follow the sectionReset the computer to start normally after clean boot troubleshootingto reset the computer to start normally. Also perform hardware clean boot and check.1.    PressWindows key + R. This will open Run. Alternatively, you can go to Start and search forRun. 2.    In Run dialog box, typedevmgmt.msc and hit Enter.3.    Now expand theDisplay adapters, Printers,Sound, video and game controllers. 4.    Now right click on thedrivers inside the section and click on Disable.5.    If asked for restart click onrestart later and disable all the drivers. 6.  Close the device manager window. Make sure Windows 7 is up to date with the latest updates.Method 2: Download the most recent Servicing Stack Update (SSU):Before downloading the SSU, you will have to turn off Automatic Updates.Click Start, type Windows update in the search box, and then click Windows Update in the Programs list. In the left pane, click Change settings, select Never check for updates, and then select OK.Restart the computer. After the computer restarts, download KB4523206 using the links under Method 2 in that article. Make sure to download the appropriate 32-bit or 64-bit version for your operating system. Click here to see how to determine whether a computer is running a 32-bit version or 64-bit version of Windows. I would also suggest you to check the steps mentioned in Get help with Windows 10 upgrade and installation errors Let us know how it goes. If issue persists, please let us know and we will certainly help you further. Aditya RoyMicrosoft Community – Moderator","Thank you for response. Before receiving your response I cleaned the C Drive and ran CHKDSK and was able to successfully install Windows 10 on my friend’s HP notebook. All good now."]},{"symptom":"Security  Network Auditor        Event Viewer. How do I pevent at least 8 people from using the Auditing Special Logon privelge to make themselves system Owner  add themselves to ADMINISTRATOR  CHANGE GROUP POLICY , \\becomeTRUSTED INSTAllER,. Poweshell users, remotely mange my computer. allowothers to access the computer use azure create virtual machines monitor my use of financial acounts. recreate my Financial accouny6n web pages ","solutions":[]},{"symptom":"access denied        why cant i access a web site that i always have","solutions":["More details are needed.  What browser then and now?","Hi dianecounts, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.If it is not a sensitive website, can you let us know the address (URL) of the website?There are several reasons why you may receive an access denied message, with the most common being that the username and password entered are incorrect. It could be a server-side issue.I hope this has helped you. Please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","why cant i access a web site that i always have Considering all you've told us about the website and how you tried to access the website, it's a total guess on our part.So here's my guess: The website is down. It may be down temporarily, for maintenance, or it may be down permanently."]},{"symptom":"lost login password        I have lost my user password . I am using my pin to log in with but I can.t remembewr my login passwd and I need it for some games and software","solutions":["Hi Michael. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.They do not make it easy when you forget your password, or else anyone could say they're you and get into your account. You should first try changing the password. If it's a Microsoft account password and you set up a security email or phone number then you can change the password easily enough in your online account here: https:\/\/support.microsoft.com\/en-us\/help\/402683... If not you have to go through account recovery: https:\/\/support.microsoft.com\/en-us\/help\/17875\/... If it's a local account you can change the password from the sign-in screen if you set up test questions for this purpose:https:\/\/www.windowscentral.com\/how-add-security... You can also enable the built-in hidden Administrator used only for emergencies as shown here:https:\/\/www.isumsoft.com\/it\/enable-hidden-admin... Sign into it to create a new Local Admin account in Settings > Accounts > Family & Other People > Other, as shown here:http:\/\/www.howtogeek.com\/226540\/how-to-create-a... Sign into the new account, test if the problem persists, if not then move your files over, test that all programs work or else reinstall them, then when ready delete the old account in the same place, and hide the built-in Admin account.You can then change it to your Microsoft account if desired: https:\/\/www.tenforums.com\/tutorials\/5375-switch...If these all fail then you may need to reset your PC, saving files. In order to avoid the need for the password you forgot you may need to create bootable media to access Reset or do the Clean install:To create Windows 10 Installation Media on another PC install Media Creation Tool and follow the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, on second screen choose Repair Your Computer, then Troubleshoot Options to try a Reset.If that fails choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, click Next to let it create needed partitions and start install - this makes it foolproof. Everything needed to get the best possible Clean Install is here: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... It is a better install than any amount of money can buy and a great learning experience that will make you the master of your PC because you will learn what works best and how to apply it with your own hands. If you have files that aren't backed up you can use the same bootable media to try to rescue your files using these methods:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... A suggestion for creating a complicated password that you'll remember: a [childhood street address] + [phone number] that doesn't exist any longer and only you remember for life.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Script host error after startup        My PC is Windows 10 and 3 days ago (16-Dec-19) I updated to version 1909 but after this, every time I restart\/turn on my PC shows the message Windows Script Host error after a few seconds I signed in. I tried to fix it using the windows Startup repair in the troubleshoot advanced options but couldn't repair it. It tells me that the Log file SrtTrial.txt in system 32 logfiles folder is the problem.how can I fix it?","solutions":["Hi Luis, To address script host errors, visit this article for step by step: https:\/\/appuals.com\/how-to-fix-windows-script-h...You may also try to use Task Scheduler to view scheduled tasks at startup to isolate what causes this error.Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Hi Richard, Thanks for the link, but unfortunately it didn't work, and also I tried a lot of things in the command prompt  (bootrec, bootfix, etc.) but nothing fixed this error so I ended up reinstalling the Windows 10 (the latest version in the Microsoft download page) and that fixed the problem.After reinstalling my apps, one of the files (.vbs) contained a Trojan virus that my antivirus deleted but now in every start up and after logging on in my session, an error message pops up saying that Windows Script Host can't find the file, so the question is:How to make Windows Script Host stop trying to run this file specifically and \"forever\"?  P.S. I found the way to disable windows script host but the problem with this \"solution\" is that it will stop running all the scripts and I don't want that because for example I need to run Java scripts for other apps. Thanks, best regards and hopefully someone can help me to solve this new problem,"]},{"symptom":"Win 10 Network does not show private networked Win 7 computer        I had two Win 7 PC on a wired homegroup network that worked well sharing files.  Upgraded one to Win 10 with a clean install and then restored data and reinstalled apps. After much messing around, the PC remaining on Win 7 can see the Win 10 PC and share the proper files and folders.Interestingly - The Win 10 PC cannot see the Win 7 PC in the regular Windows UI; however in the command window of the Win 10 PC the command NET VIEW \\\\WIN7 COMPUTER  \/ALL  finds the Win 7 PC and its network shares.The WIN 10 Network Troubleshooter is unable to help me fix this.  Any help would be appreciated.","solutions":["Hi,Please make sure the network is set to private under Settigs > Network & Internet > status > change connection properties. And that discovery is turned on under control panel > Network and internet > Network and sharing centre > change advanced sharing settings.If you are still experiencing the issue, please let me know so we can troubleshoot the issue.","Thanks Spectre-4,The network settings show this as a private Ethernet network, and the advanced sharing settings already have network discovery turned on and automatic setup of network connected devices turned on.","UPDATEThis issue has been resolved.I use static IPv4 addressing for the PCs on my network.  I realized that I needed to add entries into the LMHOSTS file on the Win10 PC.  Those entries have been on the Win7 PC for years.  Following a reboot, the Windows UI now shows me both PCs and their shares."]},{"symptom":"where is windows 10 System Performance Rating ?        why is there no System performance rating in windows 10?","solutions":["why is there no System performance rating in windows 10? HiIf you mean the Windows Experience Index, this feature was removed starting with Windows 8.You can still get the Windows Experience Index (WEI) scores in Windows 10.Perform the following.   1.Press theWinKey+S to open File Search.Type  cmd.exe.In the Results,Right Click  cmd.exe and select the Run as Administrator option. In the Command Window, type the following command. winsat prepop Press Enter This command will take a few minutes to complete, be patient. After the command completes, close the Command window. 2.Press theWinKey+S again and type Powershell.exe. In the Results, Right Click  Powershell.exe and select theRun as Administrator option. In the Powershell window, type the following command. Get-WmiObject -class Win32_WinSAT (Note the spaces in the command)Press Enter. This will display the WEI results. What the numbers mean.  CPUScore = Processor D3DScore = Gaming Graphics DiskScore = Primary Hard Disk GraphicsScore = Graphics MemoryScore = Memory (RAM) WinSPRLevel = Base Score Thanks to Scott Hanselman [MSFT] for publishing this information.Regards"]},{"symptom":"Determining picture file folder location with Microsoft Photos        When I use Microsoft Photos under Windows 10, I find it very difficult to determine exactly what file folder a given picture file is in.  I organize my pictures in file folders, and need to know this.I find Photos is far too \"helpful\" when it tries to hide important information, almost like that sort of technical detail beyond my poor little mind to comprehend.  There doesn't even seem to be a way to, say, right-click on a picture and get the folder path from its Properties.What's the secret?  Is there a better tool?--- KW","solutions":["Hi Ken, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.As far as I know, the applications that are installed through the Store are physically stored in the folder %ProgramFiles%\\WindowsApps, it's usually the route C:\\Program Files\\WindowsApps.Let me know if you have something else that I can help you with, I'd be happy to help.Regards, Marc M. Have a nice day","Thanks, Marc, but... Are you kidding?I didn't ask you about application files.  I asked you about picture files.  Data.And I don't want to know where they usually are. I want to know how to determine exactly where any given, specific picture's data file is.  I want to know what specific Windows folder it's in, so I can look there and see what other picture data files -- jpg, png, whatever -- are also in that folder.  If I could have an option to open the folder where the file is, that would great.What am I missing?  Surely it can't be that hard. Why would it be?--- kw","Hi Ken, When opening the Photos app, you will land in Collection tab. From here, when you right-click on a Photo\/Video, you will see an option \"Open in File Explorer\", this will lead you to the path of the pictures. You may also select multiple files and repeat the same steps. Hope this answers your question. Best,","Thank you Richard, you correctly understood exactly what I was looking for.  Unfortunately, it doesn't help me.  I wish it did.When I right click a picture in Collection view, I do get a drop down list, but it does NOT include \"Open in File Explorer\".  The closest thing in the list is \"Open in Folders\" -- and those folders are purely a figment of Photos' imagination,  having nothing whatever to do with File Explorer.  So far as I can tell, there is simply no relationship between Photos folders and File Explorer folders.I can't help wondering why this is.  Perhaps the \"Open in File Explorer\" option has been disabled somehow, or the version of Photos I'm using doesn't include it.  It's really frustrating.  Maybe it has some connection with the fact that some, but not all, of our Photos are in OneDrive.This Photos is Microsoft Photos 2019.19081.22010.0, if that helps.  This is on a Surface Pro 4 with Office 365 Home, and Windows 10 fully current.--- Ken","Hi Ken, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.As far as I know, the applications that are installed through the Store are physically stored in the folder %ProgramFiles%\\WindowsApps, it's usually the route C:\\Program Files\\WindowsApps.Let me know if you have something else that I can help you with, I'd be happy to help.Regards, Marc M. Have a nice day This useless response illustrates precisely why using MS forums is...useless.Thanks Marc.","I too needed to know where my jpg and mov files were located on my HDD. \"Open in File Explorer\" was exactly the answer I was looking for.So I checked my version of Microsoft Photos 2019. It is exactly the same as you cited.My suggestion is to go to the Microsoft Photos app in Settings and click on 'Advanced options' which should give you options to Reset, Repair, and Uninstall. If Repair doesn't help, try Uninstalling and Reinstalling Microsoft Photos 2019.","I have a feeling we're not talking about the same thing.What exact application software are you using to view pictures, and how are you launching it?  If you click on the \"Photos\" app in the Windows Start Menu, I don't think it launches the Photos app that launches when you double-click a picture.  It appears to be something else.  The menus are different.  Maybe it's a Metro app with the same name.  It certainly doesn't have anything you describe.  It appears to call itself \"Photos.DLC.MediaEngine\".It is different from the OneDrive Photos browser, too.I'm starting to wonder how many different \"Photos\" viewers Microsoft has!-- KW"]},{"symptom":"what process creates the task \"NT TASK\\Microsoft\\Windows\\UpdateOrchestrator\\Universal Orchestrator Start\"?        hello,in my home i have a computer that i always put in hibernate mode instead of turning it off.from time to time my computer wakes up automatically at around 23:00 for few minutes and turnd off again.(ans sometimes it doesn't turn off - then the computer still runs in the morning, when i get up)and every time the computer is doing that, i wake up as well, because the initial power-on fan-test is very very noisy.i was looking powercfg what the cause was of the last wake and it was always \"NT TASK\\Microsoft\\Windows\\UpdateOrchestrator\\Universal Orchestrator Start\".but when i take a look to \"NT TASK\\Microsoft\\Windows\\UpdateOrchestrator\\\" in the task schedule, there is no\"Universal Orchestrator Start\" anymore, that i could muten\/prevent from turning on the computer next time.it seems the taks deletes itself as soon it was rebooting the computer.what process is creating \"NT TASK\\Microsoft\\Windows\\UpdateOrchestrator\\Universal Orchestrator Start\"?for what is it good for?is there a way to turn off creating that task?i observed that issue more often in the last few days\/week - was something changed in the last update (1909 \/ 2019-12)?","solutions":["Hi BT> I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Try setting your Active Hours in Settings > Update & Security > Windows Update > Active Hours to cover the night hours when it restarts to see if that stops it. You can also set it in Advanced Options to warn you before restarting so you're not surprised outside of Active Hours. If you want to express your opinion on this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems. If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it.I prefer Hibernate too but this annoyed me so much I changed to Shutdown. I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","i hope when shifting the active hours to the night time and enabling the reboot notification will prevent the automatic wakeup at night.but this will not disable UpdateOrchestra from the automatic wakeup at all.it happend multiple times, that the computer didn't hibernated the computer after a wakeup.after a week off, i came home and the computer was running.or two times i had the case where the computer was in a wakeup\/hibernate loop (wakeup, few seconds on, go to hibernate, less than one minute in hibernate mode, wakeup, ...) for a weekend.those kind of loops will stress the fan and the hard drive extremely.(i can not turn off the computer, because it is also used as PVR)","How exactly do you use the PC as a PVR? I would trroubleshoot Hibernate and Sleep to find out why it won't go back to Sleep. The steps to Troubleshoot both are the same, although there are some extra steps here for Hibernate:https:\/\/pureinfotech.com\/fix-hibernate-problems...I will give you all possible fixes for Sleep. If you need help performing any step just ask back:First confirm you have the Sleep options configured correctly as shown here: https:\/\/www.tenforums.com\/tutorials\/2843-change....You might want to try Hibernate to succeed Sleep, or use Hibernate in place of Sleep - it's just a deeper sleep that actually powers off because desktop stored in RAM during sleep is written to hard drive hiberfile then powered off.Most Sleep problems are caused by the Display driver, so try updating yours from the PC or Device maker's Support Downloads web page for your full model number, Serial Number or Dell Service tag. While there make sure you have the latest BIOS, Chipset, Network, Sound, USB and all other drivers by comparing those posted for download with the version and date of the corresponding ones in the Device Manager.If that doesn't help then in Device Manager on Display device Driver tab choose Roll back, Uninstall (then restart to reinstall) or try another one previously installed at Device Manager>Display adapter>Driver>Update Driver>Browse>Let me pick.In addition there are steps here to specifically troubleshoot Sleep mode problems:http:\/\/www.makeuseof.com\/tag\/fix-windows-10-sle... What I do is go into Advanced Power options and set Display and Sleep to 1 minutes, Hibernate to 2 minutes, then after completing each step restart the PC and observe what happens for 3 minutes.Also did it previously work? Do you have a System Restore point from when it did?http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t...This may have been caused by Windows Updates. Check which Updates were installed right before the problem began, and if necessary uninstall them from Settings > Update & Security > Windows Update > Installed Update History.You can also try to roll back using System Restore to a point before this began: http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... Then if an Update reinstalls and causes the same problem uninstall or roll it back again, then immediately hide it using the Hide Updates tool from Method Two here:https:\/\/www.askvg.com\/fixing-windows-10-automat... If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1903 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","i have a dvb-t\/dvb-c\/dvb-s tv card from Hauppauge and WinTV8 as PVR.as action after recording it is set to go to hibernate.but when the \"PVR\" is the reason for a wakeup, then \"powercfg -lastwake\" shows that Hauppauge WinTV as reason...but i am now complaining for the task:\"NT TASK\\Microsoft\\Windows\\UpdateOrchestrator\\Universal Orchestrator Start\"the power configuration looks like:the wakeup at night i observed more often since the last big update, but it happend also the year before for sure (180x).the wakeup loop was happen the last time also last year, but i am always nerves when i leave my home for longer time... and thinking about, in what a state the computer will be, when i come back.i will observe the behavior how it is with the shifted active hour and the notification as described in previus posts.","Interesting. keep me posted on your progress as I will be here to help until the case is resolved.","ok, just now at 08:29, the computer woke up again.and it was again the specific task:Aktivierungsverlaufsanzahl - 1Aktivierungsverlauf [0]  Aktivierungsquellenanzahl  - 1  Aktivierungsquelle [0]    Typ: Aktivierungszeitgeber    Besitzer: [SERVICE] \\Device\\HarddiskVolume4\\Windows\\System32\\svchost.exe (SystemEventsBroker)    Vom Besitzer bereitgestellter Grund: Die geplante Aufgabe \"NT TASK\\Microsoft\\Windows\\UpdateOrchestrator\\Universal Orchestrator Start\" wird ausgeführt. Hierzu muss der Computer reaktiviert werden.Drücken Sie eine beliebige Taste . . .but this time i could find an entry left\/rescheduled in the task schedule...an houre before i put the computer in hibernate mode.i did not got a notification that a reboot is required.so why was there a wake up scheduled?","that task is gone again (deleted automaticly at 08:34), but i could catch a screenshot of its log:EDIT: how can i find that log in the event viewer, to watch the full history of that task?","Windows Update log is here in Event Viewer: https:\/\/winaero.com\/blog\/find-windows-update-lo...If you want to report this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems.If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it. If you are an Insider I can also vote it up with my MVP badge and track the issue for you.","i don't use feedback hub anymore, i reported multiple issues in the past (2016...2018), but never got feedback there.it feels like nobody cares what is written there. and nearly all reported stuff ist still not fixed.so why spend\/waste time with that tool...i am not interested in the \"Windows Update log\", i am interested in the log of the specific task:\"NT TASK\\Microsoft\\Windows\\UpdateOrchestrator\\Universal Orchestrator Start\"i can see a log of that task, as long it is listed in the task scheduler (see screenshot above). but as soon it deletes itself i can not review the log. i thought it will be possible in some way to find it in the \"eventvwr.msc\", but i am not that familare with its to figure out, how to file the log of a specific source(in my case of the task \"NT TASK\\Microsoft\\Windows\\UpdateOrchestrator\\Universal Orchestrator Start\")","I understand. See if the Answer here to turn off Wake Timers or use PSTools helps: https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"How do I add another device manully to this laptop. this machine cannot find this device automaticly        OK thenHow do I manually add another device to my laptop. This device only looks for automatic checking and cannot find the device I am trying to install.* Moved from Community Participation Center","solutions":["Hi, Thank you for writing to Microsoft Community Forums Seems that you are facing issues in adding a device to the laptop. For better clarity, please let us know: What is the device you are trying to add?How are you adding the device to the laptop? (Wired i.e. through USB or Wireless i.e. through Bluetooth\/Wi-Fi network) Meanwhile, we would like you to add the device in the laptop and go to Device Manager (Press Windows + X key) and check if there is any unknown device or a yellow exclamation mark on any device. Please update the driver or uninstall and reinstall the device driver, refer to this article: Update drivers in Windows 10 Let us know how it goes. If issue persists, please let us know and we will certainly help you further. Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"i can not use any of my pc functions, whatsapp desktop, check mail or send , install apps. what do i do        I can not use my pc to check mails. I tried syncing but not getting through, sent mail not going, whatapp desktop not working","solutions":["Hi Fresh. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See if you can System Restore to a point before the problem began following this guide:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... You can System Restore from Repair Mode if it will not work in Windows, following one of these paths:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... If not then go into Safe Mode with Networking (so you have internet), or Safe Mode, accessed by one of these methods:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... to try these repairs until it is stable enough after normal startup.Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... _______________________ You may need to create bootable media to access Repair Mode, Reset or do the gold standard Clean install. The bootable media has it's own drivers, repair and installation files which often work when Windows or the other Repair Mode doesn't.To create Windows 10 Installation Media on another PC install Media Creation Tool and follow the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, on second screen choose Repair Your Computer, then Advanced Troubleshoot Options, then System Restore and Uninstall Updates. If that fails go back to Troubleshoot Options to try a Reset.If that fails choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, click Next to let it create needed partitions and start install - this makes it foolproof.Everything needed to get the best possible Clean Install is here: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... It is a better install than any amount of money can buy and a great learning experience that will make you the master of your PC because you will learn what works best and how to apply it with your own hands. If you have files that aren't backed up you can use the same bootable media to try to rescue your files using these methods:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Computer running slow: task manager showing PowerPoint using lots of memory, but ppt hasn’t been opened        Hi,For the last 6weeks or so, my laptop has been running very slowly probably about 2\/3 of the times we log on.  Looking in task manager, we can see that powerpoint is using a large chunk of the memory, which is odd because usually we have not opened powerpoint when it happens - in fact we think that this *doesn’t* happen when we open powerpoint soon after turning the laptop on.I ran a virus scan immediately when this problem occurred (Sophos) and there were no problems identified.  The computer is running windows 8.1 and has office 365 installed.  Incidentally the battery has also nose dived in the last few weeks and the laptop will now only work when plugged into the mains supply. Any ideas?","solutions":["hi(1) Do you have a snapshots(screen shot) of  Microsoft powerpoint showing percentages of CPU , memory and disk in task manager?(2) have you tried to uninstalling office365 and re-install it? If so what was your result?(3) (a) not literally but you can power drain the battery? You may have to google that then reinstall the adapter(b) with battery pack  attached, nonchalantly leave it on for 5 mins without  doing anything. Then open cmd prompt as administratortype:(1) powercfg \/batteryreport \/output “C:\\xxx.html”(2) powercfg \/energy \/output “C:\\yyy.html”———INC2 (c)IT professional and [Mod Removed]"]},{"symptom":"Can't connect to Windows network services from WSL2        I have Ubuntu 18.04 running in WSL2, from which I want to connect to Docker Desktop running on Windows.From cmd.exe I see that Docker service is listening on 127.0.0.1:2375:C:\\Windows\\System32>curl 127.0.0.1:2375\/info{\"ID\":\"Z2IX:WLIX:FT2V:ZQYY:6222:M6Y6:EGZW:6D2G:EGVY:YABG:VYUM:MB2A\",\"Containers\":6,\"ContainersRunning\":2,\"ContainersPaused\":0...But in WSL2, I got this output by `docker info`:`ERROR: Cannot connect to the Docker daemon at tcp:\/\/127.0.0.1:2375. Is the docker daemon running?`No connection to 127.0.0.1:2375 from WLS2:$ curl 127.0.0.1:2375curl: (7) Failed to connect to 127.0.0.1 port 2375: Connection refusedThe option \"Expose daemon on tcp:\/\/localhost:2375 without TLS\" is ticked.","solutions":["Hi Mikhail, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues while connecting to Docker Desktop on Windows using Windows Subsystem for Linux. We do have a dedicated forum where you should be able to find support for your query. Let me help you in pointing towards the right direction, I would suggest you to post your query onTechNet forums, where we have support professionals with expertise on Windows Subsystem for Linux to assist you with your query. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Onedrive didn't move my files to the new hdd location        I just got a new HDD to pair with my Optane memory.  Since I have the space I wanted to free up space on my main NVME and move all my OneDrive files to the new drive.  I unlinked my account and copied the folder to the new location.  Re-linked my account to Onedrive, setting folder to new location, and started the sync.Suffice it to say it failed.  It copied just fine but it didn't write the files to the new drive, but wrote them to my main drive.  I just reloaded and had my main drive with hardly anything (16% used prior to starting the sync).  Currently my main drive is 66% used and I haven't done anything aside from the sync.I'm not sure the onedrive folder on my main drive, under users and my account, is correct as it doesn't show all folders that are in OneDrive.  Where would I look for the rogue data folder to delete it or move it to the new location?Thanks for any help.Randall","solutions":["Hi Randall Messing,You don't have to move the entire OneDrive folder from it's default location.  You can instead create a new empty folder on your new  HDD drive and name itOneDrive.  Then just copy the files inside the old OneDrive folder and paste them into the newOneDrive folder.  Then unlink your OneDrive from it's default location, click onChange location and select the new location.  Once you select the newOneDrive folder you want to select \"Use this location\" not \"Choose new location\".However, instead of trying to find files that may be missing consider this:It is not necessary to copy all the files from the old location.  Once you linkup OneDrive to it's new location, the files will begin to download from the OneDrive website.  It may take a bit longer but if you feel that you messed up your local OneDrive files you can just wait for the files to download from the website.  Then you won't have to look for any \"rogue\" files and you can start with fresh downloaded files.Feel free to get back here with any further questions and I'll try to help you out.","Craig Thanks for the reply.  Problem is I did do as you suggested by creating a new location and copying the files over.  When I linked back to Onedrive and had it sync, it didn't sync to the new location but sync'd on the main drive.  I re-did the link to a the location again last night and that sees to have worked but I haven't the time this morning to investigate, as I'm off to work.","OK let's hope for the best.  Others had experienced a similar problem with OneDrive so be sure Windows is up to date.  Go to theSettings > Update and Security and make sure.","I have checked and OneDrive looks to be sync'd to the new drive but I still have the rogue data from the first sync on my main drive.  I'm not sure where that data is being kept as I want to delete it to free up the space its using.I dug into my system a bit more and found that Itunes had not been setup for the new HDD and had copied to Itunes directory for my user login.I should be fixed now.  Thanks for your Help Craig.","I'm not sure what rogue data you have.  But if that data is duplicated and therefore backed up in OneDrive then it's safe to delete it.I suggest you sync your Documents, Pictures, and Desktop to OneDrive also.  You can do that inSettings > Backup tab > Manage backup.  Glad to help!","The rogue data that I thought OneDrive had copied to my C:\\ drive turned out to be Itunes having copied my songs to the main drive.  I had to download the program \"Folder Size\" in order to determine what was hogging up my drive.My data is syncing correctly.  Again thanks for the help.","You are welcome!  Glad to help."]},{"symptom":"Scrolling is broke on win10 1909        Scrolling is broke on win10 1909 ver. 18363.535, it works in explorer but nothing else; store, settings and everything else it just scrolls to the top of the page,in settings as soon as you select an item it goes back to the top.I have ran sfc\/scannow and not integrity violations detected.","solutions":["Hi, Try to run these Commands on CMD. Go to CMD and run it as Administrator, then type DISM \/Online \/Cleanup-image \/Scanhealth DISM \/Online \/Cleanup-image \/Restorehealth DISM \/Online \/Cleanup-image \/Startcomponentcleanup","Hi, Try to run these Commands on CMD. Go to CMD and run it as Administrator, then type DISM \/Online \/Cleanup-image \/Scanhealth DISM \/Online \/Cleanup-image \/Restorehealth DISM \/Online \/Cleanup-image \/Startcomponentcleanup I had to start cmd for each instance to run separate as I could not copy paste.The first and second commands worked 100% but the last one showed no progress for over an hour, the pc hung on restarting and I had to force cycle the device with the reset button.As soon as it got to the start up screen, a update started and completed.Everything is back to normal, do not know what the issue was as there were no recent updates.The only  new software was a new nvidia driver 441.87, but I had gone back to 441.66 butthat did not fix the issue.Thanks for the help in sorting this out."]}]}