{"windows":[{"symptom":"Error Unsupported video type or invalid path on Moviemaker10 Pro        I got an error when trying to use Moviemaker10 Pro. Error: Unsupported video type or invalid path. I have not changed anything on this computer and all of a sudden a few weeks ago the Moviemaker program looks different on my computer. I also uninstalled and installed the program.Please help me figure this out. Thanks","solutions":["I guess you are asking about this:https:\/\/www.microsoft.com\/en-us\/p\/hd-movie-maker-pro\/9n9kbwp6hvqqhttps:\/\/www.microsoft.com\/en-us\/p\/movie-maker-10-tell-your-story\/9mvfq4lmz6c9These Apps are NOT Microsoft products and help for these program won't be provided here in this forum.Suggest looking at their support site...On the above linked pages in the tab Overview look for Publisher Info where you will see \"Support\" links.....Hope this helps, Smeed."]},{"symptom":"word        tại sao không thể mở được word","solutions":["There are no Vietnamese language forums here.Either post in English or click on the World Globe Icon at bottom left of every web page here to select a different language."]},{"symptom":"Could I use my Xbox One’s HDD as an internal drive for my laptop?        Hello, this may be a stupid question, but as the title says, could I possibly use my xbox one’s HDD as an internal drive for my laptop? My pc’s hard drive has failed and I don’t care about data recovery and that kind of stuff I just want to be able to use my laptop for my school work, gaming, ect. All I want to know is if its worth the time trying to fix my laptop with a HDD meant for console purposes. I am using a 2tb xbox one seagate HDD. I also will have to take apart the external casing as well, and im aware that the HDD might be slow on the pc as well, as it is HDD.","solutions":["Hi BuffoonSkivitch That is just a standard drive inside the casing, so yes, you can use that drive as an internal drive on your laptop, you will just need to take it out of that casing, and format the drive before installing Windows 10 onto the drive . . ."]},{"symptom":"remove full start view        how to remove full start view from desktop","solutions":["Hi RamKumar1485, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.It sounds like you might be in Tablet mode. To get out of tablet mode, click on the action centre icon (it is the square icon next to the date and time), and then select Tablet mode to turn it on or off.Source: https:\/\/support.microsoft.com\/en-ca\/help\/402796... Another method is to go to Start > Settings > System, then select \"Tablet mode\" from the left hand side, and you can then disable Tablet mode.I hope this has helped you. If this is not what you are looking for, please reply with some additional details on the view you are seeing, and we would be happy to look into providing some different suggestions!Regards, -Ashton","If you are talking about the Start screen using the full Desktop background go Settings, Personalization, Start, Turn off Use Start full screen.Note this then shows the All apps alphabetical list on the Start Menu screen."]},{"symptom":"trying to upgrade to windows 10        I'm trying install Windows 10. I've downloaded the media creation tool, and I'm running the program as admin, but it still hangs at\"Downloading Windows 10, Progress 0%\"have OEM windows 7 installedThere are lots of references to this problem, but I can't seem to find a solution that works for me.I tried:Right clicking to run as admin within admin accountRunning services.msc to check that Windows Firewall and Update are indeed set to automatic and currently running.      upon checking that update is set to \"automatic\" i see that it is in fact on \"automatic, delayed start\"      when i change it and then reset my system so the changes will take effect, it reverts back ","solutions":["trying to upgrade to windows 10 I'm trying install Windows 10 on a new drive. I've downloaded the media creation tool, and I'm  running the program as admin, but it still hangs at\"Downloading Windows 10, Progress 0%\"There are lots of references to this problem, but I can't seem to find a solution that works for me.I tried:Right clicking to run as admin within admin accountRunning services.msc to check that Windows Firewall and Update are indeed set to automatic and currently running.      upon checking that update is set to \"automatic\" i see that it is in fact on \"automatic, delayed start\"      when i change it and then reset my system so the changes will take effect, it reverts back You are not upgrading to 10 if you are trying to install 10 on a new hard drive.You have to have an installed operating system that you can upgrade from.By the way, did you buy 10?","my mistake, not a new drive, existing drive have windows 7 installed","Do not edit your question after someone replies to it.That's why I use \"Reply with quote\"You have completely changed your question by altering that.@@@@@@@@@@@@@@@@@@@@@@@You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700","thank you Bill","If you have any other questions about it, just post a reply back.Cheers."]},{"symptom":"sfc \/scannow found corrupt files but was unable to fix some of them.        My PC‘s gone into a blue screen before because of a memory chip malfunctioning, and after replacing the memory chip I launched into the WINPE to run the following command: `sfc \/SCANNOW \/OFFBOOTDIR=d:\\ \/OFFWINDIR=d:\\windows \/OFFLOGFILE=c:\\log.txt`.Upon finishing, it prompted that the scan had found corrupt files but was unable to fix some of them, and I found these lines in the log:00000003 Servicing stack shim unable to mark handle 1d0 ('\\Device\\Ramdisk{d9b257fc-684e-4dcb-ab79-03cfa2f6b750}\\Windows\\temp\\SSS_dee5513405c0d501010000003405f804\\msdelta.dll') for delete-on-close, error STATUS_CANNOT_DELETE00000004 Servicing stack shim unable to mark handle 19c ('\\Device\\Ramdisk{d9b257fc-684e-4dcb-ab79-03cfa2f6b750}\\Windows\\temp\\SSS_dee5513405c0d501010000003405f804') for delete-on-close, error STATUS_DIRECTORY_NOT_EMPTY...00000003 Servicing stack shim unable to mark handle 1d4 ('\\Device\\Ramdisk{d9b257fc-684e-4dcb-ab79-03cfa2f6b750}\\Windows\\temp\\SSS_c2df069705c0d501010000008805ec02\\msdelta.dll') for delete-on-close, error STATUS_CANNOT_DELETE00000004 Servicing stack shim unable to mark handle 194 ('\\Device\\Ramdisk{d9b257fc-684e-4dcb-ab79-03cfa2f6b750}\\Windows\\temp\\SSS_c2df069705c0d501010000008805ec02') for delete-on-close, error STATUS_DIRECTORY_NOT_EMPTYThen I run the following commands in my normal desktop: Dism \/Online \/Cleanup-Image \/ScanHealthDism \/Online \/Cleanup-Image \/CheckHealthDism \/Online \/Cleanup-Image \/RestoreHealthThen it prompted that it couldn't find the repair source, and directed me to this page(https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/manufacture\/desktop\/configure-a-windows-repair-source) for further information. I read from the page this line: 'Windows Update will be used by default if it is allowed by the policy settings on the computer.'But windows update should have been enabled in the settings. Am I supposed to go through the group policy editor to properly set it up, or should I download a Windows image (.wim) file from the Miscrosoft website?Update:I had run cleanmgr to clean temporary files and changed three entries in group policy for windows update:Configure Automatic Updates, Allow Automatic Updates immedieate installation,  Allow non-administrators to receive update notification(fromNot configured to Enabled). Then I ran the command `Dism \/Online \/Cleanup-Image \/RestoreHealth` again, and I got the same error.","solutions":["DISM does require the ESD or ISO to confirm the install.wim file which contains the System image applied with the latest version. But there are no released ISO's or ESD files of the most recent previews right away. If there are any they will be here:https:\/\/www.microsoft.com\/en-us\/software-downlo...So, yes, if you cannot repair System files after 3 separate tries and then cannot confirm the image with DISM, you'd need to go back to the last version with an ISO available to do so.Did you check at Settings > Update & Security > Recovery for Go Back to Last Version, and also in the Repair Mode accessed as shown here:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... ?The latest stable version is always available in Media Creation Tool.You can follow the  illustrated steps in this link which compile the best possibleClean Install Windows 10  which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy."]},{"symptom":"After some time this message appears.        Aparece este mensaje cuando estoy utilizando la computadora normalmente ya sea en word u otras aplicaciones","solutions":["Hola Alejandra Soy Edisson, un Asesor independiente, y es un gusto poder asesorarte con esta incidencia.Lamento el incidente que estas presentando, te sugiero para ello realizar una revisión de la integridad de algunos archivos que son importantes para el funcionamiento del sistema.Descarga el conjunto de herramientas para reparar errores en Windows compartido por nuestro moderador OmarPlastina en el siguiente enlace:https:\/\/answers.microsoft.com\/es-es\/windows\/for...Te recomiendo para tu caso ejecutar las siguientes opciones del menú en este orden3. Borra los archivos temporales de Windows. 6.Ejecuta la herramienta Comprobador de archivos de sistema. 7. Escanea la imagen en busca de daños en el almacén de componentes. 8. Comprueba si la imagen se ha marcado como dañada. 9. Realiza operaciones de reparación automática. 10. Limpia los componentes reemplazados. 11. Borra los valores del registro incorrectos. 2. Restablece los componentes de Windows Update. Importante: Existen comandos como DISM o SFC que pueden tardar un tiempo considerable, dependiendo del equipo y el estado de los archivos y librerías.Chkdsk puede tardar a veces más de 24hs, todo dependerá del estado del disco a reparar. No detengan nunca los procesos.Después de haber realizado este procedimiento, has visto alguna mejora? Saludos, Edisson V."]},{"symptom":"Windows 10 keep changing my audio setting?        My main problem is when i plug in my headphone(Which has broken mic) i can't select my inbuilt mic.So, When i uninstall the realtek high definition audio driver and reinstall it. Then i can change the mic to inbuilt mic. After severl minutes windows 10 automatic change setting then again i can't change the mic. What the **** is this.... ","solutions":[]},{"symptom":"Windows Store does not allow me to save games to any other drive than C:        Hello, I've started to have this problem recently and I think it may be the cause of very ****ed up permission levels.I'm trying to install Forza Horizon 4 on one of my 2TB drives, I have 2 of these in my system right now, under the Labels I: and F:. The issue is, when I press install, it instructs me to choose a drive to install to, so far so good until I choose the drive and press okay. Then nothing happens.I've tried to change the location manually by going into storage > \"change where new content is saved\" > \"new apps are saved to:\" which just returns me with the error0x80070005. So far I have not been able to find anything on this error and just repeats of people constantly telling me to performchkdsk which I have, and it does absolutely nothing.At this point I'm thinking about reinstalling everything but I have very very important video files and projects that I work on, uninstalling those would literally have me searching for hours to find all my plugins again and that is a risk I'm not going to take. I've had to reinstall windows a couple of times, as one thing messes up everything will soon follow.","solutions":["Hi Radian, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.You may see my responses here: https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/answers.microsoft.com\/en-us\/windows\/for...Taking the ownership of WindowsApps folder and deleting should resolve this.","I've attempted to delete the folder by following your instructions with the registry edit.However, I'm unable to do so as WindowsApps is being used by svchost.exe so I decided to delete the files inside individually to which it gave me \"This disk is write-protected, remove the write-protection or use another disk\"Work around for this?","Please try using Safe mode to take ownership and delete. Individual files would not work you would continue to hit errors until the main folder deletes.Start Windows 10 and Restart Windows twice at boot screen. It opens diagnostic repair. On the next screen, Click Advanced options. Click Startup settings and Press OK. Press F5 to boot to Safe mode with networking. Detailed steps: https:\/\/www.tenforums.com\/tutorials\/2304-boot-i...Please let us know if you need any assistance. Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"Can not download anything from the internet        I am trying to download files off of the internet to MOD a game i play. i click download and once it reaches 100% a pop up says blank contained a virus and has been deleted. i watched some viedos and they said to disable antivirus settings in windows security center. After multiple attemps i still get the same message. I figured maybe there really is a virus or another program was blocking it so i tried to download Spotify a 100% safe program i knew should have no issue and, i got the spotify contained a virus and has been deleted so im guessing that its a fault in the actual software itself? I dont know how to troubleshoot this issue.","solutions":["Hi User. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Download, install and run a full scan with the most powerful on-demand free scanner Malwarebytes:https:\/\/www.malwarebytes.com\/mwb-download\/.In the Scan Settings first set it to include scanning for Rootkits. If necessary run it in Safe Mode with Networking, or Safe Mode accessed by one of these methods:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... Clean up anything found, restart PC and then run again until it comes up clean. Check for any remainders in Settings > Apps > Apps & Features, and also in each of your browser's Extensions, Home Page settings, Search service or Add-On's as shown here:https:\/\/community.box.com\/t5\/How-to-Guides-for-... Then check for damaged System Files: https:\/\/www.lifewire.com\/how-to-use-sfc-scannow... If it cannot repair them see Step 10 here to continue: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Let me know if you can now download files. If not we'll troubleshoot the internet connection. Start here:https:\/\/support.microsoft.com\/en-us\/help\/10741\/... If you want to keep Malwarebytes as an on-demand scanner then you can turn off its Real Time trial version in it's Settings > Account Details tab.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I checked for damaged system files and nothing came back but I still cant download anything, it even says that Malwarebytes contained a virus and was deleted. ","What browser are you using? Try another browser - you can type IE in search box to Pin it to TaskBar, try using it.Otherwise go to another PC and download Malwarebytes, Chrome and Firefox, bring them back and install them, run the scan first with MB exactly as I gave above. Then try with Chrome and Firefox.Try resetting the browsers: https:\/\/www.howtogeek.com\/171924\/how-to-reset-y...Try turning off Defender long enough to see if it's causing this: http:\/\/www.tenforums.com\/tutorials\/5918-windows...","To add to what Greg mentions maybe you should try Chameleon by Malwarebytes that tries to run on infected systems:https:\/\/www.malwarebytes.com\/chameleon\/If you can't even download it, try from another PC, save the extracted files to a USB stick and then try it on your PC.You will start from chameleon.chm file which has 13 different ways to try and get around your problem.Hope it works!"]},{"symptom":"Is this happening to anyone else?        Here: https:\/\/1drv.ms\/v\/s!Agsf-t-6PRlplx57lMwb_2E4qJG-","solutions":["Hi,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Please see the below options:Option 1.Try Rolling back if you have an option:Go to Device Manager by typing in Devmgmt.msc in Run dialog box. Navigate to Display devices and right click ATI Radeon HD or Similar device you have. Choose Properties.On the Driver tab, hit rollback Driver to go back to the previous version. Option 2. Remove drivers completely and Install the the newest ones available from the OEM or the maker.What you need to do:1. Uninstall everything of Display driver using DDUhttp:\/\/www.guru3d.com\/files-details\/display-dri...2. Reboot.3. Make sure your device manager shows Microsoft Basic Display adapter.4. Download the driver from the OEM or the maker like AMD5.Run the Setup and you should be good to go.Disclaimer:Guru3d.com is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"1903 and 1909 network cards not working correctly        Point you to this article https:\/\/www.forbes.com\/sites\/gordonkelly\/2019\/09\/15\/microsoft-windows-10-update-problem-wifi-internet-nic-warning-upgrade-windows-10\/#72881fcd11e0Both my ethernet adaptors have been borked since 1903, had updates removed updates, blocked updates, problem solve well not so simple you gave me more updates and repeatedly I uninstalled and blocked them, then more updates only this time I was unable to uninstall and block said update, 1909 fixed nothing in fact it was such a short update process I didn't really know it had done anything until I went into the system settings and saw it said 1909.Both my network cards are unuseable Intel (r) 1211 and Broadcom netXtreme the drivers are upto date I know cause I have repeatedly done everything I can think of to get them to work only way I'm online is via a usb wifi dongle.It was fine when I could uninstall the problem updates and everything worked again, but here is the thing I knew the issue was caused by windows update and posted on here for help which i got from mods and that got things working for a short time. BUT!! at no point was I told what you surely must have known was an issue or even asked me for more information to get to the root of the problem, it's taken me many hours looking at all kinds of things trying everything to solve the issue, what can I say too many default replies the first person that helped me was by far the most useful.How is this even a thing your microsoft your meant to understand how all this works WHQL all the testing how do you manage to put out an update that breaks so many peoples perfectly functioning devices, I know I'm not alone there are loads of people having issues with these kind of things.So I am stuck on wifi with the only option being to completely reinstall windows but your just force updates upon me and then the pattern repeats.It's real simple fix the problem it's driving people crazy you know it's there but on these forums I see no mention about certain brands of cards being basically driver bricked or software bricked by one of these updates you have forced upon us.I really miss having full control of my computer I want you to go back to the old way of things if I don't want the update I should be allowed to take my own risk and ignore it and delete it this new way of doing things is not working.By all accounts you've even changed the way you do your hardware testing for updates so no wonder it's all so broken for so many people right now it really does make me angry but I'm only stating my opinion and no doubt it won't get far enough up the list or enough attention to make any difference to this current train wreak.","solutions":["I have a similar problem, especially after updates to v1903 and now v1909. I have three Win10 Pro machines and one Win 10 Home machine. Only the WIN10 Home machine communicates two ways with the rest. Some communicate one way, but they pick different machines to talk to or not recognize. Two are hardwired Ethernet and two are Surface Pros. Each PINGs. I have unplugged and reset the Hitron modem\/router. They all reach the two printers on the system.Over the past two years I have fought this repeatedly, and as soon as a new update is installed, they are screwed. The update on one device somehow even affects those that are not updated.The only good one is the old WIN 10 Home, maybe because I have not recently updated it!I do not want remote service anymore either, because in most instances the original problem has been made worse, and I have even had to resort to  complete reinstall of Windows. And you have identified that as soon as you get close to a full update, networking gets some bugs all over again!!! ","Hi,  Have you or anyone found a fix for this home networking fiasco.  I hope Microsoft is working a a permanent fix!","I picked up a startech network card since it was plug and play and also more bandwidth at first the issues were solved but after a few hours of use regardless of if I use onboard or the star tech card they both drop often, going to pick up a new cat cable to see if that helps, but tbh it's given me so much issues I've disabled the onboard and 2nd network card and just using a wifi dongle it's the only way I can keep a stable connection.I wanted to reinstall windows and try to force it to not update, but it would be a lot of work and so I'm hoping it gets better cause it has driven me crazy the last few months so many issues with the connections.The issues I've had with disconnects and device errors since 1903 onwards is sickening and my system was 100% fine before that update so Idk who is at fault but it made me pretty angry for a time mainly cause I couldn't rollback the install to get things working right.I've tried everything out of ideas I'll get a new cable see if it's any better and if not then I have no idea what to do other than wait cause I don't want to reinstall my whole system which is around 5TB of installs to then have windows force updates on me and land straight back where I am now.If I do find a fix at some stage which at this point seems doubtful I'll post, but changing from broadcom to the startech card does work better no Intel onboard error using that, but still disconnects randomly sometimes constantly other times it would last a day then go crazy, needless to say anyone that is having issues most likely is at some stage going to get angry it's a minefield of a problem and none of the help is really help since they don't even admit to the issue at hand they give you all the normal copy paste text when they should know that the current build at least for me and many others when it comes to network issues with these new builds is a nightmare.","I am baffled by my network behaviour using Win10 Pro v1909. I have had days when I have reset NICs by uninstall, reboot and update drivers on four devices. Sometimes all four discover and talk to each other. Sometimes they discover but talk in one direction only. Sometimes every device communicates two ways with each other. Then the next day they one device or another or all fail to discover anything. I don't know how many times I have written down the status and behaviour of each device, and on the next day or reboot, they display a completely different status or behaviour.Getting Support requires a clear definition of the issue, and that seems impossible. It keeps changing. The settings for communication seem to get changed without me doing anything. Why would things like \"network discovery\" change to \"off\" without me doing anything. Or \"you are not connected to any network\"? One PC in particular ometimes cannot even discover itself when selecting Network on Windows Explorer. In that state, it may communicate with other PCs, but they cannot find that machine. Every machine can print on either of our two Ethernet printers.It doesn't matter whether some are on ethernet or all on WiFi. I purchased a separate NIC Server PCIe to determine if the MoBo network function was faulty. Nope. With that card in place the \"sometimes\" functions also occurred.MS Support is very weak on networking. I am being generous.","It just gets worse each day. Once in a while I get four or five devices all in communication, and I think 'Aha'. Then at some time later in the day or the next day one or more fail to detect or communicate only in one direction. An every failure is different than the previous failure!It is difficult to maintain sanity!"]},{"symptom":"Miracast not working on Windows 10 Home 64 bit version 1909 build 18363.535        Dear Team,One week ago i used to connect flawlessly to my samsung smart TV using windows 10. But today i tried connecting it would connect for a second screen flashes then disconnects.When i click on \"Connect\" --> \"Samsung 65 inch\" --> It will connect for a second and immediately Laptop screen flashes and the connect is dropping. This never happened earlier, this is totally frustrating, I used my friend's windows laptop and it is connecting successfully.I had gone through other steps from previous threads. I re-installed(uninstalled and installed) the Intel display drivers.And also I did the network status reset.Also, from a different thread I DixDiag.txt and found out the Miracast is availabe for HDCP.Please kindly help me here, it is totally frustrating to connect the laptop through wired. I am feeling like living somewhere in 2016.Thanks in Advance.Rama","solutions":["Also, I tried creating a local user as admin","Hi Rama and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/support.microsoft.com\/en-us\/help\/401282...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Hi Rama and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/support.microsoft.com\/en-us\/help\/401282...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Hello,Though your advice is appreciated, you totally missed the point of this thread. Like the person who posted it, I too can not connect to Miracast AFTER the 1909 Windows update.  We used to be able to connect to Miracast before the update. The Big Problem with Microsoft and this update is that it has caused a multitude of PC's not to  be able to use this feature anymore. A matter of fact, after I had updated my PC,  it was stated in the new 1909 Windows system that my PC was no longer capabable of Miracast. This is Big Problem for those who need their PC's to do wireless presentations. Microsoft please provide a fix for this issue immediatlely!"]},{"symptom":"Links on Emails not connecting        After clicking on a hyperlink from the Mail App. version of Hotmail a msg. comes up  stating cannot connect and thats it.  Presumably I've clicked on some option somewhere that inadvertently has this outcome but have little idea where to start.","solutions":["Hi DC. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.What often works is to go to Windows 10 Mail Settings (gear icon at bottom of Inbox) then Manage Accounts, then choose the problem account(s), then Delete the Account.Restart PC and retrace that path to add the account back. Make sure the Sync settings are as desired for how far back you want mail Downloaded from, whether to include Calendar and Contacts (People app). See this setup guide to make sure you get everything set as you like: https:\/\/www.windowscentral.com\/how-get-started-... If that's not enough then Reset the Mail app at Settings > Apps and Features > Mail & Calendar > Advanced Options > Reset. Restart PC. Try adding the accounts back to see if it works now.If that fails to fix it then Re-register Mail & Calendar app from Option 2 here: http:\/\/www.tenforums.com\/tutorials\/3175-apps-re... Finally if nothing else works reinstall the Mail and Calendar app from Option Two here:http:\/\/www.tenforums.com\/tutorials\/3175-apps-re... If you have broader performance problems go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"w10 failing to install updates for V1903 x64based system.        unable to install 2019-12 CUM KB4530684 (8) error code 0x80070020.unable to install 2019-11 CUM KB4524570 (9) error code 0x8007001e.unable to install 2019-10 CUM KB4522355 error code 0X8007001e.some updates fail but are installed within 2 days but not all.  I am not sure what to do, I don't have much computer knowledge. please help. ","solutions":["Hello S7E7S7, I am Andrew an independent advisor. Are you trying to install these updates via Windows Update? They could be failing because you are missing an important update that is required. Current Windows version is 1909, you stated you have 1903, these updates you cannot install may only be for 1909. To install 1909 you can run Windows Update manually via Settings > Update and Security. You may have to click text in blue stating update to 1909.Another option is to run a live update via the Media Creation Tool found here. https:\/\/www.microsoft.com\/en-ca\/software-downlo... Start the media creation tool and select to update keeping existing files. Kind Regards, Andrew"]},{"symptom":"Catalog an BKF file on Windows 10        I have several Windows \"BKF\" backup files I need to catalog and possibly restore on Windows 10.These files were backed up using a Win98 or Win7 NTBackup.How can I access these backup files. NTBackup does not seem to run on Window 10 because NTBackup is looking for a removable storage management service\/driver.Thanks in advance, ","solutions":["Hi RoyL1912, My name is Riccardo and I will be happy to assist. You are correct, Windows 10 no longer support NTBackup. You can download it here: https:\/\/www.microsoft.com\/en-ca\/download\/detail... You will have to use it in compatibility mode. This is not supported anymore; so it may not work as expected. Let me know if you need anything else.","Got the CAB file. Managed to extract all the files to a directory.What is the procedure to run it in Compatibility mode?Currently it errors out with a message about not finding the Removable Storage Management resource."]},{"symptom":"Windows 10 backups not happening        Why does my Windows 10  desktop keep saying that my hard drive is disconnected when in fact , it is always plugged in? It was working fine  when windows 7 was still installed on this computer with regular backups, but now I keep getting the message that my file history was disconnected for too long now , and please reconnect your file history. how would I do this? ","solutions":["Hi FurMolly88, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.Windows 7 used a different method of backup as compared to Windows 10. Did you set up the File History backup since installing Windows 10? You can verify this by going to Start​ > Settings > Update & Security > Backup Under \"Back up using File History\", is your external hard drive listed? If not, you can add it here. For more information, you may view this article from Microsoft: https:\/\/support.microsoft.com\/en-ca\/help\/402740... If your drive is listed there in the Backup settings, does it appear in \"This PC\" as being connected?I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"Wireless bluetooth earphones keep disconnecting...        I bought Realme buds wireless bluetooth earbuds recently. I started using them with my phone and it worked just fine. But when I used it with my laptop (Asus FX570UD) it works for sometime and then automatically disconnects and the same problem persists when I reconnect it again. I tried troubleshooting but it is of no use. I need help with why it keeps disconnecting frequently??","solutions":["Hi, Lohit My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to run the troubleshooter for Bluetooth. Go to Settings - Updates & Security - Troubleshoot. Click on Bluetooth under Find and fix other problems. Follow the on-screen instructions.https:\/\/support.microsoft.com\/en-ca\/help\/402622...https:\/\/support.microsoft.com\/en-ca\/help\/15290\/...Try to update the Bluetooth drivers https:\/\/support.microsoft.com\/en-us\/help\/402844...","Hi, Lohit My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to run the troubleshooter for Bluetooth. Go to Settings - Updates & Security - Troubleshoot. Click on Bluetooth under Find and fix other problems. Follow the on-screen instructions.https:\/\/support.microsoft.com\/en-ca\/help\/402622...https:\/\/support.microsoft.com\/en-ca\/help\/15290\/...Try to update the Bluetooth drivers https:\/\/support.microsoft.com\/en-us\/help\/402844...None of those work, I have already tried those methods and the earphone driver is in the updated driver version. The bluetooth earphones just work fine with all smartphones I use and I encounter the problem only with my laptop. Also, I own a bluetooth speaker and it works fine with my laptop. I don't know if there is such a thing as earphones not compatible with laptops...I need help  ","i am also facing the same problem with my ASUS FX505dt. If you got any solutions please let me know. Thanks","i think i found a solution for this. i will tell you what i did....1. First turn on airplane mode.2.  Now, Start Bluetooth.3. Search for new Bluetooth device.(Note: - Firstly remove realme already installed driver.)4. Now, connect to the realme Bluetooth.5. Turn off airplane mode and enjoy the music.","i think i found a solution for this. i will tell you what i did....1. First turn on airplane mode.2.  Now, Start Bluetooth.3. Search for new Bluetooth device.(Note: - Firstly remove realme already installed driver.)4. Now, connect to the realme Bluetooth.5. Turn off airplane mode and enjoy the music.Nah Didn't work for me though","I bought them and they worked fine the first day, and now im getting same problem with my PC. they just disconnect in few seconds after pairingbought realme wireless bud for its 12 hour battery life now feeling that i wasted my money","Same was the issue with mine too"]},{"symptom":"Windows freezing - Boot Log 'drivers not loading'        I have searched the internet high and low through many forums and even some microsoft forums regarding Windows freezing on boot up. Some helpful information has pointed me to enable Boot Logging which I have done.  The first problem in the Boot Log is this line- 'Did not load driver @hal.inf,%acpi_amd64.devicedesc%;ACPI x64-based PC'. I get a long repetition of about 10 other Did not load driver... errors afterword like most other reports. I have tried repairing and restoring to no avail.I have seen many, many, many other people that have had this same problem and asked what it is online also. Among the power to super user answers, I have only seen replies equivalent to - try kicking the tires, make sure the radiator is full, check the muffler bearing, and did you try replacing the engine computer?'I am as frustrated as all the others, so I am asking you Microsoft the writers of Windows, please can you tell us what this error code means? Surely it must refer to a specific type of driver and where\/how to proceed to repair this issue in a direct fashion. Thank you greatly in advance.","solutions":["Please answer as many of these questions as you can.  Maybe I can advise you.Laptop or DesktopAge of computermake\/modelOperating system installed (e.g. Windows 7)32 or 64 bit? (Right-click on Computer, choose Properties)Service Pack 1 (SP1) installed? Same place as 5 above.Capacity of disk drive, how much is in use?  Pie chart shown in ComputerModel number of hard drive (click Disk in Device Manager)If Windows has ever been re-installed since it was new, when was that?Age of hard drive if not the originalHow much memory is installed? (Right-click on Computer, choose Properties)Please list ALL installed programs.....What security software is installed?Is your internet service wireless or wired?","Just to let you know that no one in the Windows 7 forums works for Microsoft.We are computer users who come here to help each other.","First of all nobody here works for Microsoft - we're mostly just everyday users.Second of all those messages in the ntbtlog.txt do not necessary indicate an error or problem to be solved and if you are booting into Safe Mode you will see lots of messages like that - is that what you are doing\/seeing (Safe Mode).If the system used to work properly what do you think happened to it since the last time it did work properly?If you choose to boot in Safe Mode does the system boot okay and if the system hangs what is the last thing you see on the screen?If the system is freezing how are you able to look at the ntbtlog.txt file?If the system boots in Safe Mode but not Normal you may have to use something like msconfig to begin a process of elimination of startup items\/Services to zero in on the culprit."]},{"symptom":"You do not have permmision to access        I have freenas 11 and I've have set it up, but when I try to connect via windows it says you do not have permission to access \\\\_____________________________please help if anyone has experienced this before:(","solutions":["Hi user_860, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.A few questions to help narrow down the problem: Are you able to ping the FreeNAS device from your Windows 10 computer? Have you already set up the shares through FreeNAS? Have you confirmed that the particular protocol is enabled through Services? (eg. SMB\/CIFS)This video regarding setting up Samba (SMB) shares on FreeNAS may be helpful: https:\/\/www.youtube.com\/watch?v=RxggaE935PMNote: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I hope this has helped you. Please reply if you have already tried the above, and we would be happy to look into providing some different suggestions!Regards, -Ashton","yes thanks for replyingI have set up everything in freenas I just don't know how to access it in windows","Thank you for your reply! Are you accessing it through a mapped drive? Or are you typing into the address bar in File Explorer \\\\192.168.0.1 for example?The error message you included about not having permission indicates that there is likely a username \/ password mismatch, so I would double check this on both sides, and if you are not prompted on Windows 10 for the username\/password (or you are not specifying it when mapping the drive), then this might be the cause of the issue. -Ashton","HiAshtonI have figured it out, it was because of one little spelling mistake in the path on freenas 11.2I really appreciate your helpkind regardsuser_860","Hi user_860, I'm glad to hear you were able to figure it out! It's always frustrating when you find out when one character can wreck the whole thing!All the best and please feel free to reach out if you have any other questions! Regards, -Ashton"]}]}