{"windows":[{"symptom":"Installing Windows into Laptop running Cloud Ready        Hi. I have an ex-work HP Elite 840 laptop which was presented to me running Cloud Ready (licence prevented use of corporate windows os).I don't like the Chrome\/CR OS so have purchased Windows 10 keys, and have created the installation ISO file. However, it's 5GB and to get this onto a USB flash drive, I've had to format the drive in NTFS rather than FAT32.I've rebooted and selected the USB drive BOOT option, but I just get \"PXE-E61: Media test failure, check cable\".I have 3 bios boot options:1. Legacy2. UEFI with CSM3. UEFI without CSM   I've tried each, but without success.Can anyone help\/suggest a way to fix this problem...?ThanksSteve","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.The laptop isn't recognising your USB drive as a bootable device I think. How did you get the ISO on to the USB? By far the best way is to use another Windows computer and visit the official download page and use the tool to create a bootable USB drive. Link here:https:\/\/www.microsoft.com\/en-gb\/software-downlo... If you already have the ISO you can also convert that to a bootable USB drive using the free tool Rufus -https:\/\/rufus.ie\/ Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Regards, David","Fantastic, glad to hear it's all working! Let us know if there's anything else. If you don't have any more questions, feel free to choose a rating. Thanks!"]},{"symptom":"Help me analyse this blue screen minidump please        HiMy PC worked fine but after reinstalling Windows (and installing the latest drivers from manufacturer) it started to throw these blue screens. I caught a minidump too.Can you please help me analyse it? System is: Lenovo Ideapad 330s-15ikbIntel Core i5-8250u8 GB RAM1 TB HDDI'm not aware of any RAM issues but that does not mean there can't be. HDD is another culprit as BSODs happen when there is significant IO clogging up: ex. opening a project in Visual Studio, updating Windows and opening documents simultaneously etc.Link to dumphttps:\/\/www.dropbox.com\/sh\/49qpcz3e9qeiki4\/AAAo0hBzbDEpQacHWuNiMSWka?dl=0Thank you!Oliver","solutions":["Hi Oliver, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Do you have G Data Security program? It looks like the reason behind the crash. To be honest you don't need to have a 3rd party AV with Windows 10 as Windows Security is enough. If you still want to use it, you may try reinstalling it.Technical Information: PROCESS_NAME:  GDScan.exe"]},{"symptom":"disabling password requirement for resuming from sleep for an HP desk top equipped with windows 10        How do I disable password requirement for resuming from sleep for an HP desk top equipped with windows 10 ?","solutions":["Hello Suresh, You can use an option in the tutorial below to turn off require sign-in on wakeup. This will not affect at startup from restart or shut down.https:\/\/www.tenforums.com\/tutorials\/11129-turn-off-require-sign-wakeup-windows-10-a.html","Hi SureshBhate to prevent windows asking for a password when waking from sleep, go to settings -> accounts -> sign-in options under \"require sign-in\" select Never. hope that helps please let us know if you experience any problems."]},{"symptom":"MEMORY MANAGEMENT BSD with no error code.        I keep getting blue screen with MEMORY MANAGEMENT when trying to install Windows 10 on a fresh HD. PC is an ASUS X553SA notebook with new 8gb single stick of RAM and the fresh HD is a Samsung 500gb.","solutions":["How do you perform installing Windows 10? Is it from USB or DVD?Did you installed any other version of Windows on that PC?How did you created Windows installer media?","I am using a DVD burned from MediaCreationTool1903.  The PC had Windows 10, but the HD was wiped completely. I am attempting to install Win10 on the new drive.","Hello Jarhead, since this is a new HD machine I will suggest starting with the ram and BIOS. Was it working with the previous HD in the same configuration?Since it's a single slot RAM stick try moving it to a different slot and be sure your BIOS is up to date. Reset BIOS defaults after updating, or as it is. Also make a brand new USB for the install using the Windows Media Creation Tool.https:\/\/www.microsoft.com\/en-ca\/software-downlo... Try these steps, let us know the results.","The HD was working with the same configuration until I updated the BIOS for this particular notebook.  There is only one RAM slot, so moving the stick is a not possible.  However, I switched back to the original 4gb RAM and burned a new DVD.  Win10 is now installing.  ASUS claims that this notebook can take an 8gb RAM stick, but I have tried two separate 8gb sticks and had issues.  I'll reset the BIOS once the installation is finished and see what happens. Thanks.","Are you booting from DVD or are you running installer file from inside Windows?","I booted from the DVD and all went fine.  Problem solved.  Notebook is up and running, and I was even able to upgrade the RAM to the 8gb stick.  Thanks for the assistance.  I really appreciate it."]},{"symptom":"default font        In simple terms how can I set a default font to cover all browsers","solutions":["Hi Maggi Thanks for participating in Microsoft Community, I'm Skypper G. I'm Independent advisor, let me help you with thisThere is not option to do it with one just click from the windows to change the default fonts from any browser.However you can set the default font on the most common browser doing the steps mentioned in the link below:https:\/\/www.howtogeek.com\/208552\/how-to-change-...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Each web browser has its own font settings, so you'll need to select a font in each browser separately.Here's where to set fonts in Google Chrome:Settings > Appearance > Customize fontHere's where to look in Firefox:Settings > Options > General > Fonts and colors"]},{"symptom":"Windows 10 Mail - Unable to open links        Since i updated my Windows 10 to the latestbuild version 17763.557, I'm unable to open links ine-mails on Windows 10 Mail program using my standard browser Firefox.Although if I use another browser like for example, Edge, it opens normally like it did before this new build version.It's the first time that occurred this to me. I've beenusing Windows 10 Mail and opening the links with Firefox for about 2\/3years now and it never gave me thiserror previously.What can I do to fix this?Best regards,Luís Sousa","solutions":["Hi,Thank you for writing to Microsoft Community Forums.I understand that you are unable to open links in emails on Windows 10 Mail app, In order to get clarity and to assist you accordingly, we would need some information.Is the issue specific to Mail app? Are you able open hyperlinks from other applications like Word?Did you try accessing different links through Firefox?May I know if you have set Firefox as thedefault program?I suggest you to try the following method and check:Method 1: Update Windows 10.Suggest you to update the Windows 10.Method 2: Update Firefox.Check if there is an updated version of Firefox as you are able to open the links through Edge.Please reply with details and we'll be happy to assist you.Thanks,Suman.BMicrosoft Community – Moderator","I'm getting this same exact thing with any link, whether it is a regular link or a very long one with gibberish that you would typically get in newsletters and promos, this past month. I have to copy the URL and paste that on my favorite browser (in my case, Chrome) every single time, and it's annoying.I tried switching my default browser to Edge and back, and setting to any browser other than Edge will prevent Mail to open links. I even tried setting default apps for HTTP and HTTPS protocols in that same settings page, and it's the same exact result!I'm very sure this bug has to do with the latest version of Mail or the cursed Windows 10 1809 update or both. This is MS being their stupid buggy self as usual after all.","Yup, I've tried all these same things and get the same result---still unable to open hyperlinks in the Mail app using any default browser except Edge.","Microsoft is playing dumb, acting like they don't know their default Mail app won't open links in anything except their browser.  Weak sauce.  Switching to another client.","This stopped working a few days ago. Like others, I've reset the default web browser. ONLY Edge will open links now.This is broken. Customers should not have to use your browser in order to open web links.","A M E N to that.  I'll just use gmail.  Pfff. ","Windows 10 Pro x64, using Windows Mail v 16005.11901.20184.0. Windows installed three updates this morning. Chrome 77 installed earlier this week, but I'm pretty sure links from email opened in Chrome as expected after that.My laptop Windows Mail just started \"Unable to open ...\" when clicking in links in emails, with system default browser set to Chrome. Set system default browser to Edge, it works. Set system default browser back to Chrome, \"Unable to open ...\" returns. File associations for .htm and .html both show Chrome.A newly created hyperlink in an Excel spreadsheet opens in Chrome as expected.Something seems broken. Not sure what or where.","Just installed the same three updates* on my desktop. Windows Mail continues to open links from email in Chrome as expected. Who can know?* 2019-09 Cumulative Update for .NET Framework 3.5 and 4.8 for Windows 10 Version 1903 for x64 (KB4514359), and2019-09 Security Update for Adobe Flash Player for Windows 10 Version 1903 for x64-based Systems (KB4516115), and2019-09 Cumulative Update for Windows 10 Version 1903 for x64-based Systems (KB4515384)","All affected: please bury them in Feedback Problem reports. It *probably* won't make any difference. But it might.","I had the same issue today, started during last weekend I think... after trying several things, I found an optional update for win10 not installed automatically, once I did it the problem went away and I can open links again from win10 mail using google chrome. Hope this helps."]},{"symptom":"Windows 10 Activation        Hi folks, hoping someone can help after the Microsoft reps on the phone were totally unable to help.I bought windows 8 back in 2015 and took the digital upgrade to windows 10 when it was offered. The box and product key for windows 8 I got rid of years ago, thinking why keep a box for an operating system I no longer use?!I have recently built a new PC and have installed Windows 10, but despite associating my Windows 10 licence with my microsoft account I can't activate windows, getting error code 0x803FA067.The response from the tech support line was basically \"you don't have a product key. Go buy one for £120.\" When I pointed out that there must be others who have not kept product keys for old versions of windows for 5 years and there must be something that can be done they just kept repeating \"you have to have a product key.\"I understand there is probably nothing I can do and I'll need to buy a new licence, so this is posted more in hope than expectation, but I also feel I have to post something somewhere after Microsoft's tech support were so unhelpful - not at all what I expected!","solutions":["Hi, Digital license is valid only for unchanged hardware and need to be renewed by ordinary activation with product key after motherboard replacement or at another PC.Microsoft account does not keep product keys or information about licenses so unfortunately product key is needed when one installs Windows to new hardware."]},{"symptom":"Mail on Windows 10 is pulling in old emails, I delete them and next day they are back        I recently started using Mail (as part of Windows 10) instead of the old Windows Live Mail.  My problem is that it pulled in over 900 emails when I had only about 80 emails in my inbox.  Even on the Roadrunner website for email, these were old deleted emails...where are they coming from and after spending the evening reviewing and deleting about 800 emails they were all back today.What do I need to do to stop this?I'm running on an HP - Windows 10 Edgeg. anderson","solutions":["Have you tried removing the account and re-adding it? To delete do the following: Click the little gear icon at the bottom Click Manage Accounts Click the Roadrunner account Click Remove this account from your device Confirm deletion Restart computer and re-add it using the info below: To add it do the following: https:\/\/www.windowscentral.com\/how-manage-email...DISCLAIMER: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Many issues with Windows System Failures        After many problems with my old PC Windows installation since the 1903 update, I decided to build my Windows installation from scratch on a clean PC.  I Bought a Dell Optiplex 9020 SFF running a 250GB SSD (primary system drive) and a 500GB HDD (data drive).  It is running an I5 processor and 8GB Ram and is running the latest BIOS version. Latest Windows 10 with all updates is installed.  I repeatedly get the BSD and auto system repair often goes though a number of BSDs before it powers off. Powering up then works fine for hours before another error occurs.I have run DISM.exe \/Online \/Cleanup-image \/Restorehealth and done sfc \/scannow. No errors were found which the system could not restore.  I've even used Windows Update Assistant to reload Windows.Some of the frequent blue screen problems are:- Kernal Security Check Failure- IRQL Not Less or Equal- Critical Structural Corruption- System Service Exception- Memory ManagementIssues which may help analysing the problem include: I moved (not just copied) the OneDrive folders and personal folders to Drive D (HDD) before loading the PC with data files which were imported from an external drive.  Since getting the PC I have not been able to have both wired or wireless keyboard and mouse wake up the PC when it has slept for a few hours. Backups which identify the correct personal folders fail every time for no clear reason. Both Primary and secondary drives are MBR disks and the external backup drive is GPT.  One Drive does not appear to work with data on drive D.  And the Toolbar Search does not let me enter anything on my user account only. Other than these issues all works fine.","solutions":["HI Callum. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.There are reported problems with moving OneDrive off the Windows hard drive, and fatal errors can occur by moving shell Desktop folder to another had drive. I'd move them back to C.If any steps cannot be performed normally then try them in 1) Safe Mode with Networking (so you have internet) or 2) Safe Mode accessed by one of the illustrated steps in this guide:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf.... You will need to use your password to get into Safe Mode as a PIN is not accepted.1) Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.2) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 3) Compare the install you did with this gold standard Clean Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... The reason I ask you to do this is because no one of millions who have followed the install in that link has ever come back to report problems that I have seen. It is also a great learning experience that will make you permanently the master of your PC because you will learn what works best and have applied it with your own hands. 4) Test the RAM overnight to stress it with the best bootable test memtest86, following this guide to test both sticks and slots:https:\/\/www.wikihow.com\/Test-PC-RAM-with-MemTest86Run Crucial System Scanner to check the RAM is properly spec'd and configured: https:\/\/www.crucial.com\/usa\/en\/systemscanner?cm... 5) Test the hard drive or SSD with diagnostics: https:\/\/www.lifewire.com\/free-hard-drive-testin...https:\/\/mashtips.com\/ssd-health-test-and-perfor...HP and Dell have hardware diagnostics triggered by tapping the ESC or F12 keys respectively as you power on.Best is to use the HDD\/SSD manufacturer's own if there is one, otherwise use Seatools bootable long test:http:\/\/blog.nowherelan.com\/2013\/04\/04\/boot-seat... Follow this up with a full Disk Check from the Command Prompt in Repair Mode or from bootable media:https:\/\/www.groovypost.com\/howto\/check-hard-dri... if necessary from the Command Prompt at boot:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thanks Greg.Incidentally, the user account here has somehow changed the username to Callum McNicol (my son) when it was Valerie McNicol (my wife).I know I've done a lot of what you suggest, I'll go through it step by step and let you know.  The old PC which had similar issues only has one main drive but also had  the same failure when backing up.It has the latest bios (is set for legacy and not uefi) I have done all of the stress tests on drives and ram with no issues recorded.Anyway, I'll get back to you.Thanks againChris","Hi, Callum's Dad - It could have converted her MS account to his if you signed into Xbox or Onedrive with his account while in hers and hit the wrong prompt. This is annoying but can still be sorted by going into Settings > Accounts > Your Info to click the link to Sign in with a Local Account instead, give it your desired name for the time being. Restart PC, go back to same place to Sign in with a MS Account Instead and sign in with the Wife's MS Account. Now it's returned to her.If this isn't what you think happened, just explain a bit more. I'll be here for another few hours then back in the morning.","I followed your Microsoft account fix process. It appeared to go fine but when I search for this error problem  I still get the page with Callum's name.  Should I presume this is because we started with it on the community forum?  I guess we ae stuck with it until the issues are solved!Incidentally, Callum does not have his own Microsoft Account as far as we know (he wouldn't, not very tech savvy), does not have an XBOX and does not use OneDrive.  He is only an occasional user of this PC as he works on a stand alone laptop without internet access, which I update periodically.","Did you convert C Microsoft account back to see correct one?If the web browser or any other apps are still in your son's name then sign out of them and sign back in with the correct account.","*Did you convert the Microsoft account...","Hi GregWell New Year has passed, we’ve had the world’s worst air pollution for the last week from the New South Wales bush fires and while the Christmas decorations are still up I have come back to my PC problems as we’ve been warned to stay indoors. Hope you had a good break. Some of those links sent me down a few rabbit holes so I had to discipline myself and select appropriate processes without duplication. This is what I have done:Gone through BIOS (F12) and done Dell’s through test of the system and got a clean bill of health for drives, ram etc.Used Dell’s update manager to check for updates to BIOS and Drivers.  Only found one driver which I thought had updated weeks ago, and installed it (woked this time).Using Windows device manager went though all drivers for updating (only graphics driver had an update).Ran Malwarebytes – clean bill of health.Ran sfc \/scannow and subsequent commands to restore health.  Few problems found and repaired in the process.Did a Windows repair upgrade with ISO file.I did not run memtest86 as confident the thorough test from Dell’s bios was sufficient. (It would not let me load onto a DVD only USB).I have run chkdsk on both drive without issues.Ran the Crucial test but can’t figure out where the report is stored.  Looks more like an advertising promotion of their products! We are still getting occasional BSDs, the non-fillable search box is still an issue as is the keyboard\/mouse waking problem. I am of half a mind to reinstall windows from scratch, but am a bit concerned the best way to do it. Also noting your comments about the user data files being on the second drive being an issue with OneDrive, how would you suggest managing drive usage given the system drive is only 125GB SSD.On the Microsoft user issue, I'll leave it for now so we can get through the problem and if I reinstall it might make the issue irrelevant.Cheers"]},{"symptom":"Windows 10 activation        So I just got this computer for Christmas but windows 10 isn't activated. It says the product key doesn't work for this version of windows. So i bought another product key and now it says \"windows can't activate with this product key\" the error code is 0xc004c003 is this a problem with my computer or the product keys.","solutions":["To check your licence please open a PowerShell (Admin) and enter slmgr \/dlv and press return. Post a screenshot of the result.What is the origin of the first licence and how did you buy it. If a device is purchased with Windows 10 pre-installed it should already be activated. Did you install Windows 10 and then buy a key. You cannot buy a key on its own you need to purchase a licence that comes with a legal key and a COA label. Or you purchase a digital licence from the Store.Cheap keys are mostly fake and a waste of money.Make sure you have purchased a licence key for the edition you have installed Windows 10 Home or Pro.","Hi, Did you get a license with PC? What license? Please note, Microsoft warns at https:\/\/www.microsoft.com\/en-us\/howtotell\/Shop.... Beware of Product Keys Sold Separately With the exception of Product Key Cards (PKC’s) distributed with COA’s, Microsoft does not distribute products keys as standalone products. If you see a listing on an auction site, online classified ad, or other online page advertising product keys for sale, it’s a good indication that the keys are likely stolen or counterfeit. If you were to purchase and use a stolen or counterfeit product key to activate Windows installed on your PC, the key may not work for activation, may already be in use on another PC, or it might be blocked from use later by Microsoft when the key is reported stolen."]},{"symptom":"How to: Create a system image in Windows 10        Technical Level : Intermediate SummaryNow that you have Windows 10 setup the way you like, one of the most important things you can do right now is preserve your investment. Create a recovery drive and a system image which you can use to easily restore if Windows does not boot or becomes corrupt or hardware failure. DetailsFirst step, launch Backup and RestorePress Windows + X then click Control PanelIn Control Panel, click Backup and Restore (Windows 7) Under Control Panel Home, click Create a system imageMake sure your external storage device is plugged in and turned on. It should automatically be detected. Click NextClick Start backup to begin the backup process. The process can take some time depending on the size of your backup.Backing up Windows 10After Backup has completed you can close the wizard or create a system repair disc. It is recommended you do so if you don’t have a physical copy of Windows 10 for reinstallation.How to: Create a Recovery Drive for reinstalling Windows 10","solutions":["Does not work Windows 10 throw's Multiple different Errors, cannot find Volume, backup disk Is not accessable etc.Many suggestions on how to fix this problem  but no solutions.","I have done the above but get error code 0x80042306 - backup failed. What went wrong?","The option to select (C:) (System) is grayed out and can not be selected.","The method above keeps giving error code 0x80042306 - backup failed.","I am getting the same error codes as everyone else and have yet to find any suggested solutions as being a viable fix.","This method is NOT valid. It gives error code 0x80042306","The Wizard says Backup and Restore (Windows 7) - does this just mean it is a hold-over from Windows 7, or does it mean it will only work if the computer now upgraded to Windows 10 previously ran Windows 7? My PC, which I have successfully upgraded to Windows 10 (which I like very much) previously ran Windows 8.1.","Maybe a fix has been made recently, because the System Image Backup as shown on the File History window works for me. I upgraded from 8.1 to 10. CrunosCody's link simply takes you to a web site selling an alternative backup program.","tried to do system image backup for window 10. Operation proceeded and win system said it was backed up but I look in my disk management and drive L (the external HD I chose to save the image on) shows ZERO bytes under windows image backup folder. I wil try again using every MS support forum and using Microsoft website tech online support.  ","just followed the steps this is what i got??? please help how to overcome this error and why this error is occuring???  "]},{"symptom":"Can't play GTA V anymore        This is what happens when I try to load into GTA V Story Mode. I tried re-installing the rockstar games launcher but that didn't work, I also tried verifying the integrity of the game files in Steam. I have also removed some mods from the root of my game directory and the issue still persists. I have basically tried everything. Can anyone please help me before I lose my cool? Besides saying reinstall the game because I really want to avoid doing that as much as possible, it is just hassle. There must be a fix besides doing that anyway. ","solutions":["Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.Did you use the new rockstar game launcher to start the game ? https:\/\/socialclub.rockstargames.com\/rockstar-g..._________________________________________________ Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Yes, yes I did. ","Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.From your screenshot it looks like the rockstar launcher has signed out, have you logged back in before trying to launch the gameRegards, Ross","Yes I have tried doing that but even though it lets me sign in it still says \"Authentication no longer valid, please restart\" FFS Rockstar, get your **** together. And if I try to close it it says you must be signed into the social club to play GTA V or some nonsense like that. ","It sounds like there may be an issue with your rockstar account, have your tried logging into it on the rockstar social club website and see if it gives any further information?Regards, Ross","I can login perfectly on the social club website, so I'm guessing there are no problems with my account. It doesn't say anything about my account either.","Having a further look into this issue, it appears to be, as you say an issue with the launcher in particular. Can you try close it and run as administrator. Some users have reported this resolves the issue.Regards, Ross","It didn't solve the issue for me, but then again I am using an administrator account, so I don't think it would make a difference anyway. Can I do anything else to solve this issue? We've ruled out that it isn't an account problem already. So what else could it be?","Only other similar issue I have seen relates to 2-factor authentication, you could try toggle this either on\/off (whatever the opposite of what you have at them moment) to force a new auth token.Regards, Ross","Still hasn't fixed my issue. This is absolutely ridiculous. Everything people say works for everyone else but not me. Any other fixes? Maybe try giving me a list so I don't have to keep replying as often. "]},{"symptom":"Dead Gateway Detection on Windows 10 (x64)        I have seen the registry editor recommendation to enable or disable Dead Gateway Detection, but I can't find theregistry value \"EnableDeadGWDetect\" in my registry. Is this something I should be concerned about?Is there something I should do to remedy this?(I have a scan result that says regarding Dead Gateway Detection: \"Your system's basic network setting is not configured to optimized setting\"","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Here is how to enable this function: To enable dead gateway detection, set the registry value EnableDeadGWDetect under HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\Tcpip\\Parameters to 1. To disable dead gateway detection, set the registry value to 0Previously answered in this thread: https:\/\/answers.microsoft.com\/en-us\/windows\/for...Regards, Ross","Hi Ross,Thank you for your response, however, as I wrote in my OP, there is no registry value labeled \"EnableDeadGWDetect\" under HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Services\\Tcpip\\Parameters, so I can't enable or disable a nonexistent function.Regards,Jerry","Hi Jerry,If it’s not currently there you can create it and set the value.Regards,Ross"]},{"symptom":"Error message saying Flow Will Now Shut Down        I get an irritating message every time I boot up the computer saying \"Error occurred - Flow will now shutdown.  What is Flow and how do I get rid of thisirritating message??  It comes up with an \"F\" logo on the taskbar but a thorough search in the computer fails to find the logo.  It has suddenly started and not related to any installation apart from the automatic Microsoft updates.  This top of the line and fairly new HP notebook has proven to be very unreliable mainly due to poorly written software.  It is a pity the kids at Microsoft and other vendors don't spend more time getting the bugs out of software to make an inherently unreliable system more reliable.","solutions":["Hi John. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Update the Conexant Audio driver from the PC or Device maker's Support Downloads webpage for your exact model, if it is newer than the one presently installed in Device Manager reached by right clicking the Start button. While there compare to make sure you also have the latest BIOS, Chipset, Display, Network and all other drivers. Uninstall the Conexant Audio driver in Device Manager reached by right clicking the Start button, open Audio device, from Driver tab choose Uninstall, when prompted agree to uninstall the software.Before restarting go into Settings > Apps > Apps & Features and look for Conexant there to uninstall,Restart PC, go back to Device Manager, open Audio device now in error, from Action tab choose Scan for Hardware changes, if nothing then from Driver tab choose Update Driver, then Automatic. If that fails then choose Update Driver > Browse > Let Me Pick to try all previous drivers for device. If none of the above works see fixes for this error that worked for others here: https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/answers.microsoft.com\/es-es\/windows\/for...https:\/\/h30434.www3.hp.com\/t5\/Notebook-Audio\/Me...https:\/\/www.howto-connect.com\/fix-error-occurre... (Don't click on any ad links, just read editorial copy)One of those should do it. I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Dear Greg,Thanks for the prompt reply.  When I return home from Christmas activities I will try your solutions and let you know the results.  Thanks again for you valued help.John","I have gone through the steps suggested.  My driver is up to date . The Conexant driver list on the Microsoft website is 4 years out of date!! My driver date is 22\/1\/2019. I can't find anything that looks like a Conexant website and HP diagnostics says it is all OK and up to date.My solution to this issue is to try and suppress the notification as the message is meaningless  - everything is working properly.  I can't find this notification as it seems to be outside the Microsoft notification system annoyingly.  Again, poor software design is the issue and poor diagnostics.  If you know how to suppress the notification I would be very grateful.  I have switched off all notifications but this doesn't seem to work properly.","I have resolved the problem by deleting the Conexant driver and allowing Windows on reboot to re-install the same driver again.  The message has now been suppressed.  It would be nice for Windows to have some well-designed built in diagnostics but I guess this is never going to happen.Thanks Greg for your help."]},{"symptom":"Windows acer Mixed Reality controllers wont work        So I own a Windows Mixed Reality headset, and I love playing games like PAVLOV and Beat Saber, but recently, my right controller decided to absolutely die. Wont turn on, I even tried resetting it, and I haven't gone to the store to check it yet, so I want to ask someone if they know how to fix this.","solutions":["Hi xHeyItzPuppeh, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Check the official community information for troubleshooting, and the website link managed by a Windows MVP. These are general indications that handle this issue, and that can help you solve it.Troubleshooting Windows Mixed Reality https:\/\/docs.microsoft.com\/en-us\/windows\/mixed-...Troubleshooting Windows Mixed Reality is not working https:\/\/www.thewindowsclub.com\/windows-mixed-re...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Microsoft .com site download link not working or directing me        Im trying to download a media feature pack for Windows 8.1 N and Windows 8.1 KN Editions April 2014. (https:\/\/support.microsoft.com\/en-us\/help\/2929699\/media-feature-pack-for-windows-8-1-n-and-windows-8-1-kn-editions-april)But the link on the site for the download is not working or is down i can not tell, it is giving me a server error 404 - file or directory not found.Im downloading it for Twinmotion as it is stated that I need to download this to fix a video export issue in the program.","solutions":["We don't work for Microsoft.But the link you posted only applies for these 8.1 editions: Applies to: Windows 8.1 N\/K with Bing Windows 8.1 Pro N"]},{"symptom":"\"game is blocked by windows parental controls (WPC)\"        Good afternoon, today I installed the game Rainbow Six: Siege, as soon as I launch the game, I get an error \"game is blocked by windows parental controls (WPC)\"This error popped up only with this game, the rest of the games are in order. The game was bought in steam and there were no problems when starting up. There is no Parental Control on my Windows 7 computer (I am 18 years old).Добрый день, сегодня установил игру Rainbow Six:Siege, как только я запускаю игру, мне выдает ошибку \"game is blocked by windows parental controls (WPC)\"Данная ошибка вылезла именно только при этой игре, остальные игры в порядке.Игра куплена в steam и раньше при запуске проблем не было.На моём компьютере с Windows 7 Родительского Контроля нет(мне есть 18 лет).","solutions":[]},{"symptom":"My evoo laptop won't turn on        I bought myself an evoo ultra-thin laptop to use Photoshop on for my photography. I was able to use the laptop exactly one time and after 14 days of owning it it never turned back on. It was stored safely in a drawer never dropped nothing ever happened to it it just won't turn on after one single use. I checked Walmart reviews and I was not the only one to have this problem so I attempted to take it back that following week unaware that there was only a 15-day window for returns. I can't afford a new laptop because I spend $150 on something that I can't even work with now. my business has come to a stop and I'm at a loss for what to do","solutions":["Hi Raeggae1 What exactly do you see on your new laptop when you try to start it up - please give the exact details of what happens . . .","Hi, I am Ganesh Gandhi, an Independent Advisor, 18 years experienced windows guide. I am here to work with you on this problem.Kindly follow these steps: 1. Unplug power and remove battery, 2. Press and hold power button for 30 seconds to release all power from circuitry, plug back in and3. Power up to see if any change. Refer here: https:\/\/answers.microsoft.com\/en-us\/windows\/for...If you get black screen, refer here: https:\/\/support.microsoft.com\/en-us\/help\/14106\/...Do let me know if you require any further help on this. I will keep working with you until it's resolved.Note: Make it easier for other people to find solutions by marking a Reply 'Accept as Solution' if it solves your problem.","I have the same problem,I see the Evoo start up sign,it stays up for a bit and then it turns off.","The evoo laptops have built in batteries so you cant really take it out unless you get the 9 screws out","I have that exact problem.  Did you find out what to do?","I bought myself an evoo ultra-thin laptop to use Photoshop on for my photography. I was able to use the laptop exactly one time and after 14 days of owning it it never turned back on. It was stored safely in a drawer never dropped nothing ever happened to it it just won't turn on after one single use. I checked Walmart reviews and I was not the only one to have this problem so I attempted to take it back that following week unaware that there was only a 15-day window for returns. I can't afford a new laptop because I spend $150 on something that I can't even work with now. my business has come to a stop and I'm at a loss for what to do","I bought myself an evoo ultra-thin laptop to use Photoshop on for my photography. I was able to use the laptop exactly one time and after 14 days of owning it it never turned back on. It was stored safely in a drawer never dropped nothing ever happened to it it just won't turn on after one single use. I checked Walmart reviews and I was not the only one to have this problem so I attempted to take it back that following week unaware that there was only a 15-day window for returns. I can't afford a new laptop because I spend $150 on something that I can't even work with now. my business has come to a stop and I'm at a loss for what to doThere might be numerous errors if your laptop won't turn on. There might be a loose RAM or thedead BIOS battery, or your laptop RAM is malfunctioning. SO follow the thread here to find all the possible solutions and this to do when yourLaptop won't turn on.","Mine comes on, lets me login and then the screen goes to sleep. I can still see the mouse active on the screen but the screen is black.Any ideas???","i have the evoo 11.6 just set up today took forever finally got signed in now says C windows system 32 config systemprofile desktop unavailable ?? what heck its never been used ","I bought myself an evoo ultra-thin laptop to use Photoshop on for my photography. I was able to use the laptop exactly one time and after 14 days of owning it it never turned back on. It was stored safely in a drawer never dropped nothing ever happened to it it just won't turn on after one single use. I checked Walmart reviews and I was not the only one to have this problem so I attempted to take it back that following week unaware that there was only a 15-day window for returns. I can't afford a new laptop because I spend $150 on something that I can't even work with now. my business has come to a stop and I'm at a loss for what to doI never got a chance to set it up it powered on and I turned it off now the screen is black katana want say anything I can't get it to work. The power light comes on"]},{"symptom":"Outlook        I am being asked to enter my password.How do I reset my password?","solutions":["I cannot access my outlook email.There's an exclamation mark on a yellow triangle background.Why has this suddenly appeared?How do I reset my password","Hi CliveMills1, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.These are the official indications that handle the problem you are currently presenting.Reset your Windows 10 local account password https:\/\/support.microsoft.com\/en-us\/help\/402845...When you can't sign in to your Microsoft account https:\/\/support.microsoft.com\/en-us\/help\/12429\/...Open Outlook in safe mode >> Open Office apps in safe mode on a Windows PC https:\/\/support.office.com\/en-us\/article\/Open-O...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M."]},{"symptom":"accidentally set up windows 10 in Chinese        HelloCan someone who reads Chinese please help me?  When asked to choose a language I accidentally hit enter when Chinese was highlighted.It is in the set up stage, I cant get through the set to get to the desktop or I would change it myself Please help Thank you","solutions":["Hi mikemay2 It would be best to start again, if you are still in the setup stage . . . Press and hold the Power Button for 5 - 10 seconds to perform a hard shut down Start your PC, just as Windows attempts to load (spinning dots), press and hold Power Button for 5 - 10 seconds to perform a Hard Shut DownDo this twice On the third start Windows will boot into the Recovery Environment and from there you can access System Repair, Safe Mode, Command Prompt . . . etc.Go to Troubleshoot - Advanced Options - Reset this PC Choose to keep nothing Then start the Reset"]}]}