{"windows":[{"symptom":"Storage        So, I have two storage systems. One SSD and a \"normal one\". and the \"normal one had 1TB storage but when I checked my storage it said that I only have 119GB. I'm not a Tech person so I'll need very  basic desriptions. Altso Sorry if my English is bad I'm from Sweden","solutions":["Hi AxelAnders where is it showing that you have 119GB? if that is in settings -> system -> storage this initially shows the windows drive (probably the SSD) scroll down to \"more Storage Settings\" click on \"view storage usage on other drives\" what does it show in file explorer? open file explorer, click on This PC, it should then show an indication of usage on each drive.if you post some screenshots i will try to explain in more detail.","PLEASE HELP my desk storage is full and I cant update windows or play games if I don't clear space please help"]},{"symptom":"Touchscreen broken in a game called roblox        Whenever I even use touchscreen on roblox, my touchscreen laptop (HP ENVY x360), my mouse just stops working and im forced to use the touchscreen to move the screen. I can still use my keyboard, its just that my mouse doesn't work. How do i fix this? its a constant problem. Im just asking here because my touchscreen breaks the game basically, and i was wondering how to remove the double tap. It just freezes the cursor in place (in the game) and my mouse wont work.","solutions":["Hi Farissxz My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Have you tried to disable tablet mode in the notification center? Click on the icon in the bottom right hand corner of the taskbar > tablet mode Hope this helps."]},{"symptom":"printer doesn't show up to download scans        when trying to download the scanner app my printer doesn't show up. ","solutions":["Have you tried the Windows Fax and Scan app found in All apps under Windows Accessories?","Download the scanner app from where? If you have a multifunction printer\/scanner, the driver from the manufacturer should already contain a scanning option. What model printer?"]},{"symptom":"Gif files.        When trying to save a gif, I open get files as png, I am wondering why this is happening and how I can fix it.","solutions":["Hi Ackeek. I'm Greg, an installation specialist and 9 year Windows MVP, here to help you.To save .gif files in Windows 10, see here: https:\/\/www.wikihow.com\/Save-a-GIF-on-PC-or-MacHow to specify format of pictures you save: https:\/\/answers.microsoft.com\/en-us\/windows\/for... hope this helps.Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it. eel"]},{"symptom":"Windows 10 deletes programs during sleep\/shut down.        I recently updated windows 10, I had no updated it in awhile and it caused problems. Often when I shut down, restart, or sleep\/standby my laptop I find certain files (VLC Player, Discord Chat, Google Chrome, etc) will be gone. The shortcut will be missing from the desktop and the icon for the taskbar will be tell me it no longer works.They don't ever all go at once but it happens to at least one program that has to be installed each time I start the laptop up. This is an HP Notebook.","solutions":["Hi, do you have dual boot or use hard drive outside this laptop? Please run chkdsk c: \/r \/scan command and see if it will find some errors.","Chkdsk cannot run because the volume is in use by anotherprocess.  Would you like to schedule this volume to bechecked the next time the system restarts? (Y\/N) NThis is what I got.","Please use \/scan option: chkdsk c: \/r \/scan","C:\\Windows\\system32>\/scan option: chkdsk c: \/r \/scan'\/scan' is not recognized as an internal or external command,operable program or batch file.This is what I got.","You need only one \/scan option: chkdsk c: \/r \/scan If you see question about reboot, you mistyped command.","Ah, sorryWindows has scanned the file system and found no problems.No further action is required. 471647446 KB total disk space. 427715080 KB in 213329 files.    164756 KB in 64672 indexes.         0 KB in bad sectors.    725382 KB in use by the system.     65536 KB occupied by the log file.  43042228 KB available on disk.      4096 bytes in each allocation unit. 117911861 total allocation units on disk.  10760557 allocation units available on disk.This is what I got.","So this is not disk problem. Do you have any \"freezing\" programs such as Time Freeze, Shadow Defender and so on?Do you have dual boot or use hard drive outside this laptop?","No, I don't have or use any of those things.","But there must be something to delete these files. You may use audit to find guilty.See https:\/\/docs.microsoft.com\/en-us\/windows\/securi... and https:\/\/docs.microsoft.com\/ru-ru\/archive\/blogs\/...","I'm not able to understand these. But I have no seen the problem return, I updated again and it seems to be gone. So, thanks for your help."]},{"symptom":"Windows 10 - Xbox One controller not working with Microsoft Store games        Didn't have this problem previous to the 1909 update.My Xbox One controllers (tried 3 different controllers) stopped working with Microsoft Store games, but continues to work properly with Steam, Origin, etc. The wireless adapter shows up in devices, can be configured, calibrated, set as preferred device, etc. It is simply a case of games from the Microsoft Store no longer work. Forza Horizon 3, Forza Horizon 4, Metro Exodus, etc all don't work with the Xbox One controller anymore. Tried uninstalling the drivers and rebooting, different USB port for the adapter. Tried with an Xbox 360 controller and that worked fine... So what did 1909 do that broke Xbox One controller support?!?","solutions":["Hi Zapix. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....If that doesn't work you can also Go Back in Repair Mode as shown here: https:\/\/www.tenforums.com\/tutorials\/2294-advanc...See fixes for Xbox One Controllers that are working for others: https:\/\/www.ifixit.com\/Wiki\/Xbox_One_Wireless_C...https:\/\/support.xbox.com\/en-US\/xbox-on-windows\/...https:\/\/www.makeuseof.com\/tag\/how-to-fix-xbox-o...https:\/\/support.xbox.com\/en-US\/xbox-one\/control...https:\/\/www.lifewire.com\/xbox-one-controller-tr...https:\/\/gaming.stackexchange.com\/questions\/2877...https:\/\/support.xbox.com\/en-US\/xbox-on-windows\/...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Unfortunately, I can't revert back before the update as I updated to 1909 on 12\/25. I don't often go through the Microsoft store, so I'm only realizing this issue now after purchasing a game last night.","Continue with the troubleshooting steps.","Little update. I checked the Xbox One S (bluetooth) controller I have and THAT works. So this is strictly limited to the Xbox One wireless adapter no longer working with Windows 10. I happen to have 2 of these, so I tested the secondary one and it doesn't work. Not much time to put into this with a schedule that revolves around 24\/7 home health care.","May I ask why you rated me unhelpful before you even had a chance to try any of the repairs I gave, and I was so thorough I gave you every known repair for the controllers? Why?","Did you want to try any of the troubleshooting I gave you which works for everyone else with these controllers? I thought you needed time due to your schedule, but then you keep rating the posts unhelpful even though you said you didn't' have time to try them yet. Should I release the thread?","Didn't rate as \"unhelpful\" when it simply asks \"did this solve your problem?\" to which it didn't. I can't revert back, well aware of how system restore works, and the links posted under fixes for Xbox one controllers wasn't helpful at all. I quickly checked through them and nothing I haven't seen. I spent a good hour of troubleshooting and googling before posting here. And with 25 years of experience to back that up, I normally don't reach out unless I'm ready to give up.The nuclear option people love to suggest is a fresh install of Windows... Which is not an option. I'm not going to spend an absurd number of hours installing, updating and configuring software.","All you needed to do was say that and I would have moved on to other fixes. Instead I was waiting for you to reply since you said you didn't' have time to do them yet.I did not suggest a reinstall, even though I am a reinstall specialist who has helped millions do the best possible Clean installs via my tutorials for ten years, without one coming back with further problems.You said the remaining controller that will not work is the wireless Xbox One, correct? Please confirm you tried these fixes which work for everyone else with these controllers:https:\/\/windowsreport.com\/fix-xbox-wireless-con...(Please avoid ad links in above tutorial which is otherwise excellent)https:\/\/www.ifixit.com\/Wiki\/Xbox_One_Wireless_C...https:\/\/support.xbox.com\/en-US\/xbox-on-windows\/...https:\/\/support.xbox.com\/en-US\/xbox-one\/control...https:\/\/beta.support.xbox.com\/help\/hardware-net...","See, here's the thing. All those solutions are under the impression the controller doesn't work. IT DOES work, except it doesn't with ANYTHING from from the Microsoft Store. The controllers all work with everything else. This is an exception, not a general problem. The controller connects and works properly as it should. It shows up in Windows 10, it can be calibrated in Windows 10, I can use it to play Halo or Gears of War 5 on Steam. But launch ANY game downloaded from the Microsoft Store and it acts like there's nothing except the keyboard. THE ONLY controller that is working with the Microsoft Store downloads is the bluetooth controller.None of the information provided has a solution for a very odd specific problem. And most of those basic solutions like uninstalling, reinstalling, rebooting, etc, etc, I went through earlier in the day. For the record, I also tested this on my other PC and didn't run into the problem. I know as of early December I wasn't having these issues, and the only change between then and now was updating to 1909. Well, and buying Forza Horizon 3 last night which is why I'm aware of an issue with games from the Microsoft Store. However, seeing as the controllers and adapter work on the other PC, I can mostly rule out 1909 being at fault. Though i do see \"Your device is missing important security and quality fixes.\" under Windows Update, and checking for updates doesn't provide any update. Troubleshooting doesn't find any issues either.Side note, I meant no harm in marking the reply as not being the answer.","If the Xbox One wireless controller works in Xbox but is not working with any Microsoft Store games, then it could point to the drivers in Device Manager.Go into Device Manager, from View tab Show Hidden Devices, find the Xbox controller, first choose Update Driver, then Automatic. If that doesn't find anything choose Update Driver > Browse > Let Me Pick to try any previous drivers which actually survive Version Updates in the queue there. If that fails uninstall the driver, restart PC to reinstall and try again. If the controller thinks it's a keyboard or mouse on the PC now, see this tutorial for other fixes:https:\/\/www.thewindowsclub.com\/xbox-controller-detected-as-mouse-and-keyboard"]},{"symptom":"Windows 10 Pro crashed installing Forza Horizon 4        Hi, my windows 10 pro has crashed installing Forza Horizon 4 (Blue Screen) and now I can't see anyway of remove the temp files from my computer, I'm using a 240 Gb SSD and the game has used more than 50 Gb, so I can't either reinstall the game, any solution please?My hardware:- X79 motherboard- Intel Xeon E5 2689- Asus ROG RX 5700 8G- 16 Gb of dual channel ramI hope you can help me!And sorry about my english, is not my native language.","solutions":["Hi, Blue screen error. I need the dump file, Please upload the Dump file, So we can Analyze the error. Go to C:\\Windows\\Minidump\\ Then upload the dump file to https:\/\/onedrive.live.com\/","Here is the dump file, is the second time I try to install Forza Horizon 4 without success, I hope this helpshttps:\/\/1drv.ms\/u\/s!AmD-_7qCRUp5gZxsxExxsR8K7UjapQ?e=PEmd9LAnd please, tell me how I can uninstall the temp files. Thank you in advance.","There was a Bug Check 0xA: IRQL_NOT_LESS_OR_EQUAL Try to run the system file checker. Run CMD as Administrator then type sfc \/scannow You can also run these commands on CMD. dism \/online \/cleanup-image \/scanhealth dism \/online \/cleanup-image \/restorehealth","Ok thank you, I will try these commands and I will post the results. Cheers!","Ok, Let me know, Thanks"]},{"symptom":"print problems        I've gotten a new printer.  When it prints a test page, it prints both color and b & w.  When I print by sending something from the computer, I get only black and white.  Any help would be appreciated.  I know it must be a setting but I cannot find it.  ","solutions":["When you select print a box comes up where you pick your printer and the there is a place for Preferences or Specifications, click on it and set up how you want to print.  It includes paper size, type, B & W or Color etc.  Pick your choices.","Hi CAW4954 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.1. Determine the Grayscale Settings. - Press the Windows key, type in \"Control Panel\" and press enter. - Select Devices and Printers. - Right-click on your printer. - Select Printing Preferences. - Go to the Color tab. - Select Print in Grayscale. - Click Apply. I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"Midi files not playing on Windows 10        Hello everyone, my Windows Media Player suddenly stopped playing midi files. It plays everything else, MP3'S etcso the player itself is not the problem. Have found any posts confusing and unhelpful. Is there anyone out there who can help? Getting a bit desperate!!! Thank you all in advance.","solutions":[]},{"symptom":"Huge problem with Microsoft account and Microsoft store        My 11 year old son has autism. He requires a laptop for school work We got him one at Christmas and set him up with a Microsoft account and email so he can email his work to school It's turning into a nightmare. It's requiring a password and pin to turn it on all the time something to do with Microsoft hello even though hello is not on laptop. It just bluescreens until we set up a pin.  Secondly we purchased Minecraft as a Christmas present. It won't let him play. Kit states it is to do with his Microsoft account settings I have spent hours on the phone to them with them logged in remotely and they can find nothing in his settings to warrant the requirent of a password and pin to log in or anything in his account settings to prevent Minecraft working either.   They put through a refund request for the game but now I just got an email saying the refund was being refused with no reason. This is absolutely disgusting from them.   This is also a disabled child who can't use his stuffHe said to me mummy Steve Jobs has the same thing as me ADHD and ASD so why does he make things so difficult to me. He should make things easier not harder ","solutions":[]},{"symptom":"Surface windows hello face and brightness problem        Hi! I've been using my Surface pro 6 with windows home for about 3 months and didn't have any problem until two weeks ago. My windows hello face stopped working. In settings it says that windows hello face is currently unavailable and that something went wrong and I should try it later. I performed basic troubleshooting like updating drivers but nothing really helped, so I contacted windows support. After few tries of repairing it they recommended me to reset the computer. So I did reset it and it always helped for like 5 minutes and everything was working well and then the same problem occurred again. Then they recommended me to do a full recovery of my device from a recovery image. I did that and again it was working well for five minutes and then it stopped. Then I connected the device with my school account and updated it. After two days the windows hello is working but in setting it is still currently unavailable.What more:1. I cannot adjust my brightness below 50 %. The slider goes down but the brightness of the display stays the same.2. I have updated my pc and now it is saying this, so I don't know if it is up to date or not. 3. Some of my settings says that I should ask the administrator or that it is blocked by my organization, even though I am the administrator.Apparently those are all software problems because all worked for some time after the recovery and then it stopped working.Thanks very much for your help ","solutions":["Hi, What is your OS build version? To find out, Go to CMD and type winver","It is 1909 OS Build 18363.239","Have you tried to run the system file checker? Run CMD as administrator then type, sfc \/scannow And also install the latest updates for Windows 10."]},{"symptom":"Purchasing Windows 7        Is MS still offering a $119 copy of windows 10 Home when you upgrade from windows 7 or are you stuck with the $139 charge?","solutions":["I recently did a few Win7->Win10 upgrades and they went through without any prompt for payment."]},{"symptom":"Ctrl key stuck on even when keyboard removed        I recently cleaned my normal keyboard by removing the caps and spraying them with disinfectant. When im plugged my keyboard back in it acted if the ctrl key was constantly down. I tried restarting several times and nothing worked. I plugged in a second keyboard which worked but when i plugged the old one back in it happened again even when i removed the old keyboard.Does anyone know whats wrong?","solutions":["Hi Hayden. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I will give you everything possible for keyboard problems. If you need help with any steps I'll be standing by here to help you.Sometimes a stuck key can be due to crumbs getting under it. Unplug keyboard or power off laptop, turn it upside down over a trash can and gently rake the keys to dislodge crumbs. If the key is still stuck, remove and clean under it as shown here:https:\/\/www.wikihow.com\/Repair-a-Laptop-Keyhttps:\/\/www.youtube.com\/watch?v=QCYOiK9QP08Try the Keyboard Troubleshooter at Settings > Update & Security > Troubleshoot. If this began within the recent past, See if you can System Restore to a point before the problem began:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... Check which Updates were installed at Settings > Update & Security > Windows Update > Installed Update History and try uninstalling any from around the time this started. If they return and cause the same problem then hide them with the Hide Updates tool:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... What also might work is to go into Device Manager, reached by right clicking the Start button, choose the Keyboard device, on Driver tab try Updating the driver automatically.If this fails from the same location try rolling back or Uninstalling the Keyboard driver, which works in a surprising number of cases where keyboard is messed up by Updates. Restart PC to reinstall driver.See if the keyboard will work in Safe Mode with Networking, or Safe Mode: https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... If not see if the On-screen Keyboard works at Settings > Ease of Access > Keyboard > Turn On the On Screen Keyboard.If so then it could confirm the keyboard is failing, so test it in repair mode to see if it works since it uses different drivers there:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... If not you can contact a laptop manufacturer to see if you can still get it replaced under warranty, or check for replacement keyboards for that model from the PC maker or online from after-market OEM's that exactly match it.Try resetting the keyboard: http:\/\/www.thewindowsclub.com\/reset-keyboard-se... You can also remap keyboard keys using one of these methods: https:\/\/www.makeuseof.com\/tag\/missing-key-remap... Check in your BIOS or UEFI firmware Setup for keyboard settings there, too. If it's a hardware problem then you can often easily replace a keyboard by asking Google for a replacement for your full model number laptop, confirm with seller it fits that unit, locate a video or tutorial the same way which demonstates swapping it in.If none of these works then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.Another thing that might help as it solves many problems is to Upgrade to the latest version by installing the Media Creation Tool from this linkhttp:\/\/windows.microsoft.com\/en-us\/windows-10\/m... choosing Download Tool Now, install the tool, open it and choose Upgrade this PC Now. This will save your files and apps while bringing you up to the latest version by the most stable method. It will also bring all of your Updates current and solve most problems since it reinstalls Windows.I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Instead of disinfectant you need to use Contact cleaner.  Disinfectant may leave a residue."]},{"symptom":"Realtek Audio Manager Won't Start Minimized        Restored my system image and noticed the Realtek HD Audio Manager wasn't in the system tray.In short - it wasn't loading at startup.1 - Installed new audio drivers for 1909 and that didn't fix it.2 - Went to C:\\Program Files\\Realtek\\Audio\\HDA and created a shortcut to the file RtkNGUI64.exe and then placed that in the Windows Startup Folder and that fixed the 'load at start-up' problem, but now it starts as a window and I have to minimize it every time I boot.3 - Went to the shortcut file I created in the startup folder and ticked the box to have it 'start minimized' but it still loads as a window.How do I get this to start minimized to the system tray like it used to?","solutions":["Hi TingTing143 My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Sounds like a registry key is missing. I would recommend removing the steps you have already performed and follow the steps below.1. Press Windows key and R 2. Type in regedit and press enter 3. Answer yes to the prompt 4. Browse to Computer\\HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run5. If there are no entries for RealTek, right click in the right hand pane and choose New > Expandable String Value6. Call the new value RtkNGUI64 and press enter 7. Double click or right click the new entry and select Modify... 8. Copy and Paste C:\\Program Files\\Realtek\\Audio\\HDA\\RtkNGUI64.exe and click OK 9. Close the registry 10. Restart See if the program starts and is minimised, Hope this helps.","Removed the shortcut from the Startup folder and installed the key as you recommended -programs starts just as before - in a window in the middle of the screen..Rats.Thanks very much for the advice.  I appreciate you taking the time to respond.","Repeat steps 1-4, then 7 and use the path below including the quotes in step 8, then 9 and 10.\"C:\\Program Files\\Realtek\\Audio\\HDA\\RtkNGUI64.exe\" -s into the","Apologies should have read \"C:\\Program Files\\Realtek\\Audio\\HDA\\RtkNGUI64.exe\" -s","Okay Jon - Here's the total story.I use Acronis True Image to make custom images of my operating system so if things go wrong I can just boot to my Acronis memory stick, restore the image, and I have a virgin partition to start over with.  I run the OS on a 1TB NVMe and have everything mapped to save to my internal 10TB so in a matter of 5 minutes or so I can boot to whichever operating system I choose.Yesterday I spent quite a bit of time playing with a bunch of video editing programs - just test-driving to see which one I liked the best.  At the end of the experimenting I restored my partition to clean up the mess of installing and uninstalling programs and figured things would be as they always are.This morning I discovered the problem I listed above.  I tried all the remedies you offered plus a bunch off other things I discovered through reading on the net.  (I read it on the net so it must be true...  lol).Nothing worked.Finally, out of frustration, I just killed the partition and restored it again.  Exactly as I did last night.  Guess what?  Problem solved.  Everything exactly as it should be.That this was a problem to begin with is beyond me.  I've restored this image a dozen times and have never had an issue so this one was a stumper for me.  What's even stranger is that restoring the exact same image fixed it.Very odd...  Oh - the only reason I didn't just do a quick restore right off the bat is that I had also downloaded Forza Horizon 4 (75GB) and when I kill the partition I have to download my Microsoft Store games again seeing as how Microsoft, unlike everyone else, doesn't give you any method by which to back up your games.Thanks very much for all the help!","No problem and glad your issue is resolved :)"]},{"symptom":"File Storage        Can someone tell me what I did that my files (photos and documents) have green checkmarsk on the icon?  How do I get rid of that?Thanks","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.You've probably enabled the option to have Onedrive backup your profile folders (ie. Documents, Pictures, etc). Files in OneDrive show that green icon why they are synced. It isn't particularly a problem - however if you'd rather your folders were not in OneDrive see here for how to change: https:\/\/www.tenforums.com\/tutorials\/116029-turn... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Regards, David","Another advisor has pointed out to me that these icons might actually be from Norton Backup - rather than Onedrive. In that case please see the instructions from Norton here regarding how to control this:https:\/\/support.norton.com\/sp\/en\/uk\/home\/curren... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"games loading slow        Microsoft card games wont load or are very slow.   How do I fix this?","solutions":["Hi Robert. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Try resetting the game at Settings > Apps > Apps & Features > Card games > Advanced Settings > Reset or Repair.If that doesn't fix it then re-register the app from Option Two here: http:\/\/www.tenforums.com\/tutorials\/3175-apps-re... And if that fails uninstall the app in App settings above, restart PC, then reinstall from MS Store Settings > My Library.If those all fail do a Repair Install: https:\/\/www.kapilarya.com\/how-to-repair-windows... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"I found the Category, Windows version and Windows topic very easy.        For the **** life of it this Windows 10 is a total piece of ****. There is not a single thing that works with the system and this system does not work with anything. These stupid **** developers either didn't start or never even finished a single task for this operating system. From the box the computer is completely useless and just shuts down every day without a single hardware failure. I would blame the hardware, but it works like intended with every single other operating system. Except Windows 10.And now. I am in the least final stage for testing if this will ever serve as a virtual machine. **** no. This goddamn piece of **** system doesn't even start in the Hyper-V platform.What a **** waste of my time. What a **** waste of all my computer money. What a **** waste of all of my office work.","solutions":["Hi A. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.If you want to complain to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. But Microsoft will not even see it here because this is a tech forums where we are mostly volunteers trying to help solve your problems. What we have found is that in Windows 10 everything depends on the quality of the underlying install, the same reason enthusiasts have never run Factory or Upgrade installs because they know there would be endless issues.For example there have been zero return problems by those who follow the gold standard Clean Install here:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... It is better and faster than any previous version of Windows, and a better install than any amount of money could buy. So when you get time I'd study over that to see if it's something I can help you do.Until then you can go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Hyper-V not available.        In my list of Windows Features Hyper-V is not showing up.","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.What version of Windows do you have? Hyper-V isn't available in \"Home\" editions. Regards, David"]},{"symptom":"File Explorer resets before I can finish renaming a file        In my pictures folder I have a LOT of photos (from 2006 forward) put into folders by month. I am trying to add folders for recent months, which I am able to do. However when I try to rename the folder from \"New Folder\" to, say, \"2017-07 Vacation\" by the time I get to the \"V\" my whole folder rename resets and suddenly the name of the folder becomes \"V\" (wiping out my typing of \"2017-07 \") In order to accomplish what I want, I type just \"2017\" and hit enter, then go into rename and try to add \"-07\" before the reset happens and hit enter, then go into rename again and try to add \"Vacation\" before the reset. This takes several minutes. I've done some research and have seen posts suggesting it is my screen background choices, but I have only a solid color, no refreshes.This did not happen in good old Windows 7. And this appears to be a problem for several years. Will some developer at Microsoft take a look and fix? Seems like it would be easy to fix. You can use my system to debug lol.Hoping I don't get the pat answers from other posts.If this won't be fixed, does anyone have a suggestion for a program other than file explorer that does not have this issue?thanks for any help or advice.","solutions":["Post your problem in Feedback for the Microsoft engineers to see.","Hi mrsraben and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"SD card        I have recently had my Acer laptop serviced and the tech talked me into installing windows 10 and I hate it . can someone pleas tell me how I can view the contents of an SD card ?  On windows 7 I used to go to my drive menu and just select it from there.  thx","solutions":["Hi Donna My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.The way to view an SD card in Windows 10 is the same as Windows 7 - by using Windows Explorer. Press Windows key + E and browse to this PC in the left hand window and then click on the drive letter assigned to the sd card (if the sd card is being detected).Hope this helps.","I have Windows 10 with all current updates and when I place my SD card in the slot it automatically opens. You can go toThis PC and you should see all your available drives.  Also check what you have set for Auto Play."]}]}