{"windows":[{"symptom":"Corrupted File Explorer Display        I checked as best I could in \"Community\" for an answer to this and, while there were other issues of corrupted display, none of them addressed this specific problem.Can someone please tell me why my File Explorer display looks like this and how I can fix it? It's really inconvenient (as you can tell).- This problem began suddenly in just the past few days.- No software installed or updated around the time the problem began.- All Windows updates are current.- No problems found by Norton.- I ran \"sfc \/scannow\", as recommended in another thread, with no effect.Please help. I use this \"trail\" very often.","solutions":["HI CR. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Right click Start button to open Task Manager, show More Details, then choose Processes tab, scroll down to Windows Processes, then further down to Windows Explorer. Right click to Restart Explorer, then Restart PC.No expert in Forums - where we see the most cases, by the thousands - recommends Avast, AVG. Norton or McAfee, but we have solved many problems over the years by having them uninstalled.I would uninstall any 3rd party antivirus in Settings > Apps > Apps & Features and try running only built-in Defender which gives adequate protection, best Windows performance, least issues, and is from Microsoft who knows how to protect their OS best.After uninstalling antivirus in Settings > Apps > Apps & Features, restart the PC, then type Security in Start Search, open Windows Defender Settings, there and in Windows Defender Security Center fix anything that's flagged.If you want the best on-demand scanner download and install Malwarebytes from https:\/\/www.malwarebytes.com\/mwb-download\/ In it's Settings > Protection > Scan Options enable Scan for Rootkits. Then on Scan tab choose Threat Scan and Run Scan. Clean up anything found, restart PC and then run again until it comes up clean. If you want to keep Malwarebytes as an on-demand scanner then you can disable its Real Time trial version in it's Settings > Accounts tab.Next check for damaged System Files since the problem anti-viruses can damage WIndows just from uninstalling them:https:\/\/www.lifewire.com\/how-to-use-sfc-scannow... If it cannot repair them see Step 10 here to continue: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Not seeing the rest of the screen it is hard to tell if you happen to have highlighted something else."]},{"symptom":"how do i get the show desktop button back on the taskbar windows 10        How do I get the button back on the taskbar that when clicked minimizes all windows? I've searched and searched but can't find an answer anywhere. It's not in any of the settings that I can find. I can right click on the taskbar and find it there, but I can find no way to place it on the taskbar like it USED to be in windows. I can't right click on the text link (after right clicking on the taskbar to get that menu) and get a dialog to pin it to the taskbar because it immediately minimizes all the windows and closes the menu. I want this feature back. It's silly for microsoft to remove it or hide it so that it can't be found. ","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,If you are referring to the show desktop button on the lower right part of the screen, it is still available in windows 10. I'd first check if the task bar is expanded by hovering on the border and resizing the task bar.Other than that, you may re-enable the feature by, 1. Go to start menu and open settings 2. Go to personalization and open task bar 3. Locate \"Use Peek to preview the desktop when you move your mouse to the Show desktop button at the end of the taskbar\" and make sure it is enabledHere's a more informative source for how to enable it https:\/\/www.tenforums.com\/tutorials\/47266-turn-...As I personally use myself, I use the shortcut key to use the peek feature. You may to this by holding and pressing the windows key and the D key. Let me know how it goes. :)"]},{"symptom":"Can not type code in to identity verify window.        I am trying to verify my identity to change my icon photo on my windows 10 desktop, but when I try to type in the code, nothing happens, no numbers will appear in the box.     https:\/\/1drv.ms\/v\/s!AsLURsEy4UDUg5BdQkWfGUnjY_5BDQ?e=tFBj0r","solutions":["Did you click in the box before trying to type?","Hi James, I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.Would you try to launch On-Screen Keyboard and use that to type in the code please?Press Win+R, enter \"osk\", click Ok and an on-screen keyboard should appear. Use mouse cursor to point and click the code.Other methods to start it is available from this article: https:\/\/www.howtogeek.com\/240288\/how-to-use-the... Let me know if I can help you further! Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Already tried on screen keyboard, still not letting me type anything in the code box.    https:\/\/1drv.ms\/v\/s!AsLURsEy4UDUg5BdPiMU1aeU0Gy5sg?e=XXMtuO","I could only think of turning off two-step verification temporarily as a workaround. As soon as you are signed in, turn two-step verification back on.https:\/\/support.microsoft.com\/help\/4028586"]},{"symptom":"Java In Windows 10        Sir\/MadamIs Java necessary for Windows 10? If necessary what are the activities the software perform? Or Is there any problem if I uninstall the software \"Java- An Oracle Corporation\"?","solutions":["Hi Vishnu. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.You only need Java if an app requires it. The app will prompt you. So, yes, you can uninstall it and it's likely safer if you do.More to read about this here: https:\/\/www.bleepingcomputer.com\/forums\/t\/67517...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows Ink on display tablet using secondary display        Hello,I have an UGEE UG-1910B pen display tablet.  Unfortunately, the software\/drivers that come with the tablet are awful — The buggiest software I have ever seen. Completely unusable. So I am forced to use Windows Ink instead of any third-party driver, since it's the only thing that works. The problem, though, is that I have another monitor that I want to be my primary display. But when I use the tablet, it only works on whatever display is set as my \"primary\" display. So when I set my regular monitor as my primary display, the pen's cursor appears on my regular monitor. It only works when I set the small pen display as my primary display, which I do not like. It is annoying to have programs (especially games) open on the small screen off to the side, and very annoying to not have the notification tray on my main monitor.Is there a way around this? Some sort of setting I can change, a registry entry I can tweak, so that I can make Windows Ink work on a secondary display? In other words, so that my pen display tablet works normally while my other monitor is set to my primary display?Thanks.","solutions":["What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK","What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK Version 1909 (OS Build 18363.535) https:\/\/i.imgur.com\/DU3yocT.png"]},{"symptom":"microsoft solitary collection win10        I kept getting a 101 error so I deleted the app and now would like to download it. Where do I find the solitary collection?Thanks for your help,Clyde Hembree*** Email address is removed for privacy ***","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,If you have uninstalled the application and wish to re-install it, you may open the Microsoft store application right from your start menu and search for the application to re-download and re-installAside from that, you may use this link to install it on your device https:\/\/www.microsoft.com\/en-us\/p\/microsoft-sol...Let me know how it goes. :)"]},{"symptom":"Windows detected 3 game controller instead of 1        so idk why i have this problem, i wanted to play a game with a controller, i connected my bluetooth controller to my pc, andSteam (app) that detect my controller, instead of detecting 1 controller, it detected 3 controller, even im only playing with 1 controller, theres is also a program called x360ce, its a xbox 360 gamepad emulator, it detected that i have 3 controller too, pls help, (sry bad english)","solutions":[]},{"symptom":"Toshiba Laptop wont shutdown ...        comes up with TOSHIBA Flash Cards preventing it from sutting down. This is after I installed my latest updates","solutions":["Hi Kel. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Fixes for Toshiba Flash Cards preventing shutdown: https:\/\/copymonitor.blogspot.com\/2018\/06\/how-to...https:\/\/appuals.com\/fix-toshiba-flash-cards-pre...(avoid ad links especially Reimage which is undesirable) I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Netflix doesn't work on my Windows 10 PC        When I try to open Netflix on my PC (app and website), it signs in, but stays on the \"Try 30 Days Free\" page. However, on my Apple TV, Netflix still functions normally. ","solutions":["Hello! I am an Independent Advisor, I would love to help you out! Are you logged in to the same netflix account on your PC as you are with your apple TV?","You need to sign into your existing account to avoid creating a new account for that service under your Microsoft account. Did you try clickingsign in, in the upper right corner, using the same Netflix credentials used on your Apple TV?"," Yes, I am.","That's what I did, I clicked sign in and signed in with the same account I did with the Apple TV","Hi FonderBuffalo30, Please try the following fixes on your laptop: On your website go to: www.netflix.com\/logout Select Sign-in on the top right corner of the page Sign in with the same credentials as your Apple TV For your app do the following: Go to Start > type in Apps & features Click the Apps & features icon Go down to your Netflix app Go ahead and uninstall it Restart your computer Re-install it from the Microsoft store Sign in with the same credentials as your Apple TV Does this fix the problem?"]},{"symptom":"File is Indexed because it appears in subfolder search, but it does not appear in Document Search        I know that a particular file must be indexed correctly because I can as a test do a File Explorer search of the subfolder it is in, using an unusual name in the file's contents, and I can thereby produce that file name as a search result. So in general terms, indexing must be working properly.So why is it that when I search entire the Documents folder for this same unusual name, I get no return really, just the green bar going slowly all the away across, except for the final X, and then I continue to see indefinitely the message \"working on it\". For sure the search indexing function is searching subfolders because I can drag the target document down to a new lower level of subfolder, and I still get the correct file name returned.The Documents folder is 41 GB, but 28 GB of that is Outlook files. Is the search process perhaps getting indefinitely delayed in the giant Outlook folder? Maybe, I just don't know. But to bypass the big Outlook folder in an indexed search, I would have to move it temporarily out of Documents as a workaround. I have not tried that because it seems like there should be a better and routine way to do a simple index search of the document folder, when you already know index searching is generally working correctly.Is the search getting hung up because one particular Document subfolder lacks the system permission? I don't know if that happens, but it is a thought. Finding the problem subfolder does not sound like an easy task.Bottom line: Indexing and indexed content searching is working well, except from the Documents folder level, which is often the most useful level because you don't have to try to figure out which subfolder a specific document content might be in.Does anyone have any other thoughts or directions for the above problem definition, or perhaps is also experiencing it? Rebuilding the index does not seem to be the solution because indexing is working except for the entire documents folder.","solutions":[]},{"symptom":"\"These files have properties that can't be read, so we can't add them.\"        I read that this was asked before, and 3 people responded, but their responses were only deemed what 15 of the 112 people with the problem felt solved their problem. Then, Microsoft cut off all answers to the original problem.Taking the photo program out and re-installing it just seems risky, because I don't want to lose my entire animated video I've been working on. :) ","solutions":["Hi CGH. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.The most common reason for the error is the source drive is a flash stick or other than is not formatted NTFS so all the needed file properties cannot be copied.See here: https:\/\/forums.sandisk.com\/t5\/SanDisk-Clip-Spor...https:\/\/answers.microsoft.com\/en-us\/windows\/for...Besides reformatting the source drive you may need to redownload the file. I hope this helps."]},{"symptom":"HP W10 laptop incredibly zoomed in.        An acquaintance's laptop has zoomed in to incredible levels with seemingly no solution. CTRL+wheeldown or +\/- does nothing. I cannot access Windows personalization settings because of the severity of the zoom: https:\/\/i.imgur.com\/frSB4jD.jpg","solutions":["Start the computer in safe modeDisable or set your zoom settings to default. Try to login to normal mode and verify. ","Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.Try to press the \"windows + +\/-\" key This turns Windows zoom on and off.","Right click the desktop, click on Display settings, check Scale and layout, Change the size of text......Check the % level."]},{"symptom":"HOW DO I GET MY MICROSOFT WORD FILE BACK        WHEN THERE WAS A UPDATE MY MICROSOFT WORD WAS DELETEDWHY NOW MICROSOFT OFFICE- MORE COMPLICATED","solutions":["Hi FangedSpy3998, My name is Riccardo and I am going to assist you today with this issue. Was this due to a recent update with Windows or Office? We can try a few things here to assist... Step 1 - Let's check if its just not associating documents... Click the Windows Key + R Type in: winword Press OK or Press Enter Step 2 - Do a Repair Install of Office... Go to Start > type in Apps & Features Click the Apps & Features icon Scroll down to Microsoft Office 365 or 2010\/2013\/2016\/2019 Click your Office Installation Click Modify Do a Repair Install Step 3 - If you have Office 365, follow the steps below to do a reinstall: https:\/\/support.office.com\/en-us\/article\/downlo...Step 4 - Are your documents just not associated with Word anymore? Right-click one of your docx files Go to Open With > Click More Apps In the list there should be Word in there (if there is not we have to search for it)If it is not above go to the bottom of the list and click Look for another app on this PCGo to the location of C:\\Programs Files\\Microsoft Office\\ You may say an Office15 or Office16 or other folder in there, go in thereNear the bottom of that you will see winword, double click that. This will re-assocate Word with docx files. Let me know if the above helps and if you need anything further I will assist you.","I HAD MICROSOFT WORD - NOW I HAVE MICROSOFT OFFICE- WHICH IS SO CONFUSHINGWHEN I MAKE UP A DOCUMENT AND ADDING MORE TO IT READS DOCUMENT 2, ETCDO NOT KNOW HOW TO CORRECT THE MICROSOFT OFFICE TO BE LIKE MICROSOFT WORD AGAIN.I DO NOT KNOW WHY THIS HAPPENEDI TRIED INFORMATION THAT YOU SENT ME. SOME OF IT IS NOT THERE TO UPDATEWHAT NOW SHOULD I DOTHANK YOU","Can you send me some screenshots? Do you know what version of Microsoft Office you have?","windows 10always had Microsoft word, excel & powerpointI want Microsoft Word not Microsoft Officewhy was it changed","Microsoft Word, Excel and Powerpoint are part of the Microsoft Office suite of applications. Are you able to take some screenshots?","no I cannot take any screen shotssorry","OK, you may have received an update for Microsoft Office which is why this is happening; but, does Word, Excel and Powerpoint open it just looks different?"]},{"symptom":"Unable to view photos.        I just got this laptop and want to view pictures on a thumb drive. I can view some, but not all of the pictures. They are all in .jpg format. Some are viewable, and some get the error message \"It looks like we don't support this file format\".","solutions":["Hello CarolynCox1! My name is Marco, I am an Independent Advisor. I will do my best to help you.What program do you open your photos with? Did you use Photo viewer for Windows 10 ?"]},{"symptom":"\"Ask for Permission\" Error        I just recently got a gaming laptop for Christmas, a Dell G3 15 3590 to be specific. It runs a 64bit Windows 10 Home OS.I'm part of a Microsoft family and marked as \"Child\".Anyways, I have Xbox Game Pass Ultimate, so I checked the Xbox Beta app to see the games I could download.They all worked just fine, and some required me to ask for permission. Which also worked just fine.All except one, that being Sunset Overdrive, a game I played to DEATH on the Xbox One.Whenever I get the permission prompt and click the \"Ask via Email\" button, which is the only button for me, I get a message saying: \"Something went wrong. We're working on it, try again in a little bit.\" I wait 2 hours later, and the same error pops up.If any of you have a solution, I'd be grateful.AidenP.S. Here's my \"Trace ID\", if any of you need it: oXKtKwE2ZUW1ytoD.4.1","solutions":["Hi Aiden. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.We see a lot of problems here with Family Safety. What works most is to remove the Child account, sign out and restart PC, sign back in and add the child back:http:\/\/www.tenforums.com\/tutorials\/34763-child-...There's a guide to Family Safety here: https:\/\/www.lifewire.com\/microsoft-family-safet...FAQ's: https:\/\/answers.microsoft.com\/en-us\/windows\/for... Troubleshoot: https:\/\/answers.microsoft.com\/en-us\/windows\/for...Disable or even remove Family Safety: https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/www.wikihow.com\/Uninstall-Windows-Live-...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Showing less RAM than is installed.        I have installed 16g of RAM in my computer.  It is only showing 12g on Task Manager.  My mother board will accept 32g.  I am running Windows 10.  What can I do to recover my 4g?","solutions":["Hi Kane. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.The place to check RAM apportionment is in Resource Monitor. Click the link at the bottom of the Task Manager Performance tab.You will there see how much RAM is reserved to Hardware. If it's a GPU then that may also be adjustable in BIOS\/UEFI Setup or the Video card Settings. It is different for every GPU.Test the RAM overnight to stress it with the best bootable test memtest86, following this guide to test both sticks and slots:https:\/\/www.wikihow.com\/Test-PC-RAM-with-MemTest86Run the Crucial System Scanner to check the RAM is properly spec'd: https:\/\/www.crucial.com\/usa\/en\/systemscanner?cm... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","hi there:16GB of ram is the total ram. 12GB of ram is usable. For mine: I have 16GB of total ram. 15.9 usable. Based on properties."]},{"symptom":"Windows 10 scanning with Canon MX860 printer        Hello All, I have just purchased a new computer a Windows 10, I want to scan a document on my old printer and create a PDF, with my old computer I would do it from my printer, but with my new computer the creation of a scanned document to PDF is not working via my printer how or what can I do to go back to my old way of scanning documents from my printer or how do I scan a document on my new windows 10 computer using my old printer a Canon MX 860.","solutions":["Hello Rickybutler! My name is Marco, I am an Independent Advisor. I will do my best to help you.Did you download the drivers AND software for your printer on the company website?Otherwise, this is what you have to do, to create the pdf, surely it works with the program that goes with the printer."]},{"symptom":"extending my screen        I am trying to extend my screen from my laptop to my desktop ","solutions":[]},{"symptom":"Laptop Black Screen Charger Glitch        So whenever I unplug my laptop, it goes dark. Then when I plug it back in, it goes blank. I found a solution but it got annoying after 10 times of the method I came up with. Does anyone know a permanent solution?","solutions":["Hi Adi. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Does the battery work without the charger? Does the charger work without the battery? Try powering on with either to see if one works properly.The problem could be the battery or the charger. Does the Battery work properly? If not See these fixes for Battery Not Charging:https:\/\/www.groovypost.com\/howto\/troubleshoot-b...https:\/\/www.kapilarya.com\/fix-battery-plugged-i...Check the manufacturer's Support web page for your full model number to see if there is a battery issue or recall for it. Remember you have a full one year warranty for PC and parts replacement or repair so I'd use it if still available.Run the battery re-calibration here: https:\/\/www.howtogeek.com\/172271\/how-to-calibra... Then generate a battery report and post it back here: https:\/\/www.groovypost.com\/howto\/generate-batte... Right click Start to open Device Manager, under Battery choose the battery device, then Driver tab, then if available Roll Back the driver. If not available, choose Uninstall Driver, restart PC to reinstall.If in doubt about the charger, what I do is take it to a shop like Geek Squad and have them plug into the universal charger to test it then. If this resolves the problem you can buy a charger. But you have to spec OEM chargers precisely and they can still be bad. So I'd let the shop provide it so there's some warranty. You can also have them fix the problem if it's not the charger.If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....If nothing else helps then you might need to replace the battery. However I will tell you that most OEM after-market batteries and chargers have problems so I would only buy the official manufacturer's battery from the PC maker to be sure.I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"when i connect usb thetring they say no internet acess        i conect usb thetring daily but after installing java jdk and other things they said no internet access i uninstalled jdk and make like before but this problem no internet access coming and yellow caution sign comes on internet access teller what is soloution.","solutions":[]}]}