{"windows":[{"symptom":"Windows 10 can't update to any version.        My laptop is currently at 1803. I've tried to update to 1903 and 1909.But it always freezes at 27% no matter how I update it.I used Windows Update and Windows 10 Update Assistant.Here are some files from \"C:\\$WINDOWS.~BT\\Sources\".I've added English translations to Chinese words in the files.https:\/\/drive.google.com\/file\/d\/1JoD4tNMpmKgUQPovM31qNqrX21M1Ze0P\/view?usp=sharingHope to get some help from you guys, many thanks.","solutions":["Hi, Try to remove any external devices(external HDD etc) while updating. Also wait for several hours to finish the updates.","Hi! Thank you for your reply.I've tried these two suggestions before.Unfortunately they doesn't seem to be the issue.Any other method I can try?","Hi pewpew987, There's a lot of things to consider in regards to your current issue. You may want to check this article for suggested steps on how to troubleshoot this issue:https:\/\/www.wintips.org\/fix-windows-10-update-1...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","It does help me out!Main stuff I did is delete the Windows Update folder with the method it provided.Then I ran command Dism.exe \/Online \/Cleanup-Image \/Restorehealth andSFC \/SCANNOW.After that, I update with Windows 10 Update Assistant successfully.Can't believe that I've tried something much more complicated but nothing worked. And what it need is just a few steps to clear the WU(C:\\Windows\\SoftwareDistribution).Updated from 1803 to 1903, trying to update to 1909 now.Thank you for helping me out. Many thanks to both of you.","Hi pewpew, We do hope that you'll be able to rectify this issue once you upgrade to 1909, Please update us if this will be resolved. Thanks and regards,","Hi Richard,It updated successfully, but I bumped into some issues before it.The Windows Update and Windows 10 Update Assistant downloaded different updates at the same time and I rebooted to see if it'll work.Unfortunately it stuck at 27% again, so I rollback to try to fix this.First I froze the Windows Update and deleted (C:\\Windows\\SoftwareDistribution) again. After that I ran command Dism.exe \/Online \/Cleanup-Image \/Restorehealth.With these steps done, Windows 10 Update Assistant update the system to 1909 flawlessly.I think the main issue is that the SoftwareDistribution folder contain some corrupted files that stopped my laptop from updating.Problems should be cleared for now.Thank you so much on helping me out, I really appreciate it. :)","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Generally restarting Windows Update service initiates Windows Update again. Please go to services.msc and restart \"Windows Update\" service if you think the update is stalled.","My laptop is currently at 1803. I've tried to update to 1903 and 1909.But it always freezes at 27% no matter how I update it.I used Windows Update and Windows 10 Update Assistant.Here are some files from \"C:\\$WINDOWS.~BT\\Sources\".I've added English translations to Chinese words in the files.https:\/\/drive.google.com\/file\/d\/1JoD4tNMpmKgUQPovM31qNqrX21M1Ze0P\/view?usp=sharingHope to get some help from you guys, many thanks.When the Windows 10 November 2019 Update is ready for your device, it will be available to download from the Windows Update page in Settings. Choose a time that works best for you to download the update. You'll then need to restart your device and complete the installation. After that, your device will be running Windows 10, version 1909. (To check whether you're already running the November 2019 Update, select View update history on the Windows Update settings page.) Also note the following:  If you want to install the update now, select Start  > Settings  > Update & Security  > Windows Update , and then select Check for updates. If updates are available, install them. If version 1909 isn't offered automatically through Check for updates, you can get it manually through the Update Assistant.If you run into problems updating your device, including problems with previous major updates, see common fixes at Troubleshoot problems updating Windows 10, or use Fix Windows update issues to step you through the troubleshooting process.If you're warned by Windows Update that you don't have enough space on your device to install the update, see Free up space.If you experience internet connection issues while updating your device, see Fix network connection issues in Windows.If you're still running Windows 7 or Windows 8.1 and want to make the move to Windows 10, you can learn more at Upgrade to Windows 10: FAQ."]},{"symptom":"How to reinstall my windows 10 after a harddisk change        How to reinstall my windows 10 after a harddisk change,, also i don't have any sticker of product key and i bought it from Flipkart.com","solutions":["Hi prateekshukla1 , you can reinstall Windows 10 at any time, you will not need a Product Key, activation will be automatic and it will not cost you anything !Since you previously had Windows 10 installed and activated on that PC during the installation process skip the steps which ask for a product key and select the option 'I am Reinstalling Windows 10 on this PC', and activation will not be an issue, your PC will have a digital entitlement stored on the Microsoft Activation Servers Make sure you install the same Edition of Windows 10 (Home, Pro . . . etc.) you previously had installed to avoid Activation issuesClick this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), you can create a bootable USB flash drive (min 8GB) using that toolThen, Boot your PC from the Installation Media you just created (change Boot Order in your BIOS) to begin installing Windows 10","I have changed my harddisk is that not an issue??","Hi prateekshukla1 Changing your hard drive is a minor change and does not affect activation, it is only when you change your motherboard that activation can be a problem . . .","the repair guy installed window  with his pen drive now I want to reinstall my windows , sir kindly help with the procedure","Hi prateekshukla1 Use the method above to create the bootable installation media on a flash drive (minimum 8GB)Then start up your PC, on the manufacturers logo screen, repeatedly press F2 or the appropriate key to enter BIOSChange the boot order in BIOS so your system boots form that flash drive Then follow the instructions above to skip entering a product key and install Windows 10 . . .","I can't change the boot order as my dell laptop is locked with some administrator password in bios also i donwloaded the same version of windows 10 which was released on july 2015 and its stuck at express settings","Hi Prateek Since you have a Dell, try this, boot up your PC, then on the Dell logo screen, repeatedly press F12 instead, that should bring up a temporary boot menu, which should allow you to choose to boot from the USB drive . .."]},{"symptom":"Windows 10 keyboard stops working randomly        Hello, Right now I am facing a weird problem with my laptop (lenovo 15ISK) keyboard. I am using Windows 10 home edition. From last two months the keyboard is not working correctly.I am using virtual keyboard for login but after some time, windows pops up projection menu ( win+ p) and it automatically adds a screenshot to pictures folder.After that keyboard starts working or stops working for some times.The cycle keeps repeating with the interval of 3-4 minutes.I tried to reinstall keyboard drivers, disabled narrator, stick, filter keys, restored computer, uninstalled windows update but nothing worked.Can anyone help me with this issue?","solutions":["Hi Bhushan. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I will give you everything possible for keyboard problems. If you need help with any steps I'll be standing by here to help you.Sometimes a stuck key can be due to crumbs getting under it. Unplug keyboard or power off laptop, turn it upside down over a trash can and gently rake the keys to dislodge crumbs. If the key is still stuck, remove and clean under it as shown here:https:\/\/www.wikihow.com\/Repair-a-Laptop-Keyhttps:\/\/www.youtube.com\/watch?v=QCYOiK9QP08Try the Keyboard Troubleshooter at Settings > Update & Security > Troubleshoot. If this began within the recent past, See if you can System Restore to a point before the problem began:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... Check which Updates were installed at Settings > Update & Security > Windows Update > Installed Update History and try uninstalling any from around the time this started. If they return and cause the same problem then hide them with the Hide Updates tool:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... What also might work is to go into Device Manager, reached by right clicking the Start button, choose the Keyboard device, on Driver tab try Updating the driver automatically.If this fails from the same location try rolling back or Uninstalling the Keyboard driver, which works in a surprising number of cases where keyboard is messed up by Updates. Restart PC to reinstall driver.See if the keyboard will work in Safe Mode with Networking, or Safe Mode: https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... If not see if the On-screen Keyboard works at Settings > Ease of Access > Keyboard > Turn On the On Screen Keyboard.If so then it could confirm the keyboard is failing, so test it in repair mode to see if it works since it uses different drivers there:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... If not you can contact a laptop manufacturer to see if you can still get it replaced under warranty, or check for replacement keyboards for that model from the PC maker or online from after-market OEM's that exactly match it.Try resetting the keyboard: http:\/\/www.thewindowsclub.com\/reset-keyboard-se... You can also remap keyboard keys using one of these methods: https:\/\/www.makeuseof.com\/tag\/missing-key-remap... Check in your BIOS or UEFI firmware Setup for keyboard settings there, too. If it's a hardware problem then you can often easily replace a keyboard by asking Google for a replacement for your full model number laptop, confirm with seller it fits that unit, locate a video or tutorial the same way which demonstates swapping it in.If none of these works then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.Another thing that might help as it solves many problems is to Upgrade to the latest version by installing the Media Creation Tool from this linkhttp:\/\/windows.microsoft.com\/en-us\/windows-10\/m... choosing Download Tool Now, install the tool, open it and choose Upgrade this PC Now. This will save your files and apps while bringing you up to the latest version by the most stable method. It will also bring all of your Updates current and solve most problems since it reinstalls Windows.I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"computer background        I changed the background of my computer to a picture of a streaming series I want to start (it is for Stardew Valley). a few days later, my dad got on his work computer and asked me why it had Stardew Valley on it. the background was the same as my computer. could there have been any way this could've happened? (my dads work computer doesn't have any pictures on it(or photos(or videos)))","solutions":["Hi TheRidgeChannel_YT Yes, this can be caused by account syncing . . . On both PC's do this: Open the Settings App (gear icon on your Start Menu) Go to Accounts - Sync Your Settings Turn off all options on that page . . . Then restart each PC and change your background again, that should not be copied over to the other PC now . ..","Hi TheRidgeChannel_YT Yes, this can be caused by account syncing . . . On both PC's do this: Open the Settings App (gear icon on your Start Menu) Go to Accounts - Sync Your Settings Turn off all options on that page . . . Then restart each PC and change your background again, that should not be copied over to the other PC now . ..does this happen randomly sometimes?","Hi TheRidgeChannel_YT Yes, that can happen randomly, because OneDrive can get things mixed up, this is reported a lot . . ."]},{"symptom":"Microsoft Office 2019        I am having problems setting up my  Comcast email acccount in outlook 2019. It keeps reverting me back to my Hotmail settings","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Here is the guideline to configure Comcast for Outlook by Xfinity. https:\/\/www.xfinity.com\/support\/articles\/config...Please make sure you have performed these steps to configure the Comcast email account.","Thanks for responding. I have Microsoft 2019, will these steps work for this version of Outlook. The instructions provided was for Outlook 2013 and 2014.Please advise. Thanks,","Please try these steps. It should work. please let me know the status.","ArifAhmed2,Thanks for the  instructions for getting my Comcast email setup in MS Outlook 2019. The instructions worked. Thanks,","You're welcome"]},{"symptom":"Ran powercfg \/energy and found this... Any ideas?        System Availability Requests:System Required RequestThe device or driver has made a request to prevent the system from automatically entering sleep.Requesting Driver Instance獀瞂Requesting Driver DeviceThis was an error on the report, any ideas of what this could be or how I can find it?looks like a malicious driver or something of the sort.","solutions":[]},{"symptom":"I see my D drive, but I cannot open it and forces me to format it.        So about a month ago, my computer randomly was missing the D drive, and I couldn't find it for weeks. Then about 2 weeks ago, it suddenly pops up back into my file directory, but it doesn't show the storage bar or the amount of memory inside. Whenever I double click to open it, it takes a minute before it prompts me to format it. I tried to format it, but it tells me that Windows cannot format this drive. I'm not sure what to do and worried that it might be a hard drive failure. Thanks for any help!","solutions":["Have you gone to Disk Management?  win key + x","Hi AsiianPleb and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.1. Open File Explorer and click \"This PC\". 2. Right-click the drive that has a problem and clicks \"Properties\" 3. Go to the \"Tools\" tab, click \"Check\" and click \"Scan drive\". 4. Restart the PC. I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","So I was able to get all the way to the scan drive part, but it still prompts me to format my drive. Since I can't even format it, I'm stuck on that step, which is unfortunate. Is there possibly another way to resolve this?","Hi AsiianPleb, I will release the question for other experts come to give his opinion, I am sorry not to find the problem.Thanks!","Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.Please try the following steps to format the partition (D).1. Run Command Prompt as Administrator.2. Type diskpart to open the diskpart command prompt.3. Type list volume, press Enter, all the volume will be list.4. Type select volume n, press Enter, the volume you want to format will be selected.5. Then, type \"format fs=ntfs quick label=test\" and press Enter. (Command without quotes)","Volume n means the volume which denotes D drive. That means if D drive is Volume 2 then n=2, if D drive is Volume 3 then n=3","So I tried your method but that didn't work as well. I got to the last step but it says, \"DiskPart has encountered an error: The parameter is incorrect. See the System Event Log for more information.\" So I am not sure what to do now.","Well, in that case there might be a bad sector in the disk. To confirm that we may need to format the entire disk.Please refer to the following page and perform the steps to fix this issue by cleaning the entire disk.https:\/\/www.repairwin.com\/fix-diskpart-has-enco...Note: This is a Non-Microsoft website. However, I have checked the website to be potentially safe. (User's discretion is required)"]},{"symptom":"I can’t exit out of this please help        I’m stuck on a blue screen called “Do more with your voice” & I can’t exit out of it please help ","solutions":["Hi SR. I'm Greg, an installation specialist and 9 year Windows MVP here to help you.Did you try the accept key and it doesn't work? If so then click the Ease of Access options at bottom left to use the on-screen keyboard.Try also tapping the Tab key to see if it will move from button to button so you choose one of them. You can also try another keyboard.If you are in Windows Press and hold the power button to do a hard shutdown. Restart PC and immediately adjust the Screen Resolution so everything fits on the page.Update the Display driver from the PC or Display adapter maker's Support Downloads web page for your exact model number, HP Serial Number or Dell Service Tag - from the sticker on the PC.While there check also for newer chipset, BIOS, network, sound, USB3 and other drivers, comparing to the ones presently installed in Device Manager reached by right clicking the Start Menu.if this doesn't give you the latest or ideal driver for what you need, compare it to the driver offered by the Intel driver update Utility here:http:\/\/www.intel.com\/content\/www\/us\/en\/support\/... or the Nvidia Update utility here: http:\/\/www.nvidia.com\/Download\/Scan.aspx?lang=e... or the AMD autodect utility here: http:\/\/support.amd.com\/us\/gpudownload\/windows\/P... For Display issues one fix that is working is to Roll back or Uninstall the Driver on the Display Device > Driver tab, restart PC to reinstall driver.You can also try older drivers in Device Manager > Display device > Driver tab > Update Driver > Browse > Let Me Pick.Then you will know you've tried everything in addition to Windows Update drivers.I hope this helps. Feel free to ask back any questions and let us know how it goes. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi somerandomname1 You seem to be in the OOBE (out of box experience), are you currently installing Windows?Your screen is extremely zoomed in, that screen should look like the images belowTry using the Tab key on your keyboard to highlight the Accept button and then hit Enter to get past that screenOr try restarting the OOBE so that screen may show zoomed correctly - to restart the OOBE, press and hold the Power button on you PC for 5 - 10 seconds to perform a hard shut down . . .","I’m unable to click accept ","If this is during Windows install, then disconnect from the internet to force it to bypass those screens."]},{"symptom":"Windows Hello Promblem        When I reset my computer to try and fix the windows hello problem, it just keep on saying that something went wrong. I have an Acer Swift 3 running windows 10. This is what it looks like. ","solutions":["Hi FB. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See fixes here for Windows Hello: https:\/\/windows10skill.com\/windows-hello-not-wo...1) Turn off Fast Startup: Go to Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change settings that are unavailable > uncheck Fast Startup.2) Reset Facial Recognition and\/or Fingerprint Options https:\/\/blog.goptg.com\/how-to-reset-windows-hel...3) Modify Group Policy Settings (for Pro version only) Updates might have modified some of the crucial settings of Group Policy. Therefore, we would recommend to launch the Group Policy Editor and check\/edit the settings related to Windows Hello functionality.Pres Windows key, type gpedit, and press Enter. Click on Computer Configuration and open Administrative Templates. Select Windows Components and open Biometrics. Click on Facial Features and right-click on Configure enhanced anti-spoofing option.Select Edit and disable the Configure enhanced anti-spoofing feature. Reboot your PC. 4) Update drivers If some of the system drivers, most probably webcam and fingerprint reader drivers, were corrupted during the version upgrade process, Windows Hello may fail to perform. To fix that, try to update the corresponding drivers:Right-click on Windows key and select Device Manager. Locate the Hello, webcam, and fingerprint drivers individually and right-click on each of them.Select Remove driver software and wait for the removal to be finished. Repeat the removal with all Windows Hello related drivers and then reboot your PC.Once done, open Device Manager, click Action -> Scan for hardware changes. The system should automatically detect and reinstall the drivers. 5) If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool as shown here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... 6) If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....7) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 8) Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.9) If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... ________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","which one is the most simplist one? they seem complicated"]},{"symptom":"Can't log on as administrator, access denied.        I have a copy of Links 2003 that I ran with no problems under windows 7. I had to upgrade today to windows 10 because 7 will no longer be supported as of this coming Tuesday. I need to find out how to log on with Administrator privileges. Anyone have any suggestions?Jeff","solutions":["The error is bogus. The problem is nothing to do with admin. It's to do with MS preventing people who have old disc basedgames from launching those games. This, and heaps of other disc based games use SafeDisk copy protection. Not coincidentally, MS use SafeDisk in almostall of their games.  More details on DRM Blocking in my post at  ---this thread---Short story... You will need to us a noCD fix with this game.(you must not have updated Win7 for a very long time. MS put DRM Blocking into Win7 via updatekb3086255 in 2015.If your haven't updated in that long you have nothing to fear by loss of 'support' . )"]},{"symptom":"Windows 7 64x latest updates        According to Windows Update, the following updates have failed: KB4474419 issued 2019-3, KB4493132 issued 2019-7, KB4516065 issued 2019-9, and KB4516048 issued 2019-9.However KB4503548 successfully installed on 12-30-2019 and KB4533095 issued 2019-12 successfully installed on 1-8-2020.Do I actually NEED the updates that failed? I understand that a lot of the updates are updates of earlier updates and that it has to do with putting SHA-2 on your computer.My wonderful computer is a Toshiba so there is no point to putting Windows 10 on it. Sooner or later it will be impossible to even get a battery that only lasts a year. I only intend to use it offline as a legacy computer, but I would like all available updates to be on it.","solutions":["If your computer is running fine i would not bother with those Updates.( EOL ) end of life for Windows 7 is upon us next week anyway.Turn Updating OFF.Run a quality Anti Virus and complement it with a quality Anti Malware product such as Malwarebytes.Be prudent as to the sites that you visit and don`t open Unknown Sender E-Mails.Be cautious with any form of Internet Transactions as in Banking.Have strong Passwords.As to SHA-2 and SSU read the MS Window Support Link below.https:\/\/support.microsoft.com\/en-au\/help\/4472027\/2019-sha-2-code-signing-support-requirement-for-windows-and-wsus","Thank you. I do intend to forget about the failed updates. I have to get a new computer anyway, so this one will only be used offline. While I take my sweet time deciding what to get for a new computer, I am going to rely on my smartphone for internet access.","Thank you. I do intend to forget about the failed updates. I have to get a new computer anyway, so this one will only be used offline. While I take my sweet time deciding what to get for a new computer, I am going to rely on my smartphone for internet access. You can still use it on the Internet.Just use a quality Anti Virus and complement it with a Anti Malware Pro such as Malwarebytes.Be prudent as to the sites you visit.Cheers.","Actually the 4516065 is a roll up software for Win 7,almost the last.Try downloading from update catalog.http:\/\/catalog.update.microsoft.com\/v7\/site\/Search.aspx?q=4516065Locate the right OS,Microsoft doesn't create them for no reason..","I'm wary. I had Norton Antivirus, but my laptop got cranky and I got a pop-up window telling me that the solution was to download everything to a (Hitachi?) hard drive. The hard drive didn't make sense, so I just closed the window. After that my laptop got crankier and crankier until it almost didn't work anymore. I just did a clean install of the latest Norton Antivirus (with the help of a their tech who had to manually finish the install.) My laptop works perfectly now and I want it to stay that way. I don't know how the Security Companies plan to handle Windows 7 in the future, so I am going to make sure my laptop continues to work by taking it offline.","Actually the 4516065 is a roll up software for Win 7,almost the last.Try downloading from update catalog.http:\/\/catalog.update.microsoft.com\/v7\/site\/Search.aspx?q=4516065Locate the right OS,Microsoft doesn't create them for no reason..I also believe in downloading the updates. But it looks like the updates have had problems recently, including the ones for Windows 10. I looked at all the available information about the updates that failed. I don't understand a lot of what they do, but there have apparently been problems with installing them. Some of them fix what the earlier ones failed at doing. I may actually have everything, or I may not. i have never downloaded anything from the catalog before, and this is probably not a good time for a first try. So I am going to stick with what I have gotten out of Windows Update, unless someone knows that the two updates that succeeded are missing something important."]},{"symptom":"I keep getting a glnc_2505_401_ error on my sniper fury game        i keep getting a glnc_2505_401_ error on my sniper fury game only* Moved from Community Participation Center* Original title: ginc","solutions":["Hi Michael,This problem seems to have happened on many occasions with SF.   The following have been suggested but if the problem is within the game, then it will be difficult to correct;  try lodging your problem with Gameloft: https:\/\/forum.gameloft.com\/ You can try these:Clear your Internet cache.Make sure your WiFi Network is password protected so no one else is using it and lowering your bandwidth.Make sure that you don't have streaming or P2P software on your Wi-Fi network connection.Make sure that the signal strength is maximum and that your internet connection is stable.Restart your router and your WiFi connection.Make sure to have at least 20% of free space in your device's memory.Turn off your device for 2 minutes and then turn it back on.Close all background apps.Try a different internet connection, preferably from another ISP.Hope you can get a good result from this.Chris"]},{"symptom":"I’m stuck on a blue screen called “Do more with your voice” & I can’t exit out of it please help        I’m stuck on a blue screen called “Do more with your voice” & I can’t exit out of it please help ","solutions":["Hello MikeSpada, I'm Didi, an independent advisor. To fix the \"Do more with your voice” screen taking all the place on the screen check the answers of Greg Carmack and DaveM121 on this thread, scroll down to see their answers :https:\/\/answers.microsoft.com\/en-us\/windows\/for... Regards, Didi"]},{"symptom":"Omega Supercharts on Win10 Pro 32 bit        Upon installation of Omega Supercharts 4.0 Build 10  in Win10 Pro the legacy option didn't appear.  How to download the legacy option?   Got supercharts working in win10 pro w\/ settings; run in win x\/p service pack 3 compatability mode, and running it as an administrator, but the data is a day late.  By data venders data provides 1\/10th OHLC & vol , but Supercharts is only displaying data up to 1\/9th.  Does someone know were to get the eladate.ela file thatis more current than 9\/28\/1999? The file is located in c:\\omega\\SC folder. If so, please send the link or jsut send me the file.  Is there another solution to the date problem? ","solutions":[]},{"symptom":"Locked out of my computer        I was removing the password from the login,lock screen. But, during the process, I somehow deleted my account. Stupid of me!Now, I'm locked out of my computer. When, I put in my password, it says, try again.To reset my password, it says I need a DVD drive. But, it's a Dell. They have no DVDdrive. They do everything with USB drives. I do have another Dell, which is what,I'm using now. But, this computer was a replacement. And, I have to send it back.But, I need to get that computer fixed first. It's a catch 22. I'm locked out?In the state, the computer is in, would their be anyway to get it to reset? I have everything backed up to a USB drive. So, wiping it would me OK.I can create a Windows 10 installation, on a USB drive, if that would help? I rememberbefore, when I reset a computer, it just did it thru the WiFi cloud. So, please tell me, you have an idea, on how I can fix this?Thanks for reading . . . Jerry* Original title: Please Help . . .","solutions":["Hi, Jerry_Dwyer My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I somehow deleted my account. When I put in my password, it says, try again.I am a little confused. If you deleted your account, how can you try to log on to it? If it was really deleted then it would not show up on the logon screen!","* Merged * Original title: Hoping for another opinion . . .I was removing the password from the login,lock screen. But, during the process, in the bios, I somehow deleted my account. Stupid of me!Now, I'm locked out of my computer. When, I put in my password, it says, try again.To reset my password, it says I need a DVD drive. But, it's a Dell. They have no DVDdrive. They do everything with USB drives. I do have another Dell, which is what,I'm using now. But, this computer was a replacement. And, I have to send it back.But, I need to get that computer fixed first. It's a catch 22. I'm locked out?In the state, the computer is in, would their be anyway to get it to reset? I have everything backed up to a USB drive. So, wiping it would me OK.I can create a Windows 10 installation, on a USB drive, if that would help? I rememberbefore, when I reset a computer, it just did it thru the WiFi cloud. So, please tell me, you have an idea, on how I can fix this?Thanks for reading . . . Jerry","Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,As an alternative to performing a reset of the system, you may access the windows recovery page.You may access the page by going to the sign in screen press and hold the shift key and press the on screen power button to choose the restart. It will then reboot and direct you to the windows recovery environment.Another alternative is, Start your computer, once the computer goes to the windows logo screen press and hold the power button for 5-10 seconds to shut it down completely. Do this for 3-5 times to force access the recovery environment.a) Reset this PC Normally, you'd be given 2 options here. The first one is to keep your files although this process would ask for your password. As you've already created a backup to most of your files, you may process the remove everything option as it will not ask for an existing password. Troubleshoot - Advanced Option - Reset this PC Alternative to reinstalling windows https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/support.microsoft.com\/en-in\/help\/400073...Let me know how it goes. :)","You're in deep, my friend.The lock screen and the login screen are two separate things. There's no password on the lock screen - the password is on the login screen.You will never read anything from Microsoft that says it's okay for a user to run their computer without a password-protected account. So if eliminating password protection is your goal ... good luck.The BIOS is not the place where you create and delete user accounts.There's no such thing as a WiFi cloud. WiFi and the cloud are separate things. WiFi is a local network technology. The cloud is a colloquial name for the internet.If I were you I would stop now and have a professional fix the computer. I know you mean well, but you're making a mess. Not the kind of mess that I used to make ... nowthat was impressive ... but a mess just the same. Time to draw a line in the sand.","Thanks for reading . . . I guess, that's what, I'll have to do . . . I have, one other option.There are Computer clubs, around here. They will, look at it, for free.I'll have to wait . . . And I will, just have to wait, and hope, for the best? Thanks again - Jerry","Thanks for reading . . . I guess, that's what, I'll have to do . . . I have, one other option.There are Computer clubs, around here. They will, look at it, for free.I'll have to wait . . . And I will, just have to wait, and hope, for the best? Thanks again - Jerry","My pleasure Jerry! Fingers crossed. :)"]},{"symptom":"windows 10 start button and taskbar buttons \"no-show\" (nothing happens) when clicked        i am confused if virus or malware causes this problem, cause nothing happens if i clicked any taskbar buttons including start.  windows is updated but still nothing happens. your opinions are highly appreciated","solutions":["Hi bossdavs, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Start with the steps here: Fix problems with the Start menu https:\/\/support.microsoft.com\/en-in\/help\/12385\/...Let us know if that doesn't help."]},{"symptom":"Download Age of mythology with an old CD product key        Dear sir, madamSeveral years ago I bought Age of mythology on CD.Now I have a new laptop, without a dvd-player. As a consequence I can't install the game.Is there any way I can download the game online with my cd product key (without paying again).I already made an account on Steam, because my Google searches led me to the website. There I tried to activate my product key, but it was denied, probably because the key wasn't intended tot register on Steam. Maybe I can get another product key based on the one I bought years ago that I can use on Steam or there is another way to get game?This is my product key: VGTX7-DJKDX-XH6HM-3FW4F-4JM8B.GreetingsGregory","solutions":["Hi, My name is Will i'm an independent adviser. Please don't ever share product keys online, they are personal to you and you risk your software license being stolen by posting them. No matter how old the key might be, they are almost always single-use.Currently the game is only officially available via Steam. As the code isn't registered as a steam product it can't be used to activate it. Unless you have another device with a disc drive you can copy the files on the disc from. I don't think you will be able to run it without buying the game again, as the original version is no longer available. And wasn't made available for download previously.I hope that helps.","You won't be able to get a download version of this game using a disc key. There are a small number of disc based games thatused GFWL that can be redeemed on Steam or the developers site, but this game does not apply to that exception.- Yes, do delete the key as best practice, but you won't need to worry about the key for a game of this vintage being single use.- What you can do if you have access to a machine with a CD\\DVD drive, is install the game on that machine and then copy\\paste itto your laptop. This often works with old games of this vintage. However, you would need to use a noCD fix\\hack to run the game.This would apply even if you had a CD\\DVD player on your machine because of an issue MS created for people with old disc based games.More details on DRM Blocking in my post at   ---this thread---- I have heard rumours that developers (when they still exist) of some old games that use SafeDisc will redeem the disc code for a download,but this would not be likely with AOE as they have re-released the game in an 'extended' edition.."]},{"symptom":"1909 Update file explorer search issue.        New 1909 update broke the file explorer search. Now after file explorer window has been open 10+ minutes the search option is grayed out. Text does not show in the bar and the only way to be able to type again is to task kill file explorer from taskmgr. I have tried to run the search and index troubleshooter but it says everything is working as intended. I have restarted the windows search service, and I have reset the windows search but this issue happens every day. Any suggestions? ","solutions":["Hi Mary, You can try basic troubleshooting step below to check and fix any registry errors.1. Open an elevated command prompt. To do this, right click the Windows button, and then select Command Prompt (Admin). If you are prompted for an administrator password or for a confirmation, type the password, or click Allow or Yes.2. Type the following command, and then press Enter. - DISM.exe \/Online \/Cleanup-image \/Scanhealth - DISM.exe \/Online \/Cleanup-image \/Restorehealth - DISM.exe \/online \/cleanup-image \/startcomponentcleanup - Note It might take several minutes for the command operation to be completed. 3. Type the following command and press Enter. - sfc \/scannow Note It might take several minutes for the command operation to be completed. Let me know how it works for you.","Hi Mary,We are seeing many reports of this. Can you share the feedback link with us so that the issue can be escalated?All steps are here:https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/file-explorer-search-not-working-in-windows-10\/3c70ea75-79a8-4f3b-b10a-86be1f22931c","Ricky,    It says you responded to my question but all I can see are 4 separate instances of your repeating my original statement. ","New 1909 update broke the file explorer search. Now after file explorer window has been open 10+ minutes the search option is grayed out. Text does not show in the bar and the only way to be able to type again is to task kill file explorer from taskmgr. I have tried to run the search and index troubleshooter but it says everything is working as intended. I have restarted the windows search service, and I have reset the windows search but this issue happens every day. Any suggestions? I changed windows services to automatic no delay start. and on recovery tab restart after 5 minutes and no issues  on any of my computersfor 5 hours so far. Before that it would suspend search after 5 minutes or so and i would have to restart explorer big pain as it closes all open windows. ","I wrote a .bat to task kill explorer.exe and that seems to be a good temporary fix. ","I wrote a .bat to task kill explorer.exe and that seems to be a good temporary fix. I have been running all day now with 5 windows open and search results in them killing explorer closes them.","I know. The only solution I’ve found other than rolling back the update is to task kill explorer and reopen the window. ","I know. The only solution I’ve found other than rolling back the update is to task kill explorer and reopen the window. read what I put up it works","It's pretty crappy that a basic windows function is broken and they want us to wait weeks if not months for the next build to fix it!","There isn't a problem with the file search.Have a look for the big red X (close search) in the \"Search\" ribbon.  Hit that and you are back to normal file view ribbon.The real issue is the abysmal lack of documentation that the Microsoft responders couldn't even find.One major change is that the search doesn't start while you are typing the text as it used to."]},{"symptom":"what is code 9.0 on origin mean        Origin doesn't download. I keep getting a 9.0 code and have no idea what that means. Origin is aware of the issues as several people started having the same issue last night. From what I have been reading this has been happening off and on since 2016.Anyone have a solution?","solutions":["When you say 'Origin doesn't download', are you referring to an Origin update, game download\\install,or are you installing Origin for the first time ?Assuming there are no other download issues, I would think the problem is from Origin, but...My first suspect when a download does not happen is it may be getting blocked by my Anti-virus or Firewall.Have you tried disabling the AV temporarily ?- Is your Win10 up to date ? If you are not sure, run Windows Updates manually to verify.Yes, it looks like the error has been around for a few years, hopefully more trawling will reveal a fix that works for you ? -  www  Origin code 9.0 error."]},{"symptom":"How to fix Event ID 455 ESENT error in Windows 10 V1903?        I am getting  Event Error 'ESENT-455' multiple times since updating to Version 1903-Build18362.175. Description: (copied from event error log)\"svchost (15692,R,98) TILEREPOSITORYS-1-5-18: Error -1023 (0xfffffc01) occurred while opening logfileC:\\WINDOWS\\system32\\config\\systemprofile\\AppData\\Local\\TileDataLayer\\Database\\EDB.log.\"I found the thread at Web site, 'Known Issues for Windows 10 May 2019 Update version 1903'' addressing this specific problem, (https:\/\/www.tenforums.com\/windows-10-news\/133041-known-issues-windows-10-may-2019-update-version-1903-a-2.html#post1638963)The found solution was,\" to go to Windows\\system32\\config\\systemprofile\\AppData\\Local\\Create the folder TileDataLayer then inside that folder create Database folder.\"This issue was evidently a known problem and is created most likely when Cleaning up the old Version 1806, which I did after an initial few days of trial with Version 1903.I cannot find file  \"C: \\Windows\\system32\\config\\systemprofile\\AppData\\Local\\ when I run a search of \"My PC', in Windows Explorer. Where am I supposed to look to find the file \"Windows\\System32\\config\\systemprofile\\AppData\\Local\" , and how do I create new folders within that existing command (?)file,  and can this fix be explained more in terms a neophyte can understand, and will feel confident that I won't mess things up worse in trying to eliminate this recurring error?ThanksAndy Asmussen*Modified title for accuracy**Original title: Event Viewer Erro 'ESENT-455' since Update 1903*","solutions":["Hi Andy My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.Press Windows key + R Type: C:\\Windows\\system32\\config\\systemprofile\\AppData\\Local\\ Hit Enter Create the folder TileDataLayer Open it then create another folder called Database","I was having this same issue. Here's what I did to fix it (based upon some other replies in this thread):Open a CMD shell as Administrator.That started me off in c:\\Windows\\system32.cd config\\systemprofile\\AppData\\Localmkdir TileDataLayercd TileDataLayermkdir DatabaseSince then I haven't seen the error message in the event viewer."]}]}