{"windows":[{"symptom":"Microsoft Solitaire        I am unable to proceed in playing to the next level. Sure it is something wrong with this game (Microsoft Solitaire Spider)","solutions":["Hi Mario, My name is Nick and I am an Independent Advisor. I recommend that you post your query on Microsoft Causal Games Community, where the experts well equipped with the knowledge on this issue can assist you.https:\/\/community.microsoftcasualgames.com\/game..."]},{"symptom":"Win 10 canot be installed        hiafter i build my new pc z390 Msi acesamsung evo970 plus 500g2080ti asus oc rog strix16 g g.skill 3600 ddr4 ramfor the first time the win refuse to load from usp flashafter search i adjust few settings and it load to install but after install win it stuck at msi logo and never load the win logo   even never give an error just stay at msi logo and never load the win i try to install it many times but same resultsplease can you help i download win ver from microsoft sitethanks","solutions":["Hello and thank you for contacting us. My name is Angelo and I am an Independent Adviser on here.The best way to burn your USB Windows installation drive is with the Windows 10 Installation media:https:\/\/www.microsoft.com\/en-gb\/software-downlo...When it asks to upgrade or burn to USB you select USB Please keep us posted Regards Angelo","thank you but i already do this and after i enter installation and done all steps for win installand after it has been copy all files to my M.2and restart it freeze at msi logo never boot the winneed to know is there any problem and solution pleasebest","Hello MeDo_SaMiR Please try and upgrade your UEFI BIOS If you have 2 x 8 RAM modules please try and remove one of them while installing Windows.Keep us posted Regards Angelo","done i remove one of ram and upgrade bios to latest ver and reinstall the winstill the same logo of msi and no loading but the mouse is working and i can move itbut stay at the same logo of msi","is that mean i have problem in my hardware or may be system issue ","Hello MeDo_SaMiR Did you plug your USB installation media into a USB 3 or USB 2 port? If you plugged it into a USB 3 port try plugging it into a USB 2 port, it's the grey ones.Try downloading the ISO file and burn the USB stick with RUFUS: https:\/\/rufus.ie\/ Windows 1909 ISO 64bits: https:\/\/software-download.microsoft.com\/pr\/Win1...Windows 1909 ISO 32bits: https:\/\/software-download.microsoft.com\/pr\/Win1...Please download the ISO file and open Rufus Make sure the settings are like my screenshot Burn the USB drive and try reinstalling Windows with only one RAM bank Keep us posted Regards Angelo ________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Sorry it stay the sameif there any this i can do in motherboard can chnage thisplease need your support","here is the solution after may be 1000000 try and fail :(don't install the latest ver try to install the oldest one yes you see it correctly the oldest one you haveit will work finally i install the win thank you for help","Hello MeDo_SaMiR, I am Andrew, so sorry you're having this issue. Reading through the steps you've taken so far I see 1 thing to try. Since you've tried updating your BIOS already we will skip that, but reenter the BIOS and reset the defaults. Then enable LEGACY boot mode. Save and exit. Remove all peripheral devices not needed, EG a camera, headphones, speakers ect. When you go to reinstall Windows choose to delete all partitions on your hard drive, if none store personal data, then recreate the partitions for Windows. When Windows Installer reboots remove the USB to boot and start the personalize steps.Let us know how these steps work out for you, take care. Andrew"]},{"symptom":"Can't access external hard drive files. Please help.        So long story short, I managed to get an old 500 gb external hard drive to be recognised by windows, and it displays the drive. I have a steam game (rainbow six siege) moved onto there which works perfectly fine.But when it comes to browsing the drive's files, as soon as I click on a file or folder (without even opening it), it closes out of the file explorer and refreshes the pc screen (reloads the task bar, opened windows etc).I've got no idea what to do.It is formatted as NTFS and I created the partition in disk management... but I just can't access the files without it refreshing my screen and closing the file explorer.Please help.Thanks,Jay","solutions":["Hi JayBFC99, My name is Riccardo and I'd be happy to assist...let's try a few troubleshooting items to see if we can get this working for you!First and foremost, let's do a chkdsk on this drive. So let's say this drive is called your D:\\ driveGo to Start > type in cmd and right-click Command Prompt and Run as Administrator > type in: d: to get to your drive dthen type in: cd\\ Then type in chkdsk This should start the process of checking the disk for you. After that is done, type in the following: bootsect \/nt60 d: \/mbr This should fix the master boot record. Let me know if the above helps - you may need to restart your computer. Thanks and Happy New Year!"]},{"symptom":"Xbox Controllers issue        I tried two different Xbox controllers on my PC and they won’t work. I checked them with Xbox and they worked there. The device manager showed that the driver is incorrect but I cannot update because of the error Windows found drivers for your device but encountered something... and  \"Xbox Gaming Device\" under it","solutions":["Hi, My name is Nick and I am an Independent Advisor. I recommend that you try to install alternate drivers. 1) Press Windows Logo key + X and select Device Manager 2) Right-click on the Xbox controller driver to select Update Driver 3) Click on Browse my computer for Driver Software 4) Click on Let me pick from a list of available drivers 5) Mark the box Show Compatible Hardware and click on the driver 6) Click on Yes"]},{"symptom":"Cribbage Classic Game        While in the middle of a \"Cribbage Classic\" game, the app seems to freeze and the \"hint\" box disappears.  I cannot discard or move the game along.  I end up having to end the game.  Four or five games later, the problem reoccurs.  I am current on all updates.","solutions":["This is a forum for those testing Windows 10Insider Builds.What Insider build are you on?Right click Start, Run and type winver for build #.","January 1, 2020Version 1809 (OS Build 17763.914)","Hi Jimmy,The Windows Insider Program forum is just for discussing preview builds of Windows 10. You are on a public build so I have moved your post to the Windows 10 gaming forum."]},{"symptom":"error running a game.        so I'm trying to play this game on my pc and an error message appears \" DX11 feature 10.0 is required to run this engine\" my current pc has windows 10 with DirectX 12. I've seen and read many questions about this on different forums and I just can't seem to get it. Do I have to buy a new graphics card? Is there a directx11 driver I can download, which doesn't make sense to downgrade just for a game. what do I need to do?","solutions":["Hi, No you don't need a new Graphics card if your supports DirectX 12 you should be fine. Each major version of DirectX has it's own sub versions so 10.0 in this case is a DirectX 10.0 update for DX11. Please make sure your graphics drivers are up to date.Your drivers bundle updates for each separate major version, ie you could receive updates for DX11 and 12 in one update feasibly.I hope that helps.","I’ve updated my drivers and checked for various updates. Still getting the Same error message","Hello MarcosBatista, I am Andrew. DirectX is not backwards compatible with everything as it's a different collection of APIs. Follow this link to Microsoft downloads and install DirectX 11, this should solve your issue.https:\/\/www.microsoft.com\/en-ca\/download\/detail...Take Care"]},{"symptom":"How to find driver?        My driver is corrupted. Please help me find driver for Mathita B D M L T U J 260 A F","solutions":["Hi Anna, My name is Nick and I am an Independent Advisor. Please find the instructions to follow below I recommend that you refer the instructions from the article Update drivers in Windows 10https:\/\/support.microsoft.com\/en-us\/help\/402844...Then download update for Windows 7 from MATSHITA:registered: BD-MLT UJ260 Firmware Updatehttps:\/\/www.sony.com\/electronics\/support\/downlo...Update for Windows 10 is not available, so try installing it in the compatibility mode and check if you solved the problem. Please use the article Make older apps or programs compatible with Windows 10https:\/\/support.microsoft.com\/en-us\/help\/15078\/...Disclaimer: you can find here links to a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Windows 10 Language Bar is missing        I have checked the settings most commonly referenced to get the Language bar to show w\/out any success in getting to appear. I also have run sfc \/scannow to validate Windows.Why is the language bar refusing to display (dock in the Task Bar)? It used to work...Show Language Bar, Docked in the taskbar ONInput Indicator is ONsfc \/scannow checks out","solutions":["Hi there My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Here are some solutions you may want to try. 1. Check Registry You may have to make a small change in the Windows registry to help the language bar reappear on the taskbar. Press Windows+R to open the RUN prompt and type regedit before hitting Enter.You will now navigate to the following folder path: HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run Right-click anywhere on the empty area in the right windowpane and select String Value under New.That will create a new file named New Value #1 and you can name it anything. Right-click on it and select Modify.Enter the following value. \"ctfmon\"=\"CTFMON.EXE\" Hit Ok, and reboot your system to check if the language bar is visible on the taskbar.2. Remove\/Add a Language Some users have reported that removing and adding their preferred secondary languages did the trick. To do this, press the Windows+I shortcut to open Settings and click on Time & Language.Under Region & language, you can delete a language pack by clicking on its name and selecting Remove option. Keep your primary language as it is and remove secondary languages — all of them.To add a language back, click on Add a language on the same screen, search for your preferred language and click on Next.In the next screen, you can select whether you want the language for display only or for speech and handwriting too. Click Install and you are done.3. Update Windows Are you using the latest version of Windows? Press the Windows Key+I keys to open Settings and select Update & Security.Click on the Check for updates button and if there are any, Windows will offer to install them. For the most part, Windows will install these updates automatically but maybe auto updates are turned off on your system.Hope this helps.","1. Did not work.2. Did not work.3. Did not work.Language bar is busted.","dism run in addition. and another sfc. Windows 10 is busted.","ctfmon key... multiple reboots, language uninstall, reinstall, etc....","Hi randomname00 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I would suggest you do a repair using In-place Upgrade. Check this article for detailed instructions.https:\/\/www.kapilarya.com\/how-to-repair-windows...I hope this helps. Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Dism is a windows repair. It failed to fix the problem.https:\/\/support.microsoft.com\/en-us\/help\/947821\/fix-windows-update-errors-by-using-the-dism-or-system-update-readiness","Hi randomname00, I will release the question for other experts come to give his opinion, I am sorry not to find the problem.Thanks."]},{"symptom":"Bluetooth connection        I am using a Dell all in one PC about a year old with Windows 10. When I connect earbuds via settings: bluetooth it shows \"Connected\" but sound comes through speakers. Have tried disconnecting and reconnecting and different brands of earbuds to no avail. Sound works fine through speakers. How do I make the earbuds work? Thanks","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please try the following steps and reset the Bluetooth driver. Go to Device Manager Locate and expand Network Adapter. Right click and select Uninstall. (Do Not click on any Check Box) Restart the PC. Connect the Earbuds again and check if it works."]},{"symptom":"attaching emails        On windows 7 I could attach emails from documents with send and receive but this doesn't work for windows 10. How do I do this please?","solutions":["Hi Anne! I'm Steve, an Independent Advisor and a Windows user like you. I'm happy to help with your query.Which email client are you using on your Windows 10 computer (e.g. Outlook, Windows Mail, or another app)?","Hi SteveI'm using gmail","Hello AnnePenton, if you are using Gmail through a web browser and not a Microsoft email client such as Outlook or Windows Mail I would suggest contacting Google. This sounds like a change in their email setup. If you go to google.com and scroll to the bottom of the page you will find a CONTACT US link."]},{"symptom":"Windows 10 Firewall Issue        I'm using a program called Folder Firewall Blocker to block files and it does its job, but when I go back to check the Allowed Apps and Features section, I can see all of the files I've blocked along with a check mark next to each one, so then I clear those check marks, then check the advanced settings and It shows that half of the previously blocked rules are no longer active. As you can see in the screenshots, the block rules are active in the advanced settings but in the allow apps to communicate through the windows defender firewall..they have a checkmark next to them. Am I doing something wrong? ","solutions":["\"I'm using a program called Folder Firewall Blocker\"I'm afraid we are not able to provide support for 3rd party applications. You might want to clarify with the developers of Folder Firewall Blocker how their software is supposed to work.","I understand that, but why does it say that the rule is blocked and active in the advanced settings but then has a check next to it in the the block apps and features section? This happens when I try to block it without the program, even if I reset Windows Firewall to default settings. ","Because you are looking at two different things: windows firewall will block or allow and app to communicate via internet\/network. Controlled folder access will block or allow an app to access and\/or modify folders on your computer. "]},{"symptom":"outlook problem        what do i need outlook for?  I have an android tablet...i send emails using IMAP\/Yahoo email..I never have any need for outlook and dont even know how to access it..whats it even there for?  I think outlook is sending a duplicate copy of my SENT yahoo emails using the IMAP system back to my android tablet..sent folder..very annoying..how do i stop outlook from sending a duplicate copy of my sent emails to my android tablet sent folder???","solutions":["Hello. Outlook is the email client that is part of the Office suite of productivity software. Did you happen to activate a trial of Office on your PC? If not, I don't see how Outlook is having any effect on your email. Why do you think that Outlook is sending you duplicates?","Do you mean Microsoft Office outlook, or the Hotmail replacement which is called Outlook.com?","i have a microsoft phone not working on store but later was working i can apdate the window not working ","i have a microsoft phone not working on store but later was working i can apdate the window not working Post your question in the Mobile Devices forums here.And start your own thread there:https:\/\/answers.microsoft.com\/en-us\/mobiledevices\/forum?sort=LastReplyDate&dir=Desc&tab=All&status=all&mod=&modAge=&advFil=&postedAfter=&postedBefore=&threadType=All&isFilterExpanded=false&page=1"]},{"symptom":"problem getting past login        problem getting past login","solutions":["Hello! I am an Independent Advisor, I would love to help you out! Which login are you having trouble getting past? Is this the Windows 10 initial sign in, or outlook.com or something else?What exactly is happening?","when I start the computer I get a request for my Microsoft login in.  It wont except my login and I know its right cause my laptop opens up with it","Would you be able to send a screenshot of the screen you are seeing?","no I cant....  doesn't seem to be able to recognize my router either..  geez  just answered my own question didnt I LOL.   so I guess my next question would be how do I get it to recognize my computer?","Hello, I am Andrew and wish to help. A lot of times your Microsoft login will not work for Windows because it has no internet connection. Shut down your computer using the power icon in the bottom right corner, then unplug and reset your incoming modem and router. Start up your computer after all the internet devices have fully rebooted and try your login again. If it fails again use a different device to both test the internet connection then go to account.microsoft.com and attempt to sign in using the same account. This will verify the proper password is being used. Let us know what steps you had done and if it resolved your problem. Andrew"]},{"symptom":"BSOD Critical_Structure_Error from BugCheck on newish self-built computer        Hi all,I've been getting some BSOD crashes on my computer that is fairly new. I was having issues since I started, but fixed most with a re-install of Windows and updating drivers. It was working nicely until it started BSODing yesterday, and has since crashed three times. From my understanding of the Event Viewer, it seems to be the same issue each time, but I'm not sure. It's definitely been the same error each time.I've included the last three minidumps and System Info in the link below.https:\/\/1drv.ms\/f\/s!AoPFNUsj2Mnxv1hBYRrT5pS5eKaWI've been having another problem, which may or may not be related. My system has two monitors plugged in, and when I have a fullscreen game on one screen and Chrome with YouTube or another moving visual on the other (e.g. gifs) both monitors will within minutes go black saying they've lost signal. Sound is still running and it seems like I can still interact with the computer, but I cannot get the screens back without a power button restart. No idea if it's related, I can work around it for now, but mentioned it in case it might be relevant.","solutions":["Have you gone to Device Manager and checked all of the drivers for your system?","Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.Please perform the following steps and observe the PC.Open Settings.Click on System.Click on Storage.Under the \"Storage sense\" section, click the Free up space now option. (If you're running the Windows 10 May 2019 Update, under the \"Local Disk\" section, click the Temporary files item.)Clear the preselected options.Check the Temporary Windows installation files option.Click the Remove files button.","Hi Arif,Looks like I have the May 2019 update, as there was nothing under the Storage Sense section, but Temporary files was under Local Disk. However, there was no option with that name. ","Every device has a driver. I've been through the entire list, like every single item, to check for updates, and every single one came back saying I had the best available driver. When I first built the PC, there were a number of drivers I had to update or find, and that seemed to fix the issues I was seeing at the time, but then these new BSOD's started about 2 weeks later. I hadn't made any hardware changes and don't think I actually installed anything other than maybe a few games.","Hello SDNewmarch, I am Andrew and have some advice. BSODs are usually caused by damaged system files, this can happen for many reasons. Please follow these steps to repair your Windows installation.In the search bar, type cmd. Right-click on cmd.exe and select Run as Administrator. Type SFC \/scannow and press the Enter key. Re-enter Command Prompt as Administrator and run these: dism.exe \/online \/cleanup-image \/scanhealth dism.exe \/online \/cleanup-image \/restorehealth dism.exe \/online \/cleanup-image \/startcomponentcleanup Perform these and let us know how your BSODs are."]},{"symptom":"Can i completly disable Intel HD Graphics?        When i open the task manager at performence i see this GPU 0 who is Intel HD GraphicsI prefer to disable it and use my dedicated video card who in this moment is an GTX 660","solutions":["Hi PoMihai, I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.You will want to investigate if you can disable discrete graphics from the BIOS for your computer. For example, HP laptops have an option in BIOS:https:\/\/support.hp.com\/us-en\/document\/c04070522If you don't have that, NVIDIA Control Panel's Manage 3D Settings > Preferred Graphics Processor under Global Settings is your next best bet. Change this to high-performance NVIDIA processor. Intel GPU will still be there, but all graphics operations should move to NVIDIA processor. https:\/\/support.lenovo.com\/us\/en\/solutions\/ht07... (expand section on Intel and Nvidia dual graphics)Let me know if I can help you further! Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Google Chrome suddenly won't work        I'm having an issue with my network security.  I am getting an error with every website I try to access using Google Chrome.  My website is a Showit site, and I can only update it with Google Chrome.  Here is the error: Details about the network security diagnosis.Settings that might be blocking the connection:  Filter name: GUID_MFE_CONNECT_CALLOUT_V4It suggested that I uncheck and recheck allowing the Google app through the firewall.  I've done that and nothing helps.Thanks so much for your help,Pat","solutions":["Hello PatJackson4, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemDo you have McAfee installed on your device? reports has shown that if you uninstalled McAfee and reinstall it, the problem should be gone by then.Please let me know if it helps Farah"]},{"symptom":"kernal Power Issue        Critical  12\/25\/2019 11:37:18 AM Kernel-Power 41(63)Can someone tell me what this means?  This happens frequently on my machine.Here is the event description:<Event xmlns=\"http:\/\/schemas.microsoft.com\/win\/2004\/08\/events\/event\">-<System>  <Provider Name=\"Microsoft-Windows-Kernel-Power\" Guid=\"{331c3b3a-2005-44c2-ac5e-77220c37d6b4}\" \/>  <EventID>41<\/EventID>  <Version>6<\/Version>  <Level>1<\/Level>  <Task>63<\/Task>  <Opcode>0<\/Opcode>  <Keywords>0x8000400000000002<\/Keywords>  <TimeCreatedSystemTime=\"2019-12-25T16:37:18.353389000Z\" \/>  <EventRecordID>7308<\/EventRecordID>  <Correlation\/>   <Execution ProcessID=\"4\" ThreadID=\"8\" \/>  <Channel>System<\/Channel>  <Computer>DESKTOP-NHSAJ28<\/Computer>  <Security UserID=\"S-1-5-18\" \/>  <\/System>-<EventData>  <Data Name=\"BugcheckCode\">0<\/Data>  <Data Name=\"BugcheckParameter1\">0x0<\/Data>  <Data Name=\"BugcheckParameter2\">0x0<\/Data>  <Data Name=\"BugcheckParameter3\">0x0<\/Data>  <Data Name=\"BugcheckParameter4\">0x0<\/Data>  <Data Name=\"SleepInProgress\">6<\/Data>  <Data Name=\"PowerButtonTimestamp\">0<\/Data>  <Data Name=\"BootAppStatus\">3221225684<\/Data>  <Data Name=\"Checkpoint\">16<\/Data>  <Data Name=\"ConnectedStandbyInProgress\">false<\/Data>  <Data Name=\"SystemSleepTransitionsToOn\">4<\/Data>  <Data Name=\"CsEntryScenarioInstanceId\">0<\/Data>  <Data Name=\"BugcheckInfoFromEFI\">false<\/Data>  <Data Name=\"CheckpointStatus\">0<\/Data>  <\/EventData>  <\/Event>","solutions":["Hi Beaver4089 Please check to see if your system has produced any minidump files: Open Windows File Explorer Navigate to C:\\Windows\\Minidump Copy any minidump files onto your Desktop, then zip those up Upload the zip file to the Cloud (OneDrive, DropBox . . . etc.), then choose to share those and get a share linkThen post the link here to the zip file, so we can take a look for you . . .","Hi Beaver4089 Please check to see if your system has produced any minidump files: Open Windows File Explorer Navigate to C:\\Windows\\Minidump Copy any minidump files onto your Desktop, then zip those up Upload the zip file to the Cloud (OneDrive, DropBox . . . etc.), then choose to share those and get a share linkThen post the link here to the zip file, so we can take a look for you . . . Hi there!Went to this location and contents were empty.","Hi, Event ID: 41 The system has rebooted without cleanly shutting down first. The kernel power error occurs when the computer is shut down, or it restarts unexpectedly.Try the solution on this Link. Link: https:\/\/www.drivereasy.com\/knowledge\/solved-ker... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Idle Time Out        My plugged in system goes into 'connected standby' for the reason as shown in theEvent ViewerThe system is entering connected standby Reason: Idle Timeout.How do I prevent my system from entering connected standby? Please note I have the following settings inPower & Sleep settings SleepOn battery power, PC goes to sleep after4minWhen plugged in, PC goes to sleep afterNeverIs it possible to increase or disable the Idle Timeout for going into connected standby?***Modified title from: Idle Time Out***[Mod Edit: Changed title from \"How to disable Connected Standy?]","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that the system goes to Connected Standby state. Modern standby is more than just a low-power sleep state—it is part of many Windows 10 fundamental user experiences. When the screen is off, the modern standby state is presented to the user as the system \"sleep\" state. This modern standby feature is by default enabled in Windows 10.  You may want to try changing the registry settings mentioned below and check. Note:  Important this section, method, or task contains steps that tell you how to modify the registry. However, serious problems might occur if you modify the registry incorrectly. Therefore, make sure that you follow these steps carefully. For added protection, back up the registry before you modify it. Then, you can restore the registry if a problem occurs. Follow the steps to take backup of registry.  Also, I would recommend you to Create a system restore point.  Disable CsEnabled: Press Windows key + R, to open Run dialog box.Type regedit and click on OK.Navigate to, HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\PowerOn the right pane, double click on CsEnabled DWORD.Change the value to 0 and click onOK. Restart the computer. For more information, see Modern Standby FAQs.  Let us know how it goes. Regards,Nikhar KhareMicrosoft Community - Moderator","Thanks Nikhar, actually I want to use Connected Standby. I have in the past disabledCSEnabled in the registry but then the only state my laptop can use is hibernate & Shutdown,and not the legacy S3 Sleep mode as it makes the OS unstable and so is unusable.The biggest issue most people have about Connected Standby is that there is no way to schedule your laptop to wake from Connected Standby so as to run user applications automatically, TASK SCHEDULER doesn't work in CS mode hence I am forced to leave my laptop ON permanently so that my Scheduled Tasks trigger as scheduled. Which is the reason I would like to disable 'Idle Timeout'Do you know if the power management engineers are working to resolve this issue withTASK SCHEDULER at the very least develop an UWP app that has the same features as TASK SCHEDULER?Curious I do not recall changing the title, did you guys do it?","Hi,I have disabled Connected Standby by patching the Registry but from then on, Outlook in Office 365 Home does not check for email upon opening.To be more specific, it does check for email when I have previously booted but it doesn't when I resume from Sleep.Any ideas about what may be causing this ? I would love to keep Connected Standby disabled but the Outlook issue is a problem for me.Thanks"]},{"symptom":"re-installing windows 10 home SL        I just installed far cry 3 game, and after installation, my laptop (windows 10 home single language) got so many errors. Start menu not working, search process not running permanently, and even i cant open Microsoft office. Because of that, i want to reinstall (or clean install, maybe) my windows 10. The question is, how to install the same edition (home SL) in my laptop? I already have OEM license and the windows installed on SSD","solutions":["Hi Ammar, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Just reinstall Windows 10 and it should automatically pick the product key from the BIOS. Usually, you would not be asked which edition to install.How to do a clean install https:\/\/answers.microsoft.com\/en-us\/insider\/for...https:\/\/answers.microsoft.com\/en-us\/windows\/for...","Thank you very much for the help, Mr. Sumit.... I appreciate it","Your welcome :) Let us know if there is anything else. To help others with the same issue kindly mark the thread as answered. New Year greetings to you."]},{"symptom":"Device attempts to connect to all UNKNOWN and KNOWN networks within range via \"connect automatically\"        First off, this is NOT an issue with KNOWN NETWORKS. I have looked and looked on the community and every time someone asks this question advice is given for known networks.The \"connect automatically\" box remains checked for every network in range whether it is a KNOWN OR UNKNOWN network. This is keeping my device from automatically connecting to the known network I want to connect to as it attempts to connect to every other UNKNOWN NETWORK within range.I can manually un-check every single box from the \"view available networks\" panel, close the panel, then reopen it just to find that every box is checked again.I have un-installed my wireless device drivers and reinstalled them, I have completely reset all my network connection settings. I have completely cleared all known networks yet still the issue persists. I am running windows 10 on a Toshiba however this issue seems to impact all machines Thanks","solutions":["Perhaps it will help to understand that 'Connect automatically' means to connect without being prompted for a password.For example, you choose (click on) the network to which you want to connect, and are then connected immediately, without first being prompted for the network's password. Since this is a convenience, all networks are checked.However, you can only connect automatically if the network's password is stored in your computer. Otherwise, you'll need to enter the network's password, i.e., you can't connect automatically.","Hi dbristerMy name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Have you tried to remove all wifi networks from the registry?Open the registry editor. You need to press Win+R, type regedit and click OK.Navigate to HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\NetworkList\\Profiles\\Check the ProfileName value in each subkey under Profiles and find the key related to the Wi-Fi network profile you want to delete.Right-click it and select Delete to delete a whole registry key. In such a way you will remove all information about a certain wireless network and make your PC really ‘forget’ everything about it.Hope this helps.Jon.","Hi, thank you for your response.I did some more research and it agrees with your answer. Apparently, windows sets connect automatically to be a default option on password protected networks but not checked as default on open networks in the available networks panel. (basically it's \"pre-checked\" in the chance the user wants to connect to that network)This somewhat eliminates my security concerns but I am still having issues with my machine automatically connecting to my home known network.I'm beginning to think there is another issue causing connection issues to my known network rather than it attempting to connect to other unknown networks. Thanks again","Hi Jon,I checked the registry values you suggested and the only network listed under the profiles is my home network. The issue appears to be a misunderstanding on my part of how the connect automatically feature is written for the GUI.It seems the \"connect automatically\" box is checked by default for all password protected networks to save clicks on the users end. I may have a different unknown issue as to why I am having issues automatically connecting to my home network. Thank you very much for your response. ","Thanks for your response. Is there anything else I can help you with?"]}]}