{"windows":[{"symptom":"Service Host processes eating my memory        Over the past week, applications, games and web pages keep crashing after about an hour or two after I start my computer. I checked task Manager and saw my memory usage was ridiculous high for what I was running. Something like 95% just for running Discord. There are at least 50+ service host processes running, and the amount of memory they use slowly increases the more I use my computer, maxing out at around 1.2-1.5% memory usage each.I have an Omen by HP, I've checked to see if I had any drivers or software to update, and everything seems to be good, but my memory still keeps increasing. And I have no idea what to doThese are some of the processes running, there are more. I've been using my computer for about 45 minutes nowAnything I can do to stop this?","solutions":["Hi loganstaniforth, My name is Riccardo and I would be happy to assist... How much RAM do you have? One way to stop this and check what is running is by doing a clean boot: https:\/\/support.microsoft.com\/en-ca\/help\/929135...This will take you down to the very basic services to allow Windows 10 to run and you can then pick and choose which background services you want to run. My computer runs with the same amount of services; however, you can pick and choose which ones you want to run. You can go into services by going to Start > type in services.msc and click the services icon. You can then set some of the services listed to Manual vs. Automatic.Let me know if this assists you.","I have 16gb of RAMAnd what programs should I enable or disable? Most of the ones presents seem to be necessary. If I switch them to manual, will they still work?","Hi loganstaniforth, I noticed that you have several Google Chrome Tabs turned on as well. This is a known issue with Chrome that it actually eats a lot of RAM. However, to improve your performance, you might want to check these suggested steps inside this article:https:\/\/www.windowscentral.com\/15-tips-increase...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"Pictures and video are wrong file size and unable to open        Hello,     I am aware of the 1803 issues that caused file sizes to be incorrect. I am now on version 1909 and still having the same problem. Both Windows and TreeSize state that the allocated hard drive space is 2.8 GB, but the size is 9.5 TB.  The reason for the high file size starts at a certain point in the folder (see screenshot):TreeSize provided information stating that the large files have way too little allocated on the hard drive (see screenshot):The file names are similar, so it is not a long file path issue. I have tried running the troubleshooter under administrator with no luck. I ran DISM.exe ... restorehealth in elevated CMD, still no luck. Since 1909 should have fixed this issue, I'm not sure what to do. I read that the metadata is the problem, but I don't know how to fix this. I cannot move the files to a memory stick or something because Windows thinks I need 9.5 TB to do so.     A second issue is, in the same folder with the file size error, some jpg files and MP4 files will open and show the picture\/video while others won't. The large file sized ones will not open at all, but even some of the smaller ones (see below):I know that MS has worked on this, but it hasn't worked for me. I copied these files from my phone AFTER updating to version 1909, so I don't know why this is happening still. ","solutions":[]},{"symptom":"Ampersand key is not working        I tried to sign in to a site, and found, like others that what came up was \".I can not get signing in to usual websites. Every week there seems to be a problem to sort.I did not change any settings, so what is going on with Microsoft?Why are most questions out of date, or closed?","solutions":["Hi Margaret This is most likely caused by a keyboard language problem . . . Right click your Start Button, choose Powershell (admin) If the @ symbol on your keyboard is above the 2, you have a US English Keyboard Paste this commend into Powershell and hit Enter: $1 = New-WinUserLanguageList en-US If the \" symbol on your keyboard is above the 2, you have a UK English Keyboard Paste this commend into Powershell and hit Enter: $1 = New-WinUserLanguageList en-GB Then, Paste this commend into Powershell and hit Enter: Set-WinUserLanguageList $1 Close Powershell and restart your PC That's It!","Sorry but my keyboard was correct, before, as l bought the laptop new locally. I would have noticed this before, as I do use it often. A search shows that more people have this problem since the last update, but I have had the laptop for some time.I have just found the ampersand key and the double tick key ( don't know the latter's name) have been reversed. At least I can use my email now.Thanks for the reply. Regards,Margaret","Hi Margaret Did you try the above fix, that will reverse those keys . . .","No Dave. I did not attempt this as the other keys are working and all keys are marked correctly for the UK setting.Oddly enough I bought a used Windows 8.1 laptop so i could use the dvd player, and everything was set for the US, where it was made. Found this out later. I was able to change everything to UK settings. Trouble is that only two keys are affected on the Windows 10 so not sure if it will work. Probably will but I don't understand why it happened. The marks on the keys are correct. The ampersand mark is not above the 2 and all was well until the update.  I have a lot of info to load on the latter laptop, so i will try changing the settings later.It may be all it needs.Just don't know why this happened when I needed to send some mail.Microsoft isn't working for me any more. I bought a Windows 10  tablet that was so annoying that I threw it at the wall.Will get back to you later, but I want my XP back. Had a lot of expensive family history CD's that are useless now. I also had everything backed up on a usb hard drive, re \"expert\" advice. I can see it on the newest laptop, but can't download it. I always received any help needed without this trouble when I had XP. Regards,Margaret"]},{"symptom":"Windows 10 Mail Sent Box is Empty        HiI am using WIN 10 Mail to send and receive to\/from 3 separate gmail addresses.  This had all been working perfectly for some time but suddenly the Sent Box of one of the addresses is empty while the other 2 addresses continue to operate as expected.  The mails are actually still there because I am able to view and work with them if I access gmail direct.  Can anyone help?  Thanks  ","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please reset the Mail App and check if it syncs the Sent mails. Go to Settings Click on Apps Click Apps and Features Select Mail app Click Advanced Options Select Reset.","Hi ArifAnd thanks for your suggestion.  Unfortunately this has not worked.  Any other thoughts?Richard","Okay in that case please remove the account from Mail app and Restart the PC.Then Add the same account again. Steps: https:\/\/support.office.com\/en-us\/article\/delete...","Hi againI have deleted the account, restarted the laptop, then re-added the account.  No change, still the same problem!Anything else I can try?Richard","Hallo ArifYou have gone very quiet and I am wondering whether you even got my last reply saying that I had tried your suggestion of deleting the account from the Mail app, but the problem remains after restarting the laptop and reloading the account.Please let me know what I should try next.ThanksRichard "]},{"symptom":"Windows Snipping Tool shortcut not working        The Win + Shift + S snipping tool shortcut opens up the widget but does not save the snip or open the editor, however the snipping app itself works correctly when opened up. The registry correctly points to user pictures folder; I took these images and description of the problem using Win + PrtScn which works just fine. Suggestions would be appreciated as I'd rather not run extra 3rd party software to do something windows is supposed to do natively. Thanks!","solutions":["Hi Ophidahlia, your pictures show the two different apps built in to windows the first, when you press winkey+shift+S opens snip and sketch, ready fro you to select a portion of the screen.(did you select anything?) once selected it will put the snip onto the clipboard and show a notification in the action centre (winkey+A)you can either paste it into an editor or click on the notification to view, annotate and save the snip.your other pictures show the snipping tool, one of which suggests using snip & sketch.to test, please try opening snip & sketch through the button in the action centre, screen snip button,(this should give the same as winkey+shift+S) use the mouse to select an area of the screen by holding the left button and dragging.when you let go of the mouse button you should get a notification that it has been saved to the clipboard.click on the notification to open the editor. if that does not work please go to settings -> apps -> apps & features click on snip & Sketch click advanced options click the reset button try snip & Sketch again"]},{"symptom":"How to access sticky notes after upgrading to Windows 10?        I just upgraded to Windows 10. Among the many functions missing in this version are all my sticky notes. How do I access my sticky notes now? I have about ten going, and they're nowhere to be found.","solutions":["Hi PM. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Go into Start Menu to open Sticky Notes from the alphabetical Apps list, right click to choose More > Pin to Taskbar.If not there type Sticky Notes in Search box, right click to choose More > Pin to TaskBar.Next look in Settings > Apps > Apps & Features > Sticky Notes > Advanced Options > Reset and Repair. Restart PC.If not there re-register the app from Option Two here: http:\/\/www.tenforums.com\/tutorials\/3175-apps-re... If it's still missing then go into Microsoft Store app, open Settings from top right three dots ..., then My Library, find Sticky Notes to install.Other ways to get them to work here: https:\/\/www.guidingtech.com\/fix-sticky-notes-no...Should be found by now! If not let me know and we'll try something else. ______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","A new version of sticky notes comes up, but none of my notes are there.","See if your Sticky Notes are backed up per the new version's procedure here:https:\/\/www.tenforums.com\/tutorials\/73044-backu...Shawn's tutorial will show you how to restore from the older version too. It may still be available here:https:\/\/winaero.com\/blog\/old-classic-sticky-not...Let me know how it goes. I'll be here to help until it's resolved.","I'm not able to help further if you don't reply back with results of the many repairs I've tried to give. All I'm getting in reply to my efforts to help you are bad ratings you keep giving me. Are you going to reply with any results or should I release the thread for someone else to try to help you?","I'm not sure which of the options to follow in the first link. It doesn't seem to apply to my situation.I've read that winaero is NOT a safe site to download from, so I'm not going to try the second option.","It's been linked successfully at Microsoft Technet here: https:\/\/social.technet.microsoft.com\/Forums\/ie\/...and also in respected Major Geeks forums here: https:\/\/www.majorgeeks.com\/files\/details\/old_cl...I would not link a site that was knowingly unsafe. I thought this is a way you could possibly recover your old Sticky Notes if the data hadn't been wiped out.Always set a System Restore point first:  http:\/\/home.bt.com\/tech-gadgets\/computing\/how-to-fix-windows-10-problems-with-system-restore-11364008291943  which can be run from WIndows or Repair Mode to go back before anything was installed.______________________________________________Standard Disclaimer:   There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it. ","I have replied each time. Sorry-- the question is 'Did this solve your problem,\" and I can't just say \"yes.\" When I google winaero, reviewers say it is not safe. Since I am not familiar with it, I'm not willing to take a chance on it based on these reviews unless microsoft recommends it.","Hi Palettemuse, Your best chance to recover your data is to try navigating to the C:\\Users\\<UserName>\\AppData\\Roaming\\Microsoft\\Sticky Notes directory, right click on StickyNotes.snt, and select Restore Previous Versions. This will pull the file from your latest restore point, if available. I've discovered if you close the Sticky Note by right-clicking it on the taskbar, it closes the Sticky Note application. However, next time you open Sticky Notes your data will return. The same also applies if you leave the Sticky Note up when rebooting your computer. Source: https:\/\/answers.microsoft.com\/en-us\/windows\/for... Most likely, this is a matter of luck. Previous Sticky notes that have been deleted especially after an upgrade cannot be recovered.But you can still try it out. Please let us know regarding this matter. Thanks and regards,"]},{"symptom":"i want to know why i have an xbox name when i didnt set it how do i erase that not showing up now        want to know why i have an xbox name when i didnt set it how do i erase that not showing up now","solutions":["Hi Daniel, Can you please clarify your concern further? Where did you see your Xbox Name? You can provide us a screenshot to further rectify your concern. We will be waiting for your response. Thanks and regards,"]},{"symptom":"Event tracker windows 10        Hello is it possible to activate this popup event tracker at shutdown \/ restart PC in Windows 10?Thanks.Regards.","solutions":["Hello dr.Acrobat, I'm Didi, an independent advisor. To activate the shutdown event tracker on Windows 10 please follow this guide : https:\/\/www.tenforums.com\/tutorials\/78343-enabl... Regards, Didi ------------- Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi Didi I already follow this guide but finally big popup not appear.Only this one appear when pressed shutdown\/restart :Thanks.Regards."]},{"symptom":"Screensaver doesn't work        My screensaver wasn't working, I updated & downloaded the display driver and it worked for about 2 hot seconds now nothing again.","solutions":["Hi PinkDolphin57 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Thank you Joseph I will read it & let you know!","Hi PinkDolphin57(2), Alright! Take your time. Thanks."]},{"symptom":"My snap-on keyboard is not responding?        My snap on keyboard is not responding?","solutions":["Hi Jag, This article describes how to troubleshoot issues that you may experience when you use the Microsoft keyboards that are listed in the \"Applies to\" section.https:\/\/support.microsoft.com\/en-ph\/help\/258826...Please let us know if this helped you out, We'll be waiting for your feedback. You have a good day!"]},{"symptom":"Windows 10 randomly shuts down since December        Running Windows 10 Home 64 bit v 1903 with 8GB RAM. Everything was fine until December just gone when the PC would suddenly shut down - no blue screen or freezing, it would just shut down. Upon restart, there are no error messages and everything is working fine again, other than the annoyance of having my work interrupted. Happens about twice a day.Things I've checked so far:Crash log says \"Unexpectedly shut down\" but gives no details. It logs the first occurrence to 13 Dec 2019.Checked power settings, fast startup is disabled and while I run a screen saver, nothing else is set to turn off or go to sleepRan memory check, no apparent errorsChecked updates, in case something was stuck trying to install, but apparently other than a Feature Update, I have all updatesNo virus or malware that Panda can detectNo apparent pattern (like specific software that causes it or times of day) and I don't do anything memory heavy like gaming, most of my work is word processing so at the most I have two browsers open, an email client, a translation memory and termbase.It's not a mains power issue, there are others devices on the same setup and no other machine seems to have this issueI note that there was a cumulative .NET update and a Windows 10 update a day before the problems started (12 Dev 2019). Are there any know issues with those updates?","solutions":["Hi, Check your CPU Temperature, If the Processor overheats the computer will shut down.Having a good Cooling system is recommended.","HiI don't think it's CPU temperature. It's a cool room (in Scotland where 20°C is a heat wave in summer!), I regularly make sure there's no dust accumulation inside or outside. But to check your suggestion, I also ran I a temperature monitoring program (alcpu), even if I try to open and run as many programs as possible, it briefly reaches 49C and then drops down to 25-30C within a very short time.","Does it shutdown like it would if you did it manually (with the blue shutdown screens), or does it instantly power off? It may be a power supply issue, generally speaking if this was caused by a program you would see a blue screen crash with the message that caused the exception.","As I said above ^ it's just gone, no blue screen, no warning, no nothing. But there are multiple devices plugged in on the power strip, if it was a mains power issue, they should all be going off.","Not if it's a hardware fault with your power supply (your PC's one). If you have access to another one it's worth trying it to see if you experience the same issue.","I don't just happen to have other power supply units lying around nor am I an engineer capable of just swapping them round (if I was, I probably wouldn't be posting on here...), I think I'll park the power supply on the maybe list for now.","Hi Akerbeltzalba, Based on your concern, there's a lot of people experiencing this kind of issue as well.What I can suggest is to rollback the updates: https:\/\/lifehacker.com\/how-to-undo-and-prevent-...And disable your windows update for the mean time, please follow this link for detailed guide:https:\/\/www.cleverfiles.com\/howto\/disable-updat...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"unable to download\/install Pinnacle Studio 23 error refers to internet connection        I have disabled the Windows Defender firewall and uninstalled my anti-virus software as per instruction by vendor but still encountered this problem while connecting the Corel\/Pinnacle URL to download application build.  Below is a snip of the screen:","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Can you run run the setup as administrator by right clicking the setup file and choosing that option?Regards, Ross","Hi Ross,I've tried that (running as Administrator)","Hi Jun, Upon checking on Corel, you might have to re-download the downloader again. To further clarify this issue, please refer to this link: https:\/\/support.corel.com\/hc\/en-us\/articles\/216...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"bugcode ndis driver on windows 10        am running windows 10, after latest windows automatic update I get this error and blue screen when starting after pc goes to sleep, I have uninstalled update and problem goes away, but can't continue to disregard windows updates, any suggestions?","solutions":["Hi Eickearl1 Most likely this is caused by your Network card device driver, however, to diagnose the underlying issue, I need to analyse your Mini-dump file(s):Open Windows File Explorer Navigate to C:\\Windows\\Minidump Copy any minidump files onto your Desktop, then zip those up Upload the zip file to the Cloud (OneDrive, DropBox . . . etc.), then choose to share those and get a share linkThen post the link here to the zip file, so we can take a look for you . . ."]},{"symptom":"i dont have sound on my compuer can you help me?        i dont have sound on my compuer can you help me?","solutions":["Hi Baruch Did this happen after a Windows 10 Update? Go to the support page fro your PC on the manufacturers website, then from there download and install the Audio device drivers they recommend . ..If you have any difficulty locating that support page, hat is the Make and exact Model No. of your PC - that will be printed on a sticker on the bottom casing . . .Also: Open the Settings App (gear icon on your Start Menu) Go to Update and Security - Troubleshoot Run the 'Playing Audio' troubleshooter you will find there . . ."]},{"symptom":"Minecraft Windows 10 Edition cursor goes off the full screen        Hello!So I have this issue as seen in the video, when I move my cursor down or up, it reveals the task bar and I can click on it aswell. I don't know how to solve this issue. In the video you don't see the cursor because bandicam is hiding it, but it's there.Video: https:\/\/youtu.be\/UsBzTbBvFak","solutions":["Hi Ilisuan, Hello, To help you resolve your concern, kindly follow these steps: Method 1: Run the Hardware and devices troubleshooter. Click the Start menu, and click SETTINGS. Type Troubleshooting on the search box. In the new window, click Hardware and Sound. Click Hardware and Devices and run the troubleshooter. Method 2: Update drivers in Windows 10. Select the Start button, type Device Manager, and select it from the list of results.Expand one of the categories to find the name of your device, then right-click (or tap and hold) it, and select Update Driver Software.Select Search automatically for updated driver software. If Windows doesn't find a new driver, you can try looking for one on the device manufacturer's website and follow their instructions.If these steps don't work, try reinstalling the driver: Open Device Manager, right-click (or tap and hold) the name of the device, and select Uninstall. Restart your PC and Windows will attempt to reinstall the driver.If the issue still persist, contact your device manufacturer for better assistance.Source: https:\/\/answers.microsoft.com\/en-us\/windows\/for...By: Raymond Ave (Moderator) Please let us know if this helped you out. Thanks and regards,"]},{"symptom":"Forza Horizon 4 crashes all the time        Hey!So I have tried to play this game for three days now and have tried just about anything I could find on google. Even in the lowest graphics it crashes, although it persist a bit longer I think? This got me to believe it was a ram problem. But I tried the ram fixes for the game with no solution. I also tried Furmark stress test, just in case, but no problem. The only thing I haven't tried is to reinstall windows. And since I did a clean install not that long ago I really don't want to do it for a single game. I can't be the only one with this problem?My setup:Nvidia GeForce RTX 2070 - 8gb16 Gb DDR3 RAMIntel core i7-4790K - 4GhzWindows 10 pro(The game is not installed on my primary drive, since I don't have the space on that drive and all my games is on another drive)This is what I have triedCheck If PC meets the minimum system requirements for Forza Horizon 4Install the latest game patchUpdate driversClear standby memory before playingDisable microphone for Forza Horizon 4Reset Forza Horizon 4Add Forza Horizon 4 as an exception to third-party antivirus application (avg)Update Windows system to the latest versionDisable anti virus programTurn off any other running programSet Forza 4 as high priority in task managerLogin as adminTrying to download another game in the storeDisabling and enabling development modeMaking sure the date \/ time is correctMicrosoft troubleshootingLaunch the game and kill explorer.exeCreating a bigger paging fileThere is a couple of more things I tried, but I can't remember it all.Thanks to anyone who wants to help!","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I appreciate the efforts taken by you in resolving this issue. I understand that Forza Horizon 4 crashes while playing. We will need few details from you to help you with the appropriate troubleshooting steps: When you say, “Forza Horizon 4 crashes” does the computer crash or only the game?Do you get any error message\/code? If yes, what is the error message\/code?Which build version of Windows 10 is installed on the computer? To check type:winver in the search bar on the Taskbar and hitEnter. Meanwhile, I would suggest you to perform a clean boot on the computer and check if the issue persists. Performing a clean boot will start the computer with minimal set of drivers and programs, to determine whether a background program is causing the issue. Some of the Startup programs will not load after performing a clean boot on the computer. However, that functionality will return when you reset the computer to start normally after finishing the troubleshooting. To perform a clean boot on the computer refer to the article How to perform a clean boot in Windows.  If performing a clean boot fixes the issue then, please refer to the sectionHow to determine what is causing the problem after you do a clean boot to check which program is causing the issue.  Note: Please refer the section Reset the computer to start normally after clean boot troubleshooting to boot the computer in to normal mode after troubleshooting. For additional information, see My Game is Not Launching or is Crashing on PC. Let us know how it goes. Regards,Nikhar KhareMicrosoft Community - Moderator","Hey Nikhar Khare, thank you for your response!In 95% of the time, the game just crashes to desktop while very few times I get blue screen.I get no error messages when the game crashes to desktopMy windows version is 1909, I tried with 1903 before updateI will try to make a clean boot, then I will come back to you.Regards","And I'm back.So I tried the clean boot without any luck.I ran through the \"My Game is Not Launching or is Crashing on PC.\" again and without any luck.I also ran a Windows memory diagnostics check, which was fine.What I can see from my tests it looks like I can play for about 8-10 minutes on lowest graphics and 2-6 minutes on ultra (Which Forza recommends) while some other times my cpu goes to 100% in the starting menu with 2 fps. That part doesn't happen often, but I thought I would mention it anyway. I am a bit unsure about creating and using a admin profile though? I have created one and did log in with it. But when I went to the store and wanted to press play, it tried to re-download and install the game?Thanks again for your time!Regards","Hi,Thank you for replying.I apologize for the delayed response. As you have mentioned that you received Blue Screen error, I would suggest you to share the Minidump files with us, so that we can analyze them and get to the root cause of the issue. To share the dump files, navigate toC:\\Windows\\Minidump, upload the files to OneDrive and share the OneDrive link.You can also check the Event viewer logs for the crash error message. Refer the steps mentioned below to share the Event logs:Press Windows logo key + R, to openRun dialog box.Type eventvwr and click on OK.Expand, Windows Logs, right click onApplication and select Save All Event As.Select a location to export the logs and click on OK. Upload the logs in OneDrive and share with us.Regards,Nikhar KhareMicrosoft Community - Moderator","Hey again, thanks for the reply!No problem, it is Christmas after all, so I haven't had much time either. So the C:\\Windows\\Minidump is empty for me, so I have just uploaded the event file.Here is the link: https:\/\/1drv.ms\/u\/s!AqvMK0wQT8Iez2weeZxAZVvLyuEd?e=MTeLjlThanks again!Regards","I tried to format my Pc, but with no luck. But today I had a similar problem in another game, which my Gf's pc could handle no problem. This was weird, since her pc isn't as powerfull as mine. So I tried using my old graphics card and everything seems to work now. So where did I go wrong? The Gpu handled fur mark without problems, so I was certain that the graphics card was okay. It was first today I learned that it doesn't test the ram of the Gpu which I am guessing is at fault. So to anyone else whom have the same problem. If you have another graphics card to test with, try it out. Thanks to Nikhar_K for all the help, it is hard to diagnose a problem when I said the gpu was fine.","Hi,Thank you for replying.Glad to know that you were able to find out the cause of the issue. I thank you for sharing the insights on how to resolve the issue, as this will help other users with similar issue.Feel free to contact us back for any Windows related concerns.Regards,Nikhar KhareMicrosoft Community - Moderator","Hi,Thank you for replying.Glad to know that you were able to find out the cause of the issue. I thank you for sharing the insights on how to resolve the issue, as this will help other users with similar issue.Feel free to contact us back for any Windows related concerns.Regards,Nikhar KhareMicrosoft Community - Moderator I wouldnt exaclty call that fixed... If i understood properly he had to remove his enw graphics card to replace it with an old one, and for people like me with notebooks, that \"solution\" doesnt work... I'm also having these crashing issues, for me the game crashes whenever I start driving around, somtimes it will last until i start an event. I've tried the clean boot, priority, shutting off overlays, and ram solutions with no results. Specs are not the issue either. I've got a 9750H cpu, 2070 gpu, and 16gb of ram... CPU still climbs up between 90-100% usage most of the time though"]},{"symptom":"7-zip        Is it necessary to have 7-zip on my laptop?","solutions":["> Everything You Need to Know About Zip Files Why did you post this in Virus and Malware forum, subcategory Microsoft Security Essentials?"]},{"symptom":"when i right click with my mouse something weird happens        when I right click with my mouse I get a black screen and then I get a long refresh. some of my apps close","solutions":["Hi, SoJustWtf My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps: Press the Start key and type the word CMD or Powershell, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanu p-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/929833..."]},{"symptom":"Your Phone App        I have been using the Your Phone app on windows 10 pro and I've noticed an issue that I can't seem to figure out. Most of my messages show up without issue, but there are a few that weren't loading. I have been able to get a few snippets of conversation from them, but I get a warning that says \"This thread has messages that you can only view from your phone\". Is there something in my settings that I can change to fix this?Thanks","solutions":["Hi Willie, There's a lot of things to consider in regards to this issue, You might want to check this article on how to fix common problems with your Phone App.https:\/\/www.windowscentral.com\/how-fix-common-p...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"Win 10 \/ Microsoft Sculpt Desktop Set \/ wake from sleep issue        This is how my Win10 x64 Pro system wake from sleep behaves with Microsoft SculptAllow keyboard to wake up PCAllow Mouse to wake up pcPC wakes with keyboard usagePC wakes with mouse usageyesyesyesyesyesnoyesyes - should be no!noyesyes - should be no!yesnonononoOne driver for desktop set handles both device manager flags for keyboad and mouse. They should be handled separately.Is there something I'm missing? If not, how can I report this for fixing?","solutions":["Bump++","Bump+++","arrghhh thank you for attention, all your effort and help and oh, I would forget: **** U. "]}]}