{"windows":[{"symptom":"Does MSN Money still work?        Does MSN Money still work as an app on Windows 8.1 Pro.  Advertised as working in 2020, but the installed program then displays the message that the program\/app has been discontinued.  Thanks.","solutions":["For Microsoft Money questions would you please post directly to the Microsoft Money Forum.http:\/\/social.microsoft.com\/Forums\/en-US\/home?forum=money Cheers."]},{"symptom":"product key of windows 8        How to get product key of windows 8?","solutions":["I don't know that there is a way anymore. I know you can use Windows 8 product keys to activate Windows 10, so you might be able to use a Windows 10 code to activate Windows 8, but I'm not sure. You might be better off to update your computer to Windows 10 using the installation media here: https:\/\/www.microsoft.com\/en-us\/software-download\/windows10You can then just purchase a Windows 10 activation key and activate Windows 10. If your computer supports Windows 8, it will definitely support Windows 10, which is faster and better. I know this probably isn't the help you wanted, but if you can't figure out how to activate Windows 8, I would definitely recommend you upgrade to Windows 10.","Th.for your  help  anyway. ","Microsoft no longer sells Windows 8 or Windows 8.1.And you can not activate Windows 8 or 8.1 with a Windows 10 product key.And just because your computer supports 8 does NOT mean that it automatically supports 10 on it.And if you do no have an activated Windows 8 there is no chance you will get an activated Windows 10 for free"]},{"symptom":"Disable SSD disk defragmentation FOREVER        Most of my PCs have 2 hard drives - first SSD and second mechanical. So I disable defragmentation for SSD disk and change schedule to monthly for the second disk. But after any feature update installation configuration is changing to the the default weekly runs for all hard drives.How can I change automatic configuration and store it forever in my Windows installation, so it would be unnecessary to review it after any big update installed?","solutions":["Windows 10, by default, will never defragment an SSD.It will, however, run the TRIM command on a regular basis, which is a good idea.I honestly don't know why the defragmentation schedule for your HDD resets to default. I do know that the schedule and extent of defragmentation applied by Windows by default is all that any HDD needs, and no advantage is gained by altering it. So you really don't need to be concerned.","There are multiple approaches. The first is typing \"Defrag\" in the Start search and selecting \"Defragment and Optimize Drives\", then select the SSD and click \"Change settings\". Uncheck \"Run on schedule\" and click OK.The next is using opening an Administrator command prompt window and entering the commandschtasks \/Delete \/TN \"\\Microsoft\\Windows\\Defrag\\ScheduledDefrag\" \/F The last is essentially the same as the command prompt method but uses the Task Scheduler interface directly. Here's an article that describes all three:https:\/\/superuser.com\/questions\/1210453\/windows... Note that this is a non-Microsoft web site, but it appears to contain accurate information. It may contain ads and most likely will set cookies.","I do not want to disable Defrag completely as I want to optimize the second mechanical drive on a monthly basis.I just want to disable defrag option for the first SSD drive forever, not only until the next feature release will be installed.","The first of the three should do that, but, really, it's nearly pointless to defrag a spinning drive as well. Your performance change it nearly unnoticeable."]},{"symptom":"microsoft windows activate error        how to solution windows activation in my laptop i want to talk person directly please help me","solutions":["Hi Ram. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.After the weekend you can contact Microsoft Support by one of these phone numbers:https:\/\/support.microsoft.com\/en-us\/help\/405170...You can also go here: https:\/\/partner.support.services.microsoft.com\/... choose the link for Browser help, interact briefly about your exact problem, keep replying agent until it connects with an agent.How was Windows 10 originally Activated on the PC? Did it come preinstalled from Factory, was it Upgraded with free or paid Upgrade, or was it a retail copy and license?For Upgrade, when you first upgraded and it activated it assigned a permanent Digital License to the PC in Microsoft Activation Servers so you can reinstall any time and in any way you want as long as you reinstall the licensed version. It should reactivate soon after going online. More about Digital LIcenses vs. Product Keys here: https:\/\/support.microsoft.com\/en-us\/help\/12440\/...You can move the Digital License to new hardware following this procedure: https:\/\/support.microsoft.com\/en-us\/help\/20530\/... Factory installed WIndows 10 has the Product Key embedded in BIOS or UEFI firmware and should activate itself, but you can check for the key by installing ProducKey:http:\/\/www.nirsoft.net\/utils\/produkey-x64.zip to copy and paste the OEM-BIOS key into Settings > Update & Security > Activation > Change Product Key.Retail keys must be reinserted for reinstalls during install or in Settings. What is the Status and Edition shown at the top of the page at Settings > Update & Security > Activation?Run the Activation Troubleshooter at Settings > Update & Security > Activation. If it says you have a Digital License then no matter what method above only the Generic Version Key can be inserted to reactivate:http:\/\/winaero.com\/blog\/generic-key-to-install-... If this fails you can contact Microsoft Support by one of these phone numbers: https:\/\/support.microsoft.com\/en-us\/help\/405170...You can also go here: https:\/\/partner.support.services.microsoft.com\/... choose the link for Browser help, interact briefly about your exact problem until it connects with an agent.I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows 10 Sound Issue        My new HP PC Desktop with fresh copy of Win X is experiencing a sound problem. I have a good set of Bose speakers connected to the Headphone\/Mic Jack. It has worked without issue. I also have a Bose Wireless Soundlink speaker (old style not bluetooth) that connects to the PC via USB dongle. The connection is there. I switch between outputs using the option within the volume icon in lower right of screen.  Both options will work. But if I have been using the system speakers, and switch to the Soundlink speaker, it will continue to play only on the system speakers. And vice-versa. I have gone into Sound Settings and made the suggested troubleshooter changes i.e. Disable Enhancements. When I press the \"Test\" button, it does play on the proper selection, so I know that the connection is there. My only workaround has been to restart my PC, then select the output I want and it will play on that output. If I try to change back to the other output, it will not play. I have to again restart PC. I looked at the option to change from the factory supplied Realtek driver to the generic Windows driver but it warns you that it might not be compatible with the system, so I backed away from that. The Bose Soundlink speaker worked seamlessly with my older Win 7 PC. I am using as the music source an up to date version of Apple I-Tunes. I see no settings in that app that might affect this problem.  I would love to hear from someone in the community that might shed some light on this.Thank you, Jeff","solutions":["Hi Jeff. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you all possible solutions for Sound problems in order of priority, so please try any you've already tried again in order. If you have any problems performing any steps I'll be standing by here to help you.1) Update the sound driver from the PC or device maker's Support Downloads webpage for your exact model, if it is newer than the one presently installed in Device Manager reached by right clicking the Start button. While there compare to make sure you also have the latest BIOS, Chipset, Display, Network and all other drivers. 2) Restore the Windows Audio Service which may have become disabled: https:\/\/www.tenforums.com\/tutorials\/57567-resto... 3) Next try these checklists: https:\/\/support.microsoft.com\/en-in\/help\/402699... https:\/\/www.howtogeek.com\/443702\/how-to-fix-sou...4) Right click Volume icon in System Tray, choose Sound Settings, from the Output and Input devices dropdown menus, choose then one(s) affected to see if that helps. If not use the Troubleshoot button nearby.5) Run the Playing Sound troubleshooter at Start button > Settings>Update & Security>Troubleshoot.6) Try rolling back the sound drivers in Device Manager reached by right clicking the Start button. Choose Sound controller and other audio devices, then Driver tab, then Roll back if available.7) If no newer sound drivers then uninstall the one presently installed in Device Manager, reached by right clicking the Start Button. Restart PC to reinstall.8) Try other and older drivers for your model Sound controller, too. For example, try the next oldest driver in the model's online Support Downloads list. To try all previous drivers installed on your system, in Device Manager choose Sound controller's Driver tab, then Update Driver, then Browse, then Let Me Pick. Finally, try installing the latest Sound driver in Compatibility Mode as shown here:https:\/\/social.technet.microsoft.com\/Forums\/win...9) If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 10) If this was caused by a Version update (which you can confirm at Settings > System > About) then you can roll back the version in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 11) You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... 12) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. 13) If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Greg. Yes its me again.  Appreciate how thorough you are! You would make a fine detective.I performed driver updates in the first step. Most of them indicated that they were up to date. Since this is a brand new PC I sort of expected that. Only a Video Adaptor actually did an update. I stuck to the drivers that I deemed relevant to the issue, since their were a massive amount of possible drivers. I also included Bluetooth drivers, since that function seems to have the same symptoms as the original problem System and device indicate that they are connected but no sound is forthcoming.I got into step #2 restoring possibly disabled Windows Audio Service. I arrived at the step to merge file with registry and got the warning dialog box stating that it could harm the system. I did not proceed as I am very unknowledgeable about registry functions. Do you think I should go forward with this? In the list with the file, it shows that WAS is Running.Again, thank you for your patience. Some of these actions are intimidating for me, and I would like to get my sound system running properly.Jeff","No need to restore the WIndows Audio service if it's running. Proceed and keep asking any questions. I'll be here for a few more hours and then check in morning.","Greg: Thanks again for your efforts. I have worked on your checklist for most of today. In particular, the adjustments to sound settings etc. I have performed most of the steps in your Performance & Integrity list. My PC was set up to do the Maintenance check on a scheduled basis, and actually ran one early this AM. I am running it right now again. I got to area of disabling various services. I am not sure about the ones dealing with Intel,HP,RealTek, and Apple. Is there a risk to disabling any of these? In Task Manager, there is Itunes Helper,HPseuNestLaunch,KeePass,MS One Drive,Windows Security. Should these be disabled as well? The next step dealing with startups is a bit confusing. The list is extensive and I am not sure what damages might be done here by someone with as little experience as I have. On the restore point, the PC has only been in service for a week, and the problem has been there since the startup.What I am seeing is that there is a connection to both of the output sources. Once I begin using one to play Itunes I am unable to switch to the other without restarting the PC. The only step that I did not try was installing the Windows Generic Sound Device, given the warning dialog box I received before doing the switch. If you think this might help the problem without collateral damage, I might be inclined to try it. Please give me your thoughts on that.I've taken up enough of your time for now. Thanks again.  Jeff","It depends on what the Service or Startup is. Can You post a screenshot or verbatim Google them to find out.","There isn't any risk to trying all available drivers for the controller model. You can rven try all previous drivers in Device Manager by choosing Update Driver > Browse > Let Me Pick. >","The blind squirrel eventually finds the nut. I figured it out! After all the tests on the Win 10, I got to thinking that possibly I-Tunes needed to be investigated. In the IT app I went to Edit>Preferences>Playback>Play Audio Using>  The drop down menu offered \"Windows Audio Session\" which had been selected, and \"Direct Sound\". I selected it, restarted I-Tunes, and voila! I was able to toggle between the two Outputs with no problem.  I am thinking that this issue might well solve my Bluetooth glitch, as well. I hope maybe this will solve the issue for anyone else who has run into this. You have been great, and as a result I have learned something about Windows 10 that will aid me in the future.I will create screenshots re: the Service\/Startup list.  I do not see the \"clip\" icon to attach a file within this document. Can you point me to it?Many thanks Greg!  Jeff","It is the image icon to attach. Are you saying the iTunes was blocking all of your sound with a setting? If so that's pretty big news. I've seen problems with it's install but not like that.","It appears that is the result of having the wrong setting selected. To be honest, I didn't realize it even existed in the app. I probably could have queried the Apple Community and maybe gotten the answer. Most likely I would have been pointed back to MS. Attached are the shots of Service Tab and Task Manager\/Startup. I assume the ones with a \"Stopped\" status do not need to be unchecked?","As a rule the only HP services that need to be running are HP Drive Guard (locks the hard drive if it detects a fall) and Hotkeys. The others can go.All the rest can go except Windows Security notifications and Onedrive, although Google and Mozilla may turn back on. If you notice any changes then Optane may need to be on, but I doubt it. Intel and other card services are mostly updaters only needed to be running if they maintain special settings you've used them to make."]},{"symptom":"On line support        I have an hp desktop with Windows 10 and an xfinity wifi. About a week ago I stopped being able to get on line. I have reset my pc and comcast has also reset my pc plus they rebooted my wifi. Nothing has worked. I set up another computer and I couldn't get on line with that one. Now the strange thing is that my wife has a laptop and she has no problem getting on line. I have checkedall my connections and nothing works for me. I hope someone has an answer or suggestion that I can use to solve this problem.","solutions":["Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.Do you still see the wifi signal on your computer? Is your wife's laptop connected to a 5ghz wifi? that could explain why she can and not you. In other words, if your pc is too old, it cannot detect 5GHZ wifi, to adjust this, you must go to the configuration of the internet router and also create a 2.9ghz wifi network."]},{"symptom":"Movies & TV won't disconnect after casting        Hello,I'm currently watching a video through the Movies & TV app and casting to my Xbox One. I manage to watch the first video with no issues, then if I want to watch another video through the same app, the app tells me it's \"Disconnecting...\" but never fully disconnects. Restarting my Xbox doesn't help. Restarting my PC does help. I've tried playing several other videos or casting to other things, but my Xbox option always stays as \"Disconnecting\". Is there another option besides restarting my PC between videos?","solutions":["Hi Osbro. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Guardian Moderator here to help you.1) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 2) Update the Display driver from the PC or Display adapter maker's Support Downloads web page for your exact model number, HP Serial Number or Dell Service Tag - from the sticker on the PC.While there check also for newer chipset, BIOS\/UEFI firmware (very important), network, sound, USB3 and other drivers, comparing to the ones presently installed in Device Manager reached by right clicking the Start Menu.If this doesn't give you the latest or ideal driver for what you need, compare it to the driver offered by the Intel driver update Utility here:http:\/\/www.intel.com\/content\/www\/us\/en\/support\/... or the Nvidia Update utility here: http:\/\/www.nvidia.com\/Download\/Scan.aspx?lang=e... or the AMD autodect utility here: http:\/\/support.amd.com\/us\/gpudownload\/windows\/P... For Display issues one fix that is working is to Roll back or Uninstall the Driver on the Display Device > Driver tab, restart PC to reinstall driver.You can also try older drivers in Device Manager > Display device > Driver tab > Update Driver > Browse > Let Me Pick.Then you will know you've tried everything in addition to Windows Update drivers.3) If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1903 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Wow, that is such a helpful answer.  At first I was just going to go get a computer science degree and redesign the program so that it works properly, but instead this looks a lot more in depth!  Ridiculous..."]},{"symptom":"Upgrade from Windows 10 S to Windows Pro        Does anyone know how to do this?","solutions":["Hi, thanks for posting your question in the community! My name is David an independent advisor and I am here to help you.To switching out of S mode in Windows 10, please follow the steps in the following linkhttps:\/\/support.microsoft.com\/en-us\/help\/445606... That you may or may not go to Windows 10 Pro, it will depend a lot of the installation that has been done on your computer, remember that not all computers have the same characteristics as others.Let me know if the information has been helpful or you still need help, I will be waiting for your response."]},{"symptom":"Updated to 1903 but 'user'.000 now created and holds all my user files        Hi, as per the title. All my pre-update User files are now in a folder with \".000\" added to the name. I've already run into problems with programs using the non .000 path e.g. Dropbox. Is there an easy fix for this?","solutions":["Hi ArchStant, most likely you are logged into a temporary profile, because that update failed to remove the temp profile used for the update and restore your user profile . .Before you do anything or move any files around Restart (not shut down) your PC 3 or 4 times, this will fix this issue a lot of the time, because it will prompt Windows to restore your default profile . ..Otherwise: Please open Windows File Explorer Navigate to C:\\Users Do you see two user folders that look like yours? Open those folders and check inside Pictures, Documents . . . etc. and see if your files are thereIf your files are there: Create a new user profile with Admin privileges Log into the new user profile Copy all your data from the old profile to the new profile (Documents Library, Pictures Library . . . etc.)If you still have not found your files, look for a Windows.old folder on your C Drive, expand that to open the users folder contained inside - check there for your files, icons . . .etc.If you do find your files . . . etc. there, copy them out as soon as possible as Windows will remove the Windows.old folder in timeNOTE VERY IMPORTANT: Do Not copy your files into the Temporary profile you are currently in, when the situation is corrected, your files will be deleted with the Temporary Profile and will not be recoverable !!","Thanks Dave, really appreciate the speedy help.I've re-started 4 times and unfortunately all my old user files are still in the .000 folder. My old(normal) folder - containing nothing but \"WPR_initiated_WprApp_WPR Internal Heap Collector.etl\" inside Appdata\/Local\/Temp - is right next to the .000 folder. You mention that I'm likely logged in as a temporary profile.  Start Manager\/Users appears to show me logged in as my normal user name, though my normal Desktop user icon\/link takes me straight to the new .000 folder when I double click it. Is there any other way to confirm if I'm logged in as a temp profile, or not? maybe it doesn't matter at this stage?I appreciate the .000 folder is in scope for being deleted by the system (eventually), but, can I not simply copy all my old files in the .000 folder and drop them into my normal\/non-.000 folder, after all the path to this non-.000 folder is what's required by these programs depending on it. Of course, I'm assuming my normal\/old\/non-.000 folder is not in scope for deletion? ","Dave, I see you've posted elsewhere many times since my reply above: any chance you might want to come back and follow up on my new queries. Your solution did not work.Alternatively, can someone else follow up on my new questions? or is this just a copy and paste exercise to gaining points quickly?We clearly have a problem with how 1903 is installing. We don't wan't folks User folder getting deleted through update 'issues', once again.Thank you.","Hi Arch Click your Start Button, then just type cmd and hit Enter In the resulting Command Prompt window, run this command and hit Enter: whoami What exactly is returned form that command","Thanks again Dave,I'm very keen to get this resolved quickly!! - there's a bunch more programs with issues e.g. Outlook (I can't see any of my emails...including incoming!!). WHY, if the fix is to get the original User folder re-defaulted and re-populated, hasn't Microsoft pushed out a simple fix??? - it absolutely HAS to be simple since MS are asking users to do it manually. (many apologies to you - my frustration is directed to MS)Anyway, back to your above reply...In PowerShell, whoami returns:  \"CorrectUsername\\CorrectUsername\"  --> i.e. I think things look ok herePowerShell also defaulted to the following location: \"C:\\Users\\CorrectUsername.000>\" --> i.e. we're back to the temp \".000\" as a path defaultSo I'm not sure what this means in regards to how best to fix this problem.However, back to your second solution, where you say:\"Please open Windows File Explorer Navigate to C:\\Users Do you see two user folders that look like yours? Open those folders and check inside Pictures, Documents . . . etc. and see if your files are there \"-->Yes, there are two folders that look like mine - the second(new) one has the \".000\" appended, and, that second folder has all my User files. I have copied all these files elsewhere (to a non-C drive) in case this temp folder gets deleted soon. Can I ask if, as you then say, I create a new user profile (and copy my .000 files there) - will I then lose my old original user name and will this new name cause issues with the expected paths of some of my programs - if they're hard wired to include my old username in the path name?","Hi Arch I am glad you have backed up your data just in case . . . With this problem a lot of user copy their data into the temp profile and when that profile deletes itself all data is lost, that is why the best option is to create a new user profileWith that being said, form your detail, do you have applications that are hard coded to look in a specific user profile for data?Click your Start Button, then just type netplwiz and hit Enter How many user profiles are listed on the resulting dialog?","Cheers,netplwiz returns 3 entries listed in the Users tab: my MS hotmail email, ASPNET, and HomeGroupUser$Task Manager Users tab shows 1 entry - my MS hotmail email.The MS hotmail email is the same one I use for my MS store log in.I'm not sure which programs would use my old(correct) User name as part of a path, it's just the (reasonable?) possibility that some might? ","Hi Arch Honestly, I think the only way to resolve this mess created by Windows Updates, is to create a new user profile, move your data to that profile and delete the other profiles from netplwiz, there is going to be no other way at this point, since restarting did not fix this bug . . .","I created a new account as you said above, copied all my old user files (in the \".000\" folder as above) into this new account, and well...not too goodI've had my PC running in this configuration for about 3 years and installed quite a number of programs, including all applicable updates, over that time. I guess you'd call me an advanced user, having been in this game for many years, and using my PC for non-professional audio production, video editing etc. With this, many of my programs have been specifically configured with various paths - that took months\/years to fine-tune!! Before the 1903 update a couple of days ago, my PC was performing well. After this update well, not so good. My taskbar jumplists have disappeared, my (stardock) desktop fences have disappeared. Paths are wrong. Etc etc.The 1903 update is not working for me and I'd suggest that the scope of this 'issue' extends down to even those who use their PC's for surfing only.Update: I've managed to roll back to the version before 1903 and it was a painless and pretty fast process, so thanks due to MS for that. Anyway, thanks for your suggestions Dave.","Update: I've managed to roll back to the version before 1903 and it was a painless and pretty fast process, so thanks due to MS for that. Anyway, thanks for your suggestions Dave.Hi ArchStant,You said you Rolled Back the upgrade.  Did that sort out your incorrect user.000 profile\/folder, and get you really back to where you were before the upgrade.  I have the same problem, and am thinking of Rolling Back, but would love to hear from someone who has done that successfully."]},{"symptom":"won't run as admin and some apps just don't open!        hi there.. so I recently turned on my computer and for no apparent reason it now will not open command prompt running as admin.. it will allow me to run command prompt but not give me administer privileges! some apps I can't even open at all including Spotify and xbox game bar (says that it can't find app directory or you don't have required permission to do so) anything that involves runnint anything as admin just doesn't not allow me to do so and I am the only account on the computer(personal computer) I've tried to run games in this state and they load up for a few seconds then crash! I'm not sure what is going on p.s windows still shows me as the admin ","solutions":["Hi Jacob. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.If you have lost Admin rights on the sole acccount then try these steps leading up to if necessary creating a new Local Account which sometimes is the only way to escape Account Corruption in Windows 10:Right click Start button to open Run box, copy and paste in netplwiz, press Enter.Highlight your account, then click Properties, then Group Membership tab. click on Administrator, then Apply, OK, restart PC.If that doesn't help then try this: https:\/\/www.kapilarya.com\/fix-lost-administrati... If nothing helps try creating a new Local Admin Account to sign into to see if it works:http:\/\/www.howtogeek.com\/226540\/how-to-create-a... If you can't get the rights to do this then use whichever method works here to enable the hidden Built-in Administrator to be used only in emergencies:https:\/\/www.tenforums.com\/tutorials\/2969-enable...https:\/\/www.isumsoft.com\/it\/enable-hidden-admin...It may be necessary to create Windows 10 Installation Media on another PC to access the Command Prompt without needing a password:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... Choose the boot device as a UEFI device if offered. If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.After it loads, on second screen, choose Repair Your Computer, then Advanced Startup Options, first try System Restore to a point before this. If that fails then choose Command Prompt to follow the step above to access Built-in Admin Account.Sign into Hidden Admin account, see if you can use netplwiz now to elevate the account. If not try another of these methods:https:\/\/www.windowscentral.com\/how-change-user-... If not then set up a new Local Admin Account, sign into it, move your files over, set it up, hide the Hidden Admin Account, when ready delete the old account in Settings > Accounts > Family and Other Users.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it. See here for how to try to recover Admin rights:"]},{"symptom":"I Have Less Than 5 Processes        I have less than 5 processes, but my PC still freezes! :(","solutions":["Hi Joey, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Are the freezes like lockup where you have to restart the device or it comes back to life after a while?To better understand the issue, please see the article below on how to share System logs.http:\/\/www.yourwindowsguide.com\/2017\/12\/how-to-...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads."]},{"symptom":"The procedure entry point FinishOVDXDriver could not be located in OVBaseIF.dll        Scanner Mouse app (https:\/\/download.dacuda.com\/win\/DAC-OnlineInstaller-Master\/42\/DAC-OnlineInstaller-Master-b42-v2.5.6.553.exe) cannot be started on Windows 10 1903. The reason is that FinishOVDXDriver function could not be found in the dll, but in fact the function exists and there is no issue with the dll usage on other versions of Windows.Can you please check what is the issue with dll?What is changed in the latest OS version which can cause the issue?","solutions":["Hi Arus, Thank you for writing to Microsoft Community Forums. The probable cause of the issue could be the corrupt OVBaseIF.dll file. You may want to re-register the OVBaseIF.dll file and see if it helps. Follow the steps listed below to re-register the OVBaseIF.dll file:Search CMD from the Start menu, and chooseCommand Prompt (Admin) from the results.Copy paste the following command and hit Enter:regsvr32 OVBaseIF.dll If the issue persists. I would suggest you to try the methods listed below and check if it works for you. Method 1Repair the corrupted system files by running a System File Checker and see if it fixes the issue. Refer the article Use the System File Checker tool to repair missing or corrupted system files to know how to run the System File Checker tool. Method 2If the SFC tool fails to fix the issue, you may uninstall and reinstall the latest version ofScanner Mouse app to see if it helps. Let us know how it goes.Regards,","Hi Junaid,Unfortunately none of the solutions helped to resolve the issue.The functions from OVBaseIF.dll are found properly on previous versions of Windows. The issue is detected only on 1903 version.The dll is packed within the Scanner Mouse application.Here is the link to the dll: https:\/\/www.dropbox.com\/s\/rjuc0iw3w7nnzah\/OVBaseIF.dll?dl=0Can you please check what is wrong with the dll?Could you advice where can we get a newer version of the dll file compatible with Windows 10 1903?","Is there any solution\/workaround for this issue ?","Hi,according to my info a fix is close to be released in the near future. I had reported the bug in the Windows Insider Preview Version to Crealogix by the end of December 2018, but obviously there was no interest to fix it closer......Have a look at my opened post.https:\/\/answers.microsoft.com\/en-us\/insider\/forum\/insider_wintp-insider_devices-insiderplat_pc\/scanner-mouseexe-entry-point-not-found\/770d8c8f-86d5-4c23-b346-c59b30cf03fc?messageId=0345484e-195c-47b8-b476-385cb7e8a6bb","Hi Junaid, We need to resolve this urgently, we have millions of customers complaining about it. The application is completely unusable with the update 1903, and as it roll us by Microsoft in batches we have huge problems. Scanner Mouse software is used in all kinds of use cases: banks, transportation organisations etc, and it cannot be that this issue cannot be fixed since February. Please fix it, and roll update with the fix, or please stop updating the users with 1903 Windows update. Please give me info what is the current state on this issue and what is the timeline for the fix. If you are not able to help me, please refer me to your supervisor I would really like to understand what is going on. Best regards,Nevena Shamoska ","We need to resolve this urgently, PLEASE","please consult:https:\/\/support.crealogix.com\/fr\/windows-update-1903\/","I consult but this is not a solution..My \"Get started\" of Windows Insider is gray out ..By the way dont want install devolopper engines on my normal machine..So Please find a solution ,really frustrating this problem.Spent money for nothing.. ","Obviously, this is a bug which Microsoft had implemented in the 1903 version.Why is Microsoft not able to add a fix for the Windows 1903 Version?We do not need such bugs in productive versions!","Hello,I have same issue with LG LSM-100 mouse. It's seems this scan mouses are the same in core.Here is how I manage to fix it:1. Download Update 22.07.2019 software from here: https:\/\/support.crealogix.com\/windows-update-1903\/ and install it.2 Go to install dir and in my casecopy two files from installed directory: OVBaseIF.dll and DXCore1.dll. 3. Put them in your native software directory, in my case LG folder.4. Run your native software for the mouse, it will say if need some other file to start normally.Here is link from my drive for the fix: https:\/\/1drv.ms\/u\/s!Ai89DnHacGmMget2XhydiW1EPUD3AA?e=UBfoIJ"]},{"symptom":"HTTPs:\/\/GO.MICROSOFT.COM\/FWLINK\/?linkid=857635        what about how to reach this, because every time I load it ask me an email + pwd but every time it denies access. This has been an indication to recover a tablet, but I cannot approach it.ThanksKR","solutions":["what about how to reach this, because every time I load it ask me an email + pwd but every time it denies access. This has been an indication to recover a tablet, but I cannot approach it.ThanksKR07138B88-D3F0-4018-B491-EF08658D59AC","what about how to reach this, because every time I load it ask me an email + pwd but every time it denies access. This has been an indication to recover a tablet, but I cannot approach it.ThanksKR","GS dsm pastagem","I have a table that need repair and was send this link to follow HTTPs:\/\/GO.MICROSOFT.COM\/FWLINK\/?linkid=857635 another code was CAA36D96. PLEASE HELP."]},{"symptom":"chm files display graphic content as a little box with an \"x\"        ALL my chm files display an \"x\" in place of graphic content.  Those same files display properly on all my other Win 10 Pro machines.  I'm currently at 1909 and it seems the problem started as long ago as 1809......... maybe even 1803.Any suggestions? ","solutions":[]},{"symptom":"sleep mode issues        I have all of my settings for sleep mode to not cause the pc to sleep at all. It still goes into sleep mode and still won't wake up when I push any buttons or the touchpad. Any advice?","solutions":["Hi Shelley. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Let's take a look at all places where Windows can suspend to try to find the culprit:1) Check closely your Display, Sleep and Hibernate settings in Power Options following this guide:https:\/\/www.tenforums.com\/tutorials\/2843-change... 2) Display timeout has been moved to Settings > System > Power & Sleep > Additional Power Settings, on active Power Plan choose Change Plan Settings then adjust Display timeout.While there check also Advanced plan settings > Sleep > Allow Wake Timers > under Battery & Plug In options set to Enable, Apply, Save.3) If your Power Options settings are set correctly then the next suspect is the screensaver which is mysteriously setting a 1 minute timeout to blank Screensaver when some Themes are chosen. Check that now at Settings > Personalization > Lock Screen > Screen Saver Settings. 4) This could also pertain to an issue of Unattended Sleep Timeout setting in Registry. See the Marked Answer here for what has worked for others:https:\/\/answers.microsoft.com\/en-us\/windows\/for... Whenever modifying the registry, first set a System Restore point: http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... 5) If System Unattended Sleep timeout is not present here's now to access it: https:\/\/www.tenforums.com\/tutorials\/72133-add-s... 6) More troubleshooting when PC keeps shutting down: https:\/\/www.tenforums.com\/general-support\/66513...https:\/\/www.computerhope.com\/issues\/ch000689.htmhttps:\/\/superuser.com\/questions\/1019043\/windows...7) If you suspect overheating which can shut down the PC, then install CoreTemp to monitor temps from System Tray:https:\/\/www.thewindowsclub.com\/core-temp-monito...https:\/\/www.pcworld.com\/article\/2365089\/compute...8) Since sleep is overwhelmingly controlled by the Display driver, Update the Display driver from the PC or Display adapter maker's Support Downloads web page for your exact model number, HP Serial Number or Dell Service Tag - from the sticker on the PC.While there check also for newer chipset, BIOS\/UEFI firmware (very important), network, sound, USB3 and other drivers, comparing to the ones presently installed in Device Manager reached by right clicking the Start Menu.if this doesn't give you the latest or ideal driver for what you need, compare it to the driver offered by the Intel driver update Utility here:http:\/\/www.intel.com\/content\/www\/us\/en\/support\/... or the Nvidia Update utility here: http:\/\/www.nvidia.com\/Download\/Scan.aspx?lang=e... or the AMD autodect utility here: http:\/\/support.amd.com\/us\/gpudownload\/windows\/P... For Display issues one fix that is working is to Roll back or Uninstall the Driver on the Display Device > Driver tab, restart PC to reinstall driver.You can also try older drivers in Device Manager > Display device > Driver tab > Update Driver > Browse > Let Me Pick.Then you will know you've tried everything in addition to Windows Update drivers.9) Check over these other working Sleep solutions which may also be involved: http:\/\/www.makeuseof.com\/tag\/fix-windows-10-sle...10) If this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Update History, then uninstall them from the link there, and immediately check for these again and hide with the Hide Updates tool explained here: https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:https:\/\/www.windowscentral.com\/how-use-system-r... 11) If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....12) If no power setting is causing this then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 13) If nothing else works then do a Repair Install, by installing Media Creation Tool and then choosing to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... If you want you can wait a few more days for the new version to be released into Media Creation Tool then you can use it to do the Repair Install also bringing you up to the latest version by the most stable method. Watch for the MCT to change the version listed at top here: http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Will I get a product key if I buy the upgrade from Microsoft store to upgrade from Windows 10 home to Windows 10 pro?        My current computer has a Windows 10 Home digital license. If I buy the upgrade for Windows 10 Pro for $99 from Microsoft Store, will I get a Windows 10 Pro product key that I can later transfer to a new computer? or will I only get a Windows 10 digital license that I cannot use in a new computer?If I understand it correctly, I cannot transfer my current Windows 10 Home digital license to a new computer since I got it yeas ago through the free Windows 10 upgrade from an OEM license of windows 8.1 ( or Windows 7, I cannot remember). I plan to build a new computer in 6-12 months. Meanwhile I hope I can start using Windows 10 pro right away without having to worry about buying another license after my new computer is built.","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,The $99 upgrade from windows 10 home to windows 10 pro the microsoft store is a digital license.Please refer to this link for the full retail version of windows 10 pro. https:\/\/www.microsoft.com\/en-us\/p\/windows-10-pr...","Thanks for your quick reply.If I understand you correctly, the Windows 10 pro digital license I bought this way will not be transferable to a new computer? Do I need to buy a full copy of the pro license for future unlimited transfers?","Hi Yanif, you're welcome Yes. As digital licenses does not have a unique product key, purchasing the full version retail would be more ideal in any case that you plan on upgrading your hardware or transferring the license on a different computer as retail licenses has transfer rights. :)"]},{"symptom":"what is audiodg.exe and why it is creating \".pcm\" files ?        I am using 256GB ssd drive and i noticed that my 80 GB space is consumed by '.pcm' files located in Windows\/temp folder. i deleted those files but some of them are still used by audiodg.exe and thats why i could not delete the files and the problem is the size of files are increasing like 1 mb in a second. i dont know the cause of this behavour. This is the file name \"skwsrefmfx_2019_7_5-3_9_39_302.pcm\" and there were lot of files there and still modifying itself. can someone help me with the issue.* Moved from Virus & Malware","solutions":["What is AUDIODG.EXE – Larry Osterman's WebLog\"The short answer is that audiodg.exe hosts the audio engine for Vista.  All the DSP and other audio processing is done in audiodg.exe.\"Pulse-code modulation - WikipediaMPEG-4 File Source - Windows applications | Microsoft DocsSo obviously since that executable relates to audio and the PCM file type is an audio storage type, those files must be some sort of audio recording, though what's actually creating them is still in question.The \"skwsrefmfx\" portion at the beginning of the file name may provide a clue, since one thing that would clearly use this audio engine is Skype and since the first 2 letters are \"sk\", that may imply it's some sort of Skype audio recording.  But that's just a guess, since I didn't find this filename online other than within your own posts.Rob","I have same problem. This is a just a report, with an unsatisfactory work-around. Apparently, what is happening is that audiodg.exe is recording sounds and saving them in Windows\/Temp. If I play music from Amazon, for example, the current skwsrefmfx_*.pcm file continually grows in size. If I go to Settings to Manage sound devices and Disable the microphone, the current *.pcm file ceases to grow. For me, this problem may have begun when I updated to Windows 10 1903. If it actually began then, it's possibly a bug in the latest Windows 10\/audiodg.exe.","So you're thinking that the microphone may be engaged automatically when a streamed music file is being played, saved to these temporary PCM files that for some reason also aren't being purged once the streaming activity ends?Sounds from your description like this makes sense, so the question as you've inferred is what is triggering the audiodg.exe to begin recording.  It's also important to know whether these files can be deleted manually, since if they're still locked that indicates they aren't ever being closed.The other question that comes to mind for me is does this happen for everyone or only a small number like yourself?  If that's true, then I'd be looking at what makes your specific systems unique, like what computer and especially what sound device, driver and version are in use.  If those are the same for both of you, that may point at possible involvement and even a potential solution if a different driver is available.Rob","Rob, I normally have my Hades Canyon NUC microphone array on 24\/7 so as to use Cortana in the same way other people use Alexa and so as to answer incoming telephone calls.Windows 10 Storage Settings\/Storage Sense does not list the *.pcm files when listing other temporary file groups, so it will not and cannot delete them. To delete them, I needed to go to Windows\\Temp in Explorer. You were spot on when you said the issue is with or via audiodg.exe because when I tried to delete the *.pcm files, Windows 10 would not delete the *.pcm file currently open. It was in use by \"audiodg.exe.\" Apparently, audiodg.exe records in blocks, so I could delete 100+ GB of blocks filling my drive, even with the microphone on.I submitted a report to the Windows Feedback Hub as a Serious issue. Hopefully, they'll fix it or get back to me for further tests. An internet search pulls up similar problems a few years ago associated with audio. It's not likely to be the Realtek driver, as that has a 2018 date. Likewise, Windows Defender didn't find anything suspicious. I suspect that some developer at Microsoft was debugging audiodg.exe (or Skype) in 1903 with some software switch turned on so as to record. He or she forgot to turn it back off. Skype does have a recording feature for Skype to Skype calls, but I've never seen a button for it, as I don't do such. In any case, Skype-help says that Skype saves the recording in the cloud, not on anyone's drive.","I also am experiencing the exact same issue with the Intel Hades Canyon NUC. Could it possibly be something unique to the Realtek or Intel Drivers and their interaction with Windows 10 1903 on this system?skwsrefmfx PCM files continuously grow in C:\\Windows\\Temp and are recording everything that the microphone array picks up unless I disable that device.","Reasonable supposition, Olympia. First way to test it would be on a non-NUC computer with different mike but same OS state. Another avenue of attack would be to find out the significance of the file names. A simple search for skwsrefmfx_*.pcm turns up nothing.","I had this same problem recently, only noticed something was fishy when I saw the C: Drive on my 128GB SSD go down to 3GB Free space and in the RED.. it's taken some figuring, and daily I was deleting the .pcm files from C:\\Windows\\Temp but there was always a couple I couldn't delete, but I managed to clear more space in the least.So I got to researching a bit more and saw .pcm files related to AUDIO, then I happened upon this post which gave me a little more confirmation of what I suspect was going on... Something was constantly recording\/using the Mic, it seems?So, I went into Windows Settings > PRIVACY > MICROPHONE and looked at which Apps were using the Mic.. I only have a few usually as I'm very selective on my privacy settings and have things within there all locked down, however, since the 1903 update it would appear the Microsoft Edge and Cortana were both now allowed to use my Microphone too!  Something I'm pretty sure I had not allowed it to in the past as I dont use Edge Browser nor Cortana, but possible maybe Cortana was on previously?I turned this option off in Microphone settings for both Apps to stop them being allowed to use the Mic, instantly the biggest .PCM file and a couple others which had been totting up their totals and getting bigger all day long whilst my machine was on stopped doing so.  I then deleted all files again from C:\\Windows\\Temp only 1 .PCM file remained, the one it was last writing to I guess.  So I rebooted my system, went back in there and then deleted that one too, it was gone... As of yet nothing has written any .PCM files back into C:\\Windows\\Temp but I will come back and advise it that changes!In my case it seemed these two Microsoft Apps were causing the issue, the only other App I have being allowed to use the Microphone is SKYPE and that from what I can tell isn't creating .PCM files, but then I have not actively used it to make a call as yet either, it usually just sits running in my System Tray as I receive calls mostly through it via a Skype Number if people call that, which they haven't recently!The files never deleted themselves after reboot, that was the biggest issue, but the mystery remains as to why are they doing it, they didn't used to be prior to 1903? or that I noticed anyway, my disk space never dropped enough for me to notice maybe?Possible maybe other MS Apps are causing similar issues too, but I don't want to mess too much with my system as it's my working system and I don't want to break anything and have to rebuild!I'd be interested to see and know if this works for anyone else.  Certainly a new issue which arose after the 1903 update so maybe a Bug?  I'm just glad my disk isn't being eaten away any longer :)UPDATE: 22 July 2019------------------------Further update on my .PCM file issues and how I've kind of sorted it. After a little more time with every App other than Skype no longer using the Microphone in WINDOWS SETTTINGS > PRIVACY > MICROPHONE I found that .PCM files were still being created, however, most were Zero Byted and cleared regularly themselves or upon Reboot... There was however one other of about 2MB in size being created none we're certainly taking up Gigabytes of space on my C: Drive like when I had both Microsoft Edge and Cortana set to ON to use the Microphone. Unfortunately the 2MB file remains present even after reboot and when deleted it soon returns, but it's small so I can live with that, it was the whopping huge Gigabyte sized ones I couldn't!So I figured I would goto the WINDOWS SETTTINGS > PRIVACY > MICROPHONE and disable it completely for a period and turn off the Microphone completely from this setting, hey presto, no .PCM files at all being created. :)Certainly seems to be for me personally that Edge and Cortana were the biggest issue and this was never an issue to my knowledge before 1903 so very strange indeed.I can live with the smaller .PCM file and Zero Byted ones which I assume is safe to say is down to Skype now being the only App I have using the Microphone in WINDOWS SETTTINGS > PRIVACY > MICROPHONE, they're not going to cause me any major issues but one has to wonder why this is happening suddenly? For now I have re-enabled the Mic for Skype as I do wish to use that on occasions and as the only App now using the Mic the problem for me is mostly not a problem any longer.I'd be interested on any other feedback, are other MS Apps causing similar issues when they want to use the Mic, as I mentioned previously I didn't want to mess around too much myself and mess my system up too much, I just wanted to stop the Huge files from being created which I seem to have managed to do.Hopefully some kind of fix however will be forthcoming.  Will have to be sure and tell some friends using 1903 of this because they'll likely hit similar issues.I hope my posts have helped others here also.All the best","I have the exact same problem. Also Hades Canyon NUC. Disabled the microphone, which I don't use much anyway. Hopefully this gets sorted out at some point.","I have the same problem. Also Hades Canyon.","I have the same problem. Also Hades Canyon."]},{"symptom":"Photos App crashes when importing photos        I recently got a new PC and when i am trying to import my photos from my Iphone Xs max, the app freezes to '3081 items found so far\" and all i want are my photos on my pc. Can someone please help","solutions":["Hi, KingH2 My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Follow these steps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check this link: https:\/\/www.intowindows.com\/how-to-reinstall-st...Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hello,Try re-registering Photos app. Perform these steps:1. Search for Windows PowerShell using Cortana or Windows Search.2. From results, right click on Windows PowerShell and select Run as administrator.3. Then type following command and press Enter key:Get-AppxPackage -allusers Microsoft.Windows.Photos | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Let the command complete.4. Close Windows PowerShell and check Photos app, it should work fine now.Let us know if this helps! ","This actually worked for me! Thanks!"]},{"symptom":"Can't Remove Websites from \"ALWAYS ALLOWED\" Content Restrictions on Child's Account in Microsoft Family        The \"REMOVE\" button does not work when trying to remove a website from the \"Always Allowed\" web browsing content restrictions on one of my kids' accounts in Microsoft Family.  It let me remove a handful of sites from the list, but there are 10 or so that clicking the \"remove\" button does nothing.Can someone from Microsoft explain to me how to fix this?  This was posted a year ago but someone answered with an answer that did not help (saying to use Edge instead) and now the thread is locked.It seems that if the web site in the list has content after the website name, then the site can't be removed from the list, e.g.accounts.google.com\/AddSession?service=classroom&continue=https:\/\/classroom.google.com\/cannot be removed butaccounts.google.comcan be removed.","solutions":[]},{"symptom":"Dell XPS HDD Replacement - PC Won't Start Up; Can't Get to BIOS        Community,Appreciate any assistance!I have a Dell XPS that had a HDD failure; ePSA diagnostics returned a code 1042.  I then did the following:1. Replaced the HDD.2. Downloaded Dell's OS Recovery Tool to build an installation media file (USB).3. Followed directions to reset the new HDD (Dell's AssistSupport).4. Initial steps of download performed fine. Was presented with initial Windows install screens.5. Prompted to establish internet connection.  Successfully connected with personal wifi.6. Windows proceeded with install; provided message of \"We have important <steps to perform>\"7. Walked away for 60-90 minutes and when i returned, there was a black screen.8. Waited 30 minutes and nothing. Turned PC off.Now I can't even get the Dell logo to appear.  Actually, the monitor doesn't even recognize a signal and never turns on.  Keyboard and mouse recognize a signal and their lights flash on.  As such, i can't even get to BIOS or UEFI.Any ideas?","solutions":["Hi Sinjin. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I will give you all possible steps to troubleshoot installation failure which work in about 90% of cases. If not we'll go from there:Follow the illustrated Clean Install steps in this tutorial which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Make sure all other drives and peripherals are unplugged. Update the BIOS or UEFI firmware to latest, or reset to Defaults, making sure SATA controller is set to AHCI, UEFI is enabled, CSM or Legacy BIOS disabled, Windows Boot Manager set first to boot, if necessary disable Secure and Fast Boot until after install: https:\/\/www.mydigitallife.net\/comprehensive-lis... https:\/\/www.groovypost.com\/howto\/reset-pc-bios-...Create the latest new Windows 10 Installation Media ONLY by installing Media Creation Tool and following the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... If you're using another PC to do this then uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first. If you can start Windows enter UEFI firmware here:http:\/\/www.isunshare.com\/windows-password\/four-... Choose the boot device as a UEFI device if offered, on first screen press Shift + F10 to open a Command Prompt, type the following commands, each followed by Enter key:DISKPART LIST DISK SEL DIS # (replace # with the disk # of the Windows disk from list in previous command)CLEAN EXIT Close Command Box, on second screen choose Install Now, then Custom Install, then at the drive selection screen choose Unallocated Space, click Next to let it create needed partitions and start install - this makes it foolproof.Make sure to follow the setup steps in the first link tutorial to complete your install. Drivers are important enough that those steps are printed in red.You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the first linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC. If all else fails you can move the hard drive to another PC to do the install with it plugged in alone. Windows 10 is remarkably adaptive to new hardware without needing adaptive restore. If it will start it will swap out all drivers requiring several restarts. You can also try applying a same-version System Image to the intact SSD\/hard drive.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Greg,Thanks for your prompt reply.  I read the first half of your reply and the first three links you provided... I know have some clarifying questions\/comments.I’m reading this as my first step is to reset the BIOS, correct?In my current state, i boot the PC and nothing happens.  I don’t see a Dell logo and, therefore, i cannot get into the BIOS setup (F2).So it looks like i follow the groovypost link’s advice and try to reset the CMOS battery.Am i understanding this correctly?Thanks,Sinjin","Hi Sinjin - I'm concerned that you don't even see the Dell splash screen as you did before. Do you see anything at all? Is this evidence the laptop screen may have died or become disconnected from it's wire harness?If there is at least a signal then what would be next is to try to reset the CMOS to make the BIOS accessible again:https:\/\/www.maketecheasier.com\/how-to-reset-cmo...https:\/\/www.groovypost.com\/howto\/reset-pc-bios-...Once you can access the BIOS to reset to defaults, check the hard drive is detected in it's settings - usually under Storage. If not reseat it to try to get it detected. Then proceed with steps I gave earlier to troubleshoot install.","I haven't performed any steps yet, so let me address some of your questions:Dell XPS 8930 Desktop1. Replaced the HDD.2. Downloaded Dell's OS Recovery Tool to build an installation media file (USB).3. Followed directions to reset the new HDD (Dell's AssistSupport).4. Media installation completed and I removed the USB.5. Initial steps of install performed fine. Was presented with initial Windows install screens.6. Prompted to establish internet connection.  Successfully connected with personal wifi.7. Windows proceeded with install; provided message of \"We have important <steps to perform>\"8. Walked away for 60-90 minutes and when i returned, there was a black screen.9. Waited 30 minutes and nothing. Turned PC off.Now:When attempting to boot up PC, i see there is power in the PC tower (fan, etc), but the monitor never wakes up and i cannot see if there is a Dell logo appearing.The keyboard and mouse light up but i can't tell if they are responsive.I'm double checking the monitor now.  When I plug my laptop (different device) to the monitor, it recognizes the device (monitor is not in power saving mode) but it doesn't display my laptop. I need to rule out the monitor first and then see if I need the CMOS.","I read those steps 1-9 in your first post which got sidetracked into Dell Recovery media which is not a Clean Install and has its own problems. I gave the correct way to proceed in my first post using Windows 10 Media only, which I thought Dell is recommending now anyway. If the monitor isn't displaying your laptop, either, then it's a monitor problem. Replace the monitor or borrow another.","Yep... It must have been coincidence or something cause i've now tried two laptops with the monitor and i can't duplicate\/extend\/show only on the PC's monitor.Regarding initial thread... Yes. I'm going to move forward with Microsoft's installation media and abandon Dell's OS Recovery method.  I'll repost to this thread once i get the monitor squared away.","Good. Keep me posted on your progress as I will be here to help until the case is resolved.","Well whaddya know...  The PC's monitor must have failed me last night during hte windows install.  The black screen i experienced could've been a situation where the install was still performing or pending a question to the user.Now:Using a TV as a temp monitor, i booted the PC and it progressed past the Dell logo. No USB device inserted in PC.I did hit F12 several times to get into UEFI but it went straight to a windows install prompt.I'm now prompted with a 'Why did my PC restart?\" screen and it's suggesting i click next to establish a wi-fi connection.What do you think... Should I continue with this Dell OS media install (from the OS Recovery Tool)? or get the MS media and do another complete install (re-wiping the HDD)?Regardless, i think we can take CMOS off the table.","Sorry to bother you... You've been a great help to me!I started researching MS Windows Install Creation Media and it occurred to me:Even if I get the image on the USB flash, how will I be able to intercept the boot up and get to UEFI  (see above where it ignored my F12)?","Update:I have the Win 10 installation media (from MS) on USBInserted USB into PC and booted upAs i suspected, I couldn't intercept UEFI and i'm back to completing the install with Dell's SupportAssistSince I'm dealing with a new HDD, I'm thinking I let the Dell SupportAssist complete and then just do a complete new install with the Microsoft installation media.  I know this is time consuming but it puts me in a position of getting a clean install... "]}]}