{"windows":[{"symptom":"SS3svc32.exe popping up on startup?        Hi all! So, for the past few days when I start my laptop the file SS3svc32.exe keeps popping up and trying to make changes. It pops up twice (I click no both times) and then stays away until next startup. I looked at the file location and it's with a program 'Sonic Suite 3' which I don't remember downloading and when I went to Apps in Windows Settings neither are listed. Is there a way for me to remove it? Thanks!PS. I have Windows 10* Moved from Virus & Malware","solutions":["It appears that valid versions of this Sonic Studio 3 software may come with or possibly be downloaded within other software packages such as the Realtech HD audio drivers for Asus based computers.https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-start-win_general\/sonic-studios-3-startup-request\/a7d540fd-6195-4179-b19e-d474e080368fIt's also possible it's malware, especially if the PC isn't an Asus or doesn't contain an Asus audio card or chip, so you'll need to make this determination yourself to know which is true.Rob","To get some clue about it, open Task Manager and click to show all details and under Startup tab look and see if you see this app and if you right click on it, you will get option to open file location and you could get some clue about what is it.Do NOT delete them but you could search and see what is it and uninstall it through proper way.","Hi MkeW Greetings! I am Vijay, an Independent Advisor. Use Revo Uninstaller (Free) to uninstall. Download from -https:\/\/www.revouninstaller.com\/revo_uninstalle... Disclaimer - This post contains reference to non-Microsoft websites and there may be ads on the page for products & services including products frequently classified as a PUP (Potentially Unwanted Product). Please thoroughly research any product \/ service advertised on the page before you decide to use them. Your discretion is very much advised.","Have exactly the same issue on two Windows 10 installations since the last Windows update beginning of October 2019. I have not changed anything on the drivers, this was definitely caused by the October 3, 2019 KB4524147 and the first UAC popup came on both systems right after the reboot after this update, on both systems.The file SS3svc32.exe is in my case located in c:\\Program Files\\ASUSTeKcomputer.Inc\\Sonic Suite 3\\Foundation\\ and belongs to theRealtek HD audio drivers suite, which is used on many ASUS mainboards. Hope some MS guy reads this, as those popups at each Windows boot are annoying.","Since this update Sonic Studio 3 gives a UAC prompt at startup. Possibly a certificate has become invalid. I now start it via the task scheduler with the highest privileges to get rid of it.","Hey man, I tried this hoping to get this UAC nonsense fixed but no luck so far. I created a task using Task Scheduler and set it to the highest privileges like you said. My logic is I'm disabling the current existing startup task at Task Manager first but then when I restart it doesn't start up at all. Can I know exactly how did you do it? Did you completely delete it first and then used the Task Scheduler?Thanks","Do it this way: https:\/\/www.sevenforums.com\/tutorials\/67503-task-create-run-program-startup-log.html","Exactly the same problem. After the last automatic update (yesterday), this popup appears.I have an Asus and Windows 10.I hope a new fast update could solve the problem.","I have an Asus PC and that same pop up alert started appearing after I updated Windows 10 to the latest update (#1903). I don't want to risk saying yes to the pop up until I know it is safe. I see no logical connection between a Windows 10 update and Asus audio drivers.","This started for sure after September 26, 2019 - KB4517211 (OS Build 18362.387).It's been reported by many users already and I opened also a Feedback Hub report:Feedback Hub link (copy & paste it into Edge browser): feedback-hub:?contextid=158&feedbackid=2694e945-cb0e-4015-9db3-9376b1ba20e3&form=1&src=1Tenforums link: https:\/\/www.tenforums.com\/windows-10-news\/141310-cumulative-update-kb4517211-windows-10-v1903-build-18362-387-sept-26-a-post1734330.html#post1734330 As far as I can see SS3svc32.exe task forces at every single launch a (re)creation of 2 tasks in Task Scheduler called SS3svc32Run and SS3svc64Run. This alone could justify UAC request, even though I see no modifications to Task Scheduler in KB4517211 changelog...Actually as Jörg Gutgesell said in one of the first posts it could also be a certificate problem, but for sure it started RIGHT AFTER installing KB4517211."]},{"symptom":"Cannot install Windows 10 on Lenovo Y70 - 70        Hello,I originally had windows 8.1 on my Lenovo Y70-70 and have had issues ever since I tried to upgrade to windows 10.  I have tried everything by using the Microsoft creation tool for a complete clean install of windows 10 when I upgraded my ssd and have received all errors that are listed.  I followed Microsoft's error codes to eliminate the issue and continue to receive all sorts of errors.  I even created a live linux distribution to test all of the hardware and everything works.  The other thing I was looking into is to see if I can \"pre-install\" the ssd using an adapter from another computer then install the ssd into the computer - but not sure if that is possible.Any suggestions would help!!Thanks","solutions":["Hi RJK42, It would be better if you will do a Clean Installation instead of an Upgrade. Please follow the steps here in this article: https:\/\/www.windowscentral.com\/how-do-clean-ins...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"Vmmem process will not be killed. Windows sandbox.        My computer has been using about 20 percent utilization since a glitch in the Windows Sandbox Program. I cannot get rid of the processes and they keep coming back on restart with the user as the generic random generated PC name that is given to a Windows Sandbox instance. The user name for the process is shown here: After attempting to delete the processes with the forced command this is now showing up on Task manager and I cannot see properties anymore but still a running process. Here is how to recreate the issue. I was just testing out the Windows Sandbox security by downloading a fake virus here : http:\/\/2016.eicar.org\/85-0-Download.html I then downloaded the free version of Malwarebytes (latest edition) and attempted a quick scan. What happened next was the computer had a minor meltdown and froze up, and then was supper laggy on trying to use commands like Ctrl Alt Del. Then I get an message shown above saying the connection to the sandbox was lost and having an error code.  If you hit yes this pops up: When a user hits ok, Sandbox closes and apparently keeps the virtual machine open even after restart or shutdown after many days. Not to mention now there is no longer any internet connection with the Sandbox instances. Now I know my computer that I built can handle this amount of drain but I am getting concerned that its not going to be able to be stopped. ","solutions":["Hi,Thank you for writing to Microsoft Community Forums.We understand your concern as you are unable to stop the Windows Sandbox process.Please try disable and re-enable sandbox to check the issue.Press Windows + R key, then type appwiz.cpl and click Ok.Click on Turn Windows features on or off from the left pane.Uncheck the box beside Windows Sandbox and click OK.Restart the PC and check.If the issue still persists then I would suggest you to post your query inTechNet forums, where we have experts and support professionals who are well equipped with the knowledge on Sandbox to assist you with the appropriate troubleshooting steps.Regards,Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"LOCKED COMPUTER        Hi - My mum passed away 2 years ago and my daughter would like to her use her computer for online schooling as it is a desktop.  Trouble is we do not know the sign in details. The email address my mum used was an aol account.  How do we get past the sign in screen please?","solutions":["Hi Moe. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.They do not make it easy when you forget your password, or else anyone could say they're you and get into your account. You should first try changing the password. If it's a Microsoft account password and you set up a security email or phone number then you can change the password easily enough in your online account here: https:\/\/support.microsoft.com\/en-us\/help\/402683... If not you have to go through account recovery: https:\/\/support.microsoft.com\/en-us\/help\/17875\/... If it's a local account you can change the password from the sign-in screen if you set up test questions for this purpose:https:\/\/www.windowscentral.com\/how-add-security... You can also enable the built-in hidden Administrator used only for emergencies as shown here:https:\/\/www.isumsoft.com\/it\/enable-hidden-admin... Sign into it to create a new Local Admin account in Settings > Accounts > Family & Other People > Other, as shown here:http:\/\/www.howtogeek.com\/226540\/how-to-create-a... Sign into the new account, test if the problem persists, if not then move your files over, test that all programs work or else reinstall them, then when ready delete the old account in the same place, and hide the built-in Admin account.You can then change it to your Microsoft account if desired: https:\/\/www.tenforums.com\/tutorials\/5375-switch...If these all fail then you may need to reset your PC, saving files. In order to avoid the need for the password you forgot you may need to create bootable media to access Reset or do the Clean install:To create Windows 10 Installation Media on another PC install Media Creation Tool and follow the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, on second screen choose Repair Your Computer, then Troubleshoot Options to try a Reset.If that fails choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, click Next to let it create needed partitions and start install - this makes it foolproof. Everything needed to get the best possible Clean Install is here: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... It is a better install than any amount of money can buy and a great learning experience that will make you the master of your PC because you will learn what works best and how to apply it with your own hands. If you have files that aren't backed up you can use the same bootable media to try to rescue your files using these methods:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... A suggestion for creating a complicated password that you'll remember: a [childhood street address] + [phone number] that doesn't exist any longer and only you remember for life.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Greg - thank you for getting back to me.  To be honest I am not even sure what Windows system is on there.  The receipt was in with some paperwork and it was purchased in August 2016 and she had what we thought was the password written on there but it doesn't work.  When we turn it on all we get is the sign in screen with my mums name and where you input the password.  I have tried everything we think she could use but we just get the message \"use last password used on this device or got to account.live.com to reset.  Problem is we have no idea what my mums Microsoft sign in\/user name was as the only email she used was aol.com.  Its to good to throw away and has hardly been used.","You should be able to tell by the sign-in screen if it's Windows 7, 8 or 10. Windows 10 Log on screen: https:\/\/www.google.com\/search?q=windows+10+logi...Windows 7 Log On Screen: https:\/\/www.google.com\/search?client=firefox-b-...Windows 8\/8.1 Log On screen: https:\/\/www.google.com\/search?client=firefox-b-...The same steps should work to enable the hidden built-in Administrator from the sign-in screen:https:\/\/www.isumsoft.com\/it\/enable-hidden-admin...Sign into Admin, leav password box blank, press enter. Now go into Settings > Accounts > Family & Other People > Other User to create a new MS or Local User Account as shown here:http:\/\/www.howtogeek.com\/226540\/how-to-create-a...In Windows 7 this is at Control Panel > User Accounts > Create Account.  Assign it Admin permission: https:\/\/www.windowscentral.com\/how-change-user-...Sign into it and set it up. You'll even be able to browse into the old User account to rescue files if needed at C:\\Users.Then when ready delete the old User account in Settings > Accounts > Family & Other People, and hide the built-in Admin account followinghttps:\/\/www.tenforums.com\/tutorials\/2969-enable...______________________ The alternative to this is to simply create new Windows 10 Media to boot into it and wipe the drive to do a Clean Install following the illustrated steps in this link which include everything that works best in Windows 10:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...This is so much better than a factory install that it will be better  than buying a new PC comparatively, so well worth the time and learning experience.To create bootable Windows 10 Installation Media (on another PC if necessary) install Media Creation Tool and follow the directions in the middle of the download page here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m...Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key for your PC maker given in this chart:https:\/\/www.sysnative.com\/forums\/hardware-tutor...If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, then on second screen choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, select the Unallocated Space, click Next to let it create and format the needed partitions and start install - this makes it foolproof.There is a step to rescue your files first using the booted media if you don't have them backed up:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC because you will learn everything that works best and how to apply it with your own hands.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","thank you Greg - I now know its Windows 10 so that's something.  I don't have a set up disc and to be honest am not really computer literate to the extent I think I need to be.  Think I will either have to contact Microsoft and actually talk to someone (if that's possible these days) or take it to a specialist.  ","I gave you step by step how to enable hidden Administrator to create a new account, to save you minimum $150 charge in a shop for something you can easily do with my help and learn more how to do these things.If that doesn't work I gave you step-by-step how to reinstall Windows 10 with an install much better than the shop will charge you to do, and also one of life's great learning experiences that will put you in charge of your PC's like never before since you'll know what to do and have done it with your own hands. I even wrote out how to create the bootable media so you wouldn't miss it. Did you want to at least attempt to enable built-in Admin to create a new account? I am here to help you now."]},{"symptom":"ipconfig \/all        hi there i used ipconfig \/all and found this program running on my dns server .hitronhub.home  i cant ping it . the search google comes up with bleepingcomputer  has any one else found this program ?","solutions":["Hello kerryburns1, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemThis name is uaually a Router name, which could be your router. Where did you see the name exactly in ipconfig command? Usually you see IP related information, not router name.. Farah","Hello kerryburns1, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemThis name is uaually a Router name, which could be your router. Where did you see the name exactly in ipconfig command? Usually you see IP related information, not router name.. Farah thanks for returning my message . the computer is on a work station ,. the modem is by the ip .i tried to release and renew the dns name but it still is there . i have reset the modem . and it still is there on the computer . i guess ill have to call the ip company . thanks for the text KB","Hey Kerry, you can try also resetting your network with this command netsh winsock reset make sure to run cmd as an administrator If you want to follow up with your ISP, it's also ok Hope it works for you Farah"]},{"symptom":"DRIVER FOR SIDEWINDER FORCE FEEDBACK PRO  FOR WIN10 PRO        HI I NEED THE DRIVER FOR WIN 10 PRO NEED FOR FLIGHT SIMULATORSEDEWINDER FORCE FEEDBACK PRO DRIVER ","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Unfortunately this hardware is not compatible with Windows 10 Regards, Ross"]},{"symptom":"Monitor goes dark for a few seconds        Bought this desktop recently, not even 2 weeks ago and this monitor was bought about 1 month and a week ago, so they are both quite fresh equipmentsDesktop:AMD Ryzen 5 2600 Hexa CoreASROCK Phantom RX 580 8GBASUS EX-A320M-GAMING8GB (2x4) RAM CL16 Ballistix 2400 MhzSSD 480GB Ultra M8S BlueRayMonitor:HP 24x (24'' - 1 ms - 144 Hz - AMD FreeSync)I've searched a bit about this problem and I haven't been able to fix it.Tried using different refresh rates, I've tried 144,120 and 60.Tried installing all the latest drivers in all the components.Tried changing the power saving settings.Tried changing the brightness of the monitor.Tried capping the fps in games so it wouldnt require so much power off the gpu.This flashing dark screens happen a bit frequently but it happens more with some apps than others and it doesnt usually happen while I'm just browsing or not really doing anything special.I'm not sure if this is normal or not but while playing my gpu is always at 99\/100% usage, could this be the problem? Is there anything I can do to solve this or is it a hardware issue than I can't fix? Even tho the hardware is recent","solutions":["Hi, Sounds like a monitor problem. Try to test your monitor and cable on another Computer.","Hi, Sounds like a monitor problem. Try to test your monitor and cable on another Computer. I Tried changing the power cable because the other one was a bit damaged, ill try to change the hdmi cable and then try it on another computer, I'll reply when I have time to try it","Ok, Let me know. Happy new year!","It took me a bit but I did try the monitor on a laptop and it didnt happen on it"]},{"symptom":"Disappearing and reappearing pointer        I am having issues with the mouse pointer disappearing and reappearing continually.  It makes sounds while doing it...I have run a scan and done some work on the command administrator but has not resolved the issue.","solutions":["Hi PAK1980, My name is Riccardo and I will be happy to assist...let's try a few things... Can you try booting in Clean Boot (as stated below) and show see if it disappears...I feel like a service or program is making this happen to you...https:\/\/support.microsoft.com\/en-ca\/help\/929135...Let me know, I will be here to assist."]},{"symptom":"Windows 10 upgrade problems.        Upgraded from Windows 7 to 10 last night.  Now Office 2013 will not open.  I can see my documents but trying to open them closes the program.  Suggestions?","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.You should try to either repair the Office 2013 installation, or uninstall and reinstall the software. This should hopefully resolve the issue.Regards, Ross"]},{"symptom":"Windows 10 Update        I generally do not do updates, but this time I let the Windows 10 Update go through.  Now, my Administrative capabilities are gone and I cannot get my Printer to work, no matter how many times I delete and reinstall it.  Also, I had Microsoft Tech Team look at my machine and the best answer that they came up with is to reformat my computer, which I do not want to do.  Does anyone else have the answer without reformatting the machine?","solutions":["Do you know what the update was. Setting > Update and security select View update history.What is your current version and build,  type winver in Search and select the top result. Post a screenshot or quote the version and build in full.If you can install the printer driver what administrative capabilities are missing. What is the make and model of the printer.","the version is 1909 (OS Build 18363.535).the make and model of the printer is HP Officejet 5740 (lost the original disks)I just remember that the update was for windows 10Nothing is showing in historyWhen I try to install the printer it is asking for the WPS ID which I now but the system will not accept the password.  Error Code 0x00000490.   it recognizes the wireless printer but will not let me install anything on the computer.The system will not let me download or change any setting on the computer without having Administrator  Permissions.  the YES button is missing when the system asks if you want to make changes to the system.","Make sure you have the latest drivers from HP.https:\/\/support.hp.com\/us-en\/drivers\/selfservice\/hp-officejet-5740-e-all-in-one-printer-series\/6617253\/model\/6617254Regarding the missing option to select Yes for admin permissions that could be a little more difficult. Check your account in Settings > Accounts to see if it states the account is an administrator account.If you can verify your account is shown as an administrator but will still not allow you to install the drivers. You can check possibly how your account is acting by simply trying to open a PowerShell (Admin) prompt, if that also fails to allow you access then your account permissions have been damaged. To try PowerShell right click Start and select PowerShell (Admin). What happens, if it still doesn't allow you to select a Yes button then you are going to have to try to repair it via Safe Mode.At the sign-in screen select the Power icon in the bottom right hand corner.Hold down the Shift key and select Restart.After the restart select Troubleshoot,  Advanced options then Start-up Settings, select Restart and then after the restart press F4 to select Safe Mode.See if you have the option to select the built-in Administrator account to sign-in. (bottom left hand corner)If you do then select that and carry out the command net localgroup administrators Your_User_Name \/add as below.If you don't have the option for the built-in Administrator account then you can try your own account for the following but I suspect you are going to have to create installation boot media, unless you already have it.Using your account (if you cannot use an Administrator account) right click Start and select PowerShell (Admin) and see if it opens and allows you to select Yes in Permissions.If it does you can activate the Administrator account by typing net user administrator \/active:yes press return. Now restart the computer and sign-in to the Administrator account. Use this account to set your account in normal mode. Open a PowerShell (Admin) again and type net localgroup administrators Your_User_Name \/add(use your account name in your_user_name)Restart again and sign-in to your account and try the printer install again. (don't try to use the Administrator account for setup)Report back how it goes, if you need installation boot media you will need to use the Media Creation Tool and an 8GB (min) USB flash drive. http:\/\/www.microsoft.com\/en-us\/software-download\/windows10","Thanks for your help, I reformatted the drive."]},{"symptom":"Impossible to add Office 365 Microsoft account to Windows 10 Pro computer        Hi, I have a computer with Windows 10 Pro installed on it.It was set up originally with a local account. Now I want to have it login on our Enterprise Microsoft accounts.Unfortunately, when I try to login, the computer only allows logging in with personal Microsoft accounts and not business ones (I've tried with a hotmail address and with a company address, only the hotmail address works).Any idea how I could solve the issue?Thanks,Florian","solutions":["Hi, Sorry I’ve not gave you correct information there. You actually need to use Azure AD to allow login with these types of accounts.Here is a thread which gives instructions on how to configure this: https:\/\/www.tenforums.com\/user-accounts-family-...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"App installation issues        Hi everyone, hopefully someone can help me with an issue I am having. I have been trying to download the lightroom app on my computer but it won't let me install. It says, \"where do you want to install? It looks like you don't have an applicable device linked to your Microsoft account. To install, sign in on a device with your Microsoft account.\" I go into the Microsoft store and I am logged in, any suggestions?","solutions":["Hi Casey. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.For Store GamePass install issues there is a fix that's working here: https:\/\/www.reddit.com\/r\/theouterworlds\/comment...Otherwise I'll give you everything possible to repair the store. Even if you've tried a step please do it over in this sequence. If any steps cannot be performed then report it and move on to the next:1) Try updating Store apps: https:\/\/support.microsoft.com\/en-us\/help\/402625... 2) Make sure you have the latest Windows 10 version 1909 in Settings > System > About and if not skip to Step 10 to install it by the most stable method.3) See if the fixes here help: https:\/\/www.pcworld.com\/article\/3053099\/windows... 4) Try running the Windows Store apps Troubleshooter at Settings > Update & Security > Troubleshoot.5) Try resetting the Store cache: http:\/\/www.thewindowsclub.com\/reset-windows-sto... 6) If that fails go to Settings>Apps and highlight Microsoft Store, choose Advanced Settings, then Reset. After it resets, restart PC.7) If that fails then reinstall Store. Type CMD in Start Search, right click Command Prompt result to Run as Administrator, copy the following code and paste it into the box using the Edit tools from Box's top left dropdown menu, press Enter:PowerShell -ExecutionPolicy Unrestricted -Command \"& {$manifest = (Get-AppxPackage *WindowsStore*).InstallLocation + '\\AppxManifest.xml' ; Add-AppxPackage -DisableDevelopmentMode -Register $manifest}\"8) Clear the LocalCache Folder: Open Run by pressing the Windows key + R hotkey. Copy and paste %localappdata% in Run and click OK. Open Packages> Microsoft.WindowsStore_8wekyb3d8bbwe > LocalCache folder. Press the Ctrl + A hotkey to select all content within the LocalCache folder. Press the Delete button. 9) If these all fail then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account because of the serious and persistent problem with corrupted accounts. Then continue with the other steps to go over your install most thoroughly.10) If nothing else works then do a Repair Install, by installing Media Creation Tool and then choosing to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"100% disc usage issue        Hello all,Could the disc activity by any chance be the auto-defrag program at work?All the best, J","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.If the de-frag program is running it’s very likely that it will be causing the 100% disk activity.Regards, Ross"]},{"symptom":"The application has failed to start because its-side-by-side configuration is incorrect        Hello, I'm having an issue with my computer, when I try to open almost ANY application I get the following error: \"The application has failed to start because its-side-by-side configuration is incorrect\"I have tried installing all the reinstalling all c++ redistributable but I get the same error when I try to open the setup, so I can't even reinstall them.here are the event logs for SideBySide:Activation context generation failed for \"System Default Context\". Dependent Assembly Microsoft.Windows.Common-Controls.Resources,language=\"&#x2a;\",processorArchitecture=\"x86\",publicKeyToken=\"6595b64144ccf1df\",type=\"win32\",version=\"5.82.17134.1184\" could not be found. Please use sxstrace.exe for detailed diagnosis.apparently this one is not related to C++ redistributable. I'm using Windows 10","solutions":["Right click the taskbar and check Side by side.   It may have not been set up or if it has you can remove it.","Hi FabioPimentel1 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes. I will keep working with you until it's resolved.Thank you!","Hello Joseph, That didn't work, I keep getting the same error after following the guide.","Hi FabioPimentel1, I would suggest you repair Windows 10 Using In-Place Upgrade. https:\/\/www.kapilarya.com\/how-to-repair-windows...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thanks! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"upgrade from MS 8.1 to 10        upgrade from MS 8.1 to 10","solutions":["upgrade from MS 8.1 to 10 upgrade from MS 8.1 to 10","Hello Richard, Did you have a question about the upgrade from Windows 8.1 to 10?If you wanted to know how to, you can use the same method in the tutorial below to do so for free if your current Windows 8.1 is activated.https:\/\/www.tenforums.com\/tutorials\/139745-upgrade-windows-10-windows-7-free.html","Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Are you having an issue upgrading or do you have a specific query? Regards, Ross"]},{"symptom":"WIFI        good day,I upgraded my computer to window 10 and now i m unable to connect on wifi.please help","solutions":["Hi Jason. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything that works to fix Wifi so that at least something will work. Even if you've already tried a step please try or check it again in sequence. If you need any assistance I'll be standing by here to help:Update your network adapter drivers from the PC maker's Support Downloads web page using the full model number, HP Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.If you have the latest network driver then try on it's Driver tab also to Roll Back, or Uninstall and then restart PC to reinstall the driver. Try also all older drivers from Update Driver > Browse > Let Me Pick list working backwards.Go to Device Manager > Network Adapters, select Wifi adapter, then Power Management tab, clear the check box to \"Allow the computer to turn off the device to save energy.\" Then on the Advanced tab disable any energy-saving options.If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool explained here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them.If this was caused by Version update then you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool.For Wifi won't connect after Version 1903: https:\/\/windows101tricks.com\/fix-wifi-keeps-dis...https:\/\/www.techrepublic.com\/article\/wi-fi-and-...https:\/\/pureinfotech.com\/fix-wifi-problems-wind...Enable IPv6 in the network adapter settings: https:\/\/www.tenforums.com\/tutorials\/90033-enabl...Run the fixit from https:\/\/support.microsoft.com\/help\/929852 (Re-enable IPv6 on all nontunnel interfaces) and reboot.Right click the network icon in System Tray at bottom right end of task bar to Troubleshoot Problems.Try all of these steps: https:\/\/support.microsoft.com\/tr-tr\/help\/10741\/... https:\/\/www.kapilarya.com\/how-to-reset-network-...Go to Settings > Network & Internet > WIfi > Manage Known Networks, highlight and remove the network having problems, restart PC to see if it shows up again.Try plugging in by ethernet cable to the router to compare, then plug the ethernet cable into the modem (if separate) to see if this might be an issue with the router.Try powering off modem, router and PC and then restarting in that order with 1 minute in between each. You may need to reset your router or even optimize it following these steps:https:\/\/www.lifewire.com\/resetting-a-home-netwo...https:\/\/www.pcmag.com\/article\/258865\/how-to-set...Your router manual is always available from the manufacturer's website for your exact model.You also are entitled to Support from your internet provider to get online on all devices. This is always included in the monthly bill. If your router is less than a year old they will also Support getting it connected and optimized.Another option is you could replace the wireless adapter with an inexpensive USB nano adapter like this one:https:\/\/www.amazon.com\/OURLiNK-600Mbps-Wireless...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Surface Pro 7 crashes when waking up from sleep        Happened four times during one month.SP7 is docked to an external monitor via USB C, plugged to its own power adapter.Surface display is turned off due to the cover keyboard being closed.Using wireless keyboard and mouse via usb dongle (Microsoft Wireless Desktop 900).Upon waking up from sleep, the external monitor image shows up, but mouse appears frozen and a few seconds later I get a blue screen followed by a restart. Event viewer shows BugCheck events and Microsoft-Windows-Kernel-Power events.system event logsminidumps (four, one for each bsod)I also have MEMORY.DMP, I can share them if needed","solutions":["Hi Ettore The minidump files indicate your crashes are caused by iacamera64.sys, which is the webcam device driver on your SurfaceGo to the support page for your Surface Pro 7 , then from there download and install the latest drivers and firmware which were released on 4 December to see if that resolves the crashing . ..https:\/\/www.microsoft.com\/en-us\/download\/detail...","Hi Davethanks for taking the time to look at the minidump.I'm already running the latest drivers (I almost daily check for updates)I just double checked, in the update history I have:Intel - Camera - 42.18362.3.11803Successefully installed on 12\/4\/2019"]},{"symptom":"Windows Security Worm terminology        I installed an old thumb drive and got a worm notification. One was \"quarantined\" and I deleted it. The other (Worm:VBS\/Slogod.E) said \"failed\" I don't know if that means the worm failed to activate, or windows security failed to contain the threat. A scan of my device by Microsoft Safety Scanner failed to find anything. However, I would like to confirm I don't have anything to worry about and to understand what \"failed\" means in this context.","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.I would recommend scanning your system and the drive using a malware removal tool such as malware bytes to double check there isn’t an issue:https:\/\/www.malwarebytes.com\/Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"wevtutil        I am trying to export the following events with specific event id i am able to get all the events for particular NetworkProfile but unable to get the results only with event id. I am using the following command.wevtutil epl Microsoft-Windows-NetworkProfile\/Operational filename.evtx \"\/q:*[EventId=10000]\"","solutions":["This question is beyond the scope of this consumer-oriented forum.  You might get an answer in the TechNet or MSDN forums (see, e.g.,https:\/\/social.technet.microsoft.com\/Forums\/en-US\/home?forum=whatforum&filter=alllanguages).I think that the syntax of your query is incorrect, but I can't help you any further than that.See http:\/\/blog.commandlinekungfu.com\/2009\/10\/episode-66-log-jam.html, which includes this quote:\"The wevtutil query syntax is impossibly complex, and something I frankly loath.\" I completely agree. Everything about this command is sideways, even the default format isn't readable. I highly suggest using PowerShell since anything but the most basic query gets ugly. However, this command gives us a lot of control over the event log besides querying such as enumerating logs, getting or setting log configuration, getting log status, exporting, archiving, and clearing logs.Also see https:\/\/www.petri.com\/command-line-event-log"]},{"symptom":"Windows 7 Extended Support        Hi Guys:Can I purchase extended support for Windows 7?","solutions":["There seems to be some confusion about this, so this is from Microsoft  Last Updated: 26th Nov 2019.Home users are excluded from this offerN.B. Volume Licensedhttps:\/\/support.microsoft.com\/en-au\/help\/4497181\/lifecycle-faq-extended-security-updatesHow can I purchase ESUs?Extended Security Updates are available through specific volume licensing programs. Contact your Microsoft partner or account team to learn more. ESUs for select Embedded products are available via your embedded device manufacturer.Coverage will be available in three consecutive 12-month increments following End of Support. Customers cannot buy partial periods (e.g., only 6 months). Extended Security Updates are transacted per year (12-month period), commencing with the End of Support date.Eligible customers can use the Azure Hybrid Benefit (available to customers with active Software Assurance or Server Subscriptions) to obtain discounts on the license of Azure Virtual Machines (IaaS) or Azure SQL Database Managed Instance (PaaS).___________________________________________________FAQ about Extended Security Updates for Windows 7: Last Updated: 24 Dec 2019 https:\/\/support.microsoft.com\/en-gb\/help\/4527878\/faq-about-extended-security-updates-for-windows-7This article is intended for use by IT professionals. If you're looking for information for home users, seeWindows 7 support will end on January 14, 2020.__________________________________________________Now we also have this at October 9, 2019, 6:40am EDT :https:\/\/www.howtogeek.com\/443573\/how-windows-7s-extended-security-updates-will-work\/The average Windows 7 user can’t buy these updates, however. They’re only available to businesses and other organizations.Some good news: Instead of just being available to large companies with volume licensing agreements, Windows 7 Extended Security Updates (ESUs) will be available to businesses of any size—even small or mid-size companies.Microsoft won’t sell you these updates directly, and they’re not available through normal retail channels. According toMary Jo Foley, Microsoft officials said these ESUs must be purchased “from qualified Cloud Solution Provider partners.” AMicrosoft blog post about Windows 7 support invites interested parties to “Please reach out to your partner or Microsoft account team for further details.”Cheers.","Not unless you have a volume license agreement with Microsoft.With that in mind, today we are announcing that we will offer paid Windows 7 Extended Security Updates (ESU) through January 2023. The Windows 7 ESU will be sold on a per-device basis and the price will increase each year. Windows 7 ESUs will be available to all Windows 7 Professional and Windows 7 Enterprise customers in Volume Licensing, with a discount to customers with Windows software assurance, Windows 10 Enterprise or Windows 10 Education subscriptions. --https:\/\/www.microsoft.com\/en-us\/microsoft-365\/blog\/2018\/09\/06\/helping-customers-shift-to-a-modern-desktop\/The same article says:  \"Please reach out to your partner or Microsoft account team for further details.\"  Do you have a \"partner or Microsoft account team\"?  If no, you don't qualify for ESU."]}]}