{"windows":[{"symptom":"Xbox wireless adapter for Windows - Driver error - Troubleshooting does not resolve the problem        Hello,I have had so many problems with this adapter. Code 10 errors, status 0x0, device requires further installation. Just to list a few. There appears to be an issue in the registry. Uninstalling the driver\/device and restarting (twice) as directed in the troubleshooting steps hasn't fixed the problem. I have literally tried every troubleshooting process. The problems get worse with each cumulative and feature update. I used to have the 360 controller adapter and never once had a problem. It was rock solid and worked flawlessly.I have both styes of adapters. The older, bigger one and the newer, smaller one. Problems with both.... Driver problems with both...There are other threads of people having the same problems with this device. A hard fix that cleans the registry (completely removes the corrupt driver) will need to be the solution. Or develop a new driver entirely. Deleting\/reinstalling the driver over and over hasn't worked for me. Most of the discussions have the canned replies with links to the same troubleshooting sites. A waste of time. Any help from Microsoft support is greatly appreciated!","solutions":["Hi Sean. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I do provide the latest working controller fixes which help most who I provide them but since you said you don't want those but would rather speak with Support (this is a Forums) then here is Xbox Support contact:https:\/\/support.xbox.com\/en-US\/contact-us","Hi Greg,Thank you for the prompt reply! If you can help me through this issue, I'd be very grateful. This has been such a pain for me. Like I mentioned previously, the troubleshooting steps haven't worked. Any other steps that I can try, I'm open to that!Sean","Sean, I don't know what troubleshooting steps you've tried, but I'll give you what I have for fixing Xbox wireless controllers:https:\/\/www.lifewire.com\/xbox-one-controller-tr...https:\/\/www.makeuseof.com\/tag\/how-to-fix-xbox-o...https:\/\/support.xbox.com\/en-US\/xbox-one\/control...https:\/\/www.gamepur.com\/guide\/23555-how-fix-xbo...https:\/\/www.digitaltrends.com\/gaming\/how-to-syn...https:\/\/appuals.com\/fix-xbox-one-controller-dis...One of those will usually do it. Let me know.","Thanks Greg! I'll try these out and reply back, good or bad, in a few days.","Keep me posted on your progress as I will be here to help until the case is resolved.","Hi Greg,I worked through the holidays. Apologies for the delay. The link explaining known issues with NVIDIA drivers and GeForce Experience lined up exactly with what I was seeing on my end. The feature update to 1903 did something to my NVIDIA driver. I captured 2 snips. The first, a snip of programs and features. What it looked like before the feature update.The second, a snip after the feature update. This is after uninstalling geforce experience, as recommended in the link. I uninstalled it a few days ago and tried to reconnect the adapter. Here's the snip.I'm no longer able to uninstall driver 399.24 through programs and features. It appears to be the installed driver through device manager however.  After uninstalling geforce experience, I was able to plug the adapter back in, line of sight, and reconnect to my controller. It paired.It's done this before, shows up as an audio device in settings.It also doesn't shut itself off after 15 minutes. In devices and printers through the control panel, It appears but with a little clock icon on it. The icon goes away after 10 seconds or so. I shut the controller off by holding down the center xbox button on the face until it powers off. The light on the adapter itself turns off also. There have been many times when the light on the adapter stays on even after the controller powers off. When that happens, I cant re-pair the controller to the adapter. Only unplug from USB and replug adapter back in will allow a re-connection to the controller.Since I would see pairing\/connection issues after cumulative updates also, I paused updates. I just wanted to play... I'm behind on updates with MS. I'm not prompted to download and install 1909 on my gaming rig. I'll follow up again after the updates on the 14th and thanks again.- Sean","Oh, and the firmware on the controller is up to date. Through the accessories app."]},{"symptom":"Microsoft Security vs Trend Micro        Can someone tell me if it is necessary to use another security program ie. Trend Micro if a new computer comes with Microsoft Security?","solutions":["Hi frog66TC, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.I have used the built-in Windows Security and no third-party security program for several years, and have not run into any issues. The built-in security also provides the best performance, whereas third-party applications generally tend to slow the system down and cause more problems than it is worth. It is not necessary to use another security program, especially if you are careful about the links you click on.For more information on Windows 10's built-in security, you can visit this website:https:\/\/www.microsoft.com\/en-us\/windows\/compreh...I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","You don't seriously think you'll get an objective opinion on Windows Defender in a forum sponsored by Microsoft, do you?Windows Defender is fine antivirus software, but lots of third-party developers also make excellent antivirus software. It's your choice to make - no one can tell you what is best for you.When I made my choice, I preferred to rely on objective testing rather than the opinions of people I never met whose expertise was unknown to me (and easy to exagerate.) The professionals who test antivirus software for a living are the real experts ... I turned to their testing results for my decision.If you do the same, you'll find that, while on any given day there are some products that are better than others, on the whole most antivirus does a fine job of defending a computer against malware. So your choice may be heavily influenced by how easy it is to work with the software, whether you like the user interface, whether you get good support and what other features come with the software. These are choices only you can make, after considering the facts.Most important of all is to appreciate that antivirus software is only a second line of defense against malicious attacks. We, the computer users, are the first line of defense - our willingness to learn about the threats that face us and how to avoid them. No antivirus software can do that.","Whether you want to use Windows Defender or want to install another AV depends on your own preferences and habits.Personally, I prefer a third party product.No matter which AV you use, there might be situations in which you want to use other Anti-Malware programs for occasional, on-demand scans.Suggestion to read:Choosing an Anti-Virus ProgramSafe Steps for Replacing your Anti-virus - Why should you use Antivirus software?Supplementing your Anti-Virus Program with Anti-Malware Tools"]},{"symptom":"Not being able to hear anyone in Xbox Party chat Via Xbox Game Bar and Xbox Console Companion. It appears that no one is speaking but that is not true...        So for months I have been having problems trying to use Xbox Party Chat on the PC via Xbox Game Bar and Xbox Console Companion. When I join the party from one of those apps it either disconnects me right away or i connect and its as if no one is speaking, only me. It happened out of no where about two months ago. I have no idea what to do. My NAT type is open, my microphone works just fine. People are actually speaking in the party but the mic monitor is saying no one is speaking. I need help guys this is making me so angry its atrocious........","solutions":["Hi Dylan. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See how to troubleshoot Party chat audio here: https:\/\/beta.support.xbox.com\/help\/hardware-net...https:\/\/www.reddit.com\/r\/xboxone\/comments\/2gdz2...https:\/\/www.reddit.com\/r\/xboxone\/comments\/7wruj...Go into Windows Settings > Apps > Apps & Features and Reset and Repair each Xbox app in their Advanced Options, restart PC.If that doesn't work re-register Xbox game bar and Console Companion from Option 2 here:http:\/\/www.tenforums.com\/tutorials\/3175-apps-re... If that's not enough uninstall each of those in the same place, restart PC, then reinstall from MS Store Settings > My Library.If none of the above work then contact Xbox Support here: https:\/\/support.xbox.com\/en-US\/contact-usYou can also post this in Xbox forums here: https:\/\/forums.xbox.com\/en-US\/home and ask for an Ambassador who are the MVP's of Xbox. I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Question about Windows 10 Product key online recovery        Hello, a few months ago  while I was searching Microsoft Help I saw a suggestion to store my Windows 10 product key online. I was asked to make an account in Microsoft for that purpose and so I did.  My thought was that if I came across any problem running windows in my pc and had to reinstall windows I could easily recover the product key which came with my computer when I bought it. Does anyone know what I am talking about and what the process is to retrieve my key by providing my account credentials ? Thank you","solutions":["Hi Ean,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Irrespective of you link your Windows License with Microsoft Account or not, Microsoft has your license information stored with your computer information on the servers which is called a digital license. Digital license doesn't require a product key to be remembered.As soon as you do a clean install, you would find Windows activated. Just skip entering the key if prompted.Linking digital license to Microsoft has just one additional advantage, it helps you to transfer Windows License to another computer without calling Microsoft.","Since your key is from being on the computer when you bought it it is OEM and not transferable and as it is tied to the motherboard as long as you do not change the hardware there is no nee to save the key as you do not need it to do upgrades and updates."]},{"symptom":"outlook password blocking entry to my laptop        hi i am blocked out of my laptop because i havnt used it in so long and i dont have password to reset it, i have tried resetting through outlook with a different email address it sends passcode then asks questions that i cant answer so after 3 days im still stuck im running windows 10 system please somebody help me","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.If you cannot reset the password for your Microsoft Account you won't be able to login to Windows. If this is the only login your computer is set up with you will need to reinstall in order to regain access.Reinstalling will NOT lose your files - however it will remove all your apps and settings.if you visit the following link on a working PC you can build a USB installation media which can then be used to reinstall the problem PC:https:\/\/www.microsoft.com\/en-gb\/software-downlo... This will install a fresh version of Windows 10 - when you are asked to pick a username you would need to make a new one if you have lost access to your existing account.Regards, David","hi david thank you so much im trying it now will let you know how it goes. just noticed your from scotland I too am Scottish from dumfriesshire but living in usa now lol. again thank you"]},{"symptom":"I can't send email. I keep getting an error message saying unknown errors were found. No solution or explanation was given.        I can't send emails. I keep getting an error message saying unknown errors were found. No solution or explanation was given.","solutions":["Hi Daniel. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.The most important information we need to know is how are you trying to send the emails? Is it in a browser or via the WIndows 10 Mail app?Did you try another browser? I would have several browsers on your task bar so there's always one that's best for the task. I use Firefox, Edge and Chrome in that order of preference. It's easy to share bookmarks between all of them in their settings under Import Favorites from another Browser, and Firefox and Chrome let you sign in to save and\/or sync your Favorites on any other device you sign into. Set the preferred browser as Default in Settings > Apps > Default Apps.I would also try the Windows 10 Mail app which is an easier way to access your mail with a huge inbox that lets you merge all of your Office and Web Mail accounts, and an even larger ad-free reading pane. See here how to get started:https:\/\/www.windowscentral.com\/how-get-started-... If you'll post back more information like which email provider you use, whether you're using a browser or the Mail app, and the exact wording of the error, I can help you better.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thank you Mr. Greg Carmack for your reply. It's Daniel Miller9 hereI'm using the Windows Live Mail 2012. I'll show you the error message that I'm receiving. As follows.ErrorsUnable to send or receive messages for the Shaw(joey4224) account. Your server has unexpertly terminated the connection. Possible causes for this include server problems, network problems or long periods of inactivity.Then it shows the Server: pop shaw.caWindows Live Mail Error ID:Protocol: POP3 0x800CCC0FPort:110Secure(SSL):NoI have an internet connection. I'm able to use my browser which is Goggle Crome. ","I see, Daniel. The problem then is that Windows Live Mail has been discontinued for two years, and is actively being shut down, with warnings for over a year that features would be shut off soon:https:\/\/www.computerworld.com\/article\/3067121\/e... I would migrate now to WIndows 10 Mail which is comparable except that it doesn't store any mail but is only a sync service for you web and Office Mail boxes. There's a full guide to set it up and use it here:https:\/\/www.windowscentral.com\/how-get-started-... I have no problems using WIndows 10 mail for several years now to sync all of my web mail boxes, like the ability to merge inboxes (or not) and the huge ad-free reading pane.Note that you may need to uninstall all Windows Live Essentials to get WLM out completely so it doesn't keep claim as default Mail app and you can choose a new one in Settings > Apps > Default Apps.If you have Mail you need to export to another Mail program, I would do it now while you still can as shown here:https:\/\/archive.codeplex.com\/?p=windowslivemail...https:\/\/www.experts-exchange.com\/questions\/2907...https:\/\/webapps.stackexchange.com\/questions\/496...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Daniel, may I ask why you'd give me another bad rating when I gave you the exactly correct information? It may not be what you wanted to hear, but didn't you want the truth? Did you want to continue floundering with WIndows Live Mail which is being shut down right now until you lose all your mail? I gave you what you needed to make the transition and save your mail, in return you gave me a bad rating? Why?","Attention Mr. Greg CarmackDaniel Miller9 here.I have the whole suite of MS programs such as Excel, Word, One Note, Outlook, Power Point. Do I have to uninstall these programs to activate the Windows 10 email program. Also if I expel Windows Live 2012 how do I save all my email accounts addresses. Also since Windows 10 doesn't store emails where do I go and what do I do to save emails. I looked at those other programs and they have a lot of unnecessary information. I only want to know the basic steps for installing or deleting a program.","Dear Mr. Greg CarmackIm sorry if I've upset you. I believe I hit the wrong star by mistake. I'm an elderly retired senior citizen. It's difficult and confusing for someone my age who doesn't have the educational background or experience to fully understand or use all the modern technology efficiently. It's a constant learning curve and an up hill battle for me every day. So where do I go from here. If I delete Windows Live 2012 will Windows 10 save my email accounts. Please tell me.Sincerely Daniel Miller9","Daniel - You will need to move your Mail somewhere, I suggest Office Outlook since you already own it, following this process:https:\/\/www.howto-outlook.com\/howto\/migratefrom...Take your time to study over it and ask back any questions.  I will walk you through the steps as necessary.If you haven't set up Outlook yet here's how: https:\/\/support.office.com\/en-us\/article\/add-an...If you don't want to use Outlook you can keep your mail in the folders of your online web mail account that you use to sync to Windows Live Mail, then link that account to Windows 10 Mail with my help. Is this Yahoo, AOL, Gmail, Outlook, etc? If this is an Outlook.com mail account then once you import it into Office Outlook Mail it will sync with the account. Therefore your mail will be in Office Outlook, in your online Outlook.com account, and in your Windows 10 Mail account.  We can even set up a new Outlook.com mail account to do this.  I hope this isn't too confusing, if it is just keep asking back questions until we get it cleared up. I will keep helping you until it is resolved, the only way I can wipe away the bad ratings is to have a solution marked Answer once it's all done, and hopefully a better rating. But let's not worry about that now."]},{"symptom":"rca cambio 2 in 1        the windows 10 home 32x on my tablet has no driver absolutely none I don't know how and I don't know what to do, I can't connect to the internet, I can't use touchscreen interface, no audio drivers nothing I'm completely lost","solutions":["Hi Lex_Zen I'll try to help you out. If you have no internet connection on your device, you'll have to download the driver from another computer, then copy them to a USB key, to install them on your device.Check the manufacturer's website to get the exact drivers needed for your device Regards Jay"]},{"symptom":"Windows update 1909        Hi, ever since updating to 1909 I keep getting read errors.  I can't install programs because it says:\"The instruction at 0x000000007287fd43 referenced memory at 0x000000007eecf742.  The memory could not be read. Click on OK to terminate the program.\" with an ok button bottom right and nothing else except the X in top right corner. Programs won't run and throw read errors, specially Windows Media Player, and all the settings in my computer were set back to factory default. I still haven't worked out how to make the logins work when I hit remember after the update before that so I have to log in to every page every time I go there which is frustrating to say the least.Please help with this because I am about ready to tell microsoft to keep their bloody errors and try moving to another operating system.","solutions":["Hi salem44, I think you are logged into a temporary account . . . Before you do anything else Restart (not shut down) your PC 4 times, each time let your PC get to the Desktop before the next restart, this will fix this issue a lot of the time . ..If the above does not resolve this for you: Start your PC, just as Windows attempts to load (spinning dots), press and hold Power Button for 5 - 10 seconds to perform a Hard Shut DownDo this twice On the third start Windows will boot into the Recovery Environment and from there you can access System Repair, Safe Mode, Command Prompt . . . etc.Please try each option one at a time, then see of Windows will boot to a usable operating system . . .If there is an option to roll back or remove that update, that would be the best option . . .Go to Troubleshoot - Advanced Option - System Restore Check to see if you have a restore point you can go back to","I think you are logged into a temporary account . . . I am logging in the same way I always have its just since 1909 has come in that things are screwy and 1903 as well.I tried the restart 4 times (actually miscounted and it was 5) and as soon as windows had finished running up I had 4 read error windows to get rid of so that didn't work.I still can't get my logins to be remembered either and have forgotten how to do that or if there is a setting that covers it.Thanks for your timeBelinda","Hello, the error you are receiving is associated with the RAM. Can you search mdsched in the taskbar search. Open the program.This will ask you to reboot your computer and will test the RAM. You want to run the standard test which is started by default. Take note of any errors, if any, and let us know what they are.Andrew","Hi Andrew, thanks for your help!I ran the memory diagnostic tool and it returned no errors in the RAM.  Am really puzzled now because my computer said it wanted to install the 1903 update last night so I set it to do that and went to bed.  This afternoon it still says it needs to install that update!! When I tried to use the computer it wouldn't let me log in - would not go to the pin screen so I could input - so I rebooted it.  After that I have rebooted it about 5 times including the diagnostic run because it hasn't been doing anything but sitting with the hard drive running (which it is still doing now, but at least I can type this message).Anything you can suggest would be a great help!!!!Belinda","Hi again Belinda, I'm glad to hear your RAM tested ok. I still think there is some problem with your memory and it could very well be what we call Virtual Memory. We may need to expand it, to do this please follow:1. Click the file explorer folder on the taskbar 2. Right click on THIS PC on the left pane and select Properties On this page make note of how much RAM you have installed. Now on the left pane theres a link that says ADVANCED SYSTEM SETTINGS, click that3. The window that opens click the Advanced tab, then click SETTINGS under Performance.4. Click the Advanced tab again, then Change under virtual memory. 5. There's a box with a check mark in it that says to automatically adjust your virtual memory or page file. Is it checked?If so look and see how much it says is allocated for virtual memory, it should be at 1.5x the amount of physical RAM. So if your system has 4GB of RAM the page file should be 6GB (6000ish MB, remember 1GB is 1024MB). Its ok to be a bit lower if the system is managing it as it uses more when its required and may not be needing it at this point.If that box is not checked off I would check off that box and reboot your PC. As for the update issue, you're always best off to download the media creation tool from the website. Run it as an update, not an install. It should choose to keep all your files straight away and update. You can get that herehttps:\/\/www.microsoft.com\/en-ca\/software-downlo...Hope this resolves the problems here, if not let us know :) Take Care, Andrew","OMG... I haven't had to touch the virtual memory since I installed Win 7 after I built this computer... it was at 2688mb if you were interested and has 3 hard drives running all with 1tb each with 8gb of RAM.  Since the dedicated windows hard drive has 700gb of space I made the virtual into 12gb to give it some legs.  Hopefully things will move much faster now.Thank you so much for your help.  Have DL'd the update from the link above and will now install and then reboot the monster and hopefully no more memory screwups and such.  Just as a ps I tried for the 5th time today to download and install with the windows update in settings and it went to 17% and threw an error and then 20% and threw Error 0x800706be at me.  Hoping that will be fixed as well as the rest of the stupid stuff that is infesting this computer in the last few weeks.Belinda","Sometimes an upgrade will install better when run manually as you are about to do. But, if it still throws errors...https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/setupdiagSetupDiagPost the full contents of SetupDiagResults.log, which should be small enough. If lucky, it will pinpoint the problem. And since you've got more than one internal HDD, post a shot of \"Right-click START, Disk Management\". Use the divider lines in the header & between the panes to make it readable...","Hi PCR, the info you asked for is posted below... apparently my computer doesn't like lightshot taking pictures of it so it shut the program down three times, but I found a way to get that screenshot for you!!Matching Profile found: FindSuccessfulUpgrade - 8A0824C8-A56D-4C55-95A0-22751AB62F3ESetupDiag version: 1.6.0.0System Information:    Machine Name = DESKTOP-0EVB2JK    Manufacturer = Gigabyte Technology Co., Ltd.    Model = To be filled by O.E.M.    HostOSArchitecture = 1033    FirmwareType = UEFI    BiosReleaseDate = 20131023000000.000000+000    BiosVendor = F15    BiosVersion = F15    HostOSVersion = 10.0.17763    HostOSBuildString = 17763.1.amd64fre.rs5_release.180914-1434    TargetOSBuildString = 10.0.18362.474 (19h1_release_svc_prod1.191028-1734)    HostOSLanguageId =     HostOSEdition = Core    RegisteredAV = Avast Antivirus    FilterDrivers = FileInfo    UpgradeStartTime = 13\/12\/2019 16:22:28    UpgradeEndTime = 25\/12\/2019 19:09:28    UpgradeElapsedTime = 12.02:47:00    CV = 53IpZV0tjEOIUGk2    ReportId = 79BFBB87-AE9D-480D-9F6F-5C82361E015DSetupDiag reports successful upgrade found.This appears to be a successful update as the last operation was: OOBEBoot and the result was: successLast Setup Phase:Phase Name: End    Phase Started: 25\/12\/2019 19:05:11    Phase Ended: 25\/12\/2019 19:05:11    Phase Time Delta: 00:00:00    Completed Successfully? TrueLast Setup Operation:Operation Name: Start suspended services    Operation Started: 25\/12\/2019 19:04:24    Operation Ended: 25\/12\/2019 19:04:31    Operation Time Delta: 0:00:00:07.0000000    Completed Successfully? TrueI didn't run any updates on 25\/12, so not sure what that is.  Disk management says all my disks are healthy.http:\/\/prnt.sc\/qjipq0the screenshot will show all three drives.  Belinda","Hi Andrew, was really hopeful it would work that way, but the computer won't install anything or it will install, but not let the programs run.  I am thinking since every diag set on it says its healthy that a clean install will be the only solution to this problem... which sux big time and its still throwing those read errors everywhere even on my antivirusBelinda","Hi Belinda,Certainly a clean install is a good option. Be sure to back up your personal data.Andrew"]},{"symptom":"Can I assign a function key as the Windows Logo Key to turn Narrator on\/off?        I still use an IBM Model M keyboard and don't want to give it up. However, it does not have a Windows Logo Key which is required to turn Narrator on and off. Is there a way to assign another key, such as F12, to turn Narrator on and off? I did download the Microsoft Mouse and Keyboard Center but it said it did not recognize any devices. I use a mouse and keyboard hooked up via PS2.  Thank you. ","solutions":["Click on it.","Hi earl1812, My name is Riccardo and I would be happy to assist. Microsoft Mouse and Keyboard Center is generally for Microsoft accessories; however, we can do this a different way.There is a third-party app called AutoHotKey… https:\/\/www.autohotkey.com\/This allows you to program any keys you want for this purpose. DISCLAIMER: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Adding a program to Windows 10 Startup is not working correctly        I'm using a program called Soprosnap.exe that I want to automatically start when the computer boots or at least when I login to Windows.  I've tried a couple of different things but it's still not working.  Here's what I've tried:1.  Added shortcut to the Startup folder at C:\\Users\\[Username]\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startuphttps:\/\/tunecomp.net\/add-program-to-startup-windows-10\/2. Used Registry Editor HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Runhttps:\/\/docs.microsoft.com\/en-us\/windows\/win32\/setupapi\/run-and-runonce-registry-keys?redirectedfrom=MSDN If I login to Windows and I double click the shortcut on the desktop, I see the program running in the taskbar.  When I tried the 2 methods listed above, nothing happened when I reboot the PC and login to Windows.  I want the program to start automatically so the user doesn't have to manually open it each time.  ","solutions":["Try using task scheduler. Click on the below link to know how:https:\/\/www.google.com\/amp\/s\/www.digitalcitizen.life\/use-task-scheduler-launch-programs-without-uac-prompts","Hi GilbertF I think you might be able to do this by following the advice from J.Raul with the task scheduler.Feel free to ask if you need further help Regards"]},{"symptom":"RPC Server is unavailable and I can't login        So whenever I try to log into my Acer computer it says the RPC server is unavailable","solutions":["Hi SWW. I'm Greg, an installation specialist and 9 year Windows MVP, here to help you.See here how to resolve RPC Server is Unavailable error: https:\/\/helpdeskgeek.com\/help-desk\/how-to-fix-r...https:\/\/www.techjunkie.com\/rpc-server-is-unavai...https:\/\/www.youtube.com\/watch?v=zAz8nibiWNsI hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"accessing video right from my cell phone to pc        I used to be able to find the videos downloaded to my phone by selecting other libraries using windows media player. Can I still do this?","solutions":["Yes, you can still do that.Actually, there are little missing from WMM on win10.","Hi EstebanGutierrez2 Well, it seems that CamileD gave you the answer. Also, it may depend on your phone settings, if it allows the sharing of files or not.Feel free to ask if you need further help Regards"]},{"symptom":"Grand Ages Rome is broken on this crappy new system! You messed it up!! Why you no fix it!?        I would consider buying new games if I knew your system finally worked right. Why have you made it so stressful? You should have to pay for peoples psych bills huh? Why you mess this up and not bother to fix it? I see many people with problems here with this game and why would I bother to buy a new game if I think its going to be junk also? This really sucks! So, this is the last windows and everyone has many games that won't play on it? Why would you do that? If I could see your system being decent, I would consider purchasing new games. If I see old ones don't work, then I think your system sucks!! This says needs DirectX 9 I have tried to install update drivers, it said it had the latest so it did nothing but waste more and more of my time. Is why you gave Windows 10 away because you know it's broken?","solutions":["[ EDIT: New post. I was thinking the title was much older than 2009.]- Where did you buy the game from ? There should be nothing in regard to Win10 that would prevent this game from running. It's not old enough. The vast majority ofgames going back to 2002, and a many more as far back as 1998 will run on Win10.- However, if you are getting an DirectX 9 error the real problem may be due to acorrupted .NET Framework.This has been a big problem with Win10.I expect that when Steam and other on line game retailers force reinstall DirectX , C++ or .NET (was a time when the game asked first)that they are often breaking .NET in some way.Try repairing .NET...https:\/\/docs.microsoft.com\/en-us\/dotnet\/framework\/install\/repair- What brand and model graphics processor and cpu does your machine use ?\"I see many people with problems here with this game\"- Of course, Forums are where people come with problems for everything PC.I see some people gave negative reviews on Steam because of a poor control setup, and bugs. If you are complainingabout this sort of thing you need to complain to the publisher - Kalypso Media.btw - If you did actually need to repair a corrupted DX9 file (Win10 installs with all DX9,10,11 &12 files) you would do better toreinstall all DX files using the DirectX Redist (June 2010).This installer has the same DX9 files as does the old 9.0c installer, with the added  advantage of includingnewer DX9, 10 &11 files that are not in the old installer.Download Details - Microsoft Download Center - DirectX Redist (June 2010)","Hi EdwardJames2 I'll try to help you. If you need DirectX9, you can download it from here : https:\/\/www.microsoft.com\/en-us\/download\/detail...Regards"]},{"symptom":"Alien Ware compatible with Windows 10?        I have the original Alien Ware version 17 (not R5 or R7). I cant find any information whether the Windows 10 will download onto my system. This is my laptop that I use when not on my main one at home. Is the Windows 10 compatible with this system to be able to download and activate?","solutions":["Hi pepsimania, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.Is it this particular laptop? https:\/\/www.dell.com\/en-us\/shop\/cty\/pdp\/spd\/ali...If so, that website says it came with Windows 10 Home, and so should be compatible. I believe this one is known as version R4.The best way to be would be to enter the Service Tag of your laptop on Dell's website, and verify there are drivers available for Windows 10, 64-bit.https:\/\/www.dell.com\/support\/home\/us\/en\/19\/prod...You can use the link right under Alienware 17 R4: \"Enter Service Tag to view details\" Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"Windows update wont work. Error 0x80240fff        I reinstalled windows 10 on my computer and am not able to install updates. When I check I see I am on build 1511.   The message I get is as follows.\"There were some problems installing updates, but we'll try again later. If you keep seeing this and want to search the web or contact support for information, this may help: (0x80240fff)\"When checking update history this is the only entry      \"Update for Windows 10 Version 1511 for x64-based Systems (KB3116278)\"","solutions":["Keep me posted. I will be here to help until this case is resolved."]},{"symptom":"uninstall unwanted apps in windows 10        how can I uninstall unwanted apps at windows 10","solutions":["how can I uninstall unwanted apps at windows 10 What specific unwanted apps in windows 10 you want to uninstall?","Hi Aliza. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Guardian Moderator here to help you.Some can be uninstalled in Settings > Apps > Apps & Features. If no Uninstall button there then there is this TechNet Uninstaller which will load all of the Windows apps, then create an uninstaller script for each:https:\/\/gallery.technet.microsoft.com\/scriptcen...There can be unintended consequences for removing some WIndows apps, so be sure to set a System Restore point first:https:\/\/www.windowscentral.com\/how-use-system-r... Also, you'll achieve more performance-wise by simply turning off apps that freeload on Startup, than you will by uninstalling the apps. See Step 4 in this checklist:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to rate my post, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","how can I uninstall unwanted apps at windows 10 What specific unwanted apps in windows 10 you want to uninstall? skype","how can I uninstall unwanted apps at windows 10"]},{"symptom":"Dolby Atmos for Home Theater        So I just had a very nice converastion with one of the MS Support guys _again_Whats the problem? Well as the Title says: Dolby Atmos for Home Theater...I am testing a fresh Install of Version 1909 for the third week now. The MSHD Audio drivers were the only way to get Dolby Access (Atmos) working in Games at all, because with the Nvidia HD Audio drivers it is just not working at all, since 2018...BUT, now I see that even with the MSHD Audio drivers dated 04.09.2019 its not stable at all. It works for a couple of times and then It needs to be force reinstalled to be working again.Let me start with this Picture from 6 Months ago, when everything was just fine:Input is the signal which comes from the PC and it is Dolby Atmos, which then gets Outputed as Dolby Atmos 7.1.4 - everythings fine....But since 1909 we have this Problem:Somehow the Driver gets broken very fast and even when Atmos is selected as desired Output it send 90% of the time only 2.0 Mutichannel Signal to the Receiver.If force reinstall the MSHD Audio driver it works for like 1-2 times until something else is launched like Youtube or Spotify or anything else really, it will not work anymore.Also since 1909 if it somehow miraculously works it is not recognised as ATMOS anymore, but Multichannel signal, which is output as Multichannel 7.1.4 - which I do not think works like real Atmos in certain ways, but as a Virtual Height created by the Receiver.My question is, since the Problem of this nature is well known all over the Internet since Dolby Access exists, why do I have the feeling that this problem is like of the bottom of the priority list for the last 2 Years ?I mean we are talking here about stuff which affects like thousands of people with very expensive PC Hardware and even more expensive Audio equipment.Please start working together with Nvidia, Onkyo, DENON, Marantz, Yamaha and so on to get this finally working as it should.I mean nobody will use this, if it is broken and unrealiable. I am sorry to tell you, but I have to tell every customer which is buying a Home Theater system for Gaming, that Atmos is still not working without problems. (XBOXs are affected too)Have a nice day and maybe put this on the top of the list of \"windows isssues which urgently need to be solved\"","solutions":["I have the same issue. Atmos will only show on my receiver if I play a 4k UHD movie in the disc drive\/blu blu app.Nothing else works and shows as multichannel PCM on my amp. Its an Onkyo TX-NR696.I have tried playing my 4K UHD movies through the Vudu app, Netflix Atmos movies, amd games like Gears of War 4 to test. All of it shows up as PCM on my Onkyo. I really want this to work for Vudu because I buy most of my movies in UHD through it. Xbox goes HDMI goes into the Game input on receiver. Settings in my Xbox are bitstream>dolby atmos through HDMI. Im also am Xbox insider. "]},{"symptom":"Delays        Computer pausing for up to 10sec between programs","solutions":["See if this assists you to improve performance.Scan for Malware with the FREE version of this Program.And do not accept the \"Pay for version\" Trial option during installationDownload, install, update and scan your System with the free version of Malwarebytes AntiMalware::http:\/\/www.malwarebytes.org\/products\/malwarebytes_free@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@You can clean up your Hard Drive using these two methods.\"Delete files using Disk Cleanup\"http:\/\/windows.microsoft.com\/en-us\/windows\/delete-files-using-disk-cleanup#delete-files-using-disk-cleanup=windows-8Using the Free CCleaner Program:http:\/\/www.piriform.com\/ccleanerUnder NO condition use the Registry cleaning Option in CCleaner@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Make sure that you have the latest updated Drivers:Go to your Computer or Hardware Manufacture's website > Driver and Software Support Section > look up your Computer or Hardware Model number > then your Operating System > locate the correct Drivers > download and install them.@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Speed up your computer:https:\/\/support.microsoft.com\/en-au\/help\/3064207\/speed-up-your-computer@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\"How to Optimize the Performance of Windows 8 and 8.1\"http:\/\/www.eightforums.com\/tutorials\/37511-optimize-performance-windows-8-a.html@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@This is worthwhile reading too:\"How to Optimize Windows 8.1 for a desktop PC\"http:\/\/www.howtogeek.com\/167013\/how-to-optimize-windows-8.1-for-a-desktop-pc\/@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@\"Performance & maintenance\"http:\/\/windows.microsoft.com\/en-us\/windows\/performance-maintenance-help#performance-maintenance-help=windows-8&v1h=win8tab1&v2h=win7tab1&v3h=winvistatab1@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@And I would check to see if there are corrupted System Files.Each Method\/step below progresses to the next if the first does not fix any corrupted files that are found, etc.\"Use the System File Checker tool to repair missing or corrupted system files\"https:\/\/support.microsoft.com\/en-us\/kb\/929833_________________________________________________And these eightforums.com Tutorials are very detailed for problems resulting from SFC Scan:\"How to Run \"SFC \/SCANNOW\" Command at Boot or in Windows 8 and 8.1\"http:\/\/www.eightforums.com\/tutorials\/3047-sfc-scannow-command-run-windows-8-a.htmlRead this Section there in conjunction with the rest of the information they give in above link.   NoteIf SFC could not fix something, then run the command again to see if it may be able to the next time. Sometimes it may take running thesfc \/scannow command 3 times restarting the PC after each time to completely fix everything that it's able to.If not, then run the Dism \/Online \/Cleanup-Image \/RestoreHealth command to repair any component store corruption, restart the PC afterwards, and try thesfc \/scannow command again.If still not, then try using OPTION ONE above to run the sfc \/scannow command at bootIf still not, then you could do a refresh of Windows 8, or run aSystem Restore using a restore point dated before the bad file occured to fix it. You may need to repeat doing a System Restore until you find a older restore point that may work.If still not, then you can use the steps in the TIP box in the OPTION THREE section to manually replace the files that SFC could not fix.__________________________________________________\"How to Refresh Windows 8 and Windows 8.1\"http:\/\/www.eightforums.com\/tutorials\/2293-refresh-windows-8-a.htmlRefreshing your PC goes like this:The PC boots into Windows RE (RecoveryEnvironment).Windows RE scans the hard drive for your data, settings, and apps, and puts them aside (on the same drive).Windows RE installs a fresh copy of Windows.Windows RE restores the data, settings, and apps it has set aside into the newly installed copy of Windows.The PC restarts into the newly installed copy of Windows._________________________________________________\"How to Reset Windows 8 and Windows 8.1\"http:\/\/www.eightforums.com\/tutorials\/2302-reset-windows-8-a.html\"When you reset your PC, the drive will be completely reset, and all your apps and files will be removed from it. Windows 8 will be reinstalled, and you'll need to change any settings and reinstall any apps that you want to get back after resetting. If you know if any files that you don't want to lose, then you should back those files up before starting the reset\"Cheers."]},{"symptom":"suggestions for a keyboard like the IBM Model M keyboard but with a Windows Logo Key        I I am looking for a newer keyboard that come with the Windows Logo Key so I can use Narrator.I would like to continue using the the IBM Model M keyboard but it does not have a Logo Key so I want a newer keyboard with the same characteristics: large, heavy, hard to press keys, very loud clicking keys, a separate numeric keypad, 4 arrow key between the numeric and alpha keys. Thank you. ","solutions":["Hi Earl. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I don't know if it's too old but you might be able to remap one of the keys on your IBM to be the Windows key using a tool like Sharp Keys here:https:\/\/www.pcmag.com\/feature\/362116\/how-to-rem...https:\/\/www.howtogeek.com\/howto\/windows-vista\/m...In the first tutorial the author gives the specific example of remapping the Windows key to another.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"shortcuts keep saying moved        I keep getting shortcuts being moved so I cannot open word documents if they haven't disappeared","solutions":["Hi 7hippy9, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Check the indications that I share through this official community link, they will help you solve the problem, within the same article at the bottom you have a second link, in case the first steps do not solve the problem.https:\/\/support.office.com\/en-us\/article\/can-t-... de6764a635d6Let me know if you have something else that I can help you with, I'd be happy to help.Happy nice day Regards, Marc M.","https:\/\/support.office.com\/en-us\/article\/can-t-...","Hi. Thanks for the help but the link wont open","Hi, Open the second link, that if it was loaded correctly. Regards"]}]}