{"windows":[{"symptom":"Family Management - Password        My child has discovered the password for our parental controls.  How do I change the password?  I know the current password.","solutions":["HI Mabozar. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.That would be the parent's Microsoft Account, where you can change the password here:https:\/\/support.microsoft.com\/en-us\/help\/402683... I suggest a complicated password that is still memorable, like a childhood address + phone number that is long gone but only you remember. But make the hint cryptic.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Greg,Thanks for replying so promptly.  Can I check that this wont change my individual password?The password was complicated, unfortunately my wife let her guard down when typing the password in.","It will change the password on the Family Safety parent's account where you control the Family Safety features only .","Greg,The link takes me to a page which requests me to sign in.  I then go to a random page which isn’t helping me.  My impression is that this expects me to change my personal login.  I hoped not to change my personal password in order to fix this.  My wife’s password has been changed but i cant yet confirm if that will resolve the matter.  Her personal password was at least partially known by our son.","IS family safety controlled. By both you and your wife? If so then I wait to see if he is still able to breach the password now that she has changed her password."]},{"symptom":"Discussion: What new feature in Sticky Notes would you like the most? (January 6th, 2020)        I would like at least two more note colors like red and orange. I encourage you to leave a suggestion in the Feedback Hub as to what you'd like the most!","solutions":[]},{"symptom":"Account has already been added to this PC        Hi everybody,I'm presently installing accounts on the new PC for the family.I created an account for my daughter but it was bugging when I tried to add (connect with) her windows (hotmail) account.So I decided to completely deleted her account to create it again.Then start the problems, when I want to add a new account wirth her hotmail address:Here is the message I get ==> \"Unfortunately there was a problem. *** Email address is removed for privacy *** has already been added to this PC.\"How should I proceed to:- Properly recreate an account with her hotmail addressor- Properly erease all related information from the PC so that I can afterwards create her account again.Thanks a lot for your support and feedback.Best regards.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please perform the following steps to Delete an account. Open Settings. Click on Accounts. Click on Family & other people. Under the “Other users” section, select the account you want to delete. Click the Remove button. ... Click the Delete account and data button. You will see a check box that roughly says \"Delete Account data\", click on this check box and proceed.","Microsoft\/Windows OS use SKYPE for pc to pc communication(s)..The software is free from Microsoft\/download center,it's a great utility.Follow link for download.https:\/\/www.skype.com\/en\/get-skype\/download-skype-for-desktop\/Also,in control panel open user accounts,set up new,edit the properties,maybe set as Administrator to get going,make sure its set for user internet values..Also,in control-panel\/open Internet Options,select Home page,edit rest to defaults.Hotmail is no longer Microsoft default,its now Outlook.comGo to http:\/\/www.msn.com  look at top L.corner for outlook,create a account,Microsoft\/Hotmail accounts switched to outlook years ago w\/o any problems..","Hi,Thanks a lot for your feedback.Unfortunatly, the account is alreday dekleted. And there were only 2 possibilities. I chose the full delete with all the data ereased.I was expecting it to work fine in this way...So my suprise when I discoivered that the PC still has the account of my daugther in memory...The only solution I have up to now is to do a reset of windows:- Click the Power Button on your Start Menu, then press the Shift Key and click Restart- Your PC will boot into the Windows Recovery Environment- Go to Troubleshoot - Advanced Options - Reset this PC- Choose to keep nothing- Then start the ResetIf somebody has another solution, it's more than welcome... I'm always afraid by restes...Thanks again for your support,Best regards","Okay, please the following: Open Start, type CMD Right click CMD Click Run as administrator Type the following command then hit Enter net user (username) \/delete For example, net user Arif \/delete (Arif is my username, so you have to enter your daughter's username) If this does not work, I am afraid you have to start over, I mean System Reset."]},{"symptom":"wifi connection        In properties for my wifi connection I have it \"on\" to connect automatically.     This setting goes to \"off\" by itself and I keep resetting it to \"on\".   Because of this I keep losing my connection until I connect it again.","solutions":["Hi BenMartorana,try following here: https:\/\/www.tenforums.com\/tutorials\/65916-turn-off-connect-automatically-wireless-network-windows-10-a.html#option3","Hi, BenMartorana My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps to repair your Internet connections: Enter the Start menu or by pressing the Win + I key combination, open the Settings and click on the Network and Internet option. Once there, we select the Status option from the menu on the left side and, within the configurations and options that are loaded in the right panel, we have to look for the restoration of the network. When you click on this option, it will show us a new window from where we can restore the network in Windows 10. In this way, all network adapters will be removed and reinstalled, and the original configuration of other network components will be restored. net. This implies that if we were using some software, such as a VPN client or virtual switches, we will have to reinstall them.A process that the system performs automatically by clicking on the Reset button that is now displayed in Network Reset in Windows 10 settings. It is normal for the process to not take long, although we must wait until the end completely and restart the computer to continue with the network configuration in Windows 10 as we have done so far.https:\/\/www.kapilarya.com\/how-to-reset-network-...https:\/\/support.microsoft.com\/en-us\/help\/10741\/...You can also check that your drivers are updated. https:\/\/support.microsoft.com\/en-us\/help\/402844...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Unable to use recovery usb after error 0x000000e following attempt to repair windows 10 boot        I've got an old machine that's seen lots of incremental changes, including an upgrade from Windows 7 to Windows 10 that resulted in Windows 10 getting installed over disks 0 and 1 (C: and D: drive respectively). Drive C is a Samsung SSD and was partitioned as Healthy (Boot, Crash Dump, Page File, Primary Partition). Drive D is an older WD HDD, and was partitioned as Healthy (System, Active, Primary), I assume because it was the original drive that Windows 7 was installed on.Unfortunately, I think I followed some bad advice and removed the HDD (D drive) and rebooted my machine with a Windows Recovery USB in an attempt to repair the boot and get everything on my SSD (C drive) so I could scrap the HDD. At first this appeared to work, and I was able to use my recovery USB to initiate the startup repairs, but it failed at 51% complete and notified me that no changes were made. I reconnected the old HDD (drive D) and attempted to boot, but now I am getting an error of 0x000000e indicating that I cannot boot anymore. I attempted to get into my BIOS\/Boot menu as indicated by ASRock (ASRock Z97) but now even that is only resulting in a black screen whenever I use F2 or F11 as indicated. I'm unsure if I can recover my Windows installation at all at this point, and I would settle for simply being able to start from scratch. Anyway, long question and I'm at the edge of my knowledge right now. Anyone have a possible solution?","solutions":["Hi BEM. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Try resetting the CMOS in order to get back into BIOS setup: https:\/\/www.maketecheasier.com\/how-to-reset-cmo...Sometimes it's the hard drive that prevents booting into BIOS, so try removing them one at a time to see which is causing it.Once you can get into BIOS make sure the D is set first to boot since it sounds like from what you say it got set as the System boot drive and it stopped booting when it was removed. If so you need to move the Boot Manager back to System Reserved on C or C partition. Use the method I give here: http:\/\/www.sevenforums.com\/tutorials\/209885-boo... Let me know what you find. ______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Greg, thanks for your reply. I was able to get the BIOS working normally again by following your suggested link and using the reset switch on my motherboard. I switched the boot order for the drives so that D was set to first in the order, and I also relocated my USB recovery drive to a different port and it now appears in the BIOS options. Unfortunately, I am still getting the following error upon saving and exiting the BIOS:- Your PC\/Device needs to be repaired-- The application or operating system couldn't be loaded because a required file is missing or contains errors.-- File \\WINDOWS\\system32\\winload.exe- Error code: 0x000000e-- You'll need to use recovery tools...It prompts Enter to try again or F8 for Startup Settings, both of which do nothing on attempt. It appears the CMOS will need to be reset again after shutting down and reattempting. Is there any way I might be able to get windows back up so I can attempt to move the boot manager to C? ","Try setting C hard drive first to boot in BIOS. Since D has the System Active flags which means it's Legacy BIOS and set as the System boot partition, it should start Windows on C if it's connected. So something else must be wrong.You can remove D drive and try to repair C as you originally did, but this time mark C (or it's System Reserved partition if present) Active as it must be or it will never start, then run Startup Repair three times to see if it will write the System boot files to C and start. To access Advanced Startup Options for Startup Repair and other tools:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... To mark Active: http:\/\/www.sevenforums.com\/tutorials\/71432-part... If not you can RebuildBCD from Command Prompt at boot following the steps for it here:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...It may be necessary to create bootable media to access Advanced Startup Options or do the Clean install:To create Windows 10 Installation Media on another PC install Media Creation Tool and follow the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, on second screen choose Repair Your Computer, then Advanced Troubleshoot Options, then System Restore. If that fails go back to Troubleshoot Options to try a Reset.If that fails choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, click Next to let it create needed partitions and start install - this makes it foolproof. Everything needed to get the best possible Clean Install is here: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... It is a better install than any amount of money can buy and a great learning experience that will make you the master of your PC because you will learn what works best and how to apply it with your own hands. I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I tried setting C hard drive first to boot in BIOS, but no success.I then removed D drive and tried to repair C, but marking C Active was an issue because C is not fixed MBR. I did some further looking for solutions to that issue, and attempted to rebuild the BCD via the link the you provided (further issues with UEFI setup there) but no solutions thus far. I have my important files already backed up, and I have a product key for my OS, so I'm going to follow up with your other suggested options soon and see if that gets me back up and running. I will update when I do. In the meantime, I just wanted to say thanks for the comprehensive responses.","If C is not on an MBR format hard drive then it cannot be made to boot Windows, as only UEFI can boot Windows on a GPT formatted hard drive.If you plan to reinstall Windows in Legacy Mode to that drive then with it plugged in alone, during a Custom Install delete all partitions down to Unallocated Space to reset the formatting, click Next to let it format MBR the necessary partitions and begin install - this makes it foolproof. But if you have UEFI then you should boot the media as a UEFI device before deleting all partitions so it installs to the modern UEFI format which is much more secure.follow the gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...","Just goes to show how stretched my knowledge is at this point. I do have UEFI, and C is GPT formatted. I would rather install in the modern format, and I will attempt to follow the instructions you linked. Will update again on success or fail. Thanks"]},{"symptom":"How do you Disable Explorer's \"Today\", \"Yesterday\", and \"Last Week\" Groups        I like my Downloads displayed as a straight alphabetical list, and not broken down by today, yesterday, and last week.  When I go to Downloads this can be done by clicking \"view\" then \"group by\" and then \"none.\"  Windows, however, does not save that setting and the next time you go to Downloads you are forced to go through those steps again.  How can this be avoided?  Until recently this was not a problem.","solutions":["Hi, My name is WIll, I'm an independent adviser. You can change this from the downloads folder by going to the View tab > under current view choose \"Group by\". Here you can change the filter, \"None\" will give you the traditional alphabetical list where as Name will group them by the first letter.I hope that helps.","I understand that, Will, but my question is how can I make that change permanent.  I want to avoid going through those steps every time I open that file.","That's a persistent setting. It only needs setting once normally, are you having to set it each time?","Thanks Spectre-4.I checked it today and, indeed, it is persistent.  When I last tried to set it several days ago it was not.  Prior to that time it was not persistent at all, so what can I say?  I've seen others complain about the problem.  Perhaps there was an update that corrected it.  Anyway, the problem went away...","Will:  Please see my response to Spectr-4 below.  Thanks for your help."]},{"symptom":"Trying to update Windows 10.  Computer has been offline for the past few months.  Keep getting error when trying to update.        I retried the above through the normal process many times, always errors out.I downloaded the Media Creation Tool as mentioned in another forum, but after a couple of hours of seeming to be successful.  On the final restart, it said there was an error and it was reverting back to before.https:\/\/go.microsoft.com\/fwlink\/?LinkId=691209What can I do to get my computer updated?","solutions":["Are you running any third party antivirus? If so try disabling it & running install again.If it still fails the try resetting the update components: Have you tried resetting the update components? Open cmd prompt\/powershell with admin & enter: net stop wuauserv net stop cryptSvc net stop bits ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits Restart the PC & try updating again. If this fails\/doesn’t correct the problem then click start, run, type regedit & click enter & find: HKEY_LOCAL_MACHINE\\SOFTWARE\\Policies\\Microsoft\\Windows\\WindowsUpdateTry deleting the entries WUServer and WIStatusServer in the right pane if they’re there, if not don’t worry.","Do you still require help?"]},{"symptom":"Mouse not working after reinstalling Windows 10        My laptop was running slow so I reinstalled Windows 10 and it made a huge difference in speed.  Problem now is my Kensington Optical Mouse #72257 is no longer working after I plug it in the USB port.  I tried looking for a driver for the mouse online but all I found was potential adware and scammers.  Can you let me know how to get my mouse operational again?  I thought after I plugged in the device Windows would recognize it and look for drivers but that option did not work.  Thanks in advance Dan J.","solutions":["Have you checked the official Kensington website for drivers? https:\/\/www.kensington.com\/en-gb\/p\/products\/con...If this doesn’t help then how old is the mouse? It may be that it’s not compatible with Windows 10.Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Please do not download any repair tool which is offered by this site other than the ones I mention\/recommend..Thoroughly research any product which is mentioned here before you decide to download and install it.","Thanks Time Lady,I did check Kensington's website for the driver but the mouse was not listed.  It is an older mouse and worked fine yesterday on Win 10 before I reinstalled the OS.  I guess I can reach out to Kensington support during their work hours to request the driver.  I was just hoping I could find it someone online today.  ","Unfortunately it can happen that way - a device can work fine until an update or clean install then a user finds it’s not compatible any longer.If there’s no drivers available (& those sites often list older drivers as the latest version) then I’d say it’s no longer compatible.I take it that Windows update didn’t install any drivers for the device either? I’ll keep checking for drivers.","SOLVED....I went to another computer and copies all the drivers from the Windows\/System32\/DriverStore folder onto a thumbdrive.  I then placed the thumbdrive in the newly updated laptop and updated the drivers under Device Manager.  Then just browsed to the thumbdrive and all went perfectly.  ","Do you require further help?"]},{"symptom":"windows 10 update        so I'm currently trying to download iTunes and a few other apps but, it says I need windows 10 to download anything really. my issues are that none of the updates are letting me go through with them or they say they fail when I restart the laptop. can someone please help me??","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? Have you tried resetting the update components? Open cmd prompt\/powershell with admin & enter: net stop wuauserv net stop cryptSvc net stop bits ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits Restart the PC & try updating again. If this fails\/doesn’t correct the problem then click start, run, type regedit & click enter & find: HKEY_LOCAL_MACHINE\\SOFTWARE\\Policies\\Microsoft\\Windows\\WindowsUpdateTry deleting the entries WUServer and WIStatusServer in the right pane if they’re there, if not don’t worry.Then try updating again. If not then I recommend an in-place upgrade repair. To repair Windows without losing any data then follow the instruction here: https:\/\/www.tenforums.com\/tutorials\/16397-repai...This will also upgrade you to the latest version of Windows - currently 1909. In a nutshell you just insert the Windows 10 media (USB\/DVD) & run setup from within Windows.Please note a repair install is not a reset, this is a last attempt at repairing a PC without a clean install. If this fails to repair the problem then usually a clean install is required.Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Do you still require help?"]},{"symptom":"canon PRINT inkjet\/selphy        Why can't i install the canon app on my ACER tablet. Google play says I need to add this device and Microsoft says its already on the google account.","solutions":["Is the Acer tablet running Android or Windows? If android then you’d require an app which isn’t supplied by Microsoft: https:\/\/play.google.com\/store\/apps\/details?id=j...Is the printer wifi enabled? If so then you can print that way from your tablet. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Please do not download any repair tool which is offered by this site other than the ones I mention\/recommend..Thoroughly research any product which is mentioned here before you decide to download and install it.","Do you still require help?"]},{"symptom":"C:\\Users\\User\\AppData\\Roaming\\windows.js error        I get a constant error pop-up saying that the windows script host can't find script file \"C:\\Users\\User\\AppData\\Roaming\\windows.js.\" Has anyone ran into this? Is there a fix?","solutions":["Try running these programs: MBAM free: https:\/\/www.malwarebytes.com\/mwb-download\/Eset online scanner: http:\/\/www.eset.com\/us\/online-scanner\/ Adwcleaner: https:\/\/www.malwarebytes.com\/adwcleaner\/If these find one or more infections but do not fully remove them it will be wise to register with a malware removal site to receive dedicated malware removal instructions, an expert will remain with you throughout the process until confirmation that your PC is 100% clean. Malwarebytes virus\/malware removal forum: https:\/\/forums.malwarebytes.com\/forum\/7-windows...Bleeping computer malware\/virus removal forum: https:\/\/www.bleepingcomputer.com\/forums\/forum22...Disclaimer - This post contains reference to non-Microsoft websites and there may be ads on the page for products & services including products frequently classified as a PUP (Potentially Unwanted Product). Please thoroughly research any product \/ service advertised on the page before you decide to use them. Your discretion is very much advised.","Do you require further help?"]},{"symptom":"Release date of 1909 Media Feature Pack?        Any estimates\/ideas on when the Windows 10 ver. 1909 Media Feature Pack will be out? I need it for Windows 10 Home.","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,As the standalone media feature pack is currently not available and there is no estimated time when it will be available, microsoft has already provided a way for you to enable it as a windows feature.____________The Media Feature Pack for N versions of Windows 10 is available for download as an Optional Feature. To install the Media Feature Pack, navigate to Settings > Apps > Apps and Features > Optional Features > Add a Feature, and then locate the Media Feature Pack in the list of available Optional Features.Source: https:\/\/support.microsoft.com\/en-ph\/help\/451639...Let me know how it goes. :)"]},{"symptom":"minecraft bederock edition        i cant refund minecraft Windows 10 bedrock Edition.","solutions":["Hi, My name is Will i'm an independent adviser. When did you buy it? The refund\/return policy for digital purchases is within 14 days of purchase with less than 2 hours play time. You can request a refund if your purchase is eligible from xbox.com\/refund or from account.microsoft.com > login > Payments and Billing > view order history > refund information. I hope that helps."]},{"symptom":"Activation issue        Hello, few days back i restored my laptop due to some issues i'm facing with it. But after that there is one watermark of \"Activate Windows\" start appearing in the bottom right corner.I searched it & found that may be i have to sign in again from my micosoft account. Also i got this notification ~ I clicked on it& got this, from Fix Now this box appears~But the content is not visible in this box. Although internet connection is good.So i can't further reach it & can't sign in.Due to this it still says to activate windows.Why it is happening & what should i do?","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? I recommend an in-place upgrade repair. To repair Windows without losing any data then follow the instruction here: https:\/\/www.tenforums.com\/tutorials\/16397-repai...This will also upgrade you to the latest version of Windows - currently 1909. In a nutshell you just insert the Windows 10 media (USB\/DVD) & run setup from within Windows.Please note a repair install is not a reset, this is a last attempt at repairing a PC without a clean install. If this fails to repair the problem then usually a clean install is required.For the activation problem: Run this cmd within powershell with admin powershell “(Get-WmiObject -query ‘select * from SoftwareLicensingService’).OA3xOriginalProductKey”Or wmic path softwarelicensingservice get OA3xOriginalProductKey if using cmd prompt.Or: Check this program to reveal if there’s a key embedded in the BIOS: https:\/\/neosmart.net\/OemKey\/Or: Download and run this: https:\/\/www.microsoft.com\/en-us\/p\/showkeyplus\/9... to find all keys used on the PC.Also run this to see what is currently installed & post a screenshot: Right click on start & choose powershell with admin & enter: slmgr.vbs \/dlv This will show a popup showing whether your license is OEM, Retail, or Volume amongst other information.If this states you have a volume licence then there is away to return to a legal key if there's one in the BIOS.If it does please post back. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"HELP!! Problem with Wireless adapter or access point detected        OKSo...Laptop computer is connected to wifi.Under the connection it says no internet, secured. So there's no internet.Went to control panel>troubleshooting>network and internet>network adapterComes back with one issue: 'Problem with Wireless adapter or access point detected'Note: there is no issue with the wifi itself connecting to any other devices. We have a smart tv, several phones, and another pc connected and properly using the same wifi.So far in an attempt to fix the issue I have1. Clean boot the pc.2. Attempted to update network adapter driver3. Uninstalled then reinstalled adapter4. Managed wifi network properties 5. Run some ipconfig and netsh commands in command prompt6. Restarted the routerThe laptop does not have an ethernet port so I can't give it a wired connection to check on other updates or driver updates. PC has a USB 2.0 and 3.0 connection port but I don't have an adapter for that.Help. Lol.PC specs:Lenovo Yoga 2 11Processor: Intel(R) Core (TM) i3-4012Y CPU @ 1.50 GHzRAM: 4.00 GB (3.89 GB usable)64-bit operating systemNetwork adapter is a Qualcomm Atheros AR956x Wireless Network Adapter","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please download and install the following driver and restart the PC and then check the network status.https:\/\/download.lenovo.com\/consumer\/mobiles\/2s...","How do you recommend I move the driver onto the lenovo.Download the driver to a USB flash drive, then install from there?","Yes, download the driver at another device, transfer it to a flash drive. Insert the flash drive to the affected PC and run the installer."]},{"symptom":"Win7 Script Host Error Constantly Popping Up        Lab printer running Win7 keeps getting this Script Host error popping up:1.  I started with the associated code and disabled WinUpdate Services; unsuccessful2.  Disabled RestorePoint scheduled task; unsuccessful3.  Removed \"RestorePoint.vbs\" folder before we pushed out WindowsUpdate and updates replaced the file; unsuccessfulI'm not sure what else to do to find a solution (I do not write code)?Thank you!","solutions":["Rmemeber that this VB Script does not come with Windows so somebody put it on the afflicted system for some purpose...  to make a Restore Point.Was it put on to create the RP from a shortcut, maybe put in the Startup folder to create a RP every time the system boots, maybe a Scheduled Task, or something else?You might have to track down that person and ask them Wazzzup."]},{"symptom":"Video TDR failure atikmpag.sys on Dell XPS with Windows 10        Hi,When I turn on my PC I have the blue screen with \"Video TDR failure atikmpag.sys\" on it.  I have a Dell XPS that I udpated to Windows 10 a long time ago.I think it happened after updating some drivers including for the video card (ATI Radeon).-> Even after turning on and off the PC 3 times I cannot start in safe mode.  Actually the first 2 times I get to the blue screen, the 3rd time I get a black screen-> If hit the F12 or F2 key I cannot get to the boot menu to get the PC to start on the USB portPlease help !Thanks","solutions":["Hi JM, Starting your PC using USB rescue media is not difficult, although it first requires an adjustment in the BIOS (Basic Input Output System).That’s because the BIOS settings include the boot sequence the machine follows when starting up.The boot order tells the machine which devices to search for the software needed to launch the computer and the priority each device in that search.If you’re booting from USB media, you must change the BIOS boot order so the USB device is listed first. Otherwise the computer will load from the hard drive as normal.Start by plugging the thumb drive into a USB port. Then to change the BIOS boot sequence: Press the Power button for your computer. During the initial startup screen, press ESC, F1, F2, F8 or F10. (Depending on the company that created your version of BIOS, a menu may appear.) When you choose to enter BIOS Setup, the setup utility page will appear. Using the arrow keys on your keyboard, select the BOOT tab. All of the available system devices will be displayed in order of their boot priority.You can reorder the devices here. Move USB to be first in the boot sequence. NOTE: If you cannot find USB or Removable Devices among the device options, your BIOS may list it under Hard Drive Devices. In that case, you’ll need to: Move Hard Drive Devices to the top Expand to show all hard drive device options Move USB device to the top of that hard drive list Save the change and then exit the BIOS Setup. The computer will restart using the new settings, booting from your USB drive. Stay alert! Depending on your BIOS, you may be prompted with a message to Press any key to boot from external device and you will only have a few seconds to respond.If you do nothing, your computer will go to the next device in the boot sequence list, which will likely be your hard drive.In the future, your computer will first check the USB port for boot media when starting up.That won’t be a problem, since the BIOS will move to the next device in the boot sequence ... unless you keep the boot media in the USB port.Then the system will launch from that device every time. Source: https:\/\/www.acronis.com\/en-eu\/articles\/usb-boot\/ Please let us know if you need further assistance. Thanks and regards,","Hi,On Dell it's usually F2 or F12 but none of them work.  I don't even go to the blue screen but the screen stays black.Regards,","Hi JM, Try to spam those keys again. If you can actually use an external keyboard (plug and play) that would help. Let me know if it will work. Thanks and regards,","Hi Richard,Since it's a desktop, I have an independant keyboard (external).I am not sure I understand what you mean by \"spam those keys\".  Please enlighten me.Thanks,","Hi JM, Just after you click the reset button. Before your computer boots up and power up, press it repeatedly already. Like thrice per second, just keep hitting until you reach the Boot Menu. That should work, unless you have issues on your keyboard. Thanks and regards,","Hi Richard,I tried it several times (F12 or F2) hitting the key several times per seconds right after I push the power button including with a different keyboard.  Nothing does it.The screen stays black.If I do nothing, the screen goes to the blue screen.  If I start the computer several times in a row, 2 times it goes to the blue screen, the third time it stays black, as if when it goes to Safe Mode of Boot the screen stays black.I really don't know how to go around thatThanks,","Hi RichardSince it's not possible to access the PC, is it possible to take the SSD from the PC, plug it to another PC to work on it from there to try and put the driver that is faulty ?Thanks"]},{"symptom":"Microsoft outlook default \"Save as\" type        How do I change the Microsoft outlook default \"Save as\" type to .msg not Unicode (.msg)?","solutions":["Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.This hopefully answers your question: https:\/\/www.msoutlook.info\/question\/109"]},{"symptom":"MIC needing to be now ON        I had sent this before but I noted it is no longer posted. The person helping me said they would find out why suddenly the MIC has to be ON for a number of audio programs I use ,since I went from windows 10 version 1903 to version 1909.The software's all using audio does not even need a MIC to work ,so why is Windows saying the MIC has to now be on for my audio software to now work.  All the software involved has work flawlessly with the MIC OFF for the last 4 years.Now it has to be on , otherwise the software will not work, it doesn't load properly before it throws a flag ,why ? This effects my privacy too.Looking forward to a response,Thank you.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. If the Mic permission is required by 3rd party application, please let me know the names of those apps.If there is any added functionality for these apps which requires Mic access it may need the permission. Hence please turn off the internet and allow the Mic access and check if there is any functionality which requires Mic access.Please allow mic permission only if you trust the manufacturer of these apps."]},{"symptom":"DAX API        Hello,As of very recently I have discovered that in my task manager there is a process called \"DAX API\" and if you expand it, it says \"Dolby Dax API Service\". This process takes up about 90% of memory, ~13000 Mb. Is this some sort of virus or a problem that can be solved? I have once tried to end the task and nothing of note happened to my computer, sound worked fine and the memory was back to normal. I've seen online that it could be a virus and that you can use a program to scan if it is a legitimate program or a virus, but I am hesitant to download any unknown files. Screenshot of the process below.Thank you,Titas.","solutions":["Hi Titas Most processes, if you google them, you will find reports that they are a virus or malware, this is rarely true, they are just trying to sell you their software to remove the 'virus'Dax API is part of your Dolby Atmos installation, the best thing to do is totally uninstall that from your PC to see if your system settles down . . .Then if you do want to run that software, download and install the latest version available . . ."]}]}