{"windows":[{"symptom":"Windows 10 Taskbar appear in fullscreen video        Hey there,I recently just upgraded to windows 10 and loving Microsoft Edge but I have 1 problem.Every time I watch videos on youtube or any other similar sites the taskbar appear when I go to the bottom of the screen.It's a little bit annoying as every time I try to adjust volume or go between fullscreen to normal the taskbar appear and block those buttons.any solutions?","solutions":["Hit Ctrl+Shift+Esc to open the task manager. On the \"Processes\" tab, scroll down to \"Windows Explorer\" and highlight it. Click the \"Restart\" button in the bottom right corner of the task manager. That should do the trick."]},{"symptom":"Turning off \"Let adults in your family see your devices\" has no effect        I have tried turning off \"Let adults in your family see your devices\" but it has no effect, other adults in the family still see the devices on their account screen and are still in the \"People who can see my devices\" list. How do I get this to work? Also is there any way to restrict which adults can administer the family?Moived from: Outlook.com \/ Security, privacy, and accounts\/ Other","solutions":[]},{"symptom":"lost all administrator rights        Hello,I have a new computer and somehow I have lost all administrator rights. The yes button is grayed out and it says to enter administrator information, but I can not. I've tried the following:1. Adding a new user as an administrator, but it won't allow me to because I don't have admin rights.2. Starting is safe mode- it won't allow me without a recovery key because of bit locker. I don't know how to get my recovery key. It is not in my Microsoft account.3. Recovering the computer, I can't because I don't have admin rights.Thank you for all your help,","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please try restoring the PC to an earlier point of time. Select a Restore Point when the User Account was Admin."]},{"symptom":"Win 7 ISO Download        Have 4 boxes running Win  7 Pro 64 SP1 , all have retail product keys.Regedit show  7601 Build #What Build # does the ISO download have & does it include ALL updates post  SP1?want to build USB sticks for emergency recovery post jan 14 ","solutions":["I look after 120 Win7 systems.  Take a look at the referred link.  It is far more than just what the headline says.  It is the process I use to secure my clients' win7 machines.There is no download that incorporates all updates.  You may not even want all updates.  My post tells you how to avoid the worst of them.  I strongly recommend you do this ASAP.https:\/\/www.askwoody.com\/2019\/canadian-tech-how-to-rebuild-a-win7-system-with-minimal-snooping\/The way I secure them is to do a complete re-install.  Then make a system image of the system after all updates and drivers are installed, before any data or dynamic apps.  I do it on DVD+R's and it usually takes from 2 to 6.  I have been using system images for years and they work just great for this purpose.","no network acess"]},{"symptom":"No network despite connected to wifi        Recently, I updated my computer on windows and after the update, I lost all access to Internet despite being connected to wifi. I checked my task manager, everything is normal except for the network section which is at 0%. Please help!","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please reset the Network Adapter driver from device manager and check the status.Go to Device Manager Locate and expand Network Adapter Right click on the Wireless Driver and select Uninstall (Do Not select any check box)Restart the PC."]},{"symptom":"Photos app not working        About 3 weeks ago I got message that Windows 10 would not update and I needed to reinstall which would not affect my files but would lose my apps. I did and it did. Have been working hours to get back to normal. One of apps I lost was a photo app., Window Suite 9 I believe. Said it would not reload as was outdated. So used windows photo’s app. to edit some photos someone sent me. Yesterday I tried to download some pictures from my camera. You guessed it. Problems. After an hour or so got it to say it had downloaded the pictures but it then said that it had searched everywhere but could not find them. I then opened the app and at the top under view it showed a few but not all of them. I have searched for them manually in pictures and cannot find either.What to do now??","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please try to download Photos app from the following link: https:\/\/www.microsoft.com\/en-us\/p\/microsoft-pho...","Downloaded and restarted computer. Still doing same thing. Any other suggestions or do I  just have toput up with problems the a suggested reinstall caused? Just  tried a power shell uninstall and reinstall and no change???? ","The next step was the PowerShell Uninstall-Reinstall which you have already performed.Hence, I have to either suggest you to perform a clean installation of the OS or wait for the next feature update.","Just uninstalled it and installed another free app. that works.","Alright. I assure you that the next feature update will replace the corrupted Photos app."]},{"symptom":"we couldn't sign you in to xbox live a specified logon session does not exist. it may arleady have been terminated        Hello, i wanted to get back to the game sea of thieves on windows 10 pc and when i try to connect to the xbox (beta) app using my microsoft account (its a gmail email) i get this error : \"we couldn't sign you in to xbox live. A specified logon session does not exist. it may arleady have been terminated\"I don't know why i get this error because when i try to connect with an other account (this time the email is a hotmail account) it let me in and i can play but its an other account so i dont have my progress back in sea of thieves. I tried many things in order to solve this problem but nothing worked. When i click on recover your account, it says that my gmail account is \"linked\" to the hotmail account and i can only click and \"connect\"I don't know what to do anymore, nothing helped on internet. Is there anyway to get my progress from the gmail account to the hotmail account ? In addition, i can only access to my gmail account using chrome but not on windows 10. When i go to settings -> account -> email and account, and when i click on \"addmicrosoft account\", i can add the hotmail account but not the gmail account (its stuck on \"please wait\" and it doesn't do anything, even after 30min).","solutions":["In case anyone else runs across this, I just resolved it, and determined the cause.To fix it:go to %localappdata%\\Packages and search for TokenBrokerRight click on each result and open in new windowIn each window, delete the contents of these TokenBroker foldersReboot (necessary)After rebooting, I was logged into Xbox Live without even having to re-enter my password.The cause:I recently added my computer to a domain.  When I did that, I migrated my local profile into a domain profile, including copying over all my appdata files\/folders.  These cached credential files in the TokenBroker folders apparently store SID information in them.  Since joining my computer to a domain (would also happen if you migrate profile data from one computer to another or one profile to another) my SID had changed.  This caused the conflict.  Purging all the cached files with my old SID fixed it."]},{"symptom":"Monitors will not turn off per power settings        My monitors do not enter turn off and power save, per my power settings. They will power save if I shut down or p[ut my pc to sleep. I've run troubleshooter, reset to default, changed settings, updated drivers, changed settings via cmd as admin, checked reliability monitor, unplugged all usb device, issue persists. Can anyone help with this?","solutions":["Hi X, You might want to check this article in regards to your concern. https:\/\/support.microsoft.com\/en-ph\/help\/13770\/...Please let us know if this will help you. Thanks and regards,","I've updated my original post to better reflect the issue. I haven't tested if it will auto enter sleep\/hibernate, though it has no issue with going to sleep via the power button. Though that'd be a work around, at best, if that was what my current concern is and I'm not looking for a work around. Additionally, I've checked in cmd to ensure it is in the correct power setting and it is."]},{"symptom":"Recently having a lot of BSOD while playing games        My laptop is only 4 months old. Recently I have been experiencing alot of BSOD while playing Apex Legends (a video game)Here is my crash dump files and msinfo: https:\/\/drive.google.com\/drive\/folders\/1BJ6aztLTHwhFVtlucPPlL0BDFjHJqsTr?usp=sharingThe BSOD occurs within 1min to 30min of in game time. I had used DDU uninstaller and installed some nvidia driver versions but it doesnt help.Ran stuff like check disk, memtest, sfc scannow and system health doesnt have any issues. I have not overclock my PC but there might be some factory overclocks by ASUS ROG.","solutions":["So.. I ran the driver verifier and upon restarting I instantly get BSOD twice. Had to even do a restore.Here is the dump and Bluescreen view screenshot of ithttps:\/\/drive.google.com\/drive\/folders\/14I0MagDRbQrliIs93jVNtYr-k6U8rt8z?usp=sharing","Hey Jeff, At this point if your issue is not hardware related....how hot does your laptop get while gaming? Perhaps a can of compressed air to your fan might help.If I were you I'd run in windows mode with 16:9 aspect ratio (some say that is a fix). Download hardware monitor and take a look at cpu\/gpu temps. Factory overclocking shouldn't be the issue but just to be safe I'd look into your temps. If temps are fine it's 100% driver related.","It gets around 75 degrees. Should be pretty normal for a laptop. Theres not much dust in there. Its only 4 months old (opened it up before to re-slot the ram so its checked already)I think its a driver issue as the driver verifier did caused a bluescreen which is related the other dump files. All have a common factor with the ntoskrnl.exe. It also found issue with the netfilter21573.sys. (These  problems can be seen in this: https:\/\/drive.google.com\/drive\/folders\/14I0MagDRbQrliIs93jVNtYr-k6U8rt8z?usp=sharing)Looking for a fix since there were totally no problem at all previously. and also if the driver verifier shows corrupted but unrelated files i want to fix that too.","Have you attempted both verifying your game files....and running the following via admin cmd prompt? Is windows fully up to date? We pretty much need to find the problem driver at this point....maybe run a mem test also?Click the Start button and in the search bar, type cmd. Right-click on cmd.exe and select Run as Administrator. Click Yes on the User Account Control (UAC) prompt that appears, and once the type SFC \/scannow and press the Enter key.System File Checker starts and checks the integrity of system files.","As I said in the original post.Ran stuff like check disk, memtest, sfc scannow and system health doesnt have any issues. Thats why I came here since im at a lost.I did repair the game files and the problem still occur. I think the problem driver can be seen in the dump file that the driver verifier made.Just need guidance for ways to fix it.","Hey Jeff so.... Sorry I didn't see you uploaded the dmp file. I analyzed the file using a program.... This indicates that a severe memory management error occurred. A page table entry (PTE) has been corrupted. Parameter 2 is the address of the PTE.This might be a case of memory corruption. This may be because of a hardware issue such as faulty RAM, overheating (thermal issue) or because of a buggy driver. This problem might also be caused because of overheating (thermal issue).That's really the best I can offer at this time. I'll release this back to the community but it seems like a hardware issue to me.","I doubt that its RAM. Ran the memtest and memory diagnostic appear fine. It might be since its never 100% so lets put it on low probability. Plus the device is not even half a year old.For system integrity there was no violations too.For thermals it runs around 75 degree Celsius when on heavy load. Which is pretty normal for a laptop. So the last thing is the drivers. I did reinstall the NVIDIA drivers and test a few of them.I uninstalled using DDU uninstaller for a clean removal.According to the dump filesThe issue caused by address:1) netfilter21573.sys+8e14 (from driver verifier dump) <-might be unrelated for now since it test all drivers. I might not even use it but its corrupted2) ntoskrnl.exe+1c14e0 (crashed from the game Apex Legends) <- some help needed over here Crash dump from bluescreen during game and msinfo: https:\/\/drive.google.com\/drive\/folders\/1BJ6aztLTHwhFVtlucPPlL0BDFjHJqsTr?usp=sharingCrash dump from during driver verifierhttps:\/\/drive.google.com\/drive\/folders\/14I0MagDRbQrliIs93jVNtYr-k6U8rt8z?usp=sharing","Hi Jeff, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved. The unit is under full warranty so that means you definitely need to be working with the Seller and ASUS Support. As OEM ASUS is responsible for both the hardware and Windows. So regardless of the cause it is theirs to resolve. Microsoft purposely has this agreement with OEM's to keep the customer from being caught in the middle. And even if you are some how able to resolve the issue yourself you would still want it fully documented just in case of related issues down the road.------- I have performed detailed analysis on all 6 minidumps. The BugCheck were 4C (Driver Verifier), 2 ea. 1A & 4E, and 12B.Only the 4C had any real Cause at any level. And as you know that was : netfilter21573.sys dated 8\/29\/2018. <-- not sure what this is. Find it and Right Click on it - Properties - Details tab - any help on source there?Have you looked for updates to it? I have seen other BSOD \"Possibly\" caused by that exact dated version. Though none were any clearer that this foggy case.Of the other 5 not much there at all : For 3 - PROCESS_NAME: r5apex.exe (Apex Legends) For 1 - PROCESS_NAME: chrome.exe For another PROCESS_NAME: MemCompression which can be anything. Check with Apex Support and any forums for possible known issues. ------- This definitely appears to be an unknown hardware error. Please realize the highest fault rates are often in both the new as well as those reaching their end of life.Best to contact ASUS Support and Forums for help and possible known issues. ASUS - Service <-- includes Live Chat - Chat Icon is on lower right of page https:\/\/www.asus.com\/us\/support\/Download-Center\/ASUStek Support https:\/\/www.asus.com\/support\/ASUStek Forums are ZenTalk orROG (Republic of Gamers) ZenTalk https:\/\/www.asus.com\/zentalk\/portal.php?nocache=1ROG - Republic of Gamers https:\/\/rog.asus.com\/forum\/?_ga=2.79315284.1301...ASUStek Drivers https:\/\/www.asus.com\/us\/support\/Download-Center\/====== 1, Did you run memtest86 for 4+ hours? Overnight is even better. 2. Heat related does not always mean excessive temps. A single component, such as a transistor, resistor, or capacitor, could be too sensitive to even the normal levels of heat.You can try these stress tests to see if you can identify a hardware issue. PC Stress Test free software for Windows 10\/8\/7 https:\/\/www.thewindowsclub.com\/pc-stress-test-f...Troubleshoot blue screen errors <-- read this link http:\/\/windows.microsoft.com\/en-us\/windows-10\/t...3. If nothing helps you could try a Reset or a Clean Install. However, you definitely should contact ASUS Support.Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all.","I have placed a screen shot of the netfilter21573.sys in here:https:\/\/drive.google.com\/drive\/folders\/14I0MagDRbQrliIs93jVNtYr-k6U8rt8z?usp=sharingMemtest ran it overnight. All passes have not found any problems.Heat might be the cause but also not likely, due to the fact it happens with Apex Legends opened.When u said 4C had any real cause. Does that mean the other causes are just random?To be clear.. What exactly is wrong with my system? Drivers? Hardware? Software? Graphic Card?","So.. I ran driver verifier again. This time avoiding the netfilter21573.sysMy 1st BSOD said esif_If.sys  from Intel. No dump file because its stated in the BSODMy 2nd BSOD is related tozamguard64.sys This i think its the Zemana portable to scan my system and I rarely use it so i guess we can ignore it.Here are the dump files: https:\/\/drive.google.com\/drive\/folders\/19snDMCZdk5Abfuq29RorUwiQrM4g6ZtN?usp=sharingI then unchecked the drivers that have problem to pin point any other problems and I received another dumpconcerning LGBusEnum.sys which comes from Logitech. I unchecked Logitech drivers and the rest the PC didnt occur anymore BSOD but upon starting it still went into automatic repair and restore.^is that normal?Also all dumps have a common factor of ntoskrnl.exe"]},{"symptom":"Video Tags on External Harddrive        I have come across a weird issue with video tags in Windows 10.  Can't seem to find an answer for this.To start I have many mp4 video files.  I open folder right click on the file then go to properties.  I click on details, then add Tags for the video and click ok.  This works normally for few video files on my external hard drive, but occasionally I would come across files that cannot be tag.  After adding tags, I click OK, system display status prompt (stays at 0% complete).  If I closed out of status window, I get a glitch (task bar blank out of a second then reappear).  The entire folder in which my video files were located disappear.  Looks like Windows close the folder after the glitch.At first I thought it was a video issue, however if the video is on my C: drive, it will be tagged ok.  Then the problem seems to be pointing at the external harddrive.  However, I've tested this process with 4-5 different harddrives and they all have same problem.  I ran error checked on harddrive and it's ok.  The video still plays fine.  Is there some sort of bugs on Windows 10 that could have cause tagging on External Harddrive to failed?  There are times when tagging works on external harddrive, so that's why it's hard to figure out where the issue is occurring at.","solutions":[]},{"symptom":"administrator                        I was recently given this computer but they don't remember password to get into files. how can I do this?","solutions":["                I was recently given this computer but they don't remember password to get into files. how can I do this?Since this was someone else's PC, the safest method is to perform a destructive factory restore. This would make the machine \"as new\". All other methods are complex and unsafe."]},{"symptom":"Infinite Loop of Unusual Activity        I am stuck in an infinite loop of \"Unusual activity is detected on your account\" on my main account. I have reset password multiple times trying to verify, yet I can't access it at all. I tried to get help with the app, and it required me to log in. I tried to call, and they didn't help either cuz I got hung up on. Tried to email and it also didn't help cuz it was blocked. I don't know how to fix this problem besides writing here and hoping it helps because microsoft refuses to help me otherwise","solutions":["Hi Help. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Use whichever method works here to get into Repair Mode so you can run a System Restore to a point before this problem began, Go back to Old Version, the new button to Uninstall Updates or a Reset:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... Easiest is to force shutdown by holding in the power button three times until it starts into Repair Mode.If necessary you may need to create bootable media (which uses different drivers) to access the Repair Mode.To create Windows 10 Installation Media on another PC install Media Creation Tool and follow the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, on second screen choose Repair Your Computer, then Advanced Troubleshoot Options, then System Restore, Uninstall Updates, or Go Back to Old Version. If that fails go back to Troubleshoot Options to Reset.If all else fails choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, click Next to let it create needed partitions and start install - this makes it foolproof.Follow the illustrated Clean Install steps in this tutorial which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... There is a step included to rescue your files first if they are not backed up using the bootable media here:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC. I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I probably was misleading with my description, but I am not locked out of my pc. I just cannot do anything pertaining to windows like using the store or anything because it wants me to log in. Even though I can log in on my pc in general, it won't let me do anything pertaining to windows, because it says unusual activity anytime I try to access my account or change anything about it. I don't know how to get in touch with anyone who can help me figure out changing account stuff and getting access to it again, because most of the things require logging into your account to contact them. And all of the things I tried do not help and I can't think of another way","Are you able to use your web browser to try to sign-in to your account. What happens if you select forgot password it would usually ask you some verification questions or send a code to your backup email or text to phone. Do you have either of these thing set.?If you are able to change your password then make sure it is a strong one.","I am able to change my password, and maybe it isn't strong enough? But it has everything recommended for a strong password. I can send a code to backup email but no phone cuz I didn't have one when I got locked out. Even if I reset my password, it still tells me unusual activity and does not allow me to log in, just requires me to change password again.","1) Run the Microsoft Accounts troubleshooter at http:\/\/www.thewindowsclub.com\/microsoft-account... 2) This can be malware-related. Download, install and run a full scan with the most powerful on-demand free scanner Malwarebytes:https:\/\/www.malwarebytes.com\/mwb-download\/.In the Scan Settings first set it to include scanning for Rootkits. If necessary run it in Safe Mode with Networking, or Safe Mode accessed by one of these methods:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... Clean up anything found, restart PC and then run again until it comes up clean. Check for any remainders in Settings > Apps > Apps & Features, and also in each of your browser's Extensions, Home Page settings, Search service or Add-On's as shown here:https:\/\/community.box.com\/t5\/How-to-Guides-for-... 3) Then check for damaged System Files: https:\/\/www.lifewire.com\/how-to-use-sfc-scannow... If it cannot repair them see Step 10 here to continue: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... 4) This can be due to a corrupted account. Test by creating a new Local Admin account in Settings > Accounts > Family & Other People > Other, as shown here:http:\/\/www.howtogeek.com\/226540\/how-to-create-a... Sign into the new account, test if the problem persists, if not then move your files over, test that all programs work or else reinstall them, then when ready delete the old account in the same place.You can then change it to your Microsoft account if desired: https:\/\/www.tenforums.com\/tutorials\/5375-switch...5) If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... If you want to keep Malwarebytes as an on-demand scanner then you can turn off its Real Time trial version in it's Settings > Account Details tab.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Win10 Taskbar; is there a 'new toolbar' option that allows icons just like the main taskbar?        Hi all- I've fully maximized my usage of the taskbar, adding default program icons, etc. I'm wondering if there is any way for the end user to create something similar, not using the taskbar but a new toolbar, and load it with one or more icons?For example, if I want to have a separate group for either a different suite of applications (where I could only turn on that toolbar when I am doing app development, and it has the programs I use for app dev, or a separate group for developing multimedia learning material would have my multimedia tools, etc.)Basically, having additional taskbar-type toolbars would make it easier to show\/hide the applications I need for a day or a week, rather than adding\/removing them from the taskbar, or using the start menu (pinned icons) or a folder toolbar that contains a bunch of shortcuts to the .exe files ... just trying to make my workspace a little more clean and efficient Thanks!using Win10 x64","solutions":["Hi KERATL So say you have a folder of icons you want to put on a toolbar on the Taskbar Right click your Tackbar and choose Toolbars New Toolbar Then navigate to select that folder and click OK Resize your Taskbar to accomodate that new toolbar Whenever you want to hide those icons, right click your Taskbar and choose Toolbars, and untick that new toolbar . . ."]},{"symptom":"Log Out of Windows 10 Device Remotely        Last month, I logged in to Windows 10 device in my school however, i forgot to sign out. Now the schools are closed for now so, i thought i could log out remotely but later i came to know that \"Find my Device\" is disabled on it, so I can't log out remotely. What should i do?","solutions":["Hi Gorakh. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'd call the school and ask them. Someone should be there. Maybe they'll go turn off your PC. More likely it has sleep or hibernate as a backup so that it couldn't wear the RAM down.If you have an IT desk as many schools do, ask for them. But they may not be working so you'll have to ask whoever you get.When does school start again?","Thanks for quick reply.I suppose the pc is switched off since 19 December as i can see on my devices page that last update was checked on the that date.School will start on 13 January.Is there any other way to do this as my school doesn't have an IT desk or something like that.","If you can't log in then try calling the school, whether it has an IT desk or not.","I will do it for sure. Also i had logged only in Windows Store whereas the pc was still running on non-admin local account. I don't have reports of suspicious activity yet. Does it matter?  Also, will changing the password help ?","If you're worried about intrusion into your MS account then, yes, changing the password to a stronger one can lock anyone out who tries to use your account on another device:https:\/\/support.microsoft.com\/en-us\/help\/402683...I suggest a strong, long password that you can easily remember, such as a childhood street address+phone number that only you remember."]},{"symptom":"convert.exe stuck on \"converting filesystem\"        Hi!I am using convert.exe to try to convert one of my disks to NTFS.I trusted the \"your data is safe\"-claim and didn't do a backup...Now, it is stuck on \"Converting filesystem\" and has been for a while.I can not access my drive anymore, Windows says \"Access denied\".When I look at task manager, I see that \"File system conversion utility\" is open, but it says \"Paused\". It goes back to running for like half a second every now and then, but that's it.convert.exe output:convert D: \/fs:ntfsThe type of the file system is FAT32.Enter current volume label for drive D: EXTERNThe volume is in use by another process. Chkdskmight report errors when no corruption is present.Volume EXTERN created 2019-12-02 19:40Volume Serial Number is 0500-17FFWindows is verifying files and folders...File and folder verification is complete.Windows has scanned the file system and found no problems.No further action is required.  976 513 920 KB total disk space.       17 952 KB in 193 hidden files.      766 464 KB in 23 770 folders.  100 737 056 KB in 218 583 files.  874 992 416 KB are available.       32 768 bytes in each allocation unit.   30 516 060 total allocation units on disk.   27 343 513 allocation units available on disk.Determining disk space required for file system conversion...Total disk space:              976752343 KBFree space on volume:          874992416 KBSpace required for conversion:  1584664 KBConverting file systemAnd then it is stuck. I don't care about FAT32 or NTFS right now. How can I access my data again?","solutions":["The conversion failed.D: was not converted to NTFSI'm going to retry later. But puh, it finally finsihed and my data is still there.","Hi SwagYolo, The data is still there? All good that way? I wouldn't suggest doing a conversion of file systems...do a back up of your data, format the drive with NTFS, put your data back on.Changing a file system is an extremely sensitive process that could have significant consequences if it is done incorrectly.Let me know if you need anything else just let me know."]},{"symptom":"Can't install Windows with usb         I have a laptop Lenovo air 13 pro which is having ssd drive I tried to install Windows with USB. On UEFI mode It doesn't recognize USB at all. I tried fat32 format and NTFS. But in legacy mode it recognize USB but it doesn't recognize ssd drive it says I can't install Windows on this location. I already deleted the old os","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,I would recommend re-processing the installation using a bootable media with a partition scheme of gpt and a file system of fat32First, download the ISO file from the media creation tool and use rufus to create the bootable mediaYou may download rufus via this link https:\/\/rufus.ie\/Upon creating the bootable media, make sure that your bios is currently set to UEFI to make sure that it is compatible with the gpt partition scheme of the bootable flash drive.Let me know how it goes. :)"]},{"symptom":"view files&folder from a removed hard drive        Hi I have a computer which cannot boot. I cannot repair, restore, recover. I remove the hard drive and placed in an enclosure and attached to an another computer. I can see files and folders from users and public but not from my account (under my name when i signed in to windows). Can Anyone help me to visualize files and folders (pictures, folders, download) which are saved under my name. I appreciate any help.","solutions":["You need to seize ownership of these folders then give yourself full access rights - see here:https:\/\/technet.microsoft.com\/en-us\/library\/cc753659.aspxhttps:\/\/www.online-tech-tips.com\/computer-tips\/set-file-folder-permissions-windows\/","Hi trataz, You probably have to take over ownership of the folder... Follow the steps below: https:\/\/www.windowscentral.com\/how-take-ownersh...This will allow you take over the folder - it sounds like you can view the files so it shows no corruption; just need to take over ownership and you will be good to go!DISCLAIMER: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Computer test        My old Dell had a test that gave extensive, several page results- including \"extended System test\", \"system stress test\", etc.  I have a new Dell which also has problems and cannot find this test- both computers had Windows 10.Thanks for any helpJohn","solutions":["Hi John Dell Moved a lot of their Diagnostic testing online on their later models, you can read the details here:https:\/\/www.dell.com\/support\/article\/ie\/en\/iedh...You should still be able to also access Dell Hardware Diagnostics by repeatedly pressing F12 on the Dell logo screen, just as your system boots up . . .________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]},{"symptom":"W10 v1909 S Mode update failure        windows 10 not installing this update.  Tried dozens of times to get it to install with no luck.Windows Malicious Software Removal Tool x64 - December 2019 (KB890830) - Error 0x800711c7New notebook using S mode Windows 10 version 1909  build 18363.535","solutions":["Hi E, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.I have read from users who have had this same error message, which solved the problem with the download and manual installation of MSRT. This website of a Windows MVP explains the steps and what the process is about.https:\/\/www.tenforums.com\/windows-10-news\/14430...How to Reset Windows Update in Windows 10, this method seeks to erase the error in case no step works.https:\/\/www.tenforums.com\/tutorials\/24742-reset...Let me know if you have something else that I can help you with, I'd be happy to help.Regards, Marc M. Have a nice day Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","1.Just ignore recent reply by \"Independent Advisor\" MarcMorelli56His advice is useless and won't work.2.\"Win10-S mode is not supported, there is no added value of running MSRT on this platform. Any install failures of attempting to install the package can be safely ignored.\"Source: https:\/\/support.microsoft.com\/en-us\/help\/890830\/remove-specific-prevalent-malware-with-windows-malicious-software-remo","Thank you for linking to the \"official\" Microsoft answer that MSRT is not supported by S mode computers and can not be run on S mode computers.  As the owner of an S mode laptop, I DO find it irritating that everyday, my laptop downloads MSRT, attempts to install it, and then reports an install failure.  It seems to be Microsoft's position that S mode computers will never get infected by malware and therefore there is no need to run MSRT on S mode computers....so why try to install it day after day?","You're welcome, Alan.I fully understand your irritation...."]},{"symptom":"Manual submission of PIN with Windows Hello logon via Enter key or Submit button        I'm running Win10 Pro 1909 and have been trying out the PIN logon feature of Windows Hello. In doing so I've found a [minor?] security issue with the logon method and wish to change the behavior of the PIN logon process. Unfortunately I haven't found any information on how to change it nor if its even configurable in the help articles, via web searches, and elsewhere in this forum.The issue is that upon entering a PIN at the logon screen, Windows automatically accepts the input and processes the typed data as soon as the correct number of characters has been entered, and then either logs in to Windows or returns an error as appropriate. The concern is that it does not require the use of the \"Enter\" key nor other submission method by the user to indicate to the system that they are finished with typing their PIN; the system does this automatically based solely on the number of entered characters. This is a security vulnerability because it allows anyone with physical access to the machine to determine the length of the user's PIN simply by pressing any key and counting the keypresses until the system attempts a login. This is a security vulnerability because PIN \/ password length information provides data which can be useful to an attacker for assessing attack methods as well as part of a social engineering attack. Requiring the user to press \"Enter\" or otherwise manually submit the entered PIN data would mitigate this exposure of PIN length.So my question is this: Is there a Group Policy Object or other configuration point where I can tell Windows Hello to require manual submission of PIN entries (versus the automatic submission based on the number of characters)? If so, where is it please? Thanks.","solutions":["I believe you can either set a 4 or 6 digit pin but you’d still have the security problem.I recommend sending Microsoft feedback via the Windows key + F. If I find any further information I’ll post back.","Apparently if the password option is disabled this will automatically open Windows when the pin is entered without pressing Enter so check to see if this is enabled.Settings>Account>Sign in. Is the account local or Microsoft? The problem is indicative of a local account. Other users suggest this is normal.","Do you require further help?"]}]}