{"windows":[{"symptom":"DESKTOP SHORTCUTS        HOW TO CREATE SHORT CUTS ON DESKTOP OF MY FAVORITE WEB SITES THAT I USE FREQENTLY, SO I DON:T HAVE TO STARTEXPLORER TO GET THE ENTRY FROM MY FAVORITE LIST","solutions":["Hi donkuhnle Navigate to a web page Click into the address bar and press CTRL + A to select the whole address, then press Ctrl + C to copy the addressRight click your Desktop and choose New - Shortcut Click in the Location box and press Ctrl + V to paste that web address and click NextProvide an appropriate name for the shortcut and click Finish . . ."]},{"symptom":"TextN        Why can't I download TextNow to my alcatal4 phone. I've added device. I have Windows 10. It also says my device should be compatible. It also shows that I own the app. When I go to install on this device it says there is no device that has windows on it. It also shows its available on my PC. What do I do. This operating system could be so tight, but yet its so weak. Please help","solutions":[]},{"symptom":"iPhone7+ not detected by Windows 10        Windows 10 was recognising iphone till 31st Dec. 2019. It has stopped recognising my iphone since 1st Jan. 2020.Following is the error message dialog box.\"USB device not recognised. The last USB device you connected to this computer malfunctioned, Windows does not recognise it.Try reconnecting the device. If Windows still does not recognise it, your device may not be working properly\".I have tried couple of windows 10 computers. same error message. Iphone gets charged when connected to the computer.Took my phone to Apple store. They said that charging port is faulty (pin bent?). Took my phone to a local repair shop. They connected my phone to their Laptop, their computer (Apple) recognises my iphone. My phone battery is charged 100%. All other functions seem working. Highly appreciate logical reasoning \/solutions to the problem. ","solutions":["Hello NayakR, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemHave you tried using another Original USB cable? some cables are good only for charging purposes, but they can not transfer data.also, If the Pin is bent, it might work sometimes and sometimes not.. so this could be the real issue.Regards! Farah","Hey MayakR, I saw that you marked my response as not helpful.. Did you check if your cable is original?","Hi Farah,Thanks very much. Yes, I have tried several cables including the original. Also located the Apple mobile usb driver in windows 10, updated, de installed \/ reinstalled etc. Learnt a bit doing all these.What I have not tried is to open the mobile and check it myself. I need the right tools. It is bit annoying that one small part is holding a whole phone to ransom.Thanks. RegardsNayakR","It seems like a hardware issue though.. I hope you can work it out then Cheers! Farah","It seems like a hardware issue though.. I hope you can work it out then Cheers! Farah Hi F.Farah,Thanks.I have not yet found out why it worked for the local repair shop laptop- both original cable as well as other cables. Yes, it may be hardware issue but does not provide logical explanation. Mobile phone vendors \/ repairers seem to have black box approach.Thanks RegardsNayakR","Hi NayakR, Is there an update applied on your Windows before experiencing this issue? If yes, what I can suggest is to rollback the updates: https:\/\/lifehacker.com\/how-to-undo-and-prevent-...And disable your windows update for the mean time, please follow this link for detailed guide:https:\/\/www.cleverfiles.com\/howto\/disable-updat...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"Error code 0x8007016a        I dumped my one drie account because A) it was not what I thought I had purchased and B) it cost more than I was receiving in value.Since then, I can't move things off of my HDD that I had assigned to my one drive account and I can't re-name the drive. Every time I attempt, it states \"Cloud provider not running\". Its getting to be VERY frustrating and I'd like to do other things with the HDD, but I can't as long as ONE DRIVE cotrols it.I'm open to suggestions","solutions":["Hi John, One possible reason is that the file on demand may still be enabled on your drive. You can try disabling the file on demand by following method 2 provided on the link below.https:\/\/appuals.com\/how-to-fix-error-0x8007016a...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","None of the solutions are applicable as I don't share files and every trace of onedrive has already been uninstalled from my laptop, Any other ideas?","Hi John My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Removing the glitched folder forcibly with Powershell Press Windows key + R to open up a Run dialog box. Then, type “powershell” inside the text box and press Ctrl + Shift + Enter to open up an elevated Powershell window. When you’re prompted by the UAC (User Account Control) prompt, click Yes to grant administrative privileges to the Powershell window. Once you’re inside the elevated Powershell window, type the following command and press Enter to get rid of the Onedrive folder that is causing the issue:Remove-Item \"OneDrive folder name\" -Recurse -Force Note: Keep in mind that “OneDrive folder name” is just a placeholder for the exact name of the folder that you’re trying to delete. Make the changes accordingly before running this command.Once the command is successfully completed, restart your computer and see if the issue has been resolved at the next system startup.Hope this helps.","What does that do to\/with the data thats in the folder? That specific folder has 4T if data and I can't replace a lot of it. Suggestions?"]},{"symptom":"Screen Turns Black and Application crashes        Hello,I have a Problem. Whenever I use Unity (Game Dev Engine) and start a Project its really laggy and when i use it a few secods the Screen turns black for around 1 second. When i see something again The Unity Window is white and i can't use it anymore. It also crashed a game(Anno 1800) that was opened in the background. The error message of the game sayd that it is a DirectX issue. In Youtube the Video stopped and turned green, but when i pressed play it resumed.Can someone help me?PC:AMD Ryzen 5 2600Nvidia Geforce GTX 166016GB RAMAll drivers are updated.","solutions":["Hi Luggi All the symptoms you describe lead to the conclusion it is your Nvidia Geforce GTX 1660 device driver causing the problems . . .Open Device Manager (accessible by right clicking your Start Button) Expand the Display Adapters Section Right click your video card and choose Properties On the Driver Tab, choose 'Roll back Driver' Restart your PC once done . . . If that option is grayed out or does not resolve the issue, go to the support page for your device on the manufacturers website, then download and install the video driver they recommend, it may well be an older version to the one you are currently running, but should be more compatible with your PC than the version installed by Windows 10 updates . . .","Thanks for the reply.But I don't think that is going to work because i have this issue for a few months now and i updated the drivers often in since then.","I just looked in the Task Manager and when this happenes the 3d usage of the GPU spikes to 100% two times. Any ideas?"]},{"symptom":"How to disable Hover-Select in Windows 10        I just installed Windows 10 on my Lenovo laptop.  It seems to select\/open items when I hover over them for more than a second or two.  This happens intermittantly, but more often than not.  How do I turn this off in Windows 10?  Note that the Windows 7 and 8 solutions that I've seen here do not work in Windows 10:  Windows 10 does not appear to provide the same mouse\/touchpad options in the control panel as the earlier versions of Windows.Thanks***Post moved by the moderator to the appropriate forum topic.***","solutions":["Hi,Thank you for posting your query on Microsoft Community. I understand the inconvenience you are facing. I will certainly help you with this.Method 1:I suggest you to disable window by hovering over it with the mouse and check if it helps. To do so I suggest you to try the below given steps and check if it helps:Press Windows key + X key and click onControl Panel.Select or click Ease of Access.Click or tap on Ease of Access Centre.Click on Make the Mouse Easier to Use was uncheckActivate Window by hovering over it with the mouse.Check if issue is resolved.Method 2:I would suggest you to completely uninstall the touchpad driver and reinstall it. Kindly follow the below given steps.Press “Windows key + X” and click on “Device Manager”.In the list of devices, you  should see the touchpad drivers.Right click on the device and then select \"Uninstall\".In the uninstall dialog,  make sure you select the option to delete the driver package from the      system. This causes the driver package installed earlier to be deleted.In the Action menu of Device manager, select “Scan for Hardware changes”option. This will cause the device driver to be   reinstalled. Once the driver is installed, close all windows and restart      the computer.Hope the information helps. Do reply if you need further assistance, we will be happy to help you.Thank you."]},{"symptom":"My laptop brightness bar wont go passed certain thresholds of brightness 40 being the main one its stops at help?        so ive been trying too simply turn my brightness up too 60 (as thats what it was at before when it was working) but now i doesnt work for some reason when i unplugged my laptop too move too a nicer spot in my house the brightness just stopped working. when i go too the bottom right of my screen and try and turn up my brightness the bar will stay at 100 but the actual brightness level that you physically see is around 20% 25% and it will slightly flicker (the screen wont go black then back too normal, rather it flickers slighty in the brightness aspect) my laptop is new and runs things very well here are the steps ive done:1.went too device manager adapters updated drivers even uninstalled and reinstalled2.power settings-advanced power setting- change plan- display.3.right click bottom of screen and played with brightness and bought a new battery too see i that helped.something i want too do but cant.....restore factory system settings. but i get \"theres a problem resetting this pc\" idk why but thats another problem","solutions":[]},{"symptom":"WINDOWS 10 UPGRADE FROM WINDOWS 7 -  DELL T3610        Hello all-I have been trying for days to upgrade from Windows 7 Pro SP1 with no luck whatsoever,following many suggestions from the Microsoft community. The upgrade always stops right before\/during safe boot mode, invariablyputting out this error code \"C1900101-20017\".I tried the upgrade twice today after doing a clean install of Win 7 yesterday (with all current updates)- still no success, same error code.I'm wondering if my computer is not supported, or if I have an incompatible graphics card.Please see images below with computer info and error messages. I will gladly provide any other info with the hope of resolving this issue.Can anyone help?Thanks much in advanceDELL PRECISION T3610FirePro V5800 Graphics Card","solutions":["Hi Estepario2020 According to the Dell Website, your PC does support both the 32bit and 64bit versions of Windows 10 . ..https:\/\/www.dell.com\/support\/home\/ie\/en\/iedhs1\/...If you go into BIOS (F2 on the Dell Logo at startup), is your BIOS Legacy or UEFI?You mention you re-installed Windows 7, did you create the bootable Windows 10 USB media on Windows 7?Have you tried to just clean install Windows 10 on that PC, rather than installing Windows 7 first, then upgrading to Windows 10?","Hello Dave-Thanks for the quick reply. Bear with me here as I am not very savvy when it comes to computer issues. As to your questions:The BIOS is set to \"Legacy\"\"... did you create the bootable Windows 10 USB media on Windows 7?\"  I tried copying it to a flash drive and ran the update from there,  but I'm not to sure if it actually rebooted from there. \"Have you tried to just clean install Windows 10 on that PC, rather than installing Windows 7 first, then upgrading to Windows 10?No, though I was considering it, but again, I was unsure on how to do it.I appreciate the help.","Hi Estepario2020 Here is how to create bootable Windows 10 media on a USB Flash drive and clean install Windows 10, please backup your data before proceeding . . .Click this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), you can create a bootable USB flash drive (min 8GB) using that toolThen, Boot your PC from the Installation Media you just created (change Boot Order in your BIOS) to begin installing Windows 10During the installation process skip the steps which ask for a product key and select the option 'I am Reinstalling Windows 10 on this PC'Make sure you install the same Edition of Windows 10 (Home, Pro . . . etc.) that matches your edition of Windows 7","Thank you Dave.  I will try this shortly and let you know how things went. One question, should I leave the BIOS option set to Legacy?Big thanks!","If Dell has no downloads for youre pc model in Win 10,but all the other OS,its probably not able..However,a I5 CPU should be able.https:\/\/www.intel.com\/content\/www\/us\/en\/support\/products\/122597\/processors\/intel-core-processors\/8th-generation-intel-core-i5-processors.htmlhttps:\/\/downloadcenter.intel.com\/download\/29274\/Intel-Graphics-Windows-10-DCH-DriversBoth links are i5\/Windows 10 support,but in most cases,the Intel Chipset installed on youre pc is the key...","Hi Estepario2020 If you are going to clean install Windows 10, try installing in Legacy Mode, if that will not start the installation process, then you should switch to UEFI BIOS . . .","Thanks for the reply, Andrew. I am looking over the info on the links.I appreciate the help!","Hello again Dave-I got a lot further with the bootable flash drive but am stuck at the screen with 2 install options (please see below). If i click on the second option, no drives show up to install windows.After clicking the first option, i get this screen:","Hello Estepario2020, I am Andrew, I want to try to help you. Are you still getting this on a new USB?Try running the update feature from the USB within Windows. To do this open the USB and execute the setup.exe file.","Hello Andrew-Thanks for the reply. Yes, I have tried it that way but am willing to try again. I have done it from within Windows and, recently, as a bootable USB flash drive.One added note, if it wasn't clear from my last post- when I select the \"Custom\" option, I get the following screen:I am not able to load any drivers. I did a bit of research (not sure if accurate), but Intel RST driver files for Win 10 were mentioned.I will try running from within Windows one more time, and I'll post the results.Much appreciated,MiguelPlease let me know if I can provide any other info. P.S. OK, I tried a clean Win 10 install from within Windows, and I got the same results- no drives present and unable to upgrade. Please help!"]},{"symptom":"I have Microsoft Money Plus Deluxe Version 17.0.120.3817 in Windows 10.  It will not do the backups, and I need to know how to fix that.        I have Microsoft Money Plus Deluxe Version 17.0.120.3817 in Windows 10.  It will not do the backups, and I need to know how to fix that.","solutions":["Hi InezJohnson, You might want to check these two threads in regards to this application. These contains suggestions on how to fix this kind of issue. https:\/\/social.microsoft.com\/Forums\/en-US\/f3696...https:\/\/www.computing.net\/answers\/windows-10\/mi...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"Repair a USB Key in Windows 7 or 10?        This USB key appears to work fine under Windows 7 Pro but is no longer recognized by Windows 10 Pro.  I had formatted it to get rid of all old data; then it was reformatted by another piece of software running on the Win10 machine that was trying to make it a Win10-bootable USB key.  That process failed, and now the key is not accepted by Win10.The only difference between this problem key and another working one that I can see in Win7 is that there is no hidden System Volume Information on the problem key.Is there any way within Win7 or Win10 (or perhaps another known-safe utility) to repair this USB key? -- JCW2","solutions":["Hi JCW. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Since it failed to format it as bootable installer it may still have bootable code in boot sector and partition table that's interfering, so best to wipe it clean and then reformat as shown here:http:\/\/www.howtogeek.com\/235824\/how-to-clean-a-...Then if you still want it to be a bootable Windows 10 installer then just wipe the stick and don't format, download and install Media Creation Tool and follow these steps:https:\/\/www.tenforums.com\/tutorials\/2376-create...Once it's formatted you can still store other files on it as long as you don't touch the seven files placed in the root to make it a bootable Windows installer.If these all fail run Diagnostics to know it's exact condition: https:\/\/www.kapilarya.com\/fix-flash-drive-probl...https:\/\/www.raymond.cc\/blog\/how-to-check-and-te...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"WIA stuck in Starting status.  Unable to connect my scanner        Since installing new computer with Windows 10 the WIA stuck in Starting status.  Unable to connect my scanner","solutions":["Hi GeriannMitchell, My name is Riccardo, what is the exact model and manufacturer of the scanner you are trying to use?Let's try a few things... 1. Go to Start > type in services.msc > click Services 2. Go down to Windows Image Acquisition service, right-click and click Restart Does this fix the issue? If you go to Start > Type in Printers and Scanners > cick the printers and scanners icon > do you see your printer and scanner there? Does it say operational?Let me know and I will assist you until this is fixed.","I tried thatit wont allow me to stop restart","Have you tried rebooting Windows 10? What error does it give you when you try to restart the service?"]},{"symptom":"Xbox 360 Gamepad assigned to port 2 instead of port 1        Hi,Very few times, when I plug my wired game pad, it's wrongly associated with port 2. I know it's port 2 because the light at top right of the pad is on instead of the one at top left.The only other plugged USB devices are :- my wireless mouse (Logitech G602)- wired keyboard- three wired Oculus sensors for virtual reality- a wired wifi sensorI can solve the issue by closing my session and re-opening it but since the workaround is time consuming, I'm looking for a real fix.Thanks.","solutions":["Hi Shenmue, You might want to check this article on how to calibrate your controllers. https:\/\/support.xbox.com\/en-US\/xbox-on-windows\/...Please let us know if this will help you solve your concern. I'll be waiting for your feedback. Thanks and regards,"]},{"symptom":"DVDs Won't Go Past Main Menu        Many DVDs I was previously able to play on my laptop will now not play beyond the main menu. Clicking any menu item or pressing \"Skip\" has the DVD player briefly (for a fraction of a second) try to play the selected movie\/menu (I can tell because the chapter markers briefly pop up on the timeline), but it always ends up just replaying the main menu or stopping video playback altogether. I've included the entire log at the end of this message. For some reason, it has this issue on some DVDs and not others (i.e. \"Love and Mercy\" and \"The Ren & Stimpy Show Uncut,\" but not the Criterion Collection release of \"Rebecca\").Resetting the Preferences had no effect.Disabling \"Start directly in menu\" in the preferences either results in no playback or (on rare occasions) the following error message repeated every few seconds: \"DVDRead could not read 1\/4 blocks at 0x05\"Reinstalling VLC Media Player (including to the latest nightly build) had no effect, nor did trying other DVD players.I wonder if it has something to do with me going to the UK and changing my Region settings for a semester (I was able to play the DVDs in the US before the move); but the Windows Settings say everything's back to the US Region settings now, so I'm not sure if this is the issue unless I'm missing some hidden advanced setting.Or it may have something to do with copy protection? The working \"Rebecca\" DVD has a CP \"copy protected\" logo on the back whereas the other DVDs do not.I'm sure this is a software issue rather than a problem with my disc drive, as it has completely no issues with ripping, burning, and playing back CDs.Help would be extremely appreciated!!Specs:Windows edition: Windows 10 HomeManufacturer: ASUSTek Computer Inc.Model: G751-JLProcessor: Intel(R) Core(TM) i7-4720HQ CPU @ 2.60GHz 2.59 GHzInstalled memory (RAM): 8.00 GBSystem type: 64-bit Operating System, x64-based processorLog:dvdnav debug: DVDNAV_NOPdvdnav debug: DVDNAV_CELL_CHANGEdvdnav debug: - cellN=2dvdnav debug: - pgN=2dvdnav debug: - cell_length=23308dvdnav debug: - pg_length=23308dvdnav debug: - pgc_length=3759000dvdnav debug: - cell_start=7643dvdnav debug: - pg_start=7643dvdnav debug: DVDNAV_SPU_CLUT_CHANGEdvdnav debug: DVDNAV_SPU_STREAM_CHANGEdvdnav debug: - physical_wide=0dvdnav debug: - physical_letterbox=0dvdnav debug: - physical_pan_scan=0dvdnav debug: buttonUpdate not done b=1 t=0main debug: killing decoder fourcc `spu 'main debug: removing module \"spudec\"main debug: removing module \"spudec\"main debug: looking for packetizer module matching \"any\": 25 candidatesmain debug: using packetizer module \"spudec\"main debug: looking for spu decoder module matching \"any\": 22 candidatesmain debug: using spu decoder module \"spudec\"dvdnav debug: DVDNAV_AUDIO_STREAM_CHANGEdvdnav debug: - physical=0main debug: crop: 173,31,148,81, palette forced: 1dvdnav debug: buttonUpdate 1main warning: original picture size is undefined(Here's where I clicked \"Play\" in the menu)main debug: VoutDisplayEvent 'mouse button' 0 t=8main debug: crop: 173,31,148,81, palette forced: 1dvdnav debug: buttonUpdate 1dvdnav debug: DVDNAV_HOP_CHANNELmain debug: ES_OUT_RESET_PCR calleddvdnav debug: DVDNAV_CELL_CHANGEdvdnav debug: - cellN=1dvdnav debug: - pgN=1dvdnav debug: - cell_length=24012dvdnav debug: - pg_length=24012dvdnav debug: - pgc_length=276000dvdnav debug: - cell_start=0dvdnav debug: - pg_start=0dvdnav debug: DVDNAV_SPU_CLUT_CHANGEdvdnav debug: DVDNAV_SPU_STREAM_CHANGEdvdnav debug: - physical_wide=0dvdnav debug: - physical_letterbox=0dvdnav debug: - physical_pan_scan=0main debug: crop: 173,31,148,81, palette forced: 1dvdnav debug: buttonUpdate 1mmdevice debug: state changed: 0main debug: killing decoder fourcc `spu 'main debug: removing module \"spudec\"main debug: removing module \"spudec\"main debug: looking for packetizer module matching \"any\": 25 candidatesmain debug: using packetizer module \"spudec\"main debug: looking for spu decoder module matching \"any\": 22 candidatesmain debug: using spu decoder module \"spudec\"wasapi debug: resetdvdnav debug: DVDNAV_AUDIO_STREAM_CHANGEdvdnav debug: - physical=0main debug: Buffering 0%dvdnav debug: buttonUpdate not done b=1 t=0main debug: Buffering 1%main debug: Buffering 2%main debug: Buffering 3%main debug: Buffering 4%main debug: Buffering 5%main debug: Buffering 6%main debug: Buffering 7%main debug: Buffering 8%main debug: Buffering 9%main debug: Buffering 10%main debug: Buffering 11%main debug: Buffering 12%main debug: Buffering 13%main debug: Buffering 14%main debug: Buffering 15%main debug: Buffering 16%main debug: Buffering 17%main debug: Buffering 18%main debug: Buffering 19%main debug: Buffering 20%main debug: Buffering 21%main debug: Buffering 22%main debug: Buffering 23%main debug: Buffering 24%main debug: Buffering 25%main debug: Buffering 26%main debug: Buffering 27%main debug: Buffering 28%main debug: Buffering 29%main debug: Buffering 30%main debug: Buffering 31%main debug: Buffering 32%main debug: Buffering 33%main debug: Buffering 34%main debug: Buffering 35%main debug: Buffering 36%main debug: Buffering 37%main debug: Buffering 38%main debug: Buffering 39%main debug: Buffering 40%main debug: Buffering 41%main debug: Buffering 42%main debug: Buffering 43%main debug: Received first picturemain debug: Buffering 44%main debug: Buffering 45%main debug: Buffering 46%main debug: Buffering 47%main debug: Buffering 48%main debug: Buffering 49%main debug: Buffering 50%main debug: Buffering 51%main debug: Buffering 52%main debug: Buffering 53%main debug: Buffering 54%main debug: Buffering 55%main debug: Buffering 56%main debug: Buffering 57%main debug: Buffering 58%main debug: Buffering 59%main debug: Buffering 60%main debug: Buffering 61%main debug: Buffering 62%main debug: Buffering 63%main debug: Buffering 72%main debug: Buffering 80%main debug: Buffering 82%main debug: Buffering 83%main debug: Buffering 84%main debug: Buffering 85%main debug: Buffering 86%main debug: Buffering 87%main debug: Buffering 88%main debug: Buffering 89%main debug: Buffering 90%main debug: Buffering 91%main debug: Buffering 92%main debug: Buffering 93%main debug: Buffering 94%main debug: Buffering 95%main debug: Buffering 96%main debug: Buffering 97%main debug: Buffering 98%main debug: Buffering 99%main debug: Stream buffering done (301 ms in 180 ms)main debug: Decoder wait done in 5 msmain warning: playback way too early (-290634): playing silencemain debug: inserting 13950 zeroesmmdevice debug: state changed: 1main warning: playback too early (-62718): down-samplingmain debug: VoutDisplayEvent 'mouse button' 0 t=9main debug: auto hiding mouse cursordvdnav debug: DVDNAV_NOPdvdnav debug: DVDNAV_VTS_CHANGEdvdnav debug: - vtsN=1dvdnav debug: - domain=2main debug: ES_OUT_RESET_PCR calledmmdevice debug: state changed: 0main debug: killing decoder fourcc `mpgv'main debug: removing module \"avcodec\"wasapi debug: resetmain debug: saving a free voutmain debug: reusing provided voutmain debug: removing module \"mpegvideo\"main debug: killing decoder fourcc `spu 'main debug: removing module \"spudec\"main debug: removing module \"spudec\"main debug: killing decoder fourcc `a52 'main debug: removing module \"avcodec\"wasapi debug: resetmain debug: removing module \"samplerate\"main debug: removing module \"scaletempo\"main debug: removing module \"float_mixer\"main debug: keeping audio outputmain debug: removing module \"a52\"main debug: Program doesn't contain anymore ESdvdnav debug: DVDNAV_CELL_CHANGEdvdnav debug: - cellN=1dvdnav debug: - pgN=1dvdnav debug: - cell_length=19534dvdnav debug: - pg_length=19534dvdnav debug: - pgc_length=788442000dvdnav debug: - cell_start=0dvdnav debug: - pg_start=0dvdnav debug: DVDNAV_SPU_CLUT_CHANGEdvdnav debug: DVDNAV_SPU_STREAM_CHANGEdvdnav debug: - physical_wide=-1dvdnav debug: - physical_letterbox=-1dvdnav debug: - physical_pan_scan=-1dvdnav debug: buttonUpdate not done b=1 t=1dvdnav debug: DVDNAV_AUDIO_STREAM_CHANGEdvdnav debug: - physical=0main debug: Buffering 0%dvdnav debug: buttonUpdate not done b=1 t=1main debug: Stream buffering done (2470 ms in 4 ms)main debug: Decoder wait done in 0 msmain debug: destroying useless voutmain debug: removing module \"direct3d11\"direct3d11 debug: Direct3D11 resources destroyeddirect3d11 debug: Direct3D11 device adapter closeddirect3d11 error: SetThumbNailClip failed: 0x800706f4direct3d11 debug: Win32 Vout EventThread terminatingdirect3d11 debug: Win32VoutCloseWindowdirect3d11 debug: WinProc WM_DESTROYmain debug: removing module \"inhibit\"qt debug: releasing video...qt debug: Video is not needed anymoremain debug: removing module \"freetype\"main debug: removing module \"yuvp\"main debug: removing module \"swscale\"main debug: looking for packetizer module matching \"any\": 25 candidatesmain debug: using packetizer module \"mpegvideo\"main debug: looking for video decoder module matching \"any\": 19 candidatesavcodec debug: using ffmpeg Lavc58.6.103avcodec debug: CPU flags: 0x000fd3dbavcodec debug: allowing 6 thread(s) for decodingavcodec debug: codec (mpeg2video) startedmain debug: using video decoder module \"avcodec\"dvdnav debug: buttonUpdate not done b=1 t=1mpegvideo debug: size 720x480\/720x480 fps=29.970dvdnav warning: cannot get next block (Error reading from DVD.)main debug: killing decoder fourcc `mpgv'main debug: removing module \"avcodec\"main debug: removing module \"mpegvideo\"main debug: removing module \"dvdnav\"main debug: Program doesn't contain anymore ESmain debug: dead inputqt debug: IM: Deleting the inputmain debug: changing item without a request (current 0\/1)main debug: nothing to play","solutions":["Hi ComatoseLaptop, You might want to try a third party Software that might have codecs to play your DVD files.Please check this link: https:\/\/www.videolan.org\/vlc\/download-windows.htmlDisclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Apologies, I should have been more clear. VLC Media Player is the application I've already been using. I've updated to the latest version (3.0.8) and even tried outthe latest \"nightly\" update. I've also tested the issue with \"Ultra DVD Player\" and \"AnyPlayer\" (both on the Microsoft Store) and it does the same thing. This is what led me to believe this is an issue with my PC's software, not the DVD player's software. I didn't try \"Windows DVD Player\" because I didn't want to spend $15 on it, knowing it probably wouldn't fix the issue."]},{"symptom":"Windows 10 Setup Won't Start        Hi,I successfully avoided the upgrade from Windows 7 to Windows 10 (my machine came with both) for four years, but it's time to surrender.My problem is that when I try to upgrade, whether from the CD or downloaded, it only gets as far a \"Setup is starting,\" but it doesn't start.My guess is that whatever I did four years ago to prevent the computer from trying to upgrade every day, might be preventing the upgrade now. Unfortunately, I can't remember what I did.Any assistance would be greatly appreciated.C²","solutions":["Hi Aviador. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.What do you think you did previously to block Updates? If Windows won't Upgrade then I'd do the Clean Install which is a much better install anyway and has far less problems than in-place Upgrades. This is the reason no tech enthusiast will even run a Factory or Upgrade install because they'd expect endless issues like this - is this both? Follow the gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... To create bootable Windows 10 Installation Media (on another PC if necessary) install Media Creation Tool and follow the directions in the middle of the download page here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key for your PC maker given in this chart:https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, then on second screen choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, select the Unallocated Space, click Next to let it create and format the needed partitions and start install - this makes it foolproof.You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC because you will learn everything that works best and how to apply it with your own hands.If you still want to try the Upgrade then follow these steps for overcoming Version Upgrade problems:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Proxy Server keeps turning on after turning off in Windows 10        The manual proxy server keeps turning on every few minutes. I tried many ways to fix it. None worked. Even using a VPN doesn't work. It's a personal computer with Windows 10 Home. If someone can help me I really appreciate it. ","solutions":["Hi PurebredCloud04 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.The VPN might be managing your system proxy. I found a thread that might help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Hi, Thank you for replying. I have read this thread before. And I tried their methods but it didn't help me.","Hi PurebredCloud04, I will release the question for other experts come to give his opinion, I am sorry not to find the problem.Thanks!","Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.Please reset the Network Adapter and check.Steps to reset network driver.Go to Device Manager.Locate and expand Network Adapter.Right click on the Wireless driver and select Uninstall. (Do Not select any Check Box)Restart the PC.Note: If you are using Ethernet, then uninstall the Ethernet driver and Restart the PC.","Hello,Thank you for your reply. Before I saw this solution I went to safe mode and modified the registry. Although I didn't have anything to modify there it seemed to work. So far the problem is gone. The proxy is not turning on by itself anymore."]},{"symptom":"windows server 2016 essentials - Failover clustering not detecting        Hi Friends,I want to make a 2 node cluster, i have already installed failover clustering feature on both the nodes through server manager.But when i try to create a cluster, it gives me an error : \" the server \"node01\" does not have failover feature installed. Please use server manager to install this feature\"But feature is already installed.Can somebody help me with this error. How can i fix it.Its urgent for me.Regards","solutions":["Suggest asking here: https:\/\/social.technet.microsoft.com\/Forums\/en-US\/home?forum=ws16essentials","Hi ishaq_mca I am sorry Community is just a consumer forum, due to the scope of your question (Server 2016) can you please post this question to our sister forum on TechNet in the Server 2016 section (linked below)Over there you will have access to a host of Server 2016 experts and will get a knowledgeable and quick answer to this question . ..https:\/\/social.technet.microsoft.com\/Forums\/en-..."]},{"symptom":"Wake from sleep issue        After the system goes to sleep once I awake it it hangs at the Windows screen (where time is shown left corner). After a bit I'm greeted with BSOD stating...DPC WATCHDOG VIOLATIONThis is a clean install of Windows 10 Pro 1909 18363.535. When I hit the power button (after the diagnostic runs) it shuts off then I'm able to restart the desktop without issue. All my drivers are current and report no issue\/s.System specs:Gigabyte GA-Z68XP-UD3 rev 1.0 (Award BIOS F10 latest)Core i7 3770K32GB G-Skill DDR3 RAM (CL7-8-8-24)Sound Blaster X-Fi Xtreme GamerLG Blue Ray DL1TB Crucial MX500 SSD1TB Mushkin RAW SSD1TB Hitachi SATA3 7200rpm1TB WD Black SATA3 7200rpmAntec 650w PSURosewill Mid Tower Challenger","solutions":["Minidump:https:\/\/www.dropbox.com\/s\/ldaj3bkew7beb1w\/121219-9125-01.dmp?dl=0","Ran: powercfg \/devicequery wake_armedResults:Realtek PCIe GbE Family ControllerHID Keyboard DeviceHID-Compliant mouse (001)HID Compliant Device (005)HID Compliant Device (007)HID Compliant Device (008)Ran: powercfg \/lastwakeResults:Wake History Count - 0","RAM Specs:F3-1600C7D-16GTXDDR3 -1600  PC3-128008192MBx4CL 7-8-8-24 1.5v","I started the following thread  https:\/\/www.tenforums.com\/bsod-crashes-debugging\/146322-wake-sleep-issue.html#post1792165 and the issue seems related to the following file...Creative driver ha20x2k.sysI do have a Sound Blaster X-Fi XtremeGamer card installed running the latest drivers offered from Creative. That driver is...SBXF_PCDRV_L11_2_30_0012.exe Release date: 25 Jun 19 Filesize: 49.32 MB Sound Blaster X-Fi Series Software Pack for Windows 10 File Name: SBXF_PCDRV_L11_2_30_0012.exe This download contains the driver and application(s) for use with your Sound Blaster® X-Fi™ series of audio devices. For more details, read the rest of this web release note.This download supports the following devices only:Sound Blaster X-Fi XtremeGamer Fatal1ty® Professional SeriesSound Blaster X-Fi Platinum Fatal1ty Champion SeriesSound Blaster X-Fi XtremeMusicSound Blaster X-Fi XtremeGamerSound Blaster X-Fi PlatinumSound Blaster X-Fi Fatal1tySound Blaster X-Fi Elite ProSound Blaster X-Fi EliteSound Blaster X-FiFixes:Fix no audio heard or \"Unable to find audio device\" error, with Windows 10 RS4 (Version 1803) and above.Requirements:Microsoft® Windows® 10 32-bit or 64-bitSound Blaster X-Fi audio devices listed above","Another support thread I started here as well...https:\/\/windowsforum.com\/threads\/wake-from-sleep-issue.247639\/Along with more detailed crash\/BSOD info....https:\/\/www.dropbox.com\/s\/yazs04hymzipz6v\/DESKTOP-6Q2BB6O-%282019-12-13_14-45-39%29.zip?dl=0","Update:I removed the Sound Blaster X-Fi Xtreme Gamer card and reverted to the onboard sound (Realtek HD Audio) and the wake from sleep issue is no longer an issue. System wakes correctly without issue. I'm using the drivers for the Realtek onboard audio from here:https:\/\/codecpack.co\/download\/realtek-audio-drivers.html"]},{"symptom":"Wifi connects to network without my permission        Hello all,I'm in a terrible spot and dont know what to do.Backstory: used to live with my now ex so she had complete access to my router and laptop. When we went our seperate ways I found that my laptop connects to a network that I never set it up to. It's only visible when I'm connected to wifi. I told ATT about the situation and they assured me that nobody would be able to get in to my router even if they had the password (there is a sticker with all the routers information on the router). Months later I figured out the network was still in place. I rebooted the wifi gateway and changed the password on the router but it didnt help. Now, I found a file with all of my phone data on it even though I have not connected it to my wifi in days and i unplugged my router. I stupidly left my google nest and Phillip's Hue hub plugged in so I'm not sure if anyone could get in that way. I have no clue what to do and att is only now coming over to switch out the router. I just need help so I know that the ATT tech doesn't feed me bs. What do I look for? I cannot delete the network on my pc and there's profiles on my pc that I can't get access too. I'm on a Samsung laptop that is older running windows 8. I dont know how my phone data could have transferred to my laptop without being connected to wifi or my phone. I apologize in advance if this doesn't exactly make sense. I'm not very tech savvy and no one will help me. ","solutions":[]},{"symptom":"Haier Y11c Laptop's Touch pad smart gestures not working.        I am having this issue for sometime. I have Haier Y11C Laptop and the smart gestures like double finger scrolling etc of its touch pad  are not working the driver installed for touch pad is FocalTech Pointing device driver. i tried installing other drivers like synaptics and elan but nothing fixed the issue. i also tried rollbacking + uninstalling and re installing the driver but did'nt fix the issue.please help. i am also attaching some pics of the driver.","solutions":["Hi Muhammad. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Update the Touchpad driver from the PC maker's Support Downloads web page, using the full model number.. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you also have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Since you seem to be unsure of the touchpad driver to use, trace the hardware ID as shown here:http:\/\/www.sevenforums.com\/tutorials\/73420-hard... If that doesn't help then enter Device Manager reached by right clicking the Start button, go to Mice > Touchpad and then Driver tab. Choose Update Driver, then Automatic to see if it gets a better driver that resolves the problem. If not try Update Driver > Browse > Let Me Pick to try all previously installed drivers. If that doesn't work then try uninstalling driver, Restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver.See the troubleshooting steps here: https:\/\/support.microsoft.com\/en-in\/help\/402786... Go to Settings > Devices > Touchpad to go over the Settings. Then choose Additional Settings which opens the Mouse properties box. The Touchpad software installs a tab onto it - usually the last one - that should have more settings to check, including a checkbox to Disable Touchpad when USB pointing device is attached. This prevents palm drag from causing the cursor to jumpIf this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Update History, then uninstall them from the link there, and immediately check for these again and hide with the Hide Updates tool explained here: https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...You can also go into Repair Mode by whichever method works here: https:\/\/www.tenforums.com\/tutorials\/2294-advanc... to use the new Uninstall Updates button in Advanced Troubleshoot Options:https:\/\/pureinfotech.com\/uninstall-updates-adva.... You can also use System Restore from within Windows or the above Repair Mode to get back before the problem began, then check for Updates with the Hide Update tool and hide them:https:\/\/www.windowscentral.com\/how-use-system-r...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Umm sir actually you are right this problem arose after an update but that update was of 2018 (most probably 2 December 2018). so silly of me that i didn't uninstall it. so is there any way that i can uninstall an update so old?","Muhammad - It's too old to remove now. But if absolutely necessary you could reinstall Windows to that older version you had then and block future Updates if you cannot do without the feature working.First try all the repairs I suggested to make sure if it can be fixed. If you do not have the latest version Update I would also try that as it can fix many issues to get fully up to date. Check at Settings > System > About. the Version number. If it's less than 1909 then install the Media Creation Tool from this linkhttp:\/\/windows.microsoft.com\/en-us\/windows-10\/m... choosing Download Tool Now, install the tool, open it and choose Upgrade this PC Now. This will save your files and apps while bringing you up to the latest version by the most stable method. It will also bring all of your Updates current and solve most problems since it reinstalls Windows.Then again go over the steps I gave to repair touchpad if necessary, and if it doesn't work consider going back to the last version where it worked properly.Get older version downloads here: https:\/\/tb.rg-adguard.net\/public.phpBurn to DVD using WIndows Image Burner or create bootable flash using one of the options here:https:\/\/www.tenforums.com\/tutorials\/2376-create... follow the gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki..."]},{"symptom":"Windows 10 Laptop BSOD        So Ever since doing a fresh wipe on my hdd and formatting windows I've been encountering repeated bsod problems which i believe is coming from a windows system drive\/file or driver but I cant fix it on my end. I was wondering if anyone could help me with this as this is making my laptop unusable.Some background info: It runs fine on batter power, Sometimes runs fine on ac power but mostly bsod when I use ac power. It Works when using a throttlestop profile, maybe some bad undervolting in the past? im unsure.heres the mini dumps :https:\/\/ufile.io\/lfapwxc4https:\/\/ufile.io\/bkzg7ao2","solutions":["Hi Jovell We need the actual Minidump files, rather than that txt file . . Open Windows File Explorer Navigate to C:\\Windows\\Minidump Zip up the contents of that folder If you have problems zipping those files, copy them out onto your Desktop and zip them from thereUpload the zip file to the Cloud (OneDrive, DropBox . . . etc.) Then post a link here to the zip file, so we can take a look for you . . ."]}]}