{"windows":[{"symptom":"Clock        I want to display the clock on my desktop in large view","solutions":["HiI am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Gadgets in Windows 10 are discontinued. You would have to use a 3rd party software:https:\/\/download.cnet.com\/s\/clock\/Disclaimer:This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"Error 2203.Database: C:\\Windows\\installer\\inprogressinstallinfo.ipi.        I changed the system TEMP folders. But I get errors for every program that wants to install in the Program FilesX86 directory. The Program Files and X86 folders are located in the D: \\ drive. TEMP folder also included. Expression with pictures.","solutions":["I have no idea why you did what you did or how widespread the damage is.Do a System Restore to a date before you had this problem:\"How to Do a System Restore in Windows 8 and 8.1\"http:\/\/www.eightforums.com\/tutorials\/4692-system-restore-how-do-windows-8-a.htmlIf no luck:\"Use the System File Checker tool to repair missing or corrupted system files\"http:\/\/support2.microsoft.com\/kb\/929833?wa=wsignin1.0#manually repair_________________________________________________And these eightforums.com Tutorials are very detailed for problems resulting from SFC Scan:\"How to Run \"SFC \/SCANNOW\" Command at Boot or in Windows 8 and 8.1\"http:\/\/www.eightforums.com\/tutorials\/3047-sfc-scannow-command-run-windows-8-a.htmlRead this Section there in conjunction with the rest of the information they give in above link.   NoteIf SFC could not fix something, then run the command again to see if it may be able to the next time. Sometimes it may take running thesfc \/scannow command 3 times restarting the PC after each time to completely fix everything that it's able to.If not, then run the Dism \/Online \/Cleanup-Image \/RestoreHealth command to repair any component store corruption, restart the PC afterwards, and try thesfc \/scannow command again.If still not, then try using OPTION ONE above to run the sfc \/scannow command at bootIf still not, then you could do a refresh of Windows 8, or run aSystem Restore using a restore point dated before the bad file occured to fix it. You may need to repeat doing a System Restore until you find a older restore point that may work.If still not, then you can use the steps in the TIP box in the OPTION THREE section below to manually replace the files that SFC could not fix.__________________________________________________\"How to Refresh Windows 8 and Windows 8.1\"http:\/\/www.eightforums.com\/tutorials\/2293-refresh-windows-8-a.htmlRefreshing your PC goes like this:The PC boots into Windows RE (RecoveryEnvironment).Windows RE scans the hard drive for your data, settings, and apps, and puts them aside (on the same drive).Windows RE installs a fresh copy of Windows.Windows RE restores the data, settings, and apps it has set aside into the newly installed copy of Windows.The PC restarts into the newly installed copy of Windows._________________________________________________\"How to Reset Windows 8 and Windows 8.1\"http:\/\/www.eightforums.com\/tutorials\/2302-reset-windows-8-a.html\"When you reset your PC, the drive will be completely reset, and all your apps and files will be removed from it. Windows 8 will be reinstalled, and you'll need to change any settings and reinstall any apps that you want to get back after resetting. If you know if any files that you don't want to lose, then you should back those files up before starting the reset\"Cheers.","Wouldn't it be better if I restored the TEMP folders instead? Can you share the original version?","No personal files gets shared here.And if you read my reply, it had this in it:If still not, then you can use the steps in the TIP box in the OPTION THREE section below to manually replace the files that SFC could not fix."]},{"symptom":"Laptop will take more time for shutdown after screen turns off        hi,     I am using windows 10 pro with 64 bit, i3 -7100 CPU with 4 GB RAM configuration , the problem I am facing is when I shutdown my laptop even after the screen turns off the cpu is running ( LED will glow, Fans will run ) for more than 5 Min , how should I solve it ","solutions":["Hi Vamsi It is normal in Windows 10 for the screen to go off a couple of seconds after you shut your PC down, and for your hard drive and CPU to continue working for maybe 10 - 20 seconds after that, but 5 minutes is certainly excessive . . .This process is to facilitate the Fast Startup in Windows 10, because the contents of your RAM are being written to the hard drive in that phase . . .Do you have a lot of background processes running in WIndows 10 - try this to see if this will trim down Windows and the amount of data that needs to be written to the hard drive on shut down:Turn off all unnecessary startup applications and processes: Press Ctrl + Shift + Esc to open Task Manager Click on the Startup Tab See any non-essential items are listed there If so, select and click 'Disable' Close Task Manager Click your Start Button, type msconfig and hit Enter When the System Configuration dialog opens, click on the Services Tab Check the box marked 'Hide Microsoft Services' In the remaining list, see any non-essential items are listed there, uncheck any you findClick Apply and OK Turn off all unnecessary Background Apps Open the Settings App Go to Privacy - Background Apps Turn off any App you do not need running in the background Restart your PC If the above does not make your shut down process faster, try disabling Fast Startup:Click your Start Button, then just type Power Options On the left, click 'Choose what the power buttons do' At the top right, click 'Change settings that are currently unavailable' Under 'Shutdown settings' disable 'Turn on fast startup' Save that and close Control Panel"]},{"symptom":"My Windows 10 update is stuck on 27% for over 8 hours        I don't know what to do, so i decided to force boot my laptop. And it keeps doing it whenever my laptop restarted please help me ","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues while installing updates on your PC. For further clarity on the issue, please respond to the questions below: Which update are you trying to install?How are you trying to install the updates?Which build version of Windows 10 are you using currently? Meanwhile, I would suggest you to refer the article Troubleshoot problems updating Windows 10 and see if that helps. Note: Before performing Check Disk and Clean Installation make sure you take a backup of the user data as there are chances of data loss. Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Your PC can't project to another screen. Try Reinstalling the driver Or Using a Different Video Card        Please help me.........I am not able to project my screen in windows 10 if i press start+p its showing that(Your PC can't project to another screen. Try Reinstalling the driver Or Using a Different Video Card)Previously in windows 8.1 I used to have the same problem but i have thought that after upgrading to windows 10 I would get the new drivers but Its continuing the same problem please guide me how to fix this bug ?","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues with Projecting the PC. For further clarity on the issue, I would like to know the make and model of the PC that you are using. One of the things that you can try is re-installing the drivers for your graphic card and see if you are able to use the feature. Press Windows key + R. This will openRun. Alternatively, you can go to Start and search for ‘Run’.In Run dialog box, type ‘devmgmt.msc’ and hitEnter.Expand Display Adapters.Right click on the Display drivers and click onUninstall.Check the box Delete the driver software for this device.Click on OK.Restart the PC. Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"How to share files between Windows 7 and Windows 10        I've seen a thousand fruitless answers to this simple question.  However I don't see an answer that has even a single response saying \"this worked, thank you\" or \"file sharing between windows 7 and windows 10 is not supported\".  A lot of these posts are years old, so I am giving this one last shot, to see if there is an updated answer on the last day of this decade, before I remove windows 7 from my other PC and install linux hoping for a better outcome.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query between sharing files between two PC’s, and I certainly appreciate your efforts in trying to resolve the issue. Basically, you need to change some settings to enable file sharing between both the PC’s. You can refer the articleFile sharing over a network in Windows 10 and see if that helps. In case you face any issues, then you can refer the suggestions by Roohi_Taj replied on January 8, 2019 and see if that helps. Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Windows Quick Assist \"View Screen\" option is grayed out        Any suggestions on how to use Quick Assist in view-only mode instead of full control?  The View Screen option is grayed out.A number of people have this problem but no answer was posted and the thread was closed.Full control mode works fine, but I don't want to take responsibility for actions on the assisted user's machine, so the View Screen option is needed.  ","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that the View Screen option is greyed out in Quick Assist. I’ll help you with the issue. However, please let us know: Were you able to use the View Screen feature earlier?Are you aware of any changes on the computer recently?Which build version of Windows 10 are you using currently? To check type:winver in the search bar on the Taskbar and hitEnter. I would suggest you to try using a different Microsoft account and check if you are able to get the View Screen option. If using a different Microsoft account doesn’t work, we can try uninstalling and reinstalling Quick Assist and check if that helps. Refer the steps mentioned below: Press Windows Logo key + I, to openSettings.Click on Apps, and select Apps & features.Click on Optional features.Scroll down, look for Microsoft Quick Assist, click on it and selectUninstall.Once uninstalled, click on Add a feature.Scroll down, look for Microsoft Quick Assist, click on it and selectInstall. If you still face issues, try creating a new user account and check if the View Screen option is available.Refer the article Create a local user or administrator account in Windows 10. Let us know how it goes.  Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"WMR Cliff House ONLY: render problem. clear circle in the middle of left eye and right eye is fine.  Seems like a windows mixed reality software problem        Would anyone know how to fix this?  My WMR Lenovo Explorer has this weird distortion.  It looks like only the very centre of the view is rendering properly (mostly).  Like a clear circle in the middle.  Here is a picture https:\/\/ibb.co\/8ckcS4FThe dark outside area of the circle moves as my head tracks, like an incomplete, partially rotating shadow outside of a clear centre circle.  It isn't just the view on the headset screen (more detail  further below). With a little testing, it is only on the left eye view.  And there are a few other issues, like the right eye doesn't show any pointer trails but the 3D effect trails are both showing on the left eye, but only outside of that circle.  When I open a VR app, that little animation between the cliff house and the app is only on the outside of the left eye circle.  It shows up with the Cliff house overlay too.  In a Steam VR Game, if i press the windows button to bring up the windows apps list, the background Steam VR game is fine, but the Windows app list overlay has the circle.  I am confident it is not a headset problem.I ONLY have this problem in the cliff house.  Steam VR works fine, Minecraft (Windows Store game) works fine, and the circle also shows on the desktop windows preview (picture in link above).  As such I can probably live with it, but I didn't mind using the cliff house.  And now only the cliff house is broken.  I wonder if it is a something with Windows and my AMD RX580.  I just updated the driver.  Since it is a problem with only the cliff house, I think it is a windows issue.  Like I said, SteamVR games are fine, and even microsoft store VR games I tried are fine.  It only happens in both cliff houses (house and tower).  I did have this issue happen momentarily before, but a quick restart fixed it.  Now it is all the time.  I did find adjusting the Calibration setting made the outside shadow of the circle change, but it doesn't fix it.  [Adjusting the pupil distance from 59mm to 67mm just moves the shadow circle similar to the way looking around does).  I have tried uninstalling windows mixed reality, and windows is completely up to date (1909).  I am unwilling to try rolling back my AMD Radeon Software Adrenalin 2020 Edition 19.12.3.  Only the cliff house doesn't work . . . in the left eye . . . so weird.  Thank for you help!!  If I can post this bug somewhere I'd do that too.  ","solutions":["Exact same issue and AMD driver set, different headset entirely.","I'm also having this issue. Worked fine just the other day, but updated my AMD RX480 driver today to 19.12.3 and the issue is occurring. SteamVR also works fine for me, though I've found a few games where the issue also occurs such as Pistol Whip. Might try a rollback tomorrow to see if that resolves the issue.","This issue has resolved for me after rolling back to AMD driver version - Adrenalin 2019 Edition 19.12.1. Seems like it might just be a case of some problems in the latest driver update unfortunately. If rollback isn't an option you might have to wait for a patch in the near future.","Thanks for checking that!  I will hope for an update.  AMD link on my phone didn't work until the latest update, and I'd rather keep that working! I don't really stay in the cliff house too long, and the right eye is mostly fine. Thanks for confirming the rollback fixed it!  ","Yes same problem on lenovo and Dell so its seems too be a driver problem, I'm using a vega 56, hopefully AMD are aware of the issue, I just load straight too steam VR for now.","i have test 19.12.3 (bug), 19.12.2(same bug) and 19.12.1 (no bug) with RX 5700 XT and rizen 5 3600X.","I have the same issue with Samsung Odyssey+. I have opened a thread on AMD forums where multiple people reported the same problem with the new AMD driver in combination with WMR headsets:https:\/\/community.amd.com\/message\/2944342?q=samsungAs it was suggested in the AMD forum thread, we should open an Online AMD Service Request ticket so that AMD becomes aware of the AMD\/WMR issue:https:\/\/www.amd.com\/en\/support\/contact-email-formS ","This is a MASSIVE bug that will cause lots of confusion. Is Microsoft aware yet?Bug also is happening for me with RX 5700 GPU and Ryzen 5 3600 CPU."," I have an RX590 and had the same issue, try turning off Radeon image sharpening and display scaling. Then reboot your pc.Seemed  to do the trick for me.","I have the same problem Windows 10 (Up to date), AMD Vega 56 with latest AMD GPU driver (19.12.3) + Lenovo Explorer WMR. It used to work fine before the upgrade."]},{"symptom":"Unable to print using HP Envy 5055 printer        when I print a test page it works fine. but when I try to print excel document it does not print.any suggestions?thanksFranco Goodman***Modified title from: i have a new HP ENVY 5055 printer***","solutions":["Hello! I am an Independent Advisor, I would love to help you out! When you get to the print dialog\/settings in Excel is the correct printer selected? Could you take a screenshot and send it here?Do you get any error messages? Is the printer set as the default printer?","Hi Franco, Thank you for writing to Microsoft Community Forums. I understand that you are unable to print using HP Envy 5055 printer. I’ll certainly help you with this issue. However, please let us know: Are you facing this issue only while printing Excel documents?Do you receive any error code\/message?Were you able to print documents earlier? Meanwhile, I would suggest you to try running HP Print and Scan Doctor on your computer this will diagnose the issues with Printing. You may also want to try reinstalling the drivers from HP website: https:\/\/support.hp.com\/us-en\/drivers\/selfservice\/hp-envy-5000-all-in-one-printer-series\/14095644\/model\/14095768. Try installing the recommended drivers and check. For additional information, see HP Windows 10 Support Center - Printing andFix printer connection and printing problems in Windows 10. Let us know how it goes. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Button for open Queue, in printers and Scanners part of settings in win 10, virtually blocked        The button, that does appear, for opening the printer queue, is visible but cannot be clicked - due to the name of the next printer being highlighted when the mouse pointer is over where the \"Open Queue\" button is!We were trying to clear or delete the entire queue, of documents no longer needed, but could not - even though we could see the button, we could not click it, or clicking on it made windows 10 think we wanted the next printer instead.","solutions":["As a work around, the Open the Printer App, done by HP, was able to get me to the queue for what I wanted.  But still curious to hear if anyone else has [a] encountered the same problem or [b] fixed the problem or [c] Patch or update WILL fix the problem!","Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.Sorry that this is happening and I know how frustrating it is to have some glitches in your PC. It's a known issue mostly to Win Pro versions 1903 and later. You could refer to this thread:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Unfortunately, Microsoft has no solution for this yet. But some users in the thread has a workaround and possible solution. You could use TAB to highlight the button then press Enter or the one you mentioned for now.To have this noticed, it is advisable to make a feedback in Feedback Hub app so hopefully it will be fixed in future updates.I hope this answers your concern.","The interesting thing is that I have quite a few Windows 10 1903 Pro machines, and this is the FIRST time I've noticed the behavior\/bug.  But thank you for mentioning the keyboard way of getting around the mouse problem, I'll try that.","Correction, I've just checked one of the Pro machines, it is 1909, my bad.","After reading about the difference between being non-admin and being admin, playing on one machine I have, the non-admin \"button virtually blocked\" issue does arise, but not with every printer driver!  On another machine, it is with EVERY printer, regardless.If you wanted to remove the Print to PDF Microsoft driver, how it this done, there is no remove button?","Hi, I'm sorry for the delay of response. You can disable the Microsoft to PDF temporarily but of course, disabling it will also temporarily lose your PC's ability to print something to pdf directly. You can go to Control Panel> Program and Features> Turn Windows features On or Off. Just look for Microsoft Print to PDF and uncheck it then restart your PC.I am not so sure if it will fix the issue as I read others that it didn't. But if you really want it disabled for the time being, then you can try it if it will make you click the open queue button."]},{"symptom":"want to upgrade to latest version of windows        what is it going to cost me to upgrade and can my existing computer run the latest version?","solutions":["The free upgrade was only ever for 7, 8 and 8.1 Retail and OEM licenses.You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700Cheers.","what is it going to cost me to upgrade and can my existing computer run the latest version?Hello,Which edition you're on, right now?Regards.","Windows 8.1 single language Prod ID0079-40480-19710-AAOEMIf I remember I upgraded to win 10 but one of my main programs Geojot core was slow on compatibility so we went back to win 8. Now I an sort of ready to upgrade. ","want to upgrade to latest version of windows The latest version is Windows 10I have already explained what the free upgrade to 10 was for:The free upgrade was only ever for 7, 8 and 8.1 Retail and OEM licenses."]},{"symptom":"Query related to upgrading to Windows 10 from Windows 8.1        I am on Windows 8.1. and want to upgrade to Windows 10, which I bought.  I have no idea how to start the process on my PC - what do I need to do?    thank you***Original title: how do I upgrade to Windows 10 - where to I click to begin the process?***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query related to upgrading to Windows 10 on your PC. For further clarity on the issue, I would like to know, from where you purchased the license of Windows 10. Since you have already purchased the license for Windows 10 you can go ahead and perform an in-place upgrade to upgrade the PC to Windows 10. I will share the article that you can follow to upgrade to Windows 10. Here is the articleHow to perform an In-place Upgrade with Windows 10 Step-by-Step Guide In case if you face any activation issues after performing the upgrade then please refer the articleGet help with Windows activation errors In addition, you can also get in touch with the Technical Support team for further assistance with the issue. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Help me diagnose this Blue Screen please (Minidump included)        HelloIn the past, you have been extremely helpful to me, helping to analyse blue screen error dumps I had. I very much appreciate that.Now I have another dump file with a possibly different cause, please help me analyse this one as well! Thank you very much!I believe I had no third party security software installed and I suspect Oracle Virtualbox's networking driver could be the cause but I'm not sure.So far I was able to pull multiple strings referencing to a driver - power state issue,but it is called HDAudBus (sound card?) and I'm confused. I never had issues with my sound card, which is the internal one for this notebook. (Lenovo Ideapad 330s-15IKB 81f500gyhv , Intel (R) Core i5-8250u,  8 GB of RAM, 1 TB of HDD, AMD RADEON 540)Some extract from the dump file (full file attached)fffff803`0e9c14e0 48894c2408      mov     qword ptr [rsp+8],rcx ss:0018:fffff803`124087b0=000000000000009f0: kd> !analyze -v********************************************************************************                                                                             **                        Bugcheck Analysis                                    **                                                                             ********************************************************************************DRIVER_POWER_STATE_FAILURE (9f)A driver has failed to complete a power IRP within a specific time.Arguments:Arg1: 0000000000000004, The power transition timed out waiting to synchronize with the Pnp    subsystem.Arg2: 000000000000012c, Timeout in seconds.Arg3: ffffa6875d6d5040, The thread currently holding on to the Pnp lock.Arg4: fffff803124087e0, nt!TRIAGE_9F_PNP on Win7 and higherKEY_VALUES_STRING:     Key  : Analysis.CPU.Sec    Value: 12    Key  : Analysis.DebugAnalysisProvider.CPP    Value: Create: 8007007e on OL2-L    Key  : Analysis.DebugData    Value: CreateObject    Key  : Analysis.DebugModel    Value: CreateObject    Key  : Analysis.Elapsed.Sec    Value: 38    Key  : Analysis.Memory.CommitPeak.Mb    Value: 72    Key  : Analysis.System    Value: CreateObjectADDITIONAL_XML: 1BUGCHECK_CODE:  9fBUGCHECK_P1: 4BUGCHECK_P2: 12cBUGCHECK_P3: ffffa6875d6d5040BUGCHECK_P4: fffff803124087e0DRVPOWERSTATE_SUBCODE:  4IMAGE_NAME:  HDAudBus.sysMODULE_NAME: HDAudBusFAULTING_MODULE: fffff803315d0000 HDAudBusPROCESS_NAME:  SystemBAD_STACK_POINTER:  fffff803124087a8STACK_TEXT:  fffff803`124087a8 fffff803`0ea9f2d6 : 00000000`0000009f 00000000`00000004 00000000`0000012c ffffa687`5d6d5040 : nt!KeBugCheckExfffff803`124087b0 fffff803`0edaf946 : fffff803`12408a10 00000000`0000005a fffff803`0943f800 00000000`00000001 : nt!PnpBugcheckPowerTimeout+0x76fffff803`12408810 fffff803`0e86ba89 : ffff838e`3b367230 0000010e`b90849cb 00000002`00000002 ffffa687`5cb41000 : nt!PopBuildDeviceNotifyListWatchdog+0x16fffff803`12408840 fffff803`0e86a7e9 : 00000000`00000010 00000000`00989680 00000000`0043ae42 00000000`0000005a : nt!KiProcessExpiredTimerList+0x169fffff803`12408930 fffff803`0e9c5024 : 00000000`00000000 fffff803`0943c180 00000000`00000000 fffff803`0ed91400 : nt!KiRetireDpcList+0x4e9fffff803`12408b60 00000000`00000000 : fffff803`12409000 fffff803`12402000 00000000`00000000 00000000`00000000 : nt!KiIdleLoop+0x84IMAGE_VERSION:  10.0.18362.476STACK_COMMAND:  .thread ; .cxr ; kbFAILURE_BUCKET_ID:  0x9F_4_IntcDAud_IMAGE_HDAudBus.sysOS_VERSION:  10.0.18362.1BUILDLAB_STR:  19h1_releaseOSPLATFORM_TYPE:  x64Thank you very much!Oliverhttps:\/\/www.dropbox.com\/s\/yv0jdn525nwgb9g\/010220-63593-01.dmp?dl=0","solutions":["Hi, The error points to the IntcDAud.sys: FAILURE_BUCKET_ID: 0x9F_4_IntcDAud_IMAGE_HDAudBus.sys The IntcDAud.sys is an audio component of the Intel display driver. Can you ensure the following Intel VGA driver is installed: https:\/\/pcsupport.lenovo.com\/ca\/en\/products\/lap...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Cortana problem        When I start to type into Cortana it goes off before I finish.  Any help please?ThanksSteve","solutions":["Hi Steve, Windows Cortana is Microsoft’s virtual digital assistant. Most of the time, she’s online and a pleasure to work with. But sometimes, she stops working, often for what seems like no reason at all.Please check this article for possible solution on your issue: https:\/\/www.lifewire.com\/fix-cortana-4151935Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","When I start to type into Cortana it goes off before I finish.  Any help please?ThanksSteveHello,Try re-registering Cortana. Perform these steps:1. Open Windows PowerShell as administrator.2. Then type following command and press Enter key:Get-AppXPackage -Name Microsoft.Windows.Cortana | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Let the command complete.3. Close Windows PowerShell and see if the issue is resolved now.Reference: https:\/\/www.kapilarya.com\/how-to-reinstall-or-re-register-cortana-in-windows-10Let us know if this helps! Note: Included link in this reply refers to blog post by a trusted Microsoft MVP."]},{"symptom":"Windows 10 Performance Issues        Hello Microsoft Community,I am having some performance problems on my Acer Aspire 3. The CPU usage is always at 100%, sometimes the hard drive usage is also at 100%, I found corrupted files when using sfc \/scannow. The processor is AMD A4, which is a processor I have never used before, as I always used Intel. It’s only new, so I don’t know why I have already got these problems. Also, for some reason, whenever I shutdown\/restart\/update the PC, it just says “Just a moment…” which is a pain, because I don’t know what the computer is doing sometimes. Does anyone have any advice for me? Thanks, MicrosoftUser3487","solutions":["Hi MU. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Guardian Moderator here to help you.1) At any time you can do the gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... The reason I suggest this first is because no one who has done the above install has ever come back to report problems that I have seen.2) Until then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 3) Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.4) For high CPU and hard drive usage see here: http:\/\/www.thewindowsclub.com\/fix-100-disk-usag...https:\/\/www.cleverfiles.com\/howto\/100-disk-usag...https:\/\/www.kapilarya.com\/fix-windows-10-high-c...https:\/\/www.makeuseof.com\/tag\/fix-high-cpu-usag...5) If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I did go and check for updates, and it says that I can update it to the November 2019 feature update. Will updating to this fix some problems, or make things worse? I am doing another SFC scan to see what it brings up now. I will continue going through your checklist too.Cheers! MicrosoftUser3487","Hi again - You can update to the latest version by the most stable method following Step 5 above. This may resolve everything since it reinstalls Windows while keeping your files, apps and most settings in place, solves most problems, takes about an hour.I'll be here to help as needed.","Hello again. I have decided that I should try and update to build 1909. Hopfully this will stop most of the problems I have been having. I ran sfc \/scannoe 3-4 times and have cleared up all the errors. Unfortunately this didn't really change anything. I had another look at the task manager and I can see that my antivirus software, task manager itself, background services, and \"System Interrupts\" use up all the CPU. I'm not sure if there is anything I can really do about it. Hopefully this update works. It's taken 5 hours to download!Kind Regards,MU3487"]},{"symptom":"Blank Windows Spotlight?        The \"Windows Spotlight\" background feature that changes itself by day, which was working perfectly fine for me a few days ago, now shows this: Other options work just fine.Is my \"Windows Spotlight\" stopped working? I don't know if this happens on other PCs, since it is internet based.[UPDATE] I forgot to mention that I got this... maybe an hour or two, after this event happened in my Kaspersky:This \"malware\" thing is a messaging application's screen snip plugin, which does no harm to the system. I have no idea right now but that could be what damaged Windows Spotlight.You know how powerful Kaspersky is when it is able to even \"dig\" such small utilities from a \".wim\" image in an ISO that it considers as \"not-a-virus:...\"","solutions":["Hi uEFImaster Go into the Settings App - Personalisation - LockScreen Set Background to picture and choose one Then open Windows File Explorer and paste each of these into the Address Bar Delete everything in each folder %USERPROFILE%\/AppData\\Local\\Packages\\Microsoft.Windows.ContentDeliveryManager_cw5n1h2txyewy\\LocalState\\Assets%USERPROFILE%\/AppData\\Local\\Packages\\Microsoft.Windows.ContentDeliveryManager_cw5n1h2txyewy\\SettingsThen right click your Start Button, choose Powershell (admin) Run (copy and Paste) this command and hit Enter Get-AppxPackage -allusers *ContentDeliveryManager* | foreach {Add-AppxPackage \"$($_.InstallLocation)\\appxmanifest.xml\" -DisableDevelopmentMode -register }Restart (not shut down) your PC Go into the Settings App - Personalisation - LockScreen Set Background to Windows Spotlight","The \"Windows Spotlight\" background feature that changes itself by day, which was working perfectly fine for me a few days ago, now shows this: Other options work just fine.Is my \"Windows Spotlight\" stopped working? I don't know if this happens on other PCs, since it is internet based.[UPDATE] I forgot to mention that I got this... maybe an hour or two, after this event happened in my Kaspersky:This \"malware\" thing is a messaging application's screen snip plugin, which does no harm to the system. I have no idea right now but that could be what damaged Windows Spotlight.You know how powerful Kaspersky is when it is able to even \"dig\" such small utilities from a \".wim\" image in an ISO that it considers as \"not-a-virus:...\"Hello,I recommend you to re-register Windows Spotlight and see if it helps:https:\/\/www.kapilarya.com\/how-to-re-register-windows-spotlight-in-windows-10Let us know if this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP."]},{"symptom":"How can I delete the shlext64.dll if it's Access is denied?        Please find Windows Prompt below . . .","solutions":["Press Shift+Restart to boot the machine into Safe Mode, then delete the file.","Take ownership of the file and then you can delete it.This link tells you how"]},{"symptom":".jar files        I was trying to download some things for games and I accidentally changed what they should open with and now I cant change it back to the original thing, meaning that whenever I download a .jar file it will automatically try to open with Internet Explorer and when I try to change it it doesn't show me the option to go back to the default one, and I can't reset my P.C. because I will loose some stuff. I use windows 10 by the wayThank you for your time!~Finnian","solutions":["Hello. Is this the way you tried to change the default opening program? .jar files I guess should be opened with Java or a .zip\/.rar program. https:\/\/support.microsoft.com\/en-us\/help\/4028161\/windows-10-change-default-programs","Hello! I am an Independent Advisor, I would love to help you out! Do you know what application it defaulted to before? Where are you trying to change it back to the default from? You can right click the file and choose open with and find the app that you want to open it with.Or you can go to settings > apps> default apps > choose default apps by file typeThen scroll down to .jar and choose an application.","Yes except it didn't really work, it didn't show the thing I wantedIs there a way to reset settings on Windows 10?Also I'm trying to change what a file opens with","Um I'm not really sure but every time I would open a .jar file it would bring me to file explorer but now It brings me to Internet explorer, the wrong explorerAnd I'm trying to change it so that every time I click on a .jar file it doesn't bring me to Internet Explorer and whenever I try to change it back to opening with File explorer it doesn't show up as an application that is available","Hi SplayWharf348 My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Try re-installing Java. Hope this helps.","Okay thanks I'll try it and see if it works!","Where would I find Java in my computer because I cannot find it","Okay so I don't have Java installed should I install it?","Hello. I guess we need to find out what you want to happen when you click on the .jar file. .jar files are usually games and they are compressed in the Java Runtime Environment. What happened when you clicked on the .jar file associated with file explorer? Did the game open? Did it take you to a specific directory the game was in? Do you want the game to open?https:\/\/www.lifewire.com\/jar-file-4138386","Try downloading from https:\/\/www.java.com\/en\/download\/ and installing..jar files will be associated to the Java program after installation."]},{"symptom":"HP Laptop system shutting down at 50% without warning        I am having issue with my HP laptop shutting down at 50% without any given warning.  I have tried a quick fix to troubleshoot the battery life by un-installing all the battery items listed on \"battery\" and un-installing the Microsoft ACPI Compliant Control Battery back and re-installing it back on my system.  To my dismay, I observed the battery life extend from 84% to 91% but now I ham having issues with my system shutting down without any warning.  I also have been observing a pop up message when I scroll over the battery that reads \"89% available (plugged in, but not charging)   HELP!","solutions":["Hi, how old is battery? Some batteries begin to die after just 1-2 years. Please ask HP about battery calibration tool. Seems one battery element lose its capacity. In this case battery need to be repaired or replaced.","Hello Mona,There's something wrong with your HP Battery itself or in the Hardware of your HP Laptop in Battery. Please perform a few steps that i will give it to you that it might fix your problem.first,1. Shut Down your PC2. Remove your Battery connected to your HP Laptop3. Place it back again and make check it if its properly placed.4. Turn On your PC.5. Plug your charger6. When it loads all your drivers and applications, go the Taskbar and navigate to the icon of your battery and click it or drag your mouse it in. it will pop up a message and check it this shown in the screen'(Plugged In, Charging)'If the problem is still persist, go to the Authorized Technician of HP to check the Battery if its need replacement or they will check the socket if there's an hardware issue related.Hope it helps.","The battery is 4 yrs old. Original battery that came with the laptop. I've done several collaborations on the battery. The battery% increased from 50% to 90%, but now I am getting a message saying (94% available, plugged in but not charging)."]},{"symptom":"I get a code 740 saying program requires elevation.        When trying to install a program for Time2 Outdoor Surveillance Camera using BTHub6 download I get a message saying program requires elevation, and a code message 740. Is there a solution to this please?","solutions":["Hi CPPZW Right click the installer for that software then from the resulting menu, choose 'Run as Administrator'Do you still get that 740 error?"]}]}