{"windows":[{"symptom":"Standard English spell checking and German keyboard in OneNote etc.        I would like default English in all Office Applications. For that I changed the Windows language to English (as I have to?), which automatically changed the keyboard to English too, which I don't want because the physical Keyboard of my Notebook is GERMAN (which I cannot change and don't want to change). So when I switch the Keyboard back to German, the spellchecker in OneNote changes to German too - which is annoying, because most of my text is English (that's how it is in science) ... So what can I do: German Keyboard and default English spelling in OneNote?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.Spellcheck is associated with the Keyboard layout you are using. As German words and English words have different spellings, the spellcheck won't work for English when you are using German keyboard layout.Spellcheck only recognizes the words for current Keyboard layout (German).However, you can switch keyboard layout from German to English by pressing Windows+Space keys together and verify the spellings in English."]},{"symptom":"Unable to log in to Windows 10 - incorrect password        I restarted my computer and now I am unable to log in (I have windows 10).  It keeps telling me that \"the password is incorrect.  Try again.\"  I am using the same password I have used since purchase six weeks ago.  To give a history of yesterday, my daughters friend downloaded a program (I don't know what one) that would convert youtube videos.  When I switched on later that day there was a whole lot of random ads that kept popping up so tried to remove chrome and wasn't able to do. So I did a system restore and still had problems so restarted the computer and now cant get back on as I am unable to log in.  Prior to restarting I had run a scan using my microtrend product and it had said that there were no viruses.  Please help.","solutions":["Hi, torsin My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to enter the safe mode with the network function to repair, it may be that the network controller is outdated.Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. As soon as you see the Windows logo with the rotating dots, press and hold the power button until the computer turns off. Do this process twice..-Turn on your computer for the third time, and let it load. .-You should receive this message: Preparing Automatic Repair. After entering Mode Update the network driver may be outdated"]},{"symptom":"system does not support Hardware digital Rights Management        befor you say new pc is there anything i can do to fix this core i5 3470 amd radeon 8570 and a 4k hdr display","solutions":["Hi,Please can you provide more information, what is the issue you are experiencing?","I did a video playback troubleshooting it tells me no 4K playback and no HDR my screen resolution goes all the way up to like 4 something the 2160","What are you trying to stream on? I believe Netflix's DRM was added for Kaby Lake (7th gen intel CPUs) and later.","... my screen resolution goes all the way up to like 4 something the 2160How about your graphics card?(And what does 4K resolution have to do with DRM?)","Common Sense will tell you I'm giving you a general idea of what's going on between what the troubleshooting is saying and what I have I appreciate if you don't repost half of something I post and inject your comment","I appreciate the help so I'm going to say this slow for all the  ( technicals) I was unable to turn on HDR in Windows 10 so I thought hey I have a 3rd gen core i5 maybe that's it  so then I ran the video playback troubleshoot the troubleshooting results were can't play 4K videos your PC doesn't support hardware digital Rights Management ( HWDRM ) you can still play high definition (HD) and standard -definition (SD) videos upside down but you get the picture I want to know is that something I can fix in settings  or I have to upgrade my PC ","Hardware DRM is restricted by it's minimum requirements at a hardware only level. If you don't meet the minimum specs for it you can't enable it. Software based DRM solutions can sometimes be supported by changing settings but hardware based DRM is GPU driven. For Windows 10's Hardware DRM, the PC requirement is any of: NVIDIA GeForce 1000 series or higher AMD Radeon RX 400 series or higher Intel UHD Graphics 600 series or higher (Kaby Lake 7th gen or later) For more information please visit: https:\/\/support.microsoft.com\/en-gb\/help\/404054...You don't need a new PC, just a supported graphics card."]},{"symptom":"Mouse without borders        I have had a win7 laptop and a win10 laptop using MWB for about 3 years and no problems or issues.  It's time to disconnect my win7 machine and get it off line.  So, is it necessary to uninstall MWB from both machines.....I've read about issues with trying to uninstall the app and don't want to mess with it if I don't have to.  At present I use a KVMP switch to go from machine to machine and all is great.  I plan to remove the Win7 machine from KVMP...….and done.  Any issues if I leave MWB on the Win10 machine? Or on the Win7 machine if I don't need the connection anymore?  Thanks in advance for your insight and help.","solutions":["Moved from Garage to Windows."]},{"symptom":"Updating to Windows 10 - Do I have to reinstall all other programs after install?        I have to update to Windows 10 from Windows 7.  Will I have to reinstall all the programs I have on the computer like Office 365, FTR Reporting and others as well as device drivers?","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.No if you use the upgrade route, it will keep all of your app and documents. Please see this article for details: https:\/\/windowsreport.com\/windows-10-free-upgra...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Photos Import Frerezing        Hi, I am having trouble importing my photos from my Iphone. Everytime I open the app on my Laptop and try to import from a USB, the laptop starts its search for photos to import. Once it has found all the photos, the app mostly freezes, I am unable to even cancel the search. The only thing I can do is close the app. Sometimes the app gets through to the selection area where you can choose out of the photos it has found what to import, but after clicking import I am only confronted with a notification saying something went wrong and the files may not have been imported. I have tried both repairing and resetting the app in the system preferences, also I have resarted the laptop, however, these have not been much help. Is there anything else I can do? Thank you in advance for any help!From Tommy","solutions":["Hi Tommy, How do you connect your phone to your Laptop? If it's wired, then try other USB ports as it may affect the transfer rate as well.(or change your cables) Most likely, freezing is caused by interference between connection on your Phone and your Laptop.If all of these steps are already taken, most likely there's a software that may interfere your transfer such as firewall\/anti virus as well.Please double check this fields. Please let us know if you need further assistance. Thanks and regards,","Hi Richard,Thank you for such a quick reply on your end! Sorry for the late reply on mine! I connect my iPhone with a cable, I have tried two different cables and two different USB ports. You mentioned there might be a software that may be interfering with my transfer, how do I go about finding if this is the case?Best, Tommy "]},{"symptom":"Can't Change Child's Password on Windows 10        From the thread with the same header, I conclude hat despite having administrative rights I cannot change the password of my child without connecting to my Microsoft account.THIS IS ILLEGAL:I never asked for a Microsoft account (it is a complete violation of my privacy rights) and forcing me to use it to access functions I am entited to as a roduct owner is simply ILLEGAL.CAN YOU LEGAL TEAM PLEASE CONTACT ME or I will file an official complaint.YOU ARE JUST A BUNCH OF CRIMINALS.Thanks for your follow up.(BTW: if you refuse follow up, I will post this criminal behavior all over the place)","solutions":["Hey there, Erik De DeckerWelcome to the Microsoft Community forums. To change your son's password for his local account on your PC, you could have right clicked onto start > Power Shell (Admin) > typed the following: net user username newPasswordThis would reset the password on the local account. To contact Microsoft's legal team please reach out to them via this link: https:\/\/www.microsoft.com\/en-us\/legal\/compliance\/integrityAs we can not help you further on this community, I am going to lock this thread. Thanks, Regards, "]},{"symptom":"Reset stuck at 34%        I started a PC reset and it has been stuck on 34% for almost 2-2.5 hours.The laptop I am resetting is an Acer Aspire 5 with a dual SSD and HDD (128 SSD and 1Tb HDD) with 8 GB of RAM and an I7 intel processorIs it normal with these specs to be stuck on this?Also, is there something I can do to stop it without corrupting windows, files, etc?","solutions":["Hi Harrison Has that reset been running for 2 - 2.5 hours or stuck on 34% for that time? It would be best to give that another half an hour to see if the percentage increases . . .If that percentage still has not increased, then you will have no choice, press and hold the Power Button on your PC fro 5 - 10 seconds to perform a hard shut downWait a couple of seconds, then start your PC up again, that reset should then roll back, this will take time, but should get you back into your PC . . .","I would leave it longer, the only other alternative would be to press and hold the power button but as there is the risk of it not starting again then wait.If you are still at the same point after 5 hours then forced power off is the only option, power on again with fingers crossed.If it fails the power on and there's no automatic repair then press and hold the power button to force power off.Start up again and do the same.On the third start leave it to see if it goes into recovery.Post back the result.","I have the same issue. I am doing a reset on an ASUS i7 Gen 7 with HDD annd 8GB RAM. The reset is stuck at56% for 16 hours. I left it over night just to see if there is any change in the % but still stuck at 56%. Will it be OK then to stop it and see what happens. I don't know how long else to leave it to run.","Update: The system has reset itself and is installing windows. Just had to wait a littlelonger","Hi Harrison,How long did your reset take? My has taken 17 hours and still stuck at 56%.","As per my previous post powering off is risky, it may recover but you need to be ready for if it doesn't.","Good to hear it worked out okay.","Mine took around 3-4 hours. I can't remember now.Hi Harrison,How long did your reset take? My has taken 17 hours and still stuck at 56%.It too"]},{"symptom":"What does \"DataSenseLiveTileTask\" do?        I have this task listed as scheduled in Task Scheduler, but it has never run. What does it do?I am aware that \"DataSenseLiveTileTask is a Windows-based file\" - I'm looking for information about what specifically it does.","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.It is used to monitor your internet connection usage, please see this previous answer for details:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Regards, Ross","Thanks Ross, That is helpful information - I wish that page ranked higher on searches!Mine shows that it is scheduled but has never run. I'm unsure what to make of that - is this something that should be running? From other threads it seems like it might be part of a debugging process, and not necessarily required to ever run.","As it's a system process, it's best just to leave it as it is. It will run when required. I'm not sure of the exact circumstances of when it's required but there is no harm in leaving it to do its thing.Regards, Ross"]},{"symptom":"MWB        Do I need to completely remove MWB if I do not need the multi pc connectivity anymore?  ","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Please see this article for details: https:\/\/support.malwarebytes.com\/docs\/DOC-1034Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Ross thanks for your response.  I think I should have been more explicit....my question relates to Mouse without borders.","Hi George, No problem, in that case you just need to run the MSI setup file again and select uninstall.Or goto control panel, find MWB in the list and click uninstall. Regards, Ross"]},{"symptom":"Time lag an hour on Windows 10 reboots        Dear sirs, each time Windows 10 starts and I enter as administrator the clock is an hour before the correct time.  I live in Italy and the hour is GTM +1 as Berlino, Vienna and Stockholm. I've tried to set the  automatic hour setting but without success. I have a notebook with windows 10 but the issue doesn't occur. Can you help me?SincerelyEnrico DiniFirenzeItaly","solutions":["Hi EnricoDini and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.1. Press the Windows key, type in \"Control Panel\" and press enter. 2. Change the view by small icons. 3. Look for \"Date and Time\" and click. 4. Click the \"Internet Time\" tab. 5. Click \"Change settings\". 6. Check \"Synchronize with an Internet time server\" and click \"Update now\". 7. Click the OK button. I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Hi EnricoDini, Please check the attached image below for your reference. Thanks!","Hi EnricoDini, Please check the attached image below for your reference. Thanks!I've followed your instruction but Windows 10 warns about an error that doesn't let the clock synchronization - Timeout.","Sorry, probably a server issue occours. Now The synchronization is ok. now I reboot the system.","Ok, the problem is solved.Thanks a lot.Enrico Dini","Hi EnricoDini, I'm glad that your issue has been resolved. Don't hesitate to let us know if you will have other queries.Regards."]},{"symptom":"Can not activate windows 10 home        I had a hard drive go bad bought new one and then i went to reinstall windows but i installed wrong one . My computer was running 10 home and i installed windows 10 pro by mistake. Now i am trying to reinstall 10 home but having a hard time","solutions":["Hi Paula Yes, you will need to reinstall Windows 10 and make sure you install the Home edition, because you will not be able to activate Windows 10 ProWhen you say you are having a hard time, what difficulty are you encountering, does the installation process keep installing the Pro edition, or is it something else?If the installation process is just installing the Pro edition, you need to add a file to the USB installation drive ...Right click your Desktop, choose New - Text Document Paste the text below into that document [EditionID] Core [Channel] Retail Then choose File - Save Aa, at the bottom of the Save As dialog, change file type to 'All Files' then save that file as ei.cfg (note you must manually add the cfg file extension)Then copy that ei.cfg file into the Sources folder in your USB Installation MediaThen when you begin the Installation, you should be asked which Edition you want to install . . .Also, at the beginning of the installation, there is a tick box 'Use preferred settings for this PC' untick that box . . ."]},{"symptom":"Activation of a Poduct Key Code        Purchased a refurbished desktop(HP). The CertifiedMicrosoft certificateon the systemdidnotwork. Called intoMicrosoft & receiveda newproduct key codeforaWindowsPro. Thisnewcertificate willalso not activate fortheoperatingsystem. WHY?","solutions":[]},{"symptom":"File Explorer        Suddenly the file tree disappeared in File Explorer. Following all instructions from prior postings relating to this problem, including a reboot, the tree did not reappear. I've had several decades experience with various Windows, and for the life of me, cannot fathom this sort of problem\/glitch cropping up at this time. Within the past few months, I purchased a Lenovo Extreme running Windows 10 since Windows 7 is no longer being supported. I have many gigs to relocate and, without a functioning tree on the left hand side of the screen, this computer is pretty much garbage.","solutions":["Hi Rob Please try the solution proposed on this thread by Samystus: https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"Bluetooth headphones not showing on PC correctly        I purchased a pair of Sony WH-1000MX3 headphones about half a year ago and when I first got them, they were fine. I did however experience one problem, which was that they wouldn't automatically connect to my PC when the bluetooth was on. So I unpaired both PC and headphones and deleted all the drivers on the PC and then restarted. Since then I have not been able to connect my headphones to my PC via bluetooth. But when they do show up in the bluetooth list, it's as an 'Other Device' so I can't use it.","solutions":["Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.If bluetooth in your PC can't detect your device. There are ways to troubleshoot this problem.1. Go to Start, type and click on services.msc 2. Look for Bluetooth Support Service then right click to choose Properties 3. Under Startup type, set it to Automatic 4. If Service status is \"Stopped\", make sure to hit Start 5. Click Apply and Okay then close Services window I hope this helps. If above steps didn't work, please let me know so I can provide more troubleshooting steps for you to try.","It was already on and set to automatic. Sorry for long reply."]},{"symptom":"external hard drive folders into onedrive for online use.        I have many GBs of photos on an external Hard drive.  I want them in Onedrive.  I cannot simply copy via file explorer as I don't have enough room on my computers C drive to do this ( location of my Onedrive folder ).  is there anyway to do this operation short of using the \"view online\" link through the Onedrive app on my windows computer and simply copying from the external hard drive into the pictures folder of Onedrive ( which is now open in a browser window via the app)?  and if I do it this way, I am making a copy of those files correct?  they would stay in Onedrive whether ext HD is connected to my computer or not.  and if i made changes to either the Ext HD or the files in the Onedrive folder they would be independent of each other in the opposite location.  i.e.  deleting a file from ext HD later would not delete it from Onedrive?","solutions":["Hi Dave Yes, the simplest method is to log into OneDrive in a web browser, then drag that data into a folder on OneDrive:https:\/\/onedrive.live.com\/ it will take time for those to transfer across to OneDrive . . .Please Note: create a new folder on OneDrive for those files, do not drag those into the existing Pictures folder or any other user library folder on OneDriveThat will create a backup of those files on OneDrive that is separate form the normal OneDrive Syncing and whether or not your external drive is connected to your PC . . ."]},{"symptom":"Error while installing Windows        Trying to install Windows 10 November Update on Acer Nitro 5 AN515-54 on 128 GB SSD from usb drive. After I choose to install on ssd, Windows start to copying files and then after about 10 seconds error message box appears with message to retry installing from beggingThings I have already done:1) Bootable USB with GPT part and FAT32 fs.2) Disabled secure boot, fast boot.3) Set AHCI to SSD Mode.4) Don't have the Legacy option in Boot modeWhat else can I do?","solutions":["Hi SobakaRyszhay I'll try to help you out. Here is what I suggest : - Recreate a new USB key with the Windows tool - check the BIOS (be sure that UEFI mode is enabled) - try to install again If this doesn't work, I suggest to extract the SSD (if possible), then format it from another computer. And then try again. (The \"original\" format may cause some issue with the installation process).I'll wait for your news Regards"]},{"symptom":"Windows video editior poor after sales        HiI purchased Windows video etitor full version but within one day realised it was far too advanced for me so i contacted them and asked if i could cancel it. Despite sending another 2 emails to them at *** Email address is removed for privacy *** I have not received a reply. I think the after sales service is disgusting.RegardsPete Clinch","solutions":["There Microsoft Photo App build into Windows 10 which is free , I am not sure what app you are referring to and where did you purchase it?Did you purchase it from Microsoft Store?","Hi PeterClinch, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Additionally, try to handle it by this means https:\/\/support.microsoft.com\/en-us\/help\/10558\/...Let me know if you have something else that I can help you with, I'd be happy to help.Happy Holidays Regards, Marc M.","HiI purchased Windows video etitor full version but within one day realised it was far too advanced for me so i contacted them and asked if i could cancel it. Despite sending another 2 emails to them at *** Email address is removed for privacy *** I have not received a reply. I think the after sales service is disgusting.RegardsPete ClinchThis is what i purchased.Windows Video Editor -  - Full Version.This is who i contacted fur support*** Email address is removed for privacy ***} but have not received any reply.","Hey Peter, there is no such product as the \"Full Version\" of the Windows 10 Video Editor (the real Video Editor is free, as previously mentioned). Do you have a link to the product page you can share so I can go about reporting this? Searching the Microsoft Store, I am unable to find any app by that name."]},{"symptom":"Headphones not working        Recently my Realtek Audio dissapeared and Nvidia is the only one left in the device manager my high definition audio controller is now getting a error 10 and i have no way to listen to audio except for through hdmi I have tried deleting and reinstalling the drivers for the audio controller and Realtek after that did nothing i did a full windows reinstall and that didnt help either ","solutions":["Hi Nao______ I'll try to help you out. So you already tried to uninstall reinstall the driver, but no improvement. Have you tried the audio troubleshooter ? You can find it by right clicking on the \"volume\" icon in the task bar. About the driver, did you let Windows reinstall it by itself, or did you download it from the manufacturer's website ?I'll wait for your news Regards","I cant troubleshoot because the headphones do not show up in the troubleshoot menu. I have both reinstalled the drivers via windows and the manufacturer.Thanks","Ok, Can you give me the exact model number of your laptop ? (or desktop) I'll check if I can find something else. What you can do by the time is trying to rollback the latest update of windows (it may be related to an update). Check in windows update (in the settings)."]},{"symptom":"Photos App        Does anyone know how to select and move multiple photos from the library to the storyboard at the bottom ?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. You may refer to the following article regarding this. https:\/\/answers.microsoft.com\/en-us\/windows\/for...","Thanks but I cannot see any solution in the tread ? Can you confirm this is still not resolved ?","It appears that many users have reported this. Drag and Drop multiple pictures is not a feature in Photos app. However, it will be updated very soon.","Thanks but I cannot see any solution in the tread ? Can you confirm this is still not resolved ?Gopi Lal  theeng ","Do you have the photos you want in the Project Library? Have you selected them? Drag them to the story board or usePlace in storyboard. See image below. Click on, tap or activate image to enlarge it.","Hello,With my previous version of Photos, I used to be able to select more than one photo to move them to the storyboard but not with this one. And I have more than 3000 photos to select for this album. I can't select them one by one.Do you know how I can get the same \/ previous version of Photos like you have ?","On my Desktop I have Windows 10 with all updates and on my Laptop I have Windows 10 Pro with all updates. Both are Dell computers.I don't recall seeing what your image shows. My Laptop Version is shown here.I am on my Laptop now and here is what is showing for Creating an Album. I choose the photos first and then click on Create.","Horace has showed\/explained a screenshot of the correct UI! Yes, this feature does exist :) When selecting in the project library, you can also use keyboard commands like Ctrl+A to select in bulk.Tyma, is looks like you are on an out-of-date version of the app. I suggest confirming a) you are connected to the internet b) your version of Windows is up-to-date c) your version of Photos is up to date (by visiting the Microsoft Store and checking for updates). Make sure you don't skip step b; users on older versions of Windows won't see the most up-to-date versions of Photos in the Store if they haven't updated."]}]}