{"windows":[{"symptom":"New Motherboard. Unable to activate with Online account, nor find a product key from Microsoft purchase through Paypal. What do I do?        Quick overview of situation;Purchased and activated Windows 10 Pro Retail on a previous build. Upgraded motherboard for a new build, and wanted to deactivate on the old and activate on the new. I did; slmgr.vbs \/dlvslmgr \/upkslmgr \/cpkyThat's all I found in terms of steps to deactivate a product key. I thought that my key was digital since I ordered it online. Otherwise I've found no receipt showing me my product key.So I boot up windows installer on new computer, and proceed to log into my online account the key is registered to, I think. On the Microsoft site, it shows my new build as all green, and registered.The old build reads as \"To be filled by O.E.M.\", which I don't know what that means. On the new build I go to Settings > Activation > 0xC004F213 as Error code. Activation > Troubleshooting > Changed Hardware Recently > My PC does not show up there as a way to reactivate.I've been trying to contact support so I can hopefully provide Order Number and info (Installation ID?) from the \/dlv command and they can report back to me my Product Key if I have one. But my Order History on Microsoft site shows the order of Windows 10 Professional, and I would just like to get it setup on the new PC.","solutions":["Phones could be found at https:\/\/support.microsoft.com\/en-us\/help\/405170... Awfull, I've never heard about 20 hour wait. Please check if there is separate phone number for activation.","Yes, this version IS standalone and transferrable but you should get your product key. Do you keep confirmation e-mail from Microsoft? In some cases phone support may give you new key."]},{"symptom":"importing photos        I imported photos to my computer. It said it located 800 pictures. It then does nothing. All there is , is a cancel tab. What do I do from here?","solutions":[]},{"symptom":"Is CMOS invalid danger for hardware or data saved on the Laptop?        Is CMOS invalid danger for hardware or data saved on the Laptop?* Moved from Community Participation Center* Original title: CMOs","solutions":[]},{"symptom":"Windows 10 1903 no sound over hdmi (intel audio graphics)        hi,i have a nevest intel drivers, on the previous version of windows everything was working.Now on teh 1903 when i'm plugin in a hdmi display for the first time the sound is good. But when im changeing the resolution, play a game on full screen, or unplug and plug again the hdmi there is no sound.Some screens:audio driver for hdmi output:","solutions":["Hi Tomasz My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.I suggest you to run the Audio troubleshooter and check if it helps. http:\/\/windows.microsoft.com\/en-us\/windows-10\/f...If the issue persists, then try to uninstall and re-install the audio driver. Press Windows Logo Key+X. Click on Device Manager. In the list of hardware categories, look for the device that you want to update, and then right-click on it to Uninstall.Follow onscreen instructions to uninstall it. To re-install, either you can restart the system or install the driver from the manufacturerís website (recommended as they will have updated drivers).For reference: Try all the steps provided in the link below and check if it helps. Fix sound problems: http:\/\/windows.microsoft.com\/en-us\/windows-10\/f...Click Start > Settings > Privacy > Microphone Toggle on Allow apps to access your microphone When complete, restart your computer then check if audio is working again. Press Windows key + X Click Device Manager Press Windows key + X Click Device Manager Click the machine name at the top Click Action menu Click Scan for hardware changes See if the sound controllers appear at the bottom. If not, click the View menu then click Show hidden devices Expand Sound, video and game controllers Right click your audio adapter Click Properties Click the Driver tab Is there an option rollback? If so, click it. Further troubleshooting steps you can.. Open Start, type: change sound card Hit Enter Select Communications tab Choose Do nothing If there is an 'Enhancements' tab, click on it then check the box to 'Disable all enhancements'.Press Windows key + R Type: services.msc Hit Enter Scroll down to Windows Audio Double click it then change Startup type to ‘Automatic’ Click Start Click Apply then oK.","nope, it's doesn;t work at all.any other ideas?i think that windows is brokeing my drivers and i don;t know how to fix that :(","There seems to be some early adopter issues at this time with Windows 10 1903, if you can, I recommend you wait a bit until Windows 10 1903 matures with future cumulative updates.Open Start > Settings > Update & security > Recovery > under Go back to my previous version of Windows 10, click Get started.or Press Control + Alt + Delete Click Sign out At the Sign In screen, hold down the shift key on your keyboard while clicking the Power button on the screenContinue to hold down the shift key while clicking Restart Continue to hold down the shift key until the Advanced Recovery Options menu appearsClick Troubleshoot Click Advanced options Click Go back to the previous version of Windows Windows Update might attempt to upgrade to Windows 10 1903 again. See instructions how to block it:https:\/\/www.groovypost.com\/howto\/block-windows-...Information in the above link is sourced from a trusted Microsoft MVP blog.","Same issue here with intel HD graphics 4600 and up to date drivers, actually it happens with older or newer drivers it does not matter. The issue just started with 1903, which I upgraded just a day ago and since the upgrade I have been looking for a solution to this. While listening to music or streaming audio, the audio suddenly just stops with no errors at all. After this point, I could not find any way to get it back to working state. Audio device troubleshooting does not resolve the issue either. The only way to resolve this is restarting my computer, but after that the same cycle begins. This happens so frequently that the computer turns useless. In 2 hours I had to restart my PC 3 times because of this.In the sound device settings, for my HDMI device, the volume bar does not show anything at all when I play something while the issue is in place. I tried this on two different ports: HDMI and mini Displayport and the same result with both of these.Since I use my computer only over the HDMI port, I will switch back to older version of Windows 10 now, see you later 1903, when this issue is resolved.","I am having the smae issue: no output from intel cpu hdmi output!When will this be fixed? Its open since June!!!!","I have the same issue in Win 10 1903 with Intel HD 4600 and Radeon HD8790M switchable graphics on a Dell Laptop.","After a lot of searching I found a newer version for HD4600:https:\/\/forums.laptopvideo2go.com\/topic\/33123-2019155070-1540xx-4th-and-5th-generation-haswell-broadwell-cherry-trail-windows-10-windows-81-windows-8-windows-7\/After this I typed the below in an elevated Command prompt:BCDEDIT \/SET DISABLEDYNAMICTICK YESIt has been good so far following a reboot. More info on the above command here:https:\/\/www.techpowerup.com\/258611\/windows-10-1903-has-a-nasty-audio-stutter-bug-microsoft-hasnt-managed-to-fix","Sorry guys, the HDMI audio keeps working till the PC goes into sleep. It starts working again after a reboot","I have the same issue ever since the Windows 10 Build 1903 for a few months now.  System configuration is a Gigabyte BRIX connected to a Sharp TV -  SHARP HDMI (Intel(R) Display Audio) driver version 10.0.18362.1 dated 3\/18\/2019.Symptom:  Audio works for several hours, and after works the device\/driver is no longer available (disappears), and a restart of the system corrects the issue until it is no longer available again.A few cumulative updates for Windows 10 Build 1903 have been available and installed since the release of the latest build, but neither has corrected the problem thus far.I guess we'll just have to wait for a cumulative update that will finally resolve the issue.","I forgot to mention that since 1903 I unable to bitstream over HDMI. Cannot get Dolby Digital, output over HDMI is stuck in stereo. "]},{"symptom":"clipboard        where do i find items on my clipboard","solutions":["Hi Tim It depends on your version of Windows 10, press the Windows Key + V on your keyboard, does that bring up the Clipboard App, if so that is where you will find thoseIf that does not bring up the Clipboard App, click your Start Button, type winver and hit EnterOn the resulting dialog, what Version No. and build No. of Windows 10 are you running?","win v works but how do i see what's in there i click on it and it disappears ","Hi Tim That clipboard app should show you a preview of the items on the clipboard, do you not have that?In Word or some other application click on a spot in the document, then click an item on that Clipboard App and it will be pasted into the document . ...","i see the item in clipboard when i click the item clipboard goes away","Hi Tim Do you have Microsoft Word installed on your PC? If so, open a new document, then click into that document, then open the clipboard app and click an item, is that pasted into the document?","no ms on my computer can i do it with g mail","Hi Tim Yes, I just checked that, it does work on Gmail, click into the body of the Email, then open the clipboard and click an item, it will be pasted into that Email . . .","where?","Hi Tim ."," thanks win v in gmail works to see the items how do i save them somewhere else"]},{"symptom":"My child's content and app limits are not working        Hi,In Windows 10 I have been using app and content limits for my child's own profile on one computer for the last two months and they've been working great (!) until this last week.I've tried all of the fixes noted here: https:\/\/support.microsoft.com\/en-us\/help\/4026901\/microsoft-account-fix-screen-time-limits-not-workingBut none of these helped. I've tested it myself and even after playing with all of the settings on my profile and his (removing time completely, adding time, requesting time, etc.), nothing has worked and his profile allows him to jump onto Minecraft for however long he wants. That said, the other content limits are working (limited website access, etc.), so everything else seems to be fine - it's just with limiting time on Minecraft as an app.Would welcome any guidance - thanks!","solutions":["Hi NomadSKY My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.It might be worth checking the following article https:\/\/kidlogger.net\/blog\/parental-control-in-...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Hope this helps."]},{"symptom":"How to COMPLETELY disable windows automatically resizing & snaping: W10, W7        This issues is making me insane and ready to purge these OSs from the machine.  I have two workstations that have been upgraded to W10 .  There is a very annoying (to me) 'feature' that when I left click and hold on the top of a window (in order to move it) it automatically goes to full size of my display.  I have to click the 'double rectangle' icon to get it back to its original size. This is *REALLY ANNOYING* (I also have a W7 that has the same behavior).Browser windows seem to be especially affected in that the behavior happens all the time. It also happens with application software (Word, PP, etc) but sometimes I seem to be able to grab the top window area without it jumping to full screen.  I have also run a number of anti-virus anti-malware programs (Malware-bytes, Adaware, MS Security, Kaspersky AV, BitDefender) on my machines and have not found anything.I have searched (googled) quite a bit and it seems all the wisdom points to turning off Aero-Snap byGo to Control Panel.Click on Ease of Access link or Ease of Access Center icon.Select Change how your mouse works or Make the mouse easier to use option.Tick the check box for Prevent Windows from being automatically arranged when moved to the edge of the screen with the mouse under “Make it easier to manage windows”I have done this and while it disables the snap to edge issue, it DOES NOT solve the resize to full screen issue.What do I have to do to COMPLETELY TURN OFF ALL the windows resizing\/snapping behavior i both W10 and W7????Please???anyone???  TYVM!","solutions":["To address your concern, can you try turning OFF the \"Arrange windows automatically by dragging them to the sides or corners of the screen\" option inSettings? Here's how:1. Open Settings.2. Click System then click Multitasking.3. Toggle \"Arrange windows automatically by dragging them to the sides or corners of the screen\" toOFF under Snap.Let us know how it goes.Thank you."]},{"symptom":"Windows update 1909 is Broken when it come to gaming.        First of all i have called support they are no help.1. My system was running fine till they pushed out update 1909 and my pc started to crash every time i was playing GW2 and seem to be limited to that Program.  Till i got fed up and reinstalled windows thinking that this was the issue. 2. After reinstall same thing crashing on GW2 still and now have move to other games.3. Third reinstall of windows reinstalled all drivers are update and still Crashing. Checked drive health good, Power supply is good have played some games with no issue other games crash with in minutes for start or don't start at all these are games i have never had issue with till 1909, I have never had gaming issue till 1909. I started looking and i find a lot of threads on 1909 with no resolutions attached to the 1909 updates. Either their is and issues with 1909 or MS doesn't know what the issue is.  IF you do a search for windows 10 1909 gaming crash you can see all the threads are locked down. yes this is an issue and we need a fix. ","solutions":["lots of older games no longer work on 1909 update and black screen or crash and microsoft dont seem to be doing anything to remedy the disaster that they created and is stead fastly getting worse since version 1803 which was the last good update for gameing.  Microsoft needs to revert a lot of the changes that they made since then."]},{"symptom":"Unable to log into my Windows 10 local account        Hi,I activated my Windows 10 using my email account (not Microsoft) and created the first user using this email. This email is tied to the Office 365 account.Then I wanted to create a local admin user, but for some reason whenever I try to login with this other user I do not see it.net user command shows that the local administrator user exists, but when I open c:\\Users\\ I only see user created with the email.I do not see the local user.How can I log to Windows 10 using my local user?Thank you,Igor","solutions":["Glad to be of assistance!"]},{"symptom":"Reset Windows 10 Error Code \"There was a problem resetting this PC. No changes were made.\"        I need to reset my laptop back to factory conditions because Windows can't open any pre-installed applications. I have done both local reset and cloud download reset and each time, I get the above mentioned error. As far as I can tell, there are no corrupted system files.Windows version: Windows 10 Home 2004 OS build 19041.1 Installed on 12\/11\/19 (I had it on Insider Preview for a little until this problem came up then I took it off)Laptop build: Lenovo Ideapad 330S 15IKBx64 bit operating system, x64 bit based processor.","solutions":["Hi JoshuaDunahoo My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.1. Type \"cmd\" in windows search bar 2. Right click on \"Command Prompt\" 3. Select \"Run as Administrator\" 4. Type \"sfc \/scannow\" without quote and press ENTER Then: 1. Type \"cmd\" in windows search bar 2. Right click on \"Command Prompt\" 3. Select \"Run as Administrator\" 4. Type \"DISM \/Online \/Cleanup-Image \/CheckHealth\" without quote and press ENTER 5. Type \"DISM \/Online \/Cleanup-Image \/ScanHealth\" without quote and press ENTER 6. Type \"DISM \/Online \/Cleanup-Image \/RestoreHealth\" without quote and press ENTERHope this helps."]},{"symptom":"Cursor doesn't work, it freezes        Whenever I boot up Roblox, I can play a little bit before my cursor freezes on the spot in-game, rendering it unplayable...is this an issue with ROBLOX or Windows? I can't play the game and my friends are sad that I can't play because I can't play. It works on normal desktop, not on ROBLOX. Same on the app and ROBLOX Player. Help me!!!","solutions":[]},{"symptom":"Can not factory reset my pc        Okay so my brother received a new laptop for school and gave me his desk top. It is an HP Pavilion 20 all in one desktop with 4gb of ram, a dual core processor, well it turns out it is only pushing half of what it has. So I went to factory reset it so I could sell it because I like gaming and this is not the pc for me. Turns out it is missing allot of what it needs to factory reset it. I do not know what to do. I do know it originally had windows 8.something and when they let WND8 be upgraded to windows 10 he did it.  There is no windows 8 files no recovery disk. I do not know what this jackass did but the state he left it in is garbage. HOW CAN I GET IT BACK TO NORMAL??? and no I do not have CD, DVD, OR USB. I do have some experience working with Running Commands on Windows and Linux on a step by step basis. I have decent download speed. Just wanted to put all that because I assumed assumptions would be made and questions would be asked so there is the whole deal. can anyone give me some advice? ","solutions":["Hi Thatdreamer1 My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help answer your question.Try using Reset this PC Windows 10 has a built-in method for wiping your PC and restoring it to an ‘as new’ state. You can choose to preserve just your personal files or to erase everything, depending on what you need.Go to Start > Settings > Update & security > Recovery, click Get started and select the appropriate option. Then follow the on-screen instructions to restore Windows 10 to a factory fresh state.Hope this helps."]},{"symptom":"DISPLAY SHIFTS TO THE LEFT        Whenever I restart the computer the display is shifted to the left, I can see it starting during the restart, the Dell logo is off center, to the left. I have to go into settings when it's back up then change the display resolution and then click revert to have where I want it, 1280 x 720. Any ideas?","solutions":[]},{"symptom":"Windows 10 Home will not detect second monitor        I am using an AMD radeon HD 5450.  I worked great on my Windows 7 machine.  Put it in this new Windows 10 machine and both monitors are on an displaying but windows 10 says second monitor not detected.   I have uninstalled the drive in the device manager and restarted the PC and it apparently reinstalled the adapter but same situation.Why wont Windows 10 detect the second monitor?  Thanks for the help","solutions":[]},{"symptom":"Unable to change BitLocker password        Hi everyone,I am using Windows 10 Pro with an admin user connected to my Office 365 (I am logging in using my email, which is not Microsoft email).BitLocker is enabled by default, but I do not see the option to change the BL password, nor do I see the option to ask for password upon boot.Can you please help?Thank you,Igor","solutions":["Hi Igor My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Method 1: Change BitLocker Password from Windows Explorer Right-click on the BitLocker encrypted drive in Windows Explorer, and select Change BitLocker password from the context menu.Note: if the encrypted drive shows a gold lock on the icon, then you can’t see the “Change Bitlocker password” option in the context menu, and you need to unlock the BitLocker drive first.Enter the old password, followed by the new password (entered twice), and then click Change password.You should see a message that the password has been changed successfully in the same window.Method 2: Change BitLocker Password from Control Panel Open the Control Panel and select Large icons in the View by drop-down menu. Click BitLocker Drive Encryption.Expand the drive for which you want to change the BitLocker password, and click Change password from the list of options.When the Change Password window appears, type your old password and new password. Click Change password.Now you’ve changed your BitLocker password. Method 3: Change BitLocker Password Using Command Line Open the Command Prompt as administrator. Assuming you’re going to change Bitlocker password for drive D:, type the following command and hit Enter.manage-bde -changepassword d: You’ll be prompted to enter the new password twice. Note: your password won’t be shown while you’re typing.When the password has been successfully changed, you can close Command Prompt. Every time you boot into Windows, you can unlock the BitLocker drive with the new password.Hope this helps.","Hey Jon,Thanks for your help.I think we will have to be a bit more creative here. Please see the attached screenshot. I do not even have the option to change the password.When I try using command prompt, this is the message that I get:ERROR: There are no password key protectors on volume C:.Type \"manage-bde -protectors -add -?\" for more information about adding apassword key protector.","Choose Manage Bitlocker option and see what the status of Bitlocker is (whether it is on or not).","Did that already. It is on, but not offering the option to set or change password (see the attached photo).Funny thing is that there is a ribbon stating that some of the settings are managed by the admin. I am the admin. No one else has access to this computer, but me.","Press Windows key + R type gpedit.msc Browse to Local Computer Policy, Computer Configuration, Administrative Templates, Windows Components, Bitlocker Drive Encryption and go through all the options and see if anything is set to anything else other than not configured.","All is Not configured (see attachment please).","I would suggest reading through the following article to ensure Bitlocker has been set-up correctly.https:\/\/hardsoft-support.kayako.com\/article\/55-...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"windows 10 home, no video editing option        I recently got my windows 10 home, but when I went on the photo app, there was no option to create a video. only two options. I've only just got my windows 10 home, I haven't updated or did anything what so ever.","solutions":["Hi NabilKhedarun, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Follow the official instructions of the community to create videos through the Photo app.https:\/\/support.microsoft.com\/en-us\/help\/17205\/...https:\/\/support.microsoft.com\/en-us\/help\/27916\/...Let me know if you have something else that I can help you with, I'd be happy to help.Merry Christmas Regards, Marc M.","Hi again, There is no video creating option in the photos app, there is only edit and draw options.no option to create a video.","Hi, I understand, is to create a totally new video, the application allows the creation of new videos, through existing videos, however, you can make your new recordings by this application:https:\/\/www.microsoft.com\/en-us\/p\/windows-camer...How to use webcam to record video and take pictures in Windows 10 https:\/\/www.thewindowsclub.com\/use-webcam-recor...Regards Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hey Nabil, can you please go to ... > Settings and share your app version number (found towards the bottom of the page)? I suspect you are on an older version of the app. It would also be helpful to know your Windows version...press Windows key, type \"win ver\", and press enter, and a dialog should appear showing your version number, which you can then share here. Thanks!","I have this same problem.  App version is 2019.18114.19418.0  Win version 1903 18362.535"]},{"symptom":"INSTALLING I-CLOUD FOR WINDOWS        I installed the \"I-Cloud For Windows 10\" through the MS Store. When I attempted to use the app, I received error message saying that it had not installed correctly, and I needed to uninstall\/reinstall. When I went to Control Panel>Programs & Features to locate the app, it was not there. It is apparently referred to as \"I-Cloud Outlook\" in the list. Thinking that it was already uninstalled, I went back to the MS Store to re-install. When I selected the \"Download\" button, it said \"this app is already installed\" and provided a LAUNCH button. I opened the app, and selected an option and proceeded to click the APPLY button, which was grayed out. I closed the app and went back to Control Panel>Programs & Features and discovered that it is not listed among the other programs. I did upload some photos to the UPLOAD folder from my PC, and they did appear on my iphone. I am unsure if the app is fully functional. I did go through the Media Features process to uninstall\/reinstall WMP.  Can any one shed light on this?  Jeff","solutions":["Hi JeffA My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Press Windows key + I Apps Look for iCloud in the list of applications and see if you have the option to uninstallHope this helps.","Yes. It is there. Shall I uninstall?","It may be worth trying that if you want to ensure it is installed correctly.Uninstall, restart PC then download and install from the Store.","Jon: That appears to have fixed the problem. Thank you!","Great news thanks for letting me know :)."]},{"symptom":"im not forsure what dose this mean should i be worried ?        Log Name:      ApplicationSource:        ESENTDate:          1\/11\/2020 1:22:27 PMEvent ID:      455Task Category: Logging\/RecoveryLevel:         ErrorKeywords:      ClassicUser:          N\/AComputer:      DESKTOP-0E5Q2HHDescription:svchost (6056,R,98) TILEREPOSITORYS-1-5-18: Error -1023 (0xfffffc01) occurred while opening logfile C:\\WINDOWS\\system32\\config\\systemprofile\\AppData\\Local\\TileDataLayer\\Database\\EDB.log.Event Xml:<Event xmlns=\"http:\/\/schemas.microsoft.com\/win\/2004\/08\/events\/event\">  <System>    <Provider Name=\"ESENT\" \/>    <EventID Qualifiers=\"0\">455<\/EventID>    <Level>2<\/Level>    <Task>3<\/Task>    <Keywords>0x80000000000000<\/Keywords>    <TimeCreated SystemTime=\"2020-01-11T19:22:27.992627200Z\" \/>    <EventRecordID>51319<\/EventRecordID>    <Channel>Application<\/Channel>    <Computer>DESKTOP-0E5Q2HH<\/Computer>    <Security \/>  <\/System>  <EventData>    <Data>svchost<\/Data>    <Data>6056,R,98<\/Data>    <Data>TILEREPOSITORYS-1-5-18: <\/Data>    <Data>C:\\WINDOWS\\system32\\config\\systemprofile\\AppData\\Local\\TileDataLayer\\Database\\EDB.log<\/Data>    <Data>-1023 (0xfffffc01)<\/Data>  <\/EventData><\/Event>","solutions":[]},{"symptom":"Windows can't identify network        My computer used to have frequent blue screen errors, I tried many fixes but nothing worked so I decided to reset my PC (I kept my personal files). When the reset was done I could access Microsoft Edge without problems but the internet button has the \"no internet connection\" icon. Meanwhile apps like Chrome, Steam, etc work perfectly. It's like windows thinks am not connected but I clearly am. I have tried many fixes but none worked. I would use windows tips but it thinks I don't have internet. I'd appreciate any help that doesn't resolve in me having to reset my pc again.PS: I have tried reinstalling drivers and resetting my network. Also origin doesn't recognise my internet connection either if that helps.","solutions":[]},{"symptom":"RESOLUTION IS POOR        JUST UPDATED MY DELL PC BUT THE RESOLUTION IS POOR ALTHOUGH I ADJUSTED IT ALREADY. WHAT SHOULD I DO ?","solutions":["Hi Taleena That update must have corrupted you video card device driver, the best option is to go to the support page for your PC, on the Dell website, then from there, download and install the video card device drivers they recommend for your PCIf you have any difficulty locating that support page, what is the exact Model No. of your Dell PC - that will be printed on a sticker on the bottom casing . . ."]}]}