{"windows":[{"symptom":"Windows 10 active hours        Hello, I have some pc's that are using the 1607 LTSB windows version. On these machines the maximum number of hours that you can set as active is 12 and I have set the active hours from 8am to 2am.Also I have set the computers to restart every Monday at 5am.However I noticed that some of these machines are rebooting around 10am and some at 8pm.Now I understand the fact that they would restart at 8pm because the active hours have reached their maximum limit, but why would some of them restart at 10am?I have searched online and found from random websites, reports, that windows do not respect the active hours setting at all if you surpass the 12 hour limit.Is that the case? Is there an official Microsoft release about that?","solutions":["Hey there, MakisXanthis,I am Jamie, a temporary windows amateur here to help!Apologies for my grammar (if there are any mistakes)You have a 12 hour limit and set for 8am-2am, which is a total time of 18 hours.You should know that 18-12=6 hours above your specified limit.What is above is not indicatng that you are not smart, this is me stating facts (Hop you're OK with that!)Also, may you provide info as to why your PC's are \"randomly rebooting\" themselves?I will be happy if i can find a solution to your computer difficulty!Jamie :)(P.S, this is the longest response i have ever written in this community!)","Hi Makis, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.You would get a better answer of your question on Technet as LTSB isn't a consumer release which is supported here.https:\/\/social.technet.microsoft.com\/Forums\/en-...","Thank you Sumit","Helo, MakisXanthis, Jamie here again.Any solutions?"]},{"symptom":"Unable to get Windows Updates on my PC        I cannot get any updates installed on my PC.Ran the updates troubleshooter and after an hour is still showing \"checking for pending restart\"I have McAfee set to \"automatically install updates\" but last update was months ago and I just noticed it today.","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command promptDISM \/Online \/Cleanup-Image \/RestoreHealthRun these commands on the command prompt to restart windows update servicesnet stop bitsnet stop cryptsvcnet stop wuauservnet stop msiserverRen C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.old net start bitsnet start cryptsvcnet start wuauservnet start msiserverAfter successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartThis should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","William, try going to the McAfee website, download the McAfee uninstaller, completely uninstall McAfee. Try updating without McAfee. You can always reinstall McAfee later. Also check if you have any other anti-virus programs listed in your Start list. Even if you have not used them try uninstalling them with the manufacturers uninstaller program.Then retry updates.In your next answer confirm here what Win 10 build you are on and what updates you are attempting to install please."]},{"symptom":"How do I disable palm-check on my trackpad?        I have an HP Pavilion x360 Convertible 14m-dh1xxx laptop. I need to use the keyboard and the mouse at the same time for some tasks, yet I cannot find a way to disable palm-check. I start typing and my trackpad stops working. How can I fix this?","solutions":["You will need to check HP support website and look into manual of your device.Normally, you will need to press combination of keys like Fn and other key to disable it.Take a look at:http:\/\/support.hp.com\/","Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.Do you mean you want to disable the touchpad from sensing your palm movements? You can try to turn on Enable or Disable touchpad feature and disable touchpad while you are typing and using an external mouse.https:\/\/support.hp.com\/us-en\/document\/c03882926Please let me know if I can help you further! Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi! I am trying to use my trackpad and my keyboard at the same time, but when typing, the trackpad stops detecting my actions. I am trying to make both work at the same time.","I'm sorry for getting your intent incorrect. Please check if your laptop comes with Synaptics settings. If so, please try to disable Smart Sense.https:\/\/www.addictivetips.com\/windows-tips\/disa...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"BSOD \"BAD_POOL_CALLER\" caused by \"fwpkclnt.sys\"        Hello Recently my PC which is 1 month old started getting BSOD \"BAD_POOL_CALLER\" I tried to do something ; i check my RAM,  updated windows and all drivers but it didn't help.Here is link to onedrive with 3 minidump files caused by the same file.https:\/\/1drv.ms\/u\/s!Ar-GPjtOCiRMizd_gWzAQAwaZCrQ?e=1lFF5cI would gladly appreciate any help.","solutions":["Hi Rafal, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.All the three crash dumps point to a tcpip.sys driver issue which might indicate a misbehaving network driver. Let us try finding the same.Let us try finding any misbehaving driver Enable Driver Verifier: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...(Must create a Restore point before) Upload the newer dumps when you get Driver_Verifier_detected_voilation. Please note that the system might crash before you reach the desktop-if it does please let us know so that we can guide you to disable Verifier.Technical Information: ffffca8d`d06e6198  fffff805`29e48194 tcpip!IppReceiveHeaderBatch+0x2f4","OkI did it and \"Driver_Verifier_detected_violation\" appeared and then windows returned to Restore point.Here is link:https:\/\/1drv.ms\/u\/s!Ar-GPjtOCiRMizvroNgTAML-1zpv?e=LvGddV","Thank you. Apparently driver verifier was unable to catch the misbehaving driver. Continuous tcpip.sys and netio.sys were refrenced, however.As a first step, I suggest you to reinstall your network driver and see if the issue persists.Secondly, do you have a downloader software? PROCESS_NAME: LastChaosDownloader_PL.exe","Ok i installed newest drivers from manufacturers site. I hope it will help.\"LastChaosDownloader_PL.exe\" is a video game downloader which my little brother wanted to play.","Means it isn't a constantly running background program. Let us know how that goes and if it BSODs again."]},{"symptom":"How to change title and description of power options?        I would like to change title of power options in start menu.I did try some experiments with some .dll.mui files (ShutdownUX.dll.mui and powrprof.dll.mui for instance) and registry keys but I couldn’t even the odds.Does anybody knows exact way on non-US localized Windows? ","solutions":["Hey User919, Evan here an independent adviser here to assist you. A picture is worth a thousand words....here's a link to the CMD prompt info you need:https:\/\/winaero.com\/blog\/rename-power-plan-wind...Please let me know if this helps...I'm interested for myself as well. Also, don't forget to open CMD prompt as admin or you won't be able to make the change.","Hey User919, Evan …Hi Evan,you mistakenly interchange power plans with power options. I want to change power options likeShut down to Turn off, Sleep to Go to sleep, etc."]},{"symptom":".Minecraft for windows10 インストールしましたが起動できません、対策などわかりませんでしょうか？ [Mod translation-I installed Minecraft for windows10 but can't start it, don't you know how to fix it?]        20326241699863118135MoAppCrash使用不可0Microsoft.MinecraftUWP_1.14.105.0_x64__8wekyb3d8bbwepraid:App1.14.1.55df99aaeMinecraft.Windows.exe1.14.1.55df99aaec00000050000000001947cb3\\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\Temp\\WER41AD.tmp.dmp \\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\Temp\\WER4298.tmp.WERInternalMetadata.xml \\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\Temp\\WER42B8.tmp.xml \\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\Temp\\WER42B6.tmp.csv \\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\Temp\\WER42E6.tmp.txt\\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\ReportArchive\\AppCrash_Microsoft.Minecr_7b7c2ea314b6549025bf01cf1a49e6747975_92ef0587_4d2b73e0-e8ce-49e2-b64d-02710854ad48080806051-16e2-46e3-a2bd-a25fd6bbb4132684354568a4c10fe2d4aa2973c3554e9cde846850","solutions":["What happens when you try to launch the game?  Are you running with latest version of Windows 10 with no pending updates to the system or the game?","Thank you for your reply.[Mojang] Ends with demo screen onlyAll drivers have been updated.Windows 10 is installed after formatting the PC.I did it many times, but the symptoms are the same.Apps and software are only available for [Minecraft Windows Edition].PC is old, but we think that we can work, but ...pc specsThink Pad W520CPU i7-2820QM HD graphic 3000RAM 8GBGPU Quadro 2000MEvent Log-<Event xmlns = \"http:\/\/schemas.microsoft.com\/win\/2004\/08\/events\/event\">-<System>  <Provider Name = \"Windows Error Reporting\" \/>  <EventID Qualifiers = \"0\"> 1001 <\/ EventID>  <Level> 4 <\/ Level>  <Task> 0 <\/ Task>  <Keywords> 0x80000000000000 <\/ Keywords>  <TimeCreated SystemTime = \"2020-01-09T04: 28: 44.605027400Z\" \/>  <EventRecordID> 657 <\/ EventRecordID>  <Channel> Application <\/ Channel>  <Computer> DESKTOP-HV9L87S <\/ Computer>  <Security \/>  <\/ System>-<EventData>  <Data> 2032624169986311813 <\/ Data>  <Data> 5 <\/ Data>  <Data> MoAppCrash <\/ Data>  <Data> Not available <\/ Data>  <Data> 0 <\/ Data>  <Data> Microsoft.MinecraftUWP_1.14.105.0_x64__8wekyb3d8bbwe <\/ Data>  <Data> praid: App <\/ Data>  <Data> 1.14.1.5 <\/ Data>  <Data> 5df99aae <\/ Data>  <Data> Minecraft.Windows.exe <\/ Data>  <Data> 1.14.1.5 <\/ Data>  <Data> 5df99aae <\/ Data>  <Data> c0000005 <\/ Data>  <Data> 0000000001947cb3 <\/ Data>  <Data \/>  <Data> \\\\? \\ C: \\ ProgramData \\ Microsoft \\ Windows \\ WER \\ Temp \\ WER1134.tmp.dmp \\\\? \\ C: \\ ProgramData \\ Microsoft \\ Windows \\ WER \\ Temp \\ WER1404.tmp.WERInternalMetadata.xml \\ \\? \\ C: \\ ProgramData \\ Microsoft \\ Windows \\ WER \\ Temp \\ WER1463.tmp.xml \\\\? \\ C: \\ ProgramData \\ Microsoft \\ Windows \\ WER \\ Temp \\ WER1471.tmp.csv \\\\? \\ C: \\ ProgramData \\ Microsoft \\ Windows \\ WER \\ Temp \\ WER14CF.tmp.txt <\/ Data>  <Data> \\\\? \\ C: \\ ProgramData \\ Microsoft \\ Windows \\ WER \\ ReportArchive \\ AppCrash_Microsoft.Minecr_7b7c2ea314b6549025bf01cf1a49e6747975_92ef0587_6ae18dba-7bf7-4fa6-bce2-c21765e741b1 <\/ Data>  <Data \/>  <Data> 0 <\/ Data>  <Data> cf1703d8-65e3-45b2-ab71-607d533c85cc <\/ Data>  <Data> 268435456 <\/ Data>  <Data> 8a4c10fe2d4aa2973c3554e9cde84685 <\/ Data>  <Data> 0 <\/ Data>  <\/ EventData>  <\/ Event>Any help will help me","Dump AnalysisMicrosoft (R) Windows Debugger Version 10.0.19528.1000 AMD64Copyright (c) Microsoft Corporation. All rights reserved.Loading Dump File [C: \\ Users \\ dirts \\ AppData \\ Local \\ CrashDumps \\ Minecraft.Windows.exe.2008.dmp]User Mini Dump File with Full Memory: Only application data is available************* Path validation summary **************Response Time (ms) LocationDeferred srv *Symbol search path is: srv *Executable search path is:Windows 1****6: 08.838Process Uptime: 0 days 0: 00: 09.000........................................ ................................................Loading unloaded module list....This dump file has an exception of interest stored in it.The stored exception information can be accessed via .ecxr.(7d8.ce8): Access violation-code c0000005 (first \/ second chance not available)For analysis of this file, run! Analyze -vntdll! NtWaitForMultipleObjects + 0x14:00007ffb`e62dcc14 c3 ret0: 010>! Analyze -v****************************************************** ****************************** ** Exception Analysis ** ******************************************************* *****************************KEY_VALUES_STRING: 1    Key: AV.Dereference    Value: NullPtr    Key: AV.Fault    Value: Read    Key: Analysis.CPU.Sec    Value: 1    Key: Analysis.DebugAnalysisProvider.CPP    Value: Create: 8007007e on DESKTOP-HV9L87S    Key: Analysis.DebugData    Value: CreateObject    Key: Analysis.DebugModel    Value: CreateObject    Key: Analysis.Elapsed.Sec    Value: 4    Key: Analysis.Memory.CommitPeak.Mb    Value: 170    Key: Analysis.System    Value: CreateObject    Key: Timeline.OS.Boot.DeltaSec    Value: 11768    Key: Timeline.Process.Start.DeltaSec    Value: 9ADDITIONAL_XML: 1NTGLOBALFLAG: 0PROCESS_BAM_CURRENT_THROTTLED: 0PROCESS_BAM_PREVIOUS_THROTTLED: 0APPLICATION_VERIFIER_FLAGS: ****5 = 00000027c6dfe5a0iopl = 0 nv up ei pl nz na pe nccs = 0033 ss = 002b ds = 002b es = 002b fs = 0053 gs = 002b efl = 00010202Minecraft_Windows! FT_Library_SetLcdFilter + 0x10bae23:00007ff6`37e77cb3 488b07 mov rax, qword ptr [rdi] ds: 00000000`00000000 = ????????????????Resetting default scopeEXCEPTION_RECORD: (.exr -1)ExceptionAddress: 00007ff637e77cb3 (Minecraft_Windows! FT_Library_SetLcdFilter + 0x00000000010bae23)   ExceptionCode: c0000005 (Access violation)  ExceptionFlags: 00000000NumberParameters: 2   Parameter [0]: 0000000000000000   Parameter [1]: 0000000000000000Attempt to read from address 0000000000000000PROCESS_NAME: Minecraft.Windows.exeREAD_ADDRESS: 0000000000000000ERROR_CODE: (NTSTATUS) 0xc0000005-0x% p 0x% p Q B% s BEXCEPTION_CODE_STR: c********fe`ff65f57****: 00000000`00000000 00000000`00000000 00000000`00000000 00007ff"]},{"symptom":"When is the 'Your Phone Companion' app coming to iOS?        It'd be such a good alternative to the program I use now, and it's on android so are there any plans for it to come to iOS? Does microsoft need to work out something with Apple first or what?Thanks","solutions":["Hi JayTee3, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.Phone Companion was replaced by Your Phone, and when I search on the App Store on my iPhone, I believe the app that may help you is called \"Continue on PC\" published by Microsoft under the Productivity category.https:\/\/apps.apple.com\/ca\/app\/continue-on-pc\/id...Some additional information on this can be found here: https:\/\/www.howtogeek.com\/330526\/how-to-use-win...Note: These are non-Microsoft websites. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","Unfortunately, continue on your PC isn't the same... it only allows like you to continue a link on ur pc but thats about it. Not send images, files, .exe's, documents, texting, looking at notifications too. None of these features are in \"Continue on PC\" like that are in \"Your phone Companion\"This app can be seen on the play store here https:\/\/play.google.com\/store\/apps\/details?id=com.microsoft.appmanager&hl=en_AUBut not on iOS","Currently iDevices are not supported but hopefully they will be. There’s no timeframe for this & only Microsoft will know when they intend to release an update to integrate iPhones to the myphone app.You can send Microsoft feedback via windows key + F.","Do they even read that though?","Currently iDevices are not supported but hopefully they will be. There’s no timeframe for this & only Microsoft will know when they intend to release an update to integrate iPhones to the myphone app.You can send Microsoft feedback via windows key + F. They were meant to be supported 4 years ago lol https:\/\/www.youtube.com\/watch?v=lXREpLEwgOY","Did you read my reply or just mark me as not answering your question. If you’d prefer to believe a YouTube video rather than a fellow user then good luck.Currently you can add an iPhone but cannot use the features for reading texts or calling via pc.Microsoft may say it’ll arrive in x months but things change & they may not be able to release the update.Microsoft has no control over which apps are accepted by Apple for their Store.","Microsoft do indeed read the feedback & have implemented many fixes due to complains left.As stated you can add an iDevice but currently you can do nothing more. I have added mine & am awaiting Microsoft's update. If this isn't answering your question then there's nothing further I can assist you with."]},{"symptom":"Windows 11?        About Windows 11* Original title: Windows","solutions":["Hi The I am sorry to say, Windows 11 is an Internet myth, there will be no Windows 11 When support for Windows 8 ends, Microsoft will re-brand Windows 10 to just WindowsThe model Microsoft are using going forward is, twice yearly a new version of Windows (called a Feature Update) will be released. That feature update will include any new Functionality and features available for Windows and will deprecate older featuresThat way, once your PC is up to date, you will always have the latest version of Windows. This is something like the Office 365 model, with the one exception, Windows 10 feature updates are free and there is no subscription .","About Windows 11 Hello,What information you require?Regards.","About Windows 11 Windows 11 does not exist.Nobody knows what Microsoft's future plans are. Right now they are concentrating on Windows 10.","Oh.I see that you've already created a thread with same topic one year ago....> Windows 11? Last reply December 28, 2018 byDaveM121 |Created December 28, 2018 by The GreatOne1 ==== Windows lifecycle fact sheet"]},{"symptom":"windows phone 8.1 update2        Is it possible to upgrade to Windows 10 from the above, and if so, how?There seems to be very limited information about phone 8.1Would appreciate any detailed details.Tony","solutions":[]},{"symptom":"Windows keeps toggling automatic driver installations...        I'm aware there's an option to \"prevent\" windows from downloading and installing drivers on it's own.It seems however, that windows changes this setting whenever there's a big update...Could this be disabled please? it's \"hard\" enough to find the setting that a regular user wouldn't know about it existing.It's quite annoying to keep having to turn stuff off, because windows \"thinks\" it should be on and automatically do further stuff...I'm not updating certain drivers for a reason (be it performance, features, stability, trust).So please, stop changing settings willy nilly when I CHOSE to disable a feature...Best regards,Dirk","solutions":["+1Would like an option to disable automatic driver updates in Windows Update.Has caused me a lot of problems on certain devices that automatically update to newer versions that turn out to be incompatible with the hardware.This leaves me having to manually re-install the old drivers every time.... ANNOYING!"]},{"symptom":"Microsoft Keyboard        how to turn the numeric pad","solutions":["Press the Num Lock key.  It is a toggle key.  Press once to shut down numbers.  Press again to activate numbers."]},{"symptom":"Planning to use Active Directory on Windows Server 2012 R2        Hello guys, I was assigned as IT advisor to work with the IT guys here at the office. I'd asked to him to create a planning to implementing the active directory here at the office, to login with personal credentials and he told me he won't do it.  I just need to have a planning to implement the active directory on a windows server 2012 R2, the system requirements, desktop's operation systems (we have a mix of windows home and enterprise in 18 desktops).  Can you point me on the right direction?Cheers, ","solutions":["Hi,Server and IT Pro questions are best handled on our sister Site Technet as this is only a Windows consumer only forum:https:\/\/social.technet.microsoft.com\/ForumsPlease choose the most appropriate category on Technet forums from the left.","Best to ask at TechNet: https:\/\/social.technet.microsoft.com\/Forums\/ie\/en-US\/home?category=windowsserver"]},{"symptom":"I must be thick!!        How do i eject a cd from my computer?","solutions":["Power to the often forgotten right-click action!Open Windows Explorer, then right-click the CD drive - voilà!"]},{"symptom":"realtek audio console does not support the system after windows 10 update version 1909        realtek audio console does not support the system after windows 10 update version 1909 how can i fix it?","solutions":["Hi ΜΑΝΟΣΚΑΤΑΡΤΖΗΣ, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Follow the steps in this link that is shared and used by some Windows MVPs, to verify if it helps you solve the problem.One of the options that are not indicated in the article, is to return to the previous controller, if previously it worked correctly.https:\/\/www.howtogeek.com\/443702\/how-to-fix-sou...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Sorry but this site with these instructions is totally irrelevant with my problem. My problem is that the realtek audio console does not works after windows 10 update 1909. Is there a fix isue for this serious problem?Thank you very much for your appreciation","Hi, My apologies, I totally confused the question, I will release the question so that an expert who manages the subject better than me, guides you to solve the problem. Have a nice dayRegards","Ok thank you very much!","Hi, I'm Andrew. Can you download the latest version of the Realtek Audio Console for your computer from realtek.com, uninstall the current version on your computer and install the newest. You can uninstall the app through Settings>Apps.","Sorry but i have tried this and this does not solve the problem.","Sorry any solution from everyone?","Feedback Give","Feedback Give ΜΑΝΟΣΚΑΤΑΡΤΖΗΣ's","Sorry any solution from everyone? Feedback Give"]},{"symptom":"All docs missing and folders empty!        After initiation icloud\/drive.......Malware etc.  Dont know what caused all docs to disappear and all folders to be empty.  How can I restore this?","solutions":["Hi Rache and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.- Press the Windows key and type in \"CMD\" right-click then \"Run as an administrator\".- Type in the command below. attrib +r -s -h C:\\User\\UP \/S \/D Command Details: for better understanding of commands functions. ATTRIB [+R | -R] [+A | -A] [+S | -S] [+H | -H] [+O | -O] [+I | -I] [+X | -X] [+P | -P] [+U | -U][drive:][path][filename] [\/S [\/D]] [\/L] + Sets an attribute. - Clears an attribute. R Read-only file attribute. A Archive file attribute. S System file attribute. H Hidden file attribute. O Offline attribute. I Not content indexed file attribute. X No scrub file attribute. V Integrity attribute. P Pinned attribute. U Unpinned attribute. B SMR Blob attribute. [drive:][path][filename] Specifies a file or files for attrib to process. \/S Processes matching files in the current folder and all subfolders. \/D Processes folders as well. \/L Work on the attributes of the Symbolic Link versus the target of the Symbolic Link -Restart PC when finished. I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Hi Rache, If the command above is not working try these simple commands. 1. Open CMD. 2. Type in cd Desktop\\TEst <Press enter.> attrib -s -h \/s \/d *.* <Press enter.> 3. Check if the files are already visible. Please check the image attached below for your reference. Thanks.","path not found is the message i get","path not found is the message i get C:\\WINDOWS\\system32>cd Desktop\\TEstThe system cannot find the path specified.","Hello JosephThis command attrib -s -h \/s \/d *.* runs but it says access denied."]},{"symptom":"Bluetooth connection in windows10 version 1909        Updated to the current version on 11\/13\/19 and everything worked well until 11\/23\/19. did not turn off the machine off on 11\/22\/19 and on 11\/23\/19 found this message in the Device Manager for Bluetooth -  This device cannot start. (Code 10) STATUS_DEVICE_POWER_FAILURE. Insignia NS-2810BT speakers still attached in settings under Audio (Bluetooth & other devices), but greyed out can't even remove - says Bluetooth is turned off. Have tried all the obvious stuff of updating drivers, uninstalling, reinstalling, etc. The Bluetooth icon is missing from the action box - bottom right of the taskbar.My Bluetooth Logitech keyboard and mouse work but they are assisted by dangle in USB port. ","solutions":["Go Win key+X, Device Manager, Bluetooth and check if active.  If not go to the top and Scan for hardware changes and see if the Bluetooth is activated.  You may have had a power surge that may have turned it off.","Hi AMS. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Guardian Moderator here to help you.I'll give all possible steps for troubleshooting Bluetooth in order of priority. Many problems right now are being solved by updating to the latest version so if you want to skip to that step see the Repair Install at bottom:Try moving the dongle to another USB port, e.g. if USB2 move to a USB3 port (blue inside) or vice versa. If plugged in front, try in back. If using a USB hub, remove it and try plugging in directly to port.Try Updating the Bluetooth driver from the adapter's Support Downloads webpage for your exact model. Install it even if it's the same or newer than the one in Device Manager reached by right clicking the Start button.Right click Start button to access Device Manager, locate Bluetooth device (if necessary from View tab Show Hidden Devices), on Driver tab see if Roll Back is available, if not try Update Driver, first automatically, then Browse, then Let Me Pick to try all previously installed Drivers. If these fail Uninstall the Driver, restart PC to reinstall. If the BT driver is not there, access the View tab in Device Manager to \"Show Hidden Devices.\"Make sure you're pairing correctly as shown here: https:\/\/support.microsoft.com\/en-us\/help\/15290\/... See Fixes here which are all working: https:\/\/support.microsoft.com\/en-us\/help\/14169\/...https:\/\/superuser.com\/questions\/1017867\/make-wi...https:\/\/answers.microsoft.com\/en-us\/windows\/for...Try the Bluetooth troubleshooter at Settings > Update & Security > Troubleshoot. Try turning off Fast Startup at Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change settings that are unavailable > uncheck Fast Startup.If this is a mic or headset right click Volume icon in System Tray to Open Sound Settings, make sure the correct device is selected for input or output in the dropdown menu.Then try pairing again, if necessary run the Bluetooth Troubleshooter again. If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....If you think the BT adapter has failed, you can replace it easily with a USB nano adapter like this one:https:\/\/www.amazon.com\/ZEXMTE-Bluetooth-Receive... Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1909 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","There is most definitely some kind of issue with Windows 10 1909.  We test heavily and this issue happens mainly with 1909.  1903 seems to be ok or at the least more reliable.  We've tested different models, different bluetooth devices on and off the domain and the results are the same.   Working with Microsoft higher tier support we were informed to be cautious with 1909 because of possible driver issues and some of it's being worked on but will take time before updates\/patches are released."]},{"symptom":"Error \" We're having trouble determining if your PC can run Windows 10\"        I used to upgrade win 7 to win 10 before but I returned to win 7 because win 10 (at that time) was not good as now. Now, I want to upgrade my PC to win 10 one more time bcz I heard Microsoft won't support Win 7 from Feb, but it didn't work. And I don't know why it is? :(((Here is some info of my PC : Pentium(R) Dual -Core CPU : E5200 @2.50GHz (2CPUs), ~2.5GHzRam : 2Gb Card : DirectX 11And here is the image of error ( it even don't have code error @@) :","solutions":["Hi ngoc,If you upgraded to Windows 10 during the free upgrade offer, I recommend doing a clean install of Windows 10. Skip the key when prompted and make sure to install the same version as was before.Also honestly the PC specs are not as good as required for a great experience. You would find too much lag later on after installation. Upgrading hardware is recommended."]},{"symptom":"Bluescreen can't launch computer or reset        Hello, I have a problem, my computer won't start, he's showing a blue screen \"critical process died\" after bios and windows logo. I tried to reset, uninstall updates, or launch in safe mode but either it says that it's not working either I have a bluescreen. What can I do? ","solutions":["Hi Emilie, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Let us try repairing the existing OS. On a working computer, create an Installation media of Windows 10 that allows you to repair existing Windows Installation.Create a USB Flash Drive https:\/\/www.tenforums.com\/tutorials\/2376-create...Boot from the USB Flash drive-Make sure you have disabled Secure boot\/Fast boot in BIOS Settings.https:\/\/www.tenforums.com\/tutorials\/21756-boot-...https:\/\/www.tenforums.com\/tutorials\/21284-enabl...Then open Advanced Startup options after the computer boots from USB. Click Repair your computer at the first screen that says Install now.https:\/\/www.tenforums.com\/tutorials\/2294-boot-a...Select Startup repair, let it finish the job and see if the computer can boot afterward.If that doesn't help, consider doing a clean install after rescuing your files. Rescue Files when Windows won't start https:\/\/answers.microsoft.com\/en-us\/windows\/for...How to do a clean install https:\/\/answers.microsoft.com\/en-us\/insider\/for...https:\/\/answers.microsoft.com\/en-us\/windows\/for...Disclaimer: Tenforums is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"System overload while using Google Chrome-Windows 10 Issue        im writer and working on ms office and offer writing service. My nature of job requires me to use Google Chrome browser to use certain extensions and tools for my research, analysis and writing. I am encountering this issue from few days that whenever I use my browser in normal and incognito modes, my operating system i.e. Windows 10 gets too slow and I have to wait for several minutes to close my browser, word documents and all other software to resume normal operation. Task manager continuously shows more than 3 GB ram consumption while using chrome.I have following system specs currently while using chrome:OS Name Microsoft Windows 10 ProVersion 10.0.17763 Build 17763Other OS Description Not AvailableOS Manufacturer Microsoft CorporationSystem Manufacturer Dell Inc.System Model OptiPlex 3010System Type x64-based PCProcessor Intel(R) Core(TM) i5-3470 CPU @ 3.20GHz, 3200 Mhz, 4 Core(s), 4 Logical Processor(s)BIOS Version\/Date Dell Inc. A08, 12\/7\/2012SMBIOS Version 2.7Installed Physical Memory (RAM) 6.00 GBTotal Physical Memory 5.90 GBAvailable Physical Memory 1.32 GBTotal Virtual Memory 11.9 GBAvailable Virtual Memory 5.77 GBYour suggestions are required that how can I optimize my system as I have installed new and registered version of Windows 10 but the issue is persisting.RegardsNatalie Strongfrom valentine wishes","solutions":["Hi, It may be a Chrome extension\/process causing the issue. Have you recently added a Chrome extension that would coincide with the appearance of the issue?Also, try using the Chrome task manager to see RAM and CPU usage for each process:https:\/\/www.businessinsider.com\/google-chrome-t...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Windows 10 Activation        I am suddenly told I need to activate Windows. I find I have no digital license or product code. I have been using Windows 10 on this laptop since the upgrade from Windows 7, and now suddenly need to activate it?","solutions":["Hi Bill, How did you buy Windows 7? If it was preinstalled by laptop manufacturer please check battery cover or under battery itself. This is a common place for sticker with Windows 7 product code.","What version of Windows 10 do you have installed (Home\/Pro)? Is this the same version you have been using when it was activated?","Pro. It was a refurbished unit, upgraded to Windows 10 Pro with the original rollout.","If it was activated in the past from the upgrade process, your hardware should have a digital license. If the repair activation process does not work, you should be able to apply the generic Windows 10 Pro key. If the digital license exists, this process should reactivate it.Generic Windows 10 Pro - VK7JG-NPHTM-C97JM-9MPGT-3V66T.","I've been using it with Windows 10 since the initial roll-out and upgrade. Thanks, but that didn't do it. I had tried the code from under the battery, and got no joy. This code didn't work either.I fear I don't know the repair activation process you mention.","Thank you for your help. I have to go.","Thank you. I bought this refurbished, with Windows 7 Pro installed. I upgraded to 10 when it came available and have been using it ever since. I found the code under the battery as you suggested, but it was not accepted. Thanks again; I'm out for now.","You may call Microsoft at work hours and ash a help from live person about activation. It is possible there was Windows 7 Home preinstalled. You may ask laptop manufacturer about this.","Well, my laptop got another update today, and the notification that I need to activate Windows has disappeared.Thank you all for responding; as of now I'm going to return to \"If it ain't broke, don't fix it\" mode."]}]}