{"windows":[{"symptom":"windows10 stopcode error: WHEA_UNCORRECTABLE_ERROR        Hello,   I have been recently receiving the WHEA_UNCORRECTABLE_ERROR on my custom built computer just about anytime I turned the system on and quite frankly, this is getting a bit annoying. Everyday it gets a blue-screen at least 2 or 3 times per day or evening that I use my system. I have had to rebuild my system several times over the course of several months when I was running version: 1709, and that's when the problems started.  My system would crash every time I opened Microsoft Edge or I.E.11. Thinking that an important update would solve the problem I updated my system to version:1803 and the problems appeared to be getting worst and not better.    The end result was that my system crashed from an unrecoverable error and I lost everything. Not even the system restore points worked or could be found. It was like the system restore points didn't work at all.  System would not boot to the hard-drive nor could it be recovered from a emergency Windows 10 repair disk. The end results was having to reinstall Windows 7 Ultimate until Microsoft find a solution to this nightmare.      October 2019 I decided to upgrade again to Windows 10 but this time back to 1809 with the assumption that a fix was found that would resolve the earlier problems Microsoft had with version: 1903. A few days went by and ensured that all of the required and recommended updates were installed properly my system seemed to be running stable with no issues. However, a week later it \"File Explorer\" started freezing up or not responding so I did a hard restart to get the system back online and it worked for about an hour. File Explore froze again and then a \"Blue Screen\" occurred with the error code: WHEA_UNCORRECTABLE_ERROR.     Ever since the last week of October I've only experienced nothing but the bluescreen error. All of my device drivers are up-to-date and so is my Antivirus software. I've ran memory scans as well as \"SFC SCANNOW\" and CHKDSK on my system for problems and nothing is found to be a problem. Can someone tell me what is going on with this annoying WHEA_UNCORRECTABLE_ERROR that I'm experiencing with my system?  I am not sure how to resolve this, when I look in event logger it shows as WHEA-logger event 19, not sure if that helps in deciphering the issue or not but I will provide further information if required. In the System Event Log this keeps coming up but I don't know what this mean: The computer has rebooted from a bugcheck.  The bugcheck was: 0x00000124 (0x0000000000000000, 0xffffdb0abdede028, 0x00000000fa000000, 0x0000000000400405). A dump was saved in: C:\\WINDOWS\\MEMORY.DMP. Report Id: 3b3f9a09-5b12-4fbf-90ba-e50e090f24b1. And this: The RtNdPt60 service failed to start due to the following error:    Need Help...Thanks ","solutions":["Hi Art12, to diagnose the underlying issue, I need to analyse your Mini-dump file(s):Open Windows File Explorer Navigate to C:\\Windows\\Minidump Zip up the contents of that folder If you have problems zipping those files, copy them out onto your Desktop and zip them from thereUpload the zip file to the Cloud (OneDrive, DropBox . . . etc.) Then post a link here to the zip file, so we can take a look for you . . .","Hi DaveMI have multiple minidump files under the windows folder. Which one do you need?","Hi Art12 Please upload all of those, it will make it easier to diagnose the issue . ..","Sorry for the delay. It took a moment or too to figure out how to use OneDrive.  Files uploaded","Hi Art12 Can you please right click those on OneDrive (https:\/\/onedrive.live.com\/) and choose Share - Copy Link, then post that link here, so I can download and analyze those for you . . .","https:\/\/1drv.ms\/u\/s!BARBwDF7noTIrwkP7MAZLYoiSVo-?e=rWd3g4","Hi Art2 A lot of you minidump files just indicated a generic Memory Corruption error however a couple indicated rt640x64.sys as the root cause of your system crashes . . .That is the device driver on your Realtek Network Card, your best option is to go to the support page for your PC on the Manufacturers website, then from there, download and install the Realtek Network driver they recommend for your PC . . .","Thanks SirI hope this ends this craziness with the bluescreens.  "]},{"symptom":"Download of windows 10 pro        I purchased windows 10 pro and had it installed on my old computer. this was purchased from Microsoft online and was downloaded. I have now changed my computer and it came with Windows 10 home. I would like to get Windows 10 pro which i purchased downloaded to my new computer. I do not have the product key but I am sure that Microsoft will have a record of my purchase. How can I get this accomplished\/Thanks","solutions":["Hi Keith, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.If you log in to your Microsoft Account, does Windows 10 Pro show in your order history? (Note, on the left side, choose Ordered within: All available)https:\/\/account.microsoft.com\/billing\/orders\/If so, this is the account that you can use to activate Windows 10 again and you may be able to view the product key here.If you are using a digital license linked to a Microsoft account, you can run setup and skip the product key option by selecting I don’t have a product key. When you sign in with your Microsoft account and connect to the internet, you will be activated.Source: https:\/\/support.microsoft.com\/en-us\/help\/12440\/... I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"Windows error code 0x80070424        Hi i have tried many times to update my computer, but it keeps giving me this code: 0x80070424. i have tried going to services and restarting windows update, but nothing changes. I need some help. Also i can not install app at all it gives me this code: 0x80070424. this si the same problem and i would like to fix this.","solutions":["Hi Rohan Click your Start Button, type winver and hit Enter On the resulting dialog, what Version No. and build No. of Windows 10 are you running?If you are not running version 1903 or 1909 of Windows 10, click the link below, then click 'Update Now' on that page to immediately get 1909 and bring your PC right up to datehttps:\/\/www.microsoft.com\/en-us\/software-downlo..."]},{"symptom":"can no longer install Windows 10 games\/apps on ExFAT drive        I used to be able to install Windows 10 games and apps via the Windows Store on all of my hard drives. Now, two of them, which are formatted ExFAT, can no longer accept new game installs. Existing games installed on those drives, which were installed before this weird update hit the Windows Store, still work. But when I try to install new games to those drives, which are shown as available drives in the Xbox beta app, I get an error (0x80073d13) saying they're not formatted NTFS. And the general Windows Store app no longer shows them as available drives, even though I've selected one of these ExFAT drives as my \"change where new content is saved\" default for \"apps\" within the Windows 10 Control Panel. (My Win10 drive is prohibitively small to install 50+ and 100+GB games.)Previous threads suggested to update the Xbox Beta App to make this work. That didn't do the trick. I'm on Xbox Beta version 1912.1001.8.0, on Windows 10 version 1909, build 18363.535. Because that thread was incorrectly closed, I have to reopen the exact same issue as a new thread. (As if I didn't have enough complaints about this whole process.)What gives?","solutions":[]},{"symptom":"windows 10 in s mode also cannot activate after updating and using a new computer as the old one is no longer used        Please help windows 10 in s mode, also cannot activate after updating and using a new computer as the old one has been destroyed.  Cannot find the product key.  I have also lost one drive which has all my photos","solutions":["Hi Denise 1 To switch Windows 10 out of S Mode: Open the Settings App Go to Update and Security - Activation In the Switch to Windows 10 Home or Switch to Windows 10 Pro section, select Go to the Store. (If you also see an \"Upgrade your edition of Windows\" section, be careful not to click the \"Go to the Store\" link that appears there.)On the Switch out of S mode (or similar) page that appears in the Microsoft Store, select the Get button.After you see a confirmation message on the page, you'll be able to install apps from outside of the Microsoft Store.2 Log into OneDrive with the exact Same login credentials as your used on your old PC to see if you can find your files:https:\/\/onedrive.live.com\/3 You mention activation problems Did that new PC come with Windows 10 pre-installed and if so was that ever activated since you purchased that?"]},{"symptom":"Left click not registering        I have an asus Q550LF running windows 10.This problem just started 2 days after i did a clean boot from usb.The problem is NOT my mouse (the problem happens with the left click on my mouse, the left click on the pad on my laptop, and the single click on the pad on my laptop). There is NO problem with the touch screen though.Furthermore, I want to make very clear what the specific problem is. My left click DOES work. The thing is it does NOT work in one very specific situation. I can provide two examples of what I'm talking about.1) On Youtube: If I press the space bar to start a video (assuming it was paused to begin with) and then try to left click the screen to pause the video, the click does not register. In fact, I can click up to 5 times before it actually registers that I'm left clicking and then, eventually, registers that I left clicked and pauses the video. But that's only if i click again later. If i don't click again, it just completely ignores the fact that I clicked to begin with (it's not just a delay, it's literally acting like i didn't do anything). This does NOT happen with the right click.2) On FL Studio (music DAW): Same exact thing as with youtube. If i press play and the song starts, I can't add musical notes inside the piano roll using the left click button. It acts as if i didn't click, but then if I wait like a second or two, then it will recognize that I am left clicking. Ruins my workflow. It seems to have something to do with the \"processing power\" (or something, I'm not an expert) because if i'm not telling either YouTube or FL Studio to play the media first, then there's no problem. The problem only happens immediately after i press engage the video to start (YouTube) or the song to start (FL Studio). I'm NOT the only person with this problem.https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/have-to-click-twice-on-everything-for-windows-81\/70e2413b-e720-454e-b0a7-dd0644182921Like i said, this started happening after i did a clean boot from usb. I did another clean boot after to try to fix the problem, but it didn't fix anything.I obviously tried reinstalling the drivers, but like i said, it's not just the mouse. its the left button on the pad on the laptop and also the single touch on the pad (single touch that registers as a left click). ","solutions":["I suggest you start the trouble-shooting effort with simple left-click actions, e.g. like so:Single click any desktop item. This should highlight the item.Double-click any desktop item. This should open it.Drag any desktop item do a different place, using your mouse. Can you move it?Could it be that your mouse buttons are reversed?","Yes i can 100% do those 3 things.There is zero possibility that the mouse buttons are reversed.","TO ANYBODY HAVING THIS PROBLEM, I FOUND THE SOLUTION!https:\/\/boards.na.leagueoflegends.com\/en\/c\/help-support\/aiLNEjAN-mystery-solved-left-click-mouse-delay-after-pressing-an-ability-key-with-the-keyboard-windows-8I wanted to be polite at first, but since i found the answer already i gotta say it. Frederik Long, I don't think you even read the original post.","Frederik Long, I don't think you even read the original post.I certainly did, in spite of it being rather chatty an in some parts misleading . . .","Hi FLstudio_091 Thank you for sharing with us the solution. I'm sure it will be helpful to other users :-) Have a nice day Regards","No problem. It is very strange that the touchpad settings were causing my mouse to behave that way...","It's the marvel of the tech world ! One day it works, next day everything goes crazy, and no one knows why."]},{"symptom":"Group Policy Editor on Windows 10 Home        hi,I am trying to set up my home computer with different profiles so that my kids can't access the same part of the computer as me. I am therefore trying to do this by setting up different profiles and using Group Policy Editor. However I am using Windows 10 Home edition and Group Policy Editor has been disabled. How can I solve this?thanks","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Group Policy Editor isn't included in Home versions of Windows. It's only really applicable to a computer joined to a domain network anyway.However you sholdn't really need to resort to manual policy editing as Windows has loads of features to keep kids accounts separate and restricted.As the most basic level you can add kids account as a \"standard\" type local account - which restricts them making any serious changes to the computer, etc. they'd also not be able to access any of your own profile folders (such as Documents, etc).There's a whole lot more you can do however - this article gives a good overview:https:\/\/www.windowscentral.com\/how-set-kid-frie...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Regards, David"]},{"symptom":"How to recover your Windows product key        Technical Level : Basic SummaryIf you are planning to reinstall Windows but you can't find your product key, this article will show you where and how you can find your product key.The key could be:Printed on a Certificate of Authenticity stickerStored in the Windows RegistryEmbedded in the PC's UEFI firmwareNote that if you are currently running Windows 10 and wish to reinstall the operating system, you don't need your product key. After the reinstall, Windows 10 will detect that it has been reinstalled on a previously activated system and will automatically reactivate. DetailsPrinted on a Certificate of Authenticity StickerIf your PC came with Windows 7 or earlier, then your product key will be printed on a COA sticker. This sticker verifies that the computer came with a genuine copy of Windows. You will need to examine your computer to find the sticker. On laptops, it's usually on the bottom side. On desktops, it could be on the back, sides, or top. It looks something like this:Embedded in the PC's UEFI firmwareIf you have a newer PC that came with Windows 8 or Windows 10, then your product key likely won't be on a sticker. Instead, computer manufacturers now embed the key right into the computer's UEFI firmware. Unlike the COA sticker, the embedded key can't be smudged off, stolen or erased (easily).If you want to extract the UEFI key, the process is simple. Open the Start menu, typepowershell and then run the program.Next type the following command in the PowerShell window and hit Enter.(Get-WmiObject -query 'select * from SoftwareLicensingService').OA3xOriginalProductKeyYou will be presented with the key in the window.Stored in the Windows RegistryIf your product key isn't embedded in the firmware or you're missing your COA sticker, you're not out of luck as long as you haven't formatted your computer. You can still recover the key because Windows stores it in the registry. Here is how:1. Open a new Notepad window2. Copy and paste the following text into the windowSet WshShell = CreateObject(\"WScript.Shell\")MsgBox ConvertToKey(WshShell.RegRead(\"HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\DigitalProductId\"))Function ConvertToKey(Key)Const KeyOffset = 52i = 28Chars = \"BCDFGHJKMPQRTVWXY2346789\"DoCur = 0x = 14DoCur = Cur * 256Cur = Key(x + KeyOffset) + CurKey(x + KeyOffset) = (Cur \\ 24) And 255Cur = Cur Mod 24x = x -1Loop While x >= 0i = i -1KeyOutput = Mid(Chars, Cur + 1, 1) & KeyOutputIf (((29 - i) Mod 6) = 0) And (i <> -1) Theni = i -1KeyOutput = \"-\" & KeyOutputEnd IfLoop While i >= 0ConvertToKey = KeyOutputEnd Function3. Click File > Save As and save the file to your desktop asproductkey.vbs. It's important to include the .vbs extension because this is a Windows Scripting Host file.4. Close Notepad and double-click the file. Wait a few seconds, and then you will be presented with a popup displaying your product key:","solutions":["I tried this and was happy to get a product key however it says Microsoft key invalid!  What gives? ","I tried this and was happy to get a product key however it says Microsoft key invalid!  What gives? What was it that said your key was invalid?Which method above did you use to find your key? The one you extracted may have been a mass upgrade OEM key...","I had licence copy of windows 7,now i installed windows 8.1 pro in pc so how can i find my windows 7 product key,& the product key on microsoft sticker is erased","I followed the instructions but when I dbl clk, it just opens the same notepad file I saved. What is wrong?","In trying to find product key, I used the NOTEPAD method, got a number, but it is different than the one on the label on my pc.  Which one to use to upgrade to Windows 10.","In trying to find product key, I used the NOTEPAD method, got a number, but it is different than the one on the label on my pc.  Which one to use to upgrade to Windows 10.Hi smrtalec, What operating system are you currently running? Was this computer upgraded to the current system, or was this OS installed on the computer since you first bought it?You will probably want to use the key that notepad returned because the key on the sticker is an OEM mass upgrade key. ","In trying to find product key, I used the NOTEPAD method, got a number, but it is different than the one on the label on my pc.  Which one to use to upgrade to Windows 10.Hi smrtalec, What operating system are you currently running? Was this computer upgraded to the current system, or was this OS installed on the computer since you first bought it?You will probably want to use the key that notepad returned because the key on the sticker is an OEM mass upgrade key. Thanks for answering so promptly.  The OS is Windows 7, which came installed on the pc when I purchased it in 2014, directly from Dell. I'll follow what you said and use the one that the machine gave me. Again, thanks for the help.","No problem.","I have the exact same problem as everyone else, I got my Dell in 2014 with Windows 7 pro installed, I have not reformatted or modified the drives in any way. I used the Notepad approach to get the product key which did work. At the end of the installation the install indicated that the product key failed to validate and closed. The advice given here doesn't appear to be very accurate.","For \"Stored in the Windows Registry\" step 3: after clicking \"Save As\" you must change \"Save as type\" to \"All Files\" before entering \"productkey.vbs\" in the \"File name\" field."]},{"symptom":"Windows Spotlight        I use Windows Spotlight, I think that's what it is called, for my lock screen and I love it because there was always a funfact given concerning the picture and if I liked the image and was curious where it came from it would almost always allow me to click on a link to learn more about the location the image was taken from. Up until about the last month and a half, my laptop has provided this, but now I only get an image and no information about it like I normally would. How do I change the lockscreen to provide links to the images like it use to?","solutions":["Hi musiclover295, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.There are a few things I'd like to see if you could verify for us: If you go to Start, then select Settings > Personalization > Lock screen﻿ Can you confirm that \"Windows Spotlight\" is indeed selected? (If it is just set to Picture right now, you can change it and this should bring up the information)You can also make sure that \"Show lock screen picture on the sign-in screen\" is turned on.I hope this has helped you. If these settings are already on \"Windows Spotlight\", please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"Monitor constant on!?        Is there a way to reduce or eliminate the delay time between hitting the view button and seeing what is going on outside?  I actually want to put it into a constant on mode so I can keep a window open on my desktop to monitor in real uninterrupted time?","solutions":["Hi Eric62_54, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.You can change your Windows 10 settings so that it never puts your monitor or computer to sleep.To do this, you can go to Start , and select Settings > System > Power & sleep. Under Screen, select how long you want your device to wait before turning the screen off when you're not using your device.Under Sleep, select how long you want your device to wait before going to sleep when you’re not using it.For more power saving options, select Additional power settings to change how your device uses power.Source: https:\/\/support.microsoft.com\/en-ca\/help\/402706... I didn't quite understand the part you mentioned about \"hitting the view button and seeing what is going on outside\". Can you let us know what application you are using specifically? We might be able to look into this further for you.I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","To me this sounds like you have a security system with an outside camera.  For the picture to show all the time you must have the computer running at all times as this is what powers the monitor operating system.It also sound like you need it invest in a cheap laptop and another monitor to run the security system"]},{"symptom":"Wallpaper changing and it  iskind of creepy.        Whats is this ? ","solutions":["Hi Hilario That is an image of Holl & Rush, pronounced Hollandrush who are music artists, do you have any of their musicin your Music library, that image may have come down as album art and somehow got into your Pictures library . . ."]},{"symptom":"Google Chrome        Google will not open from the desktop. Instead I get a white square with my picture and at the bottom the choices to \"browse as guest\" or\"add person\". If I open in Avast it works. I tried uninstalling and reinstalling Chrome. Same result ( I had the Dell gut here to day because two days ago Chrome would not open and other internet was very slow. He spent along time and found no problems ( Chrome was working then) John","solutions":["You're welcome! Let us know if there's anything else. If you don't have any more questions, feel free to choose a rating. Thanks!"]},{"symptom":"How do I enable the icons in the shutdown-menu?        I have seen them on my second Windows system and I like how they look. I searched in the Windows settings and online but haven't found something. Best regards, Marc","solutions":["Hi there My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Does the issue occur if another user is logged in? If not this would indicate an issue with the user profile.Hope this helps."]},{"symptom":"Add a group for app shortcuts on the start menu?        The start menu has groups of apps on the right side, e.g., Productivity, Explore, etc.  How do I add a group of my own choosing?","solutions":["Just pull an app away from the group and there should be a title area appear.  Go to the app and point above it and click on the area and the title area shows where you can type.Then you can add apps to that area and move the original back to its area."]},{"symptom":"Photo transfer stops at \"Live\" photo        Transferring of photos stops at a \"Live\" photo when using Photos to transfer pictures to Win10  from Iphone 8 ","solutions":[]},{"symptom":"UNSTABLE ZOOM FUNCTION DURING TYPING        I have Windows 10. Every time I type the screen zooms in and out. Very unstable. This only occurs when I type.  I read other threads and the suggestions for deactivating the pinch zoom function do not work. ","solutions":["Hi, Joan My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps: Press the Start key and type the word CMD or Powershell, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanup-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/947821...","After a LONG battle with the same problem, I just fixed my issue by shear luck.It might not be your solution, but here goes....I have a Logitech mouse with a scroll wheel which has left\/right buttons.Scroll in\/out was going it's job well, but left\/right was being naughty.I used the SetPoint \/ Button Settings to tell them to \"do nothing\".Don't forget to change left wheel AND right wheel seperately.","No, damn, that didn't work.Narrowed it down to the mouse and THOUGHT I had it.Turned off SMOOTH SCROLLING and now it's perfect.","I must admit I am too wimpy to attempt the fix you suggested. Don't want to cause bigger problems that lead to me not being able to use my computer at all. Here's what I did. I turned off many settings that affect the touch pad and those that affect where the cursor automatically lands. The zoom problem has ceased to exist. The secondary problem (cursor automatically moving and landing on and activating things when I am trying to type) has improved greatly. Thank you for helping me"]},{"symptom":"How can I recover Windows10 after BSOD when there is no disk space?        My computer won't boot after an automatic Windows10 update; it gives a BSOD repeatedly. I can boot it with an USB stick created on another computer but I cannot reinstall Windows as there is not enough free space on the disk.a. Can I rename the folder Windows.old to Windows and recover the old installtion?b. Can I just delete parts of Windows.old to make space? c. Can I delete parts of the folder Windows to make space? I can see that in the long run I shall have to buy a new computer but it would help if I could get this one running again. Thanks","solutions":["Hi BarbaraGo into the Windows. Old folder, in there is a users folder, check in there for any personal files and move them out of thereThen run Disk Cleanup, on that dialog choose to clean system files, that will remove that Windows. Old folder for you...","Thanks Dave. I cannot run Disk Cleanup as I can only use  the command prompt. Windows.old only contains a Sotware Distribution folder with a Download folder Inside, Nothing looking like Windows. What can I do?","Hi Barbara Are you unable to get into Windows normally? If so, in Command prompt paste each of these commands one at a time into Command Prompt and hit Enter after each one, make sure the previous command completes, before pasting the next command:takeown \/F c:\\Windows.old\\* \/R \/A \/D Y cacls c:\\Windows.old\\*.* \/T \/grant administrators:F rmdir \/S \/Q c:\\Windows.old"]},{"symptom":"uninstall the camera        How do I uninstall the camera on my sons laptop?","solutions":["Hi Brucrew08 The best way is to just disable that webcam, if you uninstall it, then Windows will just re-install it after a restart . . .Open Device Manager (accessible by right clicking your Start Button) Locate the webcam in the Cameras section Right click that and choose Disable Device That will stop the camera working on the laptop . . . If you want a more permanent fix, right click that and choose Update driver, then choose to pick a driver from your PCYou will be presented with a list of devices, pick one that is not a camera and load that driver . ..","You can physically open the computer and remove the connection or go into the BIOS and turn it off."]},{"symptom":"How do I create a registry key?        Greetings,I would like to have a batch script run automatically every time I open the command prompt. Anarticle implies that I need to create a registry key in this path:HKCU\\Software\\Microsoft\\Command ProcessorHow do I do this?I think the key name is supposed to be AutoRun and the value should be the script I want to run. When I open the registry and click Edit > Run, it shows seven different types of keys that I can create. Which one do I choose?Someone else asked this question without an answer.I apologize if I'm not using the right terminology.Thanks,Shane.","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Here is a very good guide on how you do this: https:\/\/www.thewindowsclub.com\/create-a-registr...As mentioned in the guide, it’s always a good idea to take a backup before modifying the registry.Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thanks for the article.I can create a key named \"AutoRun\" with an expandable string value of:%userProfile%\\Documents\\restore\\batch_files\\macros.cmdHowever, the only thing left is I have to give it a name. What do I call it? Thearticle isn't clear.Thanks,Shane.","Sorry, I figured it out. I needed to create a new value (not a subkey). I'm not very good with the terminology.It's working now.Thanks again.Shane."]},{"symptom":"please help me , i have video_tdr_failure        hello , the past 5 days my laptop started to get ''video_tdr_failure'' after i play a video game for a couple of mins , i used to play it with no problems for hours , now i can only play it for couple of mins then my game will crash and my leptop will restart with the video_tdr_failure message. i tried to update my drivers , tried older drivers but nothing worked , i even restarted my laptop to factory settings and downloaded the latest drivers and when i tried to play video games i had the same problem , thisis my minidump fille https:\/\/1drv.ms\/u\/s!Ajo87vX83VJAjzlX7nph4GwiBj1ui hope any of you can help me ","solutions":["Hi there My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Have you tried to update any other drivers for example the chipset drivers? Hope this helps."]}]}