{"windows":[{"symptom":"\"Account Error - We can't get to your account right now\" Windows 10        I'm still having problems logging in - see https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/problem-logging-in-third-time\/6ae47b04-9ca1-43fa-bb23-e491a6832d1e(A)This was the first alert I received (in my notifications):(1) I haven't changed my password. (2) As I haven't a clue what \"Shared Experience settings\" means I checked my Settings where is says \"\"Shared experience use all system accounts to authorize actions across devices.\"*** Then in red \"Some of your accounts require attention\" and a \"Fix now\" link. *** I only have ONE device so at this stage I'm unwilling to click that link (B)  There were occasions previously when the problems spread to my Word and Excel and this then happened again.When I opened Word & Excel just now this is the message I saw (edited to hide my personal info.)Why is this nonsense still happening? There hasn't been a Windows Update nor have I changed my password on my ONE, not two, devices.Has anyone any suggestions what I should do next please? I apologize for letting my frustrations show but this problem had wasted several hours of my time already.","solutions":["Hello Taffy087, I am Andrew an independent advisor. Are you able to log in to your account via account.microsoft.com?These random security checks can be random or somebody tried accessing your account with the wrong password. If you can log in to account.microsoft.com I suggest you change the password. You will need to reenter it through your Microsoft software such as Office."]},{"symptom":"Trying to install Windows 10 Pro but when I enter the product key I get the following error code 0x803fa067        I am trying to install my legally purchased Windows 10 Pro but when I enter the product key I get the following error code 0x803fa067.  I will really appreciate your support","solutions":["Hi Jennie,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.What is the source of your Windows 10 Pro license - Microsoft Store or somewhere else?"]},{"symptom":"Unable to use mobile hotspot in windows 10        Hi,I'm using Windows 10 Version 1909 on Dell Vostro 3350.I want to use MOBILE HOTSPOT function but i can't and i see this error:\"We can't setup mobile hotspot\"I am able to share my internet through NETSH command. How should I fix this?","solutions":["Can you get WiFi on the computer?","YesI can Get wifi and Use it","Hello APDev, I'm Didi, an independent advisor. To fix the error \"We can't setup mobile hotspot\" first restart your computer to see if it helps in any way.If restarting doesn't help try the following methods : Method 1 : Click on the Start button, type \"control\" and click on Control Panel. On the top right corner set \"View by:\" on Small icons. In the list click on Network and Sharing Centre. On the left click Change adapter settings. Right-click on your WiFi network then click Disable then re-enable it................ Method 2 : Follow this guide : https:\/\/www.kapilarya.com\/fix-hotspot-not-worki... .................. Method 3 : Reset Network Settings To Default following this guide : https:\/\/www.kapilarya.com\/how-to-reset-network-... ................... Method 4 : Fix network connection issues following this guide : https:\/\/support.microsoft.com\/en-us\/help\/10741\/... ................. Method 5 : In Device Manager click on View > Show hidden devices and under Network adapters search for any disabled device to enable itRegards, Didi ..................... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Do you have a router?How are you getting you Internet?","Of Course i havei have a router in my home and i connect to it using wifi of my laptop","Hi APDev,try if you solve by following these steps:Enable \/ disable ICS. Try the following: Go to network connections, access the properties of the network adapter connected to the internet> Sharing tab, enable Internet Connection Sharing (ICS) by selecting the checkbox: Allow other users in network ... and confirm by pressing OK.(Skip this step if ICS is already enabled.) Return to the Sharing tab, disable ICS and confirm by pressing OK.Then go to Settings> Network and Internet and enable the mobile hotspot.Note: When using the Windows Integrated Hotspot Mobile feature, the check boxes on the Sharing tab must remain unchecked, otherwise the Mobile Hotspot will not work. If it does not solve, try to restore the network: Settings> Network and internet> Status.Click on Network recovery on the side and follow the instructions.Otherwise, try to temporarily uninstall any third-party firewall \/ antivirus software or VPN and try again."]},{"symptom":"Remove user account        I have 2 users on my laptop and I want to remove one of them. I've looked it up and it says to go to settings go to the account and press remove, but, there is not a remove button, only block. I went onto my microsoft account and tried to too remove from family and when I do, it says that the account has gave child consent and needs to remove it. Well, there is no child account on either accounts. How can I remove the account on my hp laptop with windows 10? My account is the administrator, also.","solutions":["Hi Alyssa Click your Stat Button, then just type netplwiz and hit Enter On the resulting dialog, does that account appear, and if so, is the remove button active?","I have 2 users on my laptop and I want to remove one of them. I've looked it up and it says to go to settings go to the account and press remove, but, there is not a remove button, only block. I went onto my microsoft account and tried to too remove from family and when I do, it says that the account has gave child consent and needs to remove it. Well, there is no child account on either accounts. How can I remove the account on my hp laptop with windows 10? My account is the administrator, also.Hello,Please refer WAY 2 mentioned here:https:\/\/www.kapilarya.com\/how-to-delete-user-account-in-windows-10Hope this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP. "]},{"symptom":"lost device         I lost my device sometimes back, I can sign into my Microsoft account and locate the area where my device was last seen, I can even see my battery at 85%. Now I cannot manage to lock the device and also I  can't find the exact point where the device is.How can I be help?","solutions":["Hi bernard, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Can you add a little more detail about the problem you are presenting? What device do you mean?Have a nice day Regards, Marc M.","Thanks for the reply but sorry I meant my windows 10 laptop","location can be seen on the map under  Microsoft account.Your windows 10 laptop device has integrated  LAN means then it can be traced via  MAC  address  \/ IP address ","OK, thank for your reply, Now what should I do, I don't understand this MAC address\/IP.Just elaborate for me the full procedure so that I can recover my laptop. I realized that I cannot lock it also. should it be on for it to be locked or recovered?","give police complaint with laptop  lan MAC and  wifi MAC  address. it can be traced when Internet is connected to laptop.Only cybercrime police can able to trace it. ","Ok. so where do I get this Ian Mac and Mac address, I Bought the device while I was in Doha Qatar. I can't locate the documents as I am no longer there. Also if the lost device is switched off, How can it be connected to internet?","you can get it from modem or router. you can get it from laptop box","you mean internet? like right now I am on internet with a different laptop.....Can I get the MAC address?"]},{"symptom":"internet access to .jar file        I am trying to run a .jar file on my computer, but my computer wont give internet access the the .jar file, is there any way i can fix this? or am i out of luck.","solutions":["Go Settings, Apps, Default apps, Choose default app by file type.","Hi Corn. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See how to fix .jar files here: https:\/\/windowsreport.com\/jar-files-not-opening... (avoid ad links, just read the editorial copy which is excellent)I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Notifications        Bonjour,Je reçois des notifications d'un site à qui j'ai accepté de recevoir les notificationssans faire exprès.J'ai trouvé dans les paramètres la partie qui permet d'interdireles notifications de ce site mais il apparait toujours dans la liste avec \"désactivé\".Tout ce que je voudrais,c'est savoir comment enlever les site de la listeMerci,Martin","solutions":["Bonjour, je m'appelle Marco, je suis conseiller indépendant et je vais faire mon possible pour vous aider.Quand vous dites \" liste \" vous parler de la liste des notifications de windows qui apparaît dans la barre des tâches ? Et il réapparait même si vous appuyer sur \" effacer tout \" ?Vous utiliser edge, firefox ou chrome ? Je vais quand même vous donner la façon de faire d'un coup que vous n'avez pas prit le même chemin.Pour chrome, quand vous êtes sur le site en question, cliquer sur le petit cadenas au tout début de la barre d'adresse. Ensuite \" paramètre de site \" et aller sur \" notification et sélectionner \"bloquer \"Sur Firefox aller dans les options en cliquant en haut à gauche sur les 3 petites lignes horizontales.Cliquer sur options. Ensuite à gauche \" vie privée et sécurité Descendre jusqu'à \"permission\" et vous aller voir \"notifications\" Cliquer sur paramètre à droite et vous aller voir la liste des sites à bloquer. Edge, Cliquez sur l’icône du menu (les trois points en haut à droite de la fenêtre de votre navigateur).Sélectionnez Paramètres. Cliquez sur l’icône Afficher les paramètres avancés (avec trois lignes horizontales).Cliquez sur le bouton Gérer les autorisations dans la section Autorisations du site Web.Cliquez sur Tout supprimer, en haut à droite de la liste, pour désactiver toutes les notifications.Si vous souhaitez empêcher un site en particulier de vous envoyer des notifications, alors sélectionnez-le dans la liste et utilisez le bouton pour désactiver Notifications.Marco"]},{"symptom":"Unable to add a device to Microsoft account        I was trying to install Minecraft but I was getting a popup saying \"you don't have any device associated with this account\"; however I was able to see it under my account. I followed some other indications to overcome this problem without luck, so I decided to delete the device from my account in order to re-add it and see if that would fix it.Now I am struggling to add it again.Everywhere I just read that to add a device you have to:\"Select Sign in with a Microsoft account instead\"However I don't have this option, because I am, indeed, already using a Microsoft account. I am of the impression that once you have deleted a device you cannot add it again. Is this some kind of bug?Deleting my account and adding it again is not an option. I just want to add a device to my account.Any help is much appreciated.***Modified title from: Trying to add a device to my account.***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. Ideally, when we sign in to a device using the Microsoft account, the device is already added to the Microsoft account. However, as you have mentioned you are unable to add the device to the Microsoft account after removing it. We would suggest you to try converting the account as a local account and then converting it as a Microsoft account. This should add the device to the Microsoft account. Kindly refer the steps mentioned below: Press Windows key + I, to open Settings.Click on Accounts and select Your info on the left pane.Now, click on Sign in with a local account instead and follow the on-screen instructions.Once the account is converted as a local account, sign in to the account, go to settings and click onSign in with a Microsoft account.Follow the on-screen instructions to convert the account. Once the account is converted as a Microsoft account, the device will be listed in your Microsoft account. Meanwhile, we would like to know the following details to assist you with the Minecraft issue: How are you trying to install Minecraft?Which edition of Minecraft are you trying to install? Please reply with the status of the issue, we will be glad to help you further. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Problem logging-in - THIRD TIME.        Yet more problems logging in just now.I first reported it on the 25th November in my thread https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/problems-logging-in-just-now-windows-10\/9dfad562-1691-4c9a-96fb-080ca4e108a0.That was resolved by a message in notifications that there was a problem with my signing-in. I followed a link, entered my Hello PIN and it was working again. (There was still a problem - I was taken to \"Ask the Community. We're here to help!\" I raised it in Performance Issues November)Then I had similar problems on the 30th November that I reported in my thread: https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/problems-logging-in-just-again-windows-10\/5c5a148a-ead0-43c6-a905-9bcfa8766149A slight variation was a warning window \"Account Error - Sorry but we can't get to your account right now.To fix this, please sign in again.\" But the \"Sign in link didn't work. As there were no replies from the Community experts I did nothing - I saw no point. Whatever had caused these problems had gone away - until today.It's now happened a third time, again in a slightly different way:I powered up, was taken to the spotlight screen & \"Like what you see?\" question. I entered my Hello Pin number and was taken to my desktop. I signed into Edge on my bottom taskbar. On the next rather bland screen I pressed Enter. This took me to the new Outlook Sign-in screen, the one with the options \"Try Premium\" or \"Sign in\". I pressed Sign in and was taken to this \"Windows Security Screen\"So I had to enter my Hello PIN again.Another screen came up but I couldn't capture it as it was there only for a split-second.I was then taken to my Inbox at last.I'd appreciate advice on this please.Please don't merge these three threads - the symptoms in each are different. Thanks.","solutions":["I created this two hours ago. I've just had this in my notifications:What nonsense. I have these logging-in problems for the third time and all Microsoft can do is to tell me my Outlook settings are out of date.Not at all helpful- why can't they point me to what to do next? Absolute nonsense. Perhaps I should give feedback to the programmers?Last time I had this problem it spread to Word. Not today, touch wood.","I've checked the above message in Bing - the two Microsoft answers there arehttps:\/\/support.office.com\/en-gb\/article\/your-account-settings-are-out-of-date-in-mail-or-calendar-for-windows-10-4484de9e-66b2-46a9-8459-6ca1fcc110b4 and https:\/\/answers.microsoft.com\/en-us\/msoffice\/forum\/msoffice_outlook-mso_win10-msoversion_other\/your-account-settings-are-out-of-date\/73f312db-c340-447f-9fd4-2c8235fd1fbbThe author of the second one is vijayrchandran   https:\/\/answers.microsoft.com\/en-us\/profile\/5c96ca3c-aaea-4f25-a354-bb89b381ab6a?sort=LastReplyDate&dir=Desc&tab=Threads&forum=allcategories&meta=&status=&mod=&advFil=&postedAfter=undefined&postedBefore=undefined&threadType=All&page=1 But none of the above seem to give me the answer.","It happened again just now (10:30 AM GMT). This time I was required to input my HELLO PIN three times. Again, I had the Windows Security screen \"Making Sure it's You\" (as above). I entered my HELLO PIN but it then demanded my Home Phone number*** below - that's a new one. It rejected my phone number but wouldn't let me X the screen. I had to power off and power on.I had no problems this time but why is it happening every time I log in?As no-one here seems to know what's causing this, I'm reporting it as a Performance Problem.","I honestly don't see what the problem is. You are trying to access a web page (your Outlook.com mailbox) that only allows authorized users to view it. You then have to satisfy the website that you in fact have the appropriate permissions. Once you have done so, you're allowed to access the site. Where's the problem?I've suggested before that if you select the option to 'remember me' or 'keep me signed in' at sites you visit frequently, the sign-in process will be much less arduous. You should only do this on your own computer, of course, and not on one at a public library. This will only work if you retain the site cookies in your browser cache.","... why can't they point me to what to do next? That notification is from the Mail app, as you'll notice. If you open Mail, you should see the same notification, with an invitation toFix account. Select that and follow the instructions.I shouldn't be surprised if you got the same result simply by clicking on the notification. It's always worth trying.","... it then demanded my Home Phone number ... It rejected my phone numberYour screenshot indicates that you're being asked to verify your phone number - that's not quite the same asdemanding your number. If you have given a phone number as an item of security information for your Microsoft Account, then you will have to verify it to show that you are actually in possession of the device concerned. It's a bit worrying that 'it rejected your phone number' - is the number you're being asked to verify not yours?It would seem that others being asked repeatedly to prove that they are who they say they are by entering a PIN haven't verified the device concerned for the Microsoft Account they use to sign in to Windows. Please check whether there is a verification request at Settings > Accounts.","These log-in problems happened again just now, Noel. It might be clearer if I run through your earlier comments in this single reply:(1) Regarding the 'remember me\/keep me signed in' option. I followed the instructions in support.office.com\/en-gb\/article\/How-to-sign-in-to-or-out-of-Outlook-com-e08eb8ac-ac27-49f4-a…The instructions were \"In Outlook.com, select your account picture at the top of the screen. Select Sign out. Go to the Outlook.com sign-in page and select Sign in. Enter your email address or phone number and select Next. On the Enter password page, clear Keep me signed in. Enter your password and select Sign in.\"This then took me to the MSN screen and what for me is an obnoxious request to allow MSN & various third parties to store cookies on your device. These cookies are used for analytics, content personalisation and interest-based advertising\". No - they're used to provide MSN with an income stream. - they get income from selling my details.It's pointless though - I clear my cookies every time I exit my session.(2) I didn't give my phone number when I set up my account so I'm not going to give it now. Nor will I give my wife's phone number as it asked.(3) It also asked for another phone number to text. No - reason as #3.(4) It also suggested I create another email address. I'm happy with one so I won't do that.(5) It asked for my Recovery code. I have four (because of MS systems issues) and I'm still waiting for an answer on a thread I created a while ago. I'll remind them.(6) Why does MS require all this info when it was they who suggested that I set up and use the Windows Hello PIN?But my overall moan is that every time I've logged-in in the past 7\/10 days I logged in using my Hello PIN and I've had no problems. So why all this nonsense now? What's changed?","Most of the above this nonsense continued when I signed in today - see my thread here:https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/outlook-settings-out-of-date-win-10\/b4fa8d05-d393-41ae-beb2-5512e4a2335b"]},{"symptom":"High Definition Audio Controller (Code: 10) Issue        Motherboard: MSI B360M Gaming PlusOS: Windows 10 ProList of things I've done:Downloaded audio drivers from MSI websiteUpdated my BIOSUninstalled and Reinstalled the High Definition Audio Controllercmd commands: sfc \/scannow & DISM.exe \/Online \/Cleanup-image \/RestorehealthCompletely removed all other audio drivers and installed Realtek audio drivers (Which for some reason never actually appear on device manager?)I'd appreciate any help I could get.It started happening out of the blue; I never downloaded anything.","solutions":["Hi SM. I'm Greg, an installation specialist, 9 year Windows MVP and Independent Advisor, here to help you.1) For sound problems first try this checklist: https:\/\/support.microsoft.com\/en-in\/help\/402699... 2) Restore the Windows Audio Service which may have become disabled: https:\/\/www.tenforums.com\/tutorials\/57567-resto... 3) Update the sound driver from the PC maker's Support Downloads webpage for your exact model, if it is newer than the one presently installed in Device Manager reached by right clicking the Start button. While there compare to make sure you also have the latest BIOS, Chipset, Display, Network and all other drivers. 4) Right click Volume icon in System Tray, choose Sound Settings, from the Output and Input devices dropdown menus, choose then one(s) affected to see if that helps. If not use the Troubleshoot button nearby.5) Run the Playing Sound troubleshooter at Start button > Settings>Update & Security>Troubleshoot.6) Try rolling back the sound drivers in Device Manager reached by right clicking the Start button. Choose Sound controller and other audio devices, then Driver tab, then Roll back if available.7) If no newer sound drivers then uninstall the one presently installed in Device Manager, reached by right clicking the Start Button. Restart PC to reinstall.8) Try other and older drivers for your model Sound controller, too. For example, try the next oldest driver in the model's online Support Downloads list. To try all previous drivers installed on your system, in Device Manager choose Sound controller's Driver tab, then Update Driver, then Browse, then Let Me Pick. 9) If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 10) If this was caused by Version 1809 update (which you can confirm at Settings > System > About) then you can roll back Version 1809 in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 11) You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... 12) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. 13) If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hello, I'm Independent Advisor and Microsoft MVP, here to help you with your question. For device error code 10, refer this fix: https:\/\/www.kapilarya.com\/fix-this-device-canno...Let us know if this helps! Note: Included link in this reply refers to blog post by a trusted Microsoft MVP.","Hello! Thanks for your help, but I've went through the checklist and nothing's helped; It's not a sound controller that's the problem, but rather a System Device. ","That is a sound controller which is in error and it needs updating from its manufacturers or the PC manufacturers website. I gave you all possible ways to do this.","I'm sorry Greg, but I've tried downloading the sound controller from MSI's website. https:\/\/www.msi.com\/Motherboard\/support\/B360-GAMING-PLUS#down-driver&Win10%2064I've installed both the Realtek HD Universal Driver and the Realtek High Definition Audio Driver, and Nahimic 3 but the weird thing is, is that it never appears in the Device Manager. I've done a fresh install of Windows 10 and the problem persists. I can't do Steps 1-5 because my computer doesn't detect any sound devices AT ALL. I've confirmed it's not a problem with my headset because it works on my laptop.Could it do with this?I'm starting to think its a hardware issue","Hello! Thanks for your help, but I've went through the checklist and nothing's helped; It's not a sound controller that's the problem, but rather a System Device. Just had this issue crop up on a brand spanking new msi ge73 laptop after upgrading from 1803 to 1809. Have installed and uninstalled the latest nahimic and realtek drivers from msi multiple times, but for some reason this device is being listed as a system device and not a sound device. Because of this, the driver install process is not recognizing the proper drivers. And to make things worse, M$, in their infinite wisdom, removed the hardware troubleshooter from 1809, because analytics showed it was the least used troubleshooter. I call bs on that decision. If the troubleshooter was still present, it might, just might, be able to help solve the issue.","Although risky, and not for the faint of heart, I wonder if we could go in to the registry and move the devices location of the device manually from system to sound, video, and game controllers.","When i try and install the latest drivers from Msi, manually, windows blocks me saying the .inf does not contain drivers for my device. I know for a fact that this is not true. I believe the driver install is being blocked because the system thinks the device is a system device, which is wrong. I unhid the devices in device manager, and any device listed related to related or a-volume, usa listed as not being attached to the system. There is even a phantom realtek device in the sound category. I tried removing it, as well as a the erroneous entry in the system listing,  but it won't accept the driver.","I tried removing all phantom devices related to the realtek device as well as the device listed in system, and then manually added the device using add legacy device option, but when I did so, immediately after the driver install process started, I got a good, system thread exception not handled from rtkvhd64.sys. I may end up having to return to 1803 at this point.","I am facing the same issue. Please help us out as soon as possible. "]},{"symptom":"Bluetooth headphone only connects to voice ?        I had been using Boat Rockers 480 V2 Bluetooth 5.0 headphone.When I tried to connect it to my laptop the device connected as voice only, I cant use the device as a playback device.I connected the same device to a different laptop and it pairs as voice and music.I have connected a different Bluetooth speaker with my laptop and it worked fine.Laptop: Dell 7560 Core  I7Windows 10 Home 1909Current Situation of the device :","solutions":["Hi Salomon. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I will give you everything that's working for others with known issues with Bluetooth and headsets:First HEADSET: First try the steps here: https:\/\/www.maketecheasier.com\/fix-headphones-n...https:\/\/www.windowscentral.com\/setting-your-hea...https:\/\/www.lifewire.com\/fix-headphones-not-wor...https:\/\/www.thewindowsclub.com\/headphones-not-w...https:\/\/merabheja.com\/fix-no-speakers-or-headph...https:\/\/troubleshooter.xyz\/wiki\/fix-headphones-...Go to Settings > Devices > Autoplay to look for the device and change the default behavior in it's Dropdown Menu.Right click Volume icon in System Tray at right end of task bar, Open Sounds Settings, in dropdown menus at top make sure Headphones are selected and Connected for both Playback and Recording Default Devices.If not again right click Volume icon in System Tray to choose Troubleshoot sound problems.See how to re-enable the \"Which device did you plug in\" popup which can solve headset issues:https:\/\/windowsreport.com\/you-just-plugged-unpl... (avoid ad links)https:\/\/h30434.www3.hp.com\/t5\/Notebook-Audio\/En...https:\/\/forums.tomshardware.com\/threads\/how-do-...https:\/\/www.dell.com\/community\/Windows-10\/How-g...https:\/\/answers.microsoft.com\/en-us\/windows\/for...Go to the Device Manager reached by right clicking the Start button, choose Sound controller device, on Driver tab choose Roll back or Uninstall, restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver. Do the same for the headset device and\/or it's microphone. Update the Sound driver from the PC or Device maker's Support downloads web page. While there also check that the Chipset, BIOS, Display, USB, Network and all other drivers are the most current.Sometimes it helps to unpair or disconnect all other Bluetooth devices from the PC in Bluetooth settings, then try again to connect the headset.BLUETOOTH Troubleshooting: See Fixes here: https:\/\/support.microsoft.com\/en-us\/help\/14169\/...http:\/\/superuser.com\/questions\/823894\/how-to-ma...Try the Bluetooth troubleshooter at Settings > Update & Security > Troubleshoot. Try turning off Fast Startup at Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change settings that are unavailable > uncheck Fast Startup.Try Updating the Bluetooth driver from the PC maker's Support Downloads webpage for your exact model. Install it even if it's the same or newer than the one in Device Manager reached by right clicking the Start button.Right click Start button to access Device Manager, locate Bluetooth device (if necessary from View tab Show Hidden Devices), on Driver tab see if Roll Back is available, if not try Update Driver, first automatically, then Browse, then Let Me Pick to try all previously installed Drivers. If these fail try to Uninstall the Driver, restart PC to reinstall. Then try pairing again, if necessary run the Bluetooth Troubleshooter again. If you think the BT adapter has failed, you can replace it easily with a USB nano adapter like this one:https:\/\/www.amazon.com\/ZEXMTE-Bluetooth-Receive... ___________________________ If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1909 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","The marked device is should be the active one , how can I fix the issue?","Did you re-enable the Which Device did you plug in? popup to try to set the correct one as default?Continue with all steps which usually fix it.","I unable to enable the device,need help in fixing the issue.The device always connectsas voice, not as music.How to fix this issue?  ","Did you follow all steps including all of those in the illustrated tutorials?I asked if you followed ALL the specific steps to get the prompt \"Which device did you plug in\" from this section:See how to re-enable the \"Which device did you plug in\" popup which can solve headset issues:https:\/\/windowsreport.com\/you-just-plugged-unpl... (avoid ad links)https:\/\/h30434.www3.hp.com\/t5\/Notebook-Audio\/En...https:\/\/forums.tomshardware.com\/threads\/how-do-...https:\/\/www.dell.com\/community\/Windows-10\/How-g...https:\/\/answers.microsoft.com\/en-us\/windows\/for...Please try these again now, restart PC, then plug in the headset and choose carefully which is the correct device that's plugged in, e.g. a headset with microphone.","I tried all the above steps as my device is a wireless one they don't work the way its mentioned.And the headset seems as disabled"]},{"symptom":"What will happen to Madobe Nanami when Windows 7 support ends?        as the subject says, what will happen to this OS-Tan?","solutions":["someone please repsond?","https:\/\/en.wikipedia.org\/wiki\/OS-tanWe don't work for Microsoft.You will have to ask Microsoft.@@@@@@@@@@@@@@@@@@@@@@@To contact Microsoft Support:Contact support         http:\/\/windows.microsoft.com\/en-us\/windows\/contact-supportAlso: https:\/\/partner.support.services.microsoft.com\/en-us\/contactus\/windows\/tech-services\/\"Microsoft office locations around the world\"https:\/\/www.microsoft.com\/en-us\/worldwide.aspx\"Global Customer Service phone numbers\"https:\/\/support.microsoft.com\/en-au\/help\/13948\/global-customer-service-phone-numbers@@@@@@@@@@@@@@@@@@@@@@@"]},{"symptom":"Windows 10 not allowing Google Chrome to access the camera        Hi,I've read a bunch of support topics and questions+answers, and none of them are yet to help.I have a brand new Asus ZenBook (UX ) running Win 10 pro. I have downloaded Google Chrome as my preferred web browser, and have given Chrome permission through the web browser. I get a 'hardware issue' error message, and video can not be used as part of FB messenger calls, or Webex meeting calls.I can see that in the Settings menu -> camera option, there is a section about 'allowing' apps access to the camera. I can see Microsoft Edge in this list, and have no issues using the camera with Microsoft Edge. I cannot see a way to add Google Chrome to this list, and it is not automatically available:It looks to me that Chrome should automatically be appearing here, but it isn't. There is also no 'option' to add in an additional app. How to I resolve this problem?This is the first Windows laptop I have purchased after 10 years of Apple MacBook's, and honestly, the fact that it currently appears that Microsoft locks you into using their own web browser (I use Chrome as set by my work, and the ability to log into Chrome and keep browsing history\/bookmarks between them is why I will not use Edge) is making me regret this purchase. I need the ability to access Webex-hosted meetings via a web browser, and join Facebook messenger calls. Please advise how I can get the camera to work on Chrome.","solutions":[]},{"symptom":"have created  everything needed  but the error  keep on (caant connect were having problems)windows phone 8.1help please        l have created everything needed but the error keep on can't connect we are having trouble when I want to download from the store,windows phone8.1,pleasehelp me","solutions":["I suggest that you repost in the correct section of the Mobile Devices forums here:https:\/\/answers.microsoft.com\/en-us\/mobiledevices\/forum?sort=LastReplyDate&dir=Desc&tab=All&status=all&mod=&modAge=&advFil=&postedAfter=&postedBefore=&threadType=All&isFilterExpanded=false&page=1"]},{"symptom":"BSOD bad config        My daughter was deleting stuff from my her laptop and evidently messed up her Windows 10.  It is an HP laptop with intel chip, 16 gb and we cannot get it to start up.  We do not have any bootable usb for it.  It states that the auto repair will not work, the system cannot be reset, cannot be set back to any prior version of Windows, etc.  Can anyone point me to the right place to fix this problem?  Thanks so much!","solutions":["HP Stream Laptop 14-cb1xxBios version: F.01Processor Intel Celeron N4000 CP& @ 1.10GHzTotal memory: 4 GBI was wrong about the memory","Hi JoyTSB, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.If you have a blank USB flash drive with at least 8GB of space, and access to another Windows 10 computer, you can create a bootable USB flash drive in order to try to repair it there.You can download the Windows 10 Media Creation Tool here: https:\/\/www.microsoft.com\/en-ca\/software-downlo...Please Note: This will erase all contents of your USB flash drive. Also, please be careful when using the repair tools, as you can erase all the data on the laptop if you choose the wrong option.These sites have some instructions that you may find useful: https:\/\/us.answers.acer.com\/app\/answers\/detail\/...https:\/\/www.thewindowsclub.com\/boot-or-repair-w...Note: These are non-Microsoft websites. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","Thanks Ashton,  We will try this tomorrow.  I will let you know if it will work for us.  What is the safest way to remove programs\/files to free up space on this laptop?","Hi Joy, You're welcome, please let us know if you need a hand with anything! Typically, scanning the list of installed programs will allow you to see currently installed programs, and you can uninstall some of the programs you might not need. I would suggest to take care doing this, as some computers come with specific software to enhance the experience, and I would be cautious not to just uninstall programs that you may not know the functions of.You can see the list of installed programs at Start > Settings > Apps > Apps & features.If you are still low on disk space, you can use a free tool such as TreeSize Free to show what files\/folders are taking up the most space. Again, I would suggest only looking into folders that you have created yourself, as a lot of the system directories take up the most space (for example, do not delete anything from C:\\Windows or C:\\Program Files).This app can be downloaded here: https:\/\/www.jam-software.com\/treesize_free Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Please reach out if you have any further questions! -Ashton","How big is the C:\\ drive? ","Restore PC to a Normal System State by Using System Restore FunctionGenerally speaking, the easiest and most effective way to fix Windows Automatic Repair not working issue is to click Restore button when you see the Windows couldn't load correctly error.Then, Windows starts to revert to a previous system state and reboot. Finally, you have just one more thing to do: recover removed data files after system restore!Now, you might be wondering:\"How to recover moved files after system restore?\"Now, you can try MiniTool Power Data Recovery to check whether it can find your lost data. You can download it on your computer","Sorry but I just wanted to clarify something on the two links in my first response:On the first Acer link, please only check the first part of the article on creating the USB media. The part under \"Reloading Windows with the Media Creation Tool\" would be if the other methods like Startup Repair do not work. Startup Repair and other advanced troubleshooting is on the second link at The Windows Club.","I don't know how big it is.  I got to the X: drive but don't remember too much on how to change directories and such from my education in the 80s lol.  I know she hasn't created any partitions or mirrors(?)  Just downloaded a bunch of little games and then started getting errors about not enough memory, so she started deleting stuff."]},{"symptom":"I have bought windows 8 and dont have the product key        I bought window 8 have disc  and don't have product key I have conformation #","solutions":["You need the product key to activate it.And Windows 8 has not been supported since Jan, 2016.You should have preferably bought Windows 8.1 and made sure the product key was included.You could have upgraded 8 to 8.1 for free, but you can't now as you have no product key to activate 8.Contact the seller.@@@@@@@@@@@@@@@@@@@@@The Product Key consists of 25 digits, divided into 5 groups of 5 digits and the layout looks like this:xxxxx-xxxxx-xxxxx-xxxxx-xxxxxThe 24 used are:2346789BCDFGHJKMPQRTVWXYThe 12 unused are:015AEILNOSUZ@@@@@@@@@@@@@@@@@@@@@"]},{"symptom":"Grayed out box with microsoft phone number to call. How to stop from popping up        How do I stop scammers posting fake support numbers.","solutions":["If you can't close your browser in a normal way: Open Task Manager (press Ctrl + Shift + Esc on your keyboard) and in the tab Processes end all browser processes.A good ad blocker should prevent pop ups\/fake warnings\/alerts\/ads etc. Tracking blockers help too.I use and recommend the free extensions uBlock Origin and Ghostery.Most browsers offer the same or similar extensions...  Also go through your browser's settings and adjust them to your wishes. For example, block 3rd party cookies etc.You might also want to reset your browser(s), see if you have any weird extensions\/add-ons...You might want to read: How to tighten security and increase privacy on your browser - Malwarebytes Labs | Malwarebytes Labs and Answers to common security questions - Best Practicesespecially Beware of Phony Emails, Phone Calls & Tech Support Scamswhich explains various methods how to get out of those fake alerts etcincludes Resources to protect your browser, privacy & help prevent browser pop-up ads and scamsexplains what to do when you keep on seeing these fake sites\/getting pop-ups etc despite having followed the above mentioned advices.Also:Protect yourself from tech support scamsTech support scamswww.microsoft.com\/reportascamhttps:\/\/blog.malwarebytes.com\/tech-support-scams\/:Tech Support Scams Information","Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.When your browser is frozen, just go to Task Manager and look for your browser then select End Task. When you open the browser again, X the tab with the offending site if possible to prevent it from loading and freezing your browser again.For more information on how to protect yourself from tech support scams, you can check this link:https:\/\/support.microsoft.com\/en-us\/help\/401340...I hope this helps with your concern! Please let me know if you have further questions.","Thank you very much I will try this tomorrow.","You're very welcome. Just let me know if you have further questions.","L36pI was wondering if you have read my prior post (Grayed out box with microsoft phone number to call. How to stop from popping up (Ṣmeed Replied on January 11, 2020)) at all?"]},{"symptom":"I cannot update my windows PC Error Codes 0x8000ffff or 0x80070005~ HELP!        I have spent the last 3 days and at least 8 hours trying to figure out why my PC wont update to Windows 1909update.  I have tried every possible idea from these threads and it still will not work!  It has caused havoc because I can't successfully use One drive and other things on my computer. Can someone please assist me.  I am at a loss and I am ready to throw this computer out the window! ","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command prompt DISM \/Online \/Cleanup-Image \/RestoreHealth Run these commands on the command prompt to restart windows update services net stop bits net stop cryptsvc net stop wuauserv net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start bits net start cryptsvc net start wuauserv net start msiserver After successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig 2. On the system configuration window go to the services tab 3. Tick on hide all microsoft service so that this won't be affected 4. Choose to disable all services 5. Next, go to the startup tab and on the window choose to open task manager 6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok 8. A prompt to restart the computer will show up, choose to restart This should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo... 2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept. 4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)"]},{"symptom":"Activation is lost due to changing hard drive to another pc for a while        Hello,I have problems with my PC that it sometimes it doesn't run properly but when it happens I switch my SSD to my laptop to fix it and get it back to my PC and it made me lose my activation although I have the key and enter it. it gives me error 0xc0ea000a and ask me to purchase a genuine copy although I have one on my Microsoft account!","solutions":["Activation is registered against the motherboard of the device so swapping the SSD (OS) to another device will mess up activation.If you keep doing this it could end up without activation as the servers may see it as an attempt to use activation illegally.Is your licence key a full Windows 10 retail licence.What are the problems you have that make you swap it out in the first place.","Hello , i'm Timon and i'm glad to help you. Activation depends on what type of license you have. If Windows came preinstalled with the computer, this is called an OEM license: the license is linked to the motherboard and is non-transferable.If you are in this case, you need to get a new license. The story is different for retail licenses, but it requires the licence to be linked to a Microsoft Account.The Activation troubleshooter rarely if ever resolves this, you best option is to contact Microsoft Support and ask them to help you re-activate your Windows 10https:\/\/support.microsoft.com\/en-us\/help\/405170...or Call\/Chat\/Schedule a Call https:\/\/partner.support.services.microsoft.com\/...","I had to reinstall windows 10 on my desktop SSD on my laptop since I don't have a working graphics driver from the mother board itself do I cannot do the installation process since the screen wont show anything up so I had to plug it in my laptop and I installed it from there, later on I plugged it back to my desktop and it was activated for 5-6 months until yesterday when I had an issue and I couldn't fix it through my desktop so I plugged it to my laptop to fix it then back to my desktop and I lost the activation on my desktop. I tried putting it in my laptop and it was activated there and I want to change that and when I checked the windows activated devices it was my laptop only although I have 2 devices linked to my microsoft account!","My display driver is not inside the motherboard and it is dedicated so anything before the windows boot doesn't show on my screen and I don't know how to fix that in the bios. So I have to put my SSD in my laptop to fix the start up issues and then put it back to my desktop.","There should be no issue accessing the bios with a dedicated graphics card or motherboard graphics. The graphics default to a standard VGA without any drivers.If you have the SSD disconnected and start the PC are you saying there is nothing shown on the screen. (no other drives either if you have more than one)","Hi . I'm Reinald, an Independent advisor and a Windows user like you. Thank you for providing information on your issue, we are are happy to assist you.To better diagnose your issue, can you please do the instructions below and attach the screenshot.1. Click Start > type CMD> Right click on \"Command Prompt\" and select Run as administrator > and type in the following command:slmgr.vbs \/dlv 2. A \"Windows Script Host\" box will pop-up Check \"Product Key Channel\". IT should tell you what type of license do you have Also, can you try to follow the instructions in the Microsoft guide for - Reactivate Windows 10 after a hardware change. Please follow the instructions based on the type of license you have (Digital License or Product Key):https:\/\/support.microsoft.com\/en-ph\/help\/20530\/...I hope this helps. Let us know how it goes and don't hesitate to ask if you have further questions. I will do my best to to assist you until your issue is resolved."]},{"symptom":"need to retrieve other users password in windows 10        Need to retrieve other user's password.","solutions":["Need to retrieve other user's password.If you have sufficient authority then you can reset another user's password but you can neverretrieve it.","Hi, My name is Will i'm an independent adviser. Is this secondary account a local or a Microsoft account? MS Account: Microsoft accounts can be recovered at account.microsoft.com. Local Account: Before continuing it's important to note that any EFS encrypted files on the user's account, including personal certificates, stored local and network\/web passwords etc. As these are encrypted with and therefore tied to the user's password they aren't recoverable. And that this process requires you to be logged in as an administrator account. Open the Control Panel and go to > User Accounts > User Accounts (click the title again) > Manager another user account > Select the account > Change the password > Enter the new password and select change password.You can now login with the secondary account by signing out or rebooting the machine. Again this only applies to local accounts those listed with an email address under the \"Manage another user account\" menu are Microsoft accounts and the user will need to recover that through any of the Microsoft sites themselves. I hope that helps.","MS Account: Microsoft accounts can be recovered at account.microsoft.com. The OP asked how to retrieve a PASSWORD. He did not ask how to restore an ACCOUNT."]}]}