{"windows":[{"symptom":"default graphics output driver        How do I locate the default graphics output driver on my computer?   I think there may be a problem with it. ","solutions":["Hi suemcp001 Open Device Manager (accessible by right clicking your Start Button) Expand the Display Adapters section In that section you may see one or two devices listed, is there an exclamation mark beside any device in that section?The best place to obtain a graphics card device driver is from the support page for your PC on the Manufacturers websiteIf installing a new driver does not resolve this for you, can you please provide a bit more detail on the problem you are encountering with the graphics on your PC . . .","You're talkijg about going to Settings, and then to \"Display\" or maybe \"System\" or \"Devices\" ?I don;'t see a list of devices. only one or maybe 2, depending on whether it's a device for \"computer\" or something else - - like \",monitor or DVD\"? I checked a couple of them - to look for updates (nothing has an axclamationa mark. Everything is fine. It is taking ove 5 minutes for the monitor to show something. Once it does, it works fine. I am not going to mess with the BIOS unless there is a logical reason to do so. When I look that up on google it suggests not to. I cannot see making any more changes unless a reason is given for doing so.","Hi, Device Manager is not located in settings it is a separate program. You can access it by right clicking the start button, and it's near the top of the list.Display Adapters category in the list, will list any Graphics Cards (integrated on your CPU or a dedicated Graphics Card like those made by AMD and Nvidia) installed on your system. From there you can right click > properties to view any information about the installed drivers.","Spectre-4Device Manager is not listed on my computer =- anywhere. I have found it, but only by chance.   If I go to Start, I do not get a coherent list. there is a list - on the left-hand side, though it doesn't say it is a list. But I have discovered through expereince that a series of lines does sometimes indicate a \"list.\"  What I get, at \"Start\" is a collection of boxes, created inadvertently by me, I think, as I say at tiems, Add to the collection of boxes (sic).    It has things in it such as PC, Documents, Norton, and several other things I use a lot. But if I go to the original \"List\" organized according to Letter - A, B, C - - to W and Windows , for example I get a lot of useless categories and items, such as \"Pictures\" which I have tried to no end to get rid of permanently, and XBox, and Cortana, Calendar, Excel, Groove Music, One Note, Sticky Notes, Skype, Mobile Plans, and so on. But nowhere is Device Manager listed, not even under Windows System.But under Windows System, Control Panel is listed, I discovered from working backwards having come across Device Manager by accident.Even under Control Panel, Device Manager is not listed,. Things such as Harware and Sound are listed, and under Hardware and Sound is listed, Add a device, but not Device Manager. I don't know if you had to pay to get an organized list of what is on your computer set up so you can find it easily, but mine didn't come this way,. It is just a cheap version of a better Acer product, no doubt, and it cost me $50 to have a newbie set it up at Staples a few years ago. I was under the impression he could do a better job than I could have but was mistaken, He was new to it too. So I wasted $50 and had a compter where I could get nothing to work right and spent many hours trying to undo the mess created, presumably, by an heir to the fortune who got paid to experiment and learn by creating a useless computer. Having Windows 10 only made it worse. Only if you have money in this world can you pretned to also have knowledge, provided to you at the expense of others,.and in a way that makes those without money look stupid. It's the same when trying to access a decent doctor in the health care system. The best are saved for those with money, Meanwhile, those without are used and manipulated by those who have a different agenda.  Anyway I did access the Device Manager within Control Panel, and came across Display adapters, of which there is only one, an Intell Graphics thing which was not conveniently marked with an exclamation mark, which another advisor thought it might be. But I persisted, and attempted to update it, and then closed down the competer and started it ujp again, twice, and both times it immediately showed the Acer image, beeped one, and went to the log-in page, iwthin seconds. thank you all for your help. "]},{"symptom":"Windows 10 Only Audio from USB Headphones        Hi, So i last tested this a few weeks ago before the windows updates and all was working but now I am struggling to get any audio out from my audio jacks on the front of my pc case or from the back of the motherboard. The only way i can get audio is if its from my monitor or usb headphones. It also has affected Spotify some how and when i switch to either Realtek Digital Output (2-Realtek(R) Audio) or Speakers  (2-Realtek(R) Audio) it doesnt play any songs but rapidly skips through them. I try splitting to audio through two different outputs Stereo Mix recently and perhaps i have completely disabled something? Its really annoying me as i want to be able to you my aux splitter but i cant get any sound out at all. Any help would be mush appreciated. :) ThanksEDIT: FIXED disabled\/enabled and removed the device from device manager and scanned for hardware changes on sound then the problem was fixed.","solutions":["Hi , AlphaHc my name is Dennis, I'm an independent advisor and I'll do my best to help today. This will help people who have the same problem. :) Thank you. Regards, Dennis."]},{"symptom":"Non unicode Greek charactes problem        Hello,I tried a lot to install a greek engineering software, but i have a serious problem with my non unicode characters. I own a razer blade 14\" (2017) bought from america (if that make any sense). I made (without changing something) those steps:- Control panel-region-administrative tab (greek). I switch between Greek and English many times without fixing my problem.- I format my pc, downgrade to v1703 build 15063.332, because i want to install manually update KB4020102, which i found that fixes the Greek non-unicode problem. Try to install it, but nothing happened again. After that i made all the necessary updates (v1909 build 18363.535 at the moment), but the problem still exists.- I deleted all fonts from regedit (HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\FontSubstituts) , and after that switch again to English (from Region-Administrative area) and reboot). After rebooting i switch again to Greek (at region area) and reboot. After that i tried again to install my software, but no luck again.I am confused and near to break down the laptop. Please help me out!","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues while installing Greek engineering software. For further clarity on the issue, please respond to the questions below: What is the error message that you receive when you try to install the application?Which program are you trying to install? One of the things that I would suggest you is to try installing the program in compatibility mode and see if the installation goes through. Refer the articleMake older apps or programs compatible with Windows 10 Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"dell optiplex        I have the dell Optiplex works well but sometimes it seems like it freezes up or the HD-STOPS enjoy the systemany suggestions is there anything to turn off  always a delay in typingwhen i got it it was so fastshould i boot in safe mode what will that tell me?thank you","solutions":["Hi, timmaddox My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps: Press the Start key and type the word CMD or Powershell, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanu p-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/929833...","did that still running like a turtle and freezing up","Configure a clean Windows startup and then check if your PC is still slow and you can add the programs in parts to see what is causing problems.https:\/\/support.microsoft.com\/en-us\/help\/929135...","did clean boot could not even open g mail","I recommend that you repair Windows completely before you must make a backup of your personal files, third-party software will be removed. Here the link to download the Windows ISO.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"my computer screen went black        Suddenly without warning my computer screen went black.","solutions":["Hi Elizabeth,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Have you tried restarting the computer?What is the make and model of the device?","Yes, I did restart it and it is up an running. This is a new HP desk top. It seems to be ok now. Thanks."]},{"symptom":"windows sticky notes won't minimize at once        It's so frustrating!it happen since one of the upgrades on Windows build 1903it doent happen to me on another computer on windows build 1803Here is the problem video captured:https:\/\/www.youtube.com\/watch?v=dewGuwYyQjQ","solutions":["Hi דניאלמ Greetings! I am Andrew M, an Independent Advisor. I am here to work with you on this problem.To minimize or maximize Sticky Notes at once, you can click on Sticky Notes icon on Windows Taskbar to do it, you can also rely on the following link>https:\/\/answers.microsoft.com\/en-us\/windows\/for...In case that if it hasn't been helpful, please let me know. Best regards, Andrew M.","Thanks for your answer.Just to be clear: I'm trying to minimize all notes AT ONCE (meaning: one click = all of them are minimized)As you can see on the video, when i click on the taskbar to maximize it gives me a visual list that i should separately pick a note fromWhereas minimize doesnt work at all.Watch the video.","I am having the same issue, I have access to 10 + computers but only have this issue on 1 PC.","Hi there,I am from the Sticky Notes team. We adopted some modern APIs in Windows version 19H1 as of our 3.6 release, which added support for things like multi-desktop but also had this effect. Thanks for the feedback, we hear you.Thanks,Allie","When will this be corrected?","Hi there,I am from the Sticky Notes team. We adopted some modern APIs in Windows version 19H1 as of our 3.6 release, which added support for things like multi-desktop but also had this effect. Thanks for the feedback, we hear you.Thanks,AllieLooking forward to this being resolved. I enjoy Sticky notes and so do my users. I hope this can be fixed soon.Chris","This new \"feature\" makes Sticky Notes unusable.  I can't bring all notes to the front, or minimize all of them.  Any note that covers my desktop has to be independently minimized.  If this can't be fixed it is probably time to look for an alternative.  I love this app, and use it every day, although now it just gets in the way.  Please revert this as soon as possible","I have just completed the latest updates...  my sticky notes are now all permanant on the desktop (7 of them) and I also now have 7 sticky note icons in my task bar.  If I click on one of the 7 icons, one of the SNs closes (or opens) .  If I mouse hover on one of the 7 icons... I get 7 thumb nail pictures of the 7 SNs. All I want is to click on one icon to open or close all my sticky notes...... I dont need a task bar full of icons nor do I want thumb nail photos of my SNs that are all open on the desktop anyway.  Can i reverse the update please?","Hi there,I am from the Sticky Notes team. We adopted some modern APIs in Windows version 19H1 as of our 3.6 release, which added support for things like multi-desktop but also had this effect. Thanks for the feedback, we hear you.Thanks,AllieI have the same problem. Sticky notes is not usable after update. Time to look for an alternative, unfortunately.","Yeah, I guess time to look for an alternative. I love SNs very much and I used it everyday but now it is just a garbage on my desktop and taskbar. Sorry for the profanity but I only like to say what I feel honestly."]},{"symptom":"downloaded software will not run        I downloaded an exe file with certificate from a known good source.  When I click on it, I the window asking if I will allow the software to change my computer.  I answer yes, then the window closes and nothing happens.  I have successfully downloaded and run other software.Any ideas?","solutions":["Hi Stephen, thanks for posting your question in the community! My name is David an independent advisor and I am here to help you.In the situation you are presenting, I would like you to please execute the following two processes as a first step:1. Use the installation troubleshooting tool that you will find in the following linkhttps:\/\/support.microsoft.com\/en-us\/help\/17588\/... could this could help us repair some damaged records if necessary.2. I would like you to install the software in a new local user profile, you can create the user profile by following the steps in the following linkhttps:\/\/support.microsoft.com\/en-us\/help\/402692... this will help us to rule out that the incident is directly related to your user profile and not to any system file.I would also like to ask you: did you identify this incident after another program or an update was installed? Did you see any weird changes in your device before this incident happened?Let me know the result of the shared processes and if these have been useful or if you still need more help, I will be waiting for your response.","Hi,The troubleshooting tool did not work. Installing a new local user profile did and the software runs under both new and old users.  Thank you, my problem is resolved.  Is there any reason to keep, or not keep the new local user?Steve Shapiro","Hi! Thank you for keeping in touch and reporting the results of the processes, I'm glad I helped you solve your question.In this situation it will depend on if in your old profile you have no problems installing more software, if with other programs you present the same incident, your profile may be damaged and you could consider migrating the same to the new profile. But if you don't present the incident with other applications, you can delete the new user profile you created.Remember that if you have more questions or doubts you can consult again, have an excellent day, greetings."]},{"symptom":"Monitor Flickering Issues        Scoured the internet and could not find a solution and I am at the final straw.Every time I play something full screen like a Youtube video, a game like Minecraft, or some random Steam game, or anything that goes full screen, my monitor flickers black. It usually happens when a quick motion happens on the screen; never when it's still. I highly doubt it's a internal problem in my monitor because when I had Linux this issue never occurred. Sometimes it just straight-up stays black until I exit out whatever I'm in (I've had to Alt+F4 a lot of things). It happens every other day as well, like say today it was working normal, tomorrow it wouldn't be working, but then the next day after that it would, and then repeat. And yes, I've checked (6 times at this point) that yes, my graphic drivers are in fact updated. My friend who built my computer in the first place doesn't know what's happening or he does, but he's just too lazy to fix it and tells me to just not use full screen which ticks me off.If any of this information helps, here it is:GPU: Radeon RX 580Monitor: Acer SB220QMonitor originally came with a VGA cable to plug in, so I had to get an HDMI cable for it.Yes, I've checked connection with the cableYes, I've checked for driver updatesYes, I've tried clean bootingDrivers are from manufacturers websiteUPDATE: I've figured out that it occurs after I've left my PC off for a long amount of time like when I go to sleep. Also, it fixes it everytime I restart my PC. There are some games that work, and some that don't. Every fullscreen game flickers. The only exceptions is (if it helps you to know the titles) Geometry Dash, which never works right (yes, I've reinstalled it multiple times) it flickers whether or not I've restarted. Even after the clean boot it only worked for a little longer than usual before it went back to flickering, and then there's The Joy of Creation: Story Mode (horror game FYI). The Joy of Creation has always worked, and has never flickers ONCE no matter what I've messed with its settings, it has always worked perfectly fine. The only difference with this one is I downloaded it after I activated Windows 10. Oh, and Geometry Dash was the first game I ever got (If you don't count Steam as a game). ","solutions":["Hi Anonymous. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) How exactly did you check your Display adapter is latest? Running Update from Device Manager isn't even a start. Plus it's critical enough you may need to reinstall it, find another driver, an older driver, etc.Update the Display driver from the PC or Display adapter maker's Support Downloads web page for your exact model number, HP Serial Number or Dell Service Tag - from the sticker on the PC.While there check also for newer chipset, BIOS\/UEFI firmware (very important), network, sound, USB3 and other drivers, comparing to the ones presently installed in Device Manager reached by right clicking the Start Menu.If this doesn't give you the latest or ideal driver for what you need, compare it to the driver offered by the Intel driver update Utility here:http:\/\/www.intel.com\/content\/www\/us\/en\/support\/... or the Nvidia Update utility here: http:\/\/www.nvidia.com\/Download\/Scan.aspx?lang=e... or the AMD autodect utility here: http:\/\/support.amd.com\/us\/gpudownload\/windows\/P... For Display issues one fix that is working is to Roll back or Uninstall the Driver on the Display Device > Driver tab, restart PC to reinstall driver.You can also try older drivers in Device Manager > Display device > Driver tab > Update Driver > Browse > Let Me Pick.Then you will know you've tried everything in addition to Windows Update drivers.Adjust the screen resolution until it fits and looks best at Settings > System > Display.2) Did it ever work correctly? If so can you System Restore to a point before the problem began following this guide:https:\/\/www.windowscentral.com\/how-use-system-r... 3) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 4) Try running a Linux live distro from flash stick with the hard drive disconnected which will narrow the issue to the remaining hardware if it repeats, and if it doesn't then points to the hard drive or Windows install. Use a Linux distro with diagnostics to stress the hardware: https:\/\/www.pcsuggest.com\/best-linux-live-distro\/5) Test the RAM overnight to stress it with the best bootable test memtest86, following this guide to test both sticks and slots:https:\/\/www.wikihow.com\/Test-PC-RAM-with-MemTest86Run Crucial System Scanner to check the RAM is properly spec'd and configured: https:\/\/www.crucial.com\/usa\/en\/systemscanner?cm... 6) Test the hard drive or SSD with diagnostics: https:\/\/www.lifewire.com\/free-hard-drive-testin...https:\/\/mashtips.com\/ssd-health-test-and-perfor...HP and Dell have hardware diagnostics triggered by tapping the ESC or F12 keys respectively as you power on.Best is to use the HDD\/SSD manufacturer's own if there is one, otherwise use Seatools bootable long test:http:\/\/blog.nowherelan.com\/2013\/04\/04\/boot-seat... Follow this up with a full Disk Check from the Command Prompt in Repair Mode or from bootable media:https:\/\/www.groovypost.com\/howto\/check-hard-dri... if necessary from the Command Prompt at boot:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... -------------------------------------------- But remember that in Windows 10 everything depends upon the quality of the install, and Factory or Upgrade installs are inferior installs which most enthusiasts won't even run because they'd expect endless issues. Consider now or later doing the Clean Install in this link which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... There is also an automated Fresh Start that reinstalls WIndows while shedding corrupting factory bloatware, saves your files, but doesn't clear the drive to get it cleanest:https:\/\/www.howtogeek.com\/265054\/how-to-easily-... I hope this helps. Feel free to ask back any questions and let us know how it goes. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Ok I waited a few days (why I'm replying late) after I reinstalled my graphic drivers and it is now working. I thought about doing it before, but I decided to do more easy fixes, and I forgot about it when I got desperate. Thanks!"]},{"symptom":"My BD-ROM Drive which takes compact disks dvd and blue ray isnt working after everything.        I Have tried all of the solutions except deleting \"registry keys?\". Why. Would. You. Delete. Registry. Keys? Anyway It did work when i was using Win7 and Win8 and 8.1 also it was working with version 1809 but now im on 1909 and its not working. I am using a normal Pc. Here are my specs. Please help.","solutions":["HI Paul. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.First try the steps here: https:\/\/www.groovypost.com\/howto\/fix-dvd-cd-dri... Did the drive work in that PC before? If so this might have been caused by Windows Update. Did you receive Windows Updates recently? Check at Settings > Update & Security > Windows Update > Update History. You can try uninstalling any affecting Updates there.You can also try to System Restore to a point before this happened: http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... See if the problem returns with the Update reinstalling and if so uninstall it and block it using the Hide Updates tool:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... To attempt to repair this, go to Device Manager reached by right clicking the Start button. On the View tab, choose Show Hidden Devices. Under DVD Device, click on Driver tab, first try Update Driver > Automatically. If that fails see if Roll Back is available. If not choose Uninstall, restart PC to reinstall the driver. Next right click Start button to open Disk Management, scroll down to find the DVD drive. Does it have a drive letter? If not right click to issue a drive letter so it shows up in File Explorer, save and exit.Run Hardware troubleshooter at Settings > Update & Security > Troubleshoot You can also straighten out a paper clip and try to mechanically press open the door by putting it through the tiny hole next to the door and press firmly inside against a metal lever it should contact.If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... These drives do fail so if nothing else works you can search Google for a replacement DVD drive for your PC make\/model and a video showing how to replace it. Most installers and video files nowadays also use USB so you may not need one.FYI there is no DVD player in Windows 10, they want you to buy one from the store. There are better free options here:http:\/\/www.pcworld.com\/article\/2953724\/windows\/... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"How do I play PS3 on a pc monitor        Hi Microsoft. I just got a ps3 and I'm trying to play with it on my pc monitor. I connected both ends of the HDMI but nothing happened. I tried everything youtube told me but nothing happened. How do I play my ps3 on my pc?","solutions":["Hi Abdallah. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.If it's the monitor only then that could work, but most PC's only have HDMI out so unless your PC has both Output and Input HDMI then it will not work.To connect the PS3 to an HDMI monitor see here: https:\/\/support.playstation.com\/s\/article\/Conne...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Application installer ended up requesting me to lookup the application in store        Hi,I'm trying to install Dell Touchpad Setting application.  I downloaded the application installer from Dell.  However, it finishes in a second and opened the link to lookup the application in Microsoft Store.In Update setting -> For developers, Sideload applications is enabled.What is missing here?Thanks","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We reproduced the issue and when we downloaded the Dell Touchpad Setting application file and then tried to install, it redirected to the Microsoft Store. We extracted the file and seems that there is xml bat file, which is redirecting us to the Microsoft Store. In this scenario, we went ahead and installed Dell touchpad settings from Microsoft Store and successfully installed it. We would like to know, if you have installed the Dell touchpad settings from Microsoft Store and was it installed successfully. The Dell manual for Touchpad Settings Application says\"This package guides you to the Microsoft Store to download the Dell Touchpad Settings application.\" So you may have to install this application from Microsoft Store. However, if you need a standalone application, I would also suggest you to check with Dell Support and see if they can provide the standalone application. If you face any issues with the installation from Microsoft Store, please let us know the error and the model of your computer. We await your response. Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"Windows 10 home won't activate, error code 0xC004F213        replaced a lot of hardware on computer, logged in to my windows account which I believe has a digital license attached to it for windows 10 home edition, doesn't activate and I get the corresponding error code.tried trouble shooting and wasn't able to activate windows and told me to buy a new copy, tried the \"I recently changed hardware on this device\" option, had two different devices, neither worked. tried removing said devices from account. didn't work. what should I do.","solutions":["Hi, Bongani, If part of the new hardware was a Motherboard that wasn't from the original PC manufacturer, you have created a New PC. It would then be necessary to purchase a New License for the unit.Follow the steps in this support wiki on Activation Troubleshooting https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"Hello microsoft 10         I bought a laptop that has Windows 10 hello installed and I'm trying to figure out if I can get past the fingerprint lock pin password lock send email to person but no response","solutions":["Hi Justin. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.We're not able to help circumvent passwords here since we don't know who you are or where the laptop came from. If you cannot get the password from the user, then you'll need to create bootable media to wipe the drive and Reset the PC which is what should be done when a PC is transferred anyway. To create Windows 10 Installation Media on another PC install Media Creation Tool and follow the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, on second screen choose Repair Your Computer, then Advanced Troubleshoot Options, then System Restore and Uninstall Updates. If that fails go back to Troubleshoot Options to do a deep-clean Reset.If that fails choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, click Next to let it create needed partitions and start install - this makes it foolproof.Everything needed to get the best possible Clean Install is here: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... It is a better install than any amount of money can buy and a great learning experience that will make you the master of your PC because you will learn what works best and how to apply it with your own hands. I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Wow...thank you so much. Will give it a shot"]},{"symptom":"Associate a file extension in Windows 10        Hey, I have just installed Endnote X9 (Referencing Manager Application) on my second pc..  It has created a icon for it and the program opens up and I am able to access the usual link through Word.My issue though is when I download the citation (reference) from my web site, which creates a \".ris\" file, i am supposed to be able to import that into Endnote. However when I click on it to import, it opens with Adobe Reader... So, I checked the \"file association by type\" and discovered Adobe Reader was assigned to the ris file extension.Now the fun part... It will not allow me (give me the option to remove or change) from Adobe to Endnote. It will only allow me to select Adobe or The Microsoft Apps. Even scarier is that a second extension used by Endnote is associated  correctly..Any help would be appreciated","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.If you right-click one of these files in Explorer, you should have an \"Open with..\" option half way down the menu - click that - in the next window scroll all the way to the bottom of the list of options and you should have \"Look for another app on this PC\".If you use that option it will let you manually locate the executable for Endnote so you can associate it with the file type. It looks like you'd find the executable in the path \"C:\\Program Files\\Reference Manager X\", although I'm not familiar with this particular app. Also if you tick the \"Always use this app to open .ris files\" it will stop them going to Adobe permanently.Regards, David","GHi David,, thanks for the quick reply.. Will try that (should have thought that myself..lol lol ) Stay Tuned..Thanks","You're welcome! Let us know if there's anything else. If you don't have any more questions, feel free to choose a rating. Thanks!","Go Settings, Apps, Default apps, at the bottom Choose default apps by file type, scroll down to the file type, click on it and pick an app.make sure your app is active."]},{"symptom":"Windows Disk Defrag not running as scheduled.        Have a HP laptop running Win 10 Home.  Has a SSD drive.  Have Disk Defrag scheduled to run weekly.  It has yet to run a scheduled defrag\/optimization.  No error messages, and if I run it manually, it runs as expected.  Computer is left plugged in and powered up almost all the time.  I have never installed any third-party utility software on this pc that might possibly be conflicting with built-in scheduled tasks.  From what I've read about SSD drives optimizing is not a hugedeal as compared to platter drives, but I'm wondering why this is happening - or, not happening.  Is there a threshold of fragmentation percentage that has to be met for it to run, or what?  PC's only about 3 months old and I haven't put a lot of stuff on it as yet.","solutions":["Hi Pan,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.1. SSDs do not need optimization and Windows does detect if there is an SSD. In fact, doing an optimization on an SSD affects it's health. Hence Windows isn't running the same.2. Even if it was an HDD in the PC if there isn't enough data you do not need defragmentation. 2\/3% doesn't matter.Hope that helps.","What is yours showing? This is mine and I don't worry about it. My Desktop is two years old now.","An SSD should never be defragmented ... Windows knows this. Instead, Windows runs the TRIM command on SSDs - which is what is supposed to happen. The TRIM command runs when needed, not according to a schedule.Bottom Line: You have nothing to worry about.  😁Bonus tip: The colloquial name for the TRIM command is 'garbage collection.' I kid you not!","I will add this link in reference to SnS reply. Pan Demic you may want to look at this.https:\/\/www.pchardwarehelp.com\/guides\/optimize-ssd-windows.php","Thanks to all who replied.  Yeah, guess I misspoke a bit in my question post using the term defrag - the built-in Windows OPTIMIZER doesn't do a physical defrag when run, but instead the TRIM routine designed for SSDs, as mentioned in the replies.  So itcould be run frequently without beating up the storage cells, it's just not necessary.  I was just wondering why there's even an option to schedule optimizations if they're only going to be executed when necessary - e.g., above a certain threshold of fragmentation, which will probably never happen in normal usage anyway.  It seems as if Microsoft should've completely refurbished the UI for their disk optimizer since it works differently now... but then just now thinking about it I guess they're trying to split the difference since I'm sure there are plenty of machines that are running Win 10 and have good ol' spinner drives which would use the old-style physical defragmenting task.Finally since HoraceWiggins was nice enough to show me his, guess it's only fair that I show mine...."]},{"symptom":"Timeline downloads a copy of Office files from OneDrive instead of opening the files in the corresponding web or desktop Office application        When opening an Office file stored in my OneDrive for Business by clicking on it in Timeline, the file does not open in the corresponding web or desktop Office Application.Instead, my browser downloads a read-only copy of the file (and presents its usual file download dialog: \"Do you want save or open this file.\")(It doesn't matter which browser is used.)To reiterate, the problem is that Timeline downloads a copy of the file instead ofopening it.It didn't always do this, but I can't say when the problem started. I am on Win 10 Pro, Version 1909, Build 18363.535","solutions":["Hi M. Kindly check this article on how to use Office for the web in OneDrive: https:\/\/support.office.com\/en-us\/article\/using-...Please let me know if you need further assistance. Thanks and regards","Your reply indicates that you have not understood the issue I am experiencing.","I just noticed something:Files with OneDrive URLs work properly (they open).Files with Sharepoint URLs don't work (they download)."]},{"symptom":"What to do when no Microsoft apps work        Not a single Microsoft app will launch except Edge. Not even the feedback hub will launch. My camera and image viewer have also stopped but I've got alternatives that work for those.   I've tried resetting everything. I've checked for updates. I am logged in to a Microsoft account. Checked date, time, and language. ","solutions":["Hi NSZ. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Re-register Store apps from Option One here: http:\/\/www.tenforums.com\/tutorials\/3175-apps-re... If that doesn't do it then run a Repair Install by installing the Media Creation Tool from this linkhttp:\/\/windows.microsoft.com\/en-us\/windows-10\/m..., choosing Download Tool Now, install the tool, open it and choose Upgrade this PC Now. . This will save your files and apps while bringing you up to the latest version by the most stable method. It will also bring all of your Updates current and solve most problems since it reinstalls Windows.If you want to try to fix it first you can go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. If any steps cannot be performed normally then try them in 1) Safe Mode with Networking (so you have internet) or 2) Safe Mode accessed by one of the illustrated steps in this guide:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf.... You will need to use your password to get into Safe Mode as a PIN is not accepted.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"How to find\/fix lost Minecraft Windows 10 Edition worlds        If you have lost your world (meaning when you open the game your world is missing) this may be helpful. THIS IS FOR WINDOWS 10 EDITION ONLYI have had this problem and have fixed it using this method (couldn't find anything to help so i figured it out then made this, so you won't have to figure it out yourself). Just so you now my problem occurred because i had a power outage as my world was saving after i closed it. I don't know if it may work for you, but best to give it a shot, it's short and easy.First off open Minecraft and make a new world (give the world the same settings as you old one, as the settings will change after the process). Save and close and save the world, then close Minecraft.Then, open files explorer. go: This PC\/Local Disk (C:)\/Users\/User\/AppData\/Local\/Packages\/Microsoft.MinecraftUWP_8wekyb3d8bbwe\/LocalState\/games\/com.mojang\/minecraftWorldsIf you have trouble finding the folder try this: https:\/\/help.ableton.com\/hc\/en-us\/articles\/209070509-How-to-access-hidden-folders  It is easier if you only had one world (I did) but there should be two (maybe more for you) folders in the minecraftWorlds folder that has a few random looking characters. As I said I only had one world so for me there was two folders, my old lost world and the new world I had just created. If you have more than two folders you may just have to do some trial and error, although they are in order of creation with oldest being at the top, newest at the bottom (the bottom-most folder is your new world). Open you newest world folder (the one you made earlier) go to the db folder, delete everything in there (not the db folder itself. Go to your lost worlds folder, go to the db folder (for me there was another \"lost\" folder in db, that's fine). Copy everything in the db folder, including the \"lost\" folder. Go to your new world folder, go to the db folder, paste the contents from the old db folder into the new. Open Minecraft, go to worlds (the world should still be called \"My World\", you can edit it later). Open the new world and you should find it has become your old world.I hope this helps ! I have not seen anything else explaining this so I this helps some people, happy mining!","solutions":["This helped me restore my world, thank you very much for the help! I was wondering if this would affect achievements? Thanks in advance. After turning my laptop on, when suddenly it shut down as I was loading my Minecraft world, I found it missing.","I don't know about achievements as my world was creative, but i doubt it affects it.","I can't thank you enough!!! You just saved my world. MC crashed and my world was Gone. I tried so many things and I was extremely upset. Butttttt, This worked. And to the person who asked... Achievements are still on. ","So my laptop was randomly frozen and I had to restart it, which caused my world to disappear. Me and my friends spent so much time on it, so I tried my best to fix it. Fortunately, I found your article and I was able to save my world! Thank you so much! ","Does this work for if someone deletes your world intentionally? ","Thank you so much","When i tried to go to the folder with my worlds in it, it wasnt there. I looked at the link to find it, but no results came up. Can someone plz help","You're actually my hero!!! Thank you so much!! My game crashed and deleted my world I had with my friends and I started panicking.","Hello.  My world was deleted by a Dell tech as I was having another issue with my F keys not toggling.  He reinstalled but my world wasn't there.  So I created a new world.  He did a system restore from a few days ago but the only world that is there is the new one.  Any ideas?","Was this after making the new world, the new world is the onw that is supposed to be there, not your old one."]},{"symptom":"Vietnamese keyboard layout        Firstly, I would like to thank you Microsoft and the developers behind everything that is Windows.You've added my decade-long awaited feature which is the native telex keyboard input for Vietnamese language.However, it's still got several flaws which I'd like to point out and request improvements:1. The ability to change keyboard layout: currently, it only supports the most popular layout (English 101\/102 keys.) Living in Japan, all of my laptops and keyboards have the same Japanese 106\/109 keys layout and it's really hard to type using the new native Vietnamese input because they have different key locations. 2. The English input mode is brilliant since it supports multiple hardware keyboard layouts; you can add a new layout just with a few simple clicks and switch between them easily. Why can't other language inputs (such as Japanese or Vietnamese) do the same thing? The Japanese input mode allows you to switch between English and Japanese layouts, but it requires a full system restart!3. There's also this annoying bug: cloned words\/characters when typing in 3rd party applications such as chrome.I would appreciate greatly if the developers could take some time to look into these suggestions. Thank you.","solutions":["Hi Minh, Thank you for writing to Microsoft Community Forums. I appreciate your interest in Microsoft products. Thank you for noticing the missing features in the Vietnamese keyboard. Your suggestions and feedbacks are always appreciated. We do have a place, where you can share the suggestions and feedbacks, I would suggest you to share your suggestions and feedbacks in theFeedback Hub, where our developers can listen to your voice and constantly improve the features. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Windows 7 to win 10 upgrade        Hi,I have Toshiba Laptop with I7 , Q740 @1.73 Ghz. Ram 8.00 GB Is it suitable to upgrade Windows10 - 64 bits?","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Yes, however before purchasing Windows 10 visit the upgrade site ( https:\/\/www.microsoft.com\/software-download\/win...) and click \"Upgrade now\" button. You might be able to upgrade for free, the installer will also do a check to identify and tell you about any software which isn't compatible first and verify that you have enough free space and other checks, and you can also undo the install for the first few days and go back to Windows 7 if there's an issue discovered after you've upgraded.But in general the laptop seems well suited to Windows 10. Regards, David"]}]}