{"windows":[{"symptom":"Download photos problem        Hi, I have Win 10 and have taken lots of pics on my iphone 6S and downloaded them to my pc for at least 18 months.  Over the last couple of weeks every time I take new photos and then try to download the following occurs; phone asks me to Trust (or not) the computer which I ok.  iTunes fires up and starts syncing\/backing up the phone.  Meanwhile a window opens and the app starts looking for photos, this, whilst the phone is syncing.  Eventually the screen tells me that it has found say 1000 photos.  At this point it then throws up all the photos on screen with recent photos ticked for download.  When I ok the download the photos appear in the pc files. My problem now is that once the app states that it found the 1000 photos the whole process freezes.  I unplug, close and try the whole thing again, same result, I just can't download photos.  Spoke to Apple support and they think it's a Windows problem, reset my iPhone to factory settings and tried again, no joy.","solutions":["Hi T1. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.You can install iCloud on the PC or Onedrive on the iPhone and set either as your default Pictures save location on phone and it will seamlessly sync the pictures to PC in the background wirelessly. See here:https:\/\/support.apple.com\/en-us\/HT205323https:\/\/support.apple.com\/en-us\/HT201391https:\/\/support.apple.com\/en-us\/HT205328https:\/\/www.digitalcitizen.life\/add-open-config...Troubleshoot iCloud: https:\/\/www.igeeksblog.com\/icloud-sync-not-work...http:\/\/smarterware.org\/2019\/04\/cant-install-icl...https:\/\/miapple.me\/fix-icloud-for-windows-10-re...To continue troubleshooting iTunes see here: https:\/\/www.makeuseof.com\/tag\/10-top-itunes-tro...https:\/\/support.apple.com\/en-us\/HT204275https:\/\/support.apple.com\/en-us\/HT201413https:\/\/discussions.apple.com\/docs\/DOC-6562I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thank you very much for the info which I will try out,  however, I was using iCloud but getting the same results.  All I seemed to have with iCloud were problems, plus, was continuously told that I was reaching my limit and to buy more space, so I disabled it earlier today.  I'll restore it and go thro' your recommendations.  Will keep you posted.","I'd try OneDrive too since it's built into Windows 10. Also the iTunes fixes which work for most.Keep me posted on your progress as I will be here to help until the case is resolved.","Hi, I've put about 16 hours into this issue so far and gotten absolutely nowhere.  Tried all your suggestions but nothing has worked.  Been off at a tangent trying other things but all in vain.  I have downloaded a piece of software that allows me to transfer pics and I have installed Ebay (primary photo usage) onto my 'phone and can transfer photos ok via that route.RegardsRoy Collins"]},{"symptom":"volume icon not working in tray Windows 10        I have delt with this issue before and used msconfig to solve it however I can't seem to remember the string.Does anyone know the correct msconfig string to fix this issue?","solutions":["Thanks all. I figured it out. All is fixed and working properly now.","Hi Ernest,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.I guess you tried a clean boot. That's not required in my opinion. Please try restarting the Explorer process.https:\/\/www.tenforums.com\/tutorials\/5970-restar...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads."]},{"symptom":"Desk files        today, I logged into my home computer and noticed that the files that I saved to my desktop are missing from the screen. Instead, the applications that come with the computer are located on the screen.How do I get back to the previous screen ","solutions":["Hi Diana,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Press Windows+A and click the tablet mode tile. Does that help?If not you may share a screenshot with us for better understanding."]},{"symptom":"sound on streamed movies and youtube.        Just the other day, I ceased to have sound on Netflix and Youtube, while watching.  Everything works fine on CD's and music and movies in the computer, but now I have nothing.  Thought it was sound card but it wouldn't work on already downloaded files if it was.  Am I missing a setting.  The mute button on the keyboard is also correctly working.  Am at a loss.","solutions":["Hi,There are something you could have a try.Restart the computerUpdate your browserClose running programsClear browser cacheUpdate your Sound Card driveThanks"]},{"symptom":"trojan        my computer said I have a trojan... I scanned my computer and how do I know if I got it in time?   I tried downloading the malicious software removal tool for windows 10 but it keeps telling me its no longer availablewhat do I do ??","solutions":["Hi Carolyn, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved. Were you on-line and did a website all of a sudden tell you that you have a trojan? If so that is a scam - Right Click the Taskbar - Task Manager - Process tab - click the browser (Edge or what you are using) then click \"End Task\".If you need to check for malware here are my recommendations - these will allow you to do a thorough check and removal without ending up with a load of spyware programs running resident which can cause as many issues as the malware and maybe harder to detect as the cause. No one program can be relied upon to detect and remove all malware. Added that often easy to detect malware is often accompanied by a much harder to detect and remove payload. So its better to be overly thorough now than to pay the high price later. Check with these to an extreme overkill point. How do I find and remove a virus? http:\/\/windows.microsoft.com\/en-US\/windows-8\/ho...TDSSKiller.exe. - Download to the Desktop - then go to it and Right Click on it - RUN AS ADMIN it will show any infections in the report after running - if it will not run change the name from tdsskiller.exe to tdsskiller.com. Whether it finds anything or notdoes not mean you should not check with the other methods below. http:\/\/support.kaspersky.com\/viruses\/solutions?...Microsoft Safety Scanner http:\/\/www.microsoft.com\/security\/scanner\/en-us...Malwarebytes - free http:\/\/www.malwarebytes.org\/products\/malwarebyt...SuperAntiSpyware Portable Scanner - Free http:\/\/www.superantispyware.com\/portablescanner...AdwCleaner http:\/\/www.bleepingcomputer.com\/download\/adwcle...Hitman Pro is a second opinion scanner, designed to rescue your computer from malware (viruses, trojans, rootkits, etc.) that have infected your computer despite all the security measures you have taken (such as anti virus software, firewalls, etc.).http:\/\/www.surfright.nl\/en\/hitmanproEmsiSoft Emergency Kit - Free - (if prompted do not install their software however do allow it to unpack the downloaded ZIP file so you can run the scanner).https:\/\/www.emsisoft.com\/en\/home\/emergencykit\/What is Windows Defender Offline? http:\/\/windows.microsoft.com\/en-US\/windows\/what...Windows Defender Offline system requirements http:\/\/windows.microsoft.com\/en-US\/windows\/wind...-------------------------------------------------------- If needed here are some online free scanners to help http:\/\/www.eset.com\/onlinescan\/---------------------------------- Other Free online scans http:\/\/www.google.com\/search?hl=en&source=h...Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all."]},{"symptom":"Общий доступ к файлам и папкам но локальной частной сети        Открываю на компьютере общий доступ к папке. В разрешениях указываю \"полный доступ\" Оба компьютера подключены к одной локальной сети. Тип сети - Частная. С другого компьютера общая папка видна. Но при попытке войти в нее пишет:\"Windows не может получить доступ к \\\\Home\\D на HomeРазрешение на доступ к \\\\Home\\D на Home отсутствует. Обратитесь к сетевому администратору для получения доступа.\"Нет у меня сетевого администратора. Я сам всем заведую.Кто-то может подсказать, как организовать общий доступ к файлам и папкам на другом компьютере в одной сети?Заранее благодарен. ","solutions":["Здравствуйте. Ознакомьтесь пожалуйста со статьёй Базы Знаний службы поддержки Microsoft \"Предоставление общего доступа к файлам по сети в Windows 10\":https:\/\/support.microsoft.com\/ru-ru\/help\/4092694Возможно, информация, предоставленная в ней, будет Вам полезна. Если это не поможет устранить проблему, то, пожалуйста, расскажите подробнее о конфигурации Вашей локальной сети.Какие учётные записи, локальные, или учётные записи Microsoft Вы используете на обоих компьютерах?Используются ли при входе в компьютеры пароли? Какой тип Вашей локальной сети, \"Домен\", или \"Рабочая группа\"?"]},{"symptom":"Windows S Mode        I am trying to use Adobe Connect for my video chat component of my online class. Microsoft S Mode will not let me use it. I followed the steps in the Microsoft Store to switch out of S mode, but when I click \"get\" it tells me that there is a problem on their end and to try again later. I have been trying for hours. The whole reason I bought this computer is so that I can use it for my online college classes, so apparently I need to get out S mode to do that. Please help!","solutions":["Hi AbigailVincent, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.I am sorry to know that you are presenting this problem, these steps have helped other users who presented this same problem, I hope they work for you too. Try the following:Right-click on the Windows taskbar >> Go to Task Manager >> Services >> wuauserv >> Right-click on this option, then restart the service, now go to the store and try again.How to Reset or Clear Microsoft Windows Store Cache in Windows 10 https:\/\/www.thewindowsclub.com\/reset-windows-st...Press the Windows key + I >> Settings >> Update & Security >> Troubleshoot >> Windows Store (Click on this option) >> Run Troubleshoothttps:\/\/www.tenforums.com\/tutorials\/128622-swit...?Press Windows key + X >> PowerShell (Run as Administrator) >> Copy and paste using the mouse button: Get-AppXPackage * WindowsStore * -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$ ($ _. InstallLocation) \\ AppXManifest.xml\"} + Enter, wait for the process to finish. This is a problem known to Microsoft on which it was working a few weeks ago, if the links cannot solve the problem, let's wait for news on this topic.Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Windows 10 .ISO installer not working on my computer        Hello i am trying to upgrade my Windows Vista to windows 10 by using the iso file (downloaded from the microsoft website) but every time I download it it gives me a very early 2000s CD burning application called \"Easy Media Creator 10 LJ\" instead of the regular upgrade to Windows 10 installer.","solutions":["1. Download winrar https:\/\/filehippo.com\/download_winrar_32\/2. Right click the ISO file and extract it using winrar. 3. Run setup.exe after extracting "]},{"symptom":"reset my computer to factory settings        I have upgraded to a new computer, I have moved all the documents and files to my new computer and would like to reset my old computer to the factory settings so I can either sell it or donate it. I have the Reinstallation CD for XP home but thinking it may not be the right CD.How can I go about doing this?Any help would be greatly appreciated.Thank you in advance","solutions":["Hi Hollie, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved. Does the old computer have Windows 10 on it? If so, you can use the method below to set it up to sell with Windows 10 or you can revert it back to XP Home.How to Safely Sell or Donate Your Old Windows 10 PC <-- Please read this first. https:\/\/www.groovypost.com\/howto\/safely-sell-do...More to help with the above info : A Clean Install would be activated with the Digital Entitlement. How to Prepare Bootable Install Media for Windows 10 - DVD, USB or SD Card https:\/\/answers.microsoft.com\/en-us\/windows\/for...Start fresh with a clean installation of Windows 10 https:\/\/www.microsoft.com\/en-us\/software-downlo...Clean Install Windows 10 http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all.","I have upgraded to a new computer, I have moved all the documents and files to my new computerand would like to reset my old computer to the factory settings so I can either sell it or donate it. I have the Reinstallation CD for XP home but thinking it may not be the right CD.How can I go about doing this?Any help would be greatly appreciated.Thank you in advanceWhat version of Windows is on the old computer?Which Windows operating system am I running? - Windows HelpWhat Version of Windows Do I Have? [Windows 10, 8, 7...] - LifewireHow to determine the version of Windows on a computerHow to Find Out Which Build and Version of Windows 10 You HaveList of Microsoft Windows versions - Wikipedia@@@@@@@@@@@@@@@@@@@@@@@@@@Also look for the COA Sticker if Windows came preinstalled if the operating system is prior to Windows 8 as that will tell you what version of Windows was preinstalled:The COA sticker, is either on the underside of the Laptop or in the Battery Compartment.With a Desktop it is either on the side, rear or top of the Computer Case.Cheers."]},{"symptom":"Frozen frame between clips in Photo's video editor        I am trying to combine two clips together using the video editor in the Photos app and the clips are part of an ongoing scene that I want to combine together seamlessly. But after I exported the video there was a frozen frame for about a second where the two clips meet and since the scene is ongoing, it's very noticeable. It did not do this in the preview window when I was editing the video. How exactly can I prevent this \"hiccup\" when editing?","solutions":["Hello! Thanks for using the Video Editor. Can you provide a little more information about what you were doing? It sounds like you placed two different video clips onto the Storyboard and then exported the resulting video--and when exporting, the first video was increased in length by about 1 second, and the last frame of that first video was onscreen for that time? Or were you splitting a single video clip (not sure what \"ongoing scene\" means)? Any information you can provide clarifying what you did and what exactly you observed will be helpful in debugging. Thanks!","It's the first suggestion, there's a one second pause at the end of clip 1 before clip 2 begins. Is there a timeline feature so I can combine the two clips seamlessly?","Can you try slightly adjusting the cut (using Trim) on the first clip, reexport and see if that fixes the issue?"]},{"symptom":"Surface RT        Hello,I would like to if SURFACE RT can  WINDOWS 10?If not why?I recently purchased a Microsoft game online titled Hellblade Senua's sacrifice.And I can't load it on to my SURFACE it wont show up.","solutions":[]},{"symptom":"Win 8.1 Homegroup\/Workgroup        Recently I installed updates to Win 8.1 and now I cannot setup or get the password for my Homegroup or add devices.Has Homegroup been disabled with the new updates in December 2019?","solutions":["Read through this:https:\/\/support.microsoft.com\/en-au\/help\/17145\/windows-homegroup-from-start-to-finish"]},{"symptom":"Perform Upgrade of Windows Cluster & SQL Cluster from 2008 R2 to 2012 R2        I am looking to perform Upgrade of Windows cluster on which SQL cluster is running 2008 R2 and i have to upgrade the OS to 2012 R2.Please can some one suggest or share some step by step guide which i can refer. Thanks in Advance!!Kumar ","solutions":["Your question is outside the scope of this Community.Kindly repost your question in the TechNet SQL Server Forums.https:\/\/social.technet.microsoft.com\/Forums\/sqlserver\/en-US\/home?category=sqlserver\"MSDN SQL Server Forums\"https:\/\/social.msdn.microsoft.com\/Forums\/sqlserver\/en-US\/home?category=sqlserverTechNet Server Forums.http:\/\/social.technet.microsoft.com\/Forums\/windowsserver\/en-US\/home?category=windowsserverTechNet Forums: https:\/\/social.technet.microsoft.com\/Forums\/en-US\/homeMSDN Forums:https:\/\/social.msdn.microsoft.com\/Forums\/en-US\/homeCheers.","I need to upgrade my Windows server 2008 R2 which is running on a windows cluster on top of it sql sql cluster,Please can u suggest.","I told you that you have posted to the Wrong Forums\/Community.I told you where to repost at."]},{"symptom":"Child's Activity Report is going to a very old email I no longer have        I am using the Microsoft Family Accounts and managing two child accounts.  I can see and manage their accounts from our Family page, including being able to set their screen limits, etc...The issue though is that I have Activity Reporting turned on, but I am not receiving these reports nor am I receiving my child's request for more screen time.  I did us my child's email and I can see their Activity Report is going to me and them, BUT the one for me is using an extremely old email address that I no longer have.  How do I update this????When I go into my Account and My Profile for Contact Options, I do not see this email address, and I can't log in using this email address, and I see no way to change or update where the Activity reports are being emailed.  How do I update this VERY OLD email address to my correct one????  My Microsoft Account is correct and using my correct email, but activity reports and child request are going to the old one.HELP.","solutions":["I found the answer in another thread.  If anyone else experiences this just go to Your Microsoft Account > Payment and Billing > Address Book.  I found the old address there and was able to update it.","Hi bbprthead, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.I understand that this route gave solution to the problem that you exposed, is that so? Route: Your Microsoft account >> Payment and billing >> Address book.Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M."]},{"symptom":"Can't run CDs        Split from this thread.Is there a way to have W10 run CDs or not? I have tried all 3 of the \"remedies\" on the internet and none do the trick. Further, W10 doesn't seem to allow the drive's manufacturer's driver displace the W10 CD\/DVD driver that doesn't work. Will Microsoft give us relief or not??","solutions":["I have yet to find a commercially made CD that fails to run on Windows 10, whether a music CD or a data CD.If you have a commercially made CD that won't run on Windows 10, you need to take that up with the seller. You might be owed a new CD.","Split from this thread.[Dec 22, 2016] Hi Jem,Since this thread has already aged and an answer was provided, I would highly suggest you to post a new thread for us to assist you better. Please make sure that you put the correct tagging so that your thread will be easy to find.  Regards.I've been searching this thread for an answer and there is none. The answers are just more questions treating the person asking for the solution like an idiot: \"Is your computer plugged in?\" From everything I can find, it appears there is no answer since W10 does not support legacy hardware. Thank you, Microsoft! No one in this forum seems to know enough about programming W10 to be able to create a patch or if they do, they haven't posted it where it can be found. If someone can point me to it, if it exists, I would greatly appreciate it."]},{"symptom":"Getting permissions to unlock files        How do we unlock files that require permissons?","solutions":["Hi JamesPennuto, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Check the indications of the web portal managed and shared by Windows MVP, which allows you to have full control of folders and files in Windows 10.How to take full Ownership of Files & Folders in Windows 10 https:\/\/www.thewindowsclub.com\/take-ownership-w...How to take ownership and get full access to files and folders in Windows 10 https:\/\/winaero.com\/blog\/how-to-take-ownership-...Let me know if you have something else that I can help you with, I'd be happy to help.Happy nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Printer will not print after the Windows 10 Update        My printer was working fine until the Microsoft update was downloaded.  After, I send a document to the printer it returns an error.  ","solutions":["Reinstall the printer.","Hi Rita. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.You can run the Printer Troubleshooter at Settings > Update & Security > Troubleshoot.Rather than spending too much more time fiddling I'd simply Clean Install the printer which always works, lasts longer and actually saves time:1) Power up the printer, if wired unplug it's USB cable from PC. 2) Go to Settings>Apps>Apps and Features to find and Uninstall any printer software.3) Use one of these methods to remove all of the old printer drivers: https:\/\/www.tenforums.com\/tutorials\/101274-unin...4) Now type Control Panel in Start Search, open CP, choose Icon View. In Control Panel open Devices and Printers, right click printer to delete Printer and any scanner or fax of the same name. Restart PC.5) Go to the printer model’s Support Downloads webpage to download and install the latest full software package. Now is also the time to check for any newer printer firmware to install which matters a lot.6) Extract Printer software, right click Setup file to Run as Administrator. Follow the setup screens closely as you install the software. For USB it should prompt when to plug in the printer.Older software may need to be installed in Compatibility Mode to run correctly: https:\/\/www.groovypost.com\/howto\/run-old-softwa... If you have further problems reply back with results of each step. I hope this helps. Feel free to ask back any questions and let us know how it goes. If you will wait to rate my post until we are done, I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","My printer was working fine until the Microsoft update was downloaded.  After, I send a document to the printer it returns an error.  Hello, Please run Printer troubleshooter from Settings app > Update & security > Troubleshoot. Let us know what it reports back. Regards.","Troubleshoot found no problems and printer still returns an error rather than printing the document.","Microsoft is another failing company who only cares about stealing your data and selling it at this point.  They broke all my printers cost me thousands.  They don't care anymore, I'll probably switch to linux soon.  Talked to all their outsourced low paid workers from India, who give you the same old tutorials and blame it on the computer LOL, or your network or the printing company.  However we have computers that work on the network and some that broke with the update and they microsfot is dumbfounded.  I miss windows XP days when things actually worked. Yeah I know I sound disgruntled but I have been fighting this monster for 4 months and unable to code or software engineer because I am in printer HELL.  employers want me to fix their friggin computers which can't be fixed because of Microsoft!  LOL Microsoft released a post today telling people to get NEW computers HAHAHA.   Ok are you going refund all the computers that are currently holding your BLOATWARE and SPYWARE. Welcome to 2020 everyone, find another operating system this one is going down and will not be rising like a Phoenix.  10 year software developer here with over 14 years of web developing.  Microsoft is over.","I understand your pain.  I'm not an IT professional, but know enough to keep myself up and running.  This has happened to me three times now after each Microsoft update.  It pisses me off that they are not testing their software updates, BEFORE, they put it out there.  Consumers should not have to put up with this.  I would think it is such a basic function to program.  The smartest computer person I know is stumped, and this dude is really really smart.  He did confirm that I did everything properly, so the update struck again.   I am getting a new modem, so I hope this clears up my issue.  I am hopeful.  Even though your post did not help, it did give me a good laugh.  Good luck in your pursuit of printer heaven.  ","I have done everything on the list and I am still unable to resolve my printer issue.  I am getting a new modem, so I hope that fixes the issue, whatever it is.  Everything was working up to the last update.  The update before this, I lost my sound.  I'm at a loss and really disappointed in Microsoft.  They should be thoroughly testing these updates BEFORE they put it out to the public.  I was on the phone with support on several different days, but they told me to do the same thing I did and it still didn't work.  I have literally uninstalled and reinstalled my printer driver and software four times.   The last time I downloaded the updated printer driver.  This was also suggested.  Anyway, I am frustrated.  It's not like I have a money tree in my backyard to pay someone or buy a new printer.  It pisses me off.  Thank you for all your suggestions.","This did not help.  I am still fighting to get it working."]},{"symptom":"Sticky Notes always loads with all notes highlighted        Hi all. I find Sticky Notes very useful but at the moment it's driving me nuts. Each time it loads when I boot my PC, every note I have loaded is highlighted and glowing orange. This means that the taskbar is prevented from autohiding until I've clicked every note, all of which I haven't changed. I don't see why they're highlighted in the first place, but I literally have to click on about eight of my permanent notes every morning else the taskbar gets in the way.","solutions":["Hi AntonyL1981, I'm Charles, an Independent advisor trying to help. This is an incorrect behavior of the application, let's try to solve applying the following steps, they are indications of a Windows MVP, so the information is reliable.https:\/\/www.thewindowsclub.com\/sticky-notes-cra...The article has 4 indications, if the first 3 cannot solve the problem, apply these steps instead of option 4 of the link, they are the same indications, but here I share it step by step:(Steps to reinstall) Windows key + X >> PowerShell (Admin) >> Copy and paste command, using the right mouse click: Get-AppXPackage -AllUsers -Name Microsoft.MicrosoftStickyNotes | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$ ($ _. InstallLocation) \\ AppXManifest.xml\" -Verbose} + Enter, once the process is finished, it is recommended to restart your computer and then verify the results.I hope the steps work for you too Attentive to any comments Have a happy day Best Regards, Charles. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi there, I am from the Sticky Notes team. This is known, and caused by the way windowing works in Windows - if windows open when they are not in focus they will flash. One way to quickly resolve all of the flashing windows is to use our new \"show all notes\" option we added to the jumplist in 3.7.68 (now rolled out to everyone). To try this, right click on the Sticky Notes icon in the Windows taskbar to bring up the jumplist and click \"Show all notes\". This will bring all open notes to the foreground. To hide them again, click \"Hide all notes\" in the same menu.More information: https:\/\/twitter.com\/stickynotes\/status\/1176903739094888448?s=09","Hi there. Apologies for the late reply. I have Sticky Notes version 3.7.71.0 and it does not have those additional options. Given this is a later version than the one you specified, have these options been removed? It seems it was maybe an insiders-only addition?","I am missing the show\/hide all notes option that I see mentioned here and elsewhere.  Am completely up to date as far as I can tell, Windows 10 1909 and Sticky Notes 3.7.71.0.   Any suggestions why I cannot show\/hide all notes?  Just started using Sticky Notes, so can't say if it was there previously.  Thank you.","Can you try restarting the application and letting me know if you see the options appear? These options are rolled out to 100% production.","Definitely not there for me either. I've restarted the application and it does not have the options mentioned in the Twitter post. I have version 3.7.71.0","Thanks Allie, have restarted the application and computer numerous times, but no change.I also checked 2 other computers at a business I have access to, one with Windows 10 1909, and another that's still 1903 hasn't updated to 1909 yet, both with Sticky Notes 3.7.71.0, and neither have hide or show options.  It would appear this issue is not isolated...","Thanks for the reports all, we're investigating this. One thing that would help is if you could provide us with your session IDs, they are in the settings page of Sticky Notes if you are a signed in user (click on \"Copy Session ID\" and paste the results in a message body).Thanks!Allie","Allie, 2 of the Windows 10 1909 machines that I am signed into (one personal, one at a business location elsewhere) have session IDs 7y2DQNQ7nUOR5U1b2D9d4g and xVF8KVPq0Uia+9Pv\/NzahQ.  The Windows 10 1903 machine (which just upgraded to 1909 this past weekend) that is not signed on with a Microsoft Account does not have a session ID.","My session ID: aQeY1r3HyUCbmNKxfuIXqA"]},{"symptom":"Video capture has a black screen and working audio         Hello,When using video capture all I get is audio and a black screen.I did not have this problem before, then I recorded many videos.I have not use Capture for a period so I don't now when this problem arrived.thanks and regards","solutions":["Hi, Thank you for writing to Microsoft Community Forums. For better clarity, please let us know: Which application are you using to record the screen?Are you aware of any changes made to the computer recently?Which build version of Windows 10 are you using currently? To check type:winver in the search bar on the Taskbar and hitEnter. If you are using Game Bar to record the screen, I suggest you to refer the steps mentioned below: Change Game Bar settings: I would suggest you to change the capture settings for Game Bar and see if that helps. Refer the steps mentioned below: Press Windows Logo key + I, to openSettings.Click on Gaming.Click on Captures on the left pane.Under Recorded video, change the Video frame rate to 60 fps.Now, set the Video quality to high from the drop down. Change the game video settings: You may also want to change the video settings for the game to full screen windowed mode. Check Xbox Game Monitoring service: Press Windows Logo key + R, to openRun dialog box.Type services.msc and click on OK.Scroll down and look for Xbox Game Monitoring, and see if the service is running.If the service is not running, right click on the service and selectStart. For additional information, see Troubleshoot Xbox Game Bar on Windows 10.  Let us know the results. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Sharing sticky notes        How do I share sticky notes with a different account?Harold L","solutions":["Hi, This isn't available currently, you can only cloud sync them to use them with other devices using the same account from the app settings. I would recommend leaving feedback in the feedback hub app to let the Windows team know you would like to see this feature.For now you would need to use a 3rd party app such as Google Keep for this functionality.I hope that helps.","Thanks for this response. However, I also found the following in Microsoft Help:Share your sticky notesSticky Notes You can share your sticky notes with anyone, even if they don't have a Microsoft account.iPhone & iPad Android You can share your sticky notes on your Android phone with anyone, even people who don’t have a Microsoft account. You can share sticky notes using most popular apps or service available on your Android phone, including text messaging, email, or social media.From an open note, tap the ellipsis icon ( ... ) located in the upper right.Tap Share. Select how you want to share the note. I tried clicking the ... on a note, but wasn't given a menu containing \"share\". Nevertheless, when I opened the Onenote app on my Android phone, I found the sticky notes by clicking on the sticky note icon in the lower right corner. If I can share them withanyone - even with someone who does not have a Microsoft account - I don't see why I can't share them on 2 Microsoft accounts of my own.Harold","Hi Harold,I'm from the Sticky Notes team. On mobile, we allow you to share the contentsof notes with anyone. However, at an app level, we don't have a true sharing feature.-Allie"]}]}