{"windows":[{"symptom":"Windows home single language        I just installed far cry 3 game, and after installation, my laptop (windows 10 home single language) got so many errors. Start menu not working, search process not running permanently, and even i cant open Microsoft office. Because of that, i want to reinstall (or clean install, maybe) my windows 10. The question is, how to install the same edition (home SL) in my laptop? I already have OEM license and the windows installed on SSD","solutions":["Hello, Ammar,Settings > Update & SecurityClick RecoverySelect Reset PCWhen given the option to keep files or Keep Nothing > Select Keep NothingThis will clean install Windows 10.Note: It will be necessary for you to reinstall Office 365 and other apps you've downloaded from the Internet or installed from a DVD.I suggest you backup your files before performing the PC Reset. You can move them to your OneDrive account. Tutorial:How to do a clean install of Windows 10 the easy way."]},{"symptom":"Windows 10 Fresh start got stuck at installing Windows 88%        Im not sure what to do will turning my computer of Brick my computer","solutions":["This is a holiday and there may not be anyone at the servers at this time.","Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,Is it currently stuck still at 88%, the maximum amount of time to wait for the progress is 3 hours. If this has already been the time consumed previously, you may then proceed by turning off the computer by holding the power button then see what happens afterwards.Let me know how the process goes so that I can help you with the next step. :)"]},{"symptom":"When booting a game I hear 4 short beeps        HiI recently cleaned my computer from dust. Soon after I noticed that my pc makes 4 short beeps when I boot overwatch. What kind of a problem does 4 short beeps. What do they mean?","solutions":["Hi, MyFinman,Computer Make\/Model? This information will help us help you in determining what the code means.It depends on your Bios. In Cortana search bar type MSinfo32 and Press Enter to open System Information. Look for the manufacturer of the Bios.This is a list of Manufacturer's with Beep Codes.https:\/\/www.computerhope.com\/beep.htmRelated Threads:https:\/\/www.lifewire.com\/how-to-troubleshoot-beep-codes-2624889HPDellIntelIntel CodesAsus"]},{"symptom":"windows 10  installer 1618        How to fix installer error when trying to download UFILE tax software ","solutions":["Hello bluetoids, I'm Didi, an independent advisor. The 1618 error can pop up when there is already another installation running. Are you having a problem installing your software or downloading it ? Try the following methods : Method 1 : If you have any installation or Windows update running make sure to finish it before attempting to install your tax software.----------- Method 2 : Restart your computer and check if it fixes the problem. -------------- Method 3 : 1) Click on the \"Start\" button, type \"Services\" and click on \"Services\" 2) Locate \"Windows Installer\" in the list and double-click it 3) In the new window, select \"Disabled\" in the section \"Startup type\", and then click on \"Apply\"4) Return to the \"Startup type\" section, choose \"Automatic\", click on \"Apply\" then click \"OK\"5) If the issue isn't fixed right away restart your computer ----------- Method 4 : Download and run the Program Install and Uninstall troubleshooter : https:\/\/support.microsoft.com\/en-us\/help\/17588\/... ------------- Method 5 : 1) Right-click on your taskbar, click \"Task Manager\", click on the \"Start-up\" tab and right-click > Disable any application that has the \"Enabled\" status.2) Restart your computer. Even if the problem is not solved put the \"Enabled\" status back for the applications that were set as \"Enabled\".---------- Method 6 : Try to install your software in clean boot state, see this article to know how to clean boot :https:\/\/support.microsoft.com\/en-us\/help\/929135... ------------- Method 7 : Follow this guide made by Greg Carmack : https:\/\/answers.microsoft.com\/en-us\/windows\/for... Regards, Didi","Restarting PC fixed the issue. Thanks and Happy New Year!"]},{"symptom":"Replacement Battery Cover for Microsoft Surface Mobile Mouse (Burgundy) - KGY-00011        Hello,I dropped my mouse and the back piece popped off and disappeared into oblivion. I haven't been able to find anything via Google searches and I'm really hoping I can just pay for a replacement piece instead of buying a whole new mouse. I haven't even had it a full year yet. Does anyone know of a phone number I can call or email address I can try to get some kind of resolution? Thanks for any help anyone is able to extend.Happy New Year!Riaora","solutions":["Hi, The Microsoft Store doesn't currently sell replacement parts directly. But you may be able to contact the store about getting a replacement sorted.I'm not sure what country you are in so here's the US and UK ones: US - 1-877-696-7786 UK - 0800 026 0329 For other countries you can change the language while on this page and it will update with the number for that region.https:\/\/support.microsoft.com\/en-us\/help\/28808\/...I hope that helps."]},{"symptom":"Can I deploy custom Windows 10 Home image on multiple devices?        First, all of my devices have licensed and activated on each device.  I also have Office 365 which includes multiple accounts I can assign.  I’m not attempting to sidestep payment or steal licenses, etc.  The problem is I have the curse of perfectionism and I want all settings for Windows, Office, and other programs to be identical...and the same for my storage devices on each pc. (i.e. OS + apps on C:, docs and cache on D:, both of which are SSDs.)I have:2 desktops and 1 laptop at home and1 desktop and 1 laptop at workMy idea is to use Easeus migration tool to create the ISO copies.Questions are...will this work, is it legal, and is there a better way to do what I want to do? ","solutions":["Hi CanyonI am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.It should work if all the devices are activated at the time of deployment. Worse case, you might have to run the troubleshooter to get device activated.If EASEUS is paid, you can go with Macrium Reflect. It doesnt create an ISO though, it uses own image format.Hope that helps.","Hi Sumit,Do you know if there is a best practice for keeping things synced up?  Windows sync setting selections are a little vague as to what exactly stays in sync.i really feel Microsoft needs to ensure that updates don’t reconfigure things, such as reinstalling apps a user has uninstalled, etc.I appreciate your help. ","Hello, canyonview81o,This is an overview of what gets synced between devices.https:\/\/docs.microsoft.com\/en-us\/azure\/active-directory\/devices\/enterprise-state-roaming-windows-settings-referenceWhat Products do you intend to make .iso's for? There may be an issue with Activation. However, Change Product Key may work in this case.I recommend you use ShowKeyPlus to get the license for each device or Product prior to making the .iso or cloning the drive; whichever you choose to do."]},{"symptom":"Exporting Edge passwords        How can I export my edge web site passwords to a .csv file to import to chrome","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.There is a good tutorial here which runs through the steps on how to do this: https:\/\/www.digitalcitizen.life\/export-password...Regards, Ross","Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thanks for your response but I am just going to use Chrome. Edge is inconsistent saving passwords and way to complicated to export. Typical Microsoft ****.","No problem, at least you can get the passwords you do have saved out now.Regards,Ross"]},{"symptom":"I just purchased a Lenovo and my Windows Hello Fingerprint isn't working        I just purchased a new Ideapad S540 Lenovo (10th gen), and I'm not able to add a fingerprint sign-in. The below screen pops up when I click on it. I appreciate the support.","solutions":["Hello KhalidWAK, I'm Didi, an independent advisor. As shown on the screenshot, you must have set up a password to log in on your device before setting up Windows Hello Fingerprint.Have you already set up a password ? Here is a guide on how to set up a password on your computer : https:\/\/www.lifewire.com\/how-do-i-create-a-pass... Regards, Didi --------------- Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Using rewards to purchase microsoft products        Is is ok to use microsoft rewards points to purchase the windows 10 upgrade for my computer?","solutions":["Hi, Leo,You may use points for any category listed in the Redemption Center. If you see an offer to upgrade to Windows 10 Gift Card, you may use the points. Otherwise, No.The offer must be listed in the Redemption Center.Go to your Dashboard > Click on Redeem to see what offers are available to you."]},{"symptom":"installing product key for windows pro during update errors (?)        do Update Errors Compromise a Product Key Change? - I purchased Home version Product Key instead of 10 Pro for a pre owned laptop, having zero windows 10 experience and I am Done with the experience of Learning to Downgrade this ^#&@!!*  I Purchased another Key (Pro this time) So should I attempt the changing of the Keys?  Im pretty sure I brought on these Errors monkeying around they've changed 3 different times through out this whole debacle. I do have the Codes for reference if need be.","solutions":["Hi Chy Ope the Settings App (gear icon on your Start Menu) Go to System - About What is the exact edition (Home, Pro, Enterprise . . etc) of Windows that is installed on your laptopIf that is the Pro edition, then if your Windows is showing as not activated, you should apply that Pro licence key your purchased . . .","yes the 'ABOUT' Page.....  It is blank. Completely empty. this cant be good huh?","Hi Chy That may be just one of the many bugs in the Windows 10 Settings App . . . Click your Start Button, type cmd then right click Command Prompt and choose 'Run as Administrator'Run or paste this command and hit Enter: slmgr.vbs \/dlv Please post a screenshot of the resulting dialog . . .","do Update Errors Compromise a Product Key Change? - I purchased Home version Product Key instead of 10 Pro for a pre owned laptop, having zero windows 10 experience and I am Done with the experience of Learning to Downgrade this ^#&@!!*  I Purchased another Key (Pro this time) So should I attempt the changing of the Keys?  Im pretty sure I brought on these Errors monkeying around they've changed 3 different times through out this whole debacle. I do have the Codes for reference if need be.","Thank You for the Snipping Tool introduction. I think this is the tool they said to use for screen shot when the Home Version Product Key was declined, thus iv decided on taking a remedial Windows 10 Course. Is this the screen shot you requested? my first attempt went smooth using copy paste\/method to bring the window up then came the multiple sudden shutdowns & wouldn't fallow through pasting the copy\/paste method in turn had to hand type the cmd . repeatedly felt like performing open heart surgery tinkering inside this operating system. one of the letters (I think the 'l' ) when typed didn't look rite. and of course what seems like un provoked shutdowns, so here it is, I hope :)) And Happy New Year by the way if your still out there my absents isn't willful nor miss respectable but your assistance is certainty appreciated ."]},{"symptom":"Xbox gaming on the pc        I purchased Gears 4 on my pc .When i push play It just disappears .I have the required hardware for the game What could it be ?","solutions":["Hey there, RegencyCrane6Welcome to the Microsoft Community forums. When you launch the game, what programs\/apps are open on your computer at the same time?Regards, ","Hi, RegencyCrane6 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Ok thanks . I 'll try that . All my other games work perfectly fine but gears 4. Maybe i need an xbox gamepass    to play it?","Hey there, RegencyCrane6You should not need Gamepass to play it unless you didn't purchase it?You could try uninstalling the game and reinstalling it. But if the game disappears, then it is suggesting that you didn't have enough room on your memory\/RAM. What size is your RAM?Regards, ","I purchased it off cd keys . I have over a terrabyte of memory available so thats plenty. I did a diagnostic check of my system compatability with the game and it said the game should run just fine. I more than meet the requirements.I uninstalled it and re -downloaded the game to see what happens."]},{"symptom":"Cannot get out of S Mode. Help!        Hello, I just bought this Dell Inspirion 3583 and cannot disable S mode. I have followed the steps on the FAQ, reset the Microsoft store, cleared the store cache, updated all the apps, ran the wsreset, and I keep getting the same message \" Try again later. Something happened on our end\". It's been 2 days. Has anyone dealt with this before? What should I do next? Thanks!","solutions":["Hi Icruz. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.It sounds like you've confirmed the Store is not the problem. The problem is then most likely server overload as Windows 10 approaches a billion users and Microsoft can't build server farms fast enough, and lots of customers got S mode PC's for Christmas (which should have never been sold in S mode) and want out.So you can try again later, or you can contact Microsoft Support by one of these phone numbers:https:\/\/support.microsoft.com\/en-us\/help\/405170...You can also go here: https:\/\/partner.support.services.microsoft.com\/... choose the link for Browser help, interact briefly about your exact problem until it connects with an agent.Keep me posted on your progress as I will be here to help until the case is resolved."]},{"symptom":"Win 10 recovery from USB recovery drive failed at 75%        I tried recovering to a new HD in my HP 8001 tower. It had been intermittently failing to boot Win 10 x64. The \"recover from device\" failed at 75% from the USB drive I had created with this PC. I tried a recovery USB made from a Win 10 x64 notebook with the same result. I also have current system and data backups on a portable HD and a repair CD. Using the repair CD to restore the latest system image from the portable HD resulted in \"The system image restore failed. Error details: The parameter is incorrect. (0x8000700057)\".Any assistance is appreciated.","solutions":["Umm .. never mind. Third time was the charm."]},{"symptom":"Cannot update to 1903 on any of our workstations        We're trying to update our Windows 10 PCs (12 of them) to 1903 and we're getting the same error on all of them:  The installation failed in the SECOND_BOOT phase with an error during MIGRATE_DATA operation. 0x8007042B – 0x4000D BSODThe OOBE error log shows:  [windeploy.exe] Failure occured during online installation.  Online installation cannot complete at this time.; hr = 0x80004005The setup error log shows (domain and user info replaced):2019-10-15 09:30:40, Error                 MOUPG  CDlpActionImpl<class CDlpErrorImpl<class CDlpObjectInternalImpl<class CUnknownImpl<class IMoSetupDlpAction> > > >::Suspend(1066): Result = 0xC1800104[gle=0x00000002]2019-10-15 09:30:40, Error                 MOUPG  CSetupManager::ExecuteInstallMode(788): Result = 0x800705BB2019-10-15 09:30:40, Error                 MOUPG  CSetupManager::ExecuteDownlevelMode(390): Result = 0x800705BB2019-10-15 09:30:40, Error                 MOUPG  CSetupManager::Execute(282): Result = 0x800705BB2019-10-15 09:30:40, Error                 MOUPG  CSetupHost::Execute(400): Result = 0x800705BB2019-10-15 09:30:47, Error                 CONX   Windows::Compat::Appraiser::AppraiserSettings::GetSettingsInternal (275):   Failed to retrieve DeviceTicket: [0x800704cf][gle=0x800704cf]2019-10-15 09:31:38, Error                 CSI    00000001 (F) STATUS_OBJECT_NAME_NOT_FOUND #70# from Windows::Rtl::SystemImplementation::DirectRegistryProvider::SysQueryValueKey(flags = 0, key = e00 ('\\REGISTRY\\MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Fonts'), vn = [l:21 ml:22]'Arial Nova (TrueType)', kvic = 2, kvi = 2, disp = 0)[gle=0xd0000034]2019-10-15 09:31:38, Error                 CSI    00000002 (F) STATUS_OBJECT_NAME_NOT_FOUND #69# from Windows::Rtl::SystemImplementation::CKey::QueryValue(flags = 0, kn = [l:69]'\\Registry\\Machine\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Fonts\\', vn = [l:21 ml:22]'Arial Nova (TrueType)', ic = KeyValuePartialInformation, info = {l:0 b:}, disp = 0)[gle=0xd0000034]2019-10-15 09:32:56, Error                 DU     DU::CDUSession::Search: Failed to set WU internal configuration property for targeted scans. hr = 0x800700572019-10-15 09:34:33, Error                 CONX   0xd0000034 Failed to add user mode driver [%SystemRoot%\\system32\\DRIVERS\\UMDF\\uicciso.dll]2019-10-15 09:52:15, Error      [0x080831] MIG    CSIAgent: Invalid xml format: FormatException: Component with display name: Plugin\/{C939EC0F-2F56-4CE8-AF56-2336596A5FA7} already loaded __cdecl Mig::CMXEMigrationXml::CMXEMigrationXml(class Mig::CPlatform *,class UnBCL::String *,class UnBCL::XmlDocument *,class UnBCL::String *,class UnBCL::String *)2019-10-15 09:58:13, Error                        CSetupAutomation::Resurrect: File not found: C:\\$WINDOWS.~BT\\Sources\\Panther\\automation.dat[gle=0x00000002]2019-10-15 09:58:13, Error                 SP     CSetupPlatform::ResurrectAutomation: Failed to resurrect automation: 0x80070002[gle=0x00000002]2019-10-15 10:41:56, Error      [0x080831] MIG    CSIAgent: Invalid xml format: FormatException: Component with display name: Plugin\/{C939EC0F-2F56-4CE8-AF56-2336596A5FA7} already loaded __cdecl Mig::CMXEMigrationXml::CMXEMigrationXml(class Mig::CPlatform *,class UnBCL::String *,class UnBCL::XmlDocument *,class UnBCL::String *,class UnBCL::String *)2019-10-15 10:48:36, Error      [0x0808fe] MIG    Plugin {0b23c863-4410-4153-8733-a60c9b1990fb}: TableTextServiceMig!RemoveObsoleteCHSHKLMRegkey - fail to open regkey (software\\Microsoft\\CTF\\TIP\\{E429B25A-E5D3-4D1F-9BE3-0C608477E3A1}\\LanguageProfile\\0x00000804) = 22019-10-15 10:48:36, Error      [0x0808fe] MIG    Plugin {0b23c863-4410-4153-8733-a60c9b1990fb}: TableTextServiceMig!ApplySuccess() remove HKLM Registries error2019-10-15 10:48:36, Error      [0x0808fe] MIG    Plugin {526D451C-721A-4b97-AD34-DCE5D8CD22C5}: [shmig] onecoreuap\\shell\\propsys\\schemacachehelpers.cpp(592)\\shmig.dll!00007FFB3E4ED358: (caller: 00007FFB3E4ED4D2) ReturnHr(1) tid(2370) 8007139F The group or resource is not in the correct state to perform the requested operation.2019-10-15 10:48:36, Error      [0x0808fe] MIG    Plugin {526D451C-721A-4b97-AD34-DCE5D8CD22C5}: [shmig] onecoreuap\\shell\\propsys\\schemacachehelpers.cpp(615)\\shmig.dll!00007FFB3E4ED4EE: (caller: 00007FFB3E4E5802) LogHr(1) tid(2370) 8007139F The group or resource is not in the correct state to perform the requested operation.2019-10-15 10:48:36, Error      [0x0808fe] MIG    Plugin {526D451C-721A-4b97-AD34-DCE5D8CD22C5}: [shmig] onecoreuap\\shell\\propsys\\schemacachehelpers.cpp(586)\\shmig.dll!00007FFB3E4ED358: (caller: 00007FFB3E4ED4D2) ReturnHr(2) tid(2370) 80070002 The system cannot find the file specified.2019-10-15 10:48:36, Error      [0x0808fe] MIG    Plugin {526D451C-721A-4b97-AD34-DCE5D8CD22C5}: [shmig] onecoreuap\\shell\\propsys\\schemacachehelpers.cpp(615)\\shmig.dll!00007FFB3E4ED4EE: (caller: 00007FFB3E4E5802) LogHr(2) tid(2370) 80070002 The system cannot find the file specified.2019-10-15 10:48:36, Error      [0x0808fe] MIG    Plugin {526D451C-721A-4b97-AD34-DCE5D8CD22C5}: [shmig] onecoreuap\\shell\\propsys\\schemacachehelpers.cpp(586)\\shmig.dll!00007FFB3E4ED358: (caller: 00007FFB3E4ED4D2) ReturnHr(3) tid(2370) 80070002 The system cannot find the file specified.2019-10-15 10:48:36, Error      [0x0808fe] MIG    Plugin {526D451C-721A-4b97-AD34-DCE5D8CD22C5}: [shmig] onecoreuap\\shell\\propsys\\schemacachehelpers.cpp(615)\\shmig.dll!00007FFB3E4ED4EE: (caller: 00007FFB3E4E5802) LogHr(3) tid(2370) 80070002 The system cannot find the file specified.2019-10-15 10:48:37, Error      [0x0808fe] MIG    Plugin {ee036dc0-f9b7-4d2d-bb94-3dd3102c5804}: BRIDGEMIG: ParseRegistryIfBridgeExists: offline key (new) = '$OFFLINE_RW_003ADB7E$SYSTEM\\Setup\\Upgrade\\Bridge'2019-10-15 10:48:37, Error      [0x0808fe] MIG    Plugin {ee036dc0-f9b7-4d2d-bb94-3dd3102c5804}: BRIDGEMIG: ParseRegistryIfBridgeExists: query bridge presence key failed 0x139f, bridge present = 02019-10-15 10:48:46, Error      [0x08038d] MIG    Failure while calling IPostApply->ApplySuccess for Plugin={ServerPath=\"Microsoft-Windows-DirectoryServices-ADAM-Client\\adammigrate.dll\", CLSID={43CCF250-2A74-48c6-9620-FC312EC475D6}, ThreadingModel=Apartment}. Error: 0x800700022019-10-15 10:48:46, Error                 SP     Error READ, 0x00000002 while gathering\/applying object: apply-success, Action,CMXEPlugin,C:\\$WINDOWS.~BT\\Sources\\ReplacementManifests,Microsoft-Windows-DirectoryServices-ADAM-Client\\adammigrate.dll,{43CCF250-2A74-48c6-9620-FC312EC475D6},Apartment. Will return 2[gle=0x000000cb]2019-10-15 10:49:08, Error      [0x0803eb] MIG    Error: 3 Message: Error opening the key HKLM\\Software\\Wow6432Node\\Microsoft\\Windows\\CurrentVersion\\Explorer\\KindMap: The system cannot find the path specified. [0x00000003]2019-10-15 10:49:08, Error      [0x0803eb] MIG    Error: 3 Message: Error opening the key HKLM\\Software\\Wow6432Node\\Microsoft\\Windows\\CurrentVersion\\Explorer\\KindMap: The system cannot find the path specified. [0x00000003]2019-10-15 10:49:08, Error      [0x0803eb] MIG    Error: 3 Message: Error opening the key HKLM\\Software\\Wow6432Node\\Microsoft\\Windows\\CurrentVersion\\Explorer\\KindMap: The system cannot find the path specified. [0x00000003]2019-10-15 10:49:08, Error      [0x0803eb] MIG    Error: 3 Message: Error opening the key HKLM\\Software\\Wow6432Node\\Microsoft\\Windows\\CurrentVersion\\Explorer\\KindMap: The system cannot find the path specified. [0x00000003]2019-10-15 10:49:37, Error      [0x0808fe] MIG    Plugin {0b23c863-4410-4153-8733-a60c9b1990fb}: TableTextServiceMig!RemoveObsoleteCHSHKLMRegkey - fail to open regkey (software\\Microsoft\\CTF\\TIP\\{E429B25A-E5D3-4D1F-9BE3-0C608477E3A1}\\LanguageProfile\\0x00000804) = 22019-10-15 10:49:37, Error      [0x0808fe] MIG    Plugin {0b23c863-4410-4153-8733-a60c9b1990fb}: TableTextServiceMig!ApplySuccess() remove HKLM Registries error2019-10-15 10:57:52, Error                 MOUPG  Finalize: Error reading narrator reg key: [0x80070002]2019-10-15 10:58:16, Error                 SP     BFSVC: Error copying boot debugging files from C:\\$WINDOWS.~BT\\Sources\\system32 to\\\\?\\GLOBALROOT\\Device\\HarddiskVolume2\\EFI\\Microsoft\\Boot (kd_*_*.dll). Last Error = 0x6[gle=0x00000006]2019-10-15 10:58:16, Error                 SP     BFSVC: Error copying boot debugging files from C:\\$WINDOWS.~BT\\Sources\\system32 to\\\\?\\GLOBALROOT\\Device\\HarddiskVolume2\\EFI\\Microsoft\\Boot (kdstub.dll). Last Error = 0x6[gle=0x00000006]2019-10-15 10:59:32, Error                        [SetupPlatform.exe] winreHashWimFile: Failed to hash [C:\\WINDOWS\\System32\\Recovery]: 0x52019-10-15 11:00:59, Error                 CBS    Failed to load Session:1928_649703 [HRESULT = 0x80070002 - ERROR_FILE_NOT_FOUND]2019-10-15 11:01:26, Error      [0x080831] MIG    CSIAgent: Invalid xml format: FormatException: Component with display name: Plugin\/{C939EC0F-2F56-4CE8-AF56-2336596A5FA7} already loaded __cdecl Mig::CMXEMigrationXml::CMXEMigrationXml(class Mig::CPlatform *,class UnBCL::String *,class UnBCL::XmlDocument *,class UnBCL::String *,class UnBCL::String *)2019-10-15 11:04:41, Error      [0x0808fe] MIG    Plugin {050ed09e-a530-41e6-8ac9-a9a96e74a2c1}: [shmig] internal\\onecoreuapshell\\private\\inc\\UserChoiceHelpers.h(827)\\shmig.dll!00007FF9EF77AFA9: (caller: 00007FF9EF77B719) LogHr(1) tid(1f98) 80070002 The system cannot find the file specified.2019-10-15 11:04:41, Error      [0x0808fe] MIG    Plugin {050ed09e-a530-41e6-8ac9-a9a96e74a2c1}: [shmig] internal\\onecoreuapshell\\private\\inc\\UserChoiceHelpers.h(829)\\shmig.dll!00007FF9EF77B00D: (caller: 00007FF9EF77B719) LogHr(2) tid(1f98) 80070002 The system cannot find the file specified.2019-10-15 11:05:04, Error      [0x0808fe] MIG    Plugin {050ed09e-a530-41e6-8ac9-a9a96e74a2c1}: [shmig] internal\\onecoreuapshell\\private\\inc\\UserChoiceHelpers.h(829)\\shmig.dll!00007FF9EF2EB00D: (caller: 00007FF9EF2EB719) LogHr(1) tid(1d4c) 80070002 The system cannot find the file specified.2019-10-15 11:05:15, Error                 MIG    CShellLibrary: XML parse error while loading library\\\\domainnamespace\\data\\Users\\enduser\\appdata1\\Microsoft\\Windows\\Libraries\\CameraRoll.library-ms. Message:  hResult = 0x0, Line = 0, Position = 0; No data is available for the requested resource.. 2019-10-15 11:05:15, Error                 SP     Error READ, 0x00000005 while gathering\/applying object: File,\\\\domainnamespace\\data\\Users\\enduser\\appdata1\\Microsoft\\Windows\\Libraries [CameraRoll.library-ms]. Will return 0[gle=0x00000005]2019-10-15 11:05:15, Error                 MIG    Error 5 while applying object \\\\domainnamespace\\data\\Users\\enduser\\appdata1\\Microsoft\\Windows\\Libraries [CameraRoll.library-ms]. Shell application requested abort[gle=0x00000005]2019-10-15 11:05:15, Error      [0x08097b] MIG    Abandoning apply due to error for object:\\\\domainnamespace\\data\\Users\\enduser\\appdata1\\Microsoft\\Windows\\Libraries [CameraRoll.library-ms][gle=0x00000005]2019-10-15 11:05:16, Error                        Apply failed. Last error: 0x000000002019-10-15 11:05:16, Error                 SP     pSPExecuteApply: Apply operation failed. Error: 0x0000002C2019-10-15 11:05:17, Error                 SP     Apply: Migration phase failed. Result: 442019-10-15 11:05:17, Error                 SP     Operation failed: OOBE boot apply. Error: 0x8007042B[gle=0x000000b7]2019-10-15 11:05:17, Error                 SP     Operation execution failed: 13. hr = 0x8007042B2019-10-15 11:05:17, Error                 SP     ExecuteOperations: Failed execution phase Pre OOBE Boot. Error: 0x8007042B2019-10-15 11:05:17, Error                 SP     Operation execution failed.2019-10-15 11:05:17, Error                 SP     CSetupPlatformPrivate::Execute: Failed to deserialize\/execute pre-OOBEBoot operations. Error: 0x8007042BWe had a similar problem updating to 1809 which I worked around since I couldn't find a cause but it's now seeming like this is going to be an issue with each update so I'd like to fix it.  The workaround was to remove all domain profiles from the workstation then run the update manually with a local admin account then have the user log back in with their domain account.We do use both roaming profiles and redirected user folders (i.e. Desktop, Documents, Favorites) which I think is part of the problem but that is normal a domain environment so I'm not sure what the exact issue is.  The error still occurs with a domain admin account that does not have a roaming profile or redirected folders and that does have full access to the appdata1 paths mentioned in the setup errors.I did follow the info here with no luck:I also checked the following:only the keyboard, mouse and monitor are connected - there are no other devicesonly the single hard drive where windows is installed is connectedsfc \/scannow shows no issueschkdsk shows no issuesremoved antivirus softwareall drivers are current and on the WHQLtried installing through Windows Update, downloading the update then running manually, using the media creation toolI'm out of ideas on what to look at next, I really don't want to have to manually update all of these machines again.  Does anyone have any ideas?Thanks in advance!","solutions":["Whoops, forgot link to troubleshooting guide I had followed:  https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-windows_install-winpc\/how-to-troubleshoot-common-setup-and-stop-errors\/324d5a5f-d658-456c-bb82-b1201f735683","Your device is missing important security and quality fixes.","I am not really good at reading the error listings directly but I see a couple of things you may know about.Error: 3 Message: Error opening the key HKLM\\Software\\Wow6432Node\\Microsoft\\Windows\\CurrentVersion\\Explorer\\KindMap: The system cannot find the path specified. [0x00000003]The KindMap is the listings of utilities tied to certain file extensions...  You might check that to see if it is missing or you did that intentionally.This next one would seem to be the primary cause, but not really sure.019-10-15 11:05:15, Error                 MIG    CShellLibrary: XML parse error while loading library \\\\domainnamespace\\data\\Users\\enduser\\appdata1\\Microsoft\\Windows\\Libraries\\CameraRoll.library-ms. Message:  hResult = 0x0, Line = 0, Position = 0; No data is available for the requested resource.. 2019-10-15 11:05:15, Error                 SP     Error READ, 0x00000005 while gathering\/applying object: File, \\\\domainnamespace\\data\\Users\\enduser\\appdata1\\Microsoft\\Windows\\Libraries [CameraRoll.library-ms]. Will return 0[gle=0x00000005]2019-10-15 11:05:15, Error                 MIG    Error 5 while applying object \\\\domainnamespace\\data\\Users\\enduser\\appdata1\\Microsoft\\Windows\\Libraries [CameraRoll.library-ms]. Shell application requested abort[gle=0x00000005]2019-10-15 11:05:15, Error      [0x08097b] MIG    Abandoning apply due to error for object: \\\\domainnamespace\\data\\Users\\enduser\\appdata1\\Microsoft\\Windows\\Libraries [CameraRoll.library-ms][gle=0x00000005]2019-10-15 11:05:16, Error                        Apply failed. Last error: 0x00000000","AliGhasemi2 - I don't think this is the case.  If I manually check for updates, it says it is current except for the 1903 update which won't install.  If I manually remove all of the domain user profiles then the update installs with no problems.  This tells me there is something in our profile settings that is causing an issue.Saltgrass - I agree, one of these errors is the cause I just can't figure out what to look at.  I am running the update under an account that has full local admin rights on the PC and has full read\/write access to the network folder path (I temporarily made the permissions full access to everyone, even unauthenticated users as a test but no change).  I checked the logs on a machine where I had removed all of the domain profiles and the KindMap error is still there but the update is successful so I don't think it's related.I did find some other things to try so I'll give those a shot today and post back on the results.","Is it possible to remove and then recreate the library or setup another one at a different location to test? Would you guess the problem is with something on those computers or the library?Since the listing only shows errors, do you have other such libraries at that same location which are not causing the problem.","I don't think it's the computers since they update fine when I removing the profiles for the domain users (this removes any pointers to network storage).  I'm wondering if we've got some kind of permissions or inheritance issue in the network share but I can't find it.  The user account running the update has full access to the path and is able to access it from the users machine, and I've confirmed the full path exists.We redirected all user folders\/libraries to this same network location.  None of the other ones show any errors.","If you have the ability, it might be helpful to compare logs from good upgrades and failures.  Some log files are quite large and I usually just look for errors so maybe the setuperr.log file would be the be best file to use.When I check Setupact.logs, I use a special text reader that can handle the larger files and allows you to compare two logs side by side and mark and highlight specific areas.  You may already have such a program but if you want the one I use, let me know.The windeploy situation is something I just saw in another thread.  The poster did not know what it was but I assume you do.  Could there be a problem with it?","windeploy.exe is part of the sysprep process that Windows uses to upgrade the system, as I understand it that's the piece that reapplies the settings\/personalization such as computer name and reapplying the user settings after the install.I compared  the log files from the good upgrade and the failed ones, the only difference I see is these lines don't exist on a good upgrade:2019-10-15 11:05:15, Error                 MIG    CShellLibrary: XML parse error while loading library\\\\domainnamespace\\data\\Users\\enduser\\appdata1\\Microsoft\\Windows\\Libraries\\CameraRoll.library-ms. Message:  hResult = 0x0, Line = 0, Position = 0; No data is available for the requested resource.. 2019-10-15 11:05:15, Error                 SP     Error READ, 0x00000005 while gathering\/applying object: File,\\\\domainnamespace\\data\\Users\\enduser\\appdata1\\Microsoft\\Windows\\Libraries [CameraRoll.library-ms]. Will return 0[gle=0x00000005]2019-10-15 11:05:15, Error                 MIG    Error 5 while applying object \\\\domainnamespace\\data\\Users\\enduser\\appdata1\\Microsoft\\Windows\\Libraries [CameraRoll.library-ms]. Shell application requested abort[gle=0x00000005]2019-10-15 11:05:15, Error      [0x08097b] MIG    Abandoning apply due to error for object:\\\\domainnamespace\\data\\Users\\enduser\\appdata1\\Microsoft\\Windows\\Libraries [CameraRoll.library-ms][gle=0x00000005]2019-10-15 11:05:16, Error                        Apply failed. Last error: 0x000000002019-10-15 11:05:16, Error                 SP     pSPExecuteApply: Apply operation failed. Error: 0x0000002C2019-10-15 11:05:17, Error                 SP     Apply: Migration phase failed. Result: 442019-10-15 11:05:17, Error                 SP     Operation failed: OOBE boot apply. Error: 0x8007042B[gle=0x000000b7]2019-10-15 11:05:17, Error                 SP     Operation execution failed: 13. hr = 0x8007042B2019-10-15 11:05:17, Error                 SP     ExecuteOperations: Failed execution phase Pre OOBE Boot. Error: 0x8007042B2019-10-15 11:05:17, Error                 SP     Operation execution failed.2019-10-15 11:05:17, Error                 SP     CSetupPlatformPrivate::Execute: Failed to deserialize\/execute pre-OOBEBoot operations. Error: 0x8007042BI'm really thinking this is a permissions issue on the file server, typically error 5 or 0x00000005 is an access denied message.  I think I'll play with that some more today and see what I can figure out.","Hi, I am seeing the same issue with some of our customers machines too, like you they are using redirected folders and it is always random libraries in profiles that it does not like, but it is not every machine that has this problem, but about 50% of them do. Sometimes we delete the affected profile and the upgrade succeeds, but that is hardly a solution for the ones where the affected profile is a current user of the machine.I am a silver CSP and have had no success in raising a case with microsoft about this. The feedback hub team say go away because they are domain connected PC's and the case I raised through \"Business support\" (convergsys in india) just wasted 3 hours of my time collecting logs and running dism and sfc before ultimately giving up saying \"we are a break fix team with no ability to escalate your problem to anyone who can help\".Microsoft support is non-existant these days.It annoys me that it is such a clear error in the logs, it specifically does not like the redirected libraries in random profiles, so why can I not find a channel to feed this back to a relevant team ?  deleting random profiles from machines is not a solution on 30 PC's! Nor is turning off folder re-direction! please is there any real Microsoft employees (not convergsys pretending to be microsoft support) around here who can escalate this to a relevant team ???????????","I've just resigned myself to only doing the feature updates once per year in October and I'll manually backup the profiles with the ProfWiz tool from ForensIT each time so they aren't lost.  At some point I'll have the time to rebuild all of the GPOs and redirected folders but for now this will have to do.I've had miserable luck with business support any time I've reached out, they just cycle through the same google search results and forum posts that I do so I really don't bother with them.At least I've only got 10 active machines at this point so I can spread them out over a couple of weekends or evenings, the other machines don't have domain profiles on them so they update just fine.If I ever do find a fix I will post it here."]},{"symptom":"windows 10 voice assistence crotana        I have activated cortana, but whenever I have to speak, I have to click on the microphone button only then Cortana listens. How can I give command to Cortana without clicking the microphone button every time? Cortana even does not activate by saying 'hey cortana'. Once I click the microphone button she understood my voice. Then again if I have to give another command immediately after the previous one, I have to click the micro phone first. This is annoying, how can I talk o cortana without pressing the microphone button??? ","solutions":["Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.You have to click on the Search bar, then click on the Settings icon and find the button to enable Hey Cortana."]},{"symptom":"WINDOWS 10 WILL NOT CONNECT TO INTERNET AT BOOT        I recently upgraded from Windows 7 Pro to Windows 10 Pro and now find that when I boot my computer it will not connect to the internet unless I restart it. I am currently using Windows 10 (Version 1909) and OS build number 18363.535. My modem is connected to the internet via an Ethernet cable. I ran trouble shooter without any success and have also uninstalled and reinstalled the network adapter without any success. In layman’s terms can you please advise how to fix this problem?","solutions":["Hi Philip. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything else possible for Ethernet problems to try so that hopefully something works:Right click the network icon in System Tray at bottom right end of task bar to Troubleshoot Problems.Try powering off modem, router and PC and then restarting in that order with 1 minute in between each.Try all of these steps: https:\/\/support.microsoft.com\/en-us\/help\/10741\/... https:\/\/www.kapilarya.com\/how-to-reset-network-...Update your network adapter drivers from the PC maker's Support Downloads web page using the full model number, HP Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.If you have the latest network driver then try on it's Driver tab also to Roll Back, or Uninstall and then restart PC to reinstall the driver. Try also all older drivers from Update Driver > Browse > Let Me Pick list working backwards.Go to Device Manager > Network Adapters, select Ethernet adapter, then Power Management tab, clear the check box to \"Allow the computer to turn off the device to save energy.\" Then on the Advanced tab disable any energy-saving options.If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2...You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t...If this was caused by Version update then you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2...Enable IPv6 in the network adapter settings: https:\/\/www.tenforums.com\/tutorials\/90033-enabl... Download and run the fixit from https:\/\/support.microsoft.com\/help\/929852 to Re-enable IPv6 on all nontunnel interfaces and reboot.Right click the network icon in System Tray at bottom right end of task bar to Troubleshoot Problems.If you're plugging into a router then try plugging into the modem directly. Try turning off Modem and PC, wait 15 minutes to turn back on the modem, then the PC.You also are entitled to Support from your internet provider to get online on all devices. This is always included in the monthly bill. If your router is less than a year old they will also Support getting it connected and optimized.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Wifi Adapter always disconnects        Hello. I have a big problem with my laptop (Asus Vivobook). It often disables the wifi adapter automatically and when this happens my laptop usually freezes and restarts (it shows the blue screen of death a lot). This also happens whenever I move my laptop, even just a little movement would cause it to disconnect the wifi adapter and my laptop would freeze and crash. Any idea how to solve this? I've tried updating the Qualcomm Atheros Driver but this issue still occurs.","solutions":["What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK .Go win key+X, Go Device Manager, Network adapters, click on adapter, click on Power Management, clear the check mark before \"Allow the computer to turn off this device to save power\"","It's OS Build 18362.535Tried doing the Power Management thing, yet still disconnects to the wifi when I move my laptop. It doesn't show the wifi button at all in Network and Internet Settings.","The blue screen also shows WFP Invalid Operation and sometimes Watchdog.","How are  you getting the WiFi, router, modem, telephone connection?  Is it close by or at a distance?","Hi Stellavcv, It would be better if you will check your Motherboard Brand\/Model and find the correct Chipset Drivers for your current system.In that case, you can determine if it's already a hardware fault or software. Also, you can use an external Wifi Dongle to further investigate as well. Let me know if this clarified your concern. Thanks and regards,","The router is quite close, less than 3 meters away. I don't think it's a problem with the router or modem since my other devices work perfectly fine and my laptop does not detect any wifi connections when this issue occurs. ","Hello. I've once tried a wifi adapter that connects through USB, however this did not work either. I've tried downloading the appropriate driver for my model from the manufacturer website but it wouldn't install and it just makes my laptop freeze.","When you plug in the USB adapter did you go into Device Manager, Network, click on it and see more than one adapter?","Hi Stellavcv, Can you remember if you installed an update before experiencing this issue as well?If yes, what I can suggest is to rollback and disable your windows update for the mean time.This actually worked for me, please follow this link for detailed guide: https:\/\/www.windowscentral.com\/how-stop-updates...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"Slow startup        What is causing slow startup of over 3 minutes? also, display settings of 150% revert to 100% after restart","solutions":["Hi Ted. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.2) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 3) If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... -------------------------------------------- But remember that in Windows 10 everything depends upon the quality of the install, and Factory or Upgrade installs are inferior installs which most enthusiasts won't even run because they'd expect endless issues. Consider now or later doing the Clean Install in this link which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... There is also an automated Fresh Start that reinstalls WIndows while shedding corrupting factory bloatware, saves your files, but doesn't clear the drive to get it cleanest:https:\/\/www.howtogeek.com\/265054\/how-to-easily-... I hope this helps. Feel free to ask back any questions and let us know how it goes. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"No cursor on windows setup        I had just recently reinstalled Windows 10 and i’m pretty sure I had downloaded an old version. Now I can’t get past “Let’s connect you to a network”","solutions":["Hi dazaidc, My apologies and thank you for reiterating that. You can use the Tab key on the keyboard to switch between areas on the screen, and then the Enter or spacebar to select it. When you hit Tab, there should be a dotted square around the selected item. You may have to press it quite a few times to get down to the bottom of the screen. I can't remember if there is an Alt shortcut, but also if you hold down the Alt key on the keyboard, it may underline one of the letters in \"Skip for now\" - you can then hold down the Alt key and that letter to select the link.I hope this helps! -Ashton"]},{"symptom":"iaStorAC.sys 17.7.0.1006 still causing BSOD during use        My PC was running absolutely fine without crashes despite having had to \"fix\" it many times over the years due to forced updates. I am not at a loss for this newest one. I had been running stable for a long period since the last time I had to \"fix\" it after an update. Then the 1903 Update happened and I was still fine for a short period until the Cumulative updates started to pour in as forced updates. Now I experience periodic BSOD showing iastorAC.sys as the affected file. There are never any logs to check as it sits at 0% until I give up waiting and restart the PC. I have followed everything I can find to correct the latest forced update crash as I can find. I have updated the BIOS from the ASUS website to the newest version. I have updated the Intel RST driver tot he newest one (1.7.0.1006) and Still I get BSOD regularly. It happens several times a day. - The aftermath -I did a complete DNR and so far it seems to have fixed the issue but I lost years worth of configurations and files.  I followed the clean install guide and had backed up everything I could think of to back up but you cant understand how many small changes I had made through the years that were lost in the reinstall. Also I lost an entire secondary drive of data due to rights and permissions. Nothing I could do would let windows give me back access and the more things I tried the more it fought until I gave up and formatted that drive too >:( Windows behaves as though I am a completely new user on the account and an entirely new PC. I did finally get windows to give me back access to my NAS but I am very unhappy with the whole procedure as it was as bad as I thought it would be. There was no reason for this to have even happened since my PC was running perfectly fine until the updates that killed it.","solutions":["Hi Joseph. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Guardian Moderator here to help you.If you want to express your opinion on this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems. If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it.I see you're interested in possibly doing a Clean Install, which is the ultimte solution to chronic problems with Windows 10. What we have found is that in Windows 10 everything depends on the quality of the underlying install, the same reason enthusiasts have never run Factory or Upgrade installs because they know there would be endless issues.For example there have been zero return problems by those who follow the gold standard Clean Install here:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... It is better and faster than any previous version of Windows, and a better install than any amount of money could buy. So when you get time I'd study over that to see if it's something I can help you do.You can use the latest media because problems which occur during the Version Upgrades almost never repeat during a Clean Install.. But if they do I will help you either fix them or use older media to install the version which works best, then help you hide the newer version so it doesn't force itself again. You can see here how to uninstall and hide any Updates you don't want:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to rate my post, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I would try uninstalling the Intel RST 17.7.0.1006 package and let your Windows 10 1903 system revert back to using the built-in Intel Chipset SATA RAID Controller:Uninstall the Intel RST package from Control Panel --> Programs & Features. This will only remove the UI, not the driver.Go to Device Manager --> Storage controllers --> Intel(R) Chipset SATA\/PCIe RST Premium ControllerDouble-click to open. Go to Driver tab. Click on Update Driver.Click on Browse my computer for driver software.Click on Let me pick from a list of available drivers on my computer.Select Intel Chipset SATA RAID Controller and click on Next.Windows 10 will switch to the selected driver and you will have to reboot.You can probably successfully continue using the built-in driver to install any future cumulative updates, but it has no UI to maintain the RAID. If you try reinstalling the 17.7 Intel driver and it fails, retry using the latest version 16 or version 15 drivers with your older chipset.FWIW, I recently upgraded my Intel H87RL motherboard to rid myself of random BSOD's and reboots that I attributed to my Thermaltake power supply. I ended up getting a Gigabyte H370 mb with an i5-9400 CPU, and the RAID chipset works very well with the current Intel drivers and the same power supply. Like you, I tried stringing along the old motherboard by doing a fresh install of Windows 10, but ultimately things went wrong once again. Unfortunately, there's little incentive to keeping the firmware and drivers up-to-date on 6 year old equipment. The similar equivalent of X79 is the Z270, Z370, Z390 or X299 depending on how much you need to tweak your motherboard settings.","I have the same issue and I try to find why this happenI try to work on it since 29-12-2019 each time I downlaod new game on my raid 0 i got a bsod after few second on steam\/battle.net\/twitch...after some test all worked fine for what 30 minute and happen again and again. so I connect my raid in a second PC (still using my mian PC psu)which was not update for almost 6 month , so I test and crash also on it so i thinking is my raid the issue , just still able to read it. So I move back to my main pc , transfer the file from the raid to an another drive connected to the RST and bsod again????I see the writed drive slow down and finish at 0kb\/s and have spike to 3 mb\/s ever 10 seconde My main drive is not affected , only the one on sata crash.Also I see the cache acting and filling the ram when the second drive deny to write so the crash only happen in writing process and not reading processMain pcI9 9900k64 go of ram 4x16GBgigabyte aorus z390 ultraXPG 8200 nvme 500 gbhgst 500 gb satacrucial 500mx sata 2x 2tb wd purple raid 0Seond pc core i5 740016 gb of ramgigabyte z270 hd3pwd blue sata m.2 ","What brand PSU are you using, and how many watts is it rated for?You have a lot of equipment on your first pc, and may need a larger power supply.What video card(s) are you using?Are you using the latest version of Windows 10 x64? (1909, released 2019\/10)Are you using the latest firmware for your Gigabyte Z390 Aorus Ultra? (F9, released 2019\/10\/28)Are you trying to overclock your CPU or memory?When I Google WD purple, one of the first questions that comes up is \"Can I use WD Purple for gaming?\"Answer:WD Purple has optimized writing speeds, special error correction features and is generally developed and tuned for DVR and other surveillance systems. Itcan work, but there may be some data corruption due to the error correction feature of the drive that is designed to record videos with no frame losses.You might want to switch to a different model WD drive more suited to gaming and Raid like the WD Blue 7200rpm models.If I were trying to solve this BSOD problem, I would find myself a spare hard drive and install a fresh copy of Windows 10 1909 on that hard drive with no other hard drives installed. I would then run Windows Update, and then install the RST 17.7 driver, the current video driver, the current version of steam\/battle.net\/ etc., and the 2 raid 0 drives. No other apps or software. See how long you can use this configuration without getting a BSOD.Finally, I would add the rest of the hard drives, but still boot from the spare drive with the fresh copy of Win10 and again see how long you can use this configuration without getting a BSOD.","I have a 850 watt psu , right now i check the voltage line 12 and 5 volt The drive is mostly for steam , origin b.net etc. Just i got same error without this drive, I have a hdd on an another port and same issue and I disconnected the sata on the array and keep the non-raid drive and got sometime bsod other time a slow down to ZeroI do a check with aida64 , this one can read the S.M.A.R.T code of each drive on intel RST and Zero error I unknow why just if I put out the raid array drive and put on the floor and connected , actually no issue after a good 30 minute ..... there are stacked one on the other one  with only the cady from the caseAlso I don't read the data from the copy box , i check the read\/write with aida64 and taskmgr since the copy box show the read speed only and paste in the cache so the speed is fake on the writing side Before the issue happen i runned on windows driver and windows 10 1903 I update the driver to intel  and after, windows 10  1909 thihnking that can fix the issue and it's still happen I still digging on this issue and see what will happen in few hours maybe playing with a cable to find what is wrong Alos i use a corsair crystal series 460x , and the psu is a  Corsair CP-9020130-NA TX Series TX850M 850W 80 Plus Gold   "]}]}