{"windows":[{"symptom":"Not picking any networks on WiFi        Strange issue seems to be occuring. I have a HP laptop which is only a couple of months old and it has completely stopped picking up any networks wirelessly. Hotspot from phone doesn’t appear, my home wifi has stopped appearing. I’ve tried to set up a network manually (home wifi) and have a message appear saying an unexpected error has occurred. very confused","solutions":["My WiFi network isn’t the issue as I’m connected via my iphone.","Hi PCT89, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.Have you checked that your Wi-Fi is enabled, and that Airplane mode is off? For a visual, please see: https:\/\/support.microsoft.com\/en-ca\/help\/402742... If you have checked this, can you provide the model of your HP laptop? We can help you find the download link for the wireless adapter drivers, which may help resolve this issue.Please also see Microsoft's guide to Troubleshooting network problems in Windows 10 here:https:\/\/support.microsoft.com\/en-us\/help\/10741I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","Problem has been resolved","Hi PCT89,and what was the cause of the problem?Other users may have the same problem, why don't you share your solution with the community you asked for help?"]},{"symptom":"Windows 10 Pro license language        Is the license for Windows 10 Pro bound to a specific language or can I use it to activate any installation? For example, can I use the Windows 10 Pro license bought in Poland to activate the English (international) installation?","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.As long as you have not purchased the single language edition you should just be able to change the language without reinstalling, following the steps in this article:https:\/\/www.windowscentral.com\/how-properly-cha...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Is the license for Windows 10 Pro bound to a specific language or can I use it to activate any installation? For example, can I use the Windows 10 Pro license bought in Poland to activate the English (international) installation?Hello,AFAIK, Windows 10 license is not language specific for Pro edition.Regards."]},{"symptom":"Windows 10        Cumulative Update for Windows 10 version 1809 for x64-based Systems (KB4530715) (5)Last failed to install 2012-01-12--0x80070011","solutions":["Hi Ion Bolohan Microsoft have released version 1909 of Windows 10, click the link below, then click 'Update Now' on that page to immediately get 1909 and bring your PC right up to datehttps:\/\/www.microsoft.com\/en-us\/software-downlo...","Cumulative Update for Windows 10 version 1809 for x64-based Systems (KB4530715) (5)Last failed to install 2012-01-12--0x80070011 Hello,I recommend you to upgrade to latest version i.e. V1909, via ISO file.Refer this step-by-step guide:https:\/\/www.kapilarya.com\/how-to-upgrade-to-windows-10-using-iso-fileLet us know if this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP. "]},{"symptom":"Critical Process has Died after ending windows explorer        My system wont worm after ending rhe process please help.","solutions":["Hello pickleking23, I'm Didi, an independent advisor. Can you please confirm me that you had a blue screen showing CRITICAL_PROCESS_DIED ?What happens when you restart your computer ? Can you log in to Windows or not ? If not, do you see any error message ? Regards, Didi"]},{"symptom":"Error Code 0x80070032 on Settings -> Update & Security -> Backup        Hello !Facing this error when trying to add D:\\ (exFAT) drive to Backup to an external USB Drive, could add C:\\ drive (NTFS)Please assist.Regards,royashish.","solutions":["Hi royashish My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.I understand for file histories to be backed up the target needs to be formatted in NTFS.Hope this helps.","Dear Jon,Thank you for the response. If i understand it right, I need to reformat D:\\ drive to NTFS to resolve this issue?How about the SSD Drive, where i want to keep the backup, can that be exFAT?On a side note, the cryptic error kills the user experience. With Windows being such a mature OS, it would be nice to see a user friendly message on the root cause.Regards,royashish.","I would advise to use NTFS on both as it is more efficient than exFAT, has more features and more importantly fully compatible with Windows 10."]},{"symptom":"Problem with Updating Windows        I just tried running the latest 1909 update on my system, it then got to 48% and stopped. Showed a blue screen with error message, something about driver pnp watchdog.","solutions":["Hi Krae_king My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Try using the System File Checker Head to the Start Menu. Search for Command Prompt and then right-click the Command Prompt icon. Tap the Run as administrator option. Type sfc \/scannow and then hit the Enter button on your device keyboard. Make sure to wait until the process ends by itself. Once the process finishes, make sure to close the Command Prompt and then reboot the PC.Try updating again. Hope this helps.","Check VSS serviceStep 1: Press the Win key + R key together to open the Run dialog box. Next, type services.msc and press Enter to open the Services window.Step 2: Find the Volume Shadow Copy service in the list. Double-click it to open its Properties window.Step 3: Set Startup type to Automatic and set Service status set to Running. Then click Apply and then OK to save your changes.Step 4: Restart your computer.Rename Windows foldersStep 1: Type cmd in the Search bar, right-click Command Prompt and choose Run as administrator. When the User Account Control window pops up, click Yes.Step 2: Type the following commands one by one and press Enter after each one:net stop wuauservnet stop cryptSvcnet stop bitsnet stop appIDSvcStep 3: After running the commands, navigate to Local Disk (C:)\\Windows\\SoftwareDistribution. Rename SoftwareDistribution to SoftwareDistribution.old.Step 4: Now, navigate to Local Disk (C:)\\Windows\\System32\\catroot2. Rename catroot2 to catroot2.old.Step 5: Open the Command Prompt window again, then type the following commands one by one and press Enter after each one:net start wuauservnet start cryptSvcnet start bitsnet start msiservernet start appIDsvcStep 6: Exit Command Prompt.Step 7: Right-click the Start menu and then choose Windows PowerShell (Admin) to open it.Step 8: Type the command: wuauclt.exe \/updatenow and press Enter.After that, restart the system and check if the DRIVER PNP WATCHDOG error has gone."]},{"symptom":"Windows Hello, Cant change due to organisation         Cant change settings due to this...","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.If you've added a work email account to the computer (ie. usually an Office 365 email address) it will apply your organization's security policy to the computer - this is probably why you're facing this message. You need to comply with the security policy to have the work account added. Regards, David","OK, do you know how to remove the email then? ","There are a few options. Did you add your organisations email address to Windows in Settings? If you have a look at my screen-shot from my own computer you'll see it lists my organisation account - this page is under START > Settings (the cog) > Accounts > Access Work or School.Restrictions may also be applied if you've added an organisation email address in the Outlook or Mail app - in that case you'd need to remove the email address.Additionally if your computer is \"joined\" to their domain there will be policies applied via that which you might not be able to override yourself - you would need help from the IT department.","I added the email accidently thru powerpoint, how may I resolve this? ","If you added if via an Office app you can sign-out from that same app. Open PowerPoint to a new or existing file, go to the File menu, then Office Account... if it's signed in there will be an option to sign out.However when you added the account it might have also added it to the Settings app where I indicated previously, so have a look there too. You can click and remove it from there if required.","Okl, it appears that doing these things, it still didnt help,any further help?"]},{"symptom":"Cannot activate Win 10 Pro        Product key was from Win 7. Used free upgrade to Win 10 years ago.I had problems with activation on my old PC (same version of Windows) and using a non-genuine product key solved this.A few months ago I changed everything in my PC except the harddrive with Windows on it.Last few weeks I have been getting warnings to activate Win 10 but I continually get 'cannot activate' errors. I use the genuine and non-genuine codes.It states something about not being able to connect to my organisations activation server (this is a private PC). Error code: 0x8007232B.I now have a watermark on the screen.I have attempted to buy a new activation code but that hasnt been successful.I followed the error help page with using 'SLUI 04' which also failed.I would just like to stop the regular popup and remove the watermark. My product key should be valid but if I must, I will buy a new one, if I can find a way to make that work.","solutions":["Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.1. You can remove the current activation key by running slmgr.vbs \/upk. This should remove the current activation and KMS. slmgr.vbs \/dlv should confirm it.2. Next run slmgr.vbs \/ipk {product key} to add the new product key. You can try the Windows 8.1 key you had previously, it might work. If it doesn't, buy a new license and start from Step 1 again.3. Then finally run slmgr.vbs \/ato to activate windows. Windows must not be joined to an Active Directory Domain in this case. If you want to know more technically: https:\/\/docs.microsoft.com\/en-us\/windows-server... Please let me know if I can help you further!"]},{"symptom":"Entire system makes so much trouble        At a random point my desktop showed nothing but my wallpaper and a frozen taskbar when I booted up my PC. Each time I boot it up, it'll ask to run a disk check, when it runs it'll pause at 11% and skip the check without me having to do anything, and show the same frozen desktop. I tried safe mode and startup repair but nothing worked so I decided to reset my pc with keeping my files. After it finished reinstalling windows I redownloaded some of my apps, but ones such as FL Studio became extremely laggy for some reason, so I tried manually removing the old files\/duplicates, and deleted onedrive as well. Soon windows explorer wouldn't work either when I click on This PC, so I restarted the PC and it would work. But then, I go to settings, and when I click on system, the entire system app freezes. Other microsoft apps like calendar, cortana, groove music or even the search bar wouldn't respond either. I went through so much trouble and I am extremely frustrated with this, please give me a straight forward solution. Thank you.","solutions":["Hi Ryan My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.1. Type \"cmd\" in windows search bar 2. Right click on \"Command Prompt\" 3. Select \"Run as Administrator\" 4. Type \"sfc \/scannow\" without quotes and press ENTER Then: 1. Type \"cmd\" in windows search bar 2. Right click on \"Command Prompt\" 3. Select \"Run as Administrator\" 4. Type \"DISM \/Online \/Cleanup-Image \/CheckHealth\" without quote and press ENTER 5. Type \"DISM \/Online \/Cleanup-Image \/ScanHealth\" without quote and press ENTER 6. Type \"DISM \/Online \/Cleanup-Image \/RestoreHealth\" without quote and press ENTERHope this helps.","Hi, thanks for your replysfc \/sacnnow said it could not perform the requested operation, the DISM commands said the component store have been corrupted. Are there any additional steps to fix that?","Try booting into safe mode and then running the sfc \/scannow command. Safe Mode Click Windows-button → On\/Off. Hold down the Shift key and click Restart. Click the option Troubleshoot and then Advanced options. Afterwards go to “Advanced options” and click Start-up Settings. Under “Start-up Settings” click Restart. Several boot option are displayed. Try running this command to cleanup the components to be able to run the DISM commands in my previous post.Run StartComponentCleanup Command Press Windows Key + X then select Command Prompt (Admin). Type the following command into cmd and hit Enter: Dism.exe \/online \/Cleanup-Image \/StartComponentCleanup Wait for the command to process, then restart your PC.","I've tried using the command prompt in both recovery environment and safe mode with command prompt, but both of them say \"Windows Resource Protection could not perform the requested operation.\" ","Change Security DescriptorsA security descriptor contains the security information associated with a securable object. If SFC scan fails to access winsxs folder, the issue SFC scannow not working issue may also occur.So in order to solve the issue SFC Windows resource protection could not perform the requested operation, you can try to change the security descriptors.Step 1: Type cmd in the search box of Windows 10 and right-click Command Prompt to choose Run as administrator.Step 2: In the command window, type the ICACLS C:\\Windows\\winsxs command and hit Enter to continue.After that, you need to close the command window and restart your computer to check whether the issue SFC Windows resource protection could not perform the requested operations is solved."]},{"symptom":"I need HP Solutions Center        I need HP Solutions Center to scan with  HP Photosmart Scanjet G3010 . Where and how can I obtain it?","solutions":["I akst Siri and he\/she\/him\/her\/it\/we\/they\/us\/them said to click\/tap this link:https:\/\/lmgtfy.com\/?q=hp+solutions+centerNeedingfurther clarification Siri said to clip\/tap this link:https:\/\/support.hp.com\/us-en","This is what you need to see if your printer is working correctly:HP Printers - Using HP Diagnostic Tools for HP Printers in Windowshttp:\/\/support.hp.com\/au-en\/document\/c02073861HP provides a free tool called HP Print and Scan Doctor to diagnose and resolve printing and scanning problems. Download and runHP Print and Scan Doctor to quickly and automatically perform several troubleshooting tasks. When this link is clicked, HP Print and Scan Doctor is downloaded using your Internet browser's download capabilities.Or you can also ask in the HP Support Forums if the problem continues.http:\/\/h30434.www3.hp.com\/psg\/@@@@@@@@@@@@@@@@@@@@@@@","I need HP Solutions Center. Where can I find it? you can send me.*** Email address is removed for privacy ***","I need HP Solutions Center. Where can I find it? you can send me.*** Email address is removed for privacy ***If you want to fix your HP printer use what I gave you.Or ask in the HP ForumsAnd your email address is blocked from being posted to protect you from scammers who may contact you.And all replies are posted to the community; not by email or phone contact"]},{"symptom":"Fortnite Download        I want to download fortnite on my pc, but when I go to download it, its saying \"pick where you want to install . It looks like you don't have any applicable devise(s) linked to your Microsoft account. To install, sign in on a device with your Microsoft account. (then in blue) Get more info on your device list.\"Iv tried two of my other accounts and still not working.Can anyone help??","solutions":["Hi Rylan This seems to be be reported quite a bit by users at the moment . . . What has worked for most user is to make sure Windows 10 and the Store App are fully up to date and if necessary, reset the Store App . . .1 Click your Start Button, type winver and hit Enter On the resulting dialog, what Version No. and build No. of Windows 10 are you running?2 Click your Start Button, then just type wsreset and hit Enter When that process completes, try to see if the Store recognizes your device . . .","Or.... forget about downloading the game from the buggy MS Store and having to stuff around with MS's 'unique' arcaneGFWL Mk2 system, and download it directly from EPIC.... Too easy....Epic Games | Store","Didn't work","I don't have enough space on my computer to download it","Version No. 1903Build No. 18362.418","You don't have to install the EPIC client software (around 750MB)  in C:\\. You can install it in the same location you are wantingto install the game if you download it from the MS Store.- Also, if you don't have enough space to install the EPIC client on C:\\ you still need to do something about the lack of spaceon C:\\  or you will continue to have space related issues.In part because you need to have at least 15% free space on C:\\ for defragmenting a HDD or optimising an SSD.The most reliable and less troublesome option is to get a larger drive..","Hi, It sounds like you may not have sufficient space on the device to install it. 9.5GB of space is required to download it and a total of 20GB once it is installed.Please check you have enough space available, if you are still facing the issue. Please let us know so that we may troubleshoot the issue further.","I have enough space on my pc to download it. it just wont let me. it says it cant find a device to download to."]},{"symptom":"My PC gets restarted suddenly when playing a game or running a program.        My PC keeps getting suddenly restarted with no reason, i checked my CPU temperature and its around 50-55 Celsius in games or big programs.i tried to disable ''Auto-restart'' in Complex Computer Settings but no luck.","solutions":["Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.Check if you have no virus with an antivirus. Otherwise you can also have malwares. I suggest these two free and powerful anti-malware ... AdwCleaner: https:\/\/www.malwarebytes.com\/adwcleaner\/Malwarebytes: https:\/\/malwarebytes.com\/Let's start with that and we'll test something else later. Give me news ;-) _________________________________________________ Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","HD videos sound audio","Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.Check if you have no virus with an antivirus. Otherwise you can also have malwares. I suggest these two free and powerful anti-malware ... AdwCleaner: https:\/\/www.malwarebytes.com\/adwcleaner\/ Malwarebytes: https:\/\/malwarebytes.com\/ Let's start with that and we'll test something else later. Give me news ;-) _________________________________________________ Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Win 7 trying to update to Win 10 failed using the MediaCreationTool1909        Windows edition: Win 7 Pro, Service pack 1Tried updating to win 10 using media creation tool but failed with this error:We couldn't install Windows 100x8007001F  0x20006The installation failed in the SAFE_OS phase with an error during REPLICATE_OC operationPlease visit: https:\/\/go.microsoft.com\/fwlink\/?LinkID=528892Visited that website and followed the instructions, am stuck at the steps involving running windows troubleshooter and running windows update. Details as follows:Windows Troubleshooter Failed checks:Windows Update error 0x80070057 (2020-01-12-T-12_28_44P) -- Not fixedCryptographic service components are not registered -- Not fixedWindows Update always fail for this important update:Security Intelligence Update for Windows Defender Antivirus - KB915597 (Version 1.307.2168.0)Download size: 49.0 MBUpdate type: ImportantInstall this update to revise the files that are used to detect viruses, spyware, and other potentially unwanted software. Once you have installed this item, it cannot be removed.Have tried running sfc \/scannow but result was \"Windows Resource Protection did not find any integrity violations.\"Have uninstalled all external antivirus softwares and disconnect all external hard drives \/ devices. Appreciate all the help I can get. Thanks in advance.","solutions":["1st install:  windowsupdateagent-7.6-x86As far as Defender,in cmd,type: services.msc   In msc,scroll to Defender,double click,set to: Auto start start service.Exit,scroll to Windows Installer & Modules,do same.Any service set as Disabled should get checked,setting to Manual start,lets the OS run it if needed.As far as Win 10 goes,download the Windows 10 upgrade assistant.","Hi Andrew,Appreciate your response. I have followed your instructions for installing windowsupdateagent and changing the services. However the errors are still persisting."]},{"symptom":"Connected but \"No internet\" | Constantly losing internet connection        Dear Microsoft Community,I am not sure if this problem has been solved already, since I could not find anything related to that. So, once I am conneting to our WiFi network, I have a good working internet connection. I do that using my \"Realtek RTL8192CE Wireless LAN 802.11n\" adapter. Now, the internet connection works fine for like 30-40 sec, after that it interupts and says \"no internet\" in my WiFi settings. I tried using the Windows diagnose tool, unfortunately it is not working. I also tried using other network adapters which also were not working. Once I reconnect 2-3 times the internet connection starts working for another 30-40 sec. I tried various fixes, unfortunately none of them worked for me. Any suggestions?","solutions":["Hi Amx. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything that works to fix Wifi so that at least something will work. Even if you've already tried a step please try or check it again in sequence. If you need any assistance I'll be standing by here to help:Update your network adapter drivers from the PC maker's Support Downloads web page using the full model number, HP Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.If you have the latest network driver then try on it's Driver tab also to Roll Back, or Uninstall and then restart PC to reinstall the driver. Try also all older drivers from Update Driver > Browse > Let Me Pick list working backwards.Go to Device Manager > Network Adapters, select Wifi adapter, then Power Management tab, clear the check box to \"Allow the computer to turn off the device to save energy.\" Then on the Advanced tab disable any energy-saving options.If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool explained here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them.If this was caused by Version update then you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool.For Wifi won't connect after Version 1903: https:\/\/windows101tricks.com\/fix-wifi-keeps-dis...https:\/\/www.techrepublic.com\/article\/wi-fi-and-...https:\/\/pureinfotech.com\/fix-wifi-problems-wind...Enable IPv6 in the network adapter settings: https:\/\/www.tenforums.com\/tutorials\/90033-enabl...Run the fixit from https:\/\/support.microsoft.com\/help\/929852 (Re-enable IPv6 on all nontunnel interfaces) and reboot.Right click the network icon in System Tray at bottom right end of task bar to Troubleshoot Problems.Try all of these steps: https:\/\/support.microsoft.com\/tr-tr\/help\/10741\/... https:\/\/www.kapilarya.com\/how-to-reset-network-...Go to Settings > Network & Internet > WIfi > Manage Known Networks, highlight and remove the network having problems, restart PC to see if it shows up again.Try plugging in by ethernet cable to the router to compare, then plug the ethernet cable into the modem (if separate) to see if this might be an issue with the router.Try powering off modem, router and PC and then restarting in that order with 1 minute in between each. You may need to reset your router or even optimize it following these steps:https:\/\/www.lifewire.com\/resetting-a-home-netwo...https:\/\/www.pcmag.com\/article\/258865\/how-to-set...Your router manual is always available from the manufacturer's website for your exact model.You also are entitled to Support from your internet provider to get online on all devices. This is always included in the monthly bill. If your router is less than a year old they will also Support getting it connected and optimized.Another option is you could replace the wireless adapter with an inexpensive USB nano adapter like this one:https:\/\/www.amazon.com\/OURLiNK-600Mbps-Wireless...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"windows server Backup        I have issue with windows server backup i can not set the differential backup system there is no option  is not flashing as well as please guide with to get that.this is windows server(2012)while it goes to full backup with only day backup means yesterday backup only its flashing , if i want to do recovery of day before yesterday i can not able to recovery its not showing only option yesterday backup. ","solutions":["Hi Aziz I am sorry, Community is just a consumer forum, due to the scope of your question (Server 2012) can you please post this question to our sister forum on TechNet in the Server 2012 section (linked below)Over there you will have access to a host of Server 2012 experts and will get a knowledgeable and quick answer to this question . ..https:\/\/social.technet.microsoft.com\/Forums\/en-..."]},{"symptom":"Activation of windows 10        I upgraded my dell laptop to windows 10 from windows 8.1 then due to any reason i need to reset my laptop because of that i got switched back to windows 8.1 again. Now i am trying to switch to windows 10. It is asking me to enter product key (as my product key got blocked) which i don't have. As i bought this laptop with installed genuine windows 8.1 and then upgraded it to windows 10. Can somebody please help? What should i do to switch to windows 10 again.","solutions":["I upgraded my dell laptop to windows 10 from windows 8.1 then due to any reason i need to reset my laptop because of that i got switched back to windows 8.1 again.Now i am trying to switch to windows 10. It is asking me to enter product key (as my product key got blocked) which i don't have. As i bought this laptop with installed genuine windows 8.1 and then upgraded it to windows 10. Can somebody please help? What should i do to switch to windows 10 again. The product key for what got blocked?Your question is confusing.","0xC004C003 it is showing this error and stating that your product key has been blocked.","0xC004C003 it is showing this error and stating that your product key has been blocked.You still have not told me what operating system product key is blocked.You can sort it out from reading this:https:\/\/support.microsoft.com\/en-au\/help\/10738\/windows-10-get-help-with-activation-errorsApplies to: Windows 10Windows 7Windows 8.10xC004C003You may see this error because the Windows 10 product key you entered isn’t valid. Product keys are unique—assigned to a specific user to install on a single device. If a key was used (or attempted to be used) on multiple devices, it’s marked as not valid. To activate Windows, you’ll need to provide a different Windows key unique to your device.   If you bought a device from a reseller of Windows 10 and expected the key to be valid, contact the reseller. If your device was purchased with Windows 10 preinstalled and you received this activation error upon turning it on for the first time, contact your device manufacturer. If your experience with your device is different from those listed above, try the following: Run the Windows 10 Activation Troubleshooter: Select Start > Settings  > Update & Security  > Activation and then select Troubleshoot. Open Activation settingsCheck to see if you have a paper copy of your Windows 25-character product key you can enter to activate Windows 10. If your device was recently repaired at an independent repair facility, contact them to see if the repairs require a new Windows 10 license. If the device is new and has never been activated, contact your device manufacturer. ","I have tried this already but i didn't work and i have windows 8.1 genuine and upgraded to 10 with digital license and now moved back to 8.1 and trying to switch to 10 by \"activate windows\" tab by it was showing above stated error.","Product key of windows 10 has been blocked that was digitally licensed with 8.1","If you had the free upgrade to 10 from a genuine 8.1 and you later decided to revert back to 8.1 this is how to go back to 10 again.If you then still have problems, contact Microsoft Support.We don't work for Microsoft.@@@@@@@@@@@@@@@@@@@The best method to upgrade back to 10 is to clean install it.Use the Windows 10 media creation tool on the Software download page \"Start fresh with a clean installation of Windows 10\"https:\/\/www.microsoft.com\/en-us\/software-download\/windows10startfreshReinstall Windows 10:https:\/\/support.microsoft.com\/en-us\/help\/4000735\/windows-10-reinstall\"How to Clean Install Windows 10\"http:\/\/www.tenforums.com\/tutorials\/1950-windows-10-clean-install.html_______________________________________________How to Create Bootable USB Flash Drive to Install Windows 10 fromThis tutorial will show you how to create a bootable USB flash drive that can be used to installWindows 10 with or without UEFI.________________________________________________To access BIOS\/UEFI - UEFI\/EFI configuration:https:\/\/neosmart.net\/wiki\/boot-usb-drive\/_____________________________________When your free upgrade to 10 was  originally activated Microsoft will have kept the Hardware Configuration details of your device on their Servers for recognition purposes if you have to reinstall 10.\"Activation in Windows 10\" (Digital entitlement)https:\/\/support.microsoft.com\/en-au\/help\/12440\/windows-10-activation"]},{"symptom":"wireless internet        how to connect to modem","solutions":["Hi raniragul,specify exactly what your problem is.https:\/\/support.microsoft.com\/en-us\/help\/10741\/windows-fix-network-connection-issues"]},{"symptom":"Invalid Driver Signature        My Qualcomm Atheros driver will not work due to invalid driver signature. Unless driver signature enforcement is disabled, the driver still won't work. This however, re-enables after restarting the laptop. How do I fix the driver, or 'validate' the signature? Or how do I keep driver signature enforcement disabled? Please help. Thanks!         ","solutions":[]},{"symptom":"Ping spikes \/ Potential packet loss        Good evening,Recently I have switched over to Verizon Fios as my ISP. I have a dual band USB adapter in my PC which allows me to connect to WiFi. After having Fios for 2 weeks, I have noticed that I am getting consistent Ping spikes when playing games or even browsing the web and a webpage takes a while to load. This shouldn't happen as my speed is 370Mbps \/ 350Mbps.I first realized about this issue when I was playing games like Battlefield 5, Rainbow Six, CSGO, Star Wars Battlefront 2. These spikes would make these games completely unplayable.I even tried pinging google on command prompt and I notice the ping spikes.Some things to note:1) On the latest version of Windows 102) This issue only occurs on my desktopI have tried a numerous of things that I have read upon on the forums:1) Updated network drivers2) Turning on and off Airplane mode and Wifi3) Reinstalling network drivers after uninstalling them4) Disabling IpV6 on my network connection5) Running netsh wlan set autoconfig enabled=yes interface=\"Wi-Fi 2\" in cmd prompt6) Factory resetting my PC and installing Windows. *** This actually fixed the issue but the issue returned 2 days later ***7) Restarting my routerI have honestly no idea no what else to do. I would appreciate any replies and thank you for your time.","solutions":["Hi ander9991,to try to isolate the problem, if you can, connect to the router temporarily via network cable, then check if the ping improves.Another test you can do is to force the router to work on the 2.4 GHz band, keeping the 5 GHz one disabled and check if the ping improves, or perform the reverse test.Are the router and PC located on the same floor as the house?Are the 2 devices positioned close to or very distant?","When connecting an Ethernet cable, a brand new problem arises. At first it says Unidentified Network - No internet access. I have done some googling and I manually changed the IP address of my PC and it seemed to recognize the network as I was able to see the network name. However there was still no internet access. I then tried to change the DNS servers to some values suggested such as 8.8.8.8 and 1.1.1.1 and it seemed to work. However, I am unable to do anything after that. For instance, If I try going on google it'll just say connecting... and will never connect.The problem still persists on both bands. My PC is approximately 10-15 feet away from the router and on the same floor.","But on the wireless network card did you set DNS and static ip address?If yes, set the same IP addresses on the LAN card, then temporarily disable the wireless network card and repeat the test by connecting via network cable.","No it obtained it manually (wirelessly). On the wired end, I have to manually assign an IP address because it kept saying unidentified network. Then I manually assigned the DNS server of 8.8.8.8 and it seemed to work but I was never able to connect to any webpage.","The PC must be able to work even when connected via a network cable. Is the connection via ethernet direct, from the PC to the router or do you use a hub \/ switch?This test, if I could do it would be very indicative to understand if the problem is caused by the wireless network card or by some application or program that interferes with the wi-fi.Try to disconnect the network cable from both sides, turn off the router and turn it on again after a few minutes, reconnect the network cable and try again. Eventually try to change the LAN port on the router.","Maybe there is a discrepancy in my configuration. I will post a picture below.The problem is the PC all the way in the right.So the configuration starts from the Fios box which sends an RJ45 cable to the Fios router (input). The router then outputs 2 CAT5 cables to the TV and the TV box, and also a CAT6 to my office. The CAT6 cable then is connected to an RJ45 outlet which then transmits a CAT5 to a splice. The splice then sends a CAT5 cable to my room where the PC is located through an outlet where another CAT5 cable goes directly into the ethernet port on my motherboard. This configuration seems to work if I were to try to connect a laptop where my PC is.","Hi ander9991,thank you for the picture you sent, it's very intuitive.The CAT 5 network cable you are using is not performing, you should use CAT 5e or CAT 6 network cables but all the cables you use should be of the same category.Reconnect to wi-fi and then run and maintain a Clean Boot, then re-run the ping command and verify.https:\/\/support.microsoft.com\/en-us\/help\/929135\/how-to-perform-a-clean-boot-in-windows","Hi,So just now I took the time and took my PC into my living room (where my router is) and connected it directly via CAT5 and the PC connected right away. Furthermore, I am also not having problems wireless as I am a foot away from the router. However, this PC belongs in another room and there I am having the problems still described. I will attempt to do the Clean Boot as you have stated and will look into the network configuration in my house as that seems to be the issue. ","Hi ander9991,if now the situation is the one you have just described, I would say that it is no longer necessary to perform a Clean Windows Start because the problem only concerns the wi-fi and that is the distance between the wi-fi router and the location where you usually use the PC .Probably your PC receives a weak or disturbed wi-fi signal when it is far from the wi-fi router, you must try to correct this anomaly.Try moving the wi-fi router slightly or repositioning the antennas, or try temporarily using only the 2.4 GHz network, disabling the 5 GHz one or vice versa."]},{"symptom":"MOBO Upgrade, Cloned SSD, Windows 10 Pro will not activate again.        To whom may actually read it!I upgraded my machine yesterday (01\/11\/2020) and I replaced the motherboard and CPU and cloned my old SSD over using Samsung cloning software. My question is this: what do I need to do to fix an activation error I am now getting that is telling me I am trying to run Windows on multiple PCs?I am getting one error in red which is 0xc004F211. I also have another error at the bottom under \"change product key\" that is 0x803FA067. I tried using the automated help chat and when the bot asks for my product ID and I enter it, it either wigs out and says it cannot help me or asks me to sign in. When I click sign in, it hangs and then the bot comes back with the same response and says it cannot help me. I did not link my product key to my MS account since I did not know that was a thing until today. I do not use my MS account on my computer in general except for Office, OneDrive and updating from the store. I have the original Windows 10 Pro flash drive and Product Key in hand. Are there steps (phone call?) I can take to remedy this or am I out of luck?- Jon","solutions":["Hi Jon This is reported quite a bit after a mobo change, your best option is to phone Microsoft support on a weekday, have you product key to hand and they will reactivate Windows for you . ..Choose a local Phone Number: https:\/\/support.microsoft.com\/en-us\/help\/13948\/..."]}]}