{"windows":[{"symptom":"OneDrive files not opening        I cannot open or save files to OneDrive and error code 0x80070194 is showing. Can you advise me how to fix please","solutions":["Hi Steven My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.1.Reset OneDrive Press Windows key + R Type the following then hit Enter: %localappdata%\\Microsoft\\OneDrive\\onedrive.exe \/reset Press Windows key + R again Type the following then hit Enter: %localappdata%\\Microsoft\\OneDrive\\onedrive.exe \/reset Restart then try launching and sign into OneDrive. 2. Re-install OneDrive Follow this link to re-install OneDrive https:\/\/support.office.com\/en-gb\/article\/reinst...Hope this helps.","Hello,Try signing out from OneDrive and sign-in back:https:\/\/www.kapilarya.com\/how-to-sign-out-from-onedrive-in-windows-10See if this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP. "]},{"symptom":"Replace Ubuntu 19.10 with Windows 10 on Samsung Series 7 Slate        I only have access to this tablet computer. I've had Windows 10 on it before so I know that it works, albeit slooooow because Windows is a resource hog, but I have another computer to run Linux distros on so this tablet is going to be a media computer.It ohly has one USB port, and I do not have a DVD drive for it. I have successfully installed both Windows 10 and 7 several tines on this tablet so it is very doable. My issue is that I can not find a way to make a bootable flash drive for Windows 10 from Ubuntu. The goto tool is one that's called WoeUSB, but it does work. Not just for me. All reviews for it say the same thing. So, what do I do here?","solutions":["Hi, Currently the Windows 10 ISO is only officially available through the Media Creation Tool, which is only available as an exe. On Linux you could run this with a program like Mono that can run exe binaries on ubuntu\/debian.It's recommended that you do this from a Windows PC if you have one available however. There is an unofficial work around to get an iSO from the Windows site using the mobile version of the download page will allow you to download an iSO as the Media Creation tool cannot be used on those platforms. I hope that helps."]},{"symptom":"Start, Run        I have instructions on how to fix a problem.  The first instruction is \"Click Start, Run\".  But, when I click START, there is no RUN option.  So, what do I do?","solutions":["Hey there, Walt GrayXLWelcome to the Microsoft community forums. You can press and hold start key & R together, this will bring up the run dialog box. Alternatively look in Accessories in All programs on start. Hope this helps, Regards, "]},{"symptom":"Outlook email        I have forgotton my password.How do I recover it","solutions":["Hi, To recover this you can go to https:\/\/outlook.live.com and choose the Forgot Password option on the sign in page.I hope that helps.","Hey there, TimO DonoghueWelcome to the Microsoft Community forums. If you have forgotten your password for your Microsoft Account to sign into Outlook. You will need to reset it from this page here: https:\/\/account.live.com\/ResetPassword.aspx Hope this helps, Regards, "]},{"symptom":"\" The procedure entry point LeaveCriticalSECtion could not be located in the dynamic like library api-ms-win-core-synch-|1-2-0.dll.\"        hey guys! A couple of days ago i downloaded a game on steam and as soon as i went to press the play button the game didin't start up. I opened the game files and tried to launch it from there and it gave me the following error: \"\" The procedure entry point LeaveCriticalSECtion could not be located in the dynamic like library api-ms-win-core-synch-|1-2-0.dll.\" i tried the good ol' un-install re-install but it didin't work. Also tried running the sfc \/scannow command but no corrupted files were found. Last but not least i tried to repair\/re-install all of the microsoft visual c+++ but still no luck. Any ideas on how i could solve the problem???? ","solutions":[]},{"symptom":"problem with audio on my computer        since i installed the latest windows 10 have lost my audio. keeps telling me that there is no audio output device installed. can anyone help me please. The make is Intel Education Tablet, Intel(R) Atom (TM) X5-Z8350 CPU- 1.44GHZ : AUDIO- Intel SST audio device(wmd)","solutions":["Hi My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.1. Run the audio troubleshooter The audio troubleshooter might be able to fix audio problems automatically. 1. Run the audio troubleshooter In the search box on the taskbar, type audio troubleshooter, select Fix and find problems with playing sound from the results, then select Next.Select the device you want to troubleshoot and then continue through the troubleshooter.You can also launch the troubleshooter from audio Settings. Select Start > Settings > System > Sound > Troubleshoot.2. Roll back audio driver Use shortcut keys Win + X on Windows 10. Select Device Manager. Expand the sound, video and game controllers entry. Right-click the problematic device and select Properties. Click on Driver tab. Click on Roll back driver button Choose any reason if prompted and follow prompts Restart PC 3. Uninstall audio driver Use shortcut keys Win + X on Windows 10. Select Device Manager. Expand the sound, video and game controllers entry. Right-click the problematic device and select Uninstall device. You may need to check the option Delete the driver software for this device, and then click the Uninstall button.Reboot the computer. Hope this helps."]},{"symptom":"Windows cannot recover master file table.  CHKDSK aborted.        I get this error message when I try to fix a hard drive that have not accessible problem  with CHKDSK Command anyone have a solution C:\\Windows\\system32>chkdsk H: \/FThe type of file system is NTFS.Corrupt master file table. Windows will attempt to recovermaster file table from disk.Windows cannot recover master file table.  CHKDSK aborted.","solutions":["Hi,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.The message probably means the drive has failed. You may run Seatools bootable and check the health of the drive. If it is recoverable it may attempt to correct the same.https:\/\/www.seagate.com\/files\/old-support-files...Disclaimer:This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","I think the software used for USB drives I have this problem on Hard drive which means it is NTFS And the hard drive problem is  and also if I want to give permission I can't  because of the security tab is not available ","You may try using Test disk to recover directory structure but it is a very difficult to use.https:\/\/www.cgsecurity.org\/wiki\/TestDisk_DownloadDisclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"fault in windows 7        I find a fault in windows 7.If a **** will know that fault then he will destroy windows 7 and steal important data in computer.contact me to know that fault and i request you to solve this fault.Thank You.","solutions":["Can you clarify what the fault is exactly, and then we can try to help you :)","I find a fault in windows 7.If a **** will know that fault then he will destroy windows 7 and steal important data in computer.contact me to know that fault and i request you to solve this fault.Thank You.We do not work for Microsoft and Microsoft does not look at these Windows 7 forums.Support for Windows 7 ends on the 14th Jan, 2020 and Microsoft will not be doing any further development work on Windows 7","What will you give me.If I told you a great windows 7 fault.Will you give me money?or Reward?","What will you give me.If I told you a great windows 7 fault.Will you give me money?or Reward?I will give you nothing, except a warning not to come here asking for money.","What will you give me.If I told you a great windows 7 fault.Will you give me money?or Reward?@@@@@@@@@@@@@@@@@@@@@@@To contact Microsoft:\"Microsoft office locations around the world\"https:\/\/www.microsoft.com\/en-us\/worldwide.aspx\"Global Customer Service phone numbers\"https:\/\/support.microsoft.com\/en-au\/help\/13948\/global-customer-service-phone-numbers@@@@@@@@@@@@@@@@@@@@@@@I am locking this thread as there is nothing further to add."]},{"symptom":"(Application Name).exe – Bad Image” dbgcore.dll is either not designed to run on Windows or it contains an error        Whenever I try to use Discord, Epic Games Launcher, or update anything I get the error message above. I have tried to run sfc to fix it which does not work because I get an error (Windows resource protection could not perform the requested operation).Afterwards I ran it in safe mode and got the exact same error message as before. I was told to use the chkdsk command in cmd to fix this and it didn't help at all. I have tried a system restore and upon startup I once again got the error message ((Application Name).exe – Bad Image” dbgcore.dll is either not designed to run on Windows or it contains an error). I have tried automatic repair as well and it did nothing to resolve my problem. I even gained ownership of the window32 file and deleted it and this also did nothing. I'm going mad trying to solve this issue and every article\/ post I've looked at online is unhelpful. I'd greatly appreciate if someone could help me with my problem. P.S This all started happening after Windows forced out an update","solutions":["Hi, Dr My name is Evelyn and I am an Independent Advisor. I would be happy to help you today.Follow these steps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system See here the correct way to execute the commands: https:\/\/www.yourwindowsguide.com\/2018\/08\/resolv...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Blue, black screen bootloop.        After downloading and restarting my PC to install the update, my PC ran into blue screen error and now it would stuck in the black screen bootloop. I tried to access my bios from startup to reinstall new Windows from USB drive, but unfortunately I can't access BIOS since the keyboard is not accessible at startup. Normally, my keyboard led indicator should light up on the first startup so that I could use it to enter BIOS, but a windows logo would appear, then a loading round circle and then infinite black screen bootloop.Hoping to get a reply.Else I hope this will be my byebye 2019 along with my system.Please help me out.","solutions":["Hi, loya_soraisam My name is Evelyn and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Windows. To activate the automatic repair mode, you must interrupt the normal boot process three or more consecutive times: use the reset or power button on your Windows 10 PC to stop it during startup, before you finish loading Windows 10. Yes use the power button, you may have to hold it down for at least 5 seconds to force the power off Then you proceed to repair the computer: With a restart, all your installed applications are lost, but you have the option to save your files if you wish. If there is an OEM system image, called a recovery partition, it also offers you the option to restore it. It would cause your PC to load to factory default settings. Go to the Troubleshooting section, again. Select Reset. If you choose to keep my files, your files will be preserved. You can also get the third option: restore factory settings, which is not applicable on the PC.After selecting the desired options, you will be presented with a confirmation, something like this: this indicates what you have chosen.Click Reset and the reset will begin. If after the previous steps you cannot recover Windows. You can repair Windows download the ISO: I recommend you borrow a PC to create a USB to repair Windows Microsoft Official Website to download and create Windows 10: https:\/\/www.microsoft.com\/en-us\/software-downlo...See here the correct way to recover your files when repairing Windows: https:\/\/www.backup-utility.com\/windows-10\/reins...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Remote Desktop Password Incorrect Windows 10        Hi all, I have a problem with 2 PC’s both running Win 10 Pro x64.Let’s call them Tower & Laptop.The issue is with remote desktop connections, & shared folder access.I have a peer to peer network which has been running fine for several years. Due to the imminent end of life of Win7, I have started moving over to Win10.My “office” computer is moved fine as is my wife’s.  They are both running Win 10 Pro x64. I can connect to my wife’s computer with remote desktop OK & vice versa.I have just updated my laptop and that is where the issue is.I can connect by remote desktop, from the laptop to the tower OK.I cannot connect from the tower to the laptop.They are both on the same network and IP pool, they are both visible on the network, and, I can ping one from the other, by IP address & computer name. They can both access the same network shares.I have set a share up on the local disk of each and shared with “everyone”. When I try to access the laptop share from the tower I cannot as it rejects the username &\/or password combination, just like it does in Remote Desktop.When I try and access the tower share from the laptop it will work with the truncated local user name “short username”, & my Microsoft account password.I can log into my Microsoft account online OK with the password, & it is definitely right as it is copied and pasted.It seems to be a configuration issue on the laptop, but I cannot find it.Remote connections are enabled as is sharing, both computers have the network connections set to private. As the laptop can access the tower, I have copied as many of the settings as possible, but still no joy.It seems to be a mis match in credentials or settings with regard to the user account on the laptop? However, I cannot find this.I have deleted all credentials from Credential Manager and they have been re-created automatically.I know the password is correct as I have checked by logging into my Microsoft account online with it.I have tried various combinations of username, from:“short username”, “laptop\\short username”, “laptop\\firstname.lastname”, “laptop\\*** Email address is removed for privacy ***, “MicrosoftAccount\\short username”, “MicrosoftAccount\\*** Email address is removed for privacy ***Where “short username” is the name of the local user directory, i.e. the first 5 letters of the Microsoft account name & firstname.lastname is the name used in the Microsoft account.This is not my first foray into remote desktop, and prior to wiping the laptop to install Win10 it was working fine with the tower machine remote controlling it, so it’s a software issue with Windows somewhere, I also have another Win7Prox64 machine yet to be updated & a Win10ProX64 machine which I can connect to from the tower, so the tower seems to be OK.Can anyone suggest anything to help please? Thanks in advance","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand the concern that after upgrading to Windows 10 you are unable to connect through remote desktop from the Tower to the laptop. We appreciate your effort to provide us a detail information on the issue and the troubleshooting steps performed. In this scenario, we would suggest you to create a local administrator account (don’t sign in with a Microsoft account) on the laptop and then try establishing a remote desktop connection from the tower to the laptop on the new user account. Follow the steps from the article Create a local user or administrator account in Windows 10 to create a new user account. This is to understand, whether the issue related to the user account or the network. Also, I would suggest you to post your query inTechNet forum, where we have experts and support professionals who are well equipped with the knowledge on Remote Desktop connection to assist you with the appropriate troubleshooting steps Regards,  Aditya RoyMicrosoft Community – Moderator","Hi,Thanks for the help.Created local Admin account, and connection is OK, so it seems like the log in account linked to my Microsoft account, which I would obviously like to keep and use to ensure that I can share information between the Tower & laptop machine easily.I'll put my post in the Technet forums, and update with the information about the local user account later on.If there are any other suggestions they would be very appreciated.ThanksPaul","Hi Paul, Thank you for your response and I apologize for delay in response, As we came to a conclusion that the issue is related to the user account and not the connection, which is a good progress. However, by now you might have posted the issue on our TechNet forum. We were researching on our end and we came across one thing, as you have mentioned in your last post that the local user account worked out in establishing a remote desktop connection from the tower. We would like you to perform these steps on the laptop as a temporary trial and check how it works. Login to the Microsoft user account on the laptop.Press Windows + I key to launchWindows Settings. Select Accounts option.Click on Your Info from the left pane. Click on “Sign in with a local account instead” Enter your current Microsoft Account password to authenticate and hit ‘Next’.Select a new username and password for your local account.Now login to the other local account where you were able to establish the remote desktop connection.Press Windows + I key to launchWindows Settings. Select Accounts option.Click on Your Info from the left pane. SelectSign in with a Microsoft account instead.Restart the PC and sign in to the newly converted Microsoft account and check the Remote desktop connection. If the above steps are successful then we just need to transfer the data from one user to the other user. Let us know how it goes,  Aditya RoyMicrosoft Community – Moderator","Hello,Thanks for the suggestion.OK, so, I have tried one thing related to this, so far.I logged directly into my laptop with my Microsoft credentials, then converted this to a local account as above.For simplicity I used the same account name and password as my Microsoft account, just without the @ & the stuff following it.I could then log in with this local account OK.I could also remote from the tower to the laptop using the local account.I then converted this back to a Microsoft credentials account, and it prevents me from logging in via remote desktop from the tower to the laptop again.I am going to try creating a new local account, checking the remote desktop access via this and then converting this to a Microsoft account next & I will update.I have posted on Technet, but no solution through there yet either.","Just an update, it does seem to be linked to Microsoft Account Credentials.I am working through suggestions above ad some from TechNet, but not got this working yet, as I have been away working, & I am again next week, so not much chance to try things.One thing that I did try that points to it being MS Account Credentials though.I added my Wife to a Microsoft Family, then added her to my laptop to try and connect through her account to the laptop from her desktop and it would not work.I then tried to connect to her desktop from my tower, and that would not work either, same issue as laptop, user name \/ password rejected.So that left me unable to gotower>laptoptower>desktopdesktop>laptopI then removed her account from my family and from my laptop.This then allowed me to connect tower>desktop.So it seems to be something to do with online Microsoft Account Credentials.I want to concentrate first on connecting tower>laptop first.So I am going to be a bit more structured in trying the suggestions here and try what has been suggested on TechNet also and I will report back in a week or so once I have had time to try around work.","Try to use the actual User Name when login via Remote Desktop.... It worked for me....https:\/\/www.computerhope.com\/forum\/index.php?topic=136261.0 - Simple Answer from this link","Thanks for the suggestion, I have already tried that, and just tried it again, no joy.I need to do some systematic fault finding but it's proving difficult to decide on a structure, and find the time to sit down and make the changes one by one and document the results to try and get an indication of what is going wrong!","Did you ever find an answer for this?","Sorry, no, I have also just replied to you on my other thread.","Sorry, no, I have also just replied to you on my other thread. Just before putting my fix in here. can you please tell me if you have enabled Two-Factor Authentication on the Microsoft Account that you have used with your Windows?In case you have, I believe your issue could be fixed like mine. Just head over to the Remote computer, log in with your Microsoft Account Password instead of the PIN. Then try from the other computer. Hope it will work. "]},{"symptom":"My arc touch mouse don`t working.        Hello! I have a problem with my Arc touch mouse. So i have USB that connect mouse with comuter its connected with my comuter but the mouse its not working. How i can fix it?","solutions":["Hi, it's possible either the mouse is broken or the driver is. Are you able to try the following:1) plug the mouse into another usb port on your computer2) plug it into another computerIf it works in another computer it's more than likely be a driver issue. If you plugit into the laptop, go to file explorer then right-click on 'This PC' on the left and select 'Manage Devices' then click Device manage on the left. If there is a driver issue, look under USB and you might see one with a yellow triangle next to itIf you right-click that and select delete device, then on the next screen tick the box that says 'delete drivers'. Then unplug the device and reboot then try again"]},{"symptom":"Wifi disconnects when plugged in but not on battery        I can connect my laptop to the router with a cable and there are no problems. If I use WiFi there are sometimes drops. I run the troubleshooter and that will fix it for a while. If my laptop was plugged in to battery, I can unplug it and the problem goes away. I have two laptops. One runs win10 , the other win7. Both have connection issues simultaneously, but other devices work fine (iPad, 3DS, Android phone).Things I have tried that don't helpClean Boot - Same problemNetwork Drivers\/Battery drivers - No changePower options - No change","solutions":["Hi, John My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps to repair your Internet connections: Enter the Start menu or by pressing the Win + I key combination, open the Settings and click on the Network and Internet option. Once there, we select the Status option from the menu on the left side and, within the configurations and options that are loaded in the right panel, we have to look for the restoration of the network. When you click on this option, it will show us a new window from where we can restore the network in Windows 10. In this way, all network adapters will be removed and reinstalled, and the original configuration of other network components will be restored. net. This implies that if we were using some software, such as a VPN client or virtual switches, we will have to reinstall them.A process that the system performs automatically by clicking on the Reset button that is now displayed in Network Reset in Windows 10 settings. It is normal for the process to not take long, although we must wait until the end completely and restart the computer to continue with the network configuration in Windows 10 as we have done so far.https:\/\/www.kapilarya.com\/how-to-reset-network-...https:\/\/support.microsoft.com\/en-us\/help\/10741\/...You can also check that your drivers are updated. https:\/\/support.microsoft.com\/en-us\/help\/402844...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","There was no change. I've also tried calling my ISP. They ran a test on the modem, and there was no problem on their end.","I recommend that you repair Windows completely before you must make a backup of your personal files, third-party software will be removed. Here the link to download the Windows ISO.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I've tried that. I've tried changing channel settings on the router. I've tried disabling WMM.","Hi John A. (UMSL student),are the 2 laptops and the router close or far apart?Are all devices located on the same floor as the house?Test by bringing the 2 laptops closer to the router and check if the situation improves.Specifies whether you connect to the 2.4 or 5 GHz network.https:\/\/support.microsoft.com\/en-us\/help\/4000432\/windows-10-fix-wi-fi-problems","Try to repair Windows completely","I haven't had problems since my last post. This is on an Acer Nitro 5 (515-42). In case someone else needs to know what I did, it turns out the Microsoft drivers are bad. I had to force the driver to an earlier version. I tried this even thought when I tried to normally update drivers the pop-up says \"this is the most up to date\/best driver.\"","Hi John A. (UMSL student),I'm glad you solved it!Thanks for your feedback. Return here if you need further assistance.Wish you an happy new year!","Hi John, Thank you for sharing your solution to this issue. Acer Nitro 5 are quite commons, so I'm sure it will help other users ! I guess that you found the correct driver on the manufacturer's website (Acer) ? Regards Jay"]},{"symptom":"how to ask read reciept on hotmail\/outlook\/live free account?        Not sure how I would refer to it since there has been various names changes. I have a Hotmail account (not premium) and would like to get a read receipt, but so far haven't been able to figure out how to do that. I use Windows 10 with the preloaded email app, as well as android.thank you,L","solutions":["Hi there! I'm Steve, an Independent Advisor and an Outlook.com user like you. I'm happy to help with your query.Unfortunately both the Windows 10 Mail app and the Outlook Android app don't support the option to request read receipts.In order to request a read receipt you'll need to use an email client such as the Outlook desktop client that comes with Office 365, or another third party mail client which supports read receipt requests.Please let me know if I can be of any further assistance!"]},{"symptom":"Frequent Stop code blue screen on windows 10-1909 on msi gt75 Please help        I have the BSOD error since a week ago, i did clean installation of windows 10 -1909 but it was not solved.  my laptop is msi gt 75 specs : nvidia 1080ram 32 gb2 512 gb ssd with 1 tera hddI tried troubleshooting by following: checked RAM with memtest86 software, and checked SSD, no issues found I suspect the issue is with drivers as I did not have this issue before I upgraded to the new build 1909 Below link shows the DUMP files from my systemDUMP Fileshttps:\/\/drive.google.com\/file\/d\/14XTBcb5bgUiNqf3vz4SUzD9ifmYVaaac\/view?usp=sharingPlease advise and help","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as you are getting Blue Screen of Death, even after performing a clean installation of Windows 10 1909. We appreciate your effort in troubleshooting the issue and providing us a detailed information with the dump file. We analyzed the dump file that you have provided and we found two modules that are causing this Blue Screen of Death, they are iaStorAVC.sys and clipsp.sys To address the first module that is iaStorAVC.sys, we would like you to update the Intel Rapid Storage drive. Please refer thisIntel web link to update the driver. If you still have the same issue after updating the driver, then we would like you to checkthe Intel® Driver & Support Assistant for additional help. Now, the second module that is clipsp.sys and this could be due to security software. If you have any non Microsoft security software installed on the PC, then uninstall them completely from the PC and enable Windows defender which is the default security software for Windows 10 and check if you get any Blue Screen of Death Let us know how it goes. Aditya RoyMicrosoft Community – Moderator","Thanks for your reply But when I talked with Microsoft support he told me to remove Intel drivers update and assistance and reinstall windows again. The second thing about security software always I'm using Windows defender I never use any another security software What can I do now? ","You can check Microsoft support reply Now which one of your support the right one and it will help me "]},{"symptom":"Switch users        Hi,I having a problem that when I want to switch a user,the logon user disconnect.I am using windows 10 1809 ","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,By the logged in user disconnects, do you mean that the user that you've switched user from logs off instead of keeping its current state after you switched the user?_______________ It would seem that you are 2 feature updates behind the latest version of windows 10. You may be missing some important system components that co-relates to the issue that you are having as of the moment, I'd recommend updating the system to the latest version.1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo... 2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept. 4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","Hithanks on the fast respon.I didnt want to upgrade the version of the windows,on another OU`s with the same version of windows 10,its didnt happning","Thank you for the information Danny. Have you tried switching users from the other one prior to the one you were having issues with?","Hi Yes,I tried to switch account with another user,I still having this problem","Thank you for the information Danny. Have you tried switching users from the other one prior to the one you were having issues with?I tried also to move the computer account to OU \"computers\", and the problem still happens.Maybe its some update? "]},{"symptom":"Windows 10 Update 1903 - Realtek Sound Drivers Problem        Greetings everyone,Last weekend I installed the newest big Windows 10 update 1903 and just like last time I updated my Windows 10 I again have problems with my sound drivers. Luckily the previous time I got it fixed by reinstalling the drivers via uninstalling them, rebooting my PC and updating them again. But this time this doesn't seem to help.With the newest Windows 10 Update and the newest drivers, whenever I lower the volume in an application, like in the YouTube Player in Chrome, the volume eventually picks up again to the max volume, even though the bar shows its lowered. This also happens in some of my games, where lowering the volume ingame doesn't have any effect. I already checked all the windows sound settings, configuration panel sound settings, sound devices and sound drivers. As said before, reinstalling the drivers doesn't seem to help. But when I reverted my general sound driver back to an older version, the problem was gone!My current general sound driver is the \"Realtek High Definition Audio\" version 6.0.1.8581 released on 27-nov-18. When I revert this one back to version 6.0.1.7535 released on 16-jun-15, the problem is gone. When I get back to the newest version, the problem is back. This is my PC https:\/\/support.hp.com\/nl-nl\/product\/HP-Pavilion-17-f200-Notebook-PC-series\/7486462\/model\/7940951?jumpid=reg_r1002_nlnl_s-001_title_r0001 and has BeatsAudio in it. I think there is some kind of compatibility problems with the newest Windows 10 update and my current sound drivers.With this post I would like to know if anyone else has this problem as well and if Microsoft is working on a fix for this. Or that it is just my PC and if there is a fix for it.","solutions":["Hi Dailen, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.1903 is a very recent release and there might be bugs that are still not triaged by the team. In your case, HP might know if there is a problem with the specific model audio drivers.We generally ask people to revert back to an older driver if the newer one doesn't work which is the best course of action. So if it is working, I would suggest you to stick with an older driver as it sometimes becomes a necessity.Also, are you the new driver which supposedly doesn't work from Realtek website or HP?","Hi Sumit,I am sorry, but I am not entirely sure where the newest driver is from since its the one that has been on my PC since I bought it.But thank you for the fast reply and the advice, I will use the older driver for a while then.What I would like to know though is if there will be a guaranteed fix for this planned in the near future, so that I know if I need to keep using the older one forever or not. Or should I contact HP or Realtek about this problem?Dailen","Hi, As the laptop manufacturer customizes the Audio hardware according to the needs, it is guaranteed that Realtek drivers would cause problems. Hence, there isn't a point in contacting Realtek. Audio drivers must be supplied by the PC manufacturer, HP here.You can, however, try contacting HP regarding this issue and see if they provide any insight. But still, I would go by an older driver to prevent problems,","It would be very helpful if you could remove any online content or utilities from the problem environment.  While online, there may be several volume controls involved in what you are hearing.  If one is set to a certain volume, other ones may vary to try to compensate.  But you problem may be related to Chrome and not the actual Realtek drivers.I have Beats Audio for one of my Apple Bluetooth headsets.  Since Apple controls Beats Audio, maybe there is a conflict in that area.  Can you uninstall the Beats Audio?  If you do uninstall, can you get it back later?You also appear to have a Bios update from Dec. 2018, is that installed?","Greetings everyone,Last weekend I installed the newest big Windows 10 update 1903 and just like last time I updated my Windows 10 I again have problems with my sound drivers. Luckily the previous time I got it fixed by reinstalling the drivers via uninstalling them, rebooting my PC and updating them again. But this time this doesn't seem to help.With the newest Windows 10 Update and the newest drivers, whenever I lower the volume in an application, like in the YouTube Player in Chrome, the volume eventually picks up again to the max volume, even though the bar shows its lowered. This also happens in some of my games, where lowering the volume ingame doesn't have any effect. I already checked all the windows sound settings, configuration panel sound settings, sound devices and sound drivers. As said before, reinstalling the drivers doesn't seem to help. But when I reverted my general sound driver back to an older version, the problem was gone!My current general sound driver is the \"Realtek High Definition Audio\" version 6.0.1.8581 released on 27-nov-18. When I revert this one back to version 6.0.1.7535 released on 16-jun-15, the problem is gone. When I get back to the newest version, the problem is back. This is my PC https:\/\/support.hp.com\/nl-nl\/product\/HP-Pavilion-17-f200-Notebook-PC-series\/7486462\/model\/7940951?jumpid=reg_r1002_nlnl_s-001_title_r0001 and has BeatsAudio in it. I think there is some kind of compatibility problems with the newest Windows 10 update and my current sound drivers.With this post I would like to know if anyone else has this problem as well and if Microsoft is working on a fix for this. Or that it is just my PC and if there is a fix for it.","I have actually tried reinstalling Chrome to see if it made any difference, but sadly it didnt. This problem also occurs in all the games I play.I tested this problem with my usual headset, which is the Logitech G430, and my normal philips earbuds. Still having the problem.There are three versions of the Realtek driver on my PC, where the two oldest are just normal realtek drivers and the latest one shows Beats Audio. I am able to install all three versions, so its not a real problem to get Beats Audio back.But since the time I had posted this post I have been using the realtek driver that was released on 27-nov-18, as adviced before and I am perfectly fine with how it sounds and works now, so I am not in a real rush to get my Beats Audio back necessarily.Although, thank you for the reply.","Realtek is a very common audio solution for many OEM computer brands. Realtek is usually a simple platform for delivering quality sound\/audio solutions to consumers. Below are some of the more commonsolutions to Realtek audio driver issues and installation options.Solution 1 : Realtek HD Audio Drivers Download for WindowsSolution 2 : How to Reinstall Realtek HD Audio ManagerSolution 3 : Automatically update Realtek Audio Drivers  ","Hi DalienI had the same problem and I could not find any solutions. I downloaded the latest drivers from the Realtek site (not that easily as it was not easy to find) but Window 10 \/ 1903 has a security issue with the certificates on the older drivers or some manufacturers. Suffice to say it would not allow me to install it. So I rolled back to 1809 and turned off upgrades in Windows Update. As I use my computer for work I don't dare try the upgrade again.I am running the upgrade on a VirtualBox and so far it's had various sound issues. It was crackling quite badly till now. The last update seems to have fixed it but I still do not see all my sound devices. M$ and Apple don't give a damn any more.","I spoke too soon: it is crackling again.","I am ok now that I am not the only with this problems. This issue was driving me insane. I even RMA my GPU and Motherboard. I hope MS solves the problem soon."]},{"symptom":"Choosing which drive on a PC Halo Reach (MCC) is installed on        I downloaded and installed HALO Reach (MCC) to a SSD on my PC which is now almost full (21 Gb left now) but I really wanted to install it on a secondary HDD which is almost empty. During the download and installation process from Microsoft there was no opportunity to select which drive on my PC I wanted the game to be installed on.Did I miss something? Is there an easy way transfer the game to another drive? Thanks in advance.","solutions":["Hi Gazzasal Did you download that from the Microsoft Store or some 3rd party website like Steam?if that was from the Microsoft Store: Open the Settings App (gear icon on your Start Menu) Go to Apps and find Halo in that list If you select that, is there an option to move that game to another drive? While in the Settings App, go to Home - System - Storage Click 'Change where new content is saved' From there, you should be able to re-direct all new content form the Microsoft Store to another drive . . ."]},{"symptom":"Backup and Restore (Windows7)        I tried to use the Windows Back up and Restore ( Windows 7) but I can't back up all, I just want to check how I can I have success to use the Backup and Restore (Windows7)  ?","solutions":["Hi DThomas,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Backup systems in 10 are deprecated and are not actively developed - the reason why you are seeing unexpected errors.I and Microsoft itself suggest you to switch to a 3rd party program like Reflect, a freeware offering wide variety of options.https:\/\/www.tenforums.com\/tutorials\/61026-backu...Disclaimer:This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"pc freezes and make a weird sound help!          1. So since i have factory restarted my pc,with the shift and restart thing,i deleted everything and logged in with a new account.  2.  Sometimes my pc makes weird noises and freezes for like 1 second or less and it is really annoying, it happens when gaming and literally watching youtube or twitch.  3. And now i have noticed that games are not running as they used to be    like:    Fortnite would easily go 144 fps and now it can only go 120fps and it is not a big difference but it is                Call Of Duty World War II-  would easily go 100 fps on extra and high,not discussion.  Now it sometimes freezes and makes a weird sound and i can only go high and medium and i can get like 100 fps,sometimes in cut scenes i think i got 50 fps.     so sometimes it even works slower,like running apps and opening the browser   IN CONCLUSION- My pc is slower and weaker and makes a weird noise and freezes for a second since i factory reset it.                                       and i have noticed my pc is actually noisier and i dont know why.    HELP PLEASE!!  :(((( ","solutions":["Hello Stef,Since you mentioned that the problem only started after resetting the PC, it's most likely something to do with the drivers installed, did you re-install the drivers from windows update or from the PC company website? I would recommend that you visit the PC website and get the drivers from there, specially the graphics card driver, I can help you with the links if you can tell me what is your PC brand and model,","1ดังนั้นตั้งแต่ฉันได้เริ่มต้นโรงงานเครื่องคอมพิวเตอร์ของฉันที่มีการเปลี่ยนแปลงและการรีสตาร์ทสิ่งที่ฉันลบทุกอย่างและเข้าสู่ระบบด้วยบัญชีใหม่2. บางครั้งพีซีของฉันทำให้เสียงแปลกๆและหยุดค้างเช่น1วินาทีหรือน้อยกว่าและเป็นที่น่ารำคาญจริงๆมันเกิดขึ้นเมื่อเล่นเกมและดู youtube หรือกระตุกอย่างแท้จริง3และตอนนี้ผมได้สังเกตเห็นว่าเกมจะไม่ทำงานตามที่พวกเขาเคยเป็นชอบ: Fortnite จะได้อย่างง่ายดายไป๑๔๔ fps และตอนนี้ก็สามารถไป๑๒๐fps และมันไม่ได้เป็นความแตกต่างใหญ่แต่มันก็เป็นเรียกร้องของสงครามโลกครั้งที่สอง-จะได้อย่างง่ายดายไป๑๐๐ fps ในพิเศษและสูงไม่ได้พูดคุย ตอนนี้มันบางครั้งก็ค้างและทำให้เสียงที่แปลกและฉันเท่านั้นที่สามารถไปสูงและกลางและฉันจะได้รับเช่น๑๐๐ fps บางครั้งในฉากตัดผมคิดว่าผมมี๕๐ fpsดังนั้นบางครั้งก็ยังทำงานช้าเช่นการใช้งานปพลิเคชันและการเปิดเบราว์เซอร์สรุป- เครื่องคอมพิวเตอร์ของฉันจะช้าลงและอ่อนแอกว่าและทำให้เสียงที่แปลกและค้างเป็นครั้งที่สองตั้งแต่โรงงานฉันตั้งค่าใหม่และผมสังเกตเห็นเครื่องคอมพิวเตอร์ของฉันเป็นจริง noisier และผมไม่ทราบว่าทำไม.ช่วยกรุณา!!:((((","  1. So since i have factory restarted my pc,with the shift and restart thing,i deleted everything and logged in with a new account.  2.  Sometimes my pc makes weird noises and freezes for like 1 second or less and it is really annoying, it happens when gaming and literally watching youtube or twitch.  3. And now i have noticed that games are not running as they used to be    like:    Fortnite would easily go 144 fps and now it can only go 120fps and it is not a big difference but it isเรียกร้องของสงครามโลกครั้งที่สอง-จะได้อย่างง่ายดายไป๑๐๐ fps ในพิเศษและสูงไม่ได้พูดคุย ตอนนี้มันบางครั้งก็ค้างและทำให้เสียงที่แปลกและฉันเท่านั้นที่สามารถไปสูงและกลางและฉันจะได้รับเช่น๑๐๐ fps บางครั้งในฉากตัดผมคิดว่าผมมี๕๐ fpsดังนั้นบางครั้งก็ยังทำงานช้าเช่นการใช้งานปพลิเคชันและการเปิดเบราว์เซอร์สรุป- เครื่องคอมพิวเตอร์ของฉันจะช้าลงและอ่อนแอกว่าและทำให้เสียงที่แปลกและค้างเป็นครั้งที่สองตั้งแต่โรงงานฉันตั้งค่าใหม่และผมสังเกตเห็นเครื่องคอมพิวเตอร์ของฉันเป็นจริง noisier และผมไม่ทราบว่าทำไม.ช่วยกรุณา!!:(((("]}]}