{"windows":[{"symptom":"I ran a system check in Webroot and one of the results in the software said  \"an active process has a possible memory leak in mirosoftedgeCP.exe        I ran a system check in Webroot and one of the results in the software said  \"an active process has a possible memory leak in mirosoftedgeCP.exe and how do I fix it?","solutions":["Hi Carol. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.It's not anything to worry about, just another way 3rd party anti-viruses can interject themselves and cause issues.You can read more about that Webroot warning here: https:\/\/community.webroot.com\/webroot-secureany...If you have issues with Edge I'll give you steps to repair it, but remember that in a little more than a week it's being replaced with a brand new browser built on the Chrome chassis. So that's another reason not to worry, unless you have serious issues I'll give you everything that works to fix Edge so at least something will work: Back up your Favorites first in Edge Settings > Import from another Browser > Export to a File. If you can't reach Edge you can install the tiny app Manage Edge Favorites here:http:\/\/www.emmet-gray.com\/Articles\/EdgeManage.html to do this, which also gives Edge all of the Favorites Management enjoyed in Internet Explorer.You can reset Edge in Settings > Apps > Apps and Features, scroll down to Microsoft Edge, highlight it, choose Advanced Options, then Repair, or if that fails, Reset.If that doesn't help then try re-registering the app following Option Two here: http:\/\/www.tenforums.com\/tutorials\/3175-apps-re... Edge is being rebuilt on the Chrome chassis and will be re-released soon: https:\/\/www.windowscentral.com\/faq-edge-chromiumIf you want to preview the new Edge Browser you can join the Edge Insider program and even interact with developers:https:\/\/www.microsoftedgeinsider.com\/en-us\/?for... I would have several browsers on your task bar so there's always one that's best for the task. I use Firefox, Edge and Chrome in that order of preference. It's easy to share bookmarks between all of them in their settings under Import Favorites from another Browser, and Firefox and Chrome let you sign in to save and\/or sync your Favorites on any other device you sign into. Set the preferred browser as Default in Settings > Apps > Default Apps.If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This will also bring it up to the latest version 1909 which you need anyway by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"upgrade from windows 7 to windows 10 in RAID 1        I have a Dell precision T3600 with RAID 1 configuration running Windows 7 Professional that I want to upgrade to Windows 10. My goal is to upgrade without loosing functionality. So, I have some questions.Can I upgrade to Windows 10 in the RAID 1 configuration following a simple procedure or do I have to do something different?I am not an expert, so I will need kind of a \"upgrade for dummies\" help. Pointing me to the right document will also be beneficial... Thanks for your help","solutions":["The RAID controller handles this seamlessly, Windows 10 won’t actually be aware that there are two physical drives. It does this almost in real time so there isn’t any extra steps you need to take.Regards,Ross"]},{"symptom":"Adding Admin\/Starting Services Remotely        I currently have access to Windows Server but am not local admin on any of the PCs. All pcs run the latest windows 10 and the server is Windows Server 2016.How can i start services on one of the computers on the network. I tried using “net” etc and keep getting access denied. I even started the services Server manager but they don’t start on the computers.I then go to computer management. Local Policy, Groups, and try to add my login under Administrators. It adds it but when i login on one of the computers with my login it says i am not admin. What am i missing? How do i add myself admin through windows server or at least start services on the network computers? Please help.","solutions":["You should have a user account which has been created using Active Directory on the server.When you try to login from any of the PCs joined to the domain it will lookup against the server and create a local copy of your profile on that PC automatically."]},{"symptom":"Error 0x000007d1        Since a recent Windows update, my multifunction printer can no longer print. When I try to print a test page (or anything else), I get error 0x000007d1.Printer: Brother MFC-7860DWWindows 10 Pro version 1909 build 18363.535I've tried the following, none of which worked:Reinstalling the printer with Brother driversReinstalling the printer with Windows driversConnecting the printer via USB and wirelessDrivers can be successfully installed, but the printer still refuses to print. The computer is able to see the printer.I tested the computer with another printer (HP LaserJet P1102w) and had the same error.I've tested the Brother with a Surface, which can print without problems.Can anyone suggest a fix? I would prefer not to reinstall Windows to fix this problem.","solutions":["Hi VB. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Run the Printer troubleshooter at Settings > Update & Security > Troubleshoot. Rather than spending too much more time fiddling I'd simply Clean Install the printer by removing the old drivers first - which always works, lasts longer and actually saves time:1) Power up the printer, if wired unplug it's USB cable from PC. 2) Go to Settings>Apps>Apps and Features to find and Uninstall any printer software.3) Use one of these methods to remove all of the old printer drivers: https:\/\/www.tenforums.com\/tutorials\/101274-unin...https:\/\/helpdeskgeek.com\/how-to\/remove-uninstal...4) Now type Control Panel in Start Search, open CP, choose Icon View. In Control Panel open Devices and Printers, right click printer to delete Printer and any scanner or fax of the same name. Restart PC.5) Go to the printer model’s Support Downloads webpage to download and install the latest full software package. Now is also the time to check for any newer printer firmware to install which matters a lot.6) Extract Printer software, right click Setup file to Run as Administrator. Follow the setup screens closely as you install the software. For USB it should prompt when to plug in the printer.Older software may need to be installed in Compatibility Mode to run correctly: https:\/\/www.groovypost.com\/howto\/run-old-softwa... If you have further problems reply back with results of each step. Once it's installed and you've run a test print, then scanned it to see that it opens on the desktop, open the Printer software and go into its Settings to set the scan-to file location you prefer, also the email app you want opened for Scan to Email, if applicable.I hope this helps. Feel free to ask back any questions and let us know how it goes. If you will wait to rate my post until we are done, I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I've reinstalled the printer, using the steps above. I still get the same error:Operation could not be completed (error 0x000007d1).The specified driver is invalid.Thanks for your help. What should I try next?","Did you install only the full software package for your exact Brother printer model, and is it this one:https:\/\/support.brother.com\/g\/b\/downloadlist.as... ?Do you have the latest firmware at the bottom of the downloads page?","Have you gone to Device Manager (win key + x), Printer and checked?  Also go to the top and Scan for hardware changes.","I installed the software and driver package at the top of that page: Full Driver & Software Package (Recommended). That was all I installed.I'm sure that the printer's firmware is not the most recent one. I tried to update the firmware, using the firmware update tool at that link, but it doesn't work. I get the following error:Your device is currently busy with another job.Make sure your machine is in idle status.I tried to clear the print queue (which shouldn't have anything in it, anyway), but I'm not sure that I did it right.","Any chance the model is not exactly the same? Is it still within a year of purchase so you could get Brother Support to guide you on installing the firmware and troubleshooting their driver?I see that it has drivers going back to Windows 2000 so I'm guessing it's losing compatibility. Strange that it works with Surface though. Can you try installing software in Compatibility Mode:https:\/\/www.groovypost.com\/howto\/run-old-softwa...https:\/\/social.technet.microsoft.com\/Forums\/win...I'd also go through all of the printer Manual, FAQ's and Troubleshooting as Brother is pretty good about documenting known issues and keeping everything updated on the Downloads and Support pages.Also, did you uninstall the printer in Settings > Apps > Apps & Features, and also in Settings > Devices > Printers & Scanners > Brother Printer > Remove Device, then restart PC, proceed to remove all printer drivers as shown?","The model is exactly the same. The model number MFC-7860DW is from the front of the printer. I've had the printer for a few years, so I'm sure it's out of warranty. I checked the FAQ and manual for this model at Brother's site, and they didn't have anything that you hadn't already suggested. Here's something interesting: I went to Printer Properties, clicked on the Advanced tab, and switched the printer from \"Spool print documents\" to \"Print directly to the printer.\" I tried printing a test page and got a new error: Operation could not be completed (error 0x00000bbb).Unable to create a print job.Does that help? I haven't tried installing in compatibility mode. Brother's website says that the install package I used supports Windows 10. Keep in mind that since this printer stopped working in about September, I can't install any printer on my computer. The printer works fine, as long as I use it with another computer. That's why I suspect the problem is with Windows on my computer. Also keep in mind that this printer was working fine with my computer for years until one day it didn't.","VB - I understand. It's also so rare that clean installing a printer doesn't work I also believe that it probably is something more general in the install, perhaps caused by Windows Update or a Version Update?Did you happen to notice if it stopped working after a Version Update? If so there is a 10 day period during which you can roll back without having to reinstall the older version.If this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Update History, then uninstall them from the link there, and immediately check for these again and hide with the Hide Updates tool explained here: https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... You can also use System Restore from within Windows to get back before the problem began, then check for Updates with the Hide Update tool and hide them:https:\/\/www.windowscentral.com\/how-use-system-r... If neither of those then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... Keep me posted on your progress as I will be here to help until the case is resolved.","Okay, my printer works now. Here's exactly what I did:I updated my BIOS, which was hilariously out-of-date. For the record, I don't think that's what fixed the problem.Then:1. I did a Windows repair install, using the tool you mentioned in your previous post. I kept all apps and files.2. When it was done, I redownloaded and reinstalled the brother software and drivers package. This is same version I used before. It's the most current one for my printer.3. When I tried to print a test page, I got a different error. Windows popped up a notification in the bottom right-hand corner that there was an error and it couldn't print. I opened the print queue, and canceled the print job, but that didn't help.The next steps I think were the key:4. I removed the Brother software via Apps & Features in Settings.5. I restarted the computer.5. I opened Print Management. Under Print Servers\/[User]\/Printers, I deleted the Brother MFC-7860DW. Under Print Servers\/[User]\/Drivers, I deleted the MFC-7860DW drivers. The drivers reappeared after a second or two, and I deleted them again. That seemed to do the trick.6. I removed the printer via Printers & Scanners in Settings.7. I restarted the computer.8. I reinstalled the Brother software. I made sure that the box for Status Monitor was ticked.And then my printer worked again. I can print test pages and from Word. My scanner even works.Thanks for the help, Greg. I couldn't have done it without you.","Nice work persisting in a true clean install of the printer software! Let me know if there's anything else. Also when ready please mark the post which helped most as the Answer, to help others. A rating is also appreciated."]},{"symptom":"BSOD after updating to 1909 build        Hi All,I recently  updated my OS to 1909 build, after that I constantly get BSOD several times per day. Below you can see the link with the dumps and msinfo file. Hope this will be helpful for further troubleshooting of this issue as I'm not the only affected user.https:\/\/fittusofia-my.sharepoint.com\/:u:\/g\/personal\/81213021_fit_tu-sofia_bg\/Eey29iyK9_ZHqYYuRSqKyusBrjgcMenPDBEWIWSGv8ygSQ?e=0mhqEpBest Regards,Todor Shuev ","solutions":["Hello Turdo, I am Andrew an independent advisor. So sorry to hear the recent update is causing you issues. If you like you can uninstall the update. This can be done by going in to Settings>Update & Security. Uninstall the recent update, if the problem persists let me know, we can do more troubleshooting. Take Care, Andrew"]},{"symptom":"Windows update- Error 0x800700c1        I am trying to update Windows 10 and keep getting Error 0x800700c1 and it says \"Your device is missing important security and quality fixes.\"","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command promptDISM \/Online \/Cleanup-Image \/RestoreHealthRun these commands on the command prompt to restart windows update servicesnet stop bitsnet stop cryptsvcnet stop wuauservnet stop msiserverRen C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.old net start bitsnet start cryptsvcnet start wuauservnet start msiserverAfter successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartThis should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","Uninstalled Windows programs will not open Windows Will not be uninstalled or connected"]},{"symptom":"Asus noteboook will not boot        4-5 year old asus notebook will not boot. error coode on blue screen is 0xc000021a. will not load into windows. worked fine when last used 6 months ago. can access bios boot cannot find start in safe mode function. thoughts on repair method? Also I do not have an install cd or drive came pre installed on device.","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,I would recommend going into the windows recovery environment to use access multiple troubleshooting options.Start your computer, once the computer goes to the windows logo screen press and hold the power button for 5-10 seconds to shut it down completely. Do this for 3-5 times to force access the recovery environment.a) Startup repair Go to troubleshoot, advanced options, startup repair (This would attempt to repair the system)b) System Restore Go to Troubleshoot, advanced option, system restore (This would roll back the system's configuration to a specific time and date)c) Safe mode Go to Troubleshoot, advanced option, startup setting, click on restart and this would provide you multiple options in terms of booting up the computer.Choose to boot into safe mode, once accessed you could either uninstall the update or check if all your drivers are up to date. A clean boot under safe mode would also help to make sure no softwares are affecting the system1. Go to start menu\/search msconfig 2. On the system configuration window go to the services tab 3. Tick on hide all microsoft service so that this won't be affected 4. Choose to disable all services 5. Next, go to the startup tab and on the window choose to open task manager 6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok 8. A prompt to restart the computer will show up, choose to restart d) Reset this PC In the event that it still fails, I would recommend reinstalling the operating system. The option enables you to keep your files although uninstall programs that did not came with the system.Troubleshoot - Advanced Option - Reset this PC Alternative to reinstalling windows https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/support.microsoft.com\/en-in\/help\/400073...Let me know how it goes. :)"]},{"symptom":"Download Ownership        Whenever I open File Explorer and click downloads, it says \"C:\\users\\username\\Downloads is unavailable.\" I think this is because I don't use the user it names when the error shows. Which means I don't have ownership of the Downloads section of File Explorer.Any help is amazing, Thanks.","solutions":["You can only download to the Download folder in your account, i.e.:C:\\Users\\your user account\\DownloadsThis is easy to fix: Open the web browser you are using and go through its settings until you find the setting which tells the browser which folder the browser should use for downloading. Simply change what's there to your own Download folder. Ta da!"]},{"symptom":"I need to configure the start up apps Their all over the screen. Please reply someone        I pressed something and all the app icons are all over the windows screen.","solutions":["Hi MichaelEser you may be in tablet mode (if so, there will be an arrow by the windows icon) open the action centre (winkey+A) click the tablet mode button to turn it off. if the tablet mode is not visible click \"expand\" then the tablet mode button. if this is not the issue could you provide a screenshot so that we can better identify the issue.","The screen shot would be great Thank you for the reply.","Are you saying that the Windows shortcuts on your desktop have been moved around, by Windows?.One cause for that is changing screen resolution. .There is no way to undo it. You have to redo them manually. Then you need to get a 3rd party application that manages desktop shortcuts for you.  The best one I've used is Stardock Fences. It costs US$10 alone or comes as part of a bundle. There are also free options. The one I'm currently using is called 'ICU' . It allows you to take snapshots of the desktop, then use them to restore the desktop after MS messes it up..Insert Picture - How to Insert Images in the Forum - Examples of Screen Capture Tools to create imageshttps:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_other-winapps\/how-to-insert-images-in-the-forum-examples-of\/884b48bc-a1c7-472f-9574-6274aa035011 (Rohn007)Unfortunately your screen capture did not come through. Although you could see it after pasting, when you saved the question \/ reply the image was lost, sent to the ‘bit bucket’. Apparently the MS programmers working on this site don’t know how to save pasted images. Instead we have to follow an obscure, ancient, roundabout process described in the link above. ","Sorry for the slow response. i actually meant for you to send a screen shot so that i could see what you see, i have included a screenshot of what i think you might have.","no but the tiles are strewn. no arrow i just manually try to puzzle them together. any other help?","is it the start menu tiles or the desktop icons? right click on an empty part (where you just see the background) if you see a menu, select View then auto arrange icons if that helps open that menu again and select align to grid"]},{"symptom":"Taskbar - InPrivate Browsing Not Working        Hi folks,Having a bit of a strange issue with Windows 10 Taskbar Jump Lists. I have Internet Explorer\/Firefox pinned to the taskbar. If I right click on the icon and select \"Start InPrivate Browsing\" (in IE) or \"New private window\" in Firefox, I get the error \"The item you selected is unavailable. It might have been moved, renamed, or removed. Do you want to remove it from the list?\", and then the only option to select is \"Cancel\". InPrivate browsing does work for both however, as I can open Internet Explorer and go to the gear in the top right, then Safety, then \"Open InPrivate Browsing\", it opens and works great. So just looks to be the taskbar jump list option not working (I have tried un-pinning\/re-pinning the taskbar icon - no luck).PC - Lenovo ThinkPad X1 Carbon (2nd Gen)Windows 10 Version 1909 (Created bootable USB from Microsoft site ISO and formatted SSD and did clean install of OS. Has only been a few weeks since install, but more than likely has had some updates in that period.Only a handful of free\/paid programs installed (Kaspersky Anti-Virus, MalwareFox AntiMalware, AdGuard, Office 2019, VLC, Adobe Reader DC, UTorrent, VirtualBox, Teamviewer).Any thoughts on what could be causing this?Thanks!","solutions":["Hi Wzrd. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Sounds like a dead link. I'd right click taskbar shortcut to Unpin. Then open a fresh instance of Firefox, right click the new Firefox icon to Pin to Taskbar. Now check if New Private Window works.I just tested and mine does work to right click for New Private Window in latest Firefox.If not, then refresh Firefox: https:\/\/www.thewindowsclub.com\/refresh-firefox-...If that's not enough Uninstall Firefox in Settings > Apps > Apps & Features, restart PC, reinstall Firefox from fresh download:https:\/\/www.mozilla.org\/en-US\/firefox\/new\/BTW I would run built-in Defender which always offers best Windows performance with least issues, and is from Microsoft who knows how to protect their OS best. We see nothing but problems here with 3rd party AV's.I would also use the undisputed best free on-demand scanner Malwarebyes from https:\/\/www.malwarebytes.com\/mwb-download\/. After installing turn off the free trial in MB Account Settings. You do NOT want two anti-virus\/malware suites conflicting.Using torrents I would scan every download with MB and scan with it often. I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Greg,I thought it may have been a dead link as well, but un-pinning\/re-pinning from a fresh app instance still gives the same results. I can definitely try a re-install of Firefox no problem and report back, but I don't feel that will fix the issue as it is also occurring with Internet Explorer.Also just tried the same with Microsoft Edge pinned, right-clicking and selecting \"New InPrivate window\" and it works.. What an odd issue. ~","Try Refreshing Firefox then if necessary reinstall. Have you modded Windows or used optimizers or cleaners that can cause strange issues like this? Are you using only Defender?","I tried refreshing Firefox, that didn't help. Then went ahead and uninstalled Firefox, restarted, and installed the latest version from Mozilla. Still the same issue, see screenshot;No, I have not modded Windows in any way, and have never used any cleaners\/optimizer besides Windows Disk Cleanup.I use Kaspersky Anti-Virus and MalwareFox AntiMalware, but this issue was present before those were installed.","Hi WZRD8KD and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.Have you tried basic troubleshooting using SFC and DISM? You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"Internal hard drive can't be selected to create a system image on.        So currently I am trying to create a system image of my PC on a hard drive. When I go to select my HDD (D:) as the location for backup, the options were only my SSD (E:), and after looking through some answers online I tried to reformat my hard drive which again still wouldn't let me put my system image on. Currently, the OS for the PC sits on a second SSD (C:), and so I plugged in an external USB (G:) to see if I could backup to that and when I went to select what drive to backup, I can see that the HDD (D:) is somehow associated with the system, which shouldn't be the case as I have completely formatted it. Currently sitting on the HDD (D:) is some shadowplay footage and some steam games, other than that nothing else sits on it. I was just wondering if there was someway to make the HDD (D:) not associated with the system anymore so I can store my backup inside it. Thank you for taking the time to have a look through my enquiries. ","solutions":["Yes, indeed it isn't associated with the system. At this time I can only suggest you to use a 3rd party Software to backup. Your error might be due to a bug in System Image as the backup utilities are not being actively developed in Windows."]},{"symptom":"Can I zoom a photo within a frame?        I have Mac device where I use PowerPoint. There is a feature to zoom in within a frame there. Is there a similar option in Windows 10? For example, when making a slide show, I need just to drag and drop a photo in the frame and then adjust it withoutmoving the frames","solutions":["Hi Oleg, I hope this message finds you well. My name is Steven and I'm an independent advisor.This feature is not available in PowerPoint on Windows. I suggest you create a layout with picture placeholders rather than Content. I also suggest you use the Crop Tool to have more scope for zooming.____ Steven"]},{"symptom":"Factory Reset Gone Wrong        I am having a problem with my computer. I did a factory reset because it was slow and my disk was always high so when I did i fell asleep because i knew it was going to take a little while. When i wake up my computer was turned off and when i turn it on, All i see is the logo of the computer which is Lenovo and a spinning circle thing at the bottom. It keeps saying restarting and does it over and over again. What should i do?","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,3 hours would be the advisable allotted time to wait for a process to progress. How long have you waited for the lenovo logo screen to progress? If it has been several hours already, I'd suggest turning off the computer and see if it would would up properly. If not, I'd recommend accessing the windows recovery screen to perform a reset there to make sure that there are no third party services causing the feature to malfunction. You may turn off the computer completely by holding the power button until it shuts off. You may force access the screen by, Start your computer, once the computer goes to the windows logo screen press and hold the power button for 5-10 seconds to shut it down completely. Do this for 3-5 times to force access the recovery environment.Navigate to, Troubleshoot - Advanced Option - Reset this PC Alternatives to reinstalling windows 10 https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/support.microsoft.com\/en-in\/help\/400073...Let me know how it goes. :)","I gave it 3 hours because i did not now how long it has been loading. It did not work so i did the second option which finally worked! I am internally gratefully!","My pleasure! Happy to hear that everything is sorted out. When ready please mark the post which helped most as the Answer, to help others. A rating is also appreciated. :)"]},{"symptom":"Office product key, Microsoft HUP        I used to have working account created through Microsoft HUP. But it was removed. I want to find my Office 2016 product key but don’t know how I can do this","solutions":["kan niet starten van Canon printer","kan niet starten van Canon printer","Hi fulminant, I hope this message finds you well. My name is Steven and I'm an independent advisor.Microsoft Home Use Program is a partnership between Microsoft and your employer that grants you a discount on Office 365 Home or Personal. If you need to get your order history and a product key, I suggest that you get in touch with your employer or organization that contracted Microsoft. ____ Steven"]},{"symptom":"how do I merge two microsoft accounts        When setting up my new computer i was unable to log in to my microsoft account. I created a new account with my phone number, but as soon as I logged in it wanted an e-mail, but would not accept my e-mail because it was used on the old account. Can I merge the two accounts?","solutions":["Hi Cecile. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.It sounds like you were unable to add the MS Account when you were setting up Windows. At that point you should have disconnected from the internet which forces it to set up a Local Account, which you can then later convert to your MS Account.I understand you created a new MS account instead using your phone number. It will now not be possible to merge the two because both are being used already for a MS account, and to add an alias to either would need to be a new email or phone number that's not been used as a MS account, then it can be set as Primary. It's also not possible to merge the two due to policies we are trying to get changed but are kept for security reasons.So what I would do is confirm if you can sign in now online to your original MS Account (if that's the one you want to keep) athttps:\/\/login.live.com\/. If not then recover your password or account here:https:\/\/support.microsoft.com\/en-us\/help\/12429\/... Once you know you can sign into the intended MS Account, change the temporary account you created with the phone number to the intended MS Account. To do this go into Settings > Accounts > Your info and select Sign in with a Local Account instead. Restart PC.Then go back to the same place where the link will now read Sign in with a MS Account instead so you can link your MS Account properly this time now that you know it's working or recovered.Then I would close the phone number account so you can reclaim the number to add as authentication on your email-based MS Account. To close the account go here:https:\/\/www.howtogeek.com\/227763\/how-to-complet... It should tell you how long you will need to wait to add it to your MS Account as a Security backup here:https:\/\/support.microsoft.com\/en-us\/help\/12428\/...This is used in case you lose access to your MS Account or need to recover password. Until that phone number is available, I'd at least add a secondary email address in the same place, or another phone number you have voice or text access to.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Rotation in PowerPoint        During the presentation, I watch the rotation. I use an old Aser netbook","solutions":["Hi Jerzy, I hope this message finds you well. My name is Steven and I'm an independent advisor.Follow the instructions here Click on File, then go to Options. Locate and click on Advanced Disable Graphics Acceleration in two places. ____ Steven"]},{"symptom":"Printer keeps printing documents in an inverted color scheme        Yeah so I have no clue why but when I tried printing some documents on my Brother HL-L2340D Laser Jet printer, it kept printing my documents in an inverted color scheme (black background with white text). This weird thing is, when I use the printer on other devices (A laptop running Windows 7, another laptop running Windows 10, and an iPad), it prints documents just fine. I also checked another printer that I have, and it printed just fine on there.I have no clue why that printer just does not like my laptop, as I have both uninstalled and reinstalled the printer, and nothing has fixed it.If you know what is going on with it, thanks in advance.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern, as you are getting print with the inverted color scheme. . In order to get clarity and to assist you accordingly, please reply with the answers to the questions below. What is the Windows 10 version and Build installed? (Typewinver in Windows search\/Run command)Does the color invert while printing from all applications or any specific application?Were there any changes made to the system prior to this issue? Meanwhile, we would suggest you to perform these steps and check.Go to Printer Properties and click on Advanced tab.Click on Printing Defaults tab from the bottom.Click on Advanced tab and click on Other Print Options.Click on Print Text in Black and check the box beside Print Text in Black.Click on OK on all the three windows. If you still face issues, use the uninstall tool from Brother Website and then re-install the drivers from Windows and check. If issue persists, update the driver from Brother Website: https:\/\/support.brother.com\/g\/b\/downloadlist.aspx?c=us&lang=en&prod=hll2320d_us_as&os=10013 Run Printer Troubleshooter: https:\/\/support.microsoft.com\/en-us\/help\/4015401\/windows-10-fix-printer-problems Regards, Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"windows 10 cannot update.        I have a new Samsung 550XTA\/XTZ laptop it gives me the dots in motion but cannot find an update to lock on to, I had the tech look into my computer it took him along time but he fixed it only to go back to doing the same thing again. My desk top is using ethernet from the same service provider as my wireless laptop the pc update works but the laptop doesn't there closed now I was wondering if any of you might know this problem or have been though it ! Thanks","solutions":["Yes for sure you can reach out on the community, feel free to leave feedback if this all worked.Have a great day!"]},{"symptom":"QueryPerformanceFrequency (QPC) is 10 mhz since windows 10 1809.        It's locked on 10mhz instead of ~3mhz like it used to be on 1803 and below, it's harmful for mouse responsiveness especially in esport games titles.","solutions":["Hi Straszy. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.There is more about this possible bug here: https:\/\/www.overclockers.at\/number-crunching\/th...https:\/\/social.msdn.microsoft.com\/Forums\/en-US\/...https:\/\/news.ycombinator.com\/item?id=18647287https:\/\/docs.microsoft.com\/en-us\/windows\/win32\/...https:\/\/twitter.com\/brucedawson0xb\/status\/11244...If you want to report this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems.If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it. If you are an Insider I can also vote it up with my MVP badge and track the issue for you.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"battery        message 'battery low you might want to plug in your charger' does not appear anymore. Lap top shuts down with no alert. ","solutions":["Hi baconlemon, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.I recommend consulting the instructions on this website of the Windows MVP, where it handles the issue related to problems with the battery charge on your computer.https:\/\/www.groovypost.com\/howto\/troubleshoot-b...Additionally, check the life of your battery, this article will show you how to do it.https:\/\/www.howtogeek.com\/172271\/how-to-calibra...Let me know if you have something else that I can help you with, I'd be happy to help.Happy nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]}]}