{"windows":[{"symptom":"UNABLE TO CONNECT MINECRAFT        Ever since the new update in minecraft I have been unable to connect to the world. Me and my friend both have ps4 and cannot connect we have tried for days and both have open nat type I'm really close to deleting the game and not playing it anymore. ","solutions":["Hey Jessie, Evan here an independent adviser here to assist you. https:\/\/downdetector.ca\/status\/minecraft\/Based on what I discovered on this website it looks like MInecraft's servers are down for quite a few people at the moment. Looks like something is wrong with the latest update or servers atm.This is not an answer to your question as when servers are down there's really not much you can do. Please use the interactive map to see if your area is currently affected."]},{"symptom":"new surface pro 7 startup is not working        brand new surface pro says \"something went wrong\" when trying to start up and select English","solutions":["Hello Anne, Evan here an Independent Adviser here to help. A brand new PC should not have any issues such as this. Are you able to possible connect this new laptop directly to your modem\/internet? If not this sounds like the unit is not working out of box. You should have this unit exchanged as a return\/refund."]},{"symptom":"Spec query - Upgrading from Windows 7 to Windows 10 on existing laptop        I have a Lenovo ThinkPad X1 Carbon laptop, it's probably around 5 years old now, and is running Windows 7 Pro Service pack 1.  I really like the laptop so don't want to buy a new one unless i really need to. I use the laptop for regular tasks, including using Windows Office programs, internet and email, very occasionally use for streaming tv\/video.  I don't play games so don't need gaming levels of performance.   The spec Microsoft suggests is the minimum required to run Windows 10 seems to be fine for my current laptop (see below for my Lenovo's spec) apart from the Graphics.   My questions are:  Will my current laptop run Windows 10 adequately for the tasks above. Do i need to install a new graphics card?  Finally, I don't want to purchase Windows 10 only to find it doesn't work. Is there such a thing as a trial installation?  Sorry, I've never had to upgrade an OS myself before.ProcessorIntel(R) Core(TM) i5-3427U CPU @ 1.80GHz6.95.5  Determined by lowest subscoreMemory (RAM)8.00 GB7.3GraphicsIntel(R) HD Graphics 40005.5Gaming graphics1696 MB Total available graphics memory6.4Primary hard disk43GB Free (215GB Total)7.9Windows 7 Professional System   ManufacturerLENOVO Model34602SG Total amount of system memory8.00 GB RAM System type64-bit operating system Number of processor cores2 Storage   Total size of hard disk(s)229 GB Disk partition (C:)43 GB Free (215 GB Total) Disk partition (Q:)3 GB Free (14 GB Total) Graphics   Display adapter typeIntel(R) HD Graphics 4000 Total available graphics memory1696 MB       Dedicated graphics memory64 MB       Dedicated system memory0 MB       Shared system memory1632 MB Display adapter driver version10.18.10.4425 Primary monitor resolution1600x900 DirectX versionDirectX 10 Network   Network AdapterIntel(R) Centrino(R) Advanced-N 6205S Network AdapterMicrosoft Virtual WiFi Miniport Adapter Network AdapterMicrosoft Virtual WiFi Miniport Adapter Network AdapterBluetooth Device (Personal Area Network) Network AdapterPhantom TAP-Windows Adapter V9 Notes  ","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Your specs look good for a Windows 10 upgrade - and you have enough free space (you need minimum of 20GB space if I recall correctly).Also - hang on before buying Windows 10, you might not need to! The best way to begin is to visithttps:\/\/www.microsoft.com\/en-gb\/software-downlo... and click the \"Upgrade Now\" button... if you download and run the installer this will start the Windows 10 upgrader.The installer will examine your system before attempting the upgrade and if it finds any problems will tell you about them first.In addition to that even if you do the upgrade and don't like it or have an issue, you have 10 days within which time you can undo it all and go back to Windows 7 anyway (https:\/\/support.microsoft.com\/en-gb\/help\/402793...)Although the free upgrade offer has long since past I find that the installer tool I have mentioned will usually just accept and upgrade you to an activated version of Windows 10. Even if it doesn't you can complete the upgrade anyway and you'll have plenty time to acquire a Windows 10 Pro license (the system will initially run just fine but will warn you are not activated), or in case of problems you can revert back to Windows 7 within 10 days anyway.Regards, David","If you are trying to upgrade from Win 7 Pro, there may be a specific situation with it.  If you look in the C:\\$Windows.~BT\\Sources\\Panther folder you may find asetuperr.log.  There are others but you can probably copy and paste the setuperr.log in your response.  We may be able to tell from that what is happening.  If not, we may need other logs like the setupact.log and setupapi.dev.log in the Rollback folder..Some of the logs are large so you will need to zip and make them available on OneDrive or some other files sharing site.","Thanks David, that's very helpful.   You didn't mention it in your response, but I'm still not sure if my graphics card is compatible.  It's Intel R HD Graphics 4000.  I did a search on this site and seems there may be some incompatibility with Windows 10.  I'm not that tech-savvy, but could it be I would just need to install different, more updated graphics?","Hi Saltgrass.  Sorry but I don't understand what you mean.  Are you saying my spec is incompatible with Windows 10?  I am not tech savvy so don't know how to access the logs you are talking about. ","Intel do appear to have Windows 10 drivers for it: https:\/\/downloadcenter.intel.com\/product\/81499\/... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I would expect that Windows will sort that out itself though and you won't need to install them manually. However as I mentioned - if there's a big problem you can always undo completely and go back to where you started - so it's well worth a shot.","If you haven't actually tried to install, then you don't yet have a problem.Win 10 upgrades may fail for several reasons but if you system is only 5 years old, it should be fine.You can always do a trial install if you have a new or out of use hard drive..  Remove the original and download the Win 10 install media with the Media Creation Tool you can search for.If you do the upgrade and it fails, then my first post will become relevant.  Making an image of your current install is always a good idea before starting the upgrade attempt."]},{"symptom":"not being reconized as adminstrator        When I try to delete this program it tells me this.folder access deniedyou need permission to perform this actionyou require permission from DESKTOP - S65GENT\\rpowe to make changes to this folderI am the sole user of this computer and am the administrator.How do I remove this program?","solutions":["Try changing the permissions of the folder, by right clicking, going to Properties -> Security -> Edit...","Hello RPowell327, Go to Control Panel > User Accounts > Change your account type. Select Administrator and click on Change account type button.You can take ownership of a specific folder too. Right click on the folder and selectProperties from the bottom.  Go to Security tab. Click onEdit under Group or User names.  Select the administrator from Group or user names box. Check the boxes forAllow in the Permission section. Finally, Apply.","Hello RPowell! Happy New Year first of all. My name is Evan an independent adviser here to assist you. Could you please let me know what program you are uninstalling? I highly suggest performing the uninstall from add\/remove programs if possible.Otherwise you must right click the folder go to Properties>>Security then adjust your permissions to that specific folder to allow you to delete it. Please do not delete anything within the Windows folder itself without 100% certainty you're not deleting something integral to your system's operation. Please let me know if this helps!"]},{"symptom":"Windows 10 Sleep settings ignored, goes to sleep after two minutes        I am having the same problem with Windows 10 workstation at work, as many others I have seen here: No matter what I adjust in power and advanced power settings, the screen turns off and computer goes to sleep, forcing me to log in, after appx 2 minutes.  Note I have found that the moment the screen goes dark it can be relit if I press a key very soon after. But within a few seconds it's fully asleep None of the fixes I have seen here has done the job for me, but one in particular that I had high hopes for involved going into the registry and editing a \"attribute\". Here is the fix copy\/pasted from a thread in 2016:HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Power\\PowerSettings\\238C9FA8-0AAD-41ED-83F4-97BE242C8F20\\7bc4a2f9-d8fc-4469-b07b-33eb785aaca0At the location there is a DWORD named \"Attributes\". Modify the value of \"Attributes\" from 1 to 2. A value of 2 will make \"System unattended sleep timeout\" appear in the advanced power settings under \"sleep.\" Notice the default value is 2 minutes for both battery and plugged in.(Screenshot wouldn't paste here)Change the values to whatever you want them set to. I made mine match the \"Sleep after\" settings. Some people have reported that the settings will return to the defaults (2 minutes) occasionally. I have not experienced that yet but I will update this post if it does. I suspect they may have changed the power plan and forgot to change the defaults. Your changes will not carry across plans.Basically what is happening is your PC is being woke up in an unattended state so it defaults to the \"System unattended sleep timeout\" settings instead of the \"Sleep after\" settings. An unattended state is usually when the PC wakes of to do a task like Windows Updates or a wake on LAN (WoL) event. I'm not sure why the \"System unattended sleep timeout\" setting is used when I wake the PC with mouse movement, but the steps above seem to have solved my issue.Everything goes fine until I attempt to edit \"Attributes\" from 1 to 2. I click Enter and an error message appears, \"Cannot edit attributes\" and \"Error writing the value's new contents.\"This is killing me. Our IT person, not the greatest to deal with and he installed 10 which is when this started happening. Could it be I don't have the proper permissions to perform this task? I am in Internet sales, I am on the computer all frickin day and it is costing me money and my sanityAnyone have the real fix? My home computer doesn't do this","solutions":["Hello infinitiman, I am Andrew an independent advisor. As this is a workstation it is possible the sleep rule is implemented by the company server and not Windows, therefore cannot be changed locally. It is a security measure incase users forget to log out when getting up for short periods of time leaving the system open. You may have to get your system administrator to change these settings for you."]},{"symptom":"AOL emails listed alphabetically by sender        Hi Yesterday I when I went to AOL Mail, my computer listed the alphabetically by sender.Today it is back to listing them by date and time.How do I get back to the alphabetical mode?","solutions":["Hi James. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.If you get your AOL Mail in a browser then you can click on the column headings to sort alphabetically by Sender, or by Subject, or chronologically by Date. Once you exit the AOL website it will return to the default sort by date.I hope this helps."]},{"symptom":"How to replace Bing in Windows 10 search on the taskbar 2020        I actually followed steps one through five from another post I came across in the Microsoft Community and when I got to step five I was brought to a halt. I'm actually unable to \"Set as default\" or \"Remove\". It's as is the setting is locked. I want to change it to Google, but the setting is locked. Although on the address bar is show's it's set for chrome, it opens chrome and searches through BING. It's not a Chrome issue either, I've already checked Chrome settings. Would somebody help me out. I'm posting pictures with this post.","solutions":["Hi just, there are two different items in your question 1) the bad news first, you cannot change the search engine used in the taskbar search. what ever changes you make in the browser does not affect the taskbar search, it will continue to use bing.2) the instruction in your screenshot are for changing the address bar search in edge. (and are a little out of date)open edge and navigate to www.google.com click on the ellipsis (...) and select settings click on advanced under address bar search, click change search provider click on google search (discovered) click the set as default button please let me know if you still have a problem with it"]},{"symptom":"Getting error 0x80070005 - 0x2000A installation failed in the SAFE_OS phase with error during PREPARE_FIRST_BOOT Operation when trying to upgrade from Win 10 1809 to 1909        Hello, I just bought a brand new gaming PC for my son and tried to install Xbox Game Pass app so we can play some games together. The app is requiring that I update to Windows 10 1909 before it will install. The current version installed on the PC is 1809 (Build 17763.914). First off when I go to Windows Update there is no option available to update to 1909. So I tried manually with the Windows 10 Update Assistant. This failed and would not update. Second attempt I used the MediaCreationTool1909 and made an ISO, mounted that and tried the update again. This failed as well.Third attempt, after some googling l did the following: net stop wuauservnet stop cryptSvcnet stop bitsnet stop msiserverren C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldren C:\\Windows\\System32\\catroot2 Catroot2.oldWhen I run net stop cryptSvc I get:A system error 1051. A stop control has been sent to a service that other running services are dependent on.When I run the ren commands I get ACCESS DENIED, I am running as admin. After all this I also tried to manually update again using the ISO with internet disconnected. This also failed.The update\/install is always failing at 30% and it gives me the message \"undoing changes made to your computer...\" When I log back in I get the a window that says we couldn't install Windows 10 and it gives me the following message. 0x80070005 - 0x200AThe installation failed in the SAFE_OS phase with an error during PREPARE_FIRST_BOOT operation. Any assistance would be greatly appreciated. Its a real big let down that my son cannot play any games on his new gaming pc using the Xbox Game Pass subscription that we are paying a lot of money for. ","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Sorry you are having trouble getting updated to version 1909 - I think as the computer is brand new the easiest option might be to completely reinstall using a USB install media since I assume you won't have setup much else on it so far.The media creation tool will allow you to make a bootable USB drive install image. You can then boot the computer from that and just completely reinstall Windows from scratch. This will probably be the quickest way to resolve the problem rather than any further troubleshooting the existing install. It sounds like you already have the media creation tool, but just to be sure the official site is here:https:\/\/www.microsoft.com\/en-gb\/software-downlo... Once you've made the USB media, restart the PC whilst holding down the SHIFT key - this will get you in to the recovery options, from there choose that you want to start the computer from a device, and pick your USB drive... the computer should restart and begin Windows 10 set-up. Carry on with a \"Custom\" install type and let it reinstall Windows fresh.Regards, David"]},{"symptom":"while on pinterest, don't know what i did but all pictures and printed words have become extremely small... can't read        cab you help me restore my print and picture size on pinterest","solutions":["Hello anitaruff! My name is Marco, I am an Independent Advisor. I will do my best to help you.Is it also small on the web page? or only when printing documents?"]},{"symptom":"statud        What are the two blue arrows pointing in opposite direction mean. ","solutions":["What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK .Where are you seeing this?","Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,The two blue arrow pointing in opposite direction is an indication that the file are compressed to save file storage.You may follow these steps if you wish to decompress the files. 1. Open the folder you would like to decompress 2. On the file menu, click properties 3. On the general tab, click advanced 4. On advanced attributes, uncheck the compress contents to save disk space and hit ok.Let me know how it goes. :)","I meant Status.","I opened the folder.  I right clicked it and went to general tab and clicked advanced and the compress contents wasn't checked.  Now what should I do?","Windows 10 Ver. 1903 18362,418  I see these under status in File Explorer.  Someone said they meant the file was compress.  Properties for compress this file was not even marked.  Should I even care if they are compressed?","Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.This indicates that Windows has compressed the files to save space. To save disk space, the Windows operating system allows you to compress files and folders. When you compress a file, using the Windows File Compression function, the data is compressed using an algorithm, and re-written to occupy lesser space.To decompress a file or a folder, right-click on and the file or folder and under the General tab, select Advanced.Here uncheck the option to Compress contents to save disk space and click Apply\/OK. Windows will start un-compressing the contents and the 2-arrows will disappear.","It was not checked.","Ok, but your question was what does that mean? If you also want to know how to disable automatic compression of windows there are several methods.Method 1: -Select the “Start” button, then type “CMD“. -Right-click “Command Prompt“, then choose “Run as administrator“. -If prompted for a password, enter credentials for an account that has administrator rights.-Type the following then press “Enter“. fsutil behavior set disablecompression 1 -Now reboot your computer Method 2: - Press the \"windows+r\" button and type GPEDIT.MSC and press enter. - Then navigate to \"Computer Configuration\\Administrative Templates\\System\\Filesystem\\NTFS\" and double click on \"Do not allow compression on all NTFS volumes\".-Then change the status from \"Not Configured\" to \"Enabled\" and click OK. Reboot the computer."]},{"symptom":"How to accesss recent documents in the start menu (like you do in windows 7)?        I just had to switch to Windows 10 (because you're ending support for Windows 7). How do I access recent documents through the start menu? It's usually very near the top.","solutions":["Hi palettemuse Open the Settings App (gear icon on your Start Menu) Go to Personalization - Start At the bottom of that settings page, turn on the option to show recently opened items on Jump lists on Start, Taskbar .. etc","Mine was already set to that, but it's not showing recent documents."]},{"symptom":"When\/How to Set Up Additional Users in New Win10 Installation?        In Windows XP and 7 it used to be possible to set up one account (the original Administrator) reasonably completely and then copy that profile to the Default User so that additional users (added later) would start with essentially the same configuration.  Apparently this is no longer allowed in Windows 10.  Are there any tricks to speed up configuration of additional user accounts (in this case my own Standard User on this two-user machine), or is it now necessary to repeat the whole process for each account?Related question:  How do you tell which settings carry over to all users, and which are specific to the user account in which they are made? -- JCW2","solutions":["Hi JCW2 I am sorry, as you correctly said, it is no longer possible to copy over account settings to a new user profile when setting that up . . .Most settings in Windows 10 are user specific, certainly any configuration settings you apply to the operating system are tied to the user profile you set those up on . . .For example, software like Microsoft Office installed on one user account, depending on the version of Office may not even be available to another user account on that same PC, because Microsoft Office licences these days are tied to a Microsoft Account and not the PC they are installed on . . .","Hi JCW2 When you go to install Office 2019, you will need to go to Office.com and use your Microsoft Account to download and install Office, this is a good thing because Office is then associated with your account and should you need to re-install Office, you can go to Office.com and re-install without the need for a product key You can then use Office from then on without the need to be logged in with a Microsoft Account . . ."]},{"symptom":"Minecraft Realms account - My kids account cannot access our realm        Hello,We just added a realms account for the family and everyone but my son can log into the realm. We got the realm for him and he is the only person who cannot access the account. I have removed call content restriction on his child profile but he still cannot access the account.Please help me resolve this issue. as soon as possible. Our family would all like to play together.","solutions":[]},{"symptom":"windows ubdate not working        hi I tried everything I think XD but its still not working there is error code 0x80240fffit says There were some problems installing updates, but we'll try again later. If you keep seeing this and want to search the web or contact support for information, this may help: (0x80240fff)it will be great if u help me thank u ^_^","solutions":["Hi Elguja You seem to be running an older version of Windows 10, click your Start Button, type winver and hit EnterOn the resulting dialog, what Version No. and build No. of Windows 10 are you running?If that is not version 1903 or version 1909 of Windows 10, click the link below, then click 'Update Now' on that page to immediately get 1909 and bring your PC right up to datehttps:\/\/www.microsoft.com\/en-us\/software-downlo..."]},{"symptom":"Question About My New Laptop        I got a new laptop for Christmas it has a build in camera and it also came with Windows 10 Home. Now when I click on start then the camera icon. A window will come up telling me it can't locate my camera. Should I down a camera app to my computer so I can use my camera. Can somebody please help me with this problem. I try figuring it out on my own but I have no clue.","solutions":["Hello. Let's try to work through these suggestions in support document.https:\/\/support.microsoft.com\/en-us\/help\/13753\/windows-10-camera-does-not-work","Hello TrishaRenae45! My name is Marco, I am an Independent Advisor. I will do my best to help you.What is the model of your laptop? Do you have on your keyboard or on the laptop itself a button to activate \/ deactivate the camera manually?","My Laptop is a Direkt-Tek. The model number is DTLAP-Y116-2. It is a touchscreen laptop. It saids it has a Front Facing Camera. I don't see any button on my keyboard to turn it on or off.","Have you looked at the suggestions on the site you were given above? by Resoucefulhttps:\/\/support.microsoft.com\/en-us\/help\/13753\/..."]},{"symptom":"can't change the name of a folder (any folder)        hey,I have a problem, I can't change the name of a new foler (even if i just created it),im getting an error message of this kind: \"we couldn't find the specific file\" (im getting it in hebrew so the translation may not be accurate)what can I do?(windows 10, 100 +GB avialble)thanks,Noam","solutions":["Do you right click on the folder and then click on Rename in the list?","Hi noampaz and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/appuals.com\/fix-cant-rename-folder-on-w...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Can't activate windows after changing motherboard        I want to be able to personalize as well as get rid of the watermark, and I have a genuine copy of windows, but I swapped my motherboard so it doesn't recognize that. Unfortunately, I no longer have my product key. When I click the troubleshoot button, select i changed hardware recently, and select the PC i was using before, it simply says \"Unable to activate Windows. We can't reactivate Windows on this device. Try again later\". My error code is 0xC004F211. What should I do?","solutions":["What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK","Hi Lumi Is your Windows 10 licence based on an OEM licence (came pre-installed on a PC) or Retail (purchased separately to a PC)If it is a Retail licence, then it will have transfer rights to a new Motherboard or PC, if it is OEM it will not . ..Is your Windows 10 licence a retail licence? If so, try all the options on this page: https:\/\/support.microsoft.com\/en-us\/help\/10738\/...If none of the options on that page work fr you, then your best option is to contact Microsoft Support and ask them to help you re-activate your Windows 10Choose a local Phone Number: https:\/\/support.microsoft.com\/en-us\/help\/13948\/...","I have the exact same problem. I am calling microsoft Canada right away to see what they can do about it.phone number: 905-568-0434i'll give you feedback after this","I'm having the same exact problem, except mine says \"We can't reactivate Windows as our servers aren't available right now. Wait for a few minutes or try adding your Microsoft account again. \" I don't have the option to even add my account either. Code : 0xC004F213","It was a retail license. I tried everything on the page so I suppose I have to contact support.","Allright just came out of the line with Microsoft.for your information:-My build wasn't OEM-I had a solid copy of windows 8.1 with a KeyBasically he told me once you change the motherboard, you cannot activate windows via the account anymore. You absolutely need the CD key provided with the copy of windows you've previously buy. I don't know if it's absolutely right, but i finally found my windows 8.1 Key in a old box and when I entered it, it worked.good luck with your issue :S","i don't have the box so unfortunately i'm stuck. dang.","I was having the same issue after upgrading to a new mobo\/processor\/hdd.  Nothing was working, but I was able to find the old Win7 Pro disc I had along with the key.  Entered it and it's working now."]},{"symptom":"The minimizing icon in the right upper corner of Microsoft Edge disappared.  How can I get it back????  Thanks in advance for any helpful advice.        The minimizing icon in the upper right  corner of Microsoft Edge disappeared.  How can I get it back?  Thanks in advance for any helpful  advice.","solutions":["Hi HeidiWolko you may be in full screen mode - press F11 to toggle full screen if that is not the issue, you may be in tablet mode ( there will be an arrow by the start key)if this is the case, winkey+A to open the action centre click the tablet mode button in quick actions","There is a possibility you accidentally turned on Tablet mode. Go to your notifications in the bottom right corner and check it."]},{"symptom":"Windows 10 BSOD Crashing        So first off, I recently got a new motherboard and graphics card from a friend and put it inside my old computer.  It worked fine but started to Blue Screen and kept crashing.  I was already considering buying a new and better computer at the time and the crashing didn't happen very often so I just decided to not bother and wait until I bought a new computer. About a month passes and I go out and buy new parts to build a computer and got a new everything but my hard drives. The parts I got were: Motherboard - B450 Tomahawk,  CPU - Ryzen 5 3600,  GPU - RTX 2060 Super,  Power -  Thermaltake Smart Series 700W.  My new computer worked amazingly and no issues for about a week until it started Blue Screening again.  Every time it crashed, I'd get a different error then last time and I wasn't sure what to do. Soon after that, my CPU started being used at 100%. I was thinking I somehow got a virus so I tried scanning my pc with Norton (my anti virus) but it couldn't finish without crashing. I decided to reset the pc and wipe it completely but for some reason it wouldn't work. It would do nothing then it would soon crash. So I reformatted the hard drives and got a copy of Windows 10 on a usb and download it that way. Downloaded drivers and I couldn't tell it there was any crashing so I download a couple of things (Steam, Discord, Norton). The CPU issue was fixed but I still kept crashing. But, the crashing used to be very often and could hardly do anything but now it's just very random could happen from anywhere from 5 mins, 10, 30, 1 hour or more after being turned on. I'm lost at what I should try to do and would be much appreciated if someone could help some this issue.Also, it sometimes freezes for about 3-4 minutes then crashes and I've already posted this before but the person helping me never got back to me.","solutions":["Hi BootKickerDABB, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved.If you are over-clocking anything STOP! This sounds like an intermittant heat related issue which does not necessarily mean excessive heat. A single component, such as a resistor, capacitor, transistor, or others, could be too sensitive to even the normal levels of heat.1. Totally uninstall Norton - 3rd party antivirus tend to create these issues and\/or make troubleshooting much more difficult. Use Windows Defender which in Windows 8\/8.1 & 10 is a full antivirus.Norton Removal Tool https:\/\/support.norton.com\/sp\/en\/us\/home\/curren...List of anti-malware program cleanup\/uninstall tools http:\/\/answers.microsoft.com\/en-us\/protect\/wiki...Uninstallers (removal tools) for common antivirus software http:\/\/kb.eset.com\/esetkb\/index?page=content&am...2 Be sure the BIOS, chipset drivers, and all major drivers are up-to-date. Do not rely on Windows Updates for this, Actually go to the motherboard and all the major device makers' sites and manually check. (See drive update methods below.)3. Remove ALL power then reseat all the cards. memory, and cables (on both ends when possible) - actually remove and replace - do not just snug. Add a fan blowing into the case onto the COU and GPU areas as a test. <--- These are very important especially since the BSOD's were present before the hardware changes and survived a Clean Install of Windows. <-- This also needs to be done even though you might think it is not the cause.4. Reduce the system down to as simple as possible including minimum memory. 5. Run the memory tests (see methods below). 6. As needed use ALL the methods in the troubleshooters below. 7. After ALL the above if needed run Driver Verifier to see if it can indicate a CAUSE (see Driver Verifier methods below).----------------------------------------------------------- Troubleshoot blue screen errors <-- read this link http:\/\/windows.microsoft.com\/en-us\/windows-10\/t...Frankly, I would be very surprised if analyzing the minidumps helps at all though it is worth a shot. Please include ONLY a few after uninstalling Norton.We can analyze the minidumps if you make them available from the OneDrive or other file sharing sites (such as MediaFire). If you have problems uploading the minidumps copy them to the Desktop or the Documents folder and upload them from there.One-Drive - Share files and folders and change permissions http:\/\/windows.microsoft.com\/en-us\/onedrive\/sha...Upload photos and files http:\/\/windows.microsoft.com\/en-us\/onedrive\/add...Zip or upload the contents of C:\\Windows\\minidump Use OneDrive to upload collected files http:\/\/social.technet.microsoft.com\/Forums\/en-U...====== This utility makes it easy to see which versions are loaded : Run DriverView - set VIEW to Hide Microsoft drivers - update those without Dump in their names (and update BIOS and chipset drivers).DriverView - Free - utility displays the list of all device drivers currently loaded on your system. For each driver in the list, additional useful information is displayed: load address of the driver, description, version, product name, company that created the driver, and more. http:\/\/www.nirsoft.net\/utils\/driverview.htmlFor Drivers check System Maker as fallbacks and Device Maker's which are the most current. Right Click the Start Button - Device Manager - Display Adapter - write down the make and complete model of your video adapter - double click - Driver's tab - write down the version info. Now click UPdate Driver (this may not do anything as MS is far behind certifying drivers) - then Right Click - Uninstall - REBOOT this will refresh the driver stack.Repeat that for Network - Network Card (NIC), Wifi, Sound, Mouse and Keyboard if 3rd party with their own software and drivers and any other major device drivers you have.Now go to System Maker's site (Dell, HP, Toshiba as examples) (as rollback) and then Device Maker's site (Realtek, Intel, Nvidia, ATI as examples) and get their latest versions. (Look for BIOS, Chipset, and software updates at System Maker's site while there.)Download - SAVE - go to where you put them - Right Click - RUN AD ADMIN - REBOOT after each installation.Always check in Device Manager - Drivers tab to be sure the version you are installing actually shows up. This is because some drivers rollback before the latest is installed (sound drivers particularly do this) so install a driver - reboot - check to be sure it is installed and repeat as needed. Repeat at Device Makers - BTW at Device Makers DO NOT RUN THEIR SCANNER - check manually by model.Manually look at manufacturer's sites for drivers - and Device Maker's sites. http:\/\/pcsupport.about.com\/od\/driverssupport\/ht...==================================================== Memory tests do not catch all errors such as mismatched memory (possible even for sticks that appear to be identical) and when faster memory is placed in the system behind slower memory. So it is best to also swap sticks in and out to check for those even if all memory tests fail to show a problem. To test RAM check here - let it run 4+ hours or so. <-- best method www.memtest.org MemTestX86 - Test RAM With http:\/\/www.tenforums.com\/tutorials\/14201-memtes...For the Windows Memory Diagnostic Tool. Type in Cortana's search box -> Windows Memory Diagnostics ........find at top of the list - click it. in Windows 8\/8.1\/10 the name is \"Windows Memory Diagnostic\".================================================ After doing ALL the updates you can, and if the issue continues, then run Driver Verifier. Driver Verifier can help find some BSOD issues : Using Driver Verifier to identify issues with Windows drivers for advanced users http:\/\/support.microsoft.com\/kb\/244617How To Troubleshoot Driver Problems in Windows Vista or 7. (8\/8.1 and 10 are essentially the same). http:\/\/www.winvistaclub.com\/t79.htmlUsing Driver Verifier https:\/\/msdn.microsoft.com\/en-us\/library\/window...WINKEY + X - RUN - type in -> verifier \/reset hit enter to disable If Driver Verifier creates a minidump upload it and post the link here so we can analyze it.Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all.","Thank you for replying and sorry for not replying sooner.  Here is 2 of my most recent mindumps: https:\/\/1drv.ms\/u\/s!Ap4xx-owpXd6hAvBTYW22Shjb5rt?e=qn8FqF , https:\/\/1drv.ms\/u\/s!Ap4xx-owpXd6hAvBTYW22Shjb5rt?e=qn8FqF. I am currently trying the other things you've said for me to try and I'll get back to you soon.","Ok so the issue was bad ram.  I did a few of the things you said to do but nothing had worked an I honestly didn’t want to keep messing with it so I took it to Best Buy to have it looked at.Thank you for the help."]},{"symptom":"outlook.com Account Is Active In Family Account but Account Creation Incomplete        I created an outlook.com account for my son and was asked for my outlook.com account. (Wanted to manage this through Family account so this was fine.) I admittedly took time to find my account and log in to verify it's still good, and then I added this email address to the form to continue with my son's outlook.com account creation.This triggered a code being sent to my outlook.com email which I retrieved and entered into the form for my son's account creation.  After this, I clicked next and it appeared that the account was created; it redirected to the login screen.  I logged in with the password that I had set and received an incorrect password message (though my son and I know the password by heard and yes I should have used a password manager).I tried to reset the password and my only option is Recover Account.  I filled this out and it referenced my (parent) email account when asked for another email address.  This led me to fill out information about the account which I was able to do and is correct but is insufficient as I never had the opportunity to complete filling out the information in the account creation.I do see my son's email account in my Family account and there is no option to reset the password.  I fear this problem is not solvable though I appreciate any guidance.Thank youMoved from: (Outlook.com | Security, privacy, and accounts | Other)","solutions":[]}]}