{"windows":[{"symptom":"upload photos        I am unable to upload photos from my iphone to my pc using window photo or directly from DCIM.  i can upload a few then get a message that device not connected.  i have tried numerous different pc's (windows 7 and windows 10), multiple usb cords and 2 different apple devices (iphone 7 and ipad air).  nothing works","solutions":["Hello Ann, I am Sai, a Microsoft Community Independent Advisor. Please make sure that your cable is an Apple-approved cable. If the cable is not approved, it is likely to fail during file transfer. I would suggest buying the lightning cable from the Apple Store.","Where do i get an “apple approved” cord?","You can purchase an Apple approved cord at a local Apple Store or on apple.com.","I used a cable that came with device.  Still getting error message that indicates device not detected.  I have contacted apple numerous times and tried to work through but cannot get it to work.  Any advice about the Photostix or other devices that connect to apple phone and download photos?  suggestions for product?","One possible solution would be to download OneDrive and upload all your photos and documents to OneDrive. Then, you can access it from any device with onedrive.com or the OneDrive app."]},{"symptom":"sony vaio keyboard        the @ ' key and the # key both deliver incorrect symbols - how do I fix this?","solutions":["Probably the wrong regional language.This is for a Dell.https:\/\/www.dell.com\/community\/Laptops-General-Read-Only\/Keyboard-giving-wrong-symbols\/td-p\/4554416"]},{"symptom":"My Desktop has Disappeared        I am using the latest version of Windows 10 updated as of today.  Last week, the desktop and task bar suddenly disappeared,  I was able to use System Restore to get it back.  It disappeared again today and system restore can't be accessed (or anything else use the search function).  All the solutions for this apparent common problem don't work.   Under Personalisation, there is no menu item to view desktop icons as described in some \"solutions\".  I do have the taskbar but no desktop.  Is it a bug in the Microsoft auto-update?  It is concerning that I can no longer access system restore even though I know that there are restore points in the computer.  I get an error message saying Can't find System Restore. Some of the solutions suggest that Explorer.exe may be corrupted - if this is the case how do I re-install this?  Unfortunately, this HP notebook was very expensive but expensive doesn't mean reliable.  I have had a long and sorry history of faults, probably caused by the poor quality of software these days.Any help will be appreciated.John","solutions":["Don't worry about it John. Keep me posted as to your progress. Will be here to help.","John did you mean to give me a bad rating in the middle of trying to help you? That's why I asked you to wait."]},{"symptom":"Dear microsoft        I am using a laptop  with windows 10 that previously my brother was using it with Win 10 in spanish and when he gave it to me i wanted to change it to engllish so i downloaded the english(US) language package set it as default an deleted all the spanish language  packages in it but still when i do updates some menus are in spanish like in between reboots and also i noticed that these when ever this spanish menus show up the screen becomes blurry and its just a tiny bit less smooth for doing updates than a my other laptop which was bought with win 10 running in english since day one! How do i solve this? if the solution is to do a clean install of win10 from the bios with a bootable win10 install how do i set it up so the bootable usb has win 10 in english?","solutions":["Hi Alex-95gl, My name is Riccardo and I will be happy to assist. You should be able to change the default language without having to reinstall Windows 10.Have you tried the steps below: https:\/\/www.windowscentral.com\/how-properly-cha...!DISCLAIMER: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi Alex.  I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I understand you tried installing the Language Pack and now would like information how to Clean Install with English language. To do this go to Media Creation Tool and create bootable installation media in English for your exact version and bit rate:  http:\/\/windows.microsoft.com\/en-us\/windows-10\/media-creation-tool-installThen follow the  illustrated steps in this link which compile the best possible Clean Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy:  http:\/\/answers.microsoft.com\/en-us\/windows\/wiki\/windows_10-windows_install\/clean-reinstall-windows-10-upgradefactory-oem\/1c426bdf-79b1-4d42-be93-17378d93e587  Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key for your PC maker given in this chart: https:\/\/www.sysnative.com\/forums\/hardware-tutorials\/23010-bios-boot-menu-f-keys-hotkeys-system-manufacturer-oem.htmlIf the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, then on second screen choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, select the Unallocated Space, click Next to let it create and format the needed partitions and start install - this makes it foolproof. You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the linked tutorial.  It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC because you will learn everything that works best and how to apply it with your own hands.I hope this helps.  Feel free to ask back any questions and let us know how it goes.  I will keep working with you until it's resolved.________________________________________________________Standard Disclaimer:   There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Microphone limited Access        Greetings my fellow man and woman. I come before you to ask for some helpful assistance. Typically you'd have issues with a mic not putting out or just putting out to absolutely everything it can. I'm right in between that. I'm having a problematic issue where my Mic only wants to work with a single application at any time. For example and hypothetically speaking, say I have two apps that use my Mic. One is Skype and the other is Discord. Both start closed but if I open Discord, Discord will use the Mic and have no problems. If I open skype with discord still open, Skype will register the mic but will have 0 input from the mic, and closing discord will not resolve the issue. In order for Skype to have input is by closing all apps, and then reopening the app. This goes Either way. I Don't know why this is the case and it impacts more than just these two hypothetical examples. In order to make my life a little easier, if there is a way that two apps can use the mic at the same time, that would be a good help.","solutions":["Hi, You could check the privacy settings: Start > Settings > Privacy > Microphone Make sure \"Allow apps to access your microphone\" is turned \"ON\" and make sure any relevant app is set to \"ON\".","Also \"Allow desktop apps to access you microphone\" should be \"On\".","All these relevant point are all on and I've double checked these, though any setting beyond these I might be unaware of.","Can you try a \"clean boot\" to see if a third party process or service is causing the issue:https:\/\/support.microsoft.com\/en-us\/help\/929135...If a clean boot does resolve the issue there is a section in the article \"How to determine what is causing the problem by performing a clean boot\".Reset the computer to start normally afterward. As a general precaution create a System Restore Point prior to initiating a clean boot.","Can you try a \"clean boot\" to see if a third party process or service is causing the issue:https:\/\/support.microsoft.com\/en-us\/help\/929135...If a clean boot does resolve the issue there is a section in the article \"How to determine what is causing the problem by performing a clean boot\".Reset the computer to start normally afterward. As a general precaution create a System Restore Point prior to initiating a clean boot.Thank you sir, I will look into the article and look into the potential cause. The Issue seems to have be resolved.","You're welcome."]},{"symptom":"CD\/DVD Internal and External Drives        My internal CD\/DVD drive was working and now has stopped. I have also added two external CD\/DVD drives. One drive is a Blu-ray and the other is a standard CD\/DVD drive burner\/writer etc. I have made sure Windows 10 is updated, I have also tried just update the drivers and lastly, I have deleted the drives and restarted my system but nothing seems to work. Any suggestions. ","solutions":["With a disc in the drive have you looked at Disk Management (win +x)?","Hi Terry. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.First try the steps here: https:\/\/www.groovypost.com\/howto\/fix-dvd-cd-dri... Did the DVD drive work in that PC before? If so this might have been caused by Windows Update. Did you receive Windows Updates recently? Check at Settings > Update & Security > Windows Update > Update History. You can try uninstalling any affecting Updates there. You can also try to System Restore to a point before this happened: http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... See if the problem returns with the Update reinstalling and if so uninstall it and block it using the Hide Updates tool:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... To attempt to repair this, go to Device Manager reached by right clicking the Start button. On the View tab, choose Show Hidden Devices. Under DVD Device, click on Driver tab, first try Update Driver > Automatically. If that fails see if Roll Back is available. If not choose Uninstall, restart PC to reinstall the driver. Next right click Start button to open Disk Management, scroll down to find the DVD drive. Does it have a drive letter? If not right click to issue a drive letter so it shows up in File Explorer, save and exit.You can also straighten out a paper clip and try to mechanically press open the door by putting it through the tiny hole next to the door and press firmly inside against a metal lever it should contact.For the external drives, try reinstalling all USB category drivers in Device Manager, by opening and right clicking each to Uninstall, to restart the PC program the power button first to Shut down the PC at Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... These drives do fail so if nothing else works you can search Google for a replacement DVD drive for your PC make\/model and a video showing how to replace it. Most installers and video files nowadays also use USB so you may not need one.FYI there is no DVD player in Windows 10, they want you to buy one from the store. There are better free options here:http:\/\/www.pcworld.com\/article\/2953724\/windows\/... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"How to find Scanner and printer icons in Windows 10        How to find Scanner and printer icons in Windows 10","solutions":["On the taskbar check the ^ for hidden icons.","Hi KAE. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.You need to install the full printer software which should provide these shortcuts on your Desktop, also the only reliable way to get full features like ink levels and interactive scanning from the printer top.Rather than spending too much more time fiddling I'd simply Clean Install the printer which always works, lasts longer and actually saves time:1) Power up the printer, if wired unplug it's USB cable from PC. 2) Go to Settings>Apps>Apps and Features to find and Uninstall any printer software.3) Use one of these methods to remove all of the old printer drivers: https:\/\/www.tenforums.com\/tutorials\/101274-unin...https:\/\/helpdeskgeek.com\/how-to\/remove-uninstal...4) Now type Control Panel in Start Search, open CP, choose Icon View. In Control Panel open Devices and Printers, right click printer to delete Printer and any scanner or fax of the same name. Restart PC.5) Go to the printer model’s Support Downloads webpage to download and install the latest full software package. Now is also the time to check for any newer printer firmware to install which matters a lot.6) Extract Printer software, right click Setup file to Run as Administrator. Follow the setup screens closely as you install the software. For USB it should prompt when to plug in the printer.Older software may need to be installed in Compatibility Mode to run correctly: https:\/\/www.groovypost.com\/howto\/run-old-softwa... If you have further problems reply back with results of each step. Once it's installed and you've run a test print, then scanned it to see that it opens on the desktop, open the Printer software and go into its Settings to set the scan-to file location you prefer, also the email app you want opened for Scan to Email, if applicable.I hope this helps. Feel free to ask back any questions and let us know how it goes. If you will wait to rate my post until we are done, I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"How do I find network credentials user name and password?        I have recently installed a peer to peer network.  All computers are Windows 7 except one which is Windows 8.1.   The Windows 7 workstations can access the network computer no problem.On The Windows 8.1 workstation, when I try to access the network computer, I get a request for Network Credentials.  I have never set credentials up and have no idea of the password.  I tried the Windows sign in password which does not work.  This Windows 8.1 computer is set up as a MIcrosoft account, not a local account.  Big mistake there, but I use remote desktop to log in and that was the only way to get remote desktop to work.Any idea how to find my network credentials?  Do I look on the local computer or the network computer.Do I set them up on the network computer?","solutions":["Hi Vicki,Thank you for posting your query in Microsoft Community.Let me ask you;Is the password protected sharing on in the computer you are trying to access?When password protected sharing is on, people locally or on the network must sign into a user account with a password on your to be able to access shared files and folders and Public folders on your PC.When password protected sharing is off, people on the network will be able to access shared files and printers and Public folders on your PC without having to sign in to your PC, and local user accounts on your computer will not require having a password. You must be signed in as an administrator to disable password protected sharing in Windows 7.a. Open Control Panel in the Start Menu.b. Open Network and Sharing Center in the Control Panel.Note: If Network and Sharing Center is not available, changeView by to Large icons at the top right of the Control Panel.c. Select Change advanced sharing settings in the left column of the Network and Sharing Center.d. Expand the network you want to disable password protected sharing on by clicking the down arrow on the right of the profile.Note: It’s usually the profile labeled current profile.e. Select Turn off password protected sharing and then click Save changes.Also, refer to: Why can't I connect to other PCs?Hope this information is helpful. Please feel free to reply in case you face any other issues with Windows in future.","Helpful thanks...","not helpfull, I tried these steps on my Windows 8.1 but not working still asking for network credentials and on typing my username and password not connecting","Not helpful for me either. It still asks for my network password and I have no idea where it is.  Where can I find it?","Hi... A simple step is recreate your local login profile. and check it now asking network credentials when you try to access your local share folders from you computers.Just now we resolve this problem after tired multiple way. this way only support and escape from the problem.. Now i can able to access my local share folders with different credentials. ","Hi... A simple step is recreate your local login profile. and check it now asking network credentials when you try to access your local share folders from you computers.Just now we resolve this problem after tired multiple way. this way only support and escape from the problem.. Now i can able to access my local share folders with different credentials. ","Hi... A simple step is recreate your local login profile. and check it now asking network credentials when you try to access your local share folders from you computers.Just now we resolve this problem after tired multiple way. this way only support and escape from the problem.. Now i can able to access my local share folders with different credentials. ","This doesn't actually answer the question, it just works around it. I am in the same situation but when I checked network settings I found password protected sharing is already turned off. Since nobody has been able to answer the original question of where these network credentials come from and how I can find out what they actually are, I am now stuck.","Hi Alex,We’d like to ask if you’ve also tried to recreate your local login profile suggested bysaber Mohammed above. You may check the network credential when you access the local shared folders from your device. Let us know how it goes after trying the steps so we can check for other troubleshooting steps.We'll keep an eye out for your response.","I had this same problem and this worked for me:Your username is typically the name of your computer, which is one of the computers on the Network in File Explorer > Network (it will be one of the computers listed at the top). Or, you can go to Settings > System > About (\"About\" is in the left sidebar WAY at the bottom) and see the name of your computer near the top of the screen.Your password is the password you use to login to the computer when it restarts."]},{"symptom":"Colors are dull and not very saturated (Acer Nitro 5)        Hi. For some reason, the colors on my display seem a bit dull and not very saturated, like some reds look a bit orange on my laptop, but when i go on the exact same pages but from another device, the colors look perfectly fine. If someone could send some help for this, it would be greatly appreciated.","solutions":["Hi RP. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) It's reported by another owner here: https:\/\/community.acer.com\/en\/discussion\/545939...There are some color Settings for Acer laptops here to try: https:\/\/www.techwalla.com\/articles\/how-to-chang...2) Update the Display driver from the Acer Support Downloads web page for your exact model number, HP Serial Number or Dell Service Tag - from the sticker on the PC.While there check also for newer chipset, BIOS\/UEFI firmware (very important), network, sound, USB3 and other drivers, comparing to the ones presently installed in Device Manager reached by right clicking the Start Menu.If this doesn't give you the latest or ideal driver for what you need, compare it to the driver offered by the Intel driver update Utility here:http:\/\/www.intel.com\/content\/www\/us\/en\/support\/... or the Nvidia Update utility here: http:\/\/www.nvidia.com\/Download\/Scan.aspx?lang=e... or the AMD autodect utility here: http:\/\/support.amd.com\/us\/gpudownload\/windows\/P... For Display issues one fix that is working is to Roll back or Uninstall the Driver on the Display Device > Driver tab, restart PC to reinstall driver.You can also try older drivers in Device Manager > Display device > Driver tab > Update Driver > Browse > Let Me Pick.Then you will know you've tried everything in addition to Windows Update drivers.Adjust the screen resolution until it fits and looks best at Settings > System > Display.3) Let's also look at the Windows 10 color settings which may help. Reset the Windows 10 theme by setting a new Theme from Settings > Personalization > Themes or from the many spectacular free Themes you can download from the Store to that control panel to choose from: https:\/\/www.microsoft.com\/en-us\/store\/collectio.... If your preferred Theme doesn't work right off, try another to compare.If you don't want the theme used to reset this, you can then personalize with your own background slideshow or picture in Settings > Personalization > Backgrounds, but most personal pictures are not as high resolution as the Theme packages which are the highest possible and some of the most expensive scenic pictures ever taken. To get color back on the task bar, start menu and window frames after Version 1903 turned the Light theme dull grey follow this guide:https:\/\/answers.microsoft.com\/en-us\/windows\/for...To get the spectacular scenic backgrounds back on the Lock screen when the PC first starts up, go into Settings > Personalization > Lock Screen and set the drop down menu to Windows Spotlight.If you want the Fun Facts you can hover the mouse over on the Lock Screen or click to go to info pages about the scenes, change dropdown temporarilty to Picture, then tick the box to Get fun facts.... and change it back to Windows Spotlight.More about personalizing by customizing appearance here: https:\/\/www.windowscentral.com\/how-customize-lo...https:\/\/www.howtogeek.com\/225893\/how-to-persona...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Log in screen        My laptop keeps going back to the login screen every few minutes so I keep having to enter the password. I have checked the power settings as suggested in a post regarding the same issue. The laptop has Windows 10 version 1909 os build 18363.535.","solutions":["Hi Tracy. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.If any steps cannot be performed normally then try them in 1) Safe Mode with Networking (so you have internet) or 2) Safe Mode accessed by one of the illustrated steps in this guide:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf.... You will need to use your password to get into Safe Mode as a PIN is not accepted.1) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 2) Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.3) If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Fresh USB Windows 10 Install - Failing        I am trying to install a fresh copy (reformatted the hard disk) of windows 10 using a USBCreated an installation media on a USB flash drive (Win 10 pro) from this page https:\/\/www.microsoft.com\/en-us\/software-download\/windows10 Changed the boot order on the other PC so that it boots using USBSelected custom installInstalling Windows goes through the following steps successfully: Copying Windows Files, Getting Files ready for installation, Installing features, Installing updates and before the last step (Finishing up), it restartsThen it goes back to the start of the installation steps I am stuck and have read numerous posts but don't know what to do to install a fresh copy of Win 10.  ","solutions":["Hi deepakkaushik When that installation routine restarts, you must then go into BIOS again and set your hard drive as the Boot device otherwise the installation will keep restarting, because your system is booting form the USB device . . .Also, it is best to disconnect from the Internet when installing Windows 10 . . .","Thanks Dave. Initially, I disabled the EFI boot source, so that it's only using Legacy Boot source with the USB option in it (first image).  I then changed the boot order and enabled EFI boot sources as well (this is how it was initially) I disconnected internet connection to the PC.  However, I am still having the same issue whereupon restart it goes back to the initial set up screen.","Hi Deepak In both your screenshots, your USB drive is before your hard drive in the boot order . . .Try this, turn off your PC, remove the USB drive, then boot up your PC, does the installation run to completion?","I tried that but still saw the same issue. I tried a different approach.  I used my old Win 7 DVD to install windows...after some time it restarted and now I am seeing the following error.   When I click OK, it restarts the computer and shows me the same screen again.","Hi deepakkaushik I'll try to help you out. In order to install Windows 10, you NEED to have the UEFI boot option enabled. It won't install if this option isn't enabled. Legacy boot is only used for Windows XP \/ Vista (for 7 I'm not 100% sure). - Enable UEFI boot - plug the USB key with windows on it (https:\/\/www.microsoft.com\/en-us\/software-downlo...)- start the computer and the installation should go. I'll wait for your news Regards","Thanks Jay.  I appreciate your help. If I enable UEFI, then it doesn't allow me to install on any of the available drives - I get the following message.  In one of the forums, they mentioned to disable the UEFI and when I did that it did start installing from the USB but it never finished installing (i was in the loop).   ","It's normal. In order to install a UEFI OS, you need to format the drive with a GPT partition (and not a MBR).fully erase your drive, then you'll be good to go. Jay"]},{"symptom":"Windows 10 no audio output device        I have an HP Pro 3515.  It has been updated to Windows 10.  Ver 10.0.18362I have tried ALL of the suggestions, rollback, disable, uninstall,, complete reset, HP support, nothing has worked.It looks like it is a known bug from a Windows update.Additional information:Looking at the system report , in the sound information, nothing is listedIn Device Manager IDT High Definition Codec is listed.  In properties, no driver is listed.  running a driver update errors:  \"A device attached to the system is not functioning\".HELP!!!  Is there anything I can do to rectify the problem?Thanks!","solutions":["Hi BrianLofquist, Yes, there's a lot of things to consider in this kind of case. If you experienced this problem after a specific Windows Update. Then definitely we can isolate the case if we can uninstall the updates that you recently had and check if it will work fine after.For a detailed guide, please follow this link: https:\/\/www.techadvisor.co.uk\/how-to\/windows\/ho...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","I looked through the article and did as instructed.  I can see the list of updates, but I have no idea which one is causing the problem.Since my first post I have gone into the Bios and reloaded the defaults.I also went into Play Systems sounds and checked the Playback.  No audio device drivers are installed.","Hi Brian, There should be like listed dates on the most right side and you can filter it from the most recent.You might want to compare the dates of when you experienced the issue and the date of a specified recent update that you had.Try again and let's see if it will work. Thanks and regards,","The dates listed are all 11\/7\/19, today.  The problem started yesterday.  There were updates done yesterday also.","Hi Brian, If that's the case, try to remove the updates today and from yesterday. Might as well the day before yesterday if there's any. Then check it out again, Thanks","The only updates listed are from today.","Hi Brian, Did you double-check it inside Uninstall Updates? If yes, then you can remove them. And see what will happen. Thanks and regards,","I uninstalled all of the updates listed.  Going back to that screen now, shows as blank.  Still no audio driver.","I'm guessing there aren't any updates prior to today, because one of the suggestions was to run a full restore.  I did that yesterday afternoon.","Hi Richard, same problem,  the DVD\/CD ROM not reading CD as before; checked for updates and updated and says nothing to updatecan you give instructions how to uninstall step by step?the https:\/\/support.microsoft.com\/en-us\/help\/314060\/your-cd-or-dvd-drive-is-not-recognized-by-windows-or-other-programs instructions either not working :(can you help please?"]},{"symptom":"Viewing 2 documents        I just connected a new monitor to my laptop and I am trying to view 2 different documents at a time to compare the 2. I went to display settings and it is on \"extend view\". I can drag my files from my desktop over to the new monitor but the screen is dark and only the files show up. If I set it for duplicate, then I'm looking at the same document but now its on both screens. Please tell me how to pull up 2 different documents, 1 on each screen. Thank you, Richard","solutions":["Hi RichardLower1, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.The \"Extended\" view is the proper view to be on to view two different documents at once.Open both documents. Then, you can simply drag the window using the title bar at the top of the window, across to the other monitor.Another way to do this is to hold down the Windows key, and press the left or right arrow key, which will move the document window to one half of the screen, and you can keep pressing the arrow key to reach the other monitor, and then maximize the screen.I hope this has helped you. If this is not what you are looking for, please reply with the program you are using, and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"How can I remove Windows.old from laptop        I can remove windows.old from laptop. Can you help","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,I'd recommend performing a disk cleanup while selecting the previous installation to remove on the system1. Press and hold the windows key and the R key and type in cleanmgr on the run command and hit enter2. Choose the disk c: for disk cleanup 3. Once the disk cleanup window for C has popped up, choose to cleanup system files4. On the list of system files, make sure to select the previous installation to have the Windows.old removed from the system.Let me know how it goes. :)","I can remove windows.old from laptop. Can you helpHello,Open administrative Command Prompt.Type RD \/S \/Q %SystemDrive%windows.old and press Enter key.Let the command execute.Done!","Hi Gary,I have tried, but it did not work.It maybe that I did understand the step by step process you suggested.","Hi Gary,Correction to my feedback, it should readI have tried, but it did not work.It maybe that I did not understand the step by step process you suggested.","Hi Robin,You may try additional methods here if cleanmgr hasn't helpedWhat is Windows.old folder and how to delete Windows.old folder in Windows 10https:\/\/www.tenforums.com\/tutorials\/2066-delete-windows-old-folder-windows-10-a.html","Hello RobinForest. I am Andrew. I have another option for you to be able to delete this folder.Click the search bar and type in CLEANUP Click Clean Up System Files in the new window Here you will get a list of types of files to delete. Check off the Previous Windows Installations, this will remove the Windows.old folderTake Care RobinForest, Andrew"]},{"symptom":"Miracast issues        I have brand new HP desktop computer with windows 10 pro and it says that my PC is not supporting Miracast. Help!","solutions":["Hi DM. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See how to determine what's needed to use Miracast on your device: https:\/\/www.isumsoft.com\/windows-10\/2-ways-to-c...https:\/\/www.ghacks.net\/2017\/04\/20\/find-out-if-y...https:\/\/miracastwindows10.com\/setup-use-miracas...https:\/\/winaero.com\/blog\/how-to-check-if-your-p...Set up and Troubleshoot Miracast: https:\/\/merabheja.com\/how-to-setup-miracast-on-...https:\/\/www.thewindowsclub.com\/set-up-use-mirac...https:\/\/www.enhansoft.com\/how-to-troubleshoot-m...https:\/\/superuser.com\/questions\/1275906\/how-to-...One of those usually will do it. If not ask back any questions and keep me posted on your progress. I'll be here to help until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thank you for replying so fast but I am wondering is there any possibilities to fix this. I tried all of known options and it's not working. Is there any drivers I should update or anything???This is what I get on diagnosis:Miracast: Not Supported by WiFi driver'","I just gave you all of the known fixes. You couldn't have even read them over in 7 minutes. Will you please?Absolute thoroughness is required in these matters, skipping nothing and asking back if you need any help to complete a step. We often find out later that the fix was the skipped step, so please do not skip any. If you need help performing any step I will help."]},{"symptom":"LMB problems with gaming        I'm currently using a Dell Latitude E6430 with Windows 10 installed. I got a 2tb Seagate hard drive and decided to download some Itch.io games onto said hard drive; but, upon playing the games on this laptop, I've noticed that my left mouse button takes a couple clicks to register in some games, doesn't work while using WASD in others, and some, works fine. The problem seems to only occur in first person games. I am not using an external mouse, and the only thing plugged in aside from the power cord is my 2tb hard drive.Is there any way I can fix this? I'd really like to play these games without problems.","solutions":["Hi HS. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I've noticed they recently stopped allowing games to move to slower hard drives due to performance issues. Is this new hard drive a slower drive than your Windows C drive? Moving apps to a HDD from an SSD gives markedly slower response. Better to move the User folders if you need space as they suffer no speed differential. Try installing some games on C to compare. I notice you refer to mouse and then say you aren't using an external mouse. Is this the touchpad then? If so Update the Touchpad driver from the PC maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you also have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now. If that doesn't help then enter Device Manager reached by right clicking the Start button, go to Mice > Touchpad and then Driver tab. Choose Update Driver, then Automatic to see if it gets a better driver that resolves the problem. If not try Update Driver > Browse > Let Me Pick to try all previously installed drivers. If that doesn't work then try uninstalling driver, Restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver.See the troubleshooting steps here: https:\/\/support.microsoft.com\/en-in\/help\/402786... Go to Settings > Devices > Touchpad to go over the Settings. Then choose Additional Settings which opens the Mouse properties box. The Touchpad software installs a tab onto it - usually the last one - that should have more settings to check, including a checkbox to Disable Touchpad when USB pointing device is attached. This prevents palm drag from causing the cursor to jumpIf this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Update History, then uninstall them from the link there, and immediately check for these again and hide with the Hide Updates tool explained here: https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...You can also go into Repair Mode by whichever method works here: https:\/\/www.tenforums.com\/tutorials\/2294-advanc... to use the new Uninstall Updates button in Advanced Troubleshoot Options:https:\/\/pureinfotech.com\/uninstall-updates-adva.... You can also use System Restore from within Windows or the above Repair Mode to get back before the problem began, then check for Updates with the Hide Update tool and hide them:https:\/\/www.windowscentral.com\/how-use-system-r...Try a mouse to compare. If this is a mouse then try another mouse. I can give you separate steps for everything to troubleshoot mouse.Are there any other performance issues with Windows that might point to systemic problems?I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"On Windows 10 my Hotmail\/outlook account opens without logging in. How do I change this so I have to login?        On Windows 10.  My Hotmail\/ outlook account opens now without logging in.  I want to log in\/out myself. What do I do to correct this.Worked ok for years.* Moved from IE7\/XP* Original title: windows 10","solutions":["On Windows 10.  My Hotmail\/ outlook account opens now without logging in.  I want to log in\/out myself. What do I do to correct this.Worked ok for years.Are you accessing this account with a browser or through the Windows 10 Mail App?Don","I access thru bing like alwaysthen, click on outlook.com\/?mkt=en-cawhich is first in line, goes straight to my Hotmail."]},{"symptom":"Ads start on my premium subscription to Solitaire.        How dare you sell me a premium subscription and now I can't play without an ad for another game and says I need a premium subscription!","solutions":["Hello Ispagent, I am Andrew an independent advisor. This is horrible, you pay to lose ads and still have them, it must be so frustrating.Is this a recent occurrence or did it always happen since you purchased the premium version?"]},{"symptom":"blank blue screen        I have a blank blue screen with a cursor. Ive tried all the combinations recommended to bring the task manager up but nothing happens. ","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,I would recommend going into the windows recovery environment to use access multiple troubleshooting options.Start your computer, once the computer goes to the windows logo screen press and hold the power button for 5-10 seconds to shut it down completely. Do this for 3-5 times to force access the recovery environment.a) Startup repairGo to troubleshoot, advanced options, startup repair (This would attempt to repair the system)b) System RestoreGo to Troubleshoot, advanced option, system restore (This would roll back the system's configuration to a specific time and date)c) Safe modeGo to Troubleshoot, advanced option, startup setting, click on restart and this would provide you multiple options in terms of booting up the computer.Choose to boot into safe mode, once accessed you could either uninstall the update or check if all your drivers are up to date. A clean boot under safe mode would also help to make sure no softwares are affecting the system1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartd) Reset this PCIn the event that it still fails, I would recommend reinstalling the operating system. The option enables you to keep your files although uninstall programs that did not came with the system.Troubleshoot - Advanced Option - Reset this PCAlternative to reinstalling windowshttps:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/support.microsoft.com\/en-in\/help\/400073...Let me know how it goes. :)"]},{"symptom":"Can't open links in mail app on windows 10.        As the title says, i can't open any links within the mail app on windows 10.When I click on a link it says \"Unable to open ' specified link address'\", for example:\"Unable to open mailto:*** Email address is removed for privacy ***\".I have tried:Rebooting my laptopUpdating windows, then rebooting my laptopResetting mail appChanging default web browser to microsoft edge, then resetting mail app againNone of these worked, and the links work perfectly fine in-browser.Not sure what to do.Thanks","solutions":["Hi My name is Lester and hopefully, this will help answer your question, have you try to reset the app to check?Press Windows key + i (Open settings) Click on Apps and click apps and features Look for Mail app click Advanced Options click terminate click repair then reset Once done, press Windows key + X then click on Powershell administrator or open powershell with admin then copy and paste the command below:Get-appxpackage -all *shellexperience* -packagetype bundle |% {add-appxpackage -register -disabledevelopmentmode ($_.installlocation + “\\appxmetadata\\appxbundlemanifest.xml”)} Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"} Once done restart the Device and check. Let me know how does it goes, and we have sets of troubleshooting steps. Lester Independent Advisor","Just tried it, but can't seem to see a 'repair' option anywhere on the 'Apps&Features>Mail>Advanced options' page.I tried continuing on with the process, but after running Powershell as administrator and running the said line of code, i got the error:ForEach-Object : Cannot bind parameter 'RemainingScripts'. Cannot convert the \"Get-AppXPackage\" value of type\"System.String\" to type \"System.Management.Automation.ScriptBlock\".At line:1 char:61+ ... ype bundle |% {add-appxpackage -register -disabledevelopmentmode ($_. ...+                 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~    + CategoryInfo          : InvalidArgument: (:) [ForEach-Object], ParameterBindingException    + FullyQualifiedErrorId : CannotConvertArgumentNoMessage,Microsoft.PowerShell.Commands.ForEachObjectCommand","Thanks for replying, sorry here's the code: Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}If none will work from the above solution I suggest to do an in-place upgrade wherein it will upgrade the device to the latest version and repair all issues without deleting any files.Note: before doing this make sure to create a restore point: https:\/\/support.microsoft.com\/en-hk\/help\/402753... 1. go to this link: https:\/\/www.microsoft.com\/en-us\/software-downlo... 2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept. 4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, it should fix the issue. Reference: https:\/\/www.microsoft.com\/en-us\/software-downlo...","Yes! It's working :) Thanks so much","Perfect thank ypu so much! And I hope we resolved the issue now","Had what appeared to be identical issue but disabling an Adblocker resolved the problem."]}]}