{"windows":[{"symptom":"BSOD IRQL NOT LESS OR EQUAL        1. I am using version 1909 18363.5352. I did a fresh last time and got no BSOD, now problem has started again..Specs: - Operating System: Windows 10 Pro 64-bit (10.0, Build 18363) (18362.19h1_release.190318-1202)System Manufacturer: Gigabyte Technology Co., Ltd.System Model: X570 AORUS PRO WIFIBIOS: F4 (type: UEFI)Processor: AMD Ryzen 7 3700X 8-Core Processor              (16 CPUs), ~3.6GHzMemory: 32718MB RAMGPU:- RTX 2080 SuperBSOD error was :- IRQL NOT LESS OR EQUAL, SYSTEM THREAD EXCEPTION NOT HANDLEDminidumps Onedrive link :- https:\/\/1drv.ms\/u\/s!AsLOr3T8PXWDj8UrE89oob8MJg0h3Q?e=WNFlTt","solutions":["Hi, The latest version of the NVIDIA graphics driver (441.66) has been reported to cause BSODs in certain setups.Try uninstalling the NVIDIA graphics driver via \"Apps and Features\" and then install the previous driver (441.41).","i was on 441.41 previously, i had same BSOD's i got new BSOD:- link : - https:\/\/1drv.ms\/u\/s!AsLOr3T8PXWDj8UrE89oob8MJg0h3Q?e=4tAppf","Try the 441.12 driver. Also, one of the dump files showed MemCompression as the p[process that crashed so try checking the physical memory with a memory tester such as Memtest86+.","1. i have 2 sticks of 16 each, should i test with 1 at a time? 2. memtest86+ 4 passes are ok? moreover is it gpu or ram? which should i do? ","Best one stick at a time, minimum 8 passes. There is a good tutorial in the following link; https:\/\/www.tenforums.com\/tutorials\/14201-memte...Based on the BSODs more likely RAM. But rolling back the graphics driver wouldn't hurt. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","thanks, do i have to switch ram slots too after every 8 passes? ","If you get any errors then you could switch.","this means problem can't only be ram, but also ram slots, right?","That is correct.","Best one stick at a time, minimum 8 passes. There is a good tutorial in the following link; https:\/\/www.tenforums.com\/tutorials\/14201-memte...Based on the BSODs more likely RAM. But rolling back the graphics driver wouldn't hurt. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I boot USB with memtest86+ but at options it is not booting into it.. what could be problem?"]},{"symptom":"SSD Formatting        When attempting to format my new SSD, Disk Management will only let me convert to MBR or a Dynamic Disk, but not show me the option to format it. It doesn't have a directory name yet, and I cannot install files onto it. How can I make that happen?","solutions":["Hi, Assuming you aren't booted to it currently, you can use Window's Diskpart utility from a command prompt to format the disk and setup a new blank partition.*** being the disk number for the SSD. Be careful selecting the disk, there's no confirmation when entering these commands so you don't want to wipe the wrong one by accident.From a command prompt enter \"Diskpart\", hit enter and a new window will appear. From that window enter these ones by one:List Disk Select Disk *** Clean Create partition primary Format fs=ntfs quick This will select the disk, clean it of any partitions, create a new main partition the size of the disk. And format the partition to NTFS typically used by most large capacity drives.I hope that helps."]},{"symptom":"Stuck on Time \/ Date Screen on Windows 10 Desktop        I cannot get passed Time \/ Date screen with the background picture. Whenever I click a key for try and slide it up it just shoots the picture straight down. I have read alot on this and I cannot get into safe mode to save my life either. Here are the things I have tried.My mouse and keyboard are workingI cannot do the Shift + Power button because the power button is not at the bottom rightI literally borrowed my dads computer and plugged the hard drive in and it did the same thing.I've even tried yelling at it and that didn't work.If anyone has a solution to this please tell me, thank you.","solutions":["Have you tried pressing CTRL + ALT + DEL?","Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Because you can't get to the power button (ie. to do SHIFT + Restart) the next best way to get to recovery is to switch the computer off by holding in the power button. If you interrupt it a couple of times before it fully loads it will eventually offer you the recovery options. Just press and hold in the button until it goes off, and repeat 2 or 3 times (doing this while it's still loading before it gets to the picture screen is best).Once you can access the recovery options System Restore (under Troubleshooting) might be the best place to start... this can unwind a config issue to solve the problem.Regards, David"]},{"symptom":"Something is taking up RAM?        Hi!! Im having a problem that something is steadily using up more and more of my computers memory as I use it. I haven't even been using it for more than an hour today before having to restart it because 90%+ is being used on something that I just cannot find.Just now before booting up chrome and posting this I'd restarted my pc, its gone from 18% memory to 30% and is still climbing, I have done nothing but open chrome.When I look through task manager and resource manager nothing is using anything more than it should be. The highest uses are going to windows and discord (about 200,000 kbs each) which as I'm not tech savvy seems normal to me.The service host processes are steadily climbing starting at around 10mbs each and ending up on 100+ each. Is that the issue?I only got the computer about a month ago and up until then it has been fine. It's a gaming pc with 16gb of ram this shouldn't be happening when im not even playing games. Last night there was a driver update and since then my ram is just being consumed by something I cannot find.","solutions":["Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.What can slow down a computer sometimes can be a virus or spyware. If you have an anti virus, do a scan. Also I put you the link of 2 good free and powerful anti-spyware.AdwCleaner : https:\/\/www.malwarebytes.com\/adwcleaner\/Malwarebytes : https:\/\/malwarebytes.com\/We'll start with that, and look at something else afterwards. _________________________________________________ Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thank you for responding!Heres a list of the things I have already done:Disabled CortanaDisabled IP helper serviceDisabled NotificationsRan Malware scans using windows securtiy and also Segurazo (antivirus that came pre-installed on my PC)Uninstalled 2 likely programs (\"chromium\" and avast free antivirus - figured it might be conflicting with other antivirus software)Checked for further windows updates (none found)Checked windows security updates (none found)Checked that PC is defragging (it is) Was advised to disable Superfetch service - Was not listed with the other services nor found in command prompt so I dont think it's there.Restarted PC after every change.Since posting my ram jumped up to 80% before I shut down and unplugged everything to see if that helped. It hasn't. After booting back up ram is still steadily going up again.","What antimalware programs do you use? did you try the ones i said? Because everything suggests that this is the problem.","I used Window Security and Sagurazo Which came preinstalled.I am going to give the ones you suggested a try though, Will update when those are done","Update: Somehow Malwarebytes found nearly 200 suspicious looking things that my other two scans did not and I have gotten rid of them all.RAM is no longer climbing and seems stable again finally.Thank you so much! Really appreciate the help!","Happy for you ! I wish you a happy new year"]},{"symptom":"how to solve error 0x009001        I will be brief.Recently I was unlucky to have my files deleted.But fortunately the Notebook still works.After many attempts effort to solve many of the problems, and then after reset came this error that says “It's an impossible deleted file.”So I decided to resort for the first time. I need Help. Your help so I thank you in advance.","solutions":["Hi Vector. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.So your Reset failed? This is fairly common with corrupted installs since it relies on files already onboard.You may need to create bootable media to Reset or do the gold standard Clean install. The bootable media has it's own drivers, repair and installation files which often work when Windows or the other Repair Mode doesn't.To create Windows 10 Installation Media on another PC install Media Creation Tool and follow the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, on second screen choose Repair Your Computer, then Advanced Troubleshoot Options, then System Restore and Uninstall Updates. If that fails go back to Troubleshoot Options to try a Reset.If that fails choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, click Next to let it create needed partitions and start install - this makes it foolproof.Everything needed to get the best possible Clean Install is here: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... It is a better install than any amount of money can buy and a great learning experience that will make you the master of your PC because you will learn what works best and how to apply it with your own hands. If you have files that aren't backed up you can use the same bootable media to try to rescue your files using these methods:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Unidentified program in Windows 10 startup named \"Program\".        What is this and how to I delete\/disable it?","solutions":["Hi JRB. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Which Startup list are you finding this in? There are four different ones shown in Step 4 of this checklist:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Some of them have more info: In Task Manager Startup list you can Show File Location and it will open the Program File. In msconfig > Services it should show you the manufacturer.But almost none of these are needed except you Antivirus and Sync, so it's usually OK to disable the others. Only you should decide what gets to start with Windows, not some app that you may not even have known you installed.I'd also scour the installed Apps in Settings > Apps > Apps & Features to make sure everything there is only something you want and need. If you have any questions just ask back._________________________ Linked tutorial is from a trusted Microsoft MVP."]},{"symptom":"Office 2010 suddenly not working...        sorry for the cryptic subject, but here goes nothing.i have an Acer desktop (technically, it's a tower!) (Aspire X1420, 4 GB RAM (3.75 available), 1 terrabyte h\/d) with Windows 7 home premium (SP 1, i believe) on it. it came from the store with the 'Office 2010 Starter' software - Office 2010, Word 2010, and Excel 2010 installed on it.  i haven't done much with the 'Office' stuff, but the Excel program is handy for typical 'spreadsheet' stuff.i went to open Excel today, and the 'Click-to-run' application manager popped up and said \"Microsoft Excel Starter 2010 cannot be opened. Try again or repair the product in Control Panel.\"  i can FIND 'Microsoft Excel Starter 2010' under 'programs' in 'Control Panel', but there's no option to 'repair', only 'uninstall' or 'change'.  i can't help thinking it may have something to do with the upcoming year 2020, but i could be wrong.i've tried to update to Windows 10 in the past, but it keeps failing on me (i've never been able to translate the 'error code' into \"end-user\"ese), Acer's website says my hardware won't support Win 10 anyway; i'm not independently wealthy, buying a new (or even new-to-me) with Win 10 isn't really an option.any suggestions?","solutions":["sorry for the cryptic subject, but here goes nothing.i have an Acer desktop (technically, it's a tower!) (Aspire X1420, 4 GB RAM (3.75 available), 1 terrabyte h\/d) with Windows 7 home premium (SP 1, i believe) on it. it came from the store with the 'Office 2010 Starter' software - Office 2010, Word 2010, and Excel 2010 installed on it.  i haven't done much with the 'Office' stuff, but the Excel program is handy for typical 'spreadsheet' stuff.i went to open Excel today, and the 'Click-to-run' application manager popped up and said \"Microsoft Excel Starter 2010 cannot be opened.Try again or repair the product in Control Panel.\"  i can FIND 'Microsoft Excel Starter 2010' under 'programs' in 'Control Panel', but there's no option to 'repair', only 'uninstall' or 'change'.  i can't help thinking it may have somethingto do with the upcoming year 2020, but i could be wrong.i've tried to update to Windows 10 in the past, but it keeps failing on me (i've never been able to translate the 'error code' into \"end-user\"ese),Acer's website says my hardware won't support Win 10 anyway; i'm not independently wealthy, buying a new (or even new-to-me) with Win 10 isn't really an option.any suggestions?1. Not another conspiracy theory :)2. If Acer says it is not suitable for 10; I'd accept that.I'll include information for you to check.This is the link on Acer for your model Aspire X1420: https:\/\/www.acer.com\/ac\/en\/AU\/content\/support-product\/3708?b=1Windows 7 32\/64bit and 8 32\/64bit are supported with Drivers; but not 10Office Starter 2010 was preinstalled by Acer.That was the way you got it; being preinstalled by the computer manufacturerMicrosoft has detailed information on how to uninstall\/reinstall Office Starter 2010 using the installed software.\"Cannot be opened\" error when you start an Office Starter 2010 program.Note: If the error continues to occur, you may have to do a full restore of the computer to reinstall Microsoft Office Starter 2010. We recommend you contact the computer manufacturer to talk about your options before you do this.@@@@@@@@@@@@@@@@@@@@@@@@@You may be interested in using either of these two free Office Suites which are compatible with Windows.Open Office:https:\/\/www.openoffice.org\/Libre Office:https:\/\/www.libreoffice.org\/@@@@@@@@@@@@@@@@@@@@@@@@@When considering an upgrade to 10:First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:Acer - Windows 10 Creators UpdateCheers.","sorry for the cryptic subject, but here goes nothing.i have an Acer desktop (technically, it's a tower!) (Aspire X1420, 4 GB RAM (3.75 available), 1 terrabyte h\/d) with Windows 7 home premium (SP 1, i believe) on it. it came from the store with the 'Office 2010 Starter' software - Office 2010, Word 2010, and Excel 2010 installed on it.  i haven't done much with the 'Office' stuff, but the Excel program is handy for typical 'spreadsheet' stuff.i went to open Excel today, and the 'Click-to-run' application manager popped up and said \"Microsoft Excel Starter 2010 cannot be opened.Try again or repair the product in Control Panel.\"  i can FIND 'Microsoft Excel Starter 2010' under 'programs' in 'Control Panel', but there's no option to 'repair', only 'uninstall' or 'change'.  i can't help thinking it may have somethingto do with the upcoming year 2020, but i could be wrong.i've tried to update to Windows 10 in the past, but it keeps failing on me (i've never been able to translate the 'error code' into \"end-user\"ese),Acer's website says my hardware won't support Win 10 anyway; i'm not independently wealthy, buying a new (or even new-to-me) with Win 10 isn't really an option.any suggestions?1. Not another conspiracy theory :)2. If Acer says it is not suitable for 10; I'd accept that.I'll include information for you to check.This is the link on Acer for your model Aspire X1420: https:\/\/www.acer.com\/ac\/en\/AU\/content\/support-product\/3708?b=1Windows 7 32\/64bit and 8 32\/64bit are supported with Drivers; but not 10Office Starter 2010 was preinstalled by Acer.That was the way you got it; being preinstalled by the computer manufacturerMicrosoft has detailed information on how to uninstall\/reinstall Office Starter 2010 using the installed software.\"Cannot be opened\" error when you start an Office Starter 2010 program.Note: If the error continues to occur, you may have to do a full restore of the computer to reinstall Microsoft Office Starter 2010. We recommend you contact the computer manufacturer to talk about your options before you do this.@@@@@@@@@@@@@@@@@@@@@@@@@You may be interested in using either of these two free Office Suites which are compatible with Windows.Open Office:https:\/\/www.openoffice.org\/Libre Office:https:\/\/www.libreoffice.org\/@@@@@@@@@@@@@@@@@@@@@@@@@When considering an upgrade to 10:First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:Acer - Windows 10 Creators UpdateCheers.good morning sir Bill, thanks for your reply...not really sure i want to 'uninstall' the Office Starter software, for fear of losing it completely (if it gets deleted from my computer, it's kinda hard to re-install, right?)... that being said, i'm going to have a look at the 'openoffice' link you provided...","sorry for the cryptic subject, but here goes nothing.i have an Acer desktop (technically, it's a tower!) (Aspire X1420, 4 GB RAM (3.75 available), 1 terrabyte h\/d) with Windows 7 home premium (SP 1, i believe) on it. it came from the store with the 'Office 2010 Starter' software - Office 2010, Word 2010, and Excel 2010 installed on it.  i haven't done much with the 'Office' stuff, but the Excel program is handy for typical 'spreadsheet' stuff.i went to open Excel today, and the 'Click-to-run' application manager popped up and said \"Microsoft Excel Starter 2010 cannot be opened.Try again or repair the product in Control Panel.\"  i can FIND 'Microsoft Excel Starter 2010' under 'programs' in 'Control Panel', but there's no option to 'repair', only 'uninstall' or 'change'.  i can't help thinking it may have somethingto do with the upcoming year 2020, but i could be wrong.i've tried to update to Windows 10 in the past, but it keeps failing on me (i've never been able to translate the 'error code' into \"end-user\"ese),Acer's website says my hardware won't support Win 10 anyway; i'm not independently wealthy, buying a new (or even new-to-me) with Win 10 isn't really an option.any suggestions?1. Not another conspiracy theory :)2. If Acer says it is not suitable for 10; I'd accept that.I'll include information for you to check.This is the link on Acer for your model Aspire X1420: https:\/\/www.acer.com\/ac\/en\/AU\/content\/support-product\/3708?b=1Windows 7 32\/64bit and 8 32\/64bit are supported with Drivers; but not 10Office Starter 2010 was preinstalled by Acer.That was the way you got it; being preinstalled by the computer manufacturerMicrosoft has detailed information on how to uninstall\/reinstall Office Starter 2010 using the installed software.\"Cannot be opened\" error when you start an Office Starter 2010 program.Note: If the error continues to occur, you may have to do a full restore of the computer to reinstall Microsoft Office Starter 2010. We recommend you contact the computer manufacturer to talk about your options before you do this.@@@@@@@@@@@@@@@@@@@@@@@@@You may be interested in using either of these two free Office Suites which are compatible with Windows.Open Office:https:\/\/www.openoffice.org\/Libre Office:https:\/\/www.libreoffice.org\/@@@@@@@@@@@@@@@@@@@@@@@@@When considering an upgrade to 10:First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:Acer - Windows 10 Creators UpdateCheers.good morning sir Bill, thanks for your reply...not really sure i want to 'uninstall' the Office Starter software, for fear of losing it completely (if it gets deleted from my computer, it's kinda hard to re-install, right?)... that being said, i'm going to have a look at the 'openoffice' link you provided...hi Bill, it's me again...i did the 'uninstall' thing, followed the instructions to the letter, but when i went to re-install it all, i got a \"Click-to-run configuration failure.\" popup on my screen; the software is still on my PC - it all shows up under 'all programs' - but something is haywire somewhere else (it never ends, seems like)... went to the 'OpenOffice.org' site, downloaded and installed their package, haven't tried to use it just yet...","That Microsoft link is presently down.It was up earlier today.The Microsoft fix is not guaranteed to work, that is why I added their other information about Acer.To bypass the problem, that is why I gave you the alternative free Office suites.Good luck with it.","That link is working again.But with 7 support ending who knows what will happen with it.Here is what is there for others:If Word Starter 2010 or Excel Starter 2010 cannot be opened, uninstall and reinstall Microsoft Office Starter 2010:Click Start (or Start > Run in Windows XP).Type appwiz.cpl, and then press Enter.Warning Do not remove Microsoft Office 2010from the list of installed programs. You will need this to reinstall Microsoft Office Starter 2010.Click Microsoft Office Starter 2010, and then click Uninstall (or Remove in Windows XP).Click Yes and follow the instructions to uninstall Office Starter 2010.To reinstall Office Starter 2010, click Start > All Programs > Microsoft Office 2010.Click Use.And then click Open. This will re-install Office Starter 2010.If the error continues to occur, you may have to do a full restore of the computer to reinstall Microsoft Office Starter 2010. We recommend you contact the computer manufacturer to talk about your options before you do this."]},{"symptom":"3d accelerator error        I downloaded windows 10 to my pc and i cant get my world of warcraft game to play. The game downloaded but whenever i hit start i get a error saying 3d accelerator isnt compatible or something like that. I tried updating nvidia, it has the microsoft basic adapter and far as i know and it says the 3d accelerator is working but its not. Anybody have any ideas? Should i jus go in and uninstall the driver, card, and world of warcraft and jus try to redownload everything? Oh yeah and before i put windows 10 on, the computer was on linux if maybe that is the problem..","solutions":["What is the hardware spec or make and model. If you have a Nvidia graphics you should go to their website and download the drivers that match your model.Basic MS adaptor won't run any games it is just used to allow you to use a basic screen.","Hi Newfound.20 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that might help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/appuals.com\/fix-world-of-warcraft-was-u...I hope this helps. Feel free to ask back any questions and let me know how it goes. I will keep working with you until it's resolved.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","amd sempron(tm)dualcore processor 2200 and Nvidia nforce networking controller. It isnt downloading a different adapter besides that basic one. Is there another i should try or do i need a new video card?","You don't list a graphics adaptor, are you using built graphics on the motherboard. What is the make and model of motherboard if you are.","Adaptor type is: microsoft basic display adapter. Under that the adapter information says chip type: nvidiaDac type: build 061010.3Bios information: MCP61-mpc61-85Motherboard..Manufacturer: OEM_MBProduct: IVY8Serial number: MS1C88R73603399Version: 2.0"]},{"symptom":"Windows 7 activation keys        Can you tell me why my produce key changed after I activated win 7 and why I'm now being told the original key is not a win 7 key.  I originally bought 5 retail boxes right after window 7 came out.  I installed them on all 5 of my computers labeled each one with the key it was activated with and they all activated and have reactived until now.  I personally think its to force people to move to win 10. I went and downloaded a key finder and all the keys are not what I put in them.  Why don't you have a section for activation problems.","solutions":["Can you tell me why my produce key changed after I activated win 7 and why I'm now being told the original key is not a win 7 key.  I originally bought 5 retail boxes right after window 7 came out.  I installed them on all 5 of my computers labeled each one with the key it was activated with and they all activated and have reactived until now.  I personally think its to force people to move to win 10. I went and downloaded a key finder and all the keys are not what I put in them.  Why don't you have a section for activation problems. There is a section for Activation.Your question is now in it.@@@@@@@@@@@@@@@@@@@@@@@@@I don't know what Key Finder program you used.If installed and activated and a Retail or OEM system Builders license and you have lost the product key that came with the purchase use these free programs:http:\/\/www.belarc.com\/free_download.htmlhttps:\/\/www.magicaljellybean.com\/keyfinder\/@@@@@@@@@@@@@@@@@@@@@The Product Key consists of 25 digits, divided into 5 groups of 5 digits and the layout looks like this:xxxxx-xxxxx-xxxxx-xxxxx-xxxxxThe 24 used are:2346789BCDFGHJKMPQRTVWXYThe 12 unused are:015AEILNOSUZ@@@@@@@@@@@@@@@@@@@@@","I've used both jellybean gives me a key.  The other does not give me anything.","I've used both jellybean gives me a key.  The other does not give me anything.I suggest that you contact Microsoft to sort it out:Contact support         http:\/\/windows.microsoft.com\/en-us\/windows\/contact-supportAlso: https:\/\/partner.support.services.microsoft.com\/en-au\/contact\/menu\/software\/windows\/setup\/"]},{"symptom":"Photo App        My photos from my Iphone automatically upload to the Windows 10 photo viewer app.  When I want to order photo books or have prints made via Winkflash or other services, I cannot directly upload to them. The time I spent putting them into folders was a waste of time.  I have to copy and save each one to my files.  Is there a way to do this.  ","solutions":["Hey Patricia, Evan here an independent adviser here to assist. The quickest way to do so would be to connect your phone to your computer with a cable and import the files then upload them to your website of choice...Hope this helps!"]},{"symptom":"1903 failed to update and now it's telling me that 1909 is available        Version 1903 failed with error 0x80240034 and now I have 1909 to update.  Where do I go to try to download 1903 again?","solutions":["Hi Jerry. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I would manually upgrade to the latest version 1909 by opening the Media Creation Tool from this link:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m..., choose Download Tool Now, then open the tool and choose Upgrade This PC Now. This saves your files, apps and most settings in place, is the most stable method to change versions, brings your Updates current, resolves most problems. If any problems report back the verbatim error and number, then continue with these steps for overcoming Version Upgrade problems:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If the Version has problems I will work with you to try to resolve them. If the problems are unfixable for now, you have ten days to roll it back in Recovery settings. You can then hide it so it doesn't try to reinstall following this same method:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... Most problems are resolved by doing this gold standard Clean Install which should get you past all difficulties as it has millions of others who have followed the steps in this link and never come back to report another problem:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... . So read it over and see if its something you want to learn to do.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to rate my post, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Ugee Tablet drivers        So i recently got a Ugee graphics tablet model M708, and when I installed the drivers, I followed the instructions on the manual, but when I tried to open it, it wouldn't open, and in the hidden icons menu whenever I hover the mouse over the icon of the driver, it would disappear. I unplugged the tablet from my laptop to see if it would give me an error, it did but when I plugged it back in, it would give me an error that it had stopped working. I have tried everything, reinstalling it multiple times, and looking it up online, but I had no luck. Maybe somebody could help me?","solutions":[]},{"symptom":"wind 7 embedded standard        i need guidance on upgrading from wind 7 embedded standard to wind 10 enterprise on my handheld device ","solutions":["Wrong Community for your question.We are mainly for home users.Repost at the link:Get answers in the Windows Embedded forumsCheers."]},{"symptom":"Windows 10 \"S\" mode        I have a Lenovo tablet that I want to download and install some tools from The Lenovo website. The problem here is that \"S\" mode won't let me get anything from outside The Windows Store. I know I can't go back to \"S\" mode once I switch. The question here -  is the switch out of \"S\" mode a bad idea? I don't believe it would be but I'm not sure. I could use some help here.  THANKS   :o)","solutions":["Hi Tornado,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.If you use traditional win32 apps, switching out of S mode is recommended. You can however, in normal mode restrict apps to be installed from only Store however as well. Sort of S mode, in normal mode.https:\/\/www.tenforums.com\/tutorials\/78213-choos...You can also go back to S mode as well after switching--It requires a Factory Data reset.Hope that helps. Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads."]},{"symptom":"EDISHA IS NOT WORK        The request was aborted: Could not create SSL\/TLS secure channel.","solutions":["Hi there, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.Are you attempting to access this website? https:\/\/edisha.gov.in\/ If so, it looks like the certificate is correct - can you confirm which web browser you are using? It looks to be loading fine in Google Chrome for me.Also, please check that your computer's date and time are correct, as this can often lead to SSL errors.I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","not work","Hi PankajKumarDL and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Press the Windows key and type in CMD, right-click and run as an administrator. ipconfig \/release <Press Enter> ipconfig \/renew <Press Enter> ipconfig \/flushdns <Press Enter> ipconfig \/registerdns <Press Enter> nbtstat -rr <Press Enter> netsh int ip reset all <Press Enter> netsh winsock reset <Press Enter> Restart PC. I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"Your Phone displays a message that does not exist on my phone.        I just set up Your Phone to connect to my Pixel 3. On the Messages tab Your Phone shows a message dated almost three weeks ago that does not exist on my phone and does not appear in Google Messages From the Web. How can I remove this false message from Your Phone? Thanks.","solutions":[]},{"symptom":"Where is my blue tooth icon        my blue tooth icon is missingwhere to find and use","solutions":["See if this assists you.You obtain your Bluetooth software\/drivers, IF your machine is designed to use Bluetooth from your manufacturer's website if not installed by default.And in the Charms Bar > Settings > Change PC Settings > PC and Devices > Bluetooth > turn it on.Connect a Bluetooth devicehttp:\/\/windows.microsoft.com\/en-AU\/windows-8\/why-isnt-windows-finding-deviceCheers."]},{"symptom":"Remote Desktop        What version of Windows 10 do I need to connect remotely to my desktop at work?","solutions":["Hi, Windows Remote Desktop is available on Windows 10 Pro. It was removed from the Home version along with a couple of other features with the release of Windows 10.I hope that helps."]},{"symptom":"Reset to factory        I have a new computer with Windows 10. During initial set up I entered an email to sign in with Microsoft. Password is invalid, email is inactive and I can't get beyond the screen asking for password.  Since nothing has been installed, I want to reset to factory settings. All I can find is instructions after signing in. Any help would be appreciated. ","solutions":["Hi, You can reset to factory settings from advanced startup. This would normally involve entering from the lock screen or settings after booting into Windows. If the screen you can get to has a power button you can hold shift while choosing to restart. Otherwise if you have another PC available you can make a boot disk. Boot from that on your PC and use that to reinstall Windows.I hope that helps."]},{"symptom":"Dell optiplex        My internet stopped ran troubleshooter no luck","solutions":["Hello timmaddox, I'm Didi, an independent advisor. Can you please give more details about your problem ? Are you connected via WiFi or via an ethernet cable ? Did you do something special before losing your internet connection ? Do you have any error message ? Regards, Didi"]}]}