{"windows":[{"symptom":"Mobile hotspot        After uninstalling ubuntu from the dual boot, I reset the windows and now, switching on my pc hotspot doesn't let my phone get internet access,though it shows connected.What should I do?","solutions":["Does the phone have the proper code and password set up?","Sorry but I didn't get you? Do you mean I have some kind of security to unlock my phone?? Kind of new to the computer world","No.  It is the paring process.  The hot spot has setup code that must be used.","Yes,I have setup password to access the hot spot. I am using LAN from my college to create hotspot.","Your problem may be handled by you college computer department.","No sir, it was working well before...all I had to do was plug in the LAN cable to my laptop from the LAN port in my room and turn on the hotspot and it would work.But after the reset of windows,it doesn't anymore","Hi Saswat842,try to enable \/ disable ICS following this procedure: Go to network connections, access the properties of the network adapter connected to the internet> Sharing tab, enable Internet Connection Sharing (ICS) by selecting the checkbox: Allow other users on the network ... and confirm by pressing OK. (Skip this step if ICS is already enabled). Return to the Sharing tab, disable ICS and confirm by pressing OK. Then go to Settings> Network and Internet and enable the mobile hotspot, then try.Note: When using the Windows Integrated Hotspot Mobile feature, the check boxes on the Sharing tab must remain unchecked, otherwise the Mobile Hotspot will not work. If it does not solve, try to restore the network: Settings> Network and internet> Status, click on Reset network on the side and follow the instructions.Otherwise, try to temporarily uninstall any third-party Firewall \/ Antivirus or VPN software and try again.","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please reset the Wireless Network Adapter driver and check. Go to Device Manager Locate and double tap on Network Adapter Right click on the Wireless driver and select Uninstall. (Do Not click on any check box)Restart the PC."]},{"symptom":"My Post Are Not Showing Up        I posted yesterday and again today and they are not showing up.  This is what that hacker does to me. Like the hacker thinks he has a right to victimize me deletes the post, gets his satisfaction on because he has mad me a victim again.","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.If you suspect your Microsoft account has been hacked you should first change your password to prevent anyone else getting access.Regards, David","Thanks I just did.  Now I guess I have to post this a third time.","No need to post again - this post is still visible!","All your threads are visible. Some have been merged. No need to create multiple threads on same topics.I imagine soon these threads of yours will be merged as well: How Do I Find And Remove This Malicious Software From My Windows 10 Last reply 7 hours 21 minutes ago by Andrew E. |Created 8 hours 50 minutes ago by Vickyl71 How Do I Find And Remove This Malicious Software From My Windows 10 Last reply 7 hours 54 minutes ago by Greg Carmack - Windows MVP 2010-20 |Created January 11, 2020 by Vickyl71 ============ When you click on your blue profile name - Vickyl71  - , you will be brought to your profile page where you'll see all threads listed which you created or participated in.FAQ How do I find my profile? What's on my profile?","For your information:A moderator locked this thread of yours:How Do I Find And Remove This Malicious Software From My Windows 10 Last reply 6 hours 52 minutes ago by Vickyl71 |Created January 12, 2020 by Vickyl71========================================= Your other current thread is this one:How Do I Find And Remove This Malicious Software From My Windows 10 Last reply 6 hours 38 minutes ago by Greg Carmack - Windows MVP 2010-20 |Created January 11, 2020 by Vickyl71"]},{"symptom":"Unable to use Microphone on the computer        I have bought a microphone, but if i open volume mixer, or any other program, i dont see my microphone. I tried other microphones but they also don't work. I want to make video's but my mic doesn't work. please help me out.***Modified title from: How to add microphone level to volume mixer?***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are unable to use Microphone on your computer. I’ll certainly assist you with this issue. However, please let us know: Were you able to use Microphone on your computer earlier?What is the make and model of the Microphone that you are using? Ideally, if we add a new Microphone to the computer, we will need to go through the setup process to use it, let me help you with the steps. I would suggest you to refer the article onHow to set up and test microphones in Windows 10 and setup the Microphone. Once the Microphone is setup, you can start using it.  If you still face issues, I would suggest you to refer the article on Fix microphone problems and see if that helps. Let us know the results, we will be glad to help you further. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Error: 0xC004C008 when trying to activate Windows after hardware change        At the start of the new year I upgraded my PC. At that time I had to deal with other activation issues, eventually solved by Microsoft support services generating a new product key for me. I thought that would solve things for good, and after my new motherboard suddenly required replacement again I assumed the key I now had in addition to activation tied to my MS account would let me activate Win10 with no issues. I was very wrong, and I am veryVERY frustrated.Here's some screenshots of the troubleshooting process:As you can see, I DO have a product key, and my previous computerIS listed in the troubleshooter, except the process just doesn't work.So yeah, I'm annoyed. I don't want to have to spend an hour on the phone and let some stranger connect to my PC remotely again. Getting solutions to these issues is like pulling teeth, I can't stand how convoluted it all is, and the condescending \"...purchasing a genuine copy of Windows.\" is extremely insulting when this issue shouldn't even be happening.***Original title: Win10 Activation Failure After Hardware Change***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues with activating Windows 10 on your PC after a hardware change, and I certainly appreciate your efforts in trying to resolve the issue by following certain troubleshooting steps. The error 0xC004C008 means that the product key has already been used on a different PC. For more information refer the articleGet help with Windows activation errors Since you have already tried using the Activation troubleshooter I would suggest you to try activating the copy of Windows using Phone Activation. Press Windows key + R. This will openRun. Alternatively, you can go to Start and search for Run.In Run dialog box, type SLUI 04 and hitEnter.Follow the on-screen instructions. However, it would be great if you can get in touch with our Technical Support team using theChat or Call channel for further assistance with the issue as they have the right tools and access to assist you better with the query. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Xbox One Controller not connecting via Bluetooth after being plugged in with USB        I have a Xbox One Wireless Controller without the PC adapter so I use Bluetooth to connect directly to my PC.  After charging the controller through one of my PC's USB ports while the PC is on, once the USB to the controller is disconnected it can no longer connect via Bluetooth.  It will still work while the USB is connected but won't work via bluetooth.Trying to un-pair the controller or uninstall it through devices or device manager often doesn't uninstall.  The most successful method of getting it to work again is to un-pair in the Bluetooth devices and uninstall in both the devices and printers and device manger, then restarting the PC and attempting to pair via Bluetooth again.  This works most of the time but occasionally won't work.I assume this problem is related to Windows or driver as the device still works perfectly when it is connected via USB. It is like it is flipping a switch to say that it is USB only when it detects the USB connection.A solution to this problem would be appreciated as I only have 1 USB cable long enough to reach my gaming position and if my headset goes flat while my controller is charging, I have to spend 20+ minutes trying to get the controller to work again via Bluetooth.Thanks.","solutions":["Hi , I'm David, thanks for participating in the Microsoft Community. I'll do my best to help today.Regards Wayne_Carr, Please follow the instructions to Connect and troubleshoot Bluetooth on your Xbox One wireless controller.https:\/\/support.xbox.com\/en-US\/xbox-on-windows\/...Best Regards, David.","Do you guys actually read the posts and the suggestions that you provide?  I stated almost everything that is in that link in my original post, including the steps that make it work again.The problem is that I have to do it every time that I need to plug the controller in via USB while the PC is on.  There is obviously a problem with the way that Windows controls the device, it disables the Bluetooth connection and doesn't re-enable it once it is unplugged from USB.I am looking for a way to not have to spend 20 minutes troubleshooting this every time I need to charge it.","Hi Wayne My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.What is the exact make and model? Open Start, type: system information Hit Enter Click System summary Look in the right pane Copy the system sku info into reply here. See example: https:\/\/imgur.com\/qzektpAIf its custom built, what is the make and model of your motherboard? It is possible you might need to update your BIOS and chipset drivers. Which version of Windows 10 is currently installed? See how to verify: https:\/\/answers.microsoft.com\/en-us\/windows\/wik...In the mean time, try disabling fast startup: Disable Fast Startup, then try again. Press Windows key + X Click Power options Click Additional power settings under Related settings Click Choose what the power button does Click Change settings that are currently unavailable Uncheck 'Turn on fast startup (recommended) Click Save changes. Click Restart now and see if it works. If it does not help, to isolate if this is a user profile issue. Could you confirm if this also happens in the default Administrator account? Open Start Type: cmd Right click CMD Click Run as administrator At the command prompt, type: net user administrator \/active:yes Hit Enter Close command prompt, restart, then try signing into the Administrator account. The default Administrator password should be blank. Try setting up the device again.","HI Andre, I am not sure how any of what you said relates to how Windows handles a Bluetooth device being plugged in via USB and how Windows handles it once it is disconnected.As I clearly stated, restarting the system is one of the steps that helps resolve the issue of the controller being re-paired, the problem is that I heavily multi-task. I often have multiple programs running with projects in different stages, when I take a break to play some games, restarting the computer so I can use the controller again is a major inconvenience. The problem has existed on 2 different custom systems both running Windows 10System 1Intel 4770kAsus Sabertooth Z97, 2601 BiosWindows 10, latest build as of April 2019System 2Intel 9600kGigabyte Z390 Gaming, F7 BiosWindows 10, 1809 17763.737","I have this exact same problem and, as of yet, I haven't found a solution for it. Pairing my XBox One controller works fine and everything is smooth. The moment that it's plugged into a machine to act as a wired controller is seems to forget that it was ever wireless in the first place. My son will often use my controller with the cable on his machine and when I try to reconnect it to my machine, even though it was never paired to his, it won't connect. The same thing will happen if I connect it to my machine and then unplug it and try to go back to Bluetooth. It just won't connect. What I end up having to do is go to setting -> devices and tell it to forget the controller. I then re-pair the controller and everything works as it should. I already know that when I get the controller back from my son that I'm going to have to do this (though every time I try to link it first even as I'm opening settings just out of blind foolish optimism and hope). When I have to charge it while I'm still playing I have a spare USB brick that came with an old phone that I plug the controller into and then into a wall outlet. This doesn't seem to have any effect on the function of the controller. If you search around the net you'll find that this is an old and known issue with these controller and so far I haven't found any explanation for it. It has nothing to do with your hardware or BIOS or the Windows version since it was doing this to me on 1709 and is still doing the same thing on 1903. It seems that the Bluetooth implementation for these controllers is just a little wonky.","I have this exact same problem and, as of yet, I haven't found a solution for it. Pairing my XBox One controller works fine and everything is smooth. The moment that it's plugged into a machine to act as a wired controller is seems to forget that it was ever wireless in the first place. My son will often use my controller with the cable on his machine and when I try to reconnect it to my machine, even though it was never paired to his, it won't connect. The same thing will happen if I connect it to my machine and then unplug it and try to go back to Bluetooth. It just won't connect. What I end up having to do is go to setting -> devices and tell it to forget the controller. I then re-pair the controller and everything works as it should. I already know that when I get the controller back from my son that I'm going to have to do this (though every time I try to link it first even as I'm opening settings just out of blind foolish optimism and hope). When I have to charge it while I'm still playing I have a spare USB brick that came with an old phone that I plug the controller into and then into a wall outlet. This doesn't seem to have any effect on the function of the controller. If you search around the net you'll find that this is an old and known issue with these controller and so far I haven't found any explanation for it. It has nothing to do with your hardware or BIOS or the Windows version since it was doing this to me on 1709 and is still doing the same thing on 1903. It seems that the Bluetooth implementation for these controllers is just a little wonky.Thank you for confirming the problem and providing details of the likely cause, lazy coding of the Firmware for the controller.  I had tried to search for the problem, but never found the right search terms.","This is exactly what is happening to me as well. It's pretty dumb that this was seemingly completely missed, or ignored... I just spent $30 on the official MS battery pack and now you're basically telling me I can't charge it without having to re-pair my controller every time. That's completely unacceptable.","I have same problem, controller just won't reconnect after charging with my PC so i have to pair it again every time. Windows 10 1903, online support couldn't help at all","Same problem here","I have a Xbox One Wireless Controller without the PC adapter so I use Bluetooth to connect directly to my PC.  After charging the controller through one of my PC's USB ports while the PC is on, once the USB to the controller is disconnected it can no longer connect via Bluetooth.  It will still work while the USB is connected but won't work via bluetooth.Trying to un-pair the controller or uninstall it through devices or device manager often doesn't uninstall.  The most successful method of getting it to work again is to un-pair in the Bluetooth devices and uninstall in both the devices and printers and device manger, then restarting the PC and attempting to pair via Bluetooth again.  This works most of the time but occasionally won't work.I assume this problem is related to Windows or driver as the device still works perfectly when it is connected via USB. It is like it is flipping a switch to say that it is USB only when it detects the USB connection.A solution to this problem would be appreciated as I only have 1 USB cable long enough to reach my gaming position and if my headset goes flat while my controller is charging, I have to spend 20+ minutes trying to get the controller to work again via Bluetooth.Thanks.I have same problem"]},{"symptom":"PC ran into a problem after installing a software        hi theremy pc is getting so weird. I downloaded a program and installed it. However, when I open it, after some time some saying with a QR code showed up. I just followed a few steps and my pc began automatic repairs. Then it went back to normal. However, some very recently installed softwares were deleted(it was okay though). Chrome didn't respond my clicks, sometimes it felt like something was making it hard for my pc to handle easy operations. If there is something you can recommend, please let me know.***Modified title from: My pc is acting so weird after automatic repairs when my pc ran into problem ***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you received a QR code screen after installing a program on your computer. I’ll certainly help you with the issue. However, please let us know: What was the error message you received on the screen?May I know the software that you installed on the computer?Which build version of Windows is installed on the computer?What is the make and model of the computer? As per the description, it seems that you have received a Blue Screen error. A blue screen error (also called a stop error) can occur if a problem causes your device to shut down or restart unexpectedly. You might see a blue screen with a message that your device ran into a problem and needs to restart. If you receive the error again, I would suggest you to share the dump files so that we can analyze them and get to the root cause of the issue. To share the files Navigate toC:\\Windows\\Minidump, upload the files to OneDrive and share the OneDrive link. For troubleshooting Blue Screen error, see Troubleshoot blue screen errors.  You might want to boot the computer into clean boot and check if the issue persists. Performing a clean boot will start the computer with minimal set of drivers and programs, to determine whether a background program is causing the issue. Some of the Startup programs will not load after performing a clean boot on the computer. However, that functionality will return when you reset the computer to start normally after finishing the troubleshooting. To perform a clean boot on the computer refer to the article How to perform a clean boot in Windows.  If performing a clean boot fixes the issue then, please refer to the sectionHow to determine what is causing the problem after you do a clean boot to check which program is causing the issue.  Note: Please refer the section Reset the computer to start normally after clean boot troubleshootingto boot the computer in to normal mode after troubleshooting. You may also want to try the troubleshooting steps mentioned in the articleTips to improve PC performance in Windows 10. You can also refer the article on Make Chrome run better.  Let us know how it goes. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"can cortana be used to dictate text into  Microsoft Word?        can cortana be used to dictate text into  Microsoft Word?I have a dell laptop with windows 10, Cortana seems to be alive and working, if I ask about dictating text into word, she finds web pages related to that subject, none of which have helped so far.Cortana can apparently understand my speech, but does not understand I want to dictate into MS word right now.Any comments appreciatedThanks","solutions":["Hi,Thank you for posting your query on Microsoft Community.I appreciate your interest in Windows 10.We sincerely regret for the inconvenience caused.Unfortunately Cortana does not have the capability to understand that what you want to dictate in Microsoft word.Cortana only search for the information that is available in the system.Please let us know if you need further assistance.Thank you.","This would seem to be an easy connection to make. Getting  your speech recognition program to get Cortana to open a word doc should be a snooze.-By the way - voice recognition through Cortana seems to be better than through the speech recognition program....","I agree. This would be a very powerful feature of Word and Cortana.","Will Microsoft ever consider the option of connecting Cortana with its word applications?","I agree with this person....Cortana is okay at sending us to search features, but why cant Cortana do things for us as the original person asked.  I think Cortana would be a  better benefit if she could do things for us other than sending us to a search page. Can you fix  Cortana like that?","Why do Microsoft always skirt around the question rather than giving a simple direct answer.  I am using win10 and word2016.  How do I dictate into word using Cortana?","This would make an awesome update to Cortana. It's only the logical next step.","I just called Microsoft and was told by \"Sean\" that I can use Cortana to type into Word.  Apparently not true.  Perhaps better training for your techs?","Not defending anyone, but..Reasonable consideration and expectations needs to be taken when attempting any new functionality.It's possible (loosely used) to suspect the fellow that was talked to (MS Tech rep) does have the functionality at his workstation, but is unaware of the process or processes behind enabling that feature. I agree with \"darkurious\" post above in that the features cross application support would be a very nice addition. For all I know, it is already been worked on- but not ready for release. It fun to guess at the possibilities, yes? To consider the interoperability of Cortana i.e.- Word and opening, closing functions of other software's present.. To believe this does not require a fair amount of setup would imply there exists an AI of sorts. It must be present and understanding what action is tied to verbiage input given. I'm hesitant to believe it's within the 'normal' home user price range. I'm thinking that may be just a little down the road at this time. A similar product (Voice -->action input) is a software called Voice attack (one of many this type). That can perform actions for you( key strokes), once set up and defined. If dictation, speech recognition, and action voice responsiveness were introduced in MSoft OS platforms, that would just tickle me to a new shade of <insert color here>.Have a great day, ","you can always use the Windows 10 narrator but it dose take a little training :) I often use it for a bit of fun.. it sound better than the windows7 vertion too so don't be put off "]},{"symptom":"I cannot install Minecraft Windows 10 Master collection        Instead the previously installed Starter version will always open. I have been trying to follow the instructions given on this site (running as administrator and deleting the previously installed version by using the tool), but it does not help.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand the difficulties you are facing while installing the Minecraft Windows 10 Master collection on your PC. In order to get clarity and to assist you accordingly, please reply with the answers to the questions below. What is the Windows 10 version and Build installed? (Typewinver in Windows search\/Run command)What is the error message\/code you are getting while installing it? However, we would suggest you to perform the steps as mentioned in this article:Fix problems with apps from Microsoft Store Let us know how it goes. If issue persists, please let us know and we will certainly help you further. Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"Redeem code for Minecraft        Hi, I've been trying to redeem my gift code for a while so that I can get the bedrock edition because I install the wrong version (Java) and it is saying I have to put in a code? Of which I am not receiving. Help please I don't know what to do anymore! Thanks for your time!***Modified title from: Redeem Code***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are not receiving a code to redeem the Minecraft Bedrock edition. We would like to know the place of purchase for Minecraft. If you have purchased Minecraft from Microsoft Store, you can go the order history page in your Microsoft account and you will be able to find the redeem code. Refer the article onView your Microsoft Store order history.  For more information on redeeming code, see Redeem a gift card or code to your Microsoft account. If you still face issues and purchased Minecraft from Microsoft Store, I suggest you to get in touch with theMicrosoft Store support team and they will be able to assist you appropriately. However, if you have purchased the game from Mojang, I would suggest you to contact the Minecraft team bysubmitting a request. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Application Fails after Xbox Game Pass PC Beta        This Application works fine after a clean install of windows when i install a game on Xbox game pass it breaks the application and i can no longer use it to Tweak my laptops settings. anyone have any idea where to start? getting alittle tired of clean installs to get this running Application ErrorFaulting application name: Dragon Center.exe, version: 2.6.1912.2601, time stamp: 0x5e046847Faulting module name: KERNELBASE.dll, version: 10.0.18362.535, time stamp: 0x50cc8d5aException code: 0xe0434352Fault offset: 0x000000000003a839Faulting process id: 0x51ecFaulting application start time: 0x01d5c9bc55556570Faulting application path: C:\\Program Files (x86)\\MSI\\Dragon Center\\Dragon Center.exeFaulting module path: C:\\Windows\\System32\\KERNELBASE.dllReport Id: 21877260-62a6-4783-b914-72f909d632c8Faulting package full name: Faulting package-relative application ID: .Net Runtime ErrorApplication: Dragon Center.exeFramework Version: v4.0.30319Description: The process was terminated due to an unhandled exception.Exception Info: System.InvalidOperationException   at System.Windows.FrameworkElement.ChangeLogicalParent(System.Windows.DependencyObject)   at System.Windows.FrameworkElement.AddLogicalChild(System.Object)   at System.Windows.Controls.UIElementCollection.AddInternal(System.Windows.UIElement)   at Dragon_Center.Controls.GameOn.GameOn_UC.loadGameUI()   at Dragon_Center.Controls.GameOn.GameOn_UC..ctor()Exception Info: System.Windows.Markup.XamlParseException   at System.Windows.Markup.XamlReader.RewrapException(System.Exception, System.Xaml.IXamlLineInfo, System.Uri)   at System.Windows.Markup.WpfXamlLoader.Load(System.Xaml.XamlReader, System.Xaml.IXamlObjectWriterFactory, Boolean, System.Object, System.Xaml.XamlObjectWriterSettings, System.Uri)   at System.Windows.Markup.WpfXamlLoader.LoadBaml(System.Xaml.XamlReader, Boolean, System.Object, System.Xaml.Permissions.XamlAccessLevel, System.Uri)   at System.Windows.Markup.XamlReader.LoadBaml(System.IO.Stream, System.Windows.Markup.ParserContext, System.Object, Boolean)   at System.Windows.Application.LoadBamlStreamWithSyncInfo(System.IO.Stream, System.Windows.Markup.ParserContext)   at System.Windows.Application.DoStartup()   at System.Windows.Application.<.ctor>b__1_0(System.Object)   at System.Windows.Threading.ExceptionWrapper.InternalRealCall(System.Delegate, System.Object, Int32)   at System.Windows.Threading.ExceptionWrapper.TryCatchWhen(System.Object, System.Delegate, System.Object, Int32, System.Delegate)   at System.Windows.Threading.DispatcherOperation.InvokeImpl()   at MS.Internal.CulturePreservingExecutionContext.CallbackWrapper(System.Object)   at System.Threading.ExecutionContext.RunInternal(System.Threading.ExecutionContext, System.Threading.ContextCallback, System.Object, Boolean)   at System.Threading.ExecutionContext.Run(System.Threading.ExecutionContext, System.Threading.ContextCallback, System.Object, Boolean)   at System.Threading.ExecutionContext.Run(System.Threading.ExecutionContext, System.Threading.ContextCallback, System.Object)   at MS.Internal.CulturePreservingExecutionContext.Run(MS.Internal.CulturePreservingExecutionContext, System.Threading.ContextCallback, System.Object)   at System.Windows.Threading.DispatcherOperation.Invoke()   at System.Windows.Threading.Dispatcher.ProcessQueue()   at System.Windows.Threading.Dispatcher.WndProcHook(IntPtr, Int32, IntPtr, IntPtr, Boolean ByRef)   at MS.Win32.HwndWrapper.WndProc(IntPtr, Int32, IntPtr, IntPtr, Boolean ByRef)   at MS.Win32.HwndSubclass.DispatcherCallbackOperation(System.Object)   at System.Windows.Threading.ExceptionWrapper.InternalRealCall(System.Delegate, System.Object, Int32)   at System.Windows.Threading.ExceptionWrapper.TryCatchWhen(System.Object, System.Delegate, System.Object, Int32, System.Delegate)   at System.Windows.Threading.Dispatcher.LegacyInvokeImpl(System.Windows.Threading.DispatcherPriority, System.TimeSpan, System.Delegate, System.Object, Int32)   at MS.Win32.HwndSubclass.SubclassWndProc(IntPtr, Int32, IntPtr, IntPtr)   at MS.Win32.UnsafeNativeMethods.DispatchMessage(System.Windows.Interop.MSG ByRef)   at System.Windows.Threading.Dispatcher.PushFrameImpl(System.Windows.Threading.DispatcherFrame)   at System.Windows.Application.RunDispatcher(System.Object)   at System.Windows.Application.RunInternal(System.Windows.Window)   at Dragon_Center.App.Main()","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. If you are able to log in to the PC please perform the following steps: Type Powershell at Start Menu and when it appears please right click on it and select Run as Administrator.Copy and paste the following command and wait till it executes the command successfully.Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register “$($_.InstallLocation)\\AppXManifest.xml”}Restart the PC. Then check if you can access the troubled Application."]},{"symptom":"Windows 10 Airplane mode automatically switching on and off (by itself)?        Right off the bat, I would like to say that I have already solved my problem.  I wanted to post my answer to this thread: https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-networking-winpc\/airplane-mode-turning-on-off-by-itself\/9046f4dc-a118-411c-8a13-d8f5853e2082#  but unfortunately it has been locked.If creating a new thread simply to answer your question is against community rules, please suggest the best way for me to get my solution out there.I just couldn't bring myself to walk away from this problem and possibly strand somebody else who could potentially be helped by my solution.Anyway, if I I'm allowed to, I'll post my solution in the answers section and mark it as the accepted answer.","solutions":["I can't say whether this will help you or not, but I hope it does.Also, I can't take credit for knowing how to do this, because I actually read this somewhere else; I just can't remember where.Oh, and one more thing.  My computer initially worked fine after upgrading to Windows 10, but then stopped working after I updated the Operating System and some of the drivers.Open the device manager (right click on the Windows menu icon then select Device Manager):Under your computer's name, find and open the Human Interface Devices tab, and disable the Airplane Mode Switch:"]},{"symptom":"Facing issues with BSOD on PC        Hello, I'm posting there because, since I got my new computer (10 months), I've got A LOT (like approximately 2 per day) of different BSODs that I tried to fix by myself looking everywhere on the web (including here) but any of the things I did changed something (actually almost any, I clean installed windows 10 and it reduced a little bit the number of error and how often they occur). My computer works with Windows 10 Pro, and here are my specs and a link to the only crash dumps I found : Specs :CPU : AMD Ryzen 3 1300X Quad-Core ProcessorGPU : AMD Radeon RX 570 8 GB16 GB RAMCrash Dumps : https:\/\/drive.google.com\/open?id=19TjTUKDl0wZcOVad_XFqEw6bh5q2l1KX***Original title: A lot of different BSODs***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing Blue Screen of Death issues on your PC. For further clarities on this issue, please respond to the questions below: Which build version of Windows 10 are you using currently?What is the make and model of the motherboard?How many RAM sticks are you using?When exactly do you receive the Blue Screens? Refer the article Which version of Windows operating system am I running? Based on the dump files you have shared, the file ntkrnlmp.exe is causing the BSOD on your PC. You may want to refer theTroubleshoot blue screen errors and see if that helps. Meanwhile, I would suggest you to follow the suggestions mentioned below and see if that helps. Method 1: Try booting the PC into Safe Mode and see if the PC crashes. Refer the article Start your PC in safe mode in Windows 10 If the PC is not crashing in Safe Mode, then try booting the PC in Clean Boot and see if the PC crashes while playing PUBG. Refer the articleHow to perform a clean boot in Windows Performing a clean boot will start the computer with minimal set of drivers and programs, to determine whether a background program is causing the issue. Some of the Startup programs will not load after performing a clean boot on the computer. However, that functionality will return when you reset the computer to start normally after finishing the troubleshooting. If the PC doesn’t crash after performing Clean Boot, then please refer the sectionHow to determine what is causing the problem after you do a clean boot to identify the root cause of the issue. Note: Please refer the section Reset the computer to start normally after clean boot troubleshooting to boot the computer in to normal mode after troubleshooting Method 2: Run Windows Memory Diagnostic tool to check for RAM errors. Press Windows + S keys together to openSearch.Now type Memory and click on Windows Memory Diagnostic.Click on Restart now and check for problems.Follow the on screen instructions Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"XBox 360 HD-DVD Drive & Windows 10        Hi,I have an XBox 360 HD-DVD Drive that i want to use to view my HD-DVD's in Windows 10.I have installed it and it reads standard DVD's and plays them. But it does not recognise any HD-DVD's...Im at a loss why it doesn't even recognise the disc let alone play it?Any ideas???Cheers,Josh","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Did you try any other HD-DVD? Did you try the play the HD-DVD on VLC Media player? Windows Media Player may not have the codec to play the HD-DVD format."]},{"symptom":"Downloading In Windows 7        I used to be able to select where I wanted a downloaded file to be stored.  Now, it is automatically dumping everything into a generic download file which I HATE.  How do I get it back to asking me where I want the downloaded file to be put?ThanksJana  :)","solutions":[]},{"symptom":"Is this really Microsoft?        Virus and Threat Protection Settings was turned off  today when I turned on my laptop, when I clicked on Turn On and got the elevation request for Windows Security  I clicked on view more details and see Verified Publisher Microsoft Windows and CLSID: {6CED0DAA-4CDE-49C9-BA3A-AE163DC3D7AF} I wouldn't normally think of it too much but seeing as a portion of my windows defender had been deactivated, I'm leery of saying yes to it.. Is this legitimate? I'm worried something may be hiding on my pcAny assistance is greatly appreciated.","solutions":["Any 3rd party anti virus, security, cleanup programsever installed on the computer?","Any 3rd party anti virus, security, cleanup programsever installed on the computer?Its a second hand pc and had Win10 Pro on it when i bought it so i took it home and used my brothers pc to download and make an install for usb and just installed it yesterday. I haven't even had time to put anything on it as of yet I was going to put malwarebytes on it as ive used it before but idk if i can download anything safely now","Hi TM. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help.It should be safe to approve that to turn on Windows Security. But first: 1) Download, install and run a full scan with the most powerful on-demand free scanner Malwarebytes:https:\/\/www.malwarebytes.com\/mwb-download\/.In the Scan Settings first set it to include scanning for Rootkits. If necessary run it in Safe Mode with Networking, or Safe Mode accessed by one of these methods:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf...Clean up anything found, restart PC and then run again until it comes up clean. 2) Check for any remainders in Settings > Apps > Apps & Features, and also in each of your browser's Extensions, Home Page settings, Search service or Add-On's as shown here:https:\/\/community.box.com\/t5\/How-to-Guides-for-... 3) Uninstall any third party antivirus and then run it's special uninstaller provided here, even if you already uninstalled it:http:\/\/kb.eset.com\/esetkb\/index?page=content&am...4) Next run System File Checker from Step 10 in this checklist:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki\/windows_10-performance\/windows-10-performance-and-install-integrity\/75529fd4-fac7-4653-893a-dd8cd4b4db00  5) Then type Security in Search box, open Security Center, see if any errors need fixing. If so and they won't fix by clicking on them, see these additional fixes:https:\/\/answers.microsoft.com\/en-us\/protect\/for...http:\/\/www.thewindowsclub.com\/unable-to-turn-on...If you want to keep Malwarebytes as an on-demand scanner then you can turn off its Real Time trial version in it's Settings > Account Details tab.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hello Greg, thanks so much for your thorough reply, and I appreciate your offer to assist me very much. I just have one question, and im not questioning you but should my Malwarebytes download look like this? from data-cdn.mbamupdates.com? Again thanks so much","Yes, you can proceed.","Yes, you can proceed. Okay, after downloading MWB I entered Safe Mode using the Hold-Shift-Restart -> Enable Safe Mode with Networking method.When it booted into safe mode, immediately I got an action center notification saying that mwb real time protection had been turned off, and my internet connectivity was down. Also, I was not allowed to turn on it's self protection module??Originally I was on Wifi, but even after connecting via ethernet, still no connection and not able to re-enable RTP in MWB.I restarted once more and am now in normal boot and running the scan including rootkits. I dont understand why Safe Mode with Networking would behave that way? I have a few screen snaps","I am currently 1 hr 30 mins into my scan with just under 400,000 items scanned.. yikes <<Okay, after a while it finally finished. This is the log, its interesting to say the least..Malwarebyteswww.malwarebytes.com-Log Details-Scan Date: 1\/13\/20Scan Time: 12:18 AMLog File: 3b383742-35dd-11ea-a09b-9828a60aa8f8.json-Software Information-Version: 4.0.4.49Components Version: 1.0.793Update Package Version: 1.0.17663License: Trial-System Information-OS: Windows 10 (Build 18362.535)CPU: x64File System: NTFSUser: DESKTOP-134P3PF\\Chasm-Scan Summary-Scan Type: Custom ScanScan Initiated By: ManualResult: CompletedObjects Scanned: 565343Threats Detected: 0Threats Quarantined: 0Time Elapsed: 1 hr, 45 min, 1 sec-Scan Options-Memory: EnabledStartup: EnabledFilesystem: EnabledArchives: EnabledRootkits: EnabledHeuristics: EnabledPUP: DetectPUM: Detect-Scan Details-Process: 0(No malicious items detected)Module: 0(No malicious items detected)Registry Key: 0(No malicious items detected)Registry Value: 0(No malicious items detected)Registry Data: 0(No malicious items detected)Data Stream: 0(No malicious items detected)Folder: 0(No malicious items detected)File: 0(No malicious items detected)Physical Sector: 0(No malicious items detected)WMI: 0(No malicious items detected)(end)So it says it detected something and tells me it didnt in the same log?I also ran SFC \/scannow and got nothing back from it which is insanity to me..I'll do it again in safe mode in the morning and post a snap.Im very confused, I will continue this when I wake if thats alright. Thank you again so much for assisting me."]},{"symptom":"Lost text        My wife inadvertently deleted all the text in a document in the process of cutting and pasting to move some text from one part of the document to another. Despite pressing the 'undo' button she could not get the text back. 3 months work gone - not backed up! She now has a blank document. Any way that those 18 pages can be retrieved?","solutions":["Unfortunately it often requires a major disaster to implement a robust backup routine.If the System Restore mechanism is active then you can do this:Save the existing copy of the current file elsewhere.Use Windows Explorer to open the folder where the file resides.Right-click the file, then left-click Restore previous versions.Follow the prompts.","Hi Frederik,I can't thank you enough for that - two months work retrieved and one hysterical wife restored to sanity! Plus husband!Many, many thanks.I am so glad that you were able to restore the document."]},{"symptom":"How to delete duplicate files from WMP library?        How to delete duplicate files from WMP external drive G","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please perform the following steps to Delete duplicate items from Windows Media Player Library.Open Windows media Player Library. Click on All Music. Arrange them in an ascending order: Click Title column head. This arranges your items accordingly.Right-click any duplicate item, and press Delete. And then Confirm your action."]},{"symptom":"Update W7 -> W10 - can't manually install Realtek drivers 1.5.1012 or later        Hi, when I try to update work laptop from Windows 7 to Windows 10, I get this image:1. Windows Update does not offer any automatic update2. The official guide for manual installation (aka.ms\/realtek_bt_1_5) does not work for me - when I download the drivers and install them manually, it says the Windows detected the drivers are up to date, but they remain on its old version, which is 1.3something (can't remember exact version, it's a work laptop I don't have with me right now)3. I've ran the latest Windows 7 update, but it did not update the driver either.4. I've tried to uninstall\/disable the old driver, but when updating it I only can get it until the old 1.3something version.5. A legal version of Windows is installed.I'm completely lost so I'll be grateful for any idea.Cheers!","solutions":["4. I've tried to uninstall\/disable the old driver, but when updating it I only can get it until the old 1.3something version.I would uninstall\/disable the current driver, then proceed with the Win10 upgrade.","4. I've tried to uninstall\/disable the old driver, but when updating it I only can get it until the old 1.3something version.I would uninstall\/disable the current driver, then proceed with the Win10 upgrade.Sorry for poor wording, I meant I disabled the current driver - it didn't help. I'm looking for some other idea.","Try this:Download the media creation tool. Store it on a flash disk.http:\/\/windows.microsoft.com\/en-us\/windows-10\/media-creation-tool-installRun msconfig.exeDisable all Startup tasks.Open the Services tab, then Hide all MS services.Disable the remaining services.Reboot.Run setup.exe on the flash disk.","Try this:Download the media creation tool. Store it on a flash disk.http:\/\/windows.microsoft.com\/en-us\/windows-10\/media-creation-tool-installRun msconfig.exeDisable all Startup tasks.Open the Services tab, then Hide all MS services.Disable the remaining services.Reboot.Run setup.exe on the flash disk.Thanks for a new idea, but could you - or anyone - confirm that this will keep all my files intact (aka will not automatically run a 'clean' installation) during the W10 upgrade? Sorry if it's a dumb question but I'm not too tech-y.","Thanks for a new idea, but could you - or anyone - confirm that this will keep all my files intact (aka will not automatically run a 'clean' installation) during the W10 upgrade? Sorry if it's a dumb question but I'm not too tech-y.The upgrade will kep your personal files and your applications as they are. However, the wise man would back up his files beforehand and then check if they are readable. Standard procedure . . ."]},{"symptom":"Windows 10 1909 installation - error-0xc190012e        Dear,How can the Windows 10 1909 installation error 0xc190012e be resolved please?Thank you,Kind regards","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command promptDISM \/Online \/Cleanup-Image \/RestoreHealthRun these commands on the command prompt to restart windows update servicesnet stop bitsnet stop cryptsvcnet stop wuauservnet stop msiserverRen C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.old net start bitsnet start cryptsvcnet start wuauservnet start msiserverAfter successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartThis should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)"]},{"symptom":"Unable to download with .ins at the end        I want to use my Juno as a midi controller, and on the Roland website I have been directed to download Juno-Gi Cakewalk Sonar Instrument Definition list which would give me thejunogi.ins folder.Once downloaded and unzipped, I can't open it. Does anybody know what I should do? From the little that I can pick up, the problem is the.ins at the end.","solutions":["https:\/\/fileinfo.com\/extension\/insKindly read all of the above.Programs that open INS filesWindowsMiKTeXTeXworksTexmakerAny text editorIn File Associations through Control Panel, .ins is not even listed in file type.That's why it won't open."]}]}