{"windows":[{"symptom":"How can I install Windows 10        My son has an Acer Aspire all in one PC.  He tried to convert it to a Mac using some dubious software he found on the internet!  Needless to say, he now has nothing on the hard drive and the command prompt doesn't get us anywhere.  How can I install Windows 10 if we don't have any recovery disk\/USB?  Thanks in advance.","solutions":["Hi Peter, you will need to create bootable Windows 10 installation media on a USB flash drive (min. 8GB)You can reinstall Windows 10 at any time, you will not need a product key, activation will be automatic and it will not cost you anything !Click this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), you can create a bootable USB flash drive (min 8GB) using that toolThen, Boot your PC from the Installation Media you just created (change Boot Order in your BIOS) to begin installing Windows 10Since you previously had Windows 10 installed and activated on that PC during the installation process skip the steps which ask for a product key and select the option 'I am Reinstalling Windows 10 on this PC', and activation will not be an issue, your PC will have a digital entitlement stored on the Microsoft Activation Servers Make sure you install the same Edition of Windows 10 (Home, Pro . . . etc.) you previously had installed to avoid Activation issues","Thank you so much for your help!  Very much appreciated!!  Peter","Glad to Help and good luck with the install!","Hello Peter,In addition to what Dave posted, the tutorial below can help walk you through step by step on how to do the clean install of Windows 10 on your PC if needed.https:\/\/www.tenforums.com\/tutorials\/1950-clean-install-windows-10-a.html"]},{"symptom":"bitlocker recovery key        how do I recovery bitLocker key for my HP Envy laptop","solutions":["Hello ner##, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemIf you have started Bitlocker with your Microsoft account, you can find the recovery key in this link:https:\/\/account.microsoft.com\/devices\/recoverykeyFeel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolvedCheers! Farah","Hello ner##, The tutorial below can help show you to find your BitLocker recovery key depending on how you chosen to back up your BitLocker recovery key.https:\/\/www.tenforums.com\/tutorials\/130909-find-bitlocker-recovery-key-windows-10-a.html"]},{"symptom":"the programs installed on my pc are blurred        Every time I open programs like Minecraft, they blur to the point of not being able to see anything because of the blur level how can I solve it","solutions":["Hi hristian, My name is Riccardo and I would be happy to assist. This may be due to some scaling issues - check out the link below for some fixes:https:\/\/support.microsoft.com\/en-ca\/help\/409136...If this does not help, please let me know and we will troubleshoot further. Thanks!"]},{"symptom":"Mail app in Windows 10        the email that I create from one of my accounts, appear as \"From: Email Team\", instead of from my email address:  The email then is not recognized as from me and usually gets routed to \"Junk\" file or \"Spam\" file by the recipient.   How do I get rid of \"Email Team\"??","solutions":["Typically when you connect Windows 10 Mail to a Microsoft mailbox, you get an Exchange connection and your Windows 10 Mail, Calendar, and Contacts all sync in both directions with the Microsoft mailbox. It should use the display name fromhttps:\/\/account.microsoft.com\/"]},{"symptom":"Log-in & passwords        Hello! And Happy New Year to everyone!My question regards, W10\/Edge:If there's one thing guaranteed to make my blood boil it's having to renew all my log-ins and passwords whenever an update happens!Is there anything that I can do in Settings to avoid this?Thanks in advance for any (not overly technical) tips!Kind regards,Charlie","solutions":["Hi ,CharlesSharpeVB. my name is Dennis, I'm an independent advisor and I'll do my best to help today. this easy guide will help you save your passwords on edge,has reference images https:\/\/www.windowscentral.com\/how-manage-your-...Regards, Dennis. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"disk management - initialize - the device is not ready        Hi,I was trying to plug in an external HDD to my computer. The file explorer opened but stood frozen for a couple of minutes in \"not responding\" condition. I then unplugged it. Now It shows in the device manager but doesn't show in file explorer. I tried reinstalling drivers but it doesn't help. I checked the Disk Management utility as described in the post here.It shows it as Disk 2 with the red-downwards arrow. When tried to initialize it with GPT partitioning, it says \"The device is not ready\".I don't want to format it. Please help me!","solutions":["Hello Piyush Is there data on that drive that you need to access, or is that a new drive? If there is no data on that drive, then right click the unallocated space on that drive and choose New - Simple Volume, accept the defaultsWhen that process completes, you should have access to that drive . .. NOTE, Please do not do this if you need to recover data form that drive . . . .","Wow, that was a fast reply! Thank you DaveM121 for replying.Though I do have about a TB of data on it and it's really important. I don't want to format it.Is there any other way to do it without cleaning it?","Hi Piyush Honestly, the best option would be to connect that drive to a non-Windows 10 PC, then see if you can access the data on that drive, please let me know if you can do that . . .","Damn I was so panicked, I was reinserting the disk on every port of my PC, rebooted the PC, then tried again. After that I kept it plugged in for about half an hour. Then I unplugged and tried again and it just showed up all fine. Computers are really complex things. 🤦‍♂️Thanks anyways for the help!"]},{"symptom":"visual studio community appears in Apps & features when is not installed.        after few problems and system restores i ended up with the \"visual studio community\" icon in the App & features window when it is not installed in my pc.removing the installer does not solve the problem, and reinstalling the visual studio community and removing it does not work either (after i install it, there are 2 icons for the same app)this is the message i get when i am trying to uninstall the app","solutions":["Hi Sig. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) Follow the path in your second screenshot to see if that Visual Studio Community folder remains.2) Take Ownership of the Community Folder. If no other Visual Studios apps, take Ownership of the entire Folder:https:\/\/www.askvg.com\/add-take-ownership-option... 3) Delete the folder. If it balks, browse into the folder and delete the child folders or their files first, then delete the parent folder.This will remove the program and most registry keys. It is the last resort after trying everything else like you have._________________________ Linked tutorial is from a trusted Microsoft MVP","first of all, thank you very much for the help!i did that (there was no folder for the community app, just for the installer),i have deleted the entire folder and now i am getting this message","What Visual Studio apps are installed at Settings > Apps > Apps & Features, and also at Settings > Apps > Apps & Features, choose Turn Windows Features On and Off?Try repairing Visual Studio here: https:\/\/docs.microsoft.com\/en-us\/visualstudio\/i...For 2017 special steps here: https:\/\/social.technet.microsoft.com\/wiki\/conte... Report back all results.","Solved.I managed to solve the problem by uninstalling the applications with the the old \"Uninstall or change a program\" option.Start -> search for \"Control Panel\" -> under \"Programs\" click on \"Uninstall a program\"when trying to uninstall a program that no longer exist, a prompt window will ask to remove the application from the \"Apps & features\" list.","I solved the problem before I had a chance to try your suggestion.Nevertheless, Thank you very much for the help!"]},{"symptom":"Password doesn't work        I was going outside keep my pc on. while came back I saw my pc is freezing then I restart my computer. then my pc show me this notice: your windows ran into problem.... . then I am going to safe mode with network....but I forgot my password (traditional or local password). now I reset my new Microsoft account password with my phone and put that new pswrd again in safe mode but this new password doesn't work. now what I can do? sorry for my bad eng writing","solutions":["Hello Jo, I am Andrew and independent advisor. Unfortunately there isnt must we can do except reset your computer. This will erase the password but as the action suggests, will reset everything to its original state. You can keep your files this way though.To accomplish this boot in to the advanced recovery, as youve done to get to safe mode. Enter Troubleshoot, you should see RESET MY PC in there. Click there and choose to save my data. Perform this and you should have your computer back.Take care,Andrew","Hi Andrew,Thanks for your reply. While i chose reset this pc...again my password doesn't work. Now what?"]},{"symptom":"Locked out of PC and won't connect to internet to log back in.        I was on my PC today, and randomly out of no where it went to a gray screen and said \"signing out\". Afterwards it said that my PC was locked by an administrator, and that I need to sign in with my administrator account. So I typed in my PIN and it told me I need to connect to the internet then log in again. Now, for some reason it will not connect to my WiFi. It says \"Connected, No Internet\".Iam stumped on this one, please help.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please plug in to the Ethernet and try to log in. If you don't have Ethernet connection (Cable) please use you mobile and create an alternate WiFi Hotspot and connect to that WiFi network.Please Note: You need to use Mobile Internet when using Mobile Wireless Tethering. The PC will use the internet of your Mobile Network.","I plugged in an Ethernet cable, and now it says I'm connected. When I go to type in my PIN it says I need an administrator to log in first, but I only have one user (myself) on this computer and I have admin rights. So I switched options to sign in with my Microsoft password, and it says my password is incorrect. I know I'm typing in the correct password because I just changed it to make sure. Still cannot log in :("]},{"symptom":"Airplane mode flicking on and off in Windows 10        I can disable the airplane mode driver via device manager (right click start) in Windows 10 but after the computer switches on again airplane mode again flicks on and off, about twice a second.  How can I permanently fix this issue?","solutions":["Hello MarkLee90, I'm Didi, an independent advisor. To fix the airplane mode flicking on and off try this method : Go to Device Manager, open the Human Interface Devices or HID category and check if you see Radio Switch Device : if you see it right-click it and click \"Disable device\".If it doesn't work try the methods provided by Sachith H M on this thread, scroll down to see his answer :https:\/\/answers.microsoft.com\/en-us\/windows\/for... Regards, Didi"]},{"symptom":"USB C Drive not working - HP Spectre X360        I can't get my USB C drive to recognize my C hub.  Geek Squad had it a few weeks ago and said they got it to working.  Running Windows 10 and all updates have been done.","solutions":["Hi, EagleDRK My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Check this link, I hope it helps https:\/\/support.microsoft.com\/en-us\/help\/17614\/..."]},{"symptom":"Windows 10 black screen after windows restore files        So my asus laptop had a blue screen. It restarted. Then it crashed. Restarted again. Then windows diagnostics came up. Btw it said logfile error was C:\\windows\\system32\\logfiles\\Srt\\SrtTrail.txt   I then decided to choose the RESTORE FILES option in the advance options of the diagnostic settings. It said my pc couldnt be fixed. So after running my file restoration. I googlee how long does it take for a file restoration to complete. Its supposed to last only 45 mins. But mine went for an hour. So I decided to shut my pc down. Now when i booted it up It shows the diagnosimg ur pc. Then it just shows a black screenI cant get into safe mode. Please help","solutions":["Correction. Not windows diagnostics. Its actually automatic repair","Hi, AbandonedReality My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I tried everyrhing i could find.Still wont work.I havent tried the usb method though.If i do it. Will i lose my data?","Check the second and third link I sent you, there explain how to repair Windows without losing your data.","Ok. But i managed to get into bios by spamming esc. Is there anything i can do in bios to help?","Try entering the BIOS and reset the default values","I did it and it still went back to automatic repair","Then enter the BIOS and change the boot sequence, first place the USB to repair Windows with the USB."]},{"symptom":"DuckDuckGo as search engine in Windows 10 search bar        I'm using DuckDuckGo as a search engine in Edge but would like to set it also in search bar. Is it doable?Thanks.","solutions":["Hi, Changing the search engine of cortana has been possible on the previous version of windows 10. Although in the recent releases, I myself have tried tweaking the registry to achieve it only to find myself corrupting the system."]},{"symptom":"After Windows 10 update no password box can't login        My computer went through an update. When I rebooted I no longer see my mouse pointer to swipe up for the password box to appear. I cannot log into my computer.  I have tried unplugging the mouse and replugging it in, I have tried rebooting, I have tried changing out the batteries to make sure they're not dead, tried different USB ports.  Any idea what may be going on?","solutions":["Hi, Wingfan13 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to enter the safe mode with the network function to repair, it may be that the network controller is outdated.Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. As soon as you see the Windows logo with the rotating dots, press and hold the power button until the computer turns off. Do this process twice..-Turn on your computer for the third time, and let it load. .-You should receive this message: Preparing Automatic Repair. After entering Mode Update the network driver may be outdated","thank you for the reply. I finally get a message that says your system has shut down unexpectedly three times in a row. OC level has been reset to default as a precaution. Strike the F1 key to continue, f2 to run the setup utility","But it will not accept any keyboard inputs.","Try entering the BIOS and reset the default values","I finally got into the automatic repair but again it won't accept keyboard inputs so I'm going to see if i can find a usb keyboard.","It's a good idea"]},{"symptom":"Apps closing immediately        I'm having an issue where some apps are opening, then closing down immediately. The mouse changes to the \"thinking\" mode, the app never appears, then seems to close down. So the screen of the program never really shows up. This happens under both Admin and User accounts. Here's what I've tried:-changing permissions\/ownership of folders (this hasn't worked since the problem is with the admin account as well)-running as admin-troubleshoot compatibility-Command: sfc \/scannow-system restore (when apps were reliably working)-opening from\/not from desktop shortcutCurrently running Windows Pro Version 1909This has been happening to a few random apps, not all but I'll encounter it in different apps located in different locations but all apps are under the local C drive.Thought it may have been a corrupt user profile, but I'm doubting that now since the same issue is happening under Administrator account as well.I get this error message when trying to change \"Authenticated Users\" permissions (even running as admin):","solutions":["Hi, Katie My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I tried doing all of the above... Powershell seemed to run an errorThis was from the Admin account itself:This was the error back from the User account:None of the above helped- the app is still behaving the same","I recommend that you repair Windows completely before you must make a backup of your personal files, third-party software will be removed. Here the link to download the Windows ISO.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I'm having an issue where some apps are opening, then closing down immediately. The mouse changes to the \"thinking\" mode, the app never appears, then seems to close down. So the screen of the program never really shows up.I was stuck with this very same problem for about six months. I must have tried at least a dozen different solutions, to no avail. Finally the  update to version 1909 fixed it, using this tool:http:\/\/windows.microsoft.com\/en-us\/windows-10\/media-creation-tool-install","I'm not comfortable doing that, as this is a work PC with various programs installed on it. I'd have to contact a higher up IT person.","I'm already running 1909, it seems that the problems have started after running that update. Sorry to hear you had the same issues. Maybe repairing an update install might work?","Try executing the commands I sent you first from Powershell in Administrator Mode.https:\/\/www.top-password.com\/blog\/5-ways-to-run...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"File Browser        My file browser keeps randomly opening (sometimes i have like 10 opened file browsers at once) and im not clicking any buttons or something it just keeps opening from nowhere. Please help me it realy pisses me off. thank you for the answers","solutions":["Hello Skorpiik, I am Andrew an independent advisor. Are you saying you can be doing nothing at all, standing 6 feet away from the computer and it will randomly open the file browser?","It mostly happens whe n im watching some netflix (not touching the pc) and it just randomly starts opening the file browsers.When im literally doing nothing nothing is opening. And it opens also when i do alt-tabs.","This is very strange, I'm thinking perhaps something is in your computer making this happen. Can you open Settings, run Windows Update, then open Defender. Run a complete system scan. It might take a while, but it runs so much deeper than just a quick scan. Thanks"]},{"symptom":"Dual Monitors        Greetings. I have two monitors that are not side by side but on top of one another. One is a laptop and the other is a large Monitor that sits above it. I would like to move between screens by moving the mouse up and down instead of side to side. I use Windows 10.Is that possible?Thank You.","solutions":["Hello The_Philistines, I'm Didi, an independent advisor. To move your mouse up and down between two stacked monitors please follow the procedure provided by Prakhar_Khare on this thread, scroll down to see his answer marked in green :https:\/\/answers.microsoft.com\/en-us\/windows\/for... Regards, Didi"]},{"symptom":"Is the Océ 3000 microfilm scanner compatible with Windows 10        We have an Océ 3000 microfilm scanner. Is it compatible with Windows 10? ","solutions":["Hi Grundman No, I am sorry, that device is approx. 20 years old and the last device drivers supplied by Canon for that scanner were for Windows XP . . .https:\/\/lfpp.csa.canon.com\/tss\/tss_product_deta...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","We are using an older Windows XP computer that we would like to upgrade to Windows 10.  It is only used to run the Oce 3000 microfilm scanner. The software that is loaded on the computer is Oce  3000 Scanning Application v4.4d.  Which version of windows does Scanning Application v4.4e work with?  "]},{"symptom":"Mouse pointer issue        I have a bizarre issue with my pointer.Most of the time, it works fine.Few times per week the following happens:Everything looks normal but when I hover over something that should trigger a cursor image change, the cursor image remains the same. Worse than this is that the cursor also \"slips\" a little just before I click, making work intolerable!Like, when I want to click a hyperlink or mark some text, it \"slips\" to the left and makes me misclick.There is even a stranger thing: I wanted to take a video, to show how it looks like but on, the video itself, the pointer is just fine!Again: while taking the video, I can see the problem but when I look at the recording, it's not there!I am attaching a video from my smartphone to show the problem:Problem Visible ExternallyHere's how the video recording utility is capturing a similar action:Screen Recording Somehow Gets It Right* I've tried restarting the computer and it sometimes helps but often the problem persists even after the restart.The problem just disappears after a while (to reappear later).* I don't think it's related to the actual mouse (MS wireless keyboard and mouse) that I am using because, even when I remove the wireless dongle, the same problem exists by using the touchpad of my laptop.Basically, I am looking for ideas on what is going wrong here and start fixing the problem at the source. I consider myself rather techie but I am not familiar with the pointer technology and I am baffled.Any ideas what to analyze here to reproduce the problem?","solutions":["Hi tk1986fe, My name is Riccardo and I want to help investigate this issue with you. Does this only happen on hyperlinks?I see when you put your mouse over the hyperlink the mouse jerks to the left a little - is this the issue?Have you tried reinstall the drivers for the mouse? The keyboard is fine?","1. Again: This problem is not only for hyperlinks or only for browsers. It's happening on trying to resize stock windows apps, choosing a brush in MS Paint - or any situation where the cursor is expected to change2. The issue is both that the mouse jerks and that the cursor does not change. It doesn't seem like much but it can ruin your day very fast!3. I bumped the drivers once just in case but that didn't solve the problem4. My keyboard doesn't have any pointing facility, therefore I am only able to reproduce the problem with the touchpad and USB mice (both wireless and wired, doesn't make a difference)","Thanks for the info. I am going to release this so you get a expedited response.","What does \"release\" mean?"]},{"symptom":"Exchange Server 2010 error 500        Getting WinRM Client received an HTTP server error status 500","solutions":["Hi Christian, Exchange server isn't supported here. Please ask here: https:\/\/social.technet.microsoft.com\/Forums\/exc..."]}]}