{"windows":[{"symptom":"itunes from microsoft app store for pc        I am logged into my microsoft account.  I tried to download itunes for pc from app store.  The download \"button\" shows enabled because the cursor switches to a hand; however, when I click on it, nothing happens.  So, I selected the three vertical dots next to the download button and it gave me the option of putting in cart.  I put in cart and checked out.I followed the instructions to a page I can't remember but there was  no download\/install option.  I went to my account icon and selected orders which is empty.  I went back to app store and it shows the itunes app as owned.  When I select it, itunes install page comes up with the notation that I own the app.  Again, there is a lovely install \"button\" to select.  When I select\/click on the install button, nothing happens.How do I install itunes on my pc????","solutions":["Hi Joanna. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.You'll probably have better luck with the installed program than with the Store app which gets lots of complaints we see here.To install iTunes much easier follow this guide: https:\/\/www.imore.com\/how-install-itunes-12-win...If any problems see these troubleshooting steps: https:\/\/support.apple.com\/lv-lv\/HT201668http:\/\/www.groovypost.com\/howto\/tips-install-it...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Unable to transfer files from Win 7 to Win 10 Pro - nothing seems to work!  :(        I'm hoping someone can help me!  I am attempting to transfer documents from my Win 7 laptop to my new Win 10 Pro and there is no \"Homegroup\" for easy transfers like there is in Win 7!  Surely Microsoft would not have forgotten such an important feature!  Windows 7 was soooo much easier to use and so simple to transfer documents from one computer to the other - I'm not impressed with Win 10 at all!  When I do a search,  It does show the other laptop on the network, but even though I have sharing for all network users, it is asking me for a user name and password for the Network Credentials, which I thought must be the Homegroup name and password, but it didn't work.  Any help would be appreciated.","solutions":["Hi Dorothy222, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.This is the username and password for your account - If you use Microsoft Account to sign in on Windows 10 use the same credentials.You may turn off the password protected sharing to skip signing in sharing settings.","On both computers do the following steps:Click on Start and open cmd Type ipconfigNote down ipv4 address for both devices eg. 192.168.1.6 > On windows 7 computer:Press windows + R together (to launch run dialogue box) Type \\\\192.168.X.X (ip address of win 10)* if it prompts for user name and password then try the below steps :Goto windows 10 computer Press windows + R together (to launch run dialogue box) Type netplwiz Double click on your account Note down your username >go back to windows 7 computer and type the username that you noted from earlier step and the password for windows 10 computer. Click on remember my password. Now you can follow the same step on windows 10 computer to access windows 7."]},{"symptom":"My PC ran into a problem..        My PC ran into a problem due to memory management... What should I do?????? ","solutions":["Hi, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.We need log files(called dump files) that tell us what lead to crash. Please share them with us for a better analysis of the problem. Instructions can be found here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Please let us know if you need any assistance about posting dump files.","My PC ran into a problem due to memory management... What should I do?????? Step 1: Explain what the problem is.","We need log files(called dump files) that tell us what lead to crash. How did you determine that the OP's computer crashed? I've read their question several times, and all I could gather is that there is a \"problem.\" Did I miss something?","My PC ran into a problem due to memory management... What should I do?????? Step 1: Explain what the problem is.Computer not responding properly.It hangs always. I can't even able to open file explorer. And finally PC ran into a problem and get into blue screen error and shows that error is due to memory management. ","How old is your computer and how much memory (RAM) does it have installed? Is it 4 GB, 8 GB, 16 GB etc.? How large of a Hard Drive or SSD does it have and how much free space is left on it, if you know? https:\/\/techterms.com\/definition\/memory","Computer not responding properly.It hangs always. I can't even able to open file explorer. And finally PC ran into a problem and get into blue screen error and shows that error is due to memory management. The way it works here: The more specific your description, the better your chances of getting the right answer on the first try.When you say \"not responding properly\" and \"hangs always\" - both of which can happen for thousands of reasons - you're likely to get guesses; or long lists of procedures to try with the hope that something will work; or instructions on how to reinstall Windows.Here's how to improve your chances for success without wasting a lot of time:What were you doing on the computer when the problem(s) first started?Describe your problem(s) in as much detail as you can, and don't worry about using proper terminology. If you're able to post screenshots of your problem(s) those are always helpful.If you are seeing error messages, what is the complete text of the error messages?What steps have you already taken, if any, to resolve your problem(s)?With that as background, you're in a much better position to receive an explanation of your problem(s) and the correct steps to fix them on the first try.This is your motto: More information = Less frustration.","How old is your computer and how much memory (RAM) does it have installed? Is it 4 GB, 8 GB, 16 GB etc.? How large of a Hard Drive or SSD does it have and how much free space is left on it, if you know? https:\/\/techterms.com\/definition\/memoryIt is 7 years old. It has 2 GB ram.32 bit OS. HARD DRIVE:430GB.free space:200GB.","Sorry ... even with all that, I can't even imagine what you did to your computer. Sorry.","That's not a lot of RAM. My suggestion would be to add more if you can. Here are the requirements for Windows 10. Take a look at Task Manager if you can and see how much RAM your computer is using out of the 2GB you have. Seeexample image below.https:\/\/www.microsoft.com\/en-us\/windows\/windows-10-specifications","That's not a lot of RAM. My suggestion would be to add more if you can. Here are the requirements for Windows 10. Take a look at Task Manager if you can and see how much RAM your computer is using out of the 2GB you have. Seeexample image below.https:\/\/www.microsoft.com\/en-us\/windows\/windows-10-specificationsOn an average, When internet is off,  it uses 1gb-1.1gb ram for any high use. When internet is on, it uses 1.6gb-1.8gb ram for high use. I created 5 GB virtual ram memory to it. In virtual memory, it uses 1gb-2gb of ram. "]},{"symptom":"HDhomerun APP        will not download from windows storeit just says starting download  and the bar never moves ","solutions":["Hi Dave and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/windowsreport.com\/fix-windows-store-app...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"OOBE        My OOBE stopped part way through, so how can I start it back to gfinish it?","solutions":["Hi Carol. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.What step was it on? How exactly did it stop - screen go blank, power off, error message?Try removing the bootable media, or disconnecting from internet which sometimes frees it up to complete. If not hold in power button to cut power, wait 5 minutes to cool down, then restart PC. What happens?I will give you all possible steps to troubleshoot installation failure which work in about 90% of cases. If not we'll go from there:Follow the illustrated Clean Install steps in this tutorial which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Make sure all other drives and peripherals are unplugged. Update the BIOS or UEFI firmware to latest, or reset to Defaults, making sure SATA controller is set to AHCI, UEFI is enabled, CSM or Legacy BIOS disabled, Windows Boot Manager set first to boot, if necessary disable Secure and Fast Boot until after install: https:\/\/www.mydigitallife.net\/comprehensive-lis... https:\/\/www.groovypost.com\/howto\/reset-pc-bios-...Create the latest new Windows 10 Installation Media by installing Media Creation Tool and following the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... If you're using another PC to do this then uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first. If you can start Windows enter UEFI firmware here:http:\/\/www.isunshare.com\/windows-password\/four-... Choose the boot device as a UEFI device if offered, on first screen press Shift + F10 to open a Command Prompt, type the following commands, each followed by Enter key:DISKPART LIST DISK SEL DIS # (replace # with the disk # of the Windows disk from list in previous command)CLEAN EXIT Close Command Box, on second screen choose Install Now, then Custom Install, then at the drive selection screen choose Unallocated Space, click Next to let it create needed partitions and start install - this makes it foolproof.Make sure to follow the setup steps in the first link tutorial to complete your install. Drivers are important enough that those steps are printed in red.You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the first linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC. If all else fails you can move the hard drive to another PC to do the install with it plugged in alone. Windows 10 is remarkably adaptive to new hardware without needing adaptive restore. If it will start it will swap out all drivers requiring several restarts. You can also try applying a same-version System Image to the intact SSD\/hard drive.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Press and hold the power button for 4 or 5 seconds and let the computer\/laptop shutdown completely. Now wait for 2 minutes and power it on. You should be able to start over OOBE. "]},{"symptom":"Windows 10 Laptop failing Automatic Repair on boot        This randomly happened to me after I held down the power button to turn off my PC. When I restart, it says \"Preparing Automatic Repair\" and \"Diagnosing your PC\" until it comes up with the advanced options stuff. Resetting the PC fails, and so does other repair methods, so I'm pretty much stuck. I tried messing around with command prompt by using chkdsk \/r on C: and it said it could not run due to the volume being in use. It asked me if I wanted to dismount my C drive and I type N. Boot drive cannot use chkdsk as it is a write protected drive (I think the boot drive has something to do with ROM, seeing as ROM stands for Read Only Memory.) I tried using D drive (a random CD that was in my PC) but realize it's disk size is too small to utilise for back up purposes. Also, I tried doing sfc \/scannow  on the C drive but it said that Windows Resource Protection cannot be used (it was something along those lines). This is really inconvenient as this is my only PC until I come back from holiday. Any help would be greatly appreciated.","solutions":["Hi,I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Let us try repairing the existing OS.On a working computer, create an Installation media of Windows 10 that allows you to repair existing Windows Installation.Create a USB Flash Drivehttps:\/\/www.tenforums.com\/tutorials\/2376-create...Boot from the USB Flash drive-Make sure you have disabled Secure boot\/Fast boot in BIOS Settings.https:\/\/www.tenforums.com\/tutorials\/21756-boot-...https:\/\/www.tenforums.com\/tutorials\/21284-enabl...Then open Advanced Startup options after the computer boots from USB. Click Repair your computer at the first screen that says Install now.https:\/\/www.tenforums.com\/tutorials\/2294-boot-a...Select Startup repair, let it finish the job and see if the computer can boot afterward.If that doesn't help, consider doing a clean install after rescuing your files.Rescue Files when Windows won't starthttps:\/\/answers.microsoft.com\/en-us\/windows\/for...How to do a clean installhttps:\/\/answers.microsoft.com\/en-us\/insider\/for...https:\/\/answers.microsoft.com\/en-us\/windows\/for...Disclaimer: Tenforums is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","Hi,I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Let us try repairing the existing OS.On a working computer, create an Installation media of Windows 10 that allows you to repair existing Windows Installation.Create a USB Flash Drivehttps:\/\/www.tenforums.com\/tutorials\/2376-create...Boot from the USB Flash drive-Make sure you have disabled Secure boot\/Fast boot in BIOS Settings.https:\/\/www.tenforums.com\/tutorials\/21756-boot-...https:\/\/www.tenforums.com\/tutorials\/21284-enabl...Then open Advanced Startup options after the computer boots from USB. Click Repair your computer at the first screen that says Install now.https:\/\/www.tenforums.com\/tutorials\/2294-boot-a...Select Startup repair, let it finish the job and see if the computer can boot afterward.If that doesn't help, consider doing a clean install after rescuing your files.Rescue Files when Windows won't starthttps:\/\/answers.microsoft.com\/en-us\/windows\/for...How to do a clean installhttps:\/\/answers.microsoft.com\/en-us\/insider\/for...https:\/\/answers.microsoft.com\/en-us\/windows\/for...Disclaimer: Tenforums is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).There is no need to buy paid products to fix your computers as they do more harm than good sometimes. He's on holiday if you read the post. Is there a way to do this without another pc? And if so, please don't post a generic post."]},{"symptom":"MS Store crashes when installing xbox game bar        No reason, no error, just crashes. Can't install xbox game bar because Microsoft decided to do some proprietary **** which doesn't work. Awesome work as always","solutions":["Go Settings, Gaming.  You should see Xbox Game bar as the first item.  If you look in All apps you will find that it is there already on you computer.  So why install it again.","Well aren't you a smart one, I'm installing it because it's not installed. The settings page is always there regardless of whether or not the app is installed","Did you look in All apps?Also go Settings, Apps, scroll down to the bottom and you should find Xbox Game Bar, click on it, click on Advanced options and Reset.","I don't know how stupid you have to be to assume that xbox game bar is installed when my problem is that I can't install it","It came installed with my installation of Windows 10 Pro.I never had to try to install it from the Store.My problem with it was how to turn it off as I am not a gamer and it bothered me for the simple games that I do play.","Hi,1.Type CMD in the windows search bar. Right-click Command Prompt and select run as administrator.2. Type below commands and press Enter.SC config wuauserv start= autoSC config bits start= auto   SC config cryptsvc start= auto SC config trustedinstaller start= auto SC config wuauserv type=share net stop wuauservnet stop cryptSvcnet stop bitsnet stop msiserverren C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldoldren C:\\Windows\\System32\\catroot2 catroot2.oldoldnet start wuauserv net start cryptSvcnet start bitsnet start msiservernetsh winsock reset3. Restart your computer.4. Click windows search bar > type in Windows PowerShell. Right-click PowerShellType below commands and press Entertaskkill \/f \/im explorer.exeGet-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}start explorer5. Restart the computer, now you could try redownload XBOX.Hope this works for youRegards,","Hi Bob I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Follow these in order: 1. Try Wsreset: First see if Windows Store Reset works. This should Reset Windows 10 Store cache and if there is a problem with cache, this would clear it.a. Open Run dialog box(Win+R) b. Type in wsreset and Press Enter 2. The next step if Wsreset doesn't help is to Reset the Store app. To do this, follow the steps:a. Open Run Dialog box( Windows+R key) b. Type in ms-settings:appsfeatures and Press Enter(Alternatively, Start>Settings>Apps and features)c. Locate Microsoft Store d. Click Advanced Options e. Locate and click Reset Button 3. Reset Windows Update components: Resetting Windows update components might also help. Here is an article on how to do that.a. https:\/\/www.yourwindowsguide.com\/2015\/12\/reset-... 4. Check for necessary services: Windows Store is dependent on some Services. Please check if the services are running and Automatic as given below.a. Right-click Start>Run and Type in Services.msc to open Services. b. Make sure the status of the following services is Automatic and running i. Windows License Manager ii. Background Intelligence Transfer service iii. Cryptographic Services iv. Windows Update v. Windows Store c. If something is not as intended, you can try Restoring default services https:\/\/www.dropbox.com\/s\/vw3g7llzu6niode\/Resto...5. Repair install: The last Restort is a reinstallation of Windows. You can do a repair install, which keeps everything including your apps and files.a. https:\/\/www.yourwindowsguide.com\/2016\/06\/how-to... Originally written at https:\/\/www.yourwindowsguide.com\/2018\/08\/resolv... Disclaimer: The content is written from a Microsoft MVP, so it is safe."]},{"symptom":"i cant reset my laptop        Recently i tried to reset my laptop but for some reason it doesn't let me, it said that I need a 5.91 GB of free disk space, so I tried a run disk cleanup but it still doesn't work.   any help is appreciated and thank you.","solutions":["Hi Marilyn, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Backup your files to another drive and do a clean install. How to do a clean install https:\/\/answers.microsoft.com\/en-us\/insider\/for...https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"Windows 10 1903 Voice Modem stops working        After upgrading to 1903 my voicemaill system no longer works. I can't play outgoing messages to people who call nor can I record messages they want to leave. I'm using a USRobotics voice modem and everything has been working fine until this 1903 \"upgrade\".  I have checked the drivers and the unimodem drivers are there it's just not seeing my modem as a voice modem and installing it as a sound device to record calls and play outgoing messages.  After rolling my system back to the previous version everything is fine. I know that I'll be forced by Microsoft to eventually install 1903 and that sucks as I really need my voicemail system........ Any suggestions?","solutions":["I know no one has responded to you but I am impacted by the same issue on a voicemail system.  The same thing happened with 1511 and it took MS months to resolve.  Very frustrating.  If you already have a fix, please let me know that it was.","I know no one has responded to you but I am impacted by the same issue on a voicemail system.  The same thing happened with 1511 and it took MS months to resolve.  Very frustrating.  If you already have a fix, please let me know that it was.Yes it's so frustrating! I went back to Windows 10 1809 and set my Windows 10 Feature Update to delay version 1903 for a year. Hopefully they will fix the issue by then. If you hear of any fixes or if Version 1903 is fixed I would greatly appreciate it if you would let me know............ Thanks...........Greg","Same issues here although I have a different brand of voice modem.  Does anyone have a workaround yet?  Have any vendors responded?","Hello,Same problem here, using Multi-Tech modem and it will not work on Windows 10 - 1903. Any fix yet?","Received an alarm about this from our partners.Tested our Virtual Fax-Voice Modems (TAPI compatible) with the good old CallStation application.Can confirm the bug in Windows 10 1903.The CallStation reports \"Failed to get modem wave out ID\" when trying to turn on the voice functions.The restarting of the PC and re-installation of modems does not help.This problem is not present in Windows 10 1809 and in Windows Server 2019.The problem is similar to the one that caused heated debate several years ago:http:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-hardware\/56k-modem-missing-unimodem-audio-device-after\/7a53af94-21fe-4352-80ec-b27fb3dc5886?page=1(Then it was finally resolved on the Microsoft side.)However, this time some other reasons.The \"Unimodem audio Device\" associated with modem is installed and present in the Device Manager as required.Have tried to find a workaround.The replacing of modem.sys (from older Win version) does not help this time.Tried also to replace the following system files: rootmdm.sys, ModemcSA.sys, ksthunk.sys, csamsp.dll (standard windows files on which voice modem drivers depend) - also without success. No ideas what is wrong.As we noticed, vendors have already begun to give massive recommendations not to install 1903 (with pictures of how to roll back to the previous Windows version).See example:https:\/\/supportdesk.win911.com\/support\/solutions\/articles\/24000043298-windows-10-version-1903-tapi-incompatibilityIt is clear that this is the wrong way.The only right way, the problem should be fixed on Microsoft side, and the faster the better.Can you please fix?Thanks in advance.","Thank you,,,Hopefully this will be fixed soon!!!!","The problem is somewhere with winmm,dllwaveOut…waveIn…waveOutGetNumDevs\/waveInGetNumDevs do not contain \"modem\" voice devices in the enumeration (like before), do not see!!!https:\/\/docs.microsoft.com\/en-us\/windows\/win32\/api\/mmeapi\/nf-mmeapi-waveoutgetnumdevsso waveOutOpen\/waveInOpen (that TAPI app need) or any other will not work.The replacement of winmm,dll etc. does not helpMay be something wrong with registry, may be something corrupted in Windows audio subsystems.No further ideas.","Well, here is the manual fix and will work.[HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Drivers32]\"waveN\"=\"serwvdrv.dll\"[HKEY_LOCAL_MACHINE\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows NT\\CurrentVersion\\Drivers32]\"waveN\"=\"serwvdrv.dll\"[HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Userinstallable.drivers] \/\/???\"waveN\"=\"serwvdrv.dll\"[HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Class\\{4d36e96c-e325-11ce-bfc1-08002be10318}\\000X\\Drivers\\wave\\serwvdrv.dll]\"Driver\"=\"serwvdrv.dll\"\"Description\"=\"Modem Wave Driver\"\"Alias\"=\"waveN\"For example, you have installed 2 voice modems.1) [HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Drivers32]Find the last wave[N-1], say \"wave1\" exists and create 2 entries:\"wave2\"=\"serwvdrv.dll\"\"wave3\"=\"serwvdrv.dll\"2) [HKEY_LOCAL_MACHINE\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows NT\\CurrentVersion\\Drivers32]Add the same as in (1)\"wave2\"=\"serwvdrv.dll\"\"wave3\"=\"serwvdrv.dll\"3) Find your \"unimodem\" devices at this path:[HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Class\\{4d36e96c-e325-11ce-bfc1-08002be10318}\\ and add aliaces you have already added:[HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Class\\{4d36e96c-e325-11ce-bfc1-08002be10318}\\0003\\Drivers\\wave\\serwvdrv.dll]\"Alias\"=\"wave2\"[HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Class\\{4d36e96c-e325-11ce-bfc1-08002be10318}\\0004\\Drivers\\wave\\serwvdrv.dll]\"Alias\"=\"wave3\"4) Restart the computer. Will work.Normally, all these keys should be properly registered when installing the modem driver, but for some reason 1903 does not do this.(assumption) Most likely again some kind of defective file, as it was with the modem.sys last time, presumably one of the above mentioned. Necessary to replace consistently and test. But the bottom line is that they must be replaced at the time of installation of the modem driver, and not when modem is already installed.And naturally, Microsoft is simply obliged to deal with this, because writing such \"fixes\" on the vendor's side is at least a bad idea.Thanks.","Well, even easier, you need to add 1 entry into registry (and its 32-bit copy on x64).1) Goto [HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Drivers32]Find the last wave… parameter, say \"wave\" and \"wave1\" are exist and create 1 new entry wave(+1):\"wave2\"=\"serwvdrv.dll\"2) Goto [HKEY_LOCAL_MACHINE\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows NT\\CurrentVersion\\Drivers32]Add the same as in (1)\"wave2\"=\"serwvdrv.dll\"3) Restart the computer.The already installed modems will work. The new modems that you will install later also will work (after installing a new modem, you must always restart the computer, otherwise TAPI does not see waveID).No need to delve into the unimodem voice devices keys, especially since there is usually a mess of new and already deleted ones.Well, in general, any vendor can add this fix ... although this is incorrect andshould be fixed on the Microsoft side.","Thank you again. "]},{"symptom":"product key        where do I locate my product key","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,You may access your product key by executing a command via the command prompt 1. Go to the start menu and open command prompt with admin permission 2. Execute this code wmic path softwarelicensingservice get OA3xOriginalProductKeyOther than that, as an alternative you may locate your product key by using showkeyplus available from the Microsoft storehttps:\/\/www.microsoft.com\/en-us\/p\/showkeyplus\/9...Let me know how it goes. :)","If the computer was activated there is no longer a need for a key.If asked for a key just go to the bottom of the page and click on Skip, Do this later, or I do not have one."]},{"symptom":"CD\/DVD player will not work        Has there been an update to fix the issue with the CD\/DVD players not working after the change to Windows 10?","solutions":["Hi BSalyer, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved. The CD\/DVD drive not working after updating to Windows 10 is a known issue. Very often, the steps below do help to resolve the problem.Check with the System Maker's Support, their on-line documentation and drivers, troubleshooting, and ask in their forums about any known issues. Double check for Windows 10 compatibility.Your CD or DVD drive is not recognized by Windows or other programs https:\/\/support.microsoft.com\/en-us\/help\/314060...===================================================== Check this : WINKEY + X OR place the mouse in the lower left corner and Right Click Start Button - Command Prompt (ADMIN) OR Windows Powershell (Admin)Enter the below (or COPY and PASTE - between lines but NOT including the lines.) :-------------------------- reg.exe add \"HKLM\\System\\CurrentControlSet\\Services\\atapi\\Controller0\" \/f \/v EnumDevice1 \/t REG_DWORD \/d 0x00000001-------------------------- hit ENTER then close and REBOOT =================================================== 1. Start - Settings - Update & Security - Troubleshoot - \"Hardware and Devices\" and Start - type in --> Control Panel - Troubleshooting - Hardware and Sound - Configure a Device.See if that troubleshooter helps. 2. Start - type in --> Control Panel - Device Manager - DVD-CD drivers - Right Click the drive - Driver Tab - Click Update Drivers - then Uninstall the drive - then restart the computer3. See if this helps - use the \"Manual\" methods Fix: DVD Drive Not Detected In Windows 8\/10 http:\/\/www.intowindows.com\/fix-dvd-drive-not-de...===================== If needed let's test the CD\/DVD drive to see if it works at all : Try this to see if the drive is viable at all (you will need to make these on another computer since yours will not start - XP, Vista, 7, 8\/8.1, or 10 or even running Linux does not matter). You could also try booting with another Windows disk - any OS version though do not use it to do ANY repairs unless it is absolutely the same version of Windows on your system - just boot to see if the drive works. You can even make a Windows 10 DVD boot disc by running the Windows Media Creation tool (on any computer) - Windows Media Creation Tool (make 32 or 64 both disk same as the OS version you are running. http:\/\/www.microsoft.com\/en-us\/software-downloa...Setup\/Settings (BIOS\/CMOS) often F2 so watch the screen as you boot - set the boot order to CD\/DVD first. Remember to set it back when done.Or try booting to a Linux boot disk. If the drive will not boot to these then it has failed or there are other hardware issues affecting it. However even it does boot that does not mean there are not some possible hardware issues affect the drive's other functions.Trinity Rescue Kit - Download on upper right of page http:\/\/trinityhome.org\/Home\/index.php?wpid=1&am...Hirem's Boot CD is another good choice http:\/\/www.hirensbootcd.net\/download.htmlhttp:\/\/www.hirensbootcd.net\/cd-contents\/138-hbc...System Rescue CD http:\/\/sysresccd.org\/Main_PageScan a Windows PC for Viruses from a Ubuntu Live CD http:\/\/www.howtogeek.com\/howto\/14434\/scan-a-win...Use Ubuntu Live CD to Backup Files from Your Dead Windows Computer http:\/\/www.howtogeek.com\/howto\/windows-vista\/us...Check the cabling to be sure nothing has come loose. ===================================== More expert help with CD\/DVD drive issues available here : Forums - a lot of real expert help http:\/\/club.myce.com\/ CD\/DVD - Writers - Hardware https:\/\/club.myce.com\/c\/cd-dvd-and-blu-ray-writersHere to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all."]},{"symptom":"Cant download xbox beta because windows cant update        So I go to the Microsoft store and try to get Xbox beta but it says my windows needs to be updated, so I go and try to update windows and it doesn't work. I have used the windows update assistant & that still doesn't work. please help!","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,What version of windows are you on as of the moment? 1. Open the start menu and search for winver and hit enter __________________ I'd recommend these steps to sort out the issue with your windows update Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command prompt DISM \/Online \/Cleanup-Image \/RestoreHealth Run these commands on the command prompt to restart windows update services net stop bits net stop cryptsvc net stop wuauserv net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start bits net start cryptsvc net start wuauserv net start msiserver After successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig 2. On the system configuration window go to the services tab 3. Tick on hide all microsoft service so that this won't be affected 4. Choose to disable all services 5. Next, go to the startup tab and on the window choose to open task manager 6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok 8. A prompt to restart the computer will show up, choose to restart This should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo... 2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept. 4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)"]},{"symptom":"error code 0x80070002 in update's        error code 0x80070002 when I try to do updates, how do I fix this so I can get the updates?","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command promptDISM \/Online \/Cleanup-Image \/RestoreHealthRun these commands on the command prompt to restart windows update servicesnet stop bitsnet stop cryptsvcnet stop wuauservnet stop msiserverRen C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.old net start bitsnet start cryptsvcnet start wuauservnet start msiserverAfter successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartThis should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","Hi,You can try the following:Step 1: Press Win+R to open the run dialog box, type services.msc and press Enter to open the service panel. Find Windows Update and right-click it. Hit properties and change the services status to stop.Step 2: Then you go to the file explore to find Data Store and Download folder. Delete them all (you should find them in disk c)Step 3: Last step: change the services status to start.Regards,"]},{"symptom":"Unable to Boot Windows 10 with External Hard Drive Attached        So this question is asked here and there with nothing concrete. I have an alienware alpha with Windows 10. Whenever I plug in an external hard drive (Seagate Backup Plus NAB90MJS 2019) the computer goes into black screen. Things I have tried:1. Using Legacy BIOS2. Disabling USB Devices in BIOS3. Lowering the priority for USB connected devices during boot up.4. Installed WDS SES Driver (I know mine is a seagate but per another website that solved their problem with a WD external hdd)5. Tried both front USB 2.0 ports and the USB 3.0 ports in the back of the alienwhere alpha.6. Changed \"USB setting\" and disabled the \"USB Selective Suspend Setting\".  Mine did not have battery bc it's not a laptop.  For those who want to try it it's windows+R, type in powercfg.cpl, Change Plan Setting, Change Advance power setting, look for \"USB Setting\" and then turn off.  If on laptop you will do that for \"on battery\" and \"plugged in setting.\"The external HDD is fine when I plug it in.  If I leave it there however the computer will not boot up and locked in the black screen. It seems to be booting up from the external drive via USB port. The alienware logo doesn't even boot up it's just a black screen.  If I use Legacy BIOS, it recognizes my SSD drive but unable to boot devices.  I have to be in UEFI mode to boot up properly so it's back to standard SECURED BOOT UP mode. I believe this is a Windows 10-specific issue with USB device drivers rather than an alienware alpha or external HDD issue.I have another PC for which a similar issue arises when I plug in my external Blu-ray driver and it will not boot-up Windows 10 unless I unplug the external blu-ray driver from the front USB 2.0 port as it appears to be attempting to boot up from the external blu-ray drive.So I want to pose the generic question: I am unable to boot windows 10 with external drives attached. Anyone with any ideas?","solutions":["Hello JohnLi3, thank you for providing this question. I am a seasoned Windows expert with almost a decade in usage and support experience and hope to resolve your problems quickly.It has nothing to do with WIndows 10 as the boot fails prior to Windows being ever loaded.It might just be that the external drive is not properly configured for uefi secure boot.Windows 10 doesn't like being started in legacy BIOS when being used to UEFI secure boot. So:1. In UEFI your external hdd breaks boot sequence. 2. In legacy BIOS Windows 10 doesn't start because internal hard drive is GPT formatted.See also: docs.microsoft.com\/windows-hardware\/manufacture\/desktop\/boot-to-uefi-mode-or-legacy-bios-modeYou could format C: and reinstall Windows to use MBR instead of GPT, turn of secure boot beforehand and set the proper boot order from then on this would mean using BIOS and not UEFI altogether. Quite some work compared to just unplugging the external hdd on boot. Or try to buy another hdd which properly supports UEFI boot. If you consider your problem solved it would be very good if you marked the answer which helped you so others can find and use this thread.If this didn't solve your problem or you need further assistance please answer in this thread and i would be happy to help.kind regards F. Grobusch"]},{"symptom":"Security Warnings        I am on a laptop using Window 7 with Mozilla fire fox. I visit ZOOM and get messages that site is unsafe. Everyone else usually on cell phone are able to login, down load and no issues. I am being told that I have to turn off security. How and is this true?","solutions":["All you had to do was look at a Google Search for your question about it:https:\/\/www.google.com.au\/search?source=hp&ei=CJkOXstWosbj4Q_08LTQCg&q=security+warning+for+ZOOM+website&oq=security+warning+for+ZOOM+website&gs_l=psy-ab.3..33i160.174389.184756..185017...0.0..1.357.7006.0j8j20j3......0....1j2..gws-wiz.....0..0i131j0j0i22i30j33i22i29i30.hHwWwjJLvbg&ved=0ahUKEwjL-sn0o-bmAhUi4zgGHXQ4DaoQ4dUDCAs&uact=5#spf=1578015175705","Thank you I tried to search google and this did not show for me. Thanks, so there is a security concern.","I don't use it. I have no need of it.I was interested in finding out about security issues with it though as you mentioned it.But the Net is full of it:https:\/\/www.google.com.au\/search?source=hp&ei=FKYOXujOF_O_8QOl86WgAg&q=zoom+conferencing+securtiy+concerns&oq=zoom+conferencing+securtiy+concerns&gs_l=psy-ab.3..33i22i10i29i30.1963.11847..12098...0.0..0.356.7729.0j8j27j1......0....1..gws-wiz.....0..0i131j0j0i22i30j0i13j0i8i13i30j33i10.4BpF6zJqssI&ved=0ahUKEwjoqLKtsObmAhXzX3wKHaV5CSQQ4dUDCAs&uact=5#spf=1578018343043A series of security flaws in popular video-conferencing serviceZoom left its users vulnerable to spying, denial of service attacks from unauthorized sites, and the potential installation of malware, according to a report fromsecurity researcher Jonathan Leitschuh.Jul 9, 2019.These are the online reports I'm giving you."]},{"symptom":"Custom font won't delete on my computer  (I NEED HELP PLZ!!!!)        I'm trying to delete the font called \"Helvetica Neue Light\" and the following error message pops up: \"Font cannot be deleted because it is in use\" and I tried to struggle to delete the STUPID font and the message pops up again and I'm afraid of destroying my computer with registry hacks.","solutions":["Hi VistaVen, I found an existing video tutorial that will help you resolve your concerns. You can check and see if the instructions provided can help you.https:\/\/www.youtube.com\/watch?v=cm0ENXqgR4AI hope this helps. Feel free to ask back any questions and let me know how it goes.Thanks! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi VistaVen and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.1. Press the Windows key type in \"Regedit\" and hit enter 2. Go to. HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\WindowsNT\\CurrentVersion\\Fonts 3. Delete the affected Font File Names from the list of files. 4. Restart PC. I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"External Monitor keeps flickering on and off with Surface Pro 2017 via Surface Dock        I have a 2017 Surface Pro which I connect to a Samsung 4K 28\" monitor through a Surface Dock to use it as a desktop PC. However for two years, the screen on the external monitor keeps turning on and off by itself randomly. There are no specific triggers that causes this issue that I am aware of. It happens automatically at irregular intervals. I've exhausted all my options trying to diagnose the issue. I spoke with Microsoft employees dozens of times and they've swapped surface pro devices for me, changed the surface dock, and I even changed the cables. Nothing. So I updated the software, re-installed the software, ran surface diagnostic tools, updated graphics drivers, and changed refresh rate. This is much like the same issue that people are experiencing here in this inserted link:https:\/\/answers.microsoft.com\/en-us\/surface\/forum\/all\/4k-monitor-flashes-on-and-off-frequently-when\/51b10bee-9ca2-4d14-8df5-4c51b822a3e4As shown, this person has the same monitor and has done all the same steps that I've done. Only difference is he has a Surface Pro 4. Now if you read through the comments, a lot of people are experiencing similar issues with DIFFERENT MONITORS. Also this problem is two years old if not older. There hasn't seem to be a fix. So clearly, this is not an individual problem. It is a FIRMWARE ISSUE that Microsoft Engineers really need to step up to and fix. If I could get the attention of MS support of this then that would be great! Otherwise, has anyone faced the same issue and arrived at a desirable solution? Best Regards,Frustrated Windows User ","solutions":["Hi ShawnIsi, My name is Riccardo and I’m going to try to assist you today on the issue above. First off I can empathize with the frustration you are encountering. It sounds like you’ve pursued a few troubleshooting steps.I have a few questions: 1. You say this only happens on the dock? Have you done any firmware updates on the dock.Below is a link from September 2019 that has some updates. https:\/\/www.microsoft.com\/en-us\/download\/detail...2. What resolution are you keeping the screen? Does it seem to happen less frequently on a lower resolution?3. You have the latest build of Windows 10? Build 1909? Look forward to a response.","Hello, I've updated the dock using the link. The same issue still occurs but less frequently. I am using a resolution of 3840 x 2160 on my Samsung Monitor. I don't know if it happens with lower resolutions but I prefer the highest resolution because sharp images reduces eye strain. That's the whole point of investing in a 4K monitor. Yes, I have the most recent build of Windows 10. "]},{"symptom":"[Solved] Icons missing in Action Center and Snip & Sketch        In the Action Center and Snip & Sketch, many of the icons are missing. I am running Windows 10 Enterprise 1903 (build 18362.295). I triedclearing the icon cache but that did not solve the problem. When logging in as another user I see the icons, so it is only affecting my user profile. How can I get the icons back?","solutions":["Wow... Thank you so much. This fixed the issue! I have been looking everywhere for a fix!"]},{"symptom":"Factory Reset - 0 sound        Motherboard: TUF-Gaming B360M-EMy Desktop's 2nd usb component was suffering from 'power surges' (I have an Intel(R) USB eXtensible Host Controller - 1.10 [Microsoft], 3 USB Composite Device's, and a USB Root Hub [USB 3.0]). I failed to fix the standalone issue & initiated a factory reset of my Desktop. Afterwards, unfortunately, I have 0 sound output and I cannot diagnose the issue. I have come here for some assistance with my issue.I'm a tech dud... I have attempted to reinstall audio drivers and update audio drivers (device manager), factory reset my computer again, followed the instructions of numerous youtube videos and other forums posts before posting on this forum. Sound is appearing in the volume mixer but there appears to be 0 sound output from my 'Realtek High Definition Audio,' 'Logitech G433 Gaming Headset,' or 'NVIDIA High Definition Audio:' https:\/\/postimg.cc\/CZKLDYGd - Possibly, this could be the issue, but I'm very unsure of how 'System Sounds' operations and don't want to make any changes before I'm more informed from professionals on this forum (Also, I just realised 'recording' seemed to be suffering from issues as-well): https:\/\/postimg.cc\/0M60Zzg4 - https:\/\/postimg.cc\/BLTHmkZr - https:\/\/postimg.cc\/75CkSymZ -Sound mixer is suffering from the same issue as volume mixer. I've tested audio input and the computer is recognising it, but I'm expecting the result to correspond with my output issues: https:\/\/postimg.cc\/hhxdgfxK So, the issue is that, my computer is under the illusion that output and input are working, but my speaker\/recording devices aren't plugged in - therefore, I can't hear anything or record anything. This happened after my initial factory reset. Thanks for the help. I'm not sure which is the appropriate topic to list this under but I've chosen 'performance & system failures' because that seems the most relevant.  ","solutions":["Hi Traiois. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you all possible solutions for Sound problems in order of priority, so please try any you've already tried again in order. If you have any problems performing any steps I'll be standing by here to help you.1) Update the sound driver from the PC or device maker's Support Downloads webpage for your exact model, if it is newer than the one presently installed in Device Manager reached by right clicking the Start button. While there compare to make sure you also have the latest BIOS, Chipset, Display, Network and all other drivers. 2) Restore the Windows Audio Service which may have become disabled: https:\/\/www.tenforums.com\/tutorials\/57567-resto... 3) Next try these checklists: https:\/\/support.microsoft.com\/en-in\/help\/402699... https:\/\/www.howtogeek.com\/443702\/how-to-fix-sou...4) Right click Volume icon in System Tray, choose Sound Settings, from the Output and Input devices dropdown menus, choose then one(s) affected to see if that helps. If not use the Troubleshoot button nearby.5) Run the Playing Sound troubleshooter at Start button > Settings>Update & Security>Troubleshoot.6) Try rolling back the sound drivers in Device Manager reached by right clicking the Start button. Choose Sound controller and other audio devices, then Driver tab, then Roll back if available.7) If no newer sound drivers then uninstall the one presently installed in Device Manager, reached by right clicking the Start Button. Restart PC to reinstall.8) Try other and older drivers for your model Sound controller, too. For example, try the next oldest driver in the model's online Support Downloads list. To try all previous drivers installed on your system, in Device Manager choose Sound controller's Driver tab, then Update Driver, then Browse, then Let Me Pick. Finally, try installing the latest Sound driver in Compatibility Mode as shown here:https:\/\/social.technet.microsoft.com\/Forums\/win...9) If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 10) If this was caused by a Version update (which you can confirm at Settings > System > About) then you can roll back the version in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 11) You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... 12) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. 13) If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I've now completed all of your suggestions, unfortunately, none of them appeared to make any difference or solve my problem. #1 'Realtek High Definition Audio' is outdated as indicated in this snip from a driver-update software called 'winzip:' https:\/\/postimg.cc\/tY5tfrWW\/2468a2b9 Unfortunately, this is a paid-service that looks malicious & I don't think I'll be using this in the foreseeable future. However, the most prominent issue still appears to be that my computer is not recognising that my device is 'plugged in' as indicated in the following snip: \"https:\/\/postimg.cc\/H8t5qxcd\/b8232f8e\" #3 Updates appear to be all good. I'm really concerned and confused to why this isn't working...Why is my Realtek High Definition Audio sound card 'Not Plugged In' along with numerous other output and input devices displayed in my original post? Is there an easy solution to this outstanding problem?Also, before I continue, is it possible that the 'power surges' caused by inserting my G433 Logitech Gaming Headset into my 2nd USB Component ruptured my sound card and should I send in my device to the manufacturers for repairs...? >:(","I would not use driver finder software as it can mess things up. Uninstall it now in Settings > Apps > Apps & Features, restart PC.Checking if the Windows Audio service is turned on or not cannot cause Youtube to fail. Was it on or not?Try another USB port to see if any are detected. Update your Chipset and USB drivers from the PC maker's Support Downloads web page for your full model number, HP Serial Number, or Dell Service tag from the sticker on PC.Compare the latest drivers with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now. If no newer or this doesn't help, then go to the USB category in Device Manager, open each Enhanced, Hub and Host controller, from Driver tab select Roll back if available, or if not choose Uninstall.If your keyboard and mouse are USB, first program the power button to effect the needed restart after Rolling back or uninstalling the driver. Go to Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do to choose Shutdown.If nothing else works then do a Repair Install, by installing Media Creation Tool and then choosing to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... -------------------------------------------- But remember that in Windows 10 everything depends upon the quality of the install, and Factory or Upgrade installs are inferior installs which most enthusiasts won't even run because they'd expect endless issues. Consider now or later doing the Clean Install in this link which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... There is also an automated Fresh Start that reinstalls WIndows while shedding corrupting factory bloatware, saves your files, but doesn't clear the drive to get it cleanest:https:\/\/www.howtogeek.com\/265054\/how-to-easily-... I hope this helps. Feel free to ask back any questions and let us know how it goes. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","The issue was that the usb port was 'broken' & I didn't realize. I appreciate your time though. "]},{"symptom":"Distribution List\/Contact Group in Windows 10 People        I'd like to use Windows 10 mail to send correspondence to a committee on which I serve. In Gmail (web) and in my corporate work environment (Outlook), I can create a distribution list or group contact (same thing). I am looking for that functionality in Windows 10 People. How do I do that? Or is it not a capability of the app? (and then, why not?)","solutions":["Hi Cal,Thank you for posting on Microsoft Community. We appreciate your interest in Windows 10.Unfortunately there is no option in Windows 10 People App to use Contact Groups. Please make use of theWindows Feedback app to send your thoughts across to us regarding this design\/feature request.Get back to us if you have queries regarding Windows, we will be happy to help you. Thank you,Microsoft Community.","Hi everyone,               I am a Microsoft support engineer and I want to gather more feedback from you in regards to the issue that users cannot send emails to multiple contacts in People App, so I can drive a feature request with Windows engineering group.                I have submitted a Feedback Hub post with the issue description here: https:\/\/aka.ms\/AA21cea                If you couldupvote the issue and leave a detailed comment about your frustration with the absence of this feature, that would help me make a strong business case for the request.               Thank you very much and please comment below if you have any more questions!"]}]}