{"windows":[{"symptom":"Slow performance after Windows 10 1903 update        I installed update 1903 and now my PC is not only running slower but on startup it takes forever getting the wait circle.  In addition to that I am missing the ability of using screen saver pointing to my picture folder.  I get an error saying photo gallery has to be set up.  I start photo gallery  and it says that it is missing the sql express server 2005.  I tried downloading this and receive two errors saying the install was bad.I then looked at restoring the PC back to the update prior to 1903 and I get a message that says I may have to re-install some apps.  I have worked in software for over 40 years and whenever an update went out it worked, or we got fixes out within a day, which was very seldom because of what we called QA.As big as Microsoft is I would think they would do Q\/A on your systems before releasing them to the public, especially since the updates are basically forced upon us!***Original Title: windows 10 update 1903 problem***","solutions":["Hello,If you feel that your system is slow after upgrading to newer version, I would recommend to makeclean install of that version. You can just backup all the data and simply do a clean install and then put all the data back. Regards."]},{"symptom":"Missing \"calls\" tab in Your Phone app        Hi,I want to answer my phone calls in windows using my headset and tried using Your Phone app.I connected my PC (updated windows 10) and Phone (Android 8) and paired them by Bluetooth, but there's no \"calls\" tab showing in the app.I've checked the instructions online and everywhere there's a calls tab below photos, messages and notifications.I'm not interested in seeing my photos or notifications or texting. The Only thing I want is the ability to answer phone calls in windows.Thanks for your help","solutions":["Hi, There's been some recent posts on the forum about this. It looks like the feature has been temporarily disable\/removed to fix some known issues.https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope that helps."]},{"symptom":"missing icon's        I apparently hit an incorrect button and my icons vanished from my desktop - windows 10.  The files are not affected they are all there but I would like to not have to go to every file when I want to pull up a file. How can I get those folders\/file icons back on the main screen? Every time I put in this question the response is about toolbars. My toolbar still has everything intact.....Judy","solutions":["Hi JudyLew1 check if the desktop icons are turned off right click on the desktop and select view -> show desktop icons this will put a check mark next to the menu item and display the desktop icons if this is not what you are referring to can you post a screenshot of the place these folders\/file icons are missing"]},{"symptom":"I am local account administrator but        I am local account administrator but do not have the rights to stop windows defender. Just switched from Windows 7 2days ago.I am the only person on this computer and had no problems with windows 7. 10 is a strange animal to me.ThanksRichard","solutions":["You should not stop Windows Defender.  It is the primary security provided for Windows 10.As an addition install Malwarebytes.These 2 do all you need.","You should not stop Windows Defender.  It is the primary security provided for Windows 10.As an addition install Malwarebytes.These 2 do all you need.  this does not tell me how to get administrative privileges. That is the question I'm trying to find out. Thank you","Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.You can turn off Windows Defender by going to START > Settings (the cog) > Updates & Security - then click \"Open Windows Security\"In the Windows Security page click \"Virus & Threat Protection\" then under \"Virus & Threat Protection Settings\" you'll see \"Manage Settings\". Inside there you will find an option to turn off scanning along with various other options.However Windows will turn the protection back on after a while as it's risky to leave it turned off.If you install another antivirus solution Windows Defender automatically gets out of the way - so there's no need to worry about turning it off manually in that situation.Regards, David","If you want administrative privileges it has no connection with Windows Defender.You need to go Settings, Accounts.","I went to Settings, Accounts,It shows your info (under the icon) JRALocal AccountAdministratorI don't know how to proceed from this point to be able to get total administrative privileges. Will you please take the time to show me how?Thanks Richard"]},{"symptom":"Can't install Intel Graphics Command Center from windows store.        I'm about to lose my mind if I can't disable this completely moronic dynamic contrast. It makes my Surface pro completely unusable. All I want to do is install this stupid program from the windows store but nooooooooo. Error, error, error.This is a fresh windows install. All I did was install firefox and then tried to install this. ERROR. I've tried every s****ne and NOTHING. Am I really going to have to send back my SECOND surface pro 7? Who's brilliant idea was it to make a graphics control panel only downloadable from the windows store? And why is this terrible \"feature\" on by default, and requires third party software to disable?So I have tried the registry edit fix, but my registry doesn't look like the one in the guides. I have tried resetting the windows store. I have tried resetting the drivers. Nothing I will do will let me install this damn program.","solutions":[]},{"symptom":"Smart card subsystem        I'm running Windows 10 and use a smart card reader to update a security card frequently. Lately when I plug the reader in I get an error message saying \"Unable to connect to smartcard subsystem\" . The tech support for the card service says this occurred during a Windows update. Thoughts? Help.","solutions":["With it plugged in go to Disk Management and see if it shows up and has been given a letter."]},{"symptom":"Windows 10 printer share fails after re- logging in to client        I have a printer attached to one Windows 10 computer (the host) on my private network, and I wish to use it from another (the client). With some difficulty (see below), I can set up and use the shared printer on the client, but if I log out from the client, and then log back in using the same account, the printer share no longer works.I have sharing enabled on the printer host, with the most permissive settings: for both private and guest\/public networks, I have turned on file and printer sharing, and also network discovery. In addition, I have turned on the automatic setup of network connected devices where it is available (i.e. private networks). In the All Networks section, I have turned off password protected sharing, and, for good measure, selected 'turn on sharing so anyone with network access can read and write files in the public folders' and dropped the encryption standard to the lowest (40- and 56-bit) option. To be doubly sure, I set the client to the same permissive settings.When I try to set up the share on the client computer, it is unable to find the network printer, depite having discovery turned on as described above. When I enter the host address and click 'browse', it prompts me for the name and password of an account on the host, despite password protected sharing being turned off. Having done that, the printer becomes visible and I can set it up and use it, but if I log off the client and log on again, I cannot print to that printer - it says that I do not have the correct credentials, but it does not present me with an option to enter them (which is not what I want, anyway.)What do I need to do so that I can get sharing to work according to the options I selected in the sharing dialog? ","solutions":["Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.Please download the printer driver from the manufacturer's website and Install the same.Then reconnect the printer to the network and check the status.","My apoplogies for not replying sooner. I decided to adopt a different solution, setting up a restricted-access account on the host and having the clients access it through that, using the 'save credentials' checkbox. That way, I get just the access I need, and I can turn off the more general sharing and discovery, and I have a better intuition about what is being shared by whom.FWIW, the manufacturer (Canon) did not have a Windows 10 driver, it said to use the Windows 9 one. Maybe that was part of the problem."]},{"symptom":"Kernel-Power ID 41        Hi everyone, I have bought a new PC and since then I have had these BSOD frequently. I have a list of the names of the blue screens as it showed.I performed a clean installation and installed all drivers, all updated to date.This is a list of the errors that appeared before the PC rebooted:-APC_index_mismatch-Driver IRQL Not Less Or Equal-Driver Power State Failure-Kernel Auto Boost Invalid Lock-Reference by pointerIn the event viewer the errors appear as \"kernel-power ID41\", all critical.I uploaded all the errors that I have, so please take a look. Here's the link https:\/\/1drv.ms\/u\/s!AtTfp6ASSfRygn-PAbz4MbpbEvwf?e=2RLUjPI did multiple tests including cpu and ram memory and the results indicate that there are no errors so I don't know what happens here. I suspect the PSU.Thanks for the help.","solutions":["Hi Franz, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved. Since you just bought this PC please contact the Seller and System Maker's Support. Multiple BSOD on new systems, especially the ID41, are not something a user should try to handle alone. That would hold true even for myself. As OEM the system maker is responsible for the proper operation of both the hardware and Windows. So regardless of the cause it is theirs to resolve. Added that even if you are some how able to resolve the issue you would still want it fully documented just in case there were related problems down the road. ====== The Event Viewer files were of no help which is not unusual in the case involving ID41.if you really want to try to troubleshoot this further (which I definitely do not recommend).Could be your computer just does not have the complete specs to run your programs or games. Best to check with the program and game makers' support and forums.Besides possible lack of power issues, over-clocking is also a major cause of this problem. Of course, hardware is always suspect in such cases.ID41 with no Bug_Check - The main cause of this issue as you have described is hardware related :https:\/\/support.microsoft.com\/en-us\/help\/202850...1. Over-Clocking -> best to reset ALL to the defaults especially while troubleshooting2. Memory (check thoroughly as indicated below). 3. Power Supply (see below to ensure you have enough power). 4. Over-heating - even if the overall temps are with-in specs a single component can be too sensitive to even the normal levels of heat and fault at a lower temp. Try adding a fan blowing into the case to reduce the effects of heat even more than the cooler usually does. Of course ensure all built-in fans are running. ==================================================== After checking determining the wattage of the power supply you will then need to check the requirements of the motherboard and devices. Usually the video card is one of the major power users.How do I determine how big my power supply is? http:\/\/www.computerhope.com\/issues\/ch000800.htmOther good sources of information are the device makers' sites and their forums. eXtreme Power Supply Calculator http:\/\/extreme.outervision.com\/psucalculatorlit...Power Supply Calculator https:\/\/www.newegg.com\/tools\/power-supply-calcu...Choosing the right power supply for your computer http:\/\/en.kioskea.net\/faq\/588-choosing-the-righ...How Do I Test the Power Supply in My Computer? http:\/\/pcsupport.about.com\/od\/toolsofthetrade\/f...==================================================== Memory tests do not catch all errors such as mismatched memory (possible even for sticks that appear to be identical) and when faster memory is placed in system behind slower memory. So it is best to also swap sticks in and out to check for those even if all memory tests fail to show a problem. To test RAM check here - let it run 4+ hours or so. <-- best method www.memtest.org MemTestX86 - Test RAM With http:\/\/www.tenforums.com\/tutorials\/14201-memtes...For the Windows Memory Diagnostic Tool. Type in Cortana's search box -> Windows Memory Diagnostics at top of list - click it. in Windows 8\/8.1\/10 the name is \"Windows Memory Diagnostic\". Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all.","Hi Rob, i did the test on every stick of ram with memtest with negative results and BSOD errors still appear.I have a enough room for power since i have a 750 watts psu.I have configured the system for dump files so i will post them when i get a few dump files.Besides that i dont have overclocking settings on my bios, just the defaults but i have DOCP profile for the Rams at 3200 mhz, just like the original ram specs.Here's the last minidump file: https:\/\/1drv.ms\/u\/s!AtTfp6ASSfRygwD5KudFIsYh-iB1?e=AjvhscThis is my rig:AMD Ryzen 5 3600Asus Tuf Gaming X570-PlusGeforce MSI 1660 Ti Gaming X 6GBCorsair Dominator 2x8 GB 3200 Mhz DDR4EVGA 750 GQ PSUWD Blue SSD M2 2280 500GBThanks again.","Did you run memtest86 for 4+ hours? It is possible the power supply is not large enough, check with motherboard\/ASUS and GPU\/GeForce for recommendations, or even that it is not properly functioning up to specs so check with EVGA (though it may not be the cause at all).Try adding a fan blowing onto the CPU and GPU as a test. Heat related does not always means excessive temps as a single component, such as a resistor or capacitor can be too sensitive to even the normal levels of heat.BugCheck 18, {ffffdd8538aab4e0, ffffdd85492e7080, 1, 1} Probably caused by : ntkrnlmp.exe ( nt!ObfDereferenceObjectWithTag+1bcbbe ) ntkrnlmp.exe is a Windows component which means something else drove it into Fault.Further detailed analysis was no help which is not surprising in this case. 1. cfosspeed6.sys dated 9\/3\/2019 Internet Accelerator <-- you need to uninstall this as it is either involved or masking the cause.2. fffff800`30fd0000 fffff800`30fd9000 eelam.sys Eset is either involved or helping to mask the cause so fully uninstall it. Use only Windows Defender which in Windows 8\/8.1 & 10 is a full antivirus.List of anti-malware program cleanup\/uninstall tools http:\/\/answers.microsoft.com\/en-us\/protect\/wiki...Uninstallers (removal tools) for common antivirus software http:\/\/kb.eset.com\/esetkb\/index?page=content&am...3. fffff800`30fe0000 fffff800`30fe9000 MbamElam.sys Malwarebytes - you need to fully uninstall as it also is either involved or helping to mask the actual cause. Use MBAM as an on-demand scanner only and not running resident (this is how I use it and reboot after every use). 4. Definitely uninstall Glary Utilities - such programs are more likely to cause issues, such as this one, while fixing nothing.5. Why are you running SpeedFan if not over-clocking anything? Uninstall it. 6. Troubleshoot blue screen errors <-- read this link http:\/\/windows.microsoft.com\/en-us\/windows-10\/t...------- Keep in mind this still can be a hardware problem that all the above makes worse.After ALL the above and if needed try running Driver Verifier - it might not help in this case though it is worth a shot.After doing ALL the updates you can, and if the issue continues, then run Driver Verifier. Driver Verifier can help find some BSOD issues : Using Driver Verifier to identify issues with Windows drivers for advanced users http:\/\/support.microsoft.com\/kb\/244617How To Troubleshoot Driver Problems in Windows Vista or 7. (8\/8.1 and 10 are essentially the same). http:\/\/www.winvistaclub.com\/t79.htmlUsing Driver Verifier https:\/\/msdn.microsoft.com\/en-us\/library\/window...WINKEY + X - RUN - type in -> verifier \/reset hit enter to disable If Driver Verifier creates a minidump upload it and post the link here so we can analyze it.Troubleshoot blue screen errors <-- read this link http:\/\/windows.microsoft.com\/en-us\/windows-10\/t...Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all.","Hi Rob, I still performing tests, so I uninstalled the five programs you mentioned and since then i didnt get more bsod.Now this is rare because I have noticed that the PC restarts at noon when I first start it on the day. And this day it did the usual, it restarted but this time there was no mini dump file in the system and either a blue screen. Beside that the system remained stable and no more blue screen at the moment.Then i performed additional tests with Pc-Check 6.1 (Bootable) and the result showed an error onDMA Controller. I don't know if this software is reliable, so I also did a test with HOT CPU Tester Pro but I didn't see any errors in the result, at least in the time I did the test. At the moment i will continue using the computer to check for blue screens.","Well, I don't know that piece of software so not sure how accurate it is. Best to check with it's support, ASUS's support, and retest the memory. Also, check the hard drive and its cabling.Use all the methods in my previous posts. It does look like a hardware problem. Maybe running some stress tests can help identify the problem. PC Stress Test free software for Windows 10\/8\/7 https:\/\/www.thewindowsclub.com\/pc-stress-test-f...Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all.","Hi Rob, i did another test to ram sticks. Each one with 8 passes and no errors.What i found yesterday is the CPU temps were high for Idle, so i was reading about this issue with amd and it was something with power plans. I changed that and the temp are lower now, im testing the system for stability.I will update more information if i still get more bsod.Thanks.","How long did the 8 passes take? If not over 4+ hours that is not conclusive.Heat definitely can cause such issue. Of course heat can be the result of over stressing the computer such as try to run software that is designed for higher spec'ed computers or by poor operating heat sinks and ventilation. Heat can even cause a single electronic component to fail, such as transistor, resistor, or capacitor even when the temps are with-in specs. So can loose fittings or connections.As you have found, an ID41\/141 can often be very difficult to resolve. Here to help, Rob","I left memtest running while i was at work. About 5 hours took to finish each one.I checked connections too.So im really confused about this problem, because the software issue was a trigger i think.Im monitoring the system, until now seems fine.What i have noticed is that motherboard sometimes doesn't boot, and show a yellow led on, so i have to hit reset button and then it boots to windows normally. This issue was from the beginning.According to the asus manual of my motherboard, the yellow LED indicates a problem with the Dram, but i tested the dual sticks and no errors.Maybe a bad bios but i flashed to update it before installing windows and no problems with the install, everything was fine.","Possibly a motherboard or still could be a power problem. Have you reseated everything, especially the cabling?A bad BIOS probably would not make the problem so intermittent. Rob","Yes, i checked the cables.Tomorrow i will do it again because i don't have more time today, but i don't think the cables are the problem.Of course the psu is still suspicious and no bsod until now.I will update more info about this issue."]},{"symptom":"Windows 10 Installation        I am trying to upgrade my Windows 7 computer to Windows 10. I have tried a d****t verifies, it does this and that, says checking for updates, gets to 46% then stops - forever. I paid $139 to Microsoft for the upgrade. I need to get the download method working or someone tell me how to get my money back. Thanks","solutions":[]},{"symptom":"Unable to Refresh Excel Sheet        I have a DAQ system that's sending data to the computer and creating a .csv file. I want to have the sheet refreshed every X seconds\/minutes without having to close the file and open it every time. This file is read-only. And when I go to the Data tab and click the arrow on Refresh All, the Connection Properties is in grey (doesn't let you click it). How can I solve this issue and have the sheet automatically update? Thank you.","solutions":["Go to the Office forum."]},{"symptom":"Microsoft account Password reset code        I keep getting this e-mail from Microsoft with a code to reset my password.  There is no explanation as to why I should need to reset my PW.  I have no apparent reason to do this and wonder if there's something I need to understand.","solutions":["I keep getting this e-mail from Microsoft with a code to reset my password.  There is no explanation as to why I should need to reset my PW.  I have no apparent reason to do this and wonder if there's something I need to understand.This is most likely the same as your bank asking you to reset your Internet banking password. In other words, it is fraudulent.","Hello natureboy_, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemYou need to see who is the Email sender, just click on the sender email address and it will show you the source,most likely this is a phishing attempt, just ignore the email. and for your own protection, if you felt like changing your password, you can login directly to your account Microsoft and then change your password from there.A helpful link can be found here, which will show you the successful and unsuccessful login attempts to your account.https:\/\/support.microsoft.com\/help\/13782\/If you have any more questions, feel free to ask Cheers! Farah","Thanks for replies.  Here is the e-mail's address:  *** Email address is removed for privacy ***","Hey there, the email address is valid and belong to Microsoft, It would advice to check your account activity, to see if there was any unknown log in attempts.You can check the last account activity in this link: https:\/\/account.live.com\/ActivityIf you saw anything suspicious, you can change your password if you want. Cheers! Farah"]},{"symptom":"Laggy Clips on Xbox Companion App and Laggy Videos on Microsoft Store App        I've noticed when I view my personal clips or my friend's Xbox clips, that they are lagging and look like they're playing at 10 fps. I've noticed this occurs on the background videos when you view an app on the Microsoft Store app too. I have a decent computer running on Windows 10 Enterprise that should be able to run these videos. If I left out any information that would be helpful please reply to this with what I should inform you and I'll get back to you as soon as possible.","solutions":[]},{"symptom":"Homegroup removed! How to get network sharing work with Windows 10 v1803.        Here is short description how I get my network sharing work with Windows 10 v1803.(I haven't never use Homegroup so I start directly from step 2.)1. Only for those PC's which are still using Windows 10 v1709 or older:    Disconnect from non-existing Homegroup if you have used it.2.1. All PC's: Check Network profile and Network discovery and Share settingsSometimes this selection to change between Private and Public network profile is missing from Settings \/ Networks page. In that case profile must change by PowerShell. Right Click Windows Icon (Start button) and open PowerShell (Admin) and use following commands to get interface index number and change profile to Private (or Public):Get-NetConnectionProfileSet-NetConnectionProfile -InterfaceIndex <index number> -NetworkCategory Private2.2. All PC's: Check Network Discovery and Share settings3. All PC's: Set Start type to Automatic and start following services that allow PC's to be visible on Network. (Reboot.)   Push Win Key and type \"Services\", locate these services.   - Function Discovery Provider Host   - Function Discovery Resource Publication   - SSDP Discovery   - UPnP Device Host4. Setting shares.4.1. Check your current shares.Open file explorer and type \\\\localhost to address bar to see what shares are made in this computer.4.2. Create new share (here I use folder \"Test\"). (Setting \"Turn on sharing so anyone …\" in Step 2.2.  make share for folders in C:\\Users automatic.)Folder is now shared and Network share path is: \\\\PCNAME\\Test4.3. Safe way to share folders.Create user account to all users on your network to whom you want to give access to shared resources.Use same user ID and password which they have on their own computers.Right click \"Test\" and open Properties and select Security tab to see current settings.Default security settings are shown in next picture.Those settings allow access to shared folder(s) only for those users who have user ID on that computer.4.4.  Sharing folder \"Test\" to Everyone\" (Very unsafe setting! Think carefully do you need to select this!)If you want that everyone have access to that share then go to Security tab and:- Click Edit- On Permission dialog click Add. - New dialog open and you can add \"Everyone\" to that list - When back to Permissions dialog select which rights you want to give to \"Everyone\".Now anyone on your home network should have access to shared folders without credentials or having user account on your computer.5. Now when click Network on File Explorer all your PC's should be visible in Computer and Network sections.This should be cover the essentials to sharing your data over local network. This share is not limited to C:\\Users folder, every folder can be handled like shown in steps 4.Now your PC's should visible, but if not then try to reset all network settings:Go to Settings \/ Network & Internet \/ Status, scroll down to find \"Network reset, on next window click \"Reset  Now\" button.It will takes about 5 min to perform this reset and then PC reboot automatic.When you sing in first time you get notification something like \"Do you want your PC to be access by other computers\", click Yes for that.If you get error message \"Windows cannot access \\\\PC_NAME\" when you try to connect shared folders then continue to step 6.6. There is some bug on Windows 10 1803 and because of that PC's can't always connect to each other by Name.If you get error \"\\\\PCNAME path not found\" you can solve this by adding your PC's and IP-addresses to hosts file.6.1 New routers (or modems) may have feature to remember which IP-addresses are assign to each device, but with older routers (or modems) you have to check that your router or modem is set give predefined IP-addresses linked to each PC's MAC-address.This way PC's will get same IP-address every time when it ask IP-address form router (or modem) DHCP-server.There should be some kind of list of PC names with MAC addresses and given IP-addresses of each connected PC. Picture show that list on my router. In my case with old router I had to select manual assignment  in each line. 6.2. Add all PC's IP-addresses and Names to hosts file (C:\\Windows\\System32\\drivers\\etc\\hosts). You can check your IP-address and PC's name by opening command prompt (CMD)For IP-address type command: ipconfig you get line like this: IPv4 Address ………. 192.168.100.101For PC name type command:  hostnameWrite down IP-address and Name of each PC and add those to that hosts file.To edit copy hosts file to some another location, right click it and use notepad to edit and save it. Replace original file with edited file. Because hosts file is located on system folder replace will ask administrators rights to perform it.# localhost name resolution is handled within DNS itself.# 127.0.0.1             localhost# ::1                        localhost   192.168.100.101  PC1   # Ethernet     192.168.100.102  PC2   # Ethernet   192.168.100.202  PC2   # Wi-Fi","solutions":["OK, I think I want to give this a try because I'm losing my mind trying different things that aren't working or are making things worse.  Plus, I already use static IP addressing tied to MAC addys, so maybe this might actually work in my environment.Question, though:  can you please expand on the very last bit?  I'm clueless about how to add the IP addys & names to the file you reference.  Thanks.","To edit copy hosts -table to some another location, right click and use notepad to edit and save it. Replace original file with edited file. Because hosts is located on system folder replace will ask administrators rights to perform it.","Thanks Craig,Even when this in manual it was running on my PC when I check it.There is some delay, what I was wondering, when I connect to shared resources first time after reboot. Maybe this delay is caused by starting that service when it is needed first time. That service is linked to SSDP and UPnP which are also required (with Wi-Fi devices?) so it would be better to set this to start automatic as you wrote.","Pauli, I don't mean to shout, but I'M SO HAPPY!!!  THANK YOU!!! I almost have a fully functional LAN again with everything seeing & having access to all again.  For troubleshooting purposes, I pulled all but 2 PCs, 1 Surface Pro 3, and a NAS from the LAN after the initial 1803 debacle after following Andre's second response here didn't fix things, so now I just have to power the rest up & edit the hosts table on those & fix the sharing as you describe.Pauli, your steps through 5a worked really well for me -- that's what made all the computers show up in File Explorer, Network, Computer.  For reasons that are far beyond my understanding, I think the removal of HomeGroups completely tanked the files & folder shares from all our Surface Pros.  If I had to guess, my guess would be that the PCs & laptops had originally been networked through Workgroup & those shares were preserved in the bowels of Windows somehow.Your steps on unsharing & resharing worked for me -- I'd been trying the Share, Remove Access in File Explorer, which wasn't particularly successful & created a sharing mess from the SP3.  When the PCs would access it (sometimes they could do so successfully but mostly not), they only thing they could \"see\" was \\\\SP3\\Users\\XXX\\OneDrive (which we don't use) & nothing else.  Arrgh!  Your steps helped me get that sorted.The final success was editing the host - table!  Access to the SP3 is golden now -- I've tested & restarted & tested & restarted until I'm blue in the face, and it is all good!  Thank you so much!Also, I'm going to try setting the Functional Discovery Services to automatic rather than automatic (delayed) as you suggest because on the SP3, I'm seeing the delay you mentioned -- on the SP3, the SP3 is thelast thing to appear in File Explorer, Network, Computer while everything else appears promptly.One final note:  on the SP3, I had to enable SMB 1 following 1803.  Prior to 1803, the NSA showed up correctly in File Explorer, Network as a Computer; following 1803 (and the corrections), it showed up only as a Media Device so many of the files were inaccessible.  I'm not sure why 1803 broke that (I recall having to do this on the PCs with the Fall Creator Update), but it was working fine on the SP3 without SMB 1 being enabled until 1803.Thanks again, Pauli -- I'm breathing much more easily now!","Hi Pauli O,Thanks much for your very detailed response to my issue.  Why Microsoft made the bonehead decision to dump the HomeGroup facility is beyond me.  It was an elegant and SIMPLE solution that we mere mortals could implement without having an IT technical degree to simply share photos or whatever among home network computers.  Ridiculous in the extreme.  I solved my issue temporarily by rolling back the 1803 version to a prior version and everything's the way I want it now.  I know it's only temporary but, for now, I'm satisfied.  Not everyone wants to dump their private stuff up to some hackable cloud storage facility in order to share stuff.  That's the weak answer MS gives to why they made this stupid decision.  ","Thanks. That worked.I had tried all of the steps before, but I didn't think or know about changing those Services settings to Automatic (Delayed Start). Now all three of my machines are talking again.I blame Microsoft for losing three to four hours over this. Good thing Users can't bill MS for time wasted over \"Updates\" - MS would be long bankrupt and gone.Now if they would please fix the no choice change to mouse wheel actions imposed by Edge (lose focus and scrolling up and down becomes back and forth between previous pages - I can't imagine how much time I've wasted grappling with that.Good luck with the next free Update, kids. I'm canceling that move to Surface Studio and looking for a Mac.","Thank you for this step-by-step. I have two Win 10 machines, both with the latest update. I have completed each of the steps you outlined, up to and including 6.1a.Computer A can see all of the shared folders on Computer B, but can only access the Users folder. I have stopped sharing the other folders and re-shared them giving all permissions to Everyone, but all shared folders excepting Users gives a \"You do not have permission to access...\" error.Meanwhile, Computer B can see Computer A on the network, but cannot see any of the shared folders; the error is \"The network path was not found.\"I've spent hours on this and I'm desperate. Any help is appreciated.","\"Everyone, but all shared folders excepting Users gives a \"You do not have permission to access...\"I wrote my instructions to make shares look something like it was with Homegroup and use only Users folder, where OS set security settings.Do you have same user name on both PC's? Then this shouldn't have any problem.Share to Everyone make folder available, but Security settings define who can access to folders. Make these settings can be little tricky at first and tests is better to do with some temporary folder.  Left: Access only named User. Middle: Access to all who have user account in this PC.You can change these rights: Click Edit, and Add. Enter User name to whom you want to give access.\"The network path was not found.\"Did you edit that hosts -table Step 6.2? When you try to connect from B to A this table tell Windows which is PC-A correct IP-address.","Little here and there right? I guess since you keep posting numerous comments and Tips (LOL) on my DISCUSSION THREAD that are …...., I will post a Great Link Here without all this ………….. you have posted above here.https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-networking\/connecting-pcs-and-users-for-sharing\/fb92e439-5dbc-4367-9857-1ef360e9ffdf","Because Microsoft's intentions are to \"force\" people to usie their so called \"One Drive\" feature.  The free lousy 5GB is not enough storage, and they know this. So the End User ends up shelling out money for additional storage."]},{"symptom":"\"imput timing not supported by monitor        after booting up computer, a box  \"imput timing not supported by monitor display change imput timing, change to 1920 x 1080\" appears.In Windows display, this resolution is already checked.","solutions":["Hi JamesBulkley, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.This error can be solved from the error-proof process, so, you must start Windows through a clean boot, you can also take the option in a safe mode that is explained and you get the link within this article. Once you run them go to the display settings >> Select the recommended resolution, then go to >> Advanced display settings >> Display adapter properties >> Tab: Monitor >> Set the refresh rate to 60 Hertz >> Restart the computer.https:\/\/support.microsoft.com\/en-us\/help\/929135...For safe mode follow the advanced recovery menu to take this option, this process will apply, in case the clean boot does not work.Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M."]},{"symptom":"screen correction        how do I reverse my screen from horizontal to vertical.","solutions":["Hi ABennett1 Right click your Desktop, choose Display Settings There you will find a 'Display Orientation' drop-down, which is used to rotate your screen . . ."]},{"symptom":"Sound Problem With Headphones With Windows 10 PC        There are 2 speakers that i use on my computer: Speakers and HeadphonesWhen I plug in my headphones, the sound comes out my speakers. On the control panel, It says my headphones aren't plugged in, and that my speakers are.When I really unplug my headphones, My PC tries to play out my headphones and there is no sound. You know it tries to play out the headphones because in the control panel, It says my headphones ARE plugged in and that my speakers are not plugged in.I don't UNDERSTAND WHAT IS HAPPENING!!","solutions":["Hi, JustusPagan0__0 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps. - Press ‘Windows key + I’ together to open ‘Settings’. - Click on ‘Update & Security’. - Click on ‘Troubleshoot’. - Click on ‘Playing audio’. - Click on ‘Run the troubleshooter’. You can also update the audio drivers. https:\/\/support.microsoft.com\/en-us\/help\/402844..."]},{"symptom":"erased laptop need to reload windows        I bought a laptop from my work that had been completely erased even the windows operating system.  I have a multiple license for Windows 10 home edition.  What do I need to download on a memory stick to be able to load onto the laptop?","solutions":["Hi, kendallm My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.I recommend you look for another computer to create a USB https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.wikihow.com\/Install-Windows-10Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"MY COMPUTER CANNOT  INSTALL APPLICATION        my computer cannot install aplications. please assist","solutions":["Hi sekoro Please provvide a bit more detail for us to work with . . . Are you installing software from the Microsoft Store or are you installing 3rd party software and what is the exact error(s) you are seeing when you try to do that?Open the Settings App (gear icon on your Start Menu) Go to System - About What is the exact Edition (Home, Home S, Pro . . etc) of Windows reported there?"]},{"symptom":"win 10        Does internet traffic cause this only happens certain time of day also is there a wat to adjust keyboard delay ","solutions":["Hi, timmaddox My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps to repair your Internet connections: Enter the Start menu or by pressing the Win + I key combination, open the Settings and click on the Network and Internet option. Once there, we select the Status option from the menu on the left side and, within the configurations and options that are loaded in the right panel, we have to look for the restoration of the network. When you click on this option, it will show us a new window from where we can restore the network in Windows 10. In this way, all network adapters will be removed and reinstalled, and the original configuration of other network components will be restored. net. This implies that if we were using some software, such as a VPN client or virtual switches, we will have to reinstall them.A process that the system performs automatically by clicking on the Reset button that is now displayed in Network Reset in Windows 10 settings. It is normal for the process to not take long, although we must wait until the end completely and restart the computer to continue with the network configuration in Windows 10 as we have done so far.https:\/\/www.kapilarya.com\/how-to-reset-network-...https:\/\/support.microsoft.com\/en-us\/help\/10741\/...You can also check that your drivers are updated. https:\/\/support.microsoft.com\/en-us\/help\/402844...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"‘No applicable devices linked to Microsoft account’        i have been trying to download sims 4 on my windows 10 lenovo. It says ‘you own this game’ and gives me the option to ‘install on my devices’ however when i click this, it tells me i dont have any applicable devices linked to my microsoft account. I do have a microsoft account and it is linked to my windows 10 laptop. Is this an issue with windows 10? It was very expensive so i therefore expect to get my moneysworth. Do i need am Xbox account? Is that the issue? Very frustrated i just wanted the sims and have discovered that many people have the same issue. Help me microsoft!","solutions":["Hi Maggie. I'm Greg, an installation specialist and 9 year Windows MVP, here to help you.See fixes working here:It looks like you don't have any applicable devices linked to yourGame Pass install probsDid you go into your MS account from which the game was purchased and confirm that the Lenovo laptop is listed as a linked Device? Sometimes with more than on e MS account a device will be linked to another account and not the one the game is registered with. Confirm that first. If it's clearly linked to the same account you bought the game with, then I'd contact Store support here:https:\/\/support.microsoft.com\/en-us\/help\/28808\/...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I'm having this exact same problem with Halo Wars 2: Ultimate Edition on windows store.","Hi Greg, I happen to have the same exact issue as Maggie concerning a game I purchased on the Microsoft store. I did what you recommended but when I try to add a device it doesn't find any. Could you tell me how to check if my Lenovo is connected to my Microsoft account? ","I am also having a similar issue. Has this issue found a resolution?","I have sims 2, 3 and 4 but all are in the Origin clientEA is the publisherif you have the game from the MSFT store, you may need to reset the storeopen an elevated command promptwsresetand this will reset the store which should get you back in business","I am just as concerned as Maggie is. I tried downloading Minecraft on my Windows 10.. I had already installed the Minecraft Windows 10 Edition... but I wasn't able to invite my friends.. So I tried installing Minecraft, just Minecraft. Once I purchased it, it said my device wasn't applicable, so I tried everything I could. Microsoft isn't really an application you can trust.. I am very frustrated.. Is there any possible way I can get a refund?? Thank you.","I am also having a similar issue. Has this issue found a resolution?     No, I'm afraid it hasn't. I wasted $30.00, and I am still unable to play the game I purchased.","Same problem here. I bought the XBox Game Pass for PC yesterday, downloaded, installed and played one game no problem. Now trying to install Wolfenstein 2, and it says I have no linked devices which is impossible.SOLVED: You have to join the Windows Insider Program. Joining that allows you to update Windows higher than is normally available, and then you can install any game... Not good, but that's it.","Hello Greg, I recently upgraded to Xbox Game Pass Ultimate. When I try to install a game, while signed into my account, from the MS webpage, I get a dialog box stating:Where do you want to install?It looks like you don’t have any applicable device(s) linked to your Microsoft account. To install, sign in on a device with your Microsoft account.My account manger shows my PC on my devices' listing page. I linked to the manager using the same account, which displays \"My account login\" on both the page trying to install and the devices listing. Apparently the dialog cannot access the devices linked to my account. When I did not use the \"....\" -> \"Install on my devices\" and just clicked \"Install\/play\" the install did kick off and is apparently working.  ","Hello, When I try to install a video-show app in MS Store in windows 8.1, while signed into my account, from the MS web page, I get a dialog box stating:Where do you want to install?It looks like you don’t have any applicable device(s) linked to your Microsoft account. To install, sign in on a device with your Microsoft account. When I did not use the \"....\" -> \"Install on my devices\" and just clicked \"Install\/play\" theinstall did kick off and show only cancel button."]}]}