{"windows":[{"symptom":"Can't reactivate Windows 10 after a motherboard change        Recently I changed motherboards in my computer that had legitimate, activated Windows 10. Now whenever I log onto my computer, the \"Activate Windows\" watermark shows up in the bottom right corner, and it's pretty annoying, so I tried to reactivate Windows like any sane person.I did the following:Settings >> Updates & Security >> Activation >> Troubleshooting >> I changed hardware on this device recentlyWhenever I log into my account to verify my identity, it just reports the message \"Unable to activate Windows. We can't reactivate Windows as our servers aren't available right now.\" I tried again, and AGAIN, and nothing. I've looked for solutions with no success, and I've run out of ideas. ","solutions":["Hi RandomDude07, I'm an independent advisor and hope I'll be able to help. I assume you were not able to activate Windows 10 with a digital license when you signed in to your Microsoft Account.Did you activate Windows 10 previously with a Product Key? If so, you’ll need that key again after the hardware change. Select the Start button, then select Settings > Update & Security > Activation > Change Product Key, then enter the product key.Let me know if I can help you further!","I am unsure if I can do that as I bought my computer from a third party seller who had installed activated Windows 10 on the computer, and I do not know the product key. I am still using the same hard drive with the same installation of Windows 10, if that helps. Is there any way that I can find out what my product key is without tearing apart my computer and putting my old motherboard back in?","If a Product Key was used to activate Windows 10, it should show up with this command, otherwise it will be empty.1. Launch Command Prompt as Administrator. 2. Run this command wmic path SoftwareLicensingService get OA3xOriginalProductKeyYou could also try this tool - https:\/\/www.nirsoft.net\/utils\/product_cd_key_vi.... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. If both comes up empty, then you would need to try putting back the old motherboard.","hello comnutsi have the same problem with activating my windows 10 proi have the product key in back of my windows 10 pro DVD cover, I change the key in activation page but it not fix activation.there is many help page about activating and all of them are included with the same info, which is troubleshooting and changing the product key after sign in to your Microsoft account! I did this things and it doesn't helpplease inform us more than usual info that we can find in any internet page and Microsoft help page and Microsoft activation help or any thing like this, for sure we read them first then trying to asking about problem here ","Whenever I use the command, all it comes up with is this:I supposedly obtained my product key from the program you linked, but whenever I attempted to use it to activate it all that came up was:(Sorry for the late reply, I was busy with other things)"]},{"symptom":"cancelation        At this point I don't want a refund but do not want any more charges on mt account. I have tried to cancel windows media but have no had any luck. Help!","solutions":["Hi Delma. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.What exactly did you buy? Office 365 subscription? An Assure contract for tech support? Nothing else should have recurring charges.Is it possible you accidentally clicked on a fake Microsoft link and bought something from someone other than Microsoft? There are a lot of imitators out there.What I'd do is sign into your Microsoft Account and remove the payment method for now, as shown here:https:\/\/support.microsoft.com\/en-us\/help\/402659...Contact your bank or credit card and tell them you want the charges canceled and why. They will tell you exactly how to challenge them if you don't feel they're legit.If necessary contact Microsoft Customer Service here: https:\/\/support.microsoft.com\/en-us\/help\/405170... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I got Windows media to try to get my DVD to work. I Have tried the ways you've said over and over. So far I've gotten no where.","Please answer my questions a in first post. You gave me a bad rating without even beginning to explain the problem. Where do you say what is wrong at all?","sorry didn't know I gave you a rating at allo","Greg, I simply want to fix my windows media so I will not get billed monthly. If that means dropping windows media that will be fine.","Will you please explain the issue you are having? It is still not clear at all. What Windows Media did you want to cancel and how did you attempt this so far? Is There something I can help you fix? Please describe.","What Windows Media? There is no such thing I know of except the media used to install Windows which is free."]},{"symptom":"Windows not booting        When I turn on my PC this error happens","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.An important file that Windows requires to load has become corrupted for some reason. You should hopefully be able to recover that by using System Restore.If you press ESC from that screen to access the recovery options look for System Restore which will be able to unwind your settings back to before the error occurred.Regards, David","System Restore doesn’t work","Hello DaGameGamer. Are you able to boot to Safe Mode? When you get to the screen you shared press F8. If you CAN get to safe mode with networking try repairing the system with the windows 10 install media found here,https:\/\/www.microsoft.com\/en-ca\/software-downlo... If you do not have internet access click the search bar and type scanreg.exe and run. This will attempt to fix your registry errors.Note this can be done if you cannot get to safe mode and select command prompt in the first step instead of safe mode by typing the same scanreg.exeKind Regards, Andrew","I can’t go into safe mode or use scanreg.exe","Hi DaGameGamer and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/remotedesktopwindows10.com\/0xc0000225-e...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","None of those instructions work"]},{"symptom":"Itunes in Windows 10        I downloaded the iTunes app from the Microsoft Store.  The app will not automatically open when my iPhone is connected, even though the settings in iTunes should allow it.  Has anyone else had this problem?","solutions":["Hi JM Check the Autoplay settings in Windows 10, to see what that is set to Connect the iPhone to the PC Open the Settings App (gear icon on your Start Menu) Go to Devices - AutoPlay Make sure that is set to 'Do Nothing' . . .","Hi Dave, I did what you suggested and iTunes still doesn't open.  I have to click several times on the shortcut on the task bar and it eventually opens.Thanks, John","Hi JM, Have you tried the \"non windows store app\" ? You can download it from apple's website.Let me know if this version allow the auto-launch Regards Jay","Just saw your suggestion at 1544 PST; I will uninstall the \"store\" version, download the website version and let you know.Thanks, JM","Dave, This is interesting.  I uninstalled the store version and attempted to download the software from the apple website.  I am redirected to a page that tells me to download it from Microsoft.  I'm sure that I had the website version on my prior PC and it worked okay.  Do you know if there is a trick to downloading it?  Thanks, John","Go to : https:\/\/www.apple.com\/itunes\/scroll down past the laptop, and you'll find : Looking for other versions ? macOS Windows Select Windows, and you'll be able to select : Download iTunes for Windows now (64-bit) Jay","Jay, Thanks for the information, but when I downloaded the 64-bit version (two were available, and I downloaded the most recent version), it would not run.  I got a message that a dll file that iTunes uses was created by a newer version of iTunes.  I'm assuming this file was created by the \"store\" version.  I'm not sure what to do at this point.John ","Well, you might have to uninstall the store version. I'm not using any Apple product, so I can't test it by myself.","It's weird; I did uninstall the store version before downloading the website version.  I just reinstalled the store version, and I can get it to work okay with an extra click or two, so I'm going take this off my list of things to worry about.  Thanks for your help.","Thank you for your feedback. Have a nice day Regards Jay"]},{"symptom":"trying to use currently owned scanne        Hi All!  I have had my Windows 10 laptop for about 6 months and my sister just bought hers. We both have Brother portable document scanners. However, when she tried to download the software for it, she got the message stating it wasn't supported by Microsoft. The whole Windows S mode thing. Any suggestions? Is there an app that would be compatible? It was fine for our printer which is a cannon. Thanks!","solutions":["Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.Can you give me the model of the scanner? And do you have windows 10 S on both laptops?","Try Windows Fax and Scan which is found in All apps under Windows Accessories.","Thanks Marco. It is a Brother DSmobile 620. My sister is the one who originally tried to use hers earlier today. She has one for work but brought it home to use it as they are closed this week. I have  one as well for genealogy.  I just plugged mine into the USB port on my laptop. The cursor spun like it was going to recognize it and then stopped. I opened up the File Explorer and the scanner wasn't showing up. So I went to Settings and under \"Bluetooth and Other Devices\" it was showing up as an \"other device\". When I looked at it, it looks like my laptop thinks it is a USB storage device and not a scanner. When I looked under \"Printers and Scanners\" it is not listed. When I try to add it by searching for scanners, it doesn't find it.In the next post, the person suggested using the app Windows Scan, I downloaded that but I think I am having the same issue. I opened the app and it says to Connect a Scanner.  But, my scanner is connected. The whole issue maybe that the laptops maybe recognizing the scanner as a storage device and not a scanner. Any suggestion would be appreciated.  Thanks! ","Thanks!  It didn't help, it looks like my laptop may be recognizing the scanner as a storage device and not a scanner. I explained in my reply to the previous post.","Did you look in Device Manager and find it?Did you happen to check with Brother for software and driver?","Did you install the scanner with the installation CD that came with it? If not, download the latest updated drivers from this site. https:\/\/support.brother.com\/g\/b\/downloadtop.asp...The site is in French but the drivers do not seem to be on the English version ...._________________________________________________ Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Sorry I am just getting back to you. I have a bad neck and can't get on my laptop very often. This is in my previous answer to Marco.I opened up the File Explorer and the scanner wasn't showing up. So I went to Settings and under \"Bluetooth and Other Devices\" it was showing up as an \"other device\". When I looked at it, it looks like my laptop thinks it is a USB storage device and not a scanner. When I looked under \"Printers and Scanners\" it is not listed. When I try to add it by searching for scanners, it doesn't find it.","Sorry I am just getting back to you, I have a bad neck and can't get on my laptop as much. No, the scanner doesn't come with disk and my laptop doesn't have a drive. I can go to the Brother website and download it but this is the message I get. I'm trying to use the scanner and not go out of S-mode, unless that is the only way to do it. But is that a good idea, to go out of S-mode? If I do, then don't I have to get fire wall and antivirus and web-protection, etc? "]},{"symptom":"tablet        HiI have a tablet one-month-old now it keeps jumping to different things without touching the screen also whenI touch on the screen don't respond to my command also did a factory reset no help tried recovery mode no help?Thank you","solutions":["Hi timmaddox, What version of Windows does your tablet has? For detailed guide on how to fix touchscreen, please check this article: https:\/\/www.makeuseof.com\/tag\/fix-touchscreen-w...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"random whea uncorrectable error at random time        I keep this BSOD ever since I made this built. My PC is an i9 9900k running on an MSI meg ace z390 motherboard. I have 32 GB of corsair 3000 MHz ram and an MSI 2080ti seahawk x. I recently did an RMA on the i9 9900k CPU, thinking that must be the cause but I am still getting the error. I already did multiple fresh installs of window 10 with all drivers installed but that didn't help at all. So at this point, I thinking it's a hardware error but I need help pinpointing the culprit and the part that makes it really difficult is the randomness of this error. I could go for days or weeks without seeing this error. I already tried running furmark and prime 95 to synthesize heavy workload but that doesn't cause the error at all... I can provide the dump file if that helps!! Thanks in advance!","solutions":["Hi, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.We need log files(called dump files) that tell us what lead to crash. Please share them with us for a better analysis of the problem. Instructions can be found here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Please let us know if you need any assistance about posting dump files.","here is the dump file link: https:\/\/1drv.ms\/u\/s!Aiuk_l0CDW8Su0CW2Yvwv4xUDMWX?e=1TWf6R","Thanks. BCC124 is usually a hardware problem and can be difficult to troubleshoot. I see an unknown error was observed on the processor.A system log might tell us the additional cause of the problem. To better understand the issue, please see the article below on how to share System logs.http:\/\/www.yourwindowsguide.com\/2017\/12\/how-to-...Also see: https:\/\/answers.microsoft.com\/en-us\/windows\/for...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads.Technical Information: km:0x124_genuineintel_processor_mae_unknown","here is the event viewer log: https:\/\/1drv.ms\/u\/s!Aiuk_l0CDW8Su0hMm0tnp1CZjKJp?e=twRbwvBase on my observation, I believe this only happens during idle, as I have never experienced this while gaming or under heavy workloads. I hope this information helps, Thanks for looking into it!","The analysis again indicates a processor issue: A corrected hardware error has occurred.Reported by component: Processor CoreError Source: Corrected Machine CheckError Type: Cache Hierarchy ErrorProcessor APIC ID: 1The details view of this entry contains further information.It can be failing hardware or a motherboard bus. Are there any BIOS updates available for the machine? Run the CPU test and post the results. https:\/\/www.tenforums.com\/tutorials\/16474-prime...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads.","I just did a downclock and overvolt on my CPU. This seems to solve the issue for now. I suspect this is a motherboard bios or clock turbo mechanism issue, where the clock went too high and the voltage cannot sustain the clock."]},{"symptom":"How turn off security warning dialog OneNote 2016 desktop?        How can I turn off the security warning dialog in OneNote 2016 desktop? I'm linking to files on my own, stand-alone, no-network machine and it's gettingreally irritating having that dialog every time. I went to File>Options>Trust Centerbut there's no toggle for this.Thanks.","solutions":["Hi Bennet, You may want to check this article for detailed guide on how to disable security alerts.https:\/\/support.office.com\/en-us\/article\/enable...Please let me know if this will work. I'll be waiting for your feedback. Thanks and regards,"]},{"symptom":"\"Like What You See?\" photos on computer screen        How do you stop these photos and put on a photo of your own choice? It seems that even though they ask whether you like what you see, they are clueless as to what you like. They have no method of narrowing it down to photos you might possibly like. So I would like to stop wasting time with this and just have a photo of my own choice as a computer screen background for log in. How do I do that?","solutions":["Hi HapEco, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.If you go to Start, then select Settings > Personalization Then under \"Lock screen\"﻿ - this is for your log in You can change the setting from \"Windows Spotlight\" to \"Picture\" You can also change the setting for \"Show lock screen picture on the sign-in screen\".I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"Windows 10 Acer Swift 3 Nvidia MX150 BSOD Since 1809 upgrade. Still occurring in 1903 upgrade        Below is a description of the problem++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++Unfortunately, I have not had a response from someone who can escalate this issue with Microsoft. Long story short, I have had the above laptop since August 2018 which was preinstalled with 1803. The system comes with a i5 8250u, 8GB ram, 250GB M2 SSD and a MX150 Nvidia. The laptop works perfectly on Windows 10 1803 with no BSODs or any error messages. On upgrading to 1809 the system will crash either when installing the nvidia driver or once a game or 3d application has finished using the nvidia GPU. For example, I can run a game for one hour with good temperatures and no graphics abnormalities; everything seems normal. However once the game or photoshop has been closed and I am back on the desktop using the intel GPU, a BSOD VIDEO_DXGKNL_FATAL_ERROR is always shown. This does not happen with 1803, and this does not happen when using a Linux OS.All different drivers from acer, intel, nvidia have been tried, uninstalled and re-tried. It does not matter which driver I install as they do not fix the problem. This issue that I am experiencing has been discussed on this MS community website, and on the acer forums. The only resolution thus far is to rollback to 1803 where the system is 100% stable. Tonight I decided to read about the new 1903 update that is soon to be released. I am currently signed up to the Windows Insider Program and have updated to the latest preview build. Tonight I have found that the same issue when installing the GPU, or once a application\/game has finished using the GPU my system will GSOD \/ BSOD just like 1809. This issue has been ongoing since 1809 with lots of users posting about this problem when using a google search. I am now currently at a complete loss as the issue does not seem to have been fixed, or had the attention from someone who could possibly put measures in place to fix this. I have disabled the Nvidia GPU in device manager so that I am able to type this post without having tons of BSODs when only a web browser is open. Since I have moved to 1809 and 1903; tonight I have had over 20 BSODs with five of them happening after entering the login pin at the password screen. Once the nvidia gpu is disabled and I am only using the Intel GPU, the system is 100% stable but without the high performance from the nvidia GPU. I really appreciate anyone who can assist me with this further.+++++++++++++++++++++++++++++++++++++++++++++++++++++++The above problem has been reported on a number of Forums, but basically the same problem.The only known fixes that have worked appear to be to go back to Windows 10 1803, the disable any further Windows updating. Or to disable the Nvidia MX150 device. None of these fixes are a permanent solution for myself. This problem started with Windows 10 1809 release, and is still a problem with Windows 10 release1903.Do Microsoft know about this problem? Is it being addressed? Have Microsoft put out any information regarding this problem? When will it be fixed?","solutions":["Hi,Thank you for writing to Microsoft Community Forums.We understand how difficult it could be when the computer doesn’t work how it is supposed to, we will look into this for you.We would like to know the complete model number of the laptop. To check type msinfo32 in the search bar on the Taskbar and hit Enter. Please share the system model information from it.I see that NVidia has released a hotfix driver, I suggest you to try installing thehotfix and see if that helps for you. I suggest you to refer the troubleshooting steps in the article Troubleshoot blue screen errors and see if that helps.If the issue persists, I would request you to share the minidump file with us so that we can analyze it and help you with the appropriate troubleshooting steps. You can locate mini dump file in location:c:\\windows\\minidump. Please upload the files in OneDrive and share the OneDrive link.Please reply with the status of the issue, we will be glad to help you further.Regards,Nikhar KhareMicrosoft Community - Moderator","Hi,Many thanks for the reply. My laptop information is as follows :-OS Name Microsoft Windows 10 ProVersion 10.0.18362 Build 18362Other OS Description Not AvailableOS Manufacturer Microsoft CorporationSystem Manufacturer AcerSystem Model Swift SF315-52GSystem Type x64-based PCSystem SKU 0000000000000000Processor Intel(R) Core(TM) i7-8550U CPU @ 1.80GHz, 1992 Mhz, 4 Core(s), 8 Logical Processor(s)BIOS Version\/Date American Megatrends Inc. V1.08, 21\/12\/2018SMBIOS Version 3.1Embedded Controller Version 1.04Over the months since the 1809 was updated on my laptop, I have tried all the options that have been posted on this forum, and other forums. As previously advised the only options two that stop the BSOD are :- a) downgrade  to 1803 realease b) disable Nvidia driver on 1903 release. (I did not try this on 1809 release).My processor is a Kaby Lake so I'm not sure that your suggestion of intstalling the Nvidia fix will be relevant, as this fix appears to be for the Sandy Bridge processor.I have looked at my mini dump and it identifies the problem to be with the video driver. I am perfectly willing to send you the mini dump if you think that will be useful.Bearing in mind that returning to Windows 10 1803 gets rid of the problem, and disabling the Nvidia driver also gets rid of the problem, leads me to the assumption that the problem lies within Windows or the Nvidia driver.Regards,Steve Ross","Hi, Thank you for replying. Apologies for the delayed response. As you have mentioned, the issue doesn’t occur in Windows 10 1803 and by disabling NVidia drivers in Windows 10 1903 build, it could be that the drivers are not supported properly for the latest build of Windows. However, I would suggest you to share the mini dump files, so that we can get to the root cause of the issue and troubleshoot accordingly. Regards,Nikhar KhareMicrosoft Community - Moderator","https:\/\/drive.google.com\/file\/d\/14_apBAoHPkyqlWkxfbz8Hf3jV6gYRreo\/view?usp=drivesdkI have the same problem and this is a minidump from my laptop","If you have an Acer SF315-52G or similar I suggest you to repor your problem... in my case I'm in touch with Acer Support and they are investigating my problem, with more reportings they will be more involved to find a solution.contact ACER from here:https:\/\/it.answers.acer.com\/app\/ask#_ga=2.91817626.128925724.1571997965-1180544559.1571511265","Thanks for the reply.I have already reported this to Acer, who told me that it was a known problem, and they were in contact with Microsoft to work out a solution. In some future release of Windows this should be fixed, and they will keep me Informed.For the time being I have disabled the Nvidia driver, and have not had any futher BSOD's.","I will be following this thread.If acer solves this problem it would be very kind of you if you post it in this thread.I am holding the feature update in windows update settings for this problem until it is resolved. Btw my laptop model is sf315-51g but i dont see any difference between the specs of 52g other than the storage so i guess they will get the solution to this problem at the same time.","As said before, you have to disable the NVIDIA card from device manager and the PC will run stable untill Acer or Windows will find a solution. That worked to me to.","Please rest assured that one I hear from Acer regarding the solution to this problem, I will post it on this thread.","I have contacted Microsoft Technical Support regarding this problem. The have told me that the problem is with the Nvidia driver not supporting the 1809\/1903 Windows releases. As such the problem is with Acer.As mentioned earlier by DsEdo, as many people as possible should be reporting the problem to Acer, to put pressure on them to solve the problem."]},{"symptom":"Flight Simulator X 2006 stopped working after installing 2004 version        I was running Flight Simulator X 2006 on my Windows 10 laptop. Then I installed Flight Simulator X 2004 version. After that 2006 version stopped working","solutions":["Hello Koko, my name is Alexander. I'm an Independent Advisor and I'm happy to assist you!I’ve investigated your query and found out that the game is not compatible with Windows 10For reference: Flight Simulator X: Minimum System Requirements https:\/\/support.microsoft.com\/en-us\/help\/925724...However, I recommend that you try some troubleshooting methods and check the issue.Method 1. Run the game in compatibility mode. For reference: Make older apps or programs compatible with Windows 10 https:\/\/support.microsoft.com\/en-us\/help\/15078\/...Method 2. Perform a Clean Boot. For reference: How to perform a clean boot in Windows. https:\/\/support.microsoft.com\/en-us\/help\/929135... If your computer is working normally in Clean Boot, refer to the section How to determine what is causing the problem after you do a clean boot from the same article. Once done, refer to the section Reset the computer to start normally after clean boot troubleshooting.Method 3. Updating the graphics card drivers. For reference: Update drivers in Windows 10. https:\/\/support.microsoft.com\/en-us\/help\/402844... Best regards, Alexander B."]},{"symptom":"error  0x800f0831 update 1909   will not download  feature  update        all my regular  downloads are great this is the first time having code  0x800f0831   when the feature update starts , any ideas    ","solutions":["Hi Keith, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Try updating to 1909 using Media Creation tool and if it fails let us know. The fastest way to get the upgrade is through Media creation tool or ISO file. Please download Media Creation Tool from the link below and select Upgrade this PC at the first screen.https:\/\/go.microsoft.com\/fwlink\/?LinkId=691209All steps, including upgrading using ISO file and Media creation tool, are covered here:https:\/\/www.yourwindowsguide.com\/2019\/11\/update...Content on the above blog is written by a Microsoft MVP so it is safe.","yes it worked I have done that before   but was curious about the code and why    , thanks regardless,   happy turkey  , ect tanks keith ","Glad to have helped, let us know if there is anything else you need help with :)If you have no other questions feel free to mark the thread as answered and choose an appropriate rating. Have a good rest of the week.","hi thanks I have struggled with this now for 3 months windows just wouldn't update. I tried re installing windows twice and the updates just wouldn't take. then I found your solution I had success immediately, so thank you I am truly gratefulP Osmond  "]},{"symptom":"Windows 10 log-in        Hi, so I've been having an issue with my computer where every so often my computer says \"your organization requires to change your pin\" and it makes me change my pin. It makes me change it to a new one and it has done this 3-4 times over the span of a few months now. I tried to get rid of this but I cant seem to. Now it is making me create a password instead of a pin, and the password requirements are ridiculous. It's making me choose a password with: 8+ characters, numbers, uppercase, lowercase, AND symbols. I don't want any of this, all I want is a pin that is 4 digits. Please help me change it back to the way it was originally. Thanks. ","solutions":["Hi Matthew, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.It sounds like your password requirements are being set by your company's IT policies. Can you confirm if this is (or was) a company owned laptop or personal?If it is company owned, the password requirements are set by the IT department and cannot be changed without their permission. This includes the forced changes which you have seen, however once a week seems like a lot, unless you are working with sensitive information. Please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","Hi ashton, this is a personal computer, with no organization which is why I am confused as to why my \"organization\" is asking me to change my password considering I am not under one with this computer. ","Hi Matthew, Thank you for confirming this. When you are logged in to Windows, press the Start button, and type in: lusrmgs.msc and press Enter. This will bring up a window for Local Users and Groups. On the left side, click on the Users folder, then locate your user account on the right side.Then, right click your username, and click \"Properties\". There should be a checkbox here for \"Password never expires\". You can select this and then press OK to save.---- Another area to check is within the Local Group Policy Editor to ensure the PIN expiration is disabled.Press the Start button, and type in: gpedit.msc and press Enter. This will bring up the Local Group Policy Editor. In the folder structure to the left, go to Computer Configuration > Administrative Templates > System > PIN ComplexityOn the right side, there is a Setting called Expiration, and you can set the value to 0 to have the PIN never expire.A website with screenshots to follow: https:\/\/www.top-password.com\/blog\/tag\/your-orga...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. These two steps should prevent password and PIN expiration. Please let us know if this has helped and if you have any further questions! -Ashton","I typed these both into my search and it just brought up \"See web results\" with nothing else.","Hi Matthew, Sorry about this, can you try to press the Windows Key + R on your keyboard, and this should open the Run dialog box.This is also where you can enter in the lusrmsgs.msc and gpedit.msc -Ashton","Windows cannot find either of these in my computer. Is there anything else I can try?","Hi Matthew, It sounds like you might have Windows 10 Home installed then. One way to do this is to open the Command Prompt as Administrator:Start > type in \"cmd\" , and you should see Command Prompt, Desktop app come up. Right click on this, and select \"Run as administrator\"This will open up a black window called Administrator: Command Prompt To disable password expiration for your account, type in the command: wmic UserAccount where Name='YOURUSERNAME' set PasswordExpires=False then press Enter. If it is successful, it will display \"Updating property(s) of ...\" followed by \"Property(s) update successful.\"Hopefully this works, and will resolve the prompts you are receiving about the password and PIN expiring.-Ashton","Okay this did work, thank you very much. ","Hi Matthew, thanks for getting back to us! Please monitor it over the next few weeks, and please feel free to come back and post if it is still prompting you for some reason!Regards, -Ashton"]},{"symptom":"Lagging mouse after clean install        Mouse ( Microsoft wired) pointer lags with 'short freezes' after a clean install of Windows 10 (Version 1809 or 1909). It always occurs several minutes after the installation has completed but preforms ok until then. Have tried multiple times with same results. Any ideas (a process, a service, conflict...?)","solutions":["Glad to hear it. To do a true Clean Install all partitions on the drive should be deleted. This prevents build up of old unused partitions into a disk junkyard.See the gold standard Clean Install tutorial here: https:\/\/answers.microsoft.com\/en-us\/windows\/for...You can ask any other questions in the clean install tutorials comments.Let me know if there is anything else. If not Please mark the post which helped most as Answer, to help others. A rating is also appreciated."]},{"symptom":"Importing photos from iPhone to laptop        I use the MS Photos app to import photos through USB. But the MS Photos App fails to import them with error message Something went wrong... The Photo App doesn’t recognize my phone with a message We're having trouble connecting.Solutions?","solutions":["Hello Pengielo, my name is Alexander. I'm an Independent Advisor and I'm happy to assist you!First I recommend that you refer to the article https:\/\/support.microsoft.com\/en-us\/help\/402749... Сheck if iCloud enabled on your iPhone. It is important because you can't download your photos or videos with iCloud enabled. You should use the iCloud desktop app in this case because your images exist on iCloud but not on your device. iCloud Desktop app on Windows can help you transfer the photos. For reference: Transfer photos and videos from your iPhone, iPad, or iPod touch. https:\/\/support.apple.com\/en-us\/HT201302#importpcIf your computer doesn't recognize your iPhone, iPad, or iPod. https:\/\/support.apple.com\/en-us\/HT204095Best regards, Alexander B. ================== Standard Disclaimer: This post contains link(s) to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it"]},{"symptom":"I get error code 80505800C when Windows Update tries to install KB915597        I get error code 80505800C when Windows Update tries to install KB915597","solutions":["Windows update catalog doesn't even have that installation.http:\/\/catalog.update.microsoft.com\/v7\/site\/Search.aspx?q=915597https:\/\/social.technet.microsoft.com\/Search\/en-US?query=915597&ac=2#refinementChanges=60&pageNumber=1&showMore=falseThat update is Windows defender.Open control-panel\/defender\/HELP tab\/Search for updates..If it fails,in cmd type: services.msc   in msc scroll to Defender\/double click\/set to; Auto start  start service,exit msc..maybe try windows update..Also,install windowsupdateagent-7.6-x86Also,in add\/remove,Windows components\/services,chk the box for  .NET  windows requires this.And,in catalog link above,type: 890830  download & run,this too is required for OS..","Windows Defender in Vista\/windows 7 is an Anti-Spyware Program, not an Anti-Virus Program.You should have an Anti-Virus installed.If you are using Norton, AVG, Avira, Microsoft Security Essentials, McAfee, etc the default action is for Windows Defender to be disabled, as those AntiVirus Programs have their own Antispyware Applications.It is nothing to be worried about.Using the two Programs at the same time can cause System conflicts, etc. ________________________________________If you are using a different Anti-Virus, please read this:\"How to Start\/Stop Windows Defender service\"http:\/\/computerstepbystep.com\/windows_defender_service.html@@@@@@@@@@@@@@@@@@@@@@If you wish to have extra protection against Malware use the FREE version of Malwarebytes AntiMalware:http:\/\/www.malwarebytes.org\/products\/malwarebytes_freeAnd to now change Startup Programs in Windows 7 without using Defender, use either of these Methods:\"How to use MSCONFIG in Windows 7\"http:\/\/www.netsquirrel.com\/msconfig\/msconfig_win7.htmlOr the FREE Autoruns Program:\"Autoruns for Windows\"http:\/\/technet.microsoft.com\/en-us\/sysinternals\/bb963902Cheers.","I'm installing a new copy of Win 7 Pro 64 bit (retail) onto an older system. I also have an older copy of Win 7 Pro 64 bit (retail) installed on my primary system, and ran into this issue before, and solved it but I don't remember what I did to solve it.I recall some issue about SHA1 versus SHA2 (SHA1 was deprecated back in Sep, 2019), and had to download one or two files from Microsoft and run them. I don't know if this was for the Defender install bug or a different bug."]},{"symptom":"update disabled fingerprint reader        The issue occurred after the last update. Now I cannot use fingerprint reader. It is Lenovo Yoga. Note, I reinstalled drivers, problem is here","solutions":["Hello MA, my name is Alexander. I'm an Independent Advisor and I'm happy to assist you!I’ve investigated your query and found out that there is a chipset driver’s update available for Lenovo laptop. I recommend that you install the update from the Lenovo websitehttps:\/\/pcsupport.lenovo.com\/us\/en\/products\/lap...For reference: section Fingerprint Issues from the article Popular Topics: Fingerprinthttps:\/\/pcsupport.lenovo.com\/us\/en\/products\/lap...Best regards, Alexander B. ================== Standard Disclaimer: This post contains link(s) to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it"]},{"symptom":"Unable to use Microsoft Store        I live in Canada but my Microsoft Store won’t let me install apps because it requires payment only with US credit card. Perhaps the first payment was in US dollars from the US territory and the service remembers the method.","solutions":["Hello Tadeusz, my name is Alexander. I'm an Independent Advisor and I'm happy to assist you!I’ve investigated your query. If you create Microsoft Account in one region and then try to make a purchase from a different region, you might face an issue.I recommend that you refer to the article https:\/\/support.microsoft.com\/en-us\/help\/10622\/...If the problem persists, connect with the Microsoft Store support team https:\/\/support.microsoft.com\/en-us\/help\/28808\/...Best regards, Alexander B."]},{"symptom":"Error: FH601 while launching Forza Horizon 4        Hi everybody. Ive recently tried to start FH4 but it wont start up, but instead gives me this error. Ive played a lot of FH4 but first got this problem recently. I have read an other post with this problem but it didnt solve the problem. Thank You.My PC´s specsWindows - 10 Pro N 64-bit - Version 1909.GPU -  GeForce RTX 2070CPU - Intel Core i7 7700 @ 3.60GHzRAM - 16GB","solutions":["Hello Jannis, I am Andrew an independent advisor. Are your updates fully complete? From what I know this error applies to media dlls missing that are included in Windows Update.Kindly check your updates via Settings>Security & Updates.Download anything that may be missing.","My pc is fully updated with everything. I updated my pc yesterday.","Ok Janis, this is the media pack I mentioned. Download and install, you should be set after.https:\/\/www.microsoft.com\/download\/details.aspx...Take Care,Andrew","It still does not work. But thanks anyways.","Hi Jannis, \"FH601\" This means that some Windows Media components are missing, and your version of Windows 10 is missing the necessary media .dlls to install Forza.To resolve this issue, download the required Windows Media components for free at Media Feature Pack for Windows 10 N and Windows 10 KN editions.https:\/\/support.microsoft.com\/en-us\/help\/313371...Please let me know if this will help you solve you issue. Thanks and regards,","This \"Windows Media pack\" does not work for a reason im not known for, Ive installed it 3 times and it wont work. I really dont know the problem. Thanks for the help."]},{"symptom":"Windows 8.1        Hello,I have Windows 7 Pro and would like to upgrade to Windows 8.1. The Microsoft technician with whom I chatted said that I could use my Windows 7 product key to install 8.1. It's not working. I assume that the technician was wrong. Is there anything else that I can do?","solutions":["The Technician was wrong.Windows 8.1 does not come for free; you have to buy it.10 may suit you.@@@@@@@@@@@@@@@@@@@@@@@It depends on the hardware requirements of later operating systems and also whether the computer\/laptop manufacturer supports and supplies drivers for the later operating systems as to whether it is possible or feasible to upgrade or not.Windows 8 is no longer supported.@@@@@@@@@@@@@@@@@@@@@@@@Follow these steps before you buy  Windows 8.1; extended support ends January 10, 2023 .Check to see if your Computer\/Laptop Manufacturer has Windows 8.1 Drivers available for your Model.If not available, Windows 8.1 will not install and work correctly for you.\"Windows 8.1 system requirements\"http:\/\/windows.microsoft.com\/en-us\/windows-8\/system-requirementsWindows 8\/8.1 does not come for free; you have to buy itMicrosoft no longer sells 8\/8.1.Try amazon.com, etc.Warning:You do not buy a Product Key by itself, as they are normally stolen\/pirated, Volume Licenses which are not for private use, or MSDN keys which are not to be sold by the original subscription holder.Make sure that you buy the complete sealed package (DVD, license)https:\/\/www.microsoft.com\/en-us\/howtotell\/Shop.aspxRead Section: Beware of Product Keys sold separately.@@@@@@@@@@@@@@@@@@@@@@@You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700","Thank you all for your responses. I sort of figured the technician was wrong, but you confirmed it.  And your other advice is valuable as well.","As I was saying you may still get 10 for free, but do the checks.And 8.1 doesn't have the old style Windows 7 Start Menu in it, which a lot of people don't like.Cheers.","Windows 8.1 might not be the best OS,as all are getting win 10 OS..Win 10 has lots of advantages compared to 8.1.Either way,to upgrade to either,you must run the Microsoft\/Windows media creation tool.Follow the Microsoft\/TechNet link for options.https:\/\/social.technet.microsoft.com\/Search\/en-US?query=windows%207%20upgrade%20to%20windows%208.1&ac=5Even this link can be edited for more..https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/manufacture\/desktop\/windows-81-upgrade-scenarios-for-oemsthe 2nd link gets you variables from win 7 to 8.1","I have given you the correct information on what to do.Don't get confused like you were before.","Thank you Mr. Smithers. I will check into all that you suggested. I appreciate your patience."]}]}