{"windows":[{"symptom":"How to reinstall disappered \"system restore service\" key in Windows 10 Registry?        Hi,Can somebody send me a xxx.reg file to restore \"system restore service\" key?Thanks a lot!-Leonid","solutions":["Hi Leo. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See Christin's comment (at bottom) on Command Line registry edit for System Restore here:https:\/\/www.windows-commandline.com\/enable-disa...Remember to set a System Restore point before editing the Registry, although you can always reverse the edit: https:\/\/www.windowscentral.com\/how-use-system-restore-windows-10If this does not help run System File Checker and if necessary DISM from Step 10 of this checklist:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...And if that fails do a Repair Install by installing the Media Creation Tool from this link   http:\/\/windows.microsoft.com\/en-us\/windows-10\/media-creation-tool-install choosing Download Tool Now, install the tool, open it and choose Upgrade this PC Now.  This reinstalls WIndows while saving your files and apps in place; takes about an hour, resolves most problems.  It also brings it to the latest version by the most stable method.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Lock screen suddenly needs alt-ctrl-del to get out of        Suddenly, without me changing any settings, the lock screen requires (invoked by pressing <WINDOWS>-<L>) me to press <ALT>-<CTRL>-<DEL> before I can enter my password to resume using the computer. Before it would respond to any key, or just prompt me to enter the password. The only thing I knew of that would do this was for the Welcome screen, which is unaffected. Also, I checked the setting for that, and it is unchecked. How do I make it so that I don't need to hit <ALT>-<CTRL>-<DEL> before I can enter my password?I'm sharing the house with other people, and they might see me walking away from the computer as an invitation to use it, so I frequently lock it so they don't mess up what I have open and forces them to log in with their own accounts.","solutions":["Hi SlickRCBD Click your Start Button, then just type netplwiz and hit Enter On the resulting dialog, choose the Advanced Tab At the bottom, is this option turned on - 'Requires users to press Ctrl + Alt + Delete'if so, turn that off . . . .","If you look at the pic I included, it was already unchecked. Although I used \"control userpasswords2\" to get the dialog box, it looks identical.What else can cause it?","Hi SlickRCBD Are you using Windows 10 Pro, rather than the Home Edition? If so, open Group Policy Edit, navigate to the following location: Computer Configuration - Windows Settings - Security Settings - Local Policies - Security OptionsDouble click 'Interactive logon: Do not require CTRL+ALT+DEL' Set that to disabled and save that setting . . .","Thank you, that seems to have done it having tried it quickly by elevating MMC (I'm typically logged in as a standard user), selecting the \"Group policy object editor\" snap-in, changing what you described, and then running \"gpupdate \/force\", then trying <windows>-<L>.","Hi SlickRCBD Are you using Windows 10 Pro, rather than the Home Edition? If so, open Group Policy Edit, navigate to the following location: Computer Configuration - Windows Settings - Security Settings - Local Policies - Security OptionsDouble click 'Interactive logon: Do not require CTRL+ALT+DEL' Set that to disabled and save that setting . . . OK, I did that and it seemed to fix the problem for almost a month.Except that I just went to dinner and hit <WINDOWS>-<L> before eating and when I got back the computer would not let me log back in until I hit <ALT>-<CTRL>-<DEL>.It did it earlier today as well when I went to the bathroom.I checked the checkbox is unchecked and the policy \"Interactive Login:Do not require CTRL+ALT+DEL\" is enabled.Very annoying as I think the computer has crashed when I don't get prompted for a login as it doesn't react to anything but mouse movement (not clicks) and CTRL+ALT+DEL.Sorry, I keep using an old convention that was popular with the Apple II for modifier keys in the 1980's. I used Apple II's when I was learning computers in grade school and had an Apple IIGS as my first computer. Old habits die hard."]},{"symptom":"Windows defender is acting weird.        So, I recently got a brand new computer, and I wanted to personalize some of my settings. I went to windows defender, and when I tried to open some of the settings, I kept getting the \"You'll need a new app to open this\" window. I've been having a hard time trying to find a solution to this problem, but that may be just me being bad at looking. Anyone know a way I could fix this?","solutions":["Try this:https:\/\/thegeekpage.com\/fix-youll-need-a-new-app-to-open-this-while-opening-windows-defender\/"]},{"symptom":"Cant install minecraft on my devices        I'm writing this from the pc I have linked to my Microsoft account, but when I try to download minecraft it can't find any devices. what is wrong?","solutions":["Hi Kranie. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.If this is a Game Pass install then see known fixes here: https:\/\/www.reddit.com\/r\/theouterworlds\/comment...If not I'll give you everything possible to repair the store. Even if you've tried a step please do it over in this sequence. If any steps cannot be performed then report it and move on to the next:1) Try updating Store apps: https:\/\/support.microsoft.com\/en-us\/help\/402625... 2) Make sure you have the latest Windows 10 version 1909 in Settings > System > About and if not skip to Step 10 to install it by the most stable method.3) See if the fixes here help: https:\/\/www.pcworld.com\/article\/3053099\/windows... 4) Try running the Windows Store apps Troubleshooter at Settings > Update & Security > Troubleshoot.5) Try resetting the Store cache: http:\/\/www.thewindowsclub.com\/reset-windows-sto... 6) If that fails go to Settings>Apps and highlight Microsoft Store, choose Advanced Settings, then Reset. After it resets, restart PC.7) If that fails then reinstall Store. Type CMD in Start Search, right click Command Prompt result to Run as Administrator, copy the following code and paste it into the box using the Edit tools from Box's top left dropdown menu, press Enter:PowerShell -ExecutionPolicy Unrestricted -Command \"& {$manifest = (Get-AppxPackage *WindowsStore*).InstallLocation + '\\AppxManifest.xml' ; Add-AppxPackage -DisableDevelopmentMode -Register $manifest}\"8) Clear the LocalCache Folder: Open Run by pressing the Windows key + R hotkey. Copy and paste %localappdata% in Run and click OK. Open Packages> Microsoft.WindowsStore_8wekyb3d8bbwe > LocalCache folder. Press the Ctrl + A hotkey to select all content within the LocalCache folder. Press the Delete button. 9) If these all fail then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account because of the serious and persistent problem with corrupted accounts. Then continue with the other steps to go over your install most thoroughly.10) If nothing else works then do a Repair Install, by installing Media Creation Tool and then choosing to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"pop ups        When Outlook took over my Gmail a pop up from Google started popping up on my screen and prevented me from continuing the work I was doing!  How do I stop it?","solutions":["Go to the Office forum.","Hi, JoeX.com Please, Post this on msoffice forum."]},{"symptom":"Pioneer BDR-2209 INTERNAL BD\/DVD\/CD WRITER        Hi! My Pioneer BDR-2209 INTERNAL BD\/DVD\/CD WRITER in OS Win 10 64-bit STOP working. Do not recognize any disks.Can somebody help me, please? Thank you. Sincerely, DustinP.S. Is recognize in DEVICE MANAGER","solutions":["Look in Disk Management (win + x)","Hi!I did services.msc and Shell Hardware detection service and set it to Automatic in sted Manual, but do not help. I also update Firmware and Update, but NOT work.","Device SCSI\\CDROM&VEN_PIONEER&PROD_BD-RW___BDR-209M\\4&240534BA&0&000100 was deleted.Class Guid: {4d36e965-e325-11ce-bfc1-08002be10318}","Driver Management concluded the process to install driver cdrom.inf_amd64_1dfbe3feec5cf192 for Device Instance ID SCSI\\CDROM&VEN_PIONEER&PROD_BD-RW___BDR-209M\\4&240534BA&0&000100 with the following status: 0x0.","Hi DusanNaus, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved.Well the drive could just stopped working. Here is how to troubleshoot it. Start - type in the Search Box --> Restore Click on Create a Restore Point - create a Restore Point. This is so you can always get back to where you are now if needed.Then in Device Manager - Right Click the drive and Uninstall. After it completes click OK - then restart the computer.If still not working then in Device Manager - Right Click the drive and Update driver. Complete and if it finds a newer driver check the drive (it might request a reboot first).====== If still not working use ALL of these as if the drive was not showing in Device Manager (the methods are the same).Check with the System Maker's Support, their on-line documentation and drivers, troubleshooting, and ask in their forums about any known issues.Your CD or DVD drive is not recognized by Windows or other programs https:\/\/support.microsoft.com\/en-us\/help\/314060...Fix: DVD Drive Not Detected In Windows 8\/10 http:\/\/www.intowindows.com\/fix-dvd-drive-not-de...===================== If needed let's test the CD\/DVD drive to see if it works at all : Try this to see if the drive is viable at all (you will need to make these on another computer since yours will not start - XP, Vista, 7, 8\/8.1 , or 10 or even running Linux does not matter). You could also try booting with another Windows disk - any OS though do not use it to try to ANY repairs unless it is absolutely the same version of Windows on your system - just boot to see if the drive works. You can even make a Windows 10 DVD boot disc by running the Windows Media Creation tool (on any computer) -Windows Media Creation Tool (make 32 or 64 both disk same as the OS version you are running. http:\/\/www.microsoft.com\/en-us\/software-downloa...Setup\/Settings (BIOS\/CMOS) often F2 so watch the screen as you boot - set the boot order to CD\/DVD first. Remember to set it back when done.Or try booting to a Linux boot disk. If the drive will not boot to these then it has failed or there are other hardware issues affecting it. However even it does boot that does not mean there are not some possible hardware issues affect the drive's other functions.Trinity Rescue Kit - Download on upper right of page http:\/\/trinityhome.org\/Home\/index.php?wpid=1&am...Hirem's Boot CD is another good choice http:\/\/www.hirensbootcd.net\/download.htmlhttp:\/\/www.hirensbootcd.net\/cd-contents\/138-hbc...System Rescue CD http:\/\/sysresccd.org\/Main_PageScan a Windows PC for Viruses from a Ubuntu Live CD http:\/\/www.howtogeek.com\/howto\/14434\/scan-a-win...Use Ubuntu Live CD to Backup Files from Your Dead Windows Computer http:\/\/www.howtogeek.com\/howto\/windows-vista\/us...Check the cabling to be sure nothing has come loose. ====== After the above, if it will either not read and\/or write the drive has developed a hardware problem and needs to be replaced. Keep in mind that CD\/DVD drives are 4 drives in one so it is not unusual (actually expected) that one or two will fail while the rest works. The options are to buy another replacement internal drive or to use a USB external drive, or forego having one at all.Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all.","Thanks guys. My device - BDR OPTICAL DRIVE is working again. 😎👍👋","Have you had any luck with the drive? Here to help, Rob"]},{"symptom":"Windows 10 randomly slows        Hello there. I´m having a weird problem with my computer, and maybe you can help me. I´m usually able to solve this things by myself, but not this time.This is the thing. My Windows 10 started to randomly slow down some months ago. That´s basically it. It didn´t get better after rebooting, and a year had passed since the last Windows install, so I did a clean installation. But still the same problem, even after the first rebooting - and no extra software installed. I thought it was the updates, so I stopped them. But nothing. Same after a new installation with full updates. A third attempt at a clean install was directed to find a driver conflict. I learned that Windows was wrongly updating some drivers, so I stopped that, and installed the correct drivers everywhere. Still the same. I checked the HD health with some software I don´t remember: it was fine; as a matter of fact, the only task that is not slowed down is HD writing: I can copy or download files at normal speed, but everything else, including opening the start menu, is slowed to turtle speed. I use Avira antivirus, and checked for malware with Malware bytes; also nothing. I also checked the event viewer, but there are of course many errors there, and I can´t identify which could be relevant, even focusing on those that occurred when the slowing starts. Also, the usage of resources looks fine during the event: CPU usually under 10% in idle, an doesn´t go up 25% in activity; RAM usage is normally under 30%, and HD at 1%.I got out of ideas, and let it be. The system eventually returns to normal, usually after a couple hours. And after some weeks, the thing just went away for months, but now it came back.Despite the general uncertainty of it all, I have been able to identify what seem to be (maybe) triggers of the event: sometimes it happens when the system goes into suspension; recently, plugging\/unplugging the AC charger seems to be the main trigger, though it doesn´t happen everytime.Some facts: the computer is a Dell Inspiron laptop, 7000 series. CPU: i7-7500U GPU: Intel 620.If someone has any idea, I´ll be happy to read it.Thanks in advance,N","solutions":["Hi Nicolas, You might want to check these suggested steps on how to improve performance of your Windows 10 Operating System:https:\/\/www.windowscentral.com\/15-tips-increase...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Hi, thanks for the answer. I think that might be useful to anyone experiencing a permanent slowing; in that case, I would have already tried some of that tips. However, my computer works perfectly fine until something turns it into a slug, and some minutes later it returns to normality. It´s not even software related, I think it is somehow a W10 problem.Thanks and regards,N","Hi Nicolas, If you suspect that this is actually from Windows. Most likely, this is caused by a previous Windows Update. You can try this as well. What I can suggest is to rollback the updates: https:\/\/lifehacker.com\/how-to-undo-and-prevent-...And disable your windows update for the mean time, please follow this link for detailed guide:https:\/\/www.cleverfiles.com\/howto\/disable-updat...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Hi, and thanks again. I´ve already tried that. As a matter of fact, I made a clean install with an older version of Windows and disabled updates. Same thing happened after the second restart, even when no extra software was installed, just un-updated Windows. On the other hand, it doesn´t look like a hardware issue. It makes no sense.","Hi Nicolas, Upon reinstalling Windows, are you able to install all related drivers including all Chipset Drivers for your Motherboard?Please clarify this, as this might also be the reason why you're experiencing this kind of issue.Thanks and regards,","Hi again. Yes, I suspected it could be related to that. So I tried updating every possible driver, and also not updating anyone after a clean installation. It didn´t make any difference.The most perplexing thing is precisely that it still happens even after a clean install of an old W10 version with no updates of any kind, including drivers.Thanks again,N","Hi Nicolas, How about trying to install newer version or other build. We can check that as well. Please let us know if you need further assistance in regards to this concern. Thanks and regards,","Hi there. Also tried that. After a clean install of an old version and disabling updates, I tried installing the latest version available and updating Windows and drivers. It didn´t work.Thanks and regards,N","Hi Nicolas, Can you please provide the Full System Specification of your PC as well? There's a chance that this is not just software related but that might be hardware as well.Thanks and regards,","Hi Richard, thanks again.I don´t think it´s hardware related, because the slowing occurs every now and then, and it´s triggered by events like plugging or unplugging it to the power adapter. I checked the CPU temp and the HD status, and everything seems normal.However, these are some specifications,  in case you can figure out something:Dell Inspiron 15 7579 Micro: Intel Core i7 7500U 2.7GHzGPU: Intel 620RAM: 12GB DDR4Bests,N"]},{"symptom":"Issue with my audio on windows 10. Volume not loud even on 100%.        Hello,So I currently have this issue where my audio is really not loud. I just recently used a razer blade 2018 and with plugged earphones I could hear loud and clear when my volume was at 30 and it was always like that for all and any pc I connected to. I just recently built mine and when I use the on board sound card of the motherboard, I barely hear anything at 30 and at 100 it doesn't even feel as strong as 30 before. I have tried many things. I installed drivers from the motherboard's company, restarted, used windows update, used device manager to uninstall and re-install, tried different earphones\/headphones, plugged them in front of the case instead of the motherboard directly and played around with sound settings such as audio quality, enhancements and tried different audio outputs (for example speakers or monitor speakers). I'm getting similar results everywhere. No matter where I search on the internet it's always the same exact thing everyone says over and over and over which I have already attempted many, many times. I already uninstalled the drivers, re-installed them (as I mentioned) updated literally anything I could. Opening device manager doesn't show me anything that doesn't have a proper driver installed. It's a really annoying and persistent issue that I cannot seem to solve. It would be appreciated if someone could share with me their fix to the issue. I wanted to add that I am on Windows 10 Pro version 1909 OS Build 18363.535","solutions":["Hi Ennajh. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you all possible solutions for Sound problems in order of priority, so please try any you've already tried again in order. If you have any problems performing any steps I'll be standing by here to help you.1) Update the sound driver from the PC or device maker's Support Downloads webpage for your exact model, if it is newer than the one presently installed in Device Manager reached by right clicking the Start button. While there compare to make sure you also have the latest BIOS, Chipset, Display, Network and all other drivers. 2) Restore the Windows Audio Service which may have become disabled: https:\/\/www.tenforums.com\/tutorials\/57567-resto... 3) Next try these checklists: https:\/\/support.microsoft.com\/en-in\/help\/402699... https:\/\/www.howtogeek.com\/443702\/how-to-fix-sou...4) Right click Volume icon in System Tray, choose Sound Settings, from the Output and Input devices dropdown menus, choose then one(s) affected to see if that helps. If not use the Troubleshoot button nearby.5) Run the Playing Sound troubleshooter at Start button > Settings>Update & Security>Troubleshoot.6) Try rolling back the sound drivers in Device Manager reached by right clicking the Start button. Choose Sound controller and other audio devices, then Driver tab, then Roll back if available.7) If no newer sound drivers then uninstall the one presently installed in Device Manager, reached by right clicking the Start Button. Restart PC to reinstall.8) Try other and older drivers for your model Sound controller, too. For example, try the next oldest driver in the model's online Support Downloads list. To try all previous drivers installed on your system, in Device Manager choose Sound controller's Driver tab, then Update Driver, then Browse, then Let Me Pick. Finally, try installing the latest Sound driver in Compatibility Mode as shown here:https:\/\/social.technet.microsoft.com\/Forums\/win...9) If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 10) If this was caused by a Version update (which you can confirm at Settings > System > About) then you can roll back the version in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 11) You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... 12) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. 13) If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hello Carmack,Thank you for taking the time to reply to my issue. I tried all the steps you gave me but unfortunately nothing worked. It's still low volume when I put it on 100. I can confirm that it's not my earphones because I own a usb sound card which I tried and I didn't have any issues with it other than lower sound quality. I even tried rolling back drivers to Microsoft ones and then installing the driver provided from the company's motherboard (which was an older model) and used the usb media tool to rollback quality of life update to no avail. I happen to accidentally find what the issue was. From the realtek audio console app (which is downloaded from microsoft store), I found that in \"Device advanced settings\" tab found at the bottom left had \"Speakers\" option in back panel analog output.... I put it to Headphone and it was instantly back to how it was supposed to be. Alternating between the usb sound card and on board I don't see any difference except the sound quality. I believe the audio was less amplified because it was in ''Speakers'' settings. Hope this helps someone.","Are you saying that changing Advanced Settings in Realtek Control Panel (from Store) to Headphones instead of Speakers made your sound louder in your speakers?What if you uninstall this Realtek Control Panel you got from Store? What is it used for? Unless you have special settings sound control panels are not usually needed and can often get in the way, you just need the installed driver.","It made the sound louder on my headphones, not speakers. I had already uninstalled Realtek Control Panel (from the store) before writing this thread. It didn't do anything , I only managed to fix the issue when I manually set the analog output to Headphones instead of Speaker. Below is the Realtek Audio Console from the microsoft store.","Thanks for reporting back to help others."]},{"symptom":"Cannot Disable Secure Boot        In BIOS, there is an option to disable\/enable Secure Boot.Whenever I disable it then go to boot windows, it tries and fails to boot about 5 times, then goes to a windows screen saying something along the lines of 'Cannot load windows, restart or troubleshoot'.Troubleshooting does not work, nor does restarting.When I switch from UEFI to Legacy in boot list options, it simply says that there was no OS detected.Is there a tool or something that I can use to disable it instead? TL;DR: Cannot Disable Secure Boot because if I do I cannot boot to windows.","solutions":["HI Connor. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.This is not common but also not that unusual. Secure Boot sometimes is necessary to keep Windows running on a UEFI install. It is dependent upon the BIOS firmware, so you might want to check yours is up to date. But no guarantees.Changing a UEFI install to Legacy will never boot unless you reinstall in Legacy Mode. Disabling UEFI is like buying a new car and disabling all the safety features.If you tell me why you need to disable Secure Boot I can probably help you more. I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hello Greg,I need to disable Secure Boot temporarily to run a certain program that is not malicious. I have talked to some of the makers behind the program about it and they said they have never had the problem before, so I'm out of luck. I will post a portion of my specs below if that helps.System Model: Alienware Aurora R5Processor: Intel(R) Core(TM) i7-6700 CPU @ 3.40GHz, 3401 Mhz, 4 CoresBIOS Mode: UEFIGraphics Card: NVIDIA GeForce GTX 1060 6GB","What program are you having problems with?","Are you following the steps from Alienware here: https:\/\/www.dell.com\/support\/article\/us\/en\/04\/s... ?See also these threads from others who have tried: https:\/\/www.dell.com\/community\/Alienware-Genera...https:\/\/www.dell.com\/community\/Alienware\/area51...https:\/\/www.daossoft.com\/bios-tips\/how-to-disab...","Yes, I am following the steps there exactly.The person in this thread (https:\/\/www.dell.com\/community\/Alienware-General-Read-Only\/Disable-Secure-Boot-on-Aurora-R5-Windows-10\/td-p\/5629825) seems to be having the same problem as me, but there are no working solutions on that thread.EDIT: I managed to solve it.You can boot into windows without Secure Boot by disabling the option under it, forgot what it was but it was something about Legacy something something.","Did you confirm you have the latest UEFI firmware for your Service Tab? What is the program you need to disable Secure Boot to install? Maybe I can help you find a workaround or alternative?"]},{"symptom":"Windows 2010 Email        I am getting a popup that I cannot eliminate; It reads, \"Server\", \"User Name\" and \"Password\" (all are filled in)  and below is \"Save the password in your password list\", and the choices are \"OK\" and \"Cancel\"   No matter which choice I make the popup returns immediately.  ??","solutions":["Hello i'm Timon and i'm glad to help you. It appears that your email credentials are incorrect. Which mail app do you use ? Outlook ? Windows mail app ?","Outlook","OK so you may look at your accounts in the file menu.Eventually delete the non used one.Once the culprit identified, be sure to provide the right credentials.If the issue persist, can i ask you the email provider ?"]},{"symptom":"Microsoft Direct Support Email        This is not entirely relevant, but this was the best place I thought I could ask this.Is there any email address that can take me straight through to a Microsoft Support person(e.g. *** Email address is removed for privacy *** or something)? I have a very specific issue that I can’t use the virtual assistant to get to an agent with, and an email correspondence format will make it easier to deal with my issue. It seems like such a thing should exist, but I can’t seem to find it anywhere. If anyone could point me in the right direction that would be greatly appreciated!And again, I do apologise for any inconvenience caused by the category this is in.","solutions":["Hi, unfortunately there is no public e-mail for support purposes. One may contact Support person directly only if he\/she knows e-mail already. E-mail correspondence is possible in case of paid support incident. It costs $89 IIRC."]},{"symptom":"Windows 10 Home, Can't Disable S Mode \"Something happened on our end, try again later\"        Just bought a new laptop (HP 14s-dq0xxx), it is essential that I disable S mode, when I go to Settings > Activation > Switch to Windows 10 Home (Go to Microsoft Store), clicking the download button in the Microsoft Store will make the following message pop up: \"Something happened on our end, try again later\".I've tried the following: - WSReset.exe- Installing latest Microsoft Store and Windows updates- Restarting \"wuauserv\" in Task Manager > Services- Windows Store Apps Troubleshooting- Restarting the computer multiple timesNone of these things helped at all. If I can't fix this issue I will mail the laptop back tomorrow and buy a different one...Please help.","solutions":["Well after messing around for about 5 hours I was finally able to disable the S mode. After completely reinstalling Windows I clicked the button and still got the \"Something happened on our end\" message, but after leaving the screen open for a while, it disabled the S mode nonetheless."]},{"symptom":"upgrading from window 7 to 10        after downloading windows 10, it goes to a screen that says Getting Updates and freezes at 46%. How do I fix this. I have run the troubleshooter without any fix.","solutions":[]},{"symptom":"emails        I am having a problem retrieving my emails from my phone","solutions":["Hello i'm Timon and i'm glad to help you, but i need more information !Can you please tell me your phone model and your email provider ?Please don't share any personal information.","Motorola, outlook? Not sure this is what you are looking for?","Thanks for the reply.Dis you manage to add the account ?Are you stuck somewhere ?"]},{"symptom":"Activate Windows 10 Pro        I am having trouble activating my \"Windows 10 Pro\" on one of my Dell XPS 8930 desktop computers. Both computers were received with Windows 10 Home. One of the computers activated correctly. I purchased Windows 10 Pro at the Store.The error I am receiving is:\"We can't activate Windows on this device as the previous version of Windows was not activated prior to upgrading to Windows 10. Go to the Store to buy genuine Windows. Error code: 0x803F7001Troubleshoot returns \"We can't activate your copy of Windows.What should I do?Thanks","solutions":["Did you purchase two Windows 10 Pro licences using the Store on each PC.On the erroring PC check to see what edition is currently registered, go to Settings > Update and security and select Activation. Does is show Windows 10 Enterprise rather than Pro. If it does enter the default Pro key in Change product key. VK7JG-NPHTM-C97JM-9MPGT-3V66T"]},{"symptom":"MS WSIM 1903 Crashes on Windows 1909        HiAs a programmer at the University of Bolton @ BSc level.MS knows me for activating pcs for customers.OK here is the problem.  When using the Windows System Information Manager it crashes on reading on all types of media for Windows x64 1909.This includes extraction from esd files to wim files.I have tested the orginal \"first virsion\" without any updates of Windows 1909 and that crashes upon catalogue detectionI have tested the updated version 12\/2019 with updates of Windows 1909 and that crashes upon catalogue detectionI have installed the patch of the latest update from MS servers for MS WSIMHere is a directory structure of my NASWhat is wrong guysThanks","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are receiving an error when trying to extract Windows images from Windows System Image Manager. Let me point you in the right direction, where you will find appropriate support for this issue. I would suggest you to post your query in TechNet forums, where we have support professionals with expertise on mapping shared drives to assist you with the proper insights. However, you may also want to look at the articles Windows System Image Manager How-to Topics and Windows System Image Manager Technical Reference I hope your query gets resolved at the earliest.  Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"CANNOT INSTALL WINDOWS 10 VERSION 1903        For the umteenth time I have tried to install windows 1903\/1909. I have repeatedly been through DISM SFC down SSU update, troublehooter, panther, tried manual install (can't get passed update KB4530717). Tried Windows 10 Updater (last time today), tried Media Creation Tool 1909(today-previously too 1903). Latest installation attempt using tool 1909 give me this error message:\"We couldn't install windows 10 - We've set your PC back to the way it was right before you started installing windows 10 - 0x8007001F - 0x20006 The installation failed in the SAFE_OS phase with an error during REPLICATE_OC operation\"... Anyone got any ideas on something new to try?","solutions":["Have you gone C:\\Windows\\Software Distribution\\ and deleted the Download folder?","better to clean install of windows 10 1909","Hi Graham. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Continue with these steps for overcoming Version Upgrade problems: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If the Version has problems I will work with you to try to resolve them. If the problems are unfixable for now, you have ten days to roll it back in Recovery settings. You can then hide it so it doesn't try to reinstall following this same method:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... Most problems are resolved by doing this gold standard Clean Install which should get you past all difficulties as it has millions of others who have followed the steps in this link and never come back to report another problem:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... . So read it over and see if its something you want to learn to do.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to rate my post, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","For the umteenth time I have tried to install windows 1903\/1909. I have repeatedly been through DISM SFC down SSU update, troublehooter, panther, tried manual install (can't get passed update KB4530717). Tried Windows 10 Updater (last time today), tried Media Creation Tool 1909(today-previously too 1903). Latest installation attempt using tool 1909 give me this error message:\"We couldn't install windows 10 - We've set your PC back to the way it was right before you started installing windows 10 - 0x8007001F - 0x20006 The installation failed in the SAFE_OS phase with an error during REPLICATE_OC operation\"... Anyone got any ideas on something new to try?Hello,As you already tried possible solutions, I recommend you to make clean install of Windows 10 V1909, see if that helps:https:\/\/www.kapilarya.com\/how-to-make-clean-install-of-windows-10Let us know if this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP.","HelloI burnt the ISO file to a disc as well as copying it to a USB. Neither file worked on reboot. No system disc. I tried again with version 1909 and same thing. BIOS will not open the file so I can reinstall.","HelloYes I have done that previously.","HelloWhat I think I will have to do is connect my driver to another computer and low level format it then install windows from scratch.","HelloThe version 1903\/1909 will not install at all. Tried the media creation tool using it from the C:, then burning the ISO to **** and copy to USB but none work. Seem to me I need to low level format the C: and start again. Drastic, but this has been going on for many months.","Yes, Graham, I read your original post which said the same. I gave you the steps to follow that WILL result in it being installed, one way or the other.The problem is epidemic in Windows 10 and is account corruption, upon which the Upgrade is choking to death. The Clean install in the link above has been used by millions without one ever coming back to report another problem.","Thanks. I have done a complete reinstall of the harddrive with windows 10 v1909. No I have to reinstall all my app & programs but it works.Thanks"]},{"symptom":"two blue icons top right pointing to each other        Hello I have a machine- windows 10 pro 64 bit what has a pair of tiny blue arrows pointing to each other in the top right corner of all my folders, files, shortcuts etc suddenly.... these are different that the one drive icon of the arrows chasing each other.Can anyone help me?","solutions":["Hi Debbie the overlay you describe indicates the folder or drive is compressed to save disk space.if it is on everything, you may have compressed the disk to remove the compression open file explorer, right click on the disk under This PC and select propertieson the general tab untick \"compress this drive to save disk space\" click Ok it may look like it is not doing anything for a minute or two. to remove the compression from a folder or file right click on the folder and select properties on the general tab, click advanced untick \"compress contents to save disk space\" click Ok"]},{"symptom":"How to Fix memory_management BSOD On New PC        I originally posted here trying to fix this issue on my PC. Since I found a solution that worked for me, I figured I would sum it up for anyone else having the same problem.If you are having memory_management BSODs on a new PC, I would highly recommend trying these steps before replacing your RAM. It may not actually be because your RAM is faulty, and this will save you a lot of trouble if it works.(Optional) Update your motherboard's BIOS. I don't think you have to do this step for this solution to work, but I did it before doing the next steps and it may have contributed towards fixing the problem.Run the Windows Memory Diagnostic Tool. I just did a basic test with one pass. If you get any errors, then updating the BIOS didn't fix the issue.Reboot your computer and go into EUFI setup (F2 on my motherboard)Check and change the voltage that is being supplied to your RAM. You will need to look up the recommended voltage for the RAM you have. Mine was supposed to run at 1.35 V, and my motherboard was only supplying 1.2 V. This is what ended up fixing the blue screens for me.(Recommended) Make sure that your motherboard is running your RAM at the proper MHz. Mine was running at 2400 MHz instead of the 3200 MHz my RAM actually supports. After increasing the voltage, I was getting a lot of lag spikes. Changing the MHz that my RAM was running at fixed that issue.After doing those steps, run the Memory Diagnostic Tool again. If you don't get any errors, the BSODs should be fixed.If you are still getting errors when running the Diagnostic Tool after doing the above steps, it is probably because of faulty RAM. I would try getting it replaced and see if that fixes the issue.Those are all the steps I followed that fixed the memory_management BSOD for me. Hopefully, it also works for you.Below is my original post:I just built a new computer the other day. It is my first custom build, so I was very excited to have it done. Everything went well for the first few hours of use, but then I encountered a blue screen. I thought maybe it was just a one-time thing, but over the past few days, they have become more and more common, to the point that they now occur almost every 5 minutes. There are a few different BSODs that I keep getting over and over:pfn_list_corruptirql_not_less_or_equalsystem_service_exceptionmemory_managementOf the four, system_service_exception is by far the most common, and memory_management is a new one that just happened for the first time a few minutes ago. I have tried everything to fix these, including making sure I have all my drivers up to date, making sure I have completely updated windows, factory resetting windows, and even completely wiping the HDD and SSD and reinstalling Windows from scratch, but none of this seems to stop them from happening. The one thing I haven't tried yet is updating my motherboard's BIOS. Would doing that potentially fix these problems or not?One other thing that might be helpful to know: I am currently running the Windows Memory Diagnostics Tool since I read that I should try it to diagnose these blue screens, and it says \"Hardware problems were detected. To identify and repair these problems, you will need to contact the computer manufacturer.\" Does this mean there could be an issue with my RAM or one of my hard drives?I would greatly appreciate any help that can be provided since I have no idea what to do at this point to fix it. Nothing I've found online to try seems to have worked.","solutions":["I was going to suggest a bios update, check the motherboard manufacturers website and see the reason for the latest update. (or the ones since the version you have)If you have more than one memory module then test one at a time. But you could also just try extracting the module\/s and re-seating them, then run the test again.","Hi EJP619 to diagnose the underlying issue, I need to analyse your Mini-dump file(s):Open Windows File Explorer Navigate to C:\\Windows\\Minidump Zip up the contents of that folder If you have problems zipping those files, copy them out onto your Desktop and zip them from thereUpload the zip file to the Cloud (OneDrive, DropBox . . . etc.) Then post a link here to the zip file, so we can take a look for you . . .","Okay. I'm in the middle of a motherboard BIOS update right now, but will do that as soon as it finishes.","Okay, will be here . . .","Here is the link: https:\/\/drive.google.com\/file\/d\/16CE4wMnPRV6A82S7g3HWQHdDY-4c04KX\/view?usp=sharing","I did the BIOS update. Interestingly, when testing the RAM modules separately, no error comes up. Once the second module finishes testing, I will insert the other back and try testing them again. Maybe the BIOS update solved the RAM issue? Possibly a compatibility issue with the old BIOS?","Nevermind. Just got the memory management BSOD again. At this point I'm assuming it probably has something to do with my hardware, because I don't know what else to fix as far as software goes.","Hello EJP619, I am Andrew, I want to try to help you more. Since you are getting a lot of memory problems it would suggest either your ram is faulty or your bios can be too. I see youve upgraded the bios version, great. Can you go to the BIOS and just set all defaults please.Now in Windows go to the manufacturuer of all your hardware, first the motherboard, and install all updated drivers. Once this is done reboot, we'll check the system files.In the search bar, type cmd. Right-click on cmd.exe and select Run as Administrator. Type SFC \/scannow and press the Enter key.Re-enter Command Prompt as Administrator and run these:dism.exe \/online \/cleanup-image \/startcomponentcleanupdism.exe \/online \/cleanup-image \/scanhealthdism.exe \/online \/cleanup-image \/restorehealthGive all this a go, let us know how it turns out.Andrew","Andrew, thanks for trying to help. After my previous memory management BSOD, I ran the chkdsk\/r command in command prompt since I read online that it was a potential fix for that BSOD. I have since then not gotten any more BSODs after over an hour and a half of use, which is good considering they were happening every 5-10 minutes. Maybe this fixed the problem, but I can't tell for sure yet. If I do get another BSOD though, I will make sure to follow the steps you provided. For now though, I am just going to use the computer normally and see what happens.Edit: Also, I have already restored the BIOS to the defaults after I did the BIOS update before. I have also checked several times to make sure I have all the updated drivers installed for all my components, so I don't think that is contributing to the issue.","Awesome, I'm excited to hear this has worked out for you so far. I'm awaiting to see if you're set for good now with the chkdsk run."]},{"symptom":"Windows 10 doesn't prompt to login screen        Hi,I have been using Windows 10 since I brought the system. Previously I was using version of Windows 1607, recently Microsoft made update with the latest Windows version 1703, I have updated it successfully and I had no issue to log in the PC. However after few moments when I restarted the PC Windows does not prompt to login screen.This is the same consequences due to frivolous Microsoft developers and its superfluous updates as Microsoft has primeval tradition to divest the user’s experience. I am requesting the Microsoft Community, please cascade the information and share my view to the Microsoft Management & Strategy Formulators.I have read the several post and comments from the Microsoft Community, however there are different-different views. I tried all the feasible method provided for the solution but my problem remain the same.Windows is getting started normally, first screen after starting up the Windows shows the time and background butdoesn’t show the option to login even Windows user account doesn't appear.Device type                       : LaptopOS type                             : Windows 10 HomeCurrent build                    : 15063.296This is happening on        : Boot, on started WindowsWhat error if any              : No error message, no any notification, even don’t show any message to logon.I tried the various method to fixed the issue, but the problem remain the same,Once Windows gets started, clicked on the Windows\/ background page and also clicked on clock’s time, waited for few minutes-doesn’t appear the account name and login box, pressed the Ctrl key, used the Ctrl + Alt + Delete. There is neither any message to prompt the login account nor any error notification.The issue only occurs on every startup and on first login, even clicking on the windows first screen, it is not appearing the login account\/ user list, how can we enter the password if we cannot see the our account login screen.This is a recurring issue and I cannot fix it. Please help me.Thank you in advance.With Best Regards, ********Personal information deleted by the moderator. Please see the Microsoft Community Frequently Asked Questions for more information on how you can protect your privacy.***","solutions":["To properly get answers to your post you should include some minimum information.1.  Device type. ie PC, Laptop, Tablet, Surface.2.  OS type, Home, Pro, Executive, etc3.  Current build.  Go Settings, System. About. OS build XXXXXX.XXX4.  Where is this happening on the computer,  Boot, Screen, App, etc5.  What error are you getting if any?","HiLawrence Crumb,Thank you for your response,I have included the details are as following:Device type                       : LaptopOS type                             : Windows 10 HomeCurrent build                    : 15063.296This is happening on       : Boot, on started WindowsWhat error if any              : No error message, no any notification, even don’t show any message to logon.How can I fix this issue permanently? Please let me know if there any further information may be needed.Thanks","\"There is no issue in starting up the Windows, it is getting started normally, first screen after starting up shows the time and background butdoesn’t show the option to login even user account doesn't appear.\".What you are seeing is the Lock screen.  Click on it and the Log-in screen should appear.","HiLawrence Crumb,Please read and understand the issue, than reply on the question, It will help you to find the resolution.I reiterate that, the issue only occurs on every startup and on first login, even clicking on the windows first screen, it is not appearing the login account\/ user list, how can we enter the password if we cannot see the our account login screen.Please don't reply if you don't know exact concern and proper method to fix the problem.Thank You    ","I do not know if it is a hardware problem or not?  Is your mouse bluetooth, USB, or hard wired?  Have you tried hitting a key or the space bar or other things on the keyboard?","I have an HP laptop. I was having this problem when I did the latest update for Windows 10. Turns out my HP Simplepass was interfering with my sign in screen. I deleted the app and my password box now appears after sleep mode. ","I have an HP laptop. I was having this problem when I did the latest update for Windows 10. Turns out my HP Simplepass was interfering with my sign in screen. I deleted the app and my password box now appears after sleep mode. ","MY laptop 'Acer E1-510' with Windows 10 operating system failed to boot properly. After appearing wallpaper, the text box for entering user name and password is not appearing even on clicking enter key or write clicking mouse as usual. (Mouse is active) What can I do?","Idem saseendranpaloth.The problem seems appear randomly.a scenery where it often appears:- The computer is on- The computer is going into sleep mode (from Windows Power Menu)- The computer wakes up : I can see only the background image but the prompt login box doesn't appear, so I can't use my computer.- I wait enough time until the screen go into a sleep mode (only screen is black). Sometimes, after wake up by moving the mouse or pressing a key, the prompt login box appears. So it is a kind of workaround you will have to wait a lot of time.- If the previous step doesn't work, I shut down the computer. Then restart it (via the computer power key). The most often, the prompt login box appears but sometimes, after entered my password and then validate it by pressing the enter key, I need to wait a long time before show the Windows Desktop. And sometimes too, all my desktop shortcut are mixed, so I need to sort it again, that's a nightmare.The problem appears for a long time now, I thought it would be solved with the time but not.I feel that after an important Windows update, it enable or disable this \"bug\".Rem. : I feel that the problem often occurs, when the computer wakes up from a hibernate state.My computer info :Windows 10 v1709Rem. 2 : My workgroup name is different from the default WORKGROUP name. I don't know if it could have any relationship with it.RegardsGuillaume J.","This is not a hardware problem. 1.  Device type: Lenovo PC2.  OS type: Windows 10 home3.  Current build.  Go Settings, System. About. OS build XXXXXX.XXX I cannot log into my PC so I cannot see this.4.  Where is this happening on the computer: No Windows Log in prompt will appear on the boot screen.5.  What error are you getting if any?PC seemingly boots normally. Time, date, and scenic photo appear. Login prompt will not appear!I have tried all manner of changing usb mouse\/keyboards and usb mouse\/keyboard ports used. Nothing.I have tried all the function keys, ctrl alt del, windows key, nothing.I have tried holding down f4, f5, f6 keys during bootup to trigger safe mode. Nothing. I tried unplugging and replugging PC. Nothing.I am looking for some way, ANY WAY, to bypass this seemingly frozen time\/date\/scenic photo lockscreen. Safe mode, BIOS, I don't care, I just need to be able to access what is on my PC!Any suggestions appreciated. Thanks."]}]}