{"windows":[{"symptom":"Win 10 1903 SD card issues        Hi all,Common issue it appears but I've just done a clean install of 1903 and my SD card is no longer working.  I've compared it to another user with the same HP Elitebook 840 G3 and I have the same driver and the card works on his machine. However he's running an older Win 10.Any potential suggestions please?","solutions":["Hello Stuart, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemI've seen questions before regarding Alcor Card Reader on HP after windows update, it used to be solved after a new driver update.Open Device manager from start menu, then find Disk drives or ATA controllers, until you find the card reader.after clicking on device properties, go to Driver tab and check the driver date. if it's older than Jul, 2019, please download the last version from this link: https:\/\/support.hp.com\/us-en\/drivers\/selfservic...Please note that this link is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolvedCheers! Farah","I've downlaoded the latest from HP for both that one and rhe Realtek but the card reader is a Realtek","Can you see the Card reader in Device manager? is it detected?","Yes all showing correctly as the Realtek PCIE card reader and same driver as the other device. I've just tried another card as well but nothing appears in explorer or disk management","Can you try logging in safemode? would it be detected there maybe? I would suggest testing booting from an ubuntu test image and check if the card reader works there, but it requires some preparations first..How about Intel management Engine driver and the Intel chipset drivers? are they also updated?","I did think of booting from a linux image but will need to put on a usb stick. Pretty sure all drivers are uptodate. The other machine I checked wss runnkng a 2017 realtrk driver so even rolled back to that but nothing.","well if you had the chance to test it, you can make sure that this isn't a hardware issue on this laptop,You can upgrade to 1909 if you are up to it, but there's no known issues in 1903 related to card readers in general..","I'll see what I can do. Was going to try and go back to the original HP Win 10 image","no worries. hope it works out for you","Ok rolled back to 1809 ans still not recognising it. I've tried some ubuntu bootable usb drives but annoyingly despite selecting it in the boot menu, it fails to boot and throws me back to the boot menu"]},{"symptom":"Hardware Error?        Hey guys, I've been getting trouble with a brand new PC and these are the reliability monitor and what they said.DescriptionA problem with your hardware caused Windows to stop working correctly.Problem signatureProblem Event Name: LiveKernelEventCode: 141Parameter 1: ffffa88f2c426010Parameter 2: fffff806781209f0Parameter 3: 0Parameter 4: 3accOS version: 10_0_18363Service Pack: 0_0Product: 768_1OS Version: 10.0.18363.2.0.0.768.101Locale ID: 1033Extra information about the problemBucket ID: LKD_0x141_Tdr:6_IMAGE_atikmpag.sysServer information: 61d49296-92d3-4600-8b4e-9ee531e9553fThis happened on 10:49 PM and before this happened, there was another error.The program RebornBuddy.exe version 1.0.343.0 stopped interacting with Windows and was closed. To see if more information about the problem is available, check the problem history in the Security and Maintenance control panel. Process ID: 3c10 Start Time: 01d5be45015f3853 Termination Time: 4294967295 Application Path: C:\\Users\\admin\\Desktop\\Rebornbuddy Current\\RebornBuddy.exe Report Id: 604a253f-d8e4-43c9-8fc7-04f365a4475f Faulting package full name:  Faulting package-relative application ID:  Hang type: Top level window is idleThis error happened on 10:42 PM.I'm wondering if any of my parts are faulty and if I should get a replacement part from the shop. I purchased this new PC 2 days ago and I'm happy to provide any further information as needed, thank you very much.","solutions":["Hi Aristel, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Looks like a Video driver issue. Have you checked for BIOS updates? You may share System Info file with minidumps if there with us for better understanding.We need log files(called dump files) that tell us what lead to crash. Please share them with us for a better analysis of the problem. Instructions can be found here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Please let us know if you need any assistance about posting dump files.","Hi Sumit,Thanks a bunch for the reply. Here is the minidump and info syshttps:\/\/1drv.ms\/u\/s!AvQ3BLcz1xFZmkMrYjOQDoqmFvLO?e=mXxt09.Just a heads up, the same thing just happened around 5 minutes ago. I'm unsure of how to refresh the Reliability Monitor to show the latest one as it only showed last update as 1.5 hours ago.Please let me know if you need any other information.*EDIT*I've just updated my bios to the latest version just in case. The previous patch that the PC crashed on was released around 3 months ago.","Thank you. The dump file doesn't say the reason of the crash. Has it crashed since you updated BIOS or does it take a day or two to crash?","Hi Sumit, it did crash once more.I noticed something where one of my program running will suddenly spike to insane levels of memory usage according to taskbar manager, it continue going up and the highest ive seen is it being at 55 GB memory usage. Do you think this could be the reason why its crashing?","Yes, it could be. What is the program name? Have you checked for updates on that?","The name is Rebornbuddy.exeSeems like it has been crashing again but this time rebornbuddy does not seem to be involved.SourceWindowsSummaryHardware errorDate‎3\/‎1\/‎2020 7:00 amStatusReport sentDescriptionA problem with your hardware caused Windows to stop working correctly.Problem signatureProblem Event Name: LiveKernelEventCode: 141Parameter 1: ffffa0066cacf050Parameter 2: fffff8063fc209f0Parameter 3: 0Parameter 4: 1e94OS version: 10_0_18363Service Pack: 0_0Product: 768_1OS Version: 10.0.18363.2.0.0.768.101Locale ID: 1033Extra information about the problemBucket ID: LKD_0x141_Tdr:6_IMAGE_atikmpag.sysServer information: c8ff0cb5-22c4-4ad1-878c-4818f239888bSourceWindowsSummaryHardware errorDate‎3\/‎1\/‎2020 4:08 amStatusReport sentDescriptionA problem with your hardware caused Windows to stop working correctly.Problem signatureProblem Event Name: LiveKernelEventCode: 141Parameter 1: ffffd60e3f82e460Parameter 2: fffff802278209f0Parameter 3: 0Parameter 4: 2c74OS version: 10_0_18363Service Pack: 0_0Product: 768_1OS Version: 10.0.18363.2.0.0.768.101Locale ID: 1033Extra information about the problemBucket ID: LKD_0x141_Tdr:6_IMAGE_atikmpag.sysServer information: a06f0524-1c09-4904-9507-0d42843e8a03SourceWindowsSummaryHardware errorDate‎3\/‎1\/‎2020 3:26 amStatusReport sentDescriptionA problem with your hardware caused Windows to stop working correctly.Problem signatureProblem Event Name: LiveKernelEventCode: 141Parameter 1: ffff8181740bf460Parameter 2: fffff800268209f0Parameter 3: 0Parameter 4: 27b8OS version: 10_0_18363Service Pack: 0_0Product: 768_1OS Version: 10.0.18363.2.0.0.768.101Locale ID: 1033Extra information about the problemBucket ID: LKD_0x141_Tdr:6_IMAGE_atikmpag.sysServer information: df0026f5-30f4-4903-8632-4ac8cc61dda7There aren't any dumpfiles generated since the last as well. A little confused on what is the issue here.","Seems like I've managed to solve the software issue and other problems. Right now the only error that still keeps appearing is stillSourceWindowsSummaryHardware errorDate‎5\/‎1\/‎2020 7:37 pmStatusReport sentDescriptionA problem with your hardware caused Windows to stop working correctly.Problem signatureProblem Event Name: LiveKernelEventCode: 141Parameter 1: ffffa0042fe02050Parameter 2: fffff801267509f0Parameter 3: 0Parameter 4: 768OS version: 10_0_18363Service Pack: 0_0Product: 768_1OS Version: 10.0.18363.2.0.0.768.101Locale ID: 1033Extra information about the problemBucket ID: LKD_0x141_Tdr:6_IMAGE_atikmpag.sysServer information: ec11d3c5-3b85-4ec0-84fc-79a23bf4dcb6No minidump file too when it crashed unfortunately. Really unsure what is the issue here :("]},{"symptom":"Laptop keyboard        Laptop keyboard some keys not working windows 10 machine e732ZG","solutions":["Hi Dary, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Laptop Keyboards usually fail once in the lifetime of the device and eventually require replacement. Do you have a spare USB keyboard to test if it exhibits the same issue?"," th usb      board os fin and th on scn boards os fin as                them keys  missing   the usb  keyboard works fine and the on screen key board works fine     !                                                        ","Have you had any spills?  Have you cleaned the keyboard with canned air or liquid contact cleaner?","No spill no cleaner  they say it is a Windows Update a kb update","Who makes the laptop?  When was it built?","Emachine  it is an oldie but a goodie we works well, apart from the keyboard problems about a year ago ","Hi Dary, As I can interpret you say OSK and other USB keyboard is fine, it makes our assumption of hardware issue strong. There are no known issues with Windows updates breaking keyboard keys but if you want to double-check you may uninstall the last update:https:\/\/www.tenforums.com\/tutorials\/5486-uninst...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads."]},{"symptom":"Multiple Windows Recovery Partitions        My PC has multiple Windows recovery partitions, which bothers me.","solutions":["Hi 齐景琛 In total those recovery partitions only take up just over 2GB of space, and while that in not a neat layout, it is not doing harm on your PCHowever, if you do want to tidy up that drive, which partition is Windows 10 installed on is that the C or D partition?If you do want to tidy up that drive, you will need to use a 3rd party utility like the free version of AOMEI Partition assistantThe first partition on the left (100MB) is the UEFI partition (boot) and that must not be touchedThen, you have the D Drive partition with 2 recovery partitions, and the C Drive with 2 recovery partitionsBasically you only need to keep the recovery drive that is immediately to the right of the partition that Windows is installed onto and you can delete the other 3 recovery partitions and merge that space into one of the other partitions . . .So, say if Windows is installed on the C Drive partition, you can delete the 3 partitions indicated below:.","Thank you for solving this problem for me! Good luck!"]},{"symptom":"camera not working        All of sudden my camera stopped working, tried resetting, updating drivers and nothing","solutions":["So Charles a few things here I found a website on the Lenovo forum that has more information:Camera driver is out of date or not installed correctly Camera was disabled in Device Manager Camera was set off under Privacy or Lenovo Settings Hardware is broken https:\/\/forums.lenovo.com\/t5\/Lenovo-P-Y-and-Z-s...So, using this information we need to first make sure camera is not set to private mode...also....pressing F8 or Function (FN) + F8 at same time may turn your camera back on.Please let me know if any of the above works if not we need to install drivers again. If that doesn't work...your camera may be broken. Hopefully not!"]},{"symptom":"airplane mode will not stop - won't allow access to wifi, cellular or blue tooth        I believe the root issue is here and I have tried at least 25 strategies to bring this problem to an end - but here is the screen shot that seems to make clear - the wireless communications are turned off (grayed out) and can't be switched on.","solutions":["You have to turn off Airplane mode.  Then you should be able to turn on WiFi.","Hi srude, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.In effect, airplane mode disables the cellular radio, Wi-Fi and Bluetooth of a device, all the functions of wireless transmission. To recover these functions you must deactivate the option, here is everything related to this process. They are articles that belong and share Windows MVP. What Does Airplane Mode Do, and Is It Really Necessary? https:\/\/www.howtogeek.com\/194421\/what-does-airp...Airplane Mode in Windows 10 https:\/\/www.thewindowsclub.com\/airplane-mode-wi...Let me know if you have something else that I can help you with, I'd be happy to help.Happy holidays Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","You have to turn off Airplane mode.  Then you should be able to turn on WiFi.wish it were that easy but every attempt to turn off airplane mode, disable airplane mode relaunch wifi is futile.","If you can turn off Airplane mode restart the computer then check Settings, Network & Internet for WiFi as if it was not there before you could not turn it on there.","Hi srude, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.In effect, airplane mode disables the cellular radio, Wi-Fi and Bluetooth of a device, all the functions of wireless transmission. To recover these functions you must deactivate the option, here is everything related to this process. They are articles that belong and share Windows MVP. What Does Airplane Mode Do, and Is It Really Necessary? https:\/\/www.howtogeek.com\/194421\/what-does-airp...Airplane Mode in Windows 10 https:\/\/www.thewindowsclub.com\/airplane-mode-wi...Let me know if you have something else that I can help you with, I'd be happy to help.Happy holidays Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Thanks Marc - the first link didn't have much advice - the second link did and half of them I had tried before (but tried a couple again) - there were a couple of new ones such as regedit and unfortunately nothing has changed - airplane mode is stuck.","I don't specifically understand what you say but I assure you I have gone through settings, network connections, adapters, several screens to turn on or off the airplane mode \/ wifi mode and none of those has worked.","I will add when I run the troubleshooter it tells me my radio control is turned off - it is not.","Hi, srude and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.May you please provide your PC specs? Thank you!","It's a thinkpad T430s and I have Windows 10 - as a last resort to try to fix this I deleted Windows 10 and it supposedly took me back to Windows 7 but I think 10 kept running. Anything else you need?","Hi srude, Turn off & on the Wireless Switch. Please see the attached image below for your reference. Thank you!"]},{"symptom":"System automatically changing orientation to flipped mode multiple times.        My windows orientation is automatically changing to Landscape(Flipped) mode multiple times without any pop-up, also I'm not giving it any command. Help me to resolve this issue. It always happens when i swap to another application or close any window.","solutions":["Hi Anant Click the Notification icon at the bottom right of your screen, if necessary to see all tiles, click Expand on the resulting PanelDo you see a 'Rotation Lock' option there, if so, click that If you do not find that there, right click your Desktop and choose Display SettingsOn that Settings Page, is there an on\/off toggle for Rotation Lock?"]},{"symptom":"GST INDIA REFUND        I HAVE ORDERED MS WINDOWS 10 PRO FOR MY PC. BUT IT DID NOT ASK FOR MY GST. I HAVE TO CLAIM GST REFUND... HOW TO DO IT","solutions":["Hi Abhishek,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.I believe you cannot get the benifit of GST Input credit while purchasing Windows. Contact Billing support for more information.","Hi Abhishek,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.I believe you cannot get the benifit of GST Input credit while purchasing Windows. Contact Billing support for more information.Hello sir, thanks for your reply. How do I contatc BILLING SUPPORT ? What is their number....","Hi Abhishek, https:\/\/support.microsoft.com\/en-in\/help\/405170...India +91 N\/A N\/A (0)80 4010 3000 1 800 572 1100 1 800 102 1100 English"]},{"symptom":"BSOD - Unsure of what to make of minidump analysis        Hi!My PC BSOD about once a day and it occurs at random. (wathcing youtube, playing games, idle with nothing opened).Every .dmp file I've opened says memory corruption.  However, I have replaced my ram with ram from my other PC which works fine, and BSOD still occurs.  Memtest86 was also performed on both for 4 runs and 0 errors came up.  Fresh install of windows 10 was also done but same BSOD still occurs.Any help would be appreciated!System specs:ryzen7 3700x2 x 8gb corsair ram running on xmp 3600mhz (still BSOD if i turn off XMP)asus x570 strix - bios, chipset drivers all up to dateamd 5700xt - drivers all up to date (non beta versions)1xssd1x m.2 ssdHere is what .dmp file says Loading Dump File [C:\\Windows\\minidump\\010520-8421-01.dmp]Mini Kernel Dump File: Only registers and stack trace are availableSymbol search path is: srv*Executable search path is: Windows 10 Kernel Version 18362 MP (16 procs) Free x64Product: WinNt, suite: TerminalServer SingleUserTSBuilt by: 18362.1.amd64fre.19h1_release.190318-1202Machine Name:Kernel base = 0xfffff806`0da00000 PsLoadedModuleList = 0xfffff806`0de48210Debug session time: Sun Jan  5 16:35:14.613 2020 (UTC + 11:00)System Uptime: 0 days 1:45:37.287Loading Kernel Symbols.........................................................................................................................................................................................Loading User SymbolsLoading unloaded module list...........For analysis of this file, run !analyze -v9: kd> !analyze -v********************************************************************************                                                                             **                        Bugcheck Analysis                                    **                                                                             ********************************************************************************PAGE_FAULT_IN_NONPAGED_AREA (50)Invalid system memory was referenced.  This cannot be protected by try-except.Typically the address is just plain bad or it is pointing at freed memory.Arguments:Arg1: ffffffff88118412, memory referenced.Arg2: 0000000000000000, value 0 = read operation, 1 = write operation.Arg3: fffff8060e1000df, If non-zero, the instruction address which referenced the bad memoryaddress.Arg4: 0000000000000002, (reserved)Debugging Details:------------------Could not read faulting driver name*** WARNING: Unable to verify timestamp for win32k.sysKEY_VALUES_STRING: 1PROCESSES_ANALYSIS: 1SERVICE_ANALYSIS: 1STACKHASH_ANALYSIS: 1TIMELINE_ANALYSIS: 1DUMP_CLASS: 1DUMP_QUALIFIER: 400BUILD_VERSION_STRING:  18362.1.amd64fre.19h1_release.190318-1202SYSTEM_MANUFACTURER:  System manufacturerSYSTEM_PRODUCT_NAME:  System Product NameSYSTEM_SKU:  SKUSYSTEM_VERSION:  System VersionBIOS_VENDOR:  American Megatrends Inc.BIOS_VERSION:  0604BIOS_DATE:  07\/02\/2019BASEBOARD_MANUFACTURER:  ASUSTeK COMPUTER INC.BASEBOARD_PRODUCT:  ROG STRIX X570-F GAMINGBASEBOARD_VERSION:  Rev X.0xDUMP_TYPE:  2BUGCHECK_P1: ffffffff88118412BUGCHECK_P2: 0BUGCHECK_P3: fffff8060e1000dfBUGCHECK_P4: 2READ_ADDRESS: fffff8060df733b8: Unable to get MiVisibleStateUnable to get NonPagedPoolStartUnable to get NonPagedPoolEndUnable to get PagedPoolStartUnable to get PagedPoolEnd ffffffff88118412 FAULTING_IP: nt!PiLookupInDDB+11bfffff806`0e1000df 8b9012841188    mov     edx,dword ptr [rax-77EE7BEEh]MM_INTERNAL_CODE:  2CPU_COUNT: 10CPU_MHZ: e09CPU_VENDOR:  AuthenticAMDCPU_FAMILY: 17CPU_MODEL: 71CPU_STEPPING: 0BLACKBOXBSD: 1 (!blackboxbsd)BLACKBOXNTFS: 1 (!blackboxntfs)BLACKBOXPNP: 1 (!blackboxpnp)BLACKBOXWINLOGON: 1CUSTOMER_CRASH_COUNT:  1DEFAULT_BUCKET_ID:  CODE_CORRUPTIONBUGCHECK_STR:  AVPROCESS_NAME:  SystemCURRENT_IRQL:  0ANALYSIS_SESSION_HOST:  DESKTOP-IEQNHH7ANALYSIS_SESSION_TIME:  01-05-2020 19:55:07.0155ANALYSIS_VERSION: 10.0.18362.1 amd64freTRAP_FRAME:  fffffb0d4dd415f0 -- (.trap 0xfffffb0d4dd415f0)NOTE: The trap frame does not contain all registers.Some register values may be zeroed or incorrect.rax=0000000000000000 rbx=0000000000000000 rcx=ffff8883e2524050rdx=0000000000000000 rsi=0000000000000000 rdi=0000000000000000rip=fffff8060e1000df rsp=fffffb0d4dd41780 rbp=fffffb0d4dd41809 r8=ffff8883e06d8af0  r9=ffffad0c1ca4e7a8 r10=ffff8883cdaf4600r11=ffff8883e31e9040 r12=0000000000000000 r13=0000000000000000r14=0000000000000000 r15=0000000000000000iopl=0         nv up ei pl zr na po ncnt!PiLookupInDDB+0x11b:fffff806`0e1000df 8b9012841188    mov     edx,dword ptr [rax-77EE7BEEh] ds:ffffffff`88118412=????????Resetting default scopeLOCK_ADDRESS:  fffff8060de62a20 -- (!locks fffff8060de62a20)Cannot get _ERESOURCE typeResource @ nt!PiEngineLock (0xfffff8060de62a20)    Available1 total locksPNP_TRIAGE_DATA: Lock address  : 0xfffff8060de62a20Thread Count  : 0Thread address: 0x0000000000000000Thread wait   : 0x0LAST_CONTROL_TRANSFER:  from fffff8060dbe33d6 to fffff8060dbc1220STACK_TEXT:  fffffb0d`4dd41348 fffff806`0dbe33d6 : 00000000`00000050 ffffffff`88118412 00000000`00000000 fffffb0d`4dd415f0 : nt!KeBugCheckExfffffb0d`4dd41350 fffff806`0da72edf : 00000000`00000000 00000000`00000000 00000000`00000000 ffffffff`88118412 : nt!MiSystemFault+0x1d66a6fffffb0d`4dd41450 fffff806`0dbcf320 : 00000000`00000030 00000000`00000001 00000000`00000000 ffffad0c`251ed000 : nt!MmAccessFault+0x34ffffffb0d`4dd415f0 fffff806`0e1000df : ffffad0c`141af450 fffffb0d`4dd41800 fffff806`0e3affb0 01000000`00100000 : nt!KiPageFault+0x360fffffb0d`4dd41780 fffff806`0e100287 : 00000000`c0000001 fffff806`0ad00000 fffffb0d`4dd419e8 ffffffff`800049b4 : nt!PiLookupInDDB+0x11bfffffb0d`4dd41870 fffff806`0e1008de : fffff806`0ad00000 00000000`00000000 00000000`00000002 ffffffff`800049b4 : nt!PpCheckInDriverDatabase+0x93fffffb0d`4dd418d0 fffff806`0e10ef99 : fffffb0d`4dd41a50 fffff806`0ad000e8 00000000`00000000 00000000`00000000 : nt!PnpPrepareDriverLoading+0x6afffffb0d`4dd41950 fffff806`0e10ec2e : 00000000`00000000 00000000`00000000 00000000`00000000 fffff806`0de65aa0 : nt!IopLoadDriver+0x265fffffb0d`4dd4****`00000080 ffff8883`cda7a300 0067006f`00000001 : nt!ExpWorkerThread+0x105fffffb0d`4dd41c10 fffff806`0dbc886a : fffff806`0aa85180 ffff8883`e31e9040 fffff806`0db2a6d0 00690057`005c0025 : nt!PspSystemThreadStartup+0x55fffffb0d`4dd41c60 00000000`00000000 : fffffb0d`4dd42000 fffffb0d`4dd3c000 00000000`00000000 00000000`00000000 : nt!KiStartSystemThread+0x2aCHKIMG_EXTENSION: !chkimg -lo 50 -d !nt    fffff8060e1000e0-fffff8060e1000e3  4 bytes - nt!PiLookupInDDB+11c[ d8 85 c0 0f:90 12 84 11 ]4 errors : !nt (fffff8060e1000e0-fffff8060e1000e3)MODULE_NAME: memory_corruptionIMAGE_NAME:  memory_corruptionFOLLOWUP_NAME:  memory_corruptionDEBUG_FLR_IMAGE_TIMESTAMP:  0MEMORY_CORRUPTOR:  LARGESTACK_COMMAND:  .thread ; .cxr ; kbFAILURE_BUCKET_ID:  MEMORY_CORRUPTION_LARGEBUCKET_ID:  MEMORY_CORRUPTION_LARGEPRIMARY_PROBLEM_CLASS:  MEMORY_CORRUPTION_LARGETARGET_TIME:  2020-01-05T05:35:14.000ZOSBUILD:  18362OSSERVICEPACK:  418SERVICEPACK_NUMBER: 0OS_REVISION: 0SUITE_MASK:  272PRODUCT_TYPE:  1OSPLATFORM_TYPE:  x64OSNAME:  Windows 10OSEDITION:  Windows 10 WinNt TerminalServer SingleUserTSOS_LOCALE:  USER_LCID:  0OSBUILD_TIMESTAMP:  unknown_dateBUILDDATESTAMP_STR:  190318-1202BUILDLAB_STR:  19h1_releaseBUILDOSVER_STR:  10.0.18362.1.amd64fre.19h1_release.190318-1202ANALYSIS_SESSION_ELAPSED_TIME:  2952ANALYSIS_SOURCE:  KMFAILURE_ID_HASH_STRING:  km:memory_corruption_largeFAILURE_ID_HASH:  {e29154ac-69a4-0eb8-172a-a860f73c0a3c}Followup:     memory_corruption---------","solutions":["Hi,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.We need log files(called dump files) that tell us what lead to crash.Please share them with us for a better analysis of the problem. Instructions can be found here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Please let us know if you need any assistance about posting dump files.","Here is the link for minidumphttps:\/\/1drv.ms\/u\/s!ApIDEsLM1vNfhI1zZ2FEq52qC_gdvA?e=8cr2pzHere is the link for msinfo:https:\/\/1drv.ms\/u\/s!ApIDEsLM1vNfhI11ZypC7DcNdUgnig?e=rFTtcDAlso no overclocking was done.","Hi phopo, Memory corruption was the cause of the crash. Did you run memtest86+ for 8 passes at least before?Also, update BIOS first: https:\/\/www.asus.com\/us\/Motherboards\/ROG-Strix-...Technical Information: FAILURE_ID_HASH_STRING:  km:memory_corruption_largeDisclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"Does Windows 10 1909 also have grpahic card issue?        I'm currently using dell xps 9550MY GC is GTX 960m and after updating from 1803 to 1903 the computer doesn't recognize my Graphic Card.So after the release of 1909 i tried again and still it doesn't workI can't install my Nvidia Driver. I used Dell gc driver and nvidia driver and the install stops.I need help plz.","solutions":["Hi Joon. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Guardian Moderator here to help you.Have you tried installing the latest Dell driver for the card in Compatibility Mode?See here: https:\/\/social.technet.microsoft.com\/Forums\/win... If that doesn't help then run the Nvidia Driver Update utility to try the driver it finds for the card:http:\/\/www.nvidia.com\/Download\/Scan.aspx?lang=e...If it doesn't work try it also in Compatibility Mode. Next try manually searching Nvidia Driver Update utility here: https:\/\/www.nvidia.com\/Download\/Find.aspxIf it fails try in Compatibility mode. Finally go into Device Manager > Display > Update Driver > Browse > Let Me Pick to try all previous drivers which are queued there.Now you'll know you've tried everything possible.","Hi Joon. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Guardian Moderator here to help you.Have you tried installing the latest Dell driver for the card in Compatibility Mode?See here: https:\/\/social.technet.microsoft.com\/Forums\/win... If that doesn't help then run the Nvidia Driver Update utility to try the driver it finds for the card:http:\/\/www.nvidia.com\/Download\/Scan.aspx?lang=e...If it doesn't work try it also in Compatibility Mode. Next try manually searching Nvidia Driver Update utility here: https:\/\/www.nvidia.com\/Download\/Find.aspxIf it fails try in Compatibility mode. Finally go into Device Manager > Display > Update Driver > Browse > Let Me Pick to try all previous drivers which are queued there.Now you'll know you've tried everything possible. Hi, I also have the same issue with the Windows version 1909.After I updated form 1803 to 1909, everything well almost everything just got worst.Davinci Resolve when opened, all I can see is a white screen, Topaz Labs AI when ran with dedicated GPU appears white on my screen. I tried to install the previous version of Nvidia Drivers but all I get is an error \"This NVIDIA graphics driver is not compatible with this version of Windows.\"\"This Graphics card could not find compatible Hardware\"I could not roll back to the previous windows version because I already deleted it.Using Aspire VX-15 with 8gb ram, 1tb HDD, i7-7700hq, 128gb ssd"]},{"symptom":"hp laptop        I bought HP laptop recently , need to paid to use Microsoft word, but l only need to type few letter casually it's any way i can install an old version window .","solutions":["Word does notcome for free.And Windows does not com for free.And Word is not part of Windows; it is bought separately.You may be interested in using either of these two free Office Suites which are compatible with Windows.Open Office:https:\/\/www.openoffice.org\/Libre Office:https:\/\/www.libreoffice.org\/Cheers.","Try using Open Office instead. It's free."]},{"symptom":"TaskHostw.exe using 99% of my CPU in performance report...        Since last week while trying to play games my PC has been freezing I went through many troubleshooting and when running “perfmon \/report” i notices that my CPU had 99% usage from taskhostw.exe however when i check in task manager my CPU doesn’t go over 10% when running the test i have run so many antiviruses ran SFC and DISM scans nothing has fixed it my PC is unusable at this point ive asked so much on the Get Help app provided by windows nothing has helped ive checked forums on here nothing they have told me to do has worked ive checked website followed tutorials etc. I need help badly Thanks for the help!","solutions":["Hi Sam, Taskhost.exe is a process that hosts various Windows processes running from a dynamic link library instead of the conventional .exes (executable files). You see, libraries (.dlls) are only capable of running through .exe files and they have to rely on the Taskhost to support their execution. Please check out this article for full guide on how to solve this issue: https:\/\/windowsreport.com\/taskhost-exe-high-cpu\/Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Unfortunately this hasn't worked after trying all the steps of which the last one isn't possible because in task manager my CPU usage is normal. Ive tried all the steps and restarted my PC yet none of it worked i still require help."]},{"symptom":"windows hello face        cannot find compatible camera","solutions":["Hi Louis,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Windows Hello requires a special IR Camera which is not available on all devices. What is the make and model of the computer?"]},{"symptom":"help immediately        i ran command               wmic path softwarelicensingservice get OA3xOriginalProductKey but showing blank spacesi have installed fresh copy of windowssuggest mehelp me","solutions":["Hello dhruvchittrangad, I'm Didi, an independent advisor. I understand that you see blank spaces when you type that command to see your Windows product key.Do you also see \"OA3xOriginalProductKey\" written ? It certainly means that motherboard does not have product key in BIOS. How did you purchase your Windows license ? Do you have any issue activating Windows ? You can also click on Start, type \"slmgr.vbs \/dlv\" (without quotes), take a screenshot and send it here so we can help you further.Regards, Didi"]},{"symptom":"Move a Microsoft Store installation from one computer to another?        Hello,I purchased Forza Horizon 4 on my PC, and the windows store completely deleted my copy to install it again for no reason(unfortunately). I've isnce had to download it on a laptop elsewhere as I have a low data cap, and now would like to copy it to my PC, as it will run better.Where is the option to do this? Every other games service(Steam, Origin, etc.) makes this pretty foolproof, so I would hope that the Windows Store has a similar function for this simple process.","solutions":["Hi, You aren't able to do this anymore as the directory the game installs to becomes a protected folder the user can't directly access. Even with Admin rights even the default apps folder (\"C:\\Program Files\\WindowsApps\") isn't readable unfortunately.It used to be the case that you could start the download and pause it to create the directory on the 2nd PC. Then copy the files over and resume the download for it to detect them. Similar to other game stores.I hope that helps","It does not help, but thank you for the reply nonetheless.It baffles me that Windows would knowingly take out a basic feature of most PC platforms, willingly making things harder and more obtuse for the consumer. Furthermore, I now cannot play Forza on the machine I intended to play it on because of my data cap and Window's obtuse, outdated storefront.I hope that this feature will be readded soon in an update.","I would recommend leaving feedback for that in the Feedback Hub app. We can't help with suggestions or improvements for services as this is the community forum."]},{"symptom":"CTRL + does not work \\ Не работает CTRL +        Why does not keyboard shortcut CTRL + work on windows 10 in the english interface? But if I change interface language to russian it starts working? I am confused! Well, it is not a trouble for me to use russian version of windows, but I want to use english, BUT i can't work in it! Why even ctrl + z transforms to alt backspace??!!!!!! I guess every keyboard shortcut is connected to alt, but I wanna use CTRL!!! I thought that every one in the world uses ctrl shortcuts. How can I fix this??------------------------------------------------------------------------------Почему когда я меняю язык на английский в винде то все горячие клавиши меняются на не понятно какие? Я хочу использовать английский язык, а не русский, что делать?","solutions":["Each press of Ctrl+ enlarges my Google Chrome display in discrete steps. Ctrl- does the opposite. I use an US-International keyboard layout. I suspect the problem is restricted to your machine. Best to test it on other machines too.","Ctrl+ means  control + key. For example: ctrl + c; ctrl + v; ctrl + z; etc. When I use russian interface it works but if I use english it does not work, because ctrl+key change to alt + key. For example: In Russian Microsoft Word I use ctrl + z to discard the change but in English Microsoft Word I use alt+backspace. I do not know the other shortcuts in english version except alt + backspace. How can i fix alt shortcuts?","Ctrl+ means  control + key. For example: ctrl + c; ctrl + v; ctrl + z; etc. When I use russian interface it works but if I use english it does not work, because ctrl+key change to alt + key. For example: In Russian Microsoft Word I use ctrl + z to discard the change but in English Microsoft Word I use alt+backspace. I do not know the other shortcuts in english version except alt + backspace. How can i fix alt shortcuts?I know what Ctrl+ means and I tested it for you - see my first reply."]},{"symptom":"Windows 10: Can't log-in with correct password after changing startup options.        Hi,I changed the \"startup\" options from \"all programs\" to \"essential programs\". After re-starting my laptop and entering my usual local password, I got a message on the screen, indicating there was a problem with my log-in and I got an \"incorrect password\" message every time I tried my password. I am 100% sure that my password is correct and there is no simple explanation like Caps-Lock, keyboard, etc.I tried to use, \"I forgot my password\" and  SAFE-MODE options but every time I get back to the first page (i.e. the log-in page) with no avail. In SAFE-MODE, I can see my log-in name and hotmail address under it, but my Administrator password which is the one I used to use for logging-in, doesn't get accepted.On my Microsoft account page, I can see the laptop in question under \"My Devices\".My laptop: HP Pavilion Notebook 15-ab252ne (64-bit)MyWindows 10 is up-to-date: CoreSingleLanguage Version 1903 (however; I am not sure that I have set-up any security question)Is there a way that I can reset my password without losing my invaluable files? Can any DOS commands be used?With many thanks in advance,Fred319   ","solutions":["Here are a few points to consider:You can reset your password here: https:\/\/account.live.com\/resetpassword.aspxHaving a single admin account is as risky as having a single car key. Sooner or later you will have a big problem.\"DOS commands\" (=Console commands) do NOT give you any elevated access.Regular backups (e.g. weekly) to an external medium are mandatory, not optional. A 500 GByte USB disk would an excellent choice. It costs less than $50.00.Since your machine is intact, it would be possible to retrieve your \"invaluable\" files even when unable to log on.","Here are a few points to consider:You can reset your password here: https:\/\/account.live.com\/resetpassword.aspxHaving a single admin account is as risky as having a single car key. Sooner or later you will have a big problem.\"DOS commands\" (=Console commands) do NOT give you any elevated access.Regular backups (e.g. weekly) to an external medium are mandatory, not optional. A 500 GByte USB disk would an excellent choice. It costs less than $50.00.Since your machine is intact, it would be possible to retrieve your \"invaluable\" files even when unable to log on.Thank you Frederik for your inputs. Regarding the first point (using the reset password link):My password was a local one and I wasn't using my Microsoft account password for logging-in before this problem. Do you think the resetting link can still work here? And if yes, do I need to be in the SAFE MODE with networking access during this procedure?  ","My password was a local one and I wasn't using my Microsoft account password for logging-in before this problem. Do you think the resetting link can still work here? And if yes, do I need to be in the SAFE MODE with networking access during this procedure?  Passwords for local accounts cannot be reset via the link I posted. Safe Mode will not do the trick either. If it did then this would defy the purpose of having passwords!I'm now going out, back in about 5 hours. In the meantime I suggest you do some preparatory work by creating a bootable Windows 10 Repair Flash Disk. To do so you run the command RecoveryDrive.exe on any Win10 PC. Do NOT copy the system files."]},{"symptom":"So I deleted all of my downloads        A popup appeared telling me I had no space on my computer and said I had to clear some space, I pressed on it and it took me to settings and I clicked on delete temporary files and it didn't show downloads or anything just somethingslike windows update files and stuff, then i clicked on delete then the downloads area apperared with a ticked checkbox and it deleted my downloads why is the settings like this it should load in all the things before letting me delete all my files. Is there anyway to restore my downloads?","solutions":["Hi okboomer69696969 The Downloads folder was never meant to be a long term storage location, it is best to move downloaded files to another folder for long term storage . . .Microsoft never really enforced this until the version 1903 update, in that, they added the Downloads folder to all the Disk cleanup processes in Windows 10 by default, so if that is not unticked in the Disk Cleanup process, everything will be deleted form that folder by default. Of course, we we never informed of this change . . . The only real option you will have now is to try a 3rd party file recovery utility like the Free Recuva or EaseUS applications, to see if those can bring your files back . . ."]},{"symptom":"microsoft launcher child mode        i've bought  a new laptop and downloaded Microsoft launcher and connected to my phone as prompt But It set up in child mode and I cannot get it off !!!","solutions":["I had the same problem, but I solved it, and it's really easy although not well document or explained by Microsoft.My situation:- I have a personal microsoft account, and my daughter has her microsoft account linked to mine as a child in my family.- From her phone she wasn't able to do almost anything involving configurations of the phone.- There's no easy way to temporarily disable child mode from the phone itself (I couldn't find one).So, using my account (as an Adult responsible of my daughter's account) I headed to: https:\/\/account.microsoft.com\/family There, under my daughter's user, I clicked on \"Activity\".After that you should see a switch with the text \"Activity Reporting\" --> just switch that to Off.That, allowed me to configure anything on the phone,,, it will just send the information it can, without blocking anything I guess.I hope it helps you or someone else.","Hello HernanThank you very much !! I had the exact same problem & at each new startup of my daughter's Huawei P Smart 2019, the Microsoft Launcher was replaced by the Huawei Launcher. Your solution helped me.I hope that in the future, Microsoft will secure the Microsoft Launcher as default launcher & will improve the parental control by letting us access easily at the configuration and settings of the phone, while at the same time still having the possibility to receive activity reports.Best regards,David."]},{"symptom":"Windows freezes and fails to create log file        Recently Windows 10 has been randomly freezing while browsing or doing any basic task, the cursor freezes and if there's music or sound it freezes on a loop. The computer won't shut down or display a blue screen, it can sit there frozen for hours until forced reboot.Event viewer won't display a crash log. Only this:\"Dump file creation failed due to error during dump creation.\"Here´s what I have tried so far:1) Upgrade Windows 10 to the latest version.2) sfc \/scannow (No integrity violations found)3) DISM \/Online \/Cleanup-Image \/RestoreHealth4) Update graphics driversThe problem persists.","solutions":["Hi there, Can you try running this in clean boot or in safe mode and see if this exhibits the same issue?Follow the steps here: https:\/\/support.microsoft.com\/en-ca\/help\/929135...Let me know.","With your clean boot workaround the computer took 4 hours freeze again. Previous freezes were more frequent (15 minutes to 30 minutes).Might just mere be luck? Will try safe mode next.Is there an alternative to the event viewer than can provide report of what is happening?","Ok we may want to do a scan with malwarebytes. Go to malwarebytes.com and download the scanning tool and do a scan.Also go to start type in Cmd and right click command prompt and click run as administrator.Type in sfc \/scannow and see if there are any integrity issues. If the problem isn’t as persistent this may be malware","Did all the steps mentioned, SFC Scan, Malwarebytes and Hitman Pro scans in safe mode.Windows still freezes within the hour or so.HitmanPro is picking \"svchost.exe\" as suspicious, I have deleted it during reboots but it comes back.","The real SVChost.exe is a legitimate windows process. The question is whether this particular file that calls itself \"SVChost.exe\" was perhaps modified, or maybe it is malware with a fake name.You can also do a right click on the file, choose \"properties\", and then go to the digital signature tab, and do a double click on the sig that is displayed. Should be a Microsoft sig. Windows will then tell you if the sig is valid. If the sig is valid, then the file can be considered legit. Can you right-click and check the digital signature? Have you tried a cleanboot and see how your system runs? Here is how you perform a clean boot: https:\/\/support.microsoft.com\/en-ca\/help\/929135...","It seems to be a false positive, ran Hitman again and it wasn't detected.There's a very weird fact, I haven't found a situation where the crash occurs while running a CPU heavy task, such as Photoshop, Premiere, video games. But if Windows is sitting idle or just browsing the internet the freezes are all over the place.","This could be a memory issue, can you do a memory test? What type of system do you have?","No memory errors were detected after running Windows Memory Diagnostics.I've been batch rendering a bunch of videos for the last 24 hours no freezes. Yet If leave the computer idle, the freeze of death returns.","I am beginning to wonder if this has something to do with your power options...If you go to Start > Control Panel > Hardware and Sound > Power Options What is your power option setting set to? Balanced? High Performance?","The power mode is High Performance (Default settings), I just changed \"Minimum processor state\" from 100% to 5% to see if it helped, however the issue continues."]}]}