{"windows":[{"symptom":"Online in Forza Horizon 4        I got problem with online in Forza Horizon 4, the NAT connection is ok but server connection is blocked, thats the problem of going online. Solutions that were mentioned in official instructions doesn't work.","solutions":["Hi Stas My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Make sure Windows 10 is up to date. Open the Xbox App on your PC and navigate to the settings button. Click the Network tab and let it run its cycle. Once its complete, you will see your Xbox Multiplayer NAT type and Server connectivity:If there is an issue identified, follow the \"More Information\" link for further troubleshooting steps.Try the steps listed here https:\/\/beta.support.xbox.com\/help\/Hardware-Net... Hope this helps."]},{"symptom":"Problem when upgrading from Windows 10 Home to PRo        Hi,I bought a HP notebook preinstalled with Windows 10 Home (64-bit). TO upgrade to Windows 10 Pro, I bought a Windows 10 Pro oem license (incl. CD) - original Microsoft.But when updating the Product Key, I get an error: 0x004f050What do I need to do?","solutions":["Hi MC4U Is the upgrade process not accepting the key, or did the upgrade proceed and now Windows 10 Pro is not activated?Open the Settings App (gear icon on your Start Menu) Go to System - About What edition (Home, Pro or Enterprise) is currently installed on your PC?","Hi, as mentioned, I am coming from Windows 10 Home 64-bit (brand new HP notebook).The upgrade isn`t performed. I still stick to Home version.","Hi MC4U My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Here are a few reasons why you might see activation error 0xC004F050: You entered a product key that can't be used to activate Windows. Enter a different valid Windows 10 product key or buy a new product key. For more info, see Activation in Windows 10.https:\/\/support.microsoft.com\/en-us\/help\/12440\/... You upgraded to Windows 10, but the activation servers were busy. If you upgraded from Windows 7 or Windows 8.1, Windows 10 will be automatically activated, or you can select Activate and try again.You upgraded to Windows 10 using the free upgrade offer, but Windows 10 isn't activated after a reinstall. Windows 10 should automatically activate unless you made significant hardware changes (such as replacing the motherboard).Hope this helps.","Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.The issue is probably because you've got an OEM Key - while perfectly valid it's not designed to upgrade an edition of Windows from Home to Pro.You might have some luck using the place-holder Windows 10 Pro product key first. Try entering: VK7JG-NPHTM-C97JM-9MPGT-3V66TUsing that should allow the actual upgrade from Home to Pro to proceed - once that's done you can then enter your actual key to complete the activation process.The process is explained further here: https:\/\/softwarekeep.com\/help-center\/how-to-upg... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Regards, David"]},{"symptom":"Your Phone Windows App on Surface Pro Can Neither Update nor Launch        Hello,   My Surface Pro's OS is Microsoft Windows 10 Home, version 10.0.18362. It came pre-installed with the Your Phone App. My Android phone has Android version 9. Launching the Your Phone app on the Surface always sends me to the update screen, which if clicked return me to Microsoft Store that notifies me the app is already installed and there is no update!    When I use the \"Cant Update now?\" option on the Your Phone update screen, I am able to successfully link my phone to my PC. On my Android phone, the Your Phone Companion is not able to connect to my PC. It notifies me to \"Check your PC\", where I can send notification from the Your Phone app. Since I cannot open the Your Phone app this action is not possible.   Please help me resolve this error. Thank you.Regards,Bryen","solutions":["Hi Bryen,Thank you for writing to Microsoft Community Forums.We understand your concern as you are unable to access Your Phone app on your Surface pro PC and it’s redirecting you to Microsoft Store.In this scenario, we would suggest you to perform these steps and check. This will uninstall the app completely from the PC and then install the latest version of the app.Press Windows + X key and select PowerShell Windows (Admin),Then copy and paste this command: Get-AppxPackage Microsoft.YourPhone -AllUsers | Remove-AppxPackageClick on Enter and restart the PC.Once the PC is restarted, go to Microsoft Store and install Your Phone app.Let us know how it goes.Aditya RoyMicrosoft Community – Moderator","Hi Bryen,Glad to know that the issue is resolved with the steps that are suggested. We appreciate your time and effort that you have provided to get the issue fixed. Let us know if you got the help you needed by clicking‘Yes’ or ‘No’. As this will also help other people with similar issue in future. Regards,Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"Win10: getting Font settings to roam.                        How do I get Win10 font settings for a profile to to roam from computer to computer after changes are made.","solutions":["Hello Robert009, I am Andrew an independent advisor. Language settings are done locally on each computer, there is no option to transfer it computer to computer. They have to be set individually.Is there anything else I can help with today?Andrew","Win10: Thanks very much for your response.  However, it's not language settings I am looking to roam its just the system fonts.  Right click on the desktop, go to Display Settings and then change the size of text.  After changing those font size, say from 100% to 125% and move from computer to computer it doesn't stay with the users profile.  The user states she was able to make those same changes in a Win7 environment and those settings stayed persistent.I welcome anymore feedback you may have.Thanks! ","Hi Robert009 My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help answer your question.Is the user signed in with a Microsoft account? Right click Start > Settings > Accounts > Sync your settings > Enable Check Theme & Ease of Access are enabled. Hope this helps."]},{"symptom":"system variables in Windows 10,( limited to 2047)        change character limit in system variables in Windows 10,( limited to 2047)","solutions":["Hi Vermon, here are other users helping. To send feedback to Microsoft please use Feedback Hub.","I really needed to ask for a work around, Should have worded this better. ","See some info at https:\/\/software.intel.com\/en-us\/articles\/limit... Some explanations are at https:\/\/devblogs.microsoft.com\/oldnewthing\/?p=1..."]},{"symptom":"Mail app is NOT secure.        When I delete my email account from Mail app in Windows 10, I can simply click Add New Account, and it is there at the top of the list. I click it, and it logs straight back in, without requiring a password to be entered. THIS IS NOT SECURE. Anyone using my computer can do the same, I want delete to actually mean DELETE! Not just remove it from view but leave it there nice and ready for someone to click on and access my emails.Am I being stupid, or is there a way to properly delete an email account from MAIL, so that when trying to log back in you need to enter the password.","solutions":["Hello Anon131313, I am Andrew an independent advisor. Youre password is being kept because you previously told Windows to store it. To remove the password type CREDENTIAL MANAGER in to the search bar. Within this you can find the stored password for windows mail and delete it. This way it will ask for a password to be able to log in to your account.Take Care,Andrew"]},{"symptom":"My main hard drive fails at auto repairing, yet I can still access it from my other hard drive        Ok Ive tried countless times to repair my main HDD, using all the command prompt stuff, auto repairs useless and Ive checked the log files, and it said it cant come to a conclusion on what the problem is. I booted up from my other SDD, and I can still open, and even move things in and out of that apparently corrupt drive, so what do I do? I would rather not have to lose any files, and if I have to backup my corrupt one to my SDD, then so be it. I really want a better way.","solutions":["What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK","why, should i roll it back?","Hi TD. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.If you can access it then it's still alive so back up your files and test the drive with diagnostics to know for certain it's condition:1) Test the hard drive or SSD with diagnostics: https:\/\/www.lifewire.com\/free-hard-drive-testin...https:\/\/mashtips.com\/ssd-health-test-and-perfor...HP and Dell have hardware diagnostics triggered by tapping the ESC or F12 keys respectively as you power on.Best is to use the HDD\/SSD manufacturer's own if there is one, otherwise use Seatools bootable long test:http:\/\/blog.nowherelan.com\/2013\/04\/04\/boot-seat... Follow this up with a full Disk Check from the Command Prompt in Repair Mode or from bootable media:https:\/\/www.groovypost.com\/howto\/check-hard-dri... if necessary from the Command Prompt at boot:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... If the drive fails replace it and skip to the Clean Install in Step 5. 2) If the drive passes then everything possible is here for Troubleshooting Windows 10 Failure to Start:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... so you can try whatever you've not yet done to see if Windows will start.3) You may need to create bootable media to access Repair Mode, Reset or do the gold standard Clean install. The bootable media has it's own drivers, repair and installation files which often work when Windows or the other Repair Mode doesn't.To create Windows 10 Installation Media on another PC install Media Creation Tool and follow the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.4) Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key:https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, on second screen choose Repair Your Computer, then Advanced Troubleshoot Options, then System Restore and Uninstall Updates. If that fails go back to Troubleshoot Options to try a Reset.5) If that fails choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, click Next to let it create needed partitions and start install - this makes it foolproof.Everything needed to get the best possible Clean Install is here: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... It is a better install than any amount of money can buy and a great learning experience that will make you the master of your PC because you will learn what works best and how to apply it with your own hands. I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I cant find out what version it is if i cant run it, im on my other SSD, and I just cant switch to my HDD without it give me the auto repair failure"]},{"symptom":"Windows stuck at update 1607        Thank you for taking the time to read this post.My computer has been stuck at update 1607 since it got released. My computer installs it (approximately) twice a day (see picture below). I Have tried using the updater manually to install a newer version of windows, this was however to no avail. Once the computer started the installation process is would stop at (around) 14-19% and abort updating. The pc would restart and it would undo changes made to the computer. Does anyone know what might be causing the inability of my computer to update past update 1607? I use windows 10 education. Thanks so much in advance. R-J","solutions":["If you look at the history it is not reinstalling 1607 but updating it.As it says you need to connect with your school and see if they have a newer version (1909 is what you need) that they can give you a copy of to get up to date.","Hi R-J, There may a corrupted registry preventing the update to complete. You can try running the windows update troubleshooting as an initial step in identifying the issue or you can try running the system file checker tool.1. Open an elevated command prompt. To do this, right click the Windows button, and then select Command Prompt (Admin). If you are prompted for an administrator password or for a confirmation, type the password, or click Allow or Yes.2. Type the following command, and then press Enter. DISM.exe \/Online \/Cleanup-image \/Restorehealth - Note It might take several minutes for the command operation to be completed. 3. Type the following command and press Enter. sfc \/scannow - Note It might take several minutes for the command operation to be completed. 4. Reboot and try the update again. You can check link below for your reference. https:\/\/support.microsoft.com\/en-ph\/help\/10164\/...Let me know how it goes for you.","Hi,Try updating to 1909 using Media Creation tool and if it fails, share the logs.The fastest way to get the upgrade is through Media creation tool or ISO file.Please download Media Creation Tool from the link below and select Upgrade this PC at the first screen.https:\/\/go.microsoft.com\/fwlink\/?LinkId=691209All steps, including upgrading using ISO file and Media creation tool, are covered here:https:\/\/www.yourwindowsguide.com\/2019\/05\/update-windows-10-may-2019-update-manually.htmlContent on the above blog is written by a Microsoft MVP so it is safe.Meanwhile, if the update fails with MCT as well.Let us check the Installation log to find why the update failed. Please share the logs as mentioned in this article. You should use a File sharing service like Onedrive or Media Fire to upload files and share the link in the next reply.https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/troubleshoot-feature-update-install-failures\/eaf4ff24-64d6-4c72-824c-3ba3df716fc3The Panther logs. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\PantherThe Rollback logs: These usually are created if Windows Update rolls back. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\Rollback[Only if the error code is 0xC1900101-0x30018] The Device Install Log from C:\/$Windows.~bt\\Sources\\Rollback\\setupapi\\setupapi.dev.log","Hello Rex,I have followed the steps you told me to take and also did everything stated in the Microsoft support page. The troubleshooter couldn't help me, the service stack update could not be installed on my computer (I am 100% sure I got the right version). Thecheck for file corruption also did not yield much in the way of results. After performing an In-Place upgrade I gotthis message. Do you have any idea what the problem could be? Thanks for all the help so far! R-J","Hello Sumit,Thank you very much for your help. I followed all your instructions, and these are the results. After using the media creation tool I was greeted withthis message. The Rollback logs: Setupact Setuperr. For panther I could not get setuperr to function properly, here issetupact. I hope you might be able to help me with this information. Thanks again for your time.R-J","Hi R-J, Thanks trying out my suggestions. Can you try restarting the windows update service?1. Click Start type \"Run\" and type \"Services.msc\" 2. Look for Windows Update service and select stop. 3. Open C:\\Windows\\SoftwareDistribution and delete all contents there. 4. Once contents are deleted then start the Windows Update service. Also, try disabling the firewall and see if it will help.","Thanks R-J.Apparently it looks like Panther logs were removed by Windows as I see the error code. You may share Setupact.log from C:\/Windows\/Panther folder and if it is similar to size of the previous, try again using tool and let it fail. Share the logs then.Microsoft documents the error as following:Code8007001F - 0x3000DCauseThe installation failed in the FIRST_BOOT phase with an error during MIGRATE_DATA operation.MitigationAnalyze log files in order to determine the files or registry entries that are blocking data migration.This error can be due to a problem with user profiles. It can occur due to corrupt registry entries under HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\ProfileList or invalid files in the \\Users directory. NoteIf a previous upgrade did not complete, invalid profiles might exist in the Windows.old\\Users directory.To repair this error, ensure that deleted accounts are not still present in the Windows registry and that files under the \\Users directory are valid. Delete the invalid files or user profiles that are causing this error. The specific files and profiles that are causing the error will be recorded in the Windows setup log files.","Hello Rex,I have done what you told me to do, however this still did not fix the issue. Do you have any idea what might be causingthis?Much thanks for all the help.R-J","Hey Sumit,Here is the setupact.log file you were asking for. I hope this can help. Thanks again for your time.R-J","Hi R-J, At this point having done all the troubleshooting above, I would suggest doing a repair upgrade:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Do you have your original media for Windows 10 Education?"]},{"symptom":"Windows 10 feature update        I'm trying to update my device to windows 10 1909 but but it stuck on 100% for hours and then fails (Feature update to Windows 10, version 1909 - Error 0x80d02002).I tried installing the update using windows 10 update assistant, but also it reaches like 74% and then says \"installation failed\" with error code 0x80070032.I left nothing untried, those where you modify thing in services and CMD, and my region settings are true. windows update diagnostics didn't do anything.. I searched for days on web and tried every possible solution and nothing happened.","solutions":["Try doing the install in a clean boot state. Follow my instructions in this thread.https:\/\/answers.microsoft.com\/en-us\/insider\/forum\/all\/stuck-on-build-18999vbrelease191004-1432\/b4b79b1a-978c-4c44-8d5c-f3f7f3edff14"]},{"symptom":"Your response to my last.        Greg,This is in response to my question and your answer yesterday. I actually responded using the reply curved arrow but got a mail delivery status (failure) notice.  I am hoping this gets through.1. Windows Activation.For your further information, this is a computer that has had a Win 10Digital signature for approximately 4 years. (free upgrade from Win 7)  Forsome unknown reason, it no longer has one that works or is recognized.Having done 15 Win Installs in the last 12 months and 3 days, I do notbelieve that I am absolutely clueless regarding the installation of Win 10but this install, using my usual Win media install USB, seemed to bedifferent. and I did click on the\" I don't have a product key\" as usual, in the process.Also, please note that, with every install, I format my NVME SSD during theprocess, to ensure an absolutely clean install. In this case, however, Ifound that I had to go through the \"win +f10 ... diskpart .... list ....clean\" procedure in order to get apartition on the formatted disk that I could install Windows to.What I need now is to get Microsoft to give me a digital signature or tore-recognize my computer because going to \"Settings\/update and security\/activation\" gives me a red message ... Quote, We can't activate Windows onthis device as our activation serversare not available right now. Make sure you're connected to the internet andwe'll automatically try to activate Windows when the service becomesavailable. Error code 0x80072EE7 Unquote This message has been given to mefor 4 days now.Can you tell me what I need to do now, or how to contact Microsoft to sortthis out without using a phone (no landline or Mobile phone signal here)I really do not feel comfortable using an un-activated Windows 10.I am still working through your \"crash to reboot in games\" response but no luck so far.RegardsTony","solutions":["It's against forums policy to reply in a new thread. In the notification email it should have had a big blue button that clearly says Reply here. Did you miss that?Or you can go into Microsoft Community where you posted in the first place here: https:\/\/answers.microsoft.com\/ click your profile icon in top right corner, choose My Profile, scroll down to your threads to find the one you want to reply to."]},{"symptom":"When setting up this new computer I entered (........)@gamail - a now obvious typo!        While I can use the computer - get emails and downloads OK - when I try to run a downloaded printer driver (Brother) I am unable to switch out of S mode to enable it to run. Windows asks me to verify using this  incorrect email address and sends the code to this non-existent address. Any attempt to correct this typo always results in the code going to this address. I need to remove S mode as I have a lot of programs on my old laptop that I need to load on this new device and understand that I cannot return to this mode.","solutions":["Hi DennisHopkinson follow the guide here to add a new email address and make it the default. if you also add a phone number, the phone can be used for verification. https:\/\/support.microsoft.com\/en-gb\/help\/12407\/..."]},{"symptom":"unlock win10 s mode, but must be an admin        I purchased two computers on which has windows 10 s mode. When I go to settings \/ activation \/    switch to windows 10 homethen select blue link \"Go to the Store\" . . then inside the store \"Switch out of S mode\" press blue \"get\" buttonI get a pop up from User Account ControlTo continue, enter an admin user name and passwordbut there is only a NO button. Normally I would expect an allow button. That means I can't unlock non s mode. ------------------------------------------How do I get the YES button to appear?---------------------------------I have already verified my account with MSand have tried several methods to sign on as Administrator. No luck. 1) win + R  cmderror for security and performance, this mode of windows only run verified apps.2) I am not able to run netplwiz. The prompt \"yes\" box in not shown. https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/windows-10-s-mode\/0deeb5d7-cac2-4e05-983b-332555e0dd6e3) I have found this post [FIX] Lost Administrative Rights In Windows 10https:\/\/www.kapilarya.com\/fix-lost-administrative-rights-in-windows-10but frankly, if I have to go through the stated procedure I will return the machine and never purchased an  - s version installed again.","solutions":["Hi GreggNovosad My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help answer your question.Is your issue now resolved? Hope this helps."]},{"symptom":"\"Driver power state failure\" BsoD after waking up from sleep or closing the laptop physically        I have a Lenovo yoga 530 with Ryzen 7 laptop is probably just shy of off a year old, and have had this problem for a while now and  ive finally decided to try and sort this out. I first reset my PC as I felt like it was quite messy and wasn't that well taken care of in the past, and then updated all my drivers, done all the Power settings aswell but none has helped so far, so in kind of desperate here, any help is much appreciated especially with it being new years right now.I will try to upload some dump files as I think they are quite helpful??Again, thanks for any help","solutions":["Hi wen, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved. The BugCheck were all 9F. BugCheck 9F, {3, ffff9a868a420e00, ffffaa829027d8b0, ffff9a868a759a30} *** WARNING: Unable to verify timestamp for win32k.sys *** ERROR: Module load completed but symbols could not be loaded for win32k.sys Probably caused by : ACPI.sys ACPI.sys is a Windows component which means something else drove it into Fault. Further analysis indicates the likely cause is : WacHIDRouterISDU.sys dated 1\/8\/2019 Wacom Components HID Router driver. More ajjjj and then close 1. Check with Wacom and update or uninstall that drivers. 2. Check with Lenovo Support, their on-line docs and drivers, and ask in their forums about any known issues. Update the BIOS, chipset drivers, and all major drivers.BiosVersion = 8MCN45WW BiosReleaseDate = 08\/17\/2018 <--- current BIOS SystemManufacturer = LENOVO SystemProductName = 81H9 SystemFamily = YOGA 530-14ARR SystemVersion = Lenovo YOGA 530-14ARR SystemSKU = LENOVO_MT_81H9_BU_idea_FM_YOGA 530-14ARR BaseBoardManufacturer = LENOVO BaseBoardProduct = LNVNB161216 BaseBoardVersion = SDK0J40709 WIN 3. Probably, adding to the problem is McAfee. So I would totally uninstall it and use only Windows Defender. WD in Windows 8.1 & 10 is a full antivirus.How to uninstall McAfee Windows security software using the Consumer Products Removal toolhttps:\/\/service.mcafee.com\/webcenter\/portal\/cp\/...List of anti-malware program cleanup\/uninstall tools http:\/\/answers.microsoft.com\/en-us\/protect\/wiki...Uninstallers (removal tools) for common antivirus software http:\/\/kb.eset.com\/esetkb\/index?page=content&am...4. As needed, use ALL the methods listed below: 5. After all the above, and if needed, run Driver Verifier to see it points to anything else.======= Troubleshoot blue screen errors <-- read this link http:\/\/windows.microsoft.com\/en-us\/windows-10\/t...After doing ALL the updates you can, and if the issue continues, then run Driver Verifier. Driver Verifier can help find some BSOD issues : Using Driver Verifier to identify issues with Windows drivers for advanced users http:\/\/support.microsoft.com\/kb\/244617How To Troubleshoot Driver Problems in Windows Vista or 7. (8\/8.1 and 10 are essentially the same). http:\/\/www.winvistaclub.com\/t79.htmlUsing Driver Verifier https:\/\/msdn.microsoft.com\/en-us\/library\/window...WINKEY + X - RUN - type in -> verifier \/reset hit enter to disable If Driver Verifier creates a minidump upload it and post the link here so we can analyze it.Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all."]},{"symptom":"computer will not open. incorrect password .        computer will not open  asks for password but is allways incorrect","solutions":["Please elaborate your issue in details.Are you using Microsoft Account or Local Account?Did you set password or it has been set by someone else?","Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.See if you have by mistake activate the \"caplock\" on your keyboard. And also if you are in the right language, we can see the thumbnail at the bottom right generally, for the language.","hi Marco, thanks for your idea tried  but does not work.","If you use a Microsoft account, make sure the your PC is connected to the Internet while logging in.It's possible that you've enabled NumLock or your keyboard input layout was changed. Try to type your password using the on-screen keyboard."]},{"symptom":"My Xbox privacy is locked.        I want to play games with my friends, but for some reason when ever I try to change the privacy setting it keeps sending me to the Microsoft support site about \"Changing your child's Xbox privacy settings\". This is a very new Microsoft account and no one has made a parent account for this account. How do I get by this situation? I'm using the Xbox Console Companion app on my Laptop.","solutions":[]},{"symptom":"Taskbar color.        Cannot change the color of the taskbar. The option is greyed out.","solutions":["Hi John. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See here how to restore color to the task bar, Start Menu and window frames after Verison 1903 turned the light theme to all dull grey:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Let me know how it goes. I'll be here to help until it's resolved. _________________________ Linked tutorial is from a trusted Microsoft MVP"]},{"symptom":"Calendar for Windows 10 -        I can not retrieve info from Jan. 01, 2019 thru June 01, 2019  -  I need that information.","solutions":["You'd go to where you originally set up the account when you got it: Office Outlook, Yahoo.com, Gmail.com, Outlook.com, AOL.com, etc."]},{"symptom":"Sluggish, or fast mouse movement when starting the computer.        Hello there,I have a problem where upon starting my computer for the first time, my mouse is either too fast, or too slow.  Changing the speed in settings does not work, however if I restart my computer, the mouse speed will be normal.So whenever I start my computer, I am forced to restart right away every time, before I can use it.This fix does not take long, but it is still annoying. So if the microsoft community can help me out, I'd be really grateful.RespectfullyMarkus","solutions":["Hi MarkusH2, My name is Riccardo and I'd be happy to help.. Let's see if something is causing your computer to slow down - can you perform a clean boot:https:\/\/answers.microsoft.com\/en-us\/insider\/for...and then let me know if this fixes the issue? Let me know if you have any questions, I will be here to assist."]},{"symptom":"Office Update        My system attempted a MS Office update.  It now will not start MS Excel. I get the error message: The application was unable to start correctly (0xc0000142).How do I fix this?Thanks","solutions":["Hi Earl. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Repair Office following the guide here which applies: https:\/\/support.office.com\/en-gb\/article\/repair...https:\/\/www.groovypost.com\/howto\/repair-microso...If this doesn't work then reinstall Office as shown here: https:\/\/support.office.com\/en-us\/article\/downlo...https:\/\/support.office.com\/en-us\/article\/downlo...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Printer Settings        Hi, I connected my printer and it has manual double-sided print. I cannot change the setting on the printer. Information says to change through Windows but I'm not sure where or how to do that. I'm not great with computer stuff..... Thanks!","solutions":["Hi Cori. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.These settings will be in the full printer software, accessed by opening it from the Apps list in Start Menu. If not there type Printer in Search box, open Printers & Scanners, click on the printer, then Manage, then Printer Properties to scour each tab for the setting needed. Rather than spending too much more time fiddling I'd simply Clean Install the printer which always works, lasts longer and actually saves time:1) Power up the printer, if wired unplug it's USB cable from PC. 2) Go to Settings>Apps>Apps and Features to find and Uninstall any printer software.3) Use one of these methods to remove all of the old printer drivers: https:\/\/www.tenforums.com\/tutorials\/101274-unin...https:\/\/helpdeskgeek.com\/how-to\/remove-uninstal...4) Now type Control Panel in Start Search, open CP, choose Icon View. In Control Panel open Devices and Printers, right click printer to delete Printer and any scanner or fax of the same name. Restart PC.5) Go to the printer model’s Support Downloads webpage to download and install the latest full software package. Now is also the time to check for any newer printer firmware to install which matters a lot.6) Extract Printer software, right click Setup file to Run as Administrator. Follow the setup screens closely as you install the software. For USB it should prompt when to plug in the printer.Older software may need to be installed in Compatibility Mode to run correctly: https:\/\/www.groovypost.com\/howto\/run-old-softwa... If you have further problems reply back with results of each step. Once it's installed and you've run a test print, then scanned it to see that it opens on the desktop, open the Printer software and go into its Settings to set the scan-to file location you prefer, also the email app you want opened for Scan to Email, if applicable.I hope this helps. Feel free to ask back any questions and let us know how it goes. If you will wait to rate my post until we are done, I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]}]}