{"windows":[{"symptom":"notepad.exe        How do I move notepad.exe for OS build 1809 on one laptop to OS build 1803 on another? The newer version of notepad has \"find\"  and \"replace\" wraparound while the older version does not.","solutions":["Hi Robert Have you tried coping Notepad.exe from C:\\Windows\\System32 on one PC to the other, or are you getting errors when doing that?That should work, unless Microsoft has put the new functionality in Notepad into a separate DLL, but I doubt they did that . ..","I tried copying the executable but I needed, first, admin rights which I had, but then trusted installer rights that I don't know how to acquire.","The newer version of notepad has \"find\"  and \"replace\" wraparound while the older version does not.What exactly do you mean with \"find\" wrap-around?","if the \"find\" or \"replace\" wraparound checkbox is checked and the text is not found from the current cursor position to the bottom of the text, wraparound continues from the top of the text to the current cursor position, a la Adobe Reader.","if the \"find\" or \"replace\" wraparound checkbox is checked and the text is not found from the current cursor position to the bottom of the text, wraparound continues from the top of the text to the current cursor position, a la Adobe Reader.OK, I learnt something new.Back to the reply that DaveM121 gave you: Does notepad.exe run when you copy it to your desktop? If yes then let's address the folder access rights later.","No. Can't get it to work on the desktop. Windows asks if I want to allow software from an unknown source modify my computer, which is a little weird because it's a microsoft product. Anyway, clicking \"yes\" produces a null response, i.e, no action. It has to be in the System32 folder and I need \"trustedInstaller\" rights to put it there. That's the only way it will open when double clicking a .txt file.","It has to be in the System32 folder and I need \"trustedInstaller\" rights to put it there. No, you don't! Try this:Create a desktop shortcut for cmd.exe.Right-click this shortcut, then left-click \"Run as administrator\".Accept the challenge. You will get a black frame.Type these commands and press Enter after each:cd  \\Windowsren notepad.exe *.orgcopy e:\\notepad.execd System32ren notepad.exe *.orgcopy e:\\notepad.exeNote this:Notepad.exe exists in two places.You must rename the original version in order to have a safe backout path.My commands assume that the new version resides on drive E:\\. Adjust as appropriate!Whether this version of notepad will work remains to be seen.","Haven't tried it yet but I've already found that I can't rename the original.","Haven't tried it yet but I've already found that I can't rename the original.Yes, you can when working with elevated privileges.","Already tried expanded privileges. When this all started I was able to copy the new version to a flash, rename it there to notepad2.exe, then paste into the Windows and System32 folders with no problem. The issue came with renaming the existing version, then renaming the new version to notepad.exe. Last night I tried working with the registry to change the startup behavior for .txt files so those would open with notepad2.exe instead. Tried modifying the ShellNew path with no effect. Evidently, I need to modify the persisenthandler setting but that's a 128 bit key or ID that identifies the original version. Don't know what that is for the new version. There's a simpler solution: give up. Confine all software development to the laptop with the new version which means more difficult debugging or continue to be somewhat frustrated with the lack of \"find\" wraparound. But that's nothing new. I've been frustrated with that for many years. By the way, I gave the OS version on my original submission, not the build. The actual OS build for the new version is: 17763 (Sept '18), for the old version: 17134 (April '18)."]},{"symptom":"How to turn off AUTOCLICK in Windows 10        I have read every article I can find about how to turn off AUTOCLICK. The common thread is to uncheck the \"activate a window when pointer hovers over it\" approach. That does not disable the autoclick function for me. I've altered the sensativity with no success.Is there any alternative approach you can suggest? It is driving me crazy.","solutions":["Hi Arthur, Click your Start Button, type regedit and hit ENTER to open the Registry Editor In the left pane navigate to: HKEY_CURRENT_USER\\Control Panel\\Mouse In the right hand pane: Double click MouseHoverWidth and set it to 0 Double click MouseHoverHeight and set it to 0 Close the Registry Editor, restart (not shut down) your PC and see if this behavior is now fixed . . .","Thanks for the effort but .....The autoclick\/swap\/initiate or whatever you wish to call it is still in effect.","Please explain what you mean by AUTOCLICK. The only clicking of which I am aware is done by a mouse, and I don't know any function in Windows that automatically clicks a mouse.","I'm working with a MS tech now. Thank you all for your attention and efforts."]},{"symptom":"Unable to remove credit card from Microsoft Account        I cant remove my mastercard when i go into payment options all it does is send me to this address https:\/\/partner.support.services.microsoft.com\/en-us\/partners\/amc\/paymentoptions and that doesen't help worth a lick ***Original title: Why cant i remove my credit card***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues while removing Credit Card from your Microsoft account. ​If you’re trying to the remove a payment option that's tied to a Microsoft subscription with recurring billing (such as Xbox Live Gold, Xbox Game Pass, or Office 365), it can't be removed until you change how you pay for the subscription. I would suggest you to refer the section Troubleshooting problems changing a payment method from the articleChange the payment method or credit card linked to your Microsoft account and see if that helps. However, if the issue persist, I would suggest you to get in touch with theTechnical Support Team and they will assist you further with the issue. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"RCA Cambio Boot Loop \"Undoing Upgrade Changes\"        I have a RCA 10.1 Cambio that received an upgrade, but after that the upgrades were installed the screen showed. \"Undoing Upgrade Changes...\" It has been boot looping since yesterday, and today I tried Win RE, but it's not letting me going back to an old version, repair start, reestablish the system. Also, Is not showing up any backups that I have made.","solutions":[]},{"symptom":"Windows Administrator account linked with an e-mail address with no access. How do I change to my e-mail account?        The administrator account was linked to an e-mail account of an employee when she logged in.  Can I change the e-mail account without deleting the Administrator profile? The person is no longer an employee and is not available for mutual help.","solutions":[]},{"symptom":"printing         Problem with printing from word and notepad only.","solutions":["Hi RHDQ and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps on how to fix printer connection and printing problems in Windows 10. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-us\/help\/401540...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"Flash issues        Hello,  Why am I unable to use Flash, it is always blocking a show from CNBC; I go through the steps, unblock, allow and click 'run flash this time' and it does not work. Any ideas?Thanks,        Bob","solutions":["Hello. What web browser are you using? You may have to delete cookies. ","Hello Bob, this is Roman, I'm a independent adviser. Flash is a technology which is blocked by most modern browsers. Normally you can activate Flash (if your Browser supports it) in the browser settings.On the following page you can see how Flash is enabled in the different browsers:https:\/\/enableflashplayer.com\/Best regards, Roman --- Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Please be careful clicking on links and downloading software.Watch out for ads on the website that may advertise products frequently classified as a PUP (Potentially Unwanted Products).","Thanks,   I tried Firefox and did not have the issue."]},{"symptom":"How to SWITCH login method from PIN to password        Apparently Microsoft really wants their users to use a PIN instead of a password. So much so, that when a user sets up a PIN, (which some applications require), the PC changes its settings to use that as the Log On method. All I want to do is change my log on method BACK to my password.I'm using Windows 10 Pro, with Touch Support.    (Build number doesn't show on the \"Control Panel - System\" window. I guess that's another topic)Please do NOT try to explain:  - Why a PIN is more secure than a password.       (It's not, because my password ONLY opens my PC. It doesn't work on any other account). - How to reset my password or PIN.     (I haven't forgotten either one.) - How to switch TO using a PIN as a log on method.     (There are many threads on that subject. I've yet to find one which explains how to switch BACK to using a password.)","solutions":["Hi James,You can only set up a PIN if you've set up a password on your Windows 10 user account. Once you set up a PIN, you will have the option to either change or remove it. To remove your PIN, follow these steps:Click the Windows logo (Start button).Click the gear icon (Settings).Select Accounts.On the left pane, choose Sign-in options.Under PIN, press Remove.Click Remove again.Enter the user account password, and then click OK.After doing the steps above, you can sign-out to your account to see if you will be able to log-in using the password.Let us know how it goes."]},{"symptom":"How to disable\/remove the volume popup banner.        I'd like to now how to remove this banner from appearing in the top left of my screen, its annoying and irrelevant to me, making it an eyesore as it stays there obxiously for 7-10 seconds whenever I adjust my audio on almost anything that is playing sound.I don't mind the actual volume bar as I do use that to see what volume I am on, however I'd like to know if there is a way to remove the banner to the right of the volume indicator that reads \"chrome.exe\". I've searched extensivley online and it seems to me that there isn't a easily avaliable solution?","solutions":["Hi LukeKerley, it is a feature of chrome. to make it easy to pause media content to remove, it close the tab that contains media content. (or close chrome)","I just spent a couple hours trying to resolve this. Here's a thread, answer in there: https:\/\/forums.tomshardware.com\/threads\/how-do-i-get-rid-of-chrome-exe-extra-box-in-the-volume-osd.3486794\/Go to chrome:\/\/flags\/#hardware-media-key-handlingSet Hardware Media Key Handling to DisabledRestart the browser to apply the changes.","Please fix this Microsoft!!! How do we get the volume indicator to not display at all, or for less time? Getting really annoying as I can't press any buttons on the top left of my computer when changing volume, which I have to do a lot due to changes in volume in what I am listening to.","The easiest way to get rid of the popup banner entirely is by using a free program called HIDE VOLUME OSD.  There are two version, the second one called \"silent mode\" hides it for all programs. Worked like a charm for me!Here is the developers site:http:\/\/wordpress.venturi.de\/?p=1","I just spent a couple hours trying to resolve this. Here's a thread, answer in there: https:\/\/forums.tomshardware.com\/threads\/how-do-i-get-rid-of-chrome-exe-extra-box-in-the-volume-osd.3486794\/Go to chrome:\/\/flags\/#hardware-media-key-handlingSet Hardware Media Key Handling to DisabledRestart the browser to apply the changes.Thank you!!","Awesome, thanks so much!"]},{"symptom":"Memory Usage        Hiya,  My name is Angelo, Hi.My issues is the total amount of RAM that is being sucked-up (as in) used by the O\/S even without me doing anything.The first thing I notice is that the antimalware app is killing my RAM, then WMI, System Interrupts, all the usual, then Nortons is constantly doing something in the background, like I mean 24\/7 churning away and chewing-off a huge chunk of my meagre 4GB of DDR-4 - (even with the 16GB of Optane) it seems that my RAM is constantly being maxed-out, even more so if I start using any browser, it's not just applicable to Edge, I get in on all browser activities, and if I am on facebook and YouTube at the same time (as I often need to be) bcoz I am listening to tracks and communicating with friends regarding those particular tracks\/videos, then they start \"clipping\" or stalling altogether, the screen freezes (no mouse pointer movement) for most of a minute sometimes, (+\/-) more or less a minute, and I check task manager and see that the CPU is going ballistic and the RAM is running at a 100% - like **** MS? is this Win 10 doing to my PC?  I cannot function like this for much longer.  I started this PC from brand new 1 year ago, just over, it came with Windows 10 installed and paid for, it was just Plug n Play, ya know!!  So, for 11 months all is well, no major stuff, except the Ram usage when using Edge.  Then suddenly last month I start getting these freezes on the screen, due to my RAM being Maxed-out at 100% along with my CPU burning rubber at 100% ''Full On''. . . . that's when the issues started.So, what now MS?  Like, what the heck do I do now?  The PC is great, not  at fault, everything in the box checks out 100%OK.  But I keep getting maxed out by the O\/S doing stuff in the back ground.The PC is competent enough, trust me, it really is, 8th generation Core i5+ on 4GB's of DDR-4 with 16GB's of Optane, 1Tera HDD, very little added to the HDD since New, all updates installed each week, everything has been updated according to MS, that's happens automatically.I don't know why Nortons is doing stuff in there, I did not renew the annual subscription thingy for that, so I just left it with the built in antimalware and Win 10's Fire Wall and all the etceteras, but not Nortons, but it seems that even if not paying for the subscription thingy, Norton's still is functioning with the O\/S.  I assume that is because MS still uses their software and Symantec's to get certain things done, hence the activity, but even so, does it have to eat ALL of my RAM in order to facilitate that?Would 16GB's of DDR-4 resolve this issue with the RAM?  I'd have to void the current Warranty to do that, but, but, if it will fix this I may have to consider doing that.Any suggestions MS?  Mr. Gates?  'Bill'  Thanks in advance for any help with this.  Angelo now GB, no longer EU. ","solutions":["Hi Angelo. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) No expert in Forums - where we see the most cases, by the thousands - recommends Avast, AVG. Norton or McAfee, but we have solved many problems over the years by having them uninstalled.I would uninstall any 3rd party antivirus in Settings > Apps > Apps & Features and try running only built-in Defender which gives adequate protection, best Windows performance, least issues, and is from Microsoft who knows how to protect their OS best.After uninstalling antivirus in Settings > Apps > Apps & Features, restart the PC, then type Security in Start Search, open Windows Defender Settings, there and in Windows Defender Security Center fix anything that's flagged.If you want the best on-demand scanner download and install Malwarebytes from https:\/\/www.malwarebytes.com\/mwb-download\/ In it's Settings > Protection > Scan Options enable Scan for Rootkits. Then on Scan tab choose Threat Scan and Run Scan. Clean up anything found, restart PC and then run again until it comes up clean. If you want to keep Malwarebytes as an on-demand scanner then you can disable its Real Time trial version in it's Settings > Accounts tab.Next check for damaged System Files since the problem anti-viruses can damage WIndows:https:\/\/www.lifewire.com\/how-to-use-sfc-scannow... If it cannot repair them see Step 10 here to continue: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... 2) See fixes for high RAM usage: https:\/\/www.partitionwizard.com\/partitionmagic\/...https:\/\/superuser.com\/questions\/949244\/windows-...3) Test the RAM overnight to stress it with the best bootable test memtest86, following this guide to test both sticks and slots:https:\/\/www.wikihow.com\/Test-PC-RAM-with-MemTest86Run Crucial System Scanner to check the RAM is properly spec'd and configured: https:\/\/www.crucial.com\/usa\/en\/systemscanner?cm... 4) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 5) Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.6) If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"win 10 keep trying to update and fails        I did the free update from win 7 to win 10.  Everything works fine except about every 2 or 3 months win  says I am m out of time and must update. I select now and it reboots a couple times and then stop at 100%.  I have to reboot three times and it recycles back the 'old' version. ","solutions":["Hi John, 1 Click your Start Button, type winver and hit Enter On the resulting dialog, what Version No. and build No. of Windows 10 are you running?2 Open the Settings App (gear icon on your Start Menu) Go to Update and Security - Windows Updates What update(s) are showing as pending on your system?","ver 1803 build 17134.1184What update(s) are showing as pending on your system?kb2267602 and kb 44886153","Failed to install on ‎1\/‎7\/‎2020 - 0xc1900101got this code three install attemps","Hi John Click the link below, then click 'Update Now' on that page to immediately get 1909 and bring your PC right up to datehttps:\/\/www.microsoft.com\/en-us\/software-downlo...If you hae any difficulty with the 'Update Now' link above, with these major upgrades, the most successful method is to upgrade from the Windows 10 ISO - you download the ISO and then perform an Offline UpgradePlease Note, follow the steps, this is then just an update and your files and applications will remain untouched . . .Click this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), then choose ISO, not USBWhen the ISO file completes downloading Disconnect from the Internet Temporarily disable any 3rd party Anti-virus you may have installed Then, in Windows File Explorer, double click the ISO and then run Setup.exe to begin the upgrade . . .","Still did not work.  Got this  message:We couldn't install windows 100xC1900101 - 0x40017the installation failed the second_boot phase with an error during the boot operation.Feature update to Windows 10, version 1903Failed to install on ‎1\/‎7\/‎2020 - 0xc1900101Failed to install on ‎1\/‎7\/‎2020 - 0xc1900101Last failed install attempt on ‎10\/‎29\/‎2019 - 0xc1900101Feature update to Windows 10, version 1903 (2)Last failed install attempt on ‎9\/‎6\/‎2019 - 0xc1900101"]},{"symptom":"FallenSouls: The Dark Lord        i downloaded this game from microsoft store from free games, i have been playing like a month or 2. I was just playing sunday. so when i try  to play on Monday i cant play, why i can login but then says cant connect to network. I have unistalled reinstalled deleted refreshed, checked to make sure my internet connection was good and still cant connect. yes i have the latest update for windows 10. i tried to reach the developer of the game which says OGA games but its if they are a GHOST no info at least that i found. how is that possible that i got it from the microsoft store but there isnt any info for us consumers this game has in app purchases I didnt buy anything but if i did i would be irate. I was just wondering does anybody else know of or have played this game and who can i contact about my issues with their product. Thanx In Advance","solutions":["im having same issue or when connects and lets me on it just freezes or starts quest or challenge and then does nothing and you don't credit for any of it and I have spent a lot of money on this game to point of getting very angry they need to fix this issue ive taken pc in and had my ninternet connection checked its not on my end "]},{"symptom":"Microsoft Store downloads hang        Whenever I open the Microsoft Store on my computer, it tries to download (presumably updates for) \"Microsoft Store,\" \"Mail and Calendar,\" and \"Xbox Console Companion.\" All of them go through the usual process of checking files->allocating disk space->downloading, but on that last step, they just stay there with the three dots appearing and disappearing without any actual downloading, and any other Microsoft Store downloads I try to start do the same thing, even resetting to \"pending\" if I close and reopen the store. I tried clearing the store's cache with the wsreset.exe command, and even using a code to reregister it (\"& {$manifest = (Get-AppxPackage Microsoft.WindowsStore).InstallLocation + '\\AppxManifest.xml' ; Add-AppxPackage -DisableDevelopmentMode -Register $manifest}\" ),  but still no change.It's not my internet because I can still go on websites just fine, and it's not my disk space because, unless they're somehow 50+GB, I should have more than enough disk space free for them. I also know that it isn't due to my impatience, because I turned on, logged into, and started a download through my Microsoft Store account on a different computer, and that one made clear, visible progress while this one still had no change. Plus, this has been happening for months, so it's not like restarting my computer will fix it.This is what it looks like:","solutions":["The 3 dots says that they are waiting.  When those that are downloading get started or finished the other will start.  With that many it may take a little while.","Hi Imaynotbehere4long and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.1. Have you tried to repair Microsoft Store? Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/402805...2. If the above instructions did not fix the issue, perform the SFC & DISM Method. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","I tried following the info in the first link (settings->apps & features->windows store->advanced options->repair), but there wasn't a \"repair\" option. There was a \"reset\" button, but clicking this didn't fix my issue; it only reset my taskbar color.As for the second link, the DISM command got to 100%, but didn't allow input afterward (even though the cursor was blinking), so I had to close and reopen PowerShell. As for the \"sfc\/scannow\" command, it returned the following when finished:\"Windows Resource Protection found corrupt files but was unable to fix some of them.For online repairs, details are included in the CBS log file located atwindir\\Logs\\CBS\\CBS.log. For example C:\\Windows\\Logs\\CBS\\CBS.log. For offlinerepairs, details are included in the log file provided by the \/OFFLOGFILE flag.\"Typing \"\/OFFLOGFILE\" resulted in an \"object not found\" error, and even following the link's suggestion to typefindstr \/c:\"[SR]\" %windir%\\Logs\\CBS\\CBS.log >\"%userprofile%\\Desktop\\sfcdetails.txt\" also resulted in an \"object not found\" error. I was able to find CBS.log,but couldn't understand any of it. My issue is yet to be fixed, so should I just copy and paste everything in the CBS.log file and post it here?","Hi Imaynotbehere4long, Yes please, if possible, please provide a screenshot of your log so we may understand the problem in more detail.Thanks!","Note: I removed everything before 1\/10 because that's before I did the scan. Also, this is just CBS.log; as I said earlier, I couldn't find any other log files.P.S. The log file was too large to paste here, so I uploaded it on an external site:https:\/\/www.dropbox.com\/s\/5dotfyd67oxf5dh\/CBS.log?dl=0P.P.S. I also tried changing the storage setting for where new apps are saved, but that hasn't fixed my problem, either.","Hi Imaynotbehere4long, I would suggest repairing Windows 10 Using In-Place Upgrade. You may try following these steps. Check this article for detailed instructions. https:\/\/www.kapilarya.com\/how-to-repair-windows...Let me know how it goes. Thanks! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","On step 4, it won't let me select \"keep personal files and apps.\" It won't even let me select \"keep personal files only,\" and I even right-clicked and chose \"run as administrator.\" Both options are greyed-out, even though I have more than the 10GB minimum free space. Should I try the article about how to \"refresh\" Windows 10 instead?","Hi Imaynotbehere4long, Recovery options in Windows 10. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/12415Let me know how it goes. Thanks!"]},{"symptom":"Error 3FO upon startup        Hello, I am posting this to see if anyone else has this same problem or a solution. Sometimes, upon startup, my computer will come up with the error 3FO, boot device not found or no OS installed. After about 15-20 minutes of leaving my computer turned off I can turn it back on again and it will boot up normally. However, next time I turn off my computer the whole process repeats itself. I have narrowed the issue down. Eventually, I was able to get the error message to stop popping up on startup by updating to the next windows update. However, there was a new update just a few hours ago that did not install automatically and my computer did not start up for 20 minutes. Once it booted up again, I updated windows and it works fine. It would be amazing if anybody has any information on this because this issue is extremely annoying and can happen randomly when I need my computer most. Thank you","solutions":["Hi Gavin A 3FO error can sometimes indicate an imminent hard drive failure, that error is produced by the hardware test on your PC and not by Windows . . .Is your PC a HP system by any chance, if so this is a known bug on a HP and generally does not indicate hard drive failure . . .How old roughly is your PC?","Yes, my computer is an HP Pavillion 15 and is about 8 months old. This problem only started occurring about 2 months ago.","Hi Gavin There are few options on this page on the HP website, hopefully one of those will resolve this for you:https:\/\/support.hp.com\/ie-en\/document\/c01443463________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]},{"symptom":"New Computer \/ Game and App Crashes on Windows 10 Home        So i just over this past weekend built my first computer. Specs:Asus Tuf Gaming X570-PlusNvidia GeForce RTX2060AMD Ryzen 5 3600xSamsung SSD 1TBVengeance Corsair 2 x 8GBSince installation i have been having problems with almost all of my apps and games crashing. For example the last ones event log is here:Faulting application name: RustClient.exe, version: 2019.2.0.49510, time stamp: 0x5d317c91Faulting module name: d3d11.dll, version: 10.0.18362.387, time stamp: 0x7e72d1cbException code: 0xc0000005Fault offset: 0x000000000011e5e0Faulting process id: 0x2140Faulting application start time: 0x01d5c8aff0892d2aFaulting application path: C:\\Program Files (x86)\\Steam\\steamapps\\common\\Rust\\RustClient.exeFaulting module path: C:\\WINDOWS\\SYSTEM32\\d3d11.dllReport Id: f9a02f16-5dee-41ad-ab7e-55e7ba7520ecFaulting package full name: Faulting package-relative application ID:                 Another Example: Faulting application name: RuntimeBroker.exe, version: 10.0.18362.1, time stamp: 0x4539d5a0Faulting module name: SettingsEnvironment.Desktop.dll, version: 10.0.18362.387, time stamp: 0x10b406e4Exception code: 0xc0000005Fault offset: 0x000000000002b605Faulting process id: 0x1bd4Faulting application start time: 0x01d5c8b15e4f6d33Faulting application path: C:\\Windows\\System32\\RuntimeBroker.exeFaulting module path: C:\\WINDOWS\\SYSTEM32\\SettingsEnvironment.Desktop.dllReport Id: a053a4b2-9d22-4aa0-b0d3-f12ebec3cfa3Faulting package full name: Microsoft.Windows.Cortana_1.13.0.18362_neutral_neutral_cw5n1h2txyewyFaulting package-relative application ID: runtimebroker07f4358a809ac99a64a67c1  Im not sure what to do to fix this as i have updated all the drivers to the lastest versions, actually reinstalled most of the computer, to end up with these same results. Any suggestions or fixes?","solutions":[]},{"symptom":"Windows 7 Service pack 1 installation failed (KB976932)        Hi, I cannot update Windows 7 Service pack 1 installation(KB976932).   I tried many many times, it failed.  Please help!  Thanks.  Tania","solutions":["Hi, I cannot update Windows 7 Service pack 1 installation(KB976932).   I tried many many times, it failed.  Please help!  Thanks.  TaniaNot sure what you mean by Updating Service Pack 1.Have you Re-Installed Windows 7 via a disk which did not have Service Pack 1 already streamlined into it ???To make sure if its not already installed. Select the Start Button and right click Computer Tab. Select Properties.Under Windows Edition you will see if it already has Service Pack 1 installed.","KB976932 is SP1Windows 7 SP1 should have been installed years ago.Here is the information about SP1:Install Windows 7 Service Pack 1 (SP1)To check if Windows 7 SP1 is already installed on your PC, select the Start button, right-clickComputer, and then select Properties.If Service Pack 1 is listed under Windows edition, SP1 is already installed on your PC.@@@@@@@@@@@@@@@@@@@@@@@@@@Installing Windows 7 SP1 using Windows Update (recommended) If your PC is set to automatically install updates, you’ll be prompted by Windows Update to install SP1. Follow the instructions to install the update.Or:And the download link from the above link:Go to the Windows 7 Service Pack 1 download page on the Microsoft website.@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Then:Convenience rollup update for Windows 7 SP1 and Windows Server ...This article describes a convenience rollup for Windows 7 Service Pack 1 (SP1)-based and Windows Server 2008 R2 SP1-based computers. This rollup package includes most updates that were released after the release of SP1 for Windows 7 and Windows Server 2008 R2, through April 2016. This convenience rollup is intended to make it easy to integrate fixes that were released after SP1 for Windows 7 and Windows Server 2008 R2. We recommend that Enterprises include this rollup package in the image creation process to make it easier to quickly set up a computer.There are concise download details about it from aakkam22  in this link:https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_7-update\/how-to-obtain-and-install-windows-7-sp2\/c2c7009f-3a10-4199-9c89-48e1e883051eFurther reading about the above \"convenience update\", dubbed Service Pack 2:https:\/\/www.howtogeek.com\/255435\/how-to-update-windows-7-all-at-once-with-microsofts-convenience-rollup\/Cheers."]},{"symptom":"Windows 10 pro        i recently upgraded my computer with a new motherboard and a new cpu and when i started up the new upgrade it was fine but after 4 days it came a message \"windows not activated\" and it says that i dont have a product key please help!! ","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? Did Windows come pre-installed on the PC or did you purchase Windows separately? Was the Pro an upgrade from Home?Run this to see what is currently installed & post a screenshot: Right click on start & choose powershell with admin & enter: slmgr.vbs \/dlv This will show a popup showing whether your license is OEM, Retail, or Volume amongst other information.If this states you have a volume licence then there is away to return to a legal key if there's one in the BIOS.If it does please post back. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","i am running 1903 version and windows did not come pre installed and i hade home on my old one but now i have pro after the upgrade. it says that i have a reatail version and i downloaded the free version from microsoft webbsite on a usb. ","Did you purchase the Pro upgrade from the Microsoft store or has Windows become Pro after changing the motherboard?","when i reinstalled windows 10 i chosed pro.l I got the free version from microsoft not the one you are paying for.","There is no free upgrade to Pro. This is certainly why it is not activating.You either have to have purchased the full Pro license or purchased the Pro upgrade from Home via the Microsoft App Store.You will have to downgrade from Pro to Home to activate Windows. Try this by Andre Da Costa: Unfortunately, clean install is your only option, you can't downgrade from Pro to Home. Changing the key will not work. You could try the following work around then test your luck:Open Registry Editor (WIN + R, type regedit, hit Enter) Browse to key HKEY_Local Machine > Software > Microsoft > Windows NT > CurrentVersionChange EditionID to Home (double click EditionID, change value, click OK). In your case it should at the moment show ProChange Product Name to Windows 10 Home. In your case it should at the moment show Windows 10 ProfessionalBrowse to key HKEY_Local Machine > Software > Wow6432Node > Microsoft > Windows NT > CurrentVersion, change the same two values as in steps 3 and 4 aboveClose the Registry Editor Insert the Windows 10 Home installation media, do an in-place upgrade by launching the setup from desktop (not booting with Windows 10 Home install media)When asked, enter your valid Windows 10 Home product key and select what to keep (settings, personal files and apps, only personal files or nothing)Windows 10 Home in-place upgrade will be done now. https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"ipf file        how do you open ipf files in windows 10thanks","solutions":["You'll get lots of instant answers when asking Google like so:how to open .ipf files"]},{"symptom":"Can't seem to be able to burn disc        Excuse me but I am not computer savvy. After Christmas I was able to burn our dvds from my memory stick. Since then I have tried to burn last years Christmas from the Windows Media Player using the same computer and dvds. Here is what keeps coming upAny suggestions?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. The error message suggests that there is some issue with Disc format. Please enter another blank disc which the DVD drive supports. For example DVD RW+ drive."]},{"symptom":"Can't expand my primary drive.        I recently transferred my data from SSD to SSD one being 250G and to one being 500G this caused my primary drive to be at 210G like on the original 250G drive. I cant expand the drive, when i hover over expand it it gray and i can not click on it. I looked at the post \"Unable to extend C drive\" and it kinda worked for me until it was a system\/Boot file i would have to delete. In order for me to be able to get access to the 254 unallocated data i need to move the Healthy (EFI System partition). I you have any tips or ways to solve my problem let me know and thank you for your time. ","solutions":["Hi Logan WIndows has very limited partitioning capability, you will need to use a 3rd party utility to extend C into that unallocated space . . .The free version of AOMEI Partition Assistant is fast, fully featured and easy to use, and will easily resolve this fro you . . .https:\/\/www.diskpart.com\/download-home.html________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi Logan, okay, please let me know how that goes . . ."]}]}