{"windows":[{"symptom":"screen flickers only on specific game        Respected sir ,                      recently when I was playing transformers and farcry 3 my screen  start flickering but was not flickering when I have played Assassian  creed 3 and gta san andreas  . my pc specs are i3 4160T with 4 gb ram and intel hd graphics 4400 . Please help me to fix this problem . ","solutions":["Hello techboy2, thank you for providing this question. I am a seasoned Windows expert with almost a decade in usage and support experience and hope to resolve your problems quickly.Usually this behaviour is related to vsync, ambient lighting and screen refresh rate. I cannot test for farcry 3 but try to set the fps ingame to a value less then the screen allows, switch around vsync settings and ambient lighting until you found the culprit.If you consider your problem solved it would be very good if you marked the answer which helped you so others can find and use this thread.If this didn't solve your problem or you need further assistance please answer in this thread and i would be happy to help.kind regards F. Grobusch"]},{"symptom":"regarding windows 7        sir, I Had lenovo Z570 ideapad laptop, its harddrive was corrupted in last few months. so i had replaced the hard drive with new one. burt i didnt had the backup of windows 7 for it.i had licenced versionHow could i install it ?how could i upgrade it?","solutions":["sir, I Had lenovo Z570 ideapad laptop, its harddrive was corrupted in last few months.so i had replaced the hard drive with new one. burt i didnt had the backup of windows 7 for it.i had licenced versionHow could i install it ?how could i upgrade it?Microsoft does not supply Windows 7 ISO downloads for OEM preinstalled operating system Product Keys for Dell, HP, etc. machines@@@@@@@@@@@@@@@@@@@@@@@@@@You can borrow the exact same edition of Windows 7 Retail DVD and use your Product Key on the COA sticker to reinstall the operating system.@@@@@@@@@@@@@@@@@@@@@@@@@Or you can use this for preinstalled OEM or Retail Licenses. This is on a first come, first served monthly basis.Download the correct ISO file and make your own disk and use the Product Key that is on the COA Sticker.https:\/\/www.heidoc.net\/joomla\/technology-science\/microsoft\/67-microsoft-windows-and-office-iso-download-toolDownload: Windows ISO Downloader.exeAnd here are instructions on how to burn ISO images to disk:http:\/\/www.snapfiles.com\/get\/ISORecorder.htmlYou change the Boot Order in the BIOS to be able to boot from your installation media:How to Boot Your Computer From a Disc or USB DriveThen do a clean install:http:\/\/www.sevenforums.com\/tutorials\/1649-clean-install-windows-7-a.htmlThe COA sticker is either on the underside of the Laptop or in the Battery Compartment.With a Desktop it is either on the side, rear or top of the Computer Case.Using the downloaded ISO file Method may require phone Activation.\"How to Activate Windows 7 by Phone\"http:\/\/www.sevenforums.com\/tutorials\/18715-activate-windows-7-phone.htmlThe above method also will require you to go to your Computer Manufacturer's website > Support and Downloads Section > locate your Model Number and Operating System > then download and install the latest Drivers for it. ________________________________________________Using the USB method in conjunction with the above Windows 7 download:http:\/\/www.sevenforums.com\/tutorials\/2432-usb-windows-7-installation-key-drive-create.html\"How to Get and Use the Windows 7 USB\/DVD Download Tool\"http:\/\/www.sevenforums.com\/tutorials\/31541-windows-7-usb-dvd-download-tool.html________________________________________________And this is very good and easy to use:Rufus - Create bootable USB drives the easy wayCheers.","This is how you check for hardware\/software compatibility for any device upgrading to 10.Here is the link for your device:https:\/\/pcsupport.lenovo.com\/au\/en\/products\/laptops-and-netbooks\/ideapad-z-series-laptops\/ideapad-z570\/downloads\/driver-listLenovo supports and supplies drivers for XP > 8 for your Model Number, but not 10.You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you're looking for information for home users, see Windows 7 support will end on January 14, 2020.With end of support Microsoft is not telling you that your operating systems won't work.What they are saying is that after a certain date they will no longer support them.Whether they still work or not with particular programs is up to the particular program manufacturers.Example: Google Chrome is no longer supported for security updates in XP or Vista by Google and Mozilla Firefox is following the same path.What this basically means with Microsoft no longer supporting an operating system is that even though hackers may find \"holes\" and vulnerabilities to be able to access the operating systems and cause security problems, Microsoft will no longer be monitoring or rectifying those problems by way of Security Updates each month.You are on your own in regards to maintaining the Security of your operating systems.What does it mean if Windows isn't supported?____________________________________________________This will show you when support (Mainstream and Extended Support) for the various operating systems ends.Windows lifecycle fact sheet - Windows Help - Microsoft SupportAnd these FAQs show you how Microsoft arrived at the Support Lifecycle Policy:Microsoft Lifecycle Policy FAQhttps:\/\/support.microsoft.com\/en-au\/help\/17140\/lifecycle-faq-general-policy-questions@@@@@@@@@@@@@@@@@@@@@@@"]},{"symptom":"Windows 10 bugcheck error        Hi,I have been getting a lot of errors in my event viewer and recently got this bugcheck after my pc crashed.The computer has rebooted from a bugcheck.  The bugcheck was: 0x00000116 (0xffffcf02675c9010, 0xfffff8043ec5ac10, 0xffffffffc000009a, 0x0000000000000004). A dump was saved in: C:\\WINDOWS\\MEMORY.DMP. Report Id: 1581ea69-4416-48b0-b70c-d31287733d4e.can you help me with this please.Bluesman","solutions":["Hello Bluesman Please check to see if your system has produced any minidump files, that we can analyze for you:Open Windows File Explorer Navigate to C:\\Windows\\Minidump Copy any minidump files onto your Desktop, then zip those up Upload the zip file to the Cloud (OneDrive, DropBox . . . etc.), then choose to share those and get a share linkThen post the link here to the zip file, so we can take a look for you . . .","Hi Dave,thanks for your reply. here is the link to my minidumpshttps:\/\/1drv.ms\/u\/s!Av3of8MRomN8gya7dPTkL15ma2m4?e=I0NipyIf any problems please let me know.Bluesman","Hi bluesman, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.The crash dumps had a variety of causes, ranging from Memory corruption to Video driver failure. Verifier was also enabled in the Windows, which was ran incorrectly.Have you disabled verifier? I suggest you to Run memory test for at least 8 passes, preferably Overnight. https:\/\/www.tenforums.com\/tutorials\/14201-memte...When the test completes post back the Image(You can use your phone's camera). Disclaimer: There are links to non-Microsoft websites which would provide accurate and safe information. Watch out for ads on the sites which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","Hi Sumit,I did the memtest but forgot to take an image. I did 8 passes on both modules. Four passes on Module 1 in slot#2 and four passes in slot #4.Then did the same for Module 2. All tests came up with zero errors. I have also disabled the verifier. Where do we go from here?Bluesman","Hi, I would wait until the next crash. If it happens again share the dump files. Though I recommend doing 8 passes for both modules."]},{"symptom":"how to reinstall windows 10 from recovery drive without losing personal files???        I created a recovery drive for my windows 10 PC.Now my PC not works well. So I wish to reinstall windows from the recovery drive I created. I need all my personal files. Also I need to reinstall windows. Please guide me in correct way what should I do????? Please give a brief explanation..... ","solutions":["it might be worth trying to recover first rather than fully re-install. there is a good guide on how to do this on the link bellow.https:\/\/support.microsoft.com\/en-gb\/help\/12415\/..."]},{"symptom":"Windows 10 1903 Nightlight Not Working        I have a clean install of windows 10 1903 build 18362.175 and the night light only works after restarting my laptop but when closing it then opening it again it doesn't work.Help me please!","solutions":["HI Ahmed. I'm Greg, an installation specialist and 9 year Windows MVP here to help you.See working fixes for nightlight here: http:\/\/m.majorgeeks.com\/content\/page\/how_to_fix...https:\/\/www.thewindowsclub.com\/windows-10-night...https:\/\/www.tenforums.com\/general-support\/12523...Update the Display driver from the PC or Display adapter maker's Support Downloads web page for your exact model number, HP Serial Number or Dell Service Tag - from the sticker on the PC.While there check also for newer chipset, BIOS\/UEFI firmware (very important), network, sound, USB3 and other drivers, comparing to the ones presently installed in Device Manager reached by right clicking the Start Menu.if this doesn't give you the latest or ideal driver for what you need, compare it to the driver offered by the Intel driver update Utility here:http:\/\/www.intel.com\/content\/www\/us\/en\/support\/... or the Nvidia Update utility here: http:\/\/www.nvidia.com\/Download\/Scan.aspx?lang=e... or the AMD autodect utility here: http:\/\/support.amd.com\/us\/gpudownload\/windows\/P... For Display issues one fix that is working is to Roll back or Uninstall the Driver on the Display Device > Driver tab, restart PC to reinstall driver.You can also try older drivers in Device Manager > Display device > Driver tab > Update Driver > Browse > Let Me Pick.Then you will know you've tried everything in addition to Windows Update drivers.I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Ahmed, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Nightlight continues to have issues with 1903. Gamma ramps, color profiles, and night light settings do not apply in some cases Microsoft has identified some scenarios where gamma ramps, color profiles and night light settings may stop working.https:\/\/docs.microsoft.com\/en-us\/windows\/releas...Would advise you to wait until this fixes.","Hi, thanks for your reply...I have the latest display driver for both the Intel and Nvidia GPUs but still have the problem when turning off my laptop. and only works when I restart my laptop then it doesn't work again when turning it off and open it again and so on","Hi...I have the latest display driver for both the Intel and Nvidia GPUs but still have the problem when turning off my laptop. and only works when I restart my laptop then it doesn't work again when turning it off and open it again and so on. will this issue be solved in this current version (1903)?","Yes, it would be. Please wait until the next cumulative update which usually releases twice a month.","Thanks.I have another issue which is:I can't find the \"use friendly date\" feature in the file explorer. I can't even enable it as the option to enable it doesn't exist!can you help me with that please?","Hi Ahmed, Friendly dates feature isn't available with 19H1 aka 1903. https:\/\/t.co\/kY8AJ5ZThF Thank you for all of the feedback you provided on Friendly Dates in File Explorer. At this time, we’ve decided not to roll out Friendly Dates to users as part of the 19H1 release. Insiders will see this option go away starting today, regardless of build number.","Ahmed- Did you try all of the steps to fix night light in my post above. These work for almost everyone else.If so then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1903 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m....","Hello!Thanks a lot for your help...yes, I did try all of the steps to fix night light in my post above.I am gonna try your second solution now...I have found that the problem is solved when I restart my laptop, sign out and also when I turn off \"turn on fast startup (recommended)\". hope this information helps you to find a proper solution for my issue.","Thanks for updating that problem is solved by turning off Fast Startup. If necessary you can leave it turned off, as others have done who found that it causes issues by forcing a Hybrid Hibernate on the system in order to get a faster startup like Hiberate does. Do you notice it slows startup that much? You can mostly use Hibernate if so."]},{"symptom":"Windows stuck on welcome screen after update from 1803        Hi,I've managed to update windows from version 1803 to 1903. However, after I enter my password to log in to my account, the screen blurs and the little wheel appears but nothing else. I cant get back into windows and have tried everything that I could find on the Windows update page. The only thing that I can do to at least continue working is to uninstall the update.Thanks in advance","solutions":["Hi manher7 Start your PC, just as Windows attempts to load (spinning dots), press and hold Power Button for 5 - 10 seconds to perform a Hard Shut DownDo this twice On the third start Windows will boot into the Recovery Environment and from there you can access System Repair, Safe Mode, Command Prompt . . . etc.Please try each option one at a time, then see of Windows will boot . . . If the option is available to roll back that update or uninstall that update, this would be the best option . . .Go to Troubleshoot - Advanced Option - Startup Repair See if Windows startup can repair itself Go to Troubleshoot - Advanced Option - System Restore Check to see if you have a restore point you can go back to","Thanks for your reply.I've tried all of these options several times already. None of them work. I can only uninstall the feature update which gets Windows working again but means that I remain on the 1803 unsupported version.I'm reluctant to do a clean install since I'll have to re-install apps.Its surprising that there's no-one else who's experienced the same issue.Would love to hear from you if there is someone who's gone through the same pains.Thanks","Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.I suggest you to Uninstall the last feature update and use the following tool to upgrade to the latest version 1909.https:\/\/www.microsoft.com\/en-in\/software-downlo..."]},{"symptom":"Windows 10 pro activation        So I change my hardware but I still need to get a hdd\/gpu will that deactivate windows 10 pro again if I get a key? ","solutions":["Hi, If Windows detect a hardware change, in most cases the motherboard. Windows will show as not activated, the license still exists on your account it's just tied to your old hardware. You can run the troubleshooter from the activation page after you're setup again and go through the \"I changed hardware on this device recently\" process to move your license to your new hardware. To find this go to Start button, then select Settings > Update & Security > Activation > Troubleshoot .I hope that helps.","it didnt help its just says  Unable to activate WindowsWe can't reactivate Windows as our servers aren't available right now. Wait for a few minutes or try adding your Microsoft account again.Learn more","Hi,The next step is to contact Microsoft and ask for help. https:\/\/support.microsoft.com\/contactus\/In the virtual agent, type talk to an agent and choose Activation."]},{"symptom":"Taskbar Calendar only showing certain events        I have recently synced Windows 10's calendar wit my Google Drive. On my old computer I was a frequent user of the task bar calendar. After syncing it on this device I have found that only events from certain folders on my google drive sync to the task bar calendar. I do not have this issue with the calendar app, everything syncs perfectly to the full Windows Calendar app, it is just the task bar calendar.What setting have I neglected to activate that can fix this?","solutions":["I found a solution. Just simply go to Settings>Apps>Apps & features>Mail and Calendar>Advanced options>Reset.After that just sign in only with your Google account. After synced with Google account, the calendar at taskbar will show all the events in agenda which available in Calendar Apps. It worked for me, hope it will work for you guys too.","Had the same problem, tried to reset mail and calendar, remove and re-add my account, but nothing worked. Some events synced, others didn't, past events didn't show up at all. Then I uninstalled the mail and calendar app and reinstalled it from the Microsoft store and now it seems to be working fine. "]},{"symptom":"Windows 10 S version not installing Windows Defender\/Security updates        HI, I recently just bought a HP stream laptop (14\") loaded with Microsoft Office 365 (activated), and Windows 10 (S mode) I checked for updates, and there were many updates that had to be installed.  I installed them, and when I check for updates again, it said that there were problems installing some updates, and askes me if I want to retry. I click retry, many times, and it says the same thing, (there was a problem installing some updates) Could someone help me?? I am wondering how to get the updates going again. P.S: (It only seems to be not working for Windows Security updates)Thank you so much, Samsung1279","solutions":["- \"Win10-S mode is not supported, there is no added value of running MSRT on this platform. Any install failures of attempting to install the package can be safely ignored.\"Source: https:\/\/support.microsoft.com\/en-us\/help\/890830\/remove-specific-prevalent-malware-with-windows-malicious-software-remo"]},{"symptom":"Switching out of S mode on Samsung Galaxy Book 2 (Snapdragon)        Hello, I have a Samsung Galaxy Book 2 running Windows 10 pro in S mode. I've been doing some research and read quite a few things about switching this particular device out of S mode isn't a good idea. However, I find it very frustrating that I can not install anything outside of the Microsoft Store. So my question, as broad as it may be, is this safe to switch out S mode? I'm looking for a specific answer and not one that will just lead me right back to Bing. If I switch will there be ANY problems whatsoever down the road? Or is there a way to install an app or such outside of the store while still in S mode?Thanks, Cristara Dannninger","solutions":["Hi Cristara Rest assured, there will be no problems caused by switching out of S Mode, there is a lot of mis-information on the Internet . . . most users do switch out of S Mode, because they need to install 3rd party software on their systems . . .S Mode basically only locks your system out of being able to install Windows executable files and only allows UWP apps form the Microsoft Store to be installed.If you are a careful user and you only install legitimate software from genuine sources, you have absolutely nothing to worry about and can switch out of S Mode in total confidence that there will be no problems down the road . . .","Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.I see that you have reported the previous experts question as not having resolved your issue, is there anything further about S mode that you wish to ask?Regards, Ross","Hi, Just one answer from one person doesn't convince me. Samsung even advised me against switching out of S mode. In fact, I'll be completely honest and inform you that I did make the switch and did in fact have some unforeseen complications. For starters my security settings are changed. Virus and threat protection are turned off and Microsoft store is no where to be found. I could not install anything at all from anywhere at all(Windows would not update even with the update tool) There was no boot option besides whatever was corrupted and I couldn't even boot from an usb or iso. And lastly, there was no recovery or reset to be done because it simply couldn't. Not even command prompt. All of this before the screen completely stopped responding and I had to use narrator to work with until that too went kaput. All of this after switching out of S mode. Don't worry though, I used up the warranty and received a basically brand new device that I am terrified to switch out of S mode. Please convince me that it was a separate issue and had nothing to do with Windows. Thanks,Cristara Danninger","Hi, It certainly seems unusual that you would have those issues, as switching out of S mode is usually a painless procedure and simply allows additional 'desktop' style apps to be run, and allows additional features such as command prompt to be used.To be honest I believe the issue is the type of processor in your tablet, because it is an ARM processor it will be unable to run certain desktop apps anyway.It would simply come down to personal need, if you have an application that is unavailable in S mode then I would switch out, if not then there is no reason to as it does provide additional protections.Regards, Ross"]},{"symptom":"Tablet doesn't want to lock into one monitor        I've had this problem for a while now and I can't seem to find anything that helps. I recently got a new PC that supports multiple monitors and I got this problem where my tablet doesn't lock into one monitor on certain programs (Adobe Animate and SAI) which makes it really hard to draw. I tried reinstalling both the video drivers and tablet driver but it didn't seem to help. I also tried reinstalling the programs. I checked the tablet properties and they are locked into one monitor. I use a Wacom Intuos Pen & Touch Small.","solutions":["Hi, there is a great forum post on this bellow. Follow that through and see if it helps. I have known the application remembering thing to have a mind of its own sometimeshttps:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"Paint 3D text issues        Why is paint 3d keeps cutting off the tex? I see this is been going on since 2015 and it is still not fixed.","solutions":["Hi,Thank you for writing to Microsoft Community Forums.We understand your concern as the text is cutting off in Paint 3D app.In order to get clarity and to assist you accordingly, please reply with the answers to the questions below.What is the Windows 10 version and Build installed? (Type winver in Windows search\/Run command)What is the Paint 3D app version currently installed on the PC?What is the file type that you have selected to save the 3D model?Where are you inserting the Text and on which app are viewing the model?Please provide us a screenshot of the issue for further investigation.Follow the steps mentioned in the screenshot posted by Shawn 'Cmdr' Keene on Oct 2, 2015 to post the screenshots.) Do not share any personal information in the screenshots.Meanwhile, we would like you to reset the Paint 3D app and check if you have the same issue.Press Windows + I key to launch Windows settings.Click on Apps and select Apps & feature from the left pane.Scroll down and select Paint 3D app on the right pane.Click on Advanced option and then click on Reset.Restart the PC and then launch the Paint 3D app.We await your response.Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"Computer Inaccessible On Home Network        All computers on my small home network are Windows 10 and connected through my router by ethernet cables.  Files on all but one can be accessed from the others.  That one can access files on the others but its files cannot be accessed.  The regular error message the other computers get  is \"Windows cannot access \\\\[computer].  You do not have permission....\"All the sharing options for a private network are on in the advanced sharing settings of the inaccessible computer and password protection is off.  Its internet connection is fine. All the folders I want the computer to share are set to share with everyone, with maximum control both in their sharing and security properties.  SMB 1.0\/CIFS Client and Server are both checked in Windows features, but Automatic Removal is unchecked - the same as the other network computers.I have tried everything I could find online, including checking the services settings and turning off antivirus and firewall temporarily, but nothing has worked.  I would appreciate any additional recommendations to deal with this problem.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I appreciate the efforts taken by you in resolving the issue. I understand that you receive an error, ‘Windows cannot access \\\\[computer]. You do not have permission’ when trying to access files on the network. I’ll certainly help you with this. We would like to know the build version of Windows installed on the computer. To check type:winver in the search bar on the Taskbar and hitEnter. We would also like to know if you are able to access the computer using the IP address. Follow the steps mentioned below: Press Windows key + R, to open Run dialog box.Type \\\\IPAddress (ex: 192.168.x.x) and check if you are able to access the drive. I would suggest you to try enabling NetBios on the computers and check. Refer the steps mentioned below: Press Windows Logo key + R, to open theRun dialog box.Type ncpa.cpl and click on OK.Right click on the network connection that you are using and selectProperties.Double click on Internet Protocol Version 4 (TCP\/IPv4).Under General tab, click on Advanced.Click on WINS tab.Select Enable NetBIOS over TCP\/IP.Click on OK on all the windows. Also, try restarting the Function Discovery Provider Host service on all the machines. For more information, refer the suggestions provided by Roohi_Taj replied on November 28, 2018 in the threadYou do not have permission to access \\\\PC_NAME contact your network administrator to request access. Let us know the results. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Monitors disabled in device manager        Hi, I have a tri-display setup with a Nvidia GTX 1050 Ti. Whenever Windows 10 goes to sleep and then turns back on, all 3 monitor profiles are disabled. Bit of a pain, because one of the monitor's gamma keeps getting reset.Anyway to stop it from disabling my monitors? or at least re-enabled when it comes out of sleep and restore the gamma settings automatically?I have Nvidia desktop app running so I assume the drivers are uptodate...Here's a screenshot after I manually enabled the monitors again.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. For better clarity, please let us know: When you say, “Whenever Windows 10 goes to sleep and then turns back on, all 3 monitor profiles are disabled” do you mean monitors doesn’t wake up from sleep?Are you aware of any changes made to the computer prior to this issue?Which build version of Windows 10 is installed on the computer? To check type:winver in the search bar on the Taskbar and hitEnter. What is the make and model of the computer? I suggest you to check if there are any greyed out Monitors in Device Manager. To check refer the steps mentioned below: Press Windows Logo key + X, and selectDevice Manager.Click on View and select Show hidden devices. Expand Monitors and see if there are any greyed out devices.If you find any greyed out devices, right click on the device and selectUninstall device.   You can also try selecting the Automatic Driver Updates option from https:\/\/www.geforce.com\/drivers, this will automatically detect the drivers and download them. You may also want to refer the Dell articles on How to Troubleshoot Multiple Monitor Issues andHow to Run Diagnostic Test on a Dell Monitor. For additional information, see How to Setup Multiple Monitors in Microsoft Windows 10. Alternatively, you can visit the computer manufacturer’s website and check if there is any BIOS update available. However, we recommend that you check with your motherboard manufacturer regarding BIOS update. Note: Modifying BIOS\/ complementary metal oxide semiconductor (CMOS) settings incorrectly can cause serious problems that may prevent your computer from booting properly. Microsoft cannot guarantee that any problems resulting from the configuring of BIOS\/CMOS settings can be solved. Modifications of the settings are at your own risk. Let us know how it goes. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"In Windows 10, device connect\/disconnect sound plays over and over when monitor powers down (sleep)        device connect\/disconnect sound plays over and over when monitor powers down (sleep)This does not seem right.  Has every version of widows done this and I just never caught it?* Moved from Insider","solutions":["Hi,Thank you for contacting Microsoft Community. 1. What is the make and Model of your computer? 2. Were you able to install Windows TP successfully on the computer? 3. Did you try installing all the latest drivers from the computer manufacturer's website? This issue you are facing might be due to Sound settings on your computer. So I would suggest you to follow below steps to make changes in Sound Settings. Right Click on Desktop screen and choose Personalize.From the bottom panel click on Sounds.Under Program Events, look for Device Connect, Disconnect and Failed to Connect.Choose one option at a time and from the sounds option choose none. This process will disable sounds for the 3 program events and sound will not play if you are in normal state or sleep mode. Hope this information is helpful. Please do let us know if you need further assistance with Windows, we’ll be glad to assist you.","Windows 10 makes the hardware disconnect sound consistently and constantly since install. I would like to know what is causing the error, rather than just turning the sound off. My issue isn't when the monitor goes to sleep, it's all the time. Is there a hardware disconnect log I can read??-Krum","I'm experiencing the same issue... random 'device connect' and 'device disconnect' sounds since i've updated to Windows 10. Sometimes minutes apart, but it never stops.The event viewer under administrative tools doesn't show anything, but the trigger must be coming from somewhere. Same question as Krumrein: is there a connect\/disconnect log we could check?Update:I have 'fixed' the issue by disabling the USB selective suspend setting! Haven't heard any device connect\/disconnect sounds in a while.DIsplay Settings > Power & sleep > Additional power settings > Change plan settings > Change advanced power settingsThen under 'USB settings', under \"USB selective suspend setting' set it to 'Disabled'.","I tried that, but unfortunately still hearing random sounds.  Can be a few minutes apart or an hour apart. Is there anywhere I can look to see what is being disconnected?","Ah yeah it turns out that helped, but didn't completely solve the issue. I have used  a 3rd party tool to detect any usb (dis)connect events and found it was a usb 3 hub that was causing the issue. It works fine, except for the apparent connection hiccup.","Ah yeah it turns out that helped, but didn't completely solve the issue. I have used  a 3rd party tool to detect any usb (dis)connect events and found it was a usb 3 hub that was causing the issue. It works fine, except for the apparent connection hiccup. Could you share which 3rd party program you used to detect?","Had to look it up, it's USBDeview by Nirsoft:http:\/\/www.nirsoft.net\/utils\/usb_devices_view.html","Thanks. No usb events showing up. My issue isn't usb related then. Just monitor disconnecting for whatever reason when sleeping. All windows resized upon waking ","Very frustrating: I went to Control Panel (right mouse click on Microsoft icon - lower left) select Programs and Features. Choose Hardware and Sound, under Sound choose   Change System Sounds,   Choose Playback - then try selecting one of the others.  Restart your machine.Hope this works for you.Ez","Windows 10 makes the hardware disconnect sound consistently and constantly since upgraded to 10 I have a way to stop the sound, but not the cause however, if you don't want to hear that sound anymore this will satisfy completely.  Hi,I found a solution after weeks of hearing random device disconnect sounds, ever since i upgraded to Windows 10 .  Can be a few minutes apart or an hour apart. follow these steps below and you will not hear that pesky sound again.1, right click the sound icon on the bottom right of the desktop screen ( near the date and time ) 2, choose sounds, when the sound box opens scroll down to you see \" device disconnect \" click on it once to highlight it.3, now the bottom left you will see a box with the sound name \" windows hardware remove \", now click the arrow on of this box. scroll up to the top where you see ( NONE ) at the top of the list click on apply, now notice the speaker icon symbol is now missing for the \" device disconnect \" meaning no sound chosen.4. close the sounds box and enjoy not hearing that sound ever again, that is unless you reverse the process if you're really missing that sound. "]},{"symptom":"Extended screen double desktop icons        I have extended screens with icons on each screen (some of the folder and shortcuts is doubles like Chrome and My PC).When I'm unplugged the second screen all his icons moves to the laptop screen.My question is if there is any way to save desktop for one screen and a desktops only when I have extended screens?Thanks ","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.There isn't a builtin tool to do this but other users have reported that there are third party tools available to do this, please see this thread for details:https:\/\/social.technet.microsoft.com\/Forums\/win...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Blank screen when printing online.        Good day World.When browsing on chrome, i come across pages where I want to print and a dialogue box comes up blank. Please advise what causes this and how to fix it.Regards","solutions":["Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.To better assist you, can you provide further info regarding the issue? 1. Are you able to print properly offline when printing documents? 2. Do you encounter the problem on Chrome only or on all browsers? Please let me know so I can come up with steps for you to check.","1. yes i am able to print properly offline when printing documents. 2.yes only on Chrome only.","Hi, If you're experiencing this only on Chrome, this means that the problem is occurring solely on your browser. What you could do is try to reset or reinstall Chrome and see if this fix the issue. If your history and passwords are synced in your account, this could be restored when you reinstall the program. Here's how to sync your account:https:\/\/support.google.com\/chrome\/answer\/185277...Regards, Paulo M.","thanks will try this out.","You're very welcome. Cheers"]},{"symptom":"Connecting Blue tooth JBL Headphones        Trying to connect JBL 650BT headphone sto Windows 10. it asks \" press connect if the pincode is &^%$\" where do I find this pin code to check? Cheers","solutions":["Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.You could try the default pin 0000, 1111 or 1234. If you're unable to connect your bluetooth, here's a complete guide on how to connect your device in Windows 10.https:\/\/www.youtube.com\/watch?v=3jZM9qPvE6YI hope this helps with your concern! Please let me know if you have further questions.","Great, but Microsoft gives ME the pin and asks if it matches….. I don't have an option to enter a pin. Thank you though","Hi, You could try pairing the device in Devices and Printers instead. Just click on Add a device, select the device then click on next then just follow further steps.I hope this helps."]},{"symptom":"windows 8.1 backround blur        hi when i set a backround that tiles it the backround is very blurry and it looks like thisinstead of thisbut tiled and i think the cause is because windows jpegs the picture to compress it and make it look worse and i have all the drivers and reinstalled windows and if theres anyway to just have the picture not compressed and the first picture is a snip of it if anyone know tell me please thank you byewhen i write this i was very tired if it doesnt make sense","solutions":[]},{"symptom":"problem with display driver        my spec areintel core i5 3rd generationram: 4 gbintel hd 3000amd radeon 7400m seriesSo , I have 2 graphics . But amd was causing problem like blue screen . so I don't wanted to use it and uninstalled it . But now I am facing low resolution because my display driver is stuck into microsoft basic adapter . Even the intel control center is gone . I am trying to install it everytime but no solution.Can anyone help me? here is a screen shot,","solutions":["Hi tusharshahriar The Intel HD 3000 series of graphics is no longer supported on the last three versions of Windows 10, you will not be able to find a driver for versions 1809, 1903 or 1909 of Windows 10 . ..You may need to install an older and no longer supported version of Windows 10 to get that graphics option working . . .Click your Start Button, type winver and hit Enter On the resulting dialog, what Version No. and build No. of Windows 10 are you running?","windows 10 1909the intelhd 3000 worked before but the problem started after my laptop automatically intalled the amd driver .","Hi tusharshahriar Windows updates would have made that Intel HD driver non-compatible, since you are on version 1909 and the reason the AMD device was causing Blue Screens is that it is also in Legacy Status according to AMDhttps:\/\/community.amd.com\/thread\/207861Your only option would be to backup your data and clean install an older version (1703 or 1709) of Windows 10 and then both your graphics options should work again . . .________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","the amd driver did not work on the older version either. I think it's a dead gpu . But thanks for your advise.I have solved my problem after many hard work and sacrifices."]}]}