{"windows":[{"symptom":"Can't move files to recycle bin, can ONLY permanently delete.        I am running Microsoft 2010 on a company-owned device. We have a shared drive and when I delete a file from the shared the drive (e.g. right click \"delete\" OR drag files to Recycle Bin folder) it deletes the file permanently. I would like the files to go to the Recycle Bin, but cannot figure out how to do that. [And yes, I have already checked to make sure that the \"do not move files to the recycle bin\" box is NOT checked in Recycle Bin Properties].Is there a setting I can change?I am suspecting that it is something that may need to be changed by an administrator through our IT department, but I've best luck with our IT department if I am able to give a really detailed explanation of the problem and potential solutions. (Not to mention, the IT department is understaffed and there are long wait times for addressing issues, so if I can fix the problem myself--BONUS).Any help is greatly appreciated.","solutions":["Hi Care This is well documented, and by design, see the link below, scroll down to see the answer from nhelder (begins with: \"Not entirely true\") for a possible workaround that could be implemented by your IT teamhttps:\/\/social.technet.microsoft.com\/Forums\/Lyn..."]},{"symptom":"Windows 7 Pro Extended Security Updates        I am using Windows 7 Pro on a single computer for my home-based sole proprietor writing and editing business.Can I purchase the Windows 7 Pro Extended Security Updates for my system?  If I can, how do I purchase this service?--Bill","solutions":["I am using Windows 7 Pro on a single computer for my home-based sole proprietor writing and editing business.Can I purchase the Windows 7 Pro Extended Security Updates for my system?  If I can, how do I purchase this service?--BillNo, you can't purchase them.There seems to be some confusion about this, so this is from Microsoft  Last Updated: 26th Nov 2019.Home users are excluded from this offerN.B. Volume Licensedhttps:\/\/support.microsoft.com\/en-au\/help\/4497181\/lifecycle-faq-extended-security-updatesHow can I purchase ESUs?Extended Security Updates are available through specific volume licensing programs. Contact your Microsoft partner or account team to learn more. ESUs for select Embedded products are available via your embedded device manufacturer.Coverage will be available in three consecutive 12-month increments following End of Support. Customers cannot buy partial periods (e.g., only 6 months). Extended Security Updates are transacted per year (12-month period), commencing with the End of Support date.Eligible customers can use the Azure Hybrid Benefit (available to customers with active Software Assurance or Server Subscriptions) to obtain discounts on the license of Azure Virtual Machines (IaaS) or Azure SQL Database Managed Instance (PaaS).___________________________________________________FAQ about Extended Security Updates for Windows 7: Last Updated: 24 Dec 2019 https:\/\/support.microsoft.com\/en-gb\/help\/4527878\/faq-about-extended-security-updates-for-windows-7This article is intended for use by IT professionals. If you're looking for information for home users, seeWindows 7 support will end on January 14, 2020.__________________________________________________Now we also have this at October 9, 2019, 6:40am EDT :https:\/\/www.howtogeek.com\/443573\/how-windows-7s-extended-security-updates-will-work\/The average Windows 7 user can’t buy these updates, however. They’re only available to businesses and other organizations.Some good news: Instead of just being available to large companies with volume licensing agreements, Windows 7 Extended Security Updates (ESUs) will be available to businesses of any size—even small or mid-size companies.Microsoft won’t sell you these updates directly, and they’re not available through normal retail channels. According toMary Jo Foley, Microsoft officials said these ESUs must be purchased “from qualified Cloud Solution Provider partners.” AMicrosoft blog post about Windows 7 support invites interested parties to “Please reach out to your partner or Microsoft account team for further details.”Cheers.","Thanks, Bill.  I appreciate your help.  Seems like I'm stuck between a rock and a hard place.  My Windows 7 Pro system has been working perfectly with no problems.  My Win 7 Pro system and existing software do everything I need to do.Now, thanks to Microsoft, I'm being faced with having to purchase a new computer, a new printer, and almost all new software--plus having a major learning curve for all this stuff.I'm really, really unhappy with Microsoft. But, thanks again for your help and for your quick response!Best wishes.--Bill","Your Windows 7 system will not disappear in a puff of smoke next week.  I suspect there will be quite a large number of users who will stick with Windows 7 for some time after January 14, 2020.  See, for example:https:\/\/www.askwoody.com\/forums\/topic\/keep-running-windows-7-safely-for-years-to-come\/https:\/\/www.askwoody.com\/forums\/topic\/windows-update-for-windows-7-after-1-2020\/https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/forced-from-windows-7-to-windows-10\/d1abb03a-c70a-4755-b5fa-8ec705639d09","Thanks for your help LemP!   I have some of the security programs mentioned in the first post you mentioned.  I run a system security check on a daily basis.And the post that mentioned the $2,000 laptop that would have to be scrapped struck a nerve.  I estimate that Microsoft's decision to end support for my Win 7 Pro system means that I will have to spend close to $2,000 or more on software and on a new desktop system, plus a new printer, etc.Very nice for Microsoft and the hardware vendors; not so nice for me.Thanks again!--Bill","Thanks, Bill.  I appreciate your help.  Seems like I'm stuck between a rock and a hard place.  My Windows 7 Pro system has been working perfectly with no problems.  My Win 7 Pro system and existing software do everything I need to do.Now, thanks to Microsoft, I'm being faced with having to purchase a new computer, a new printer, and almost all new software--plus having a major learning curve for all this stuff.I'm really, really unhappy with Microsoft. But, thanks again for your help and for your quick response!Best wishes.--BillYou are welcome.If you're looking for information for home users, see Windows 7 support will end on January 14, 2020.With end of support Microsoft is not telling you that your operating systems won't work.What they are saying is that after a certain date they will no longer support them.Whether they still work or not with particular programs is up to the particular program manufacturers.Example: Google Chrome is no longer supported for security updates in XP or Vista by Google and Mozilla Firefox is following the same path.What this basically means with Microsoft no longer supporting an operating system is that even though hackers may find \"holes\" and vulnerabilities to be able to access the operating systems and cause security problems, Microsoft will no longer be monitoring or rectifying those problems by way of Security Updates each month.You are on your own in regards to maintaining the Security of your operating systems.What does it mean if Windows isn't supported?____________________________________________________This will show you when support (Mainstream and Extended Support) for the various operating systems ends.Windows lifecycle fact sheet - Windows Help - Microsoft SupportAnd these FAQs show you how Microsoft arrived at the Support Lifecycle Policy:Microsoft Lifecycle Policy FAQhttps:\/\/support.microsoft.com\/en-au\/help\/17140\/lifecycle-faq-general-policy-questions@@@@@@@@@@@@@@@@@@@@@@@","Thanks again, Bill.  What really bother me is that Microsoft could very easily offer Extended Security Updates to individual Win 7 Pro users like myself who would be willing to pay for the service, but they won't do it.I had to buy a new computer and software when Microsoft stopped supporting Windows XP years ago and now they are doing it again.  Other computer users have said Microsoft is deliberately \"churning the market\" simply in order to enhance profits.--Bill ","You and others will have to take that up with Microsoft.We don't work for Microsoft or have anything to do with their Tech Support.We are computer users that come here to help each other.Cheers.","I understand, Bill.  Thanks again for your help.I've been using Microsoft products since the DOS days and started with a computer that used floppy disks and had only a 30 meg hard disk.   In my opinion, however, Microsoft is not a user-friendly company and is looking for ways to scrape as much money as possible out of its customers.  Calling MS tech support is an example.  If you can figure out how to contact them, be prepared to \"sign up\" and spend $$$ to get answers to even simple questions.Hardware manufacturers and software providers have gone the same route.  Tweak the software every so often and then stop supporting the old version so the customer has to buy a new version.  I have an HP desktop.  I tried contacting their tech support to find out whether or not my computer would work with Windows 10 Pro.  They wanted $75 to give me an answer.  Not user-friendly companies.When I die, I'm going to have my heirs send a letter to Microsoft saying \"Ha, ha.  I'm dead.  You can't get any more money out of me!\"Sorry, for the complaints.  Just venting.  Thanks again.  Best wishes.--Bill","I understand, Bill.  Thanks again for your help.I've been using Microsoft products since the DOS days and started with a computer that used floppy disks and had only a 30 meg hard disk.   In my opinion, however, Microsoft is not a user-friendly company and is looking for ways to scrape as much money as possible out of its customers.  Calling MS tech support is an example.  If you can figure out how to contact them, be prepared to \"sign up\" and spend $$$ to get answers to even simple questions.Hardware manufacturers and software providers have gone the same route.  Tweak the software every so often and then stop supporting the old version so the customer has to buy a new version.  I have an HP desktop.  I tried contacting their tech support to find out whether or not my computer would work with Windows 10 Pro.  They wanted $75 to give me an answer.  Not user-friendly companies.When I die, I'm going to have my heirs send a letter to Microsoft saying \"Ha, ha.  I'm dead.  You can't get any more money out of me!\"Sorry, for the complaints.  Just venting.  Thanks again.  Best wishes.--BillA lot of the information you want is freely available on the Net, including from HP.For upgrading from 7 > 10First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.https:\/\/support.hp.com\/au-en\/drivers\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:HP Products Tested with Windows 10@@@@@@@@@@@@@@@@@@@@@@Cheers.","Thanks again for your help, Bill!  You've given me a lot of useful information.  Best wishes.--Bill"]},{"symptom":"AMD update STILL appearing for Intel Processors !!!        Today I've finally been updating my version of Windows 10 1703 on my laptop, since its NIC is no longer supported and I had to get a dongle.  During the process, however, I noticed an update meant for AMD processors, even though my system uses one from Intel (I also have an nvidia GPU).Consequently, this update has now bricked the system, because all updates are automatic and so users cannot choose what to and to not install.  WHY is this update still in circulation?!","solutions":[]},{"symptom":"How to increase the print size, icons, etc. on my computer screen        All of a sudden everything on my computer became very small I have tried everything to enlarge the print, but to no avail.  Please help!","solutions":["Hello DorothyHine, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemdo you mean only the font or the Icons as well? If everything including the Icons went small, then type in start menu \"make everything bigger\" and press enterIt will open a window which has Display settings, and you can find there a scale, usually it is 100% or 125% ans states Recommendedif not, change it back to the recommended settings and restart your PC. it should be better afterwardsFeel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolvedCheers! Farah","Right click the desktop, click Display settings, in Scale and Layout check Display resolution."]},{"symptom":"Laptop has become extremely slow after factory reset        Evening, I'm havibg an issue with my Hp laptop, it has become really slow after I factory reset it. There was no issue with the laptop prior to the reset and it was quick, now after the reset it takes around 4\/5 second to open startup, and cannot run multiple windows at once it either becomes really slow or one of the wibdow crashes. I do not remember exactly but I think that when I opened it after reset I was asked to update the software but I am not sure.  What shall I do tp fix this issue? ","solutions":["After reset or fresh install of Windows, it will un some tasks and checking and install updates.You will need to connect to internet and let it download and install all updates and you will need to restart your PC.Once all updates has been installed and system perform all maintenance tasks , the system speed should back to normal.","Hi Guest626 Open Device Manager (accessible by right clicking your Start Button) Are any of the devices there showing exclamation marks beside them? If so, you should go to the support page for your PC on the manufacturers website, then from there, download and install a full set of device drivers . . .If there are no devices with exclamation marks or if installing drivers does not resolve this, then honestly, your best option would be to clean install Windows 10 to get back to a responsive and reliable system . . .You can reinstall Windows 10 at any time and it will not cost you anything ! Since you previously had Windows 10 installed and activated on that PC during the installation process skip the steps which ask for a product key and select the option 'I am Reinstalling Windows 10 on this PC', and activation will not be an issue, your PC will have a digital entitlement stored on the Microsoft Activation Servers Make sure you install the same Edition of Windows 10 (Home, Pro . . . etc.) you previously had installed to avoid Activation issuesClick this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), you can create a bootable USB flash drive (min 8GB) using that toolThen, Boot your PC from the Installation Media you just created (change Boot Order in your BIOS) to begin installing Windows 10","Thank you for your detailed reply I appreciate it. Coincidently I was checking for a solution in settings and I discovered that updates can be uninstalled. So I checked the history of my updates and uninstalled the recent uodate which apparantly was the cause of the issue. Now my laptop is much better and does not lag at the simplest tasks. "]},{"symptom":"Security Updates        I have trouble with my computer freezing up after the last couple Security Intelligence updates.  These are the only updates or changes that had been made to the computer.  How do I uninstall these last few updates?If I go under update history, I can uninstall any other updates but the security ones.This is the second this I have had this happen, and the only way I addressed the issue before was to reinstall Windows.  Thank youMarc","solutions":["Hi MN. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Do you have a System Restore point to roll back to before the problem began? See here how to do this, which is simple and easiest:https:\/\/www.windowscentral.com\/how-use-system-r...Then see if you can block the Updates as shown here: https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...But if they will not block and reinstall, there's a chance they will not cause the problem again. If so let's try to find and fix the problem which may be in the install itself or User account:Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thank you.  I will give that a try","Keep me posted on your progress as I will be here to help until the case is resolved."]},{"symptom":"winaero tweaker                        Winaero Tweaker is supposed to allow a user to adjust things like the font used for desktop icon labels. But the download is a ZIP file. How do you extract the executable software from the ZIP file?","solutions":["Hi Jim Right click that zip file and choose 'Extract All' Then you will see the installer file, double click that to install Winaero Tweaker- WinaeroTweaker-0.16.1.0-setup.exe","The truth: So-called tweaker software, aka optimizers or cleaners is marketed to novices who are easily persuaded because they don't know any better. Trust me, friend, I've been there. There wasn't a tweaker that I did not try ... until I saw the light (and by that time my computer resembled a pretzel.)If you have to ask how to unzip a downloaded installer, you ain't ready to 'tweak' your computer. And if you were ready to tweak, you would be smart enough not to.So stop now before you dig yourself into a hole. And if you do end up in a hole, which is only a matter of time, be sure to ask me what to do. Because I've already made every mistake you're about to make, plus a few other mistakes that would never occur to you.  😉","Here is one example of using those tweaks. In this case using start menu modifying tweak caused Windows to be unable to update for new preview. Yes, that case was for preview of next Windows version, but that kind of things may as well happened with released Windows versions.https:\/\/answers.microsoft.com\/en-us\/insider\/forum\/all\/0xc1900101-while-installing-insider-preview-fixed\/be2396ca-4e11-4d94-b356-40e8b5e701cc"]},{"symptom":"Windows Malicious Software Removal Tool x64 - November 2019 (KB890830) -Error 0x800711c7        During a security update, the download completes but the install fails with the message:-Windows Malicious Software Removal Tool x64 - November 2019 (KB890830) -Error 0x800711c7What do I do?","solutions":["Hello DaveProsser1, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemYou could try downloading this update in particular manually from this link: https:\/\/www.catalog.update.microsoft.com\/Search...it should work with manual install, if not, let me know and we will figure a solution outRegards! Farah"]},{"symptom":"Can't type in Pin because the login box doesn't show up.        I try to log in with my pin.I tap the keyboard to get the login box to appear. The page will go blank and I can't type in a pin. I have to restart my computer. There doesn't seem to be an apparent reason for this. It seems to happen randomly. No updates or anything like that have happened recently.Usually, I can restart my computer and the password login box will appear, but it's just annoying that this happens.It wouldn't be a problem but sometimes the page will go blank for a while and then the login box will pop up, but it takes a long time for it to pop up. So, i'm left sitting here waiting for the box to pop up and then it doesn't pop up.I'd just like to add that Windows 7 never had these ignorant problems. I had windows 7 for over 10 years and loved it. I don't know why updated OS's have to operate less efficiently than previous OS's","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? I recommend an in-place upgrade repair. To repair Windows without losing any data then follow the instruction here: https:\/\/www.tenforums.com\/tutorials\/16397-repai...This will also upgrade you to the latest version of Windows - currently 1909. In a nutshell you just insert the Windows 10 media (USB\/DVD) & run setup from within Windows.Please note a repair install is not a reset, this is a last attempt at repairing a PC without a clean install. If this fails to repair the problem then usually a clean install is required.Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","How are you getting on with the instructions?"]},{"symptom":"Transfer Windows Product Key        I had 3 computers (2 desktops and one laptop) that ran Windows 7 Home.  I bought 3 keys to upgrade them to Windows 8 Pro, then Window 10 was released and I upgraded them to Windows 10 Pro during the free upgrade period.  I have since replaced 2of them ( a laptop with Windows 10 Home to replace the laptop and a laptop with Windows 10 Home to replace one of the desktops.) The Pro Keys are no longer being used on the 2 replaced computers.  Can I transfer the Pro keys to the 2 machines and if yes, how do I go about doing that or do I have to buy new keys is I want to upgrade the 2 new machines?Regards.","solutions":["Hello. Are the keys purchased from a store? Retail keys can be transferred so I can’t see why you wouldn’t be able to transfer the license.You can use the default pro key to upgrade the Win 10 home to pro then enter the Win 8 pro key to complete activation.VK7JG-NPHTM-C97JM-9MPGT-3V66T","Do you have any updates for me?"]},{"symptom":"Windows 10 will wake itself from Hibernate or Sleep mode        I have a laptop and desktop computer running windows 10. Both devices I like to keep in Hibernate or Sleep mode so I can quickly return to where I left my PC.I will put them in sleep\/hibernate mode and leave my computer to go to work or go to bed.I'll come home some nights and see that my computer is awake and sitting at my log in screen.","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? Do you have a wireless mouse &\/or keyboard? These may be causing the wake as it doesn’t take much to nudge them - a cat\/small animal or a bump on the pc table will do this.Check this: Power Options>Edit plan settings>change advanced power settings>Sleep> Change settings to disable.Network & sharing centre>change adapter settings>R click for Properties>configure>Power management, remove tick from allow device to wake computer.","Do you still require help?"]},{"symptom":"Can't reactivate Windows 10 Pro after a hardware change        Yesterday I upgraded my CPU, which also involved getting a new motherboard and RAM. I am aware that hardware changes this large will usually make this happen, but I've tried to troubleshoot, and I've clicked the button at the bottom when you have changed your hardware, but it just tells me to try again later. Any advice?","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? Run this cmd within powershell with admin powershell “(Get-WmiObject -query ‘select * from SoftwareLicensingService’).OA3xOriginalProductKey”Or wmic path softwarelicensingservice get OA3xOriginalProductKey if using cmd prompt.Or: Check this program to reveal if there’s a key embedded in the BIOS: https:\/\/neosmart.net\/OemKey\/Or: Download and run this: https:\/\/www.microsoft.com\/en-us\/p\/showkeyplus\/9... to find all keys used on the PC.Also run this to see what is currently installed & post a screenshot: Right click on start & choose powershell with admin & enter: slmgr.vbs \/dlv This will show a popup showing whether your license is OEM, Retail, or Volume amongst other information.If this states you have a volume licence then there is away to return to a legal key if there's one in the BIOS.If it does please post back. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi Virginia,I have tried the cmd prompt and the powershell, and neither gave a response to the code. I checked neosmart and it said there was nothing. I tried showkeyplus and I couldn't find if it is 1809, 1903 or 1909. My product is Retail apparently.","Sorry to see that you marked my reply as not helpful while we are still going through solutions.Don’t worry about the lack of key, this just means Windows wasn’t updated from a previous version which may have been interfering with the reactivation.Have you tried entering the default key for Pro? VK7JG-NPHTM-C97JM-9MPGT-3V66T Is there any error message &\/or code other than the one you mentioned? It may be that the activation servers are overloaded with new users. Some people have had success by retrying activation several times. If still no luck then a call to Microsoft support will be necessary: https:\/\/support.microsoft.com\/\/help\/4051701\/https:\/\/support.microsoft.com\/contactUshttps:\/\/partner.support.services.microsoft.com\/...","Hi, I'm on the phone to microsoft support right now and so far all they've done is ask what parts I replaced and then put me on hold for 15 minutes. I have a product ID and an installed key, but I'm missing the OEM key. Does this help at all? The only error message I'm getting is that troubleshoot will tell me \"We weren't able to activate Windows on this device\" and then clicking I changed hardware on this device recently will ask me if the PC I'm using is the PC I'm using. Then after a second it will tell me \"We can’t reactivate Windows on this device. Try again later.\" There is an error code on the settings page that says 0x803FA067. This is all I'm able to find. I tried repeating the activation process for a good 5 minutes, and on 2 different days now, and nothing has changed so far. I hope this helps because I don't have any other information at the moment, let's just hope they take my call soon.","OEM key\/license is different to a Retail. did the original PC\/Motherboard come with Windows 10 preinstalled?Did the PC come with Windows 10 Pro or was this an upgrade from Home? Try this from TenForums: Open a Command Prompt (Admin) or Power Shell (Admin) will work too. Run these commands (while connected to internet):slmgr \/ato If Windows does not activate, then: slmgr \/ipk (followed by product key including dashes) slmgr \/ato Hopefully support will be able to help you.","How are you getting on with your activation problem?"]},{"symptom":"how do I exit S mode?        How do I exit S mode in order to install Chrome browser?","solutions":["> Windows 10 in S mode FAQ - Windows Help   > https:\/\/support.microsoft.com\/en-us\/help\/4456067\/windows-10-switch-out-of-s-modeFYI: In case you have problems switching out of S mode:Seems that there are some problems on the Microsoft's servers side.. You might want to try contacting Microsoft here:  https:\/\/support.microsoft.com\/en-us\/help\/4051701\/global-customer-service-phone-numbersContact Us – Microsoft Support","The simplest way is to open Settings on your pc> > Update & Security > Activation. In the Switch to Windows 10 Home or Switch to Windows 10 Pro section, select Go to the Store. (If you also see an \"Upgrade your edition of Windows\" section, be careful not to click the \"Go to the Store\" link that appears there.)On the Switch out of S mode (or similar) page that appears in the Microsoft Store, select the Get button. After you see a confirmation message on the page, you'll be able to install apps from outside of the Microsoft Store.https:\/\/support.microsoft.com\/en-us\/help\/445606...","Do you still require help with your problem?"]},{"symptom":"I livve in HudsonWi heard Comcast window going to Windows 10        I live in Hudson Wisconsin and have Comcast for internet service. I had heard that on January 16th Comcast is going to go to Windows 10 and if I am windows 7 I will need to back up some files. I have windows 7 now and want to know if Comcast is going to windows 10 and if so what files do I need to back up?","solutions":["I really doubt that \"going to Windows 10.\"  However, as of next Tuesday, Microsoft will stop providing security updates for Windows 7.  For this reason, Microsoft -- and apparently your local Comcast service -- is strongly urging everyone who is using Windows 7 to move to Windows 10.If you do \"upgrade\" your system to Windows 10, it's prudent to first back up your data files.  Actually, you should be backing up your data files on a regular basis, completely apart from moving to Windows 10.  I suggest that you use one of the several third-party applications to do your backup -- the Backup and Restore facility built into Windows 7 is both clumsy and unreliable.  You can get either free or commercial backup programs.  See, e.g.,:Easeus Todo Backup FreeMacrium Reflect Free EditionAcronis True Image (not free)On the other hand, you don't actually have to move to Windows 10 immediately.  See, for example, the discussion herehttps:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/windows-7-update-deadline\/b06c2dfe-6d23-4389-a3f7-f689309376e3, andhttps:\/\/www.askwoody.com\/2019\/canadian-tech-how-to-rebuild-a-win7-system-with-minimal-snooping\/"]},{"symptom":"Why does my Windows 8 laptop not recognize my spooky 2 generator>        Why does my Windows 8 laptop not recognize my spooky 2 generator>","solutions":[]},{"symptom":"my edit boot options screen...is there a tip or trick??? please help        hiIm staringat the edit boot options screen with my boot sequence all mapped out except theyre brackets there at the beginning and the end way out of reach for me to get to them unless theres  some formatting trick I don't know aabout. can I use my mouse in the edit boot options screen? I have to get rid of the brackets someone told me that any thing between brackets changeable. please help","solutions":[]},{"symptom":"windows 10 pro and hyper-v        I have to buy another copy of Win 10 pro in order to setup Hyper-V?","solutions":["For the purposes of activation, a guest operating system is separate from the host operating system.Thus, Windows 10 installed in a virtual machine requires its own license and activation.","If you want to create a virtual machine in hyper-v that is windows 10 and want it licensed\/activated then yes you would need to buy another license. As this is a completely new\/different install of windows and technically a new machine.You can download and run the windows media creation tool and save the iso to a file for free to install.https:\/\/www.microsoft.com\/en-us\/software-downlo... However, this will be an unlicensed copy until you license it. I hope this answers your question!"]},{"symptom":"Cannot download anything on Microsoft Store | Error 0x80070005        I can't download anything on the Microsoft Store.When I click install, it'll start downloading, get to the 'Acquiring License' stage and then after a few seconds give me 'error 0x80070005'.I've restarted my computer, made sure I had the right account, troubleshooted the Microsoft Store app, but nothing seems to have worked.I'm not exactly a computer genius as well, which makes fixing this issue all the more difficult.Any help would be appreciated. ","solutions":["Hi William. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything possible to repair the store. Even if you've tried a step please do it over in this sequence. If any steps cannot be performed then report it and move on to the next:1) Try updating Store apps: https:\/\/support.microsoft.com\/en-us\/help\/402625... 2) Make sure you have the latest Windows 10 version 1909 in Settings > System > About and if not skip to Step 10 to install it by the most stable method.3) See if the fixes here help: https:\/\/www.pcworld.com\/article\/3053099\/windows... 4) Try running the Windows Store apps Troubleshooter at Settings > Update & Security > Troubleshoot.5) Try resetting the Store cache: http:\/\/www.thewindowsclub.com\/reset-windows-sto... 6) If that fails go to Settings>Apps and highlight Microsoft Store, choose Advanced Settings, then Reset. After it resets, restart PC.7) If that fails then reinstall Store. Type CMD in Start Search, right click Command Prompt result to Run as Administrator, copy the following code and paste it into the box using the Edit tools from Box's top left dropdown menu, press Enter:PowerShell -ExecutionPolicy Unrestricted -Command \"& {$manifest = (Get-AppxPackage *WindowsStore*).InstallLocation + '\\AppxManifest.xml' ; Add-AppxPackage -DisableDevelopmentMode -Register $manifest}\"8) Clear the LocalCache Folder: Open Run by pressing the Windows key + R hotkey. Copy and paste %localappdata% in Run and click OK. Open Packages> Microsoft.WindowsStore_8wekyb3d8bbwe > LocalCache folder. Press the Ctrl + A hotkey to select all content within the LocalCache folder. Press the Delete button. 9) If these all fail then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account because of the serious and persistent problem with corrupted accounts. Then continue with the other steps to go over your install most thoroughly.10) If nothing else works then do a Repair Install, by installing Media Creation Tool and then choosing to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"in win 10, maximized window won't drag        Hi. I turned off snap and now a maximized window on my desktop won't drag and get smaller.I browsed this site and did the Restorehealth in the command prompt thing, also sys scannow with no help.In regedit, my hkey current user control panel desktop Drag from Maximum is set to \"1\".How do I keep snap off and be able to drag maximized windows?ThanksMoved from: Windows \/ Windows 10 \/ Ease of access","solutions":["Don't maximize it and then you can drag its edges to make it full size if you want that - and then you can move it by grabbing the title bar.Click the little square icon to the left of the top right x on the title bar.","That's not a fix. Comon, I could drag a maximized window for the 2 years I've had the laptop, until a few days ago. Something changed and I want to set it back.","I could drag a maximized window Mike is right.  If the window is maximized the window's window menu will prevent you from moving or resizing it and that has always been the case.   Use Alt-Space to see this.  Restore, Minimize and Close are your only options in this state.  So almost certainly you would have been dragging a maximally sized window.  In that case everything except Restore would have been available--a sign that the window is in its normal mode.FYIRobert Aldwinckle---","Richard.You certainly respond with some implied authority. So in your vast and insightful vision of all beings using a computer, I've not clicked the little square icon at the top any window but have always been dragging the corners to make it appear maximized.Well shucks, I've forgotten this little exercise, which I must have done countless times. Wow!! Scratching my head. EXCUSE ME!But really, there's some disconnect here. Like I said, I maximize some windows, but did not have to click the double-box icon to reduce the size. All I had to do was drag from the title bar and the window reduced to the previous non-maximized size.Comon, if you don't want to explain or don't know, just say so.The Meat","I maximize some windows, but did not have to click the double-box icon to reduce the size. All I had to do was drag from the title bar and the window reduced to the previous non-maximized size.You can do that using the Snap windows feature but check out the window menu when you do that.  E.g. press Win+CursorUp ;  that snaps the window to Maximized.   Press Alt-Space to see that only the menu items I mentioned before for a maximized window are available.   When you are using the Snap windows feature with your pointer you need to drag it up first and observe the ghost maximized frame before clicking to make it snap to Maximized mode.  An analogous procedure is needed when you want to snap a window left or right.  Then I think the use of the pointer for a half screen may be clearer when snapping a window into a new mode and undoing the snap.So, to clarify the original discussion, you weren't really dragging a maximized window you were moving your pointer in a way that looked as if you were but in fact were only doing that to change the window's mode and size.FYIRobert---","Listen, Robert, I didn't do any of that, I simply grabbed the title bar of the window I had maximized and dragged it down left, down right whatever. That's what I did, always. I didn't have to observe anythhing, didn't have to press anything, just grab and drag wherever I wanted. Do you work for Microsoft? ","I'm having the exact same issue. I work on two screens and used to drag excel worksheets (maximised worksheets) from screen to screen. Now it wont work. I have to leave maximised mode and then move the window and then maximised it again. This feels like one extra step and I know not the biggest inconvenience, but it is still annoying me.","Me too! maximized windows - could move from screen to screen. now I have to click to un-maximize it to move it. what a pain! There has to be a simple way to put it back. Is there no computer genius that knows the trick?","Exact same problem here.Was able to drag a maximised window. Yes it was maximised, my OCD won't let me just stretch a window so it \"looks\" like it maximised.But recently it stopped working. Thanks Microsoft!Still looking for a solution.","I've found a fix and if anyone is interested still you this is what you need to do to enable\/disable this:1. Open Control Panel 2. Go To Ease Of Access3. Go To Mouse Settings (Pointer settings)4. Check Or Uncheck \"Prevent windows from being automatically arranged when moved to the edge of the screen\"There you go, and **** the rest of u lazy morons for lying to people and trying to convince them otherwise.Have a nice day. :)"]},{"symptom":"Sky go        Having problems watching sky go I have HP window 10. Sky cant help HP cant help. When I watch sky go it stutters and it echos.. I bought my laptop on the 30th October 2019 not old.. I don't have trouble with sky go on window 7 or 8.. its very frustrating as I bought it because it has a 17 ins screen just so i can watch sky on it.. wonder if anyone else has this trouble.... ","solutions":["Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.I understand how frustrating it is if something's not acting right on your PC. So I found this article that you can check and see if the instructions provided can help you troubleshoot the app and fix it in Windows 10https:\/\/windowsreport.com\/sky-go-not-working-wi...(Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.)I hope this helps with your concern! Please let me know if you have further questions.","Hello Paulo GMThank you for your reply.. Tonie","Hello Paulo.Sky did all this with me. users-roaming-  CiscoVideo Guard. delete all sky go.Unfortunately it still didn't work still was getting echoing and stuttering.Now when i go into users I have  lost the roaming file cant find it... I also get now and then \"connecting to your application initialisation failed to complete in a timely manner try again\".I have no idea if its a Microsoft problem sky problem or HP problem. All i know is the other 2 laptops window 7 and 8 sky works perfect on them,I have no idea about computers bit dumb when it comes to tech things ..Thank you so much for your help...Tonie "]}]}