{"windows":[{"symptom":"Establishing a Wired Internet Access on a Smartphone        I have connected a smartphone with Android 8.1.0 to a computer. After that, on the smartphone, I have gone to Settings > Network & Internet > Hotspot & tethering > USB tethering > On.Next, on the computer, I have gone to Settings > Network & Internet> Ethernet > Change adapter options > Ethernet > Properties > Sharing > Allow other network uses to connect through this computer’s Internet connection > Home networking connection: > Ethernet 4 [the name of the smartphone’s connection].There is still no wired connection to the Internet on the smartphone. Is there anything else which needs to be done? Do you get wired Internet connection on your smartphone when you follow the above steps?","solutions":["Hello. As mentioned, USB tethering shares the phone internet to the PC. You can share the PC's internet connection by making the PC a \"hotspot\":https:\/\/support.microsoft.com\/en-us\/help\/4027762\/windows-use-your-pc-as-a-mobile-hotspot"]},{"symptom":"Microsoft store        Hi am using windows 10 2004 version build 19536  after the recent updates since 1 week am unable to use ms store am unable to download any apps from the store first time am facing this issue. I have tried all the troubleshoot solutions reset the app am facing error code: 0x803FB005. I have searched for this error in web also but nothing seemed to work.","solutions":["Hi, HeenaM1 My name is Evelyn and I am an Independent Advisor. I would be happy to help you today.Follow these steps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system See here the correct way to execute the commands: https:\/\/www.yourwindowsguide.com\/2018\/08\/resolv...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi my issue has not been solved according to your steps I have tried powershell, reset the app but same issue is persisting.","You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi even this method did not work for me","You may get better help if you posted in the Insider forum as this is an insider preview testing build.You can go to your original post and edit it then select the correct forum. Be aware one option would be to clean install Windows 10 and start again, as testing previews may often come with problems. It could be a known issue.","I recommend you to repair Windows completely before you should backup your files.Microsoft Official Website to download and create Windows 10: https:\/\/www.microsoft.com\/en-us\/software-downlo...See here the correct way to recover your files when repairing Windows: https:\/\/www.backup-utility.com\/windows-10\/reins...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"My THTF laptop can't work with geforce 840m        After I updated my pc to Windows 10, my PC could no longer use my Nvidia 840m graphics card. No matter how many new drivers you install, once you enable the card, the screen goes black, and it does so again after a reboot. You need to go into safe mode to turn the card off before returning to normal. By the way, my laptop is a Tsinghua Tongfeng sharp K560 with Intel I7.Please help me! ！! Thank you!","solutions":["Hi 范子钰 The Nvidia GeForce 840m is now considered legacy hardware in Versions 1809, 1903 and 1909 of Windows 10 and is no longer supported by Nvidia on those versions of Windows 10Try the Game-ready driver from this link, if that does not get your video card working ,then possibly the only solution is to install an older version (1803) of Windows 10, which that card should work with . . .https:\/\/www.geforce.com\/drivers\/results\/96081________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","Hi 范子钰 Hi, Fan ZiyuThe Nvidia GeForce 840m is now considered legacy hardware in Versions 1809, 1903 and 1909 of Windows 10 and is no longer supported by Nvidia on those versions of Windows 10在 Windows 10的1809、1903和1909版本中，Nvidia GeForce 840m 现在被认为是遗留硬件，并且在这些版本的 Windows 10中不再支持 NvidiaTry the Game-ready driver from this link, if that does not get your video card working ,then possibly the only solution is to install an older version (1803) of Windows 10, which that card should work with . . .从这个链接尝试游戏准备驱动程序，如果你的视频卡不能工作，那么可能唯一的解决方案是安装一个旧版本的 Windows 10(1803) ，这个卡应该工作..https:\/\/www.geforce.com\/drivers\/results\/96081________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.标准免责声明: 这是一个非微软的网站。 该页面似乎提供了准确、安全的信息。 注意网站上的广告，这些广告中的产品经常被归类为 PUP (可能不受欢迎的产品)。 在你决定下载和安装任何产品之前，彻底研究一下网站上的广告. But the version I'm using now is 1803","Hi 范子钰 Were you able to install that game-ready driver linked above?","The one released in 2015?","I will try it.","Okay, please let me know, how you get on . . .","It doesn't work...Actually, it says the graphics driver failed to install.I've tried to remove the old drive, but it's no use.","Maybe there's not enough disk space.","Hi, please try to remove drivers entirely using third-party Display Driver Uninstaller app before driver reinstallation.","Are you still here？I can't find this discussion these days. So, I'm sorry about that."]},{"symptom":"laptop disconnecting from wifi        I recently had my wifi modem changed...this one is a 5g the old one was a 4g...since installation my laptop loses connection although it will sometimes show connected or limited. but get message I've lost connection....have updated drivers and tried various online advice...the only change is haven't had the limited title...have to disconnect wifi and reconnect it then reload page...help","solutions":["Hi kiki0714,the old modem cannot be 4 G because simply 4 G does not exist!Clearly specify what the exact model of your new and old modem is and whether your wi-fi adapter supports the 5 GHz band.","I no longer have the old modem so don't have that info...the new on is a duel that I do know...2.5 and a 5 I also know that my laptop worked perfectly until Spectrum replaced the modem...now it will show connected..strong signal but it can't find the IP or server...never had that problem","Ok.Go to Device Management> network adapters, select your network adapter in use, click on the Power Management tab, clear the checkbox: Allow the computer to turn off the device to save energy.Click on the Advanced tab, disable any option related to energy saving.Otherwise follow here: https:\/\/support.microsoft.com\/en-us\/help\/10741\/windows-fix-network-connection-issues","did the Device Manager thing already...did nothing...the wifi company was here...rewired everything inside and out...still happening...did find the 2.5 and 5g were fighing each other because of two different ID's fixed that but didn't fix the problem...going to wind up taking it to someone and if I find out it has anything to do with the modem or modem change they will pay for it...just seems odd that it worked fine all of a sudden the modem burned out...was replaced and now the laptop doesn't work properly...thank you for trying to help....it was greatly appreciated","But can the other devices in the house connect to the modem and access the internet?Try to connect to the modem via network cable and check if you can access the internet.Otherwise, delete all network profiles on the PC from known networks and then try to connect again by re-entering the Wi-Fi password.","yes...my streaming box and phone are okay...will try deleting the network and reconnecting...will let you know what happens...thank you","This is the only computer in the house that I use for internet...forgot to tell you that...deleted the network and reset it up again...didn't work....I'm at a loss","But have you tried to connect with the PC to the router via a network cable?It works? if you have a smartphone, configure the hotspot, then check if the pc connects and can access the internet via the phone hotspot.Otherwise, turn off the router and turn it back on after a few minutes, also restart the PC.If this does not resolve, reset the router and then reconfigure it again.","laptop works perfectly with the ethernet cable plugged into the modem....already tried the reboot...(turning modem and laptop off then wait and turn them back on)...that didn't work...now that it works with the cable...what does that mean...lol","It means that the problem is only with Wi-Fi.Wi-fi and ethernet are 2 different connection modes.If you have a smartphone or tablet, set up the hotspot on your phone or tablet and then connect with the laptop to the hotspot, does it work?You haven't answered me yet ...If your new modem \/ router is Dual band, access it and temporarily disable one of the 2 bands and check if it works.Assign different names to the 2 networks, 2.4 and 5 GHz."]},{"symptom":"Fingerprint Option        HI I cant use my Fingerprint protection.its showing unavailable.","solutions":["Hi, Fingerprint login is only available on supported devices that have Windows Hello support. So you would need to check with the manufacturer if it's supported and if there are any drivers available. You may be able to update them by going to Device Manager > Select the device > Properties > Update Driver. I hope that helps."]},{"symptom":"Laptop froze        My laptop is stuck on Acer logo. It rapidly goes black and then shows Acer logo. This repeats and never stops. The only thing accessible is the BIOS menu and noting else works. Please help.","solutions":["Hi, This sounds like you are stuck in a Windows boot loop. This generally happens when there's issues with your Windows installation such as corrupted files. Have you got access to a second computer? The first thing to try would be making a bootable USB with the Windows 10 installer from another device. Then booting to that and running the WIndows repair from the USB.Failing that you may need to reinstall windows as most troubleshooting steps need a booted version to try unfortunately.I hope that helps, please let me know if I can assist further.","Will i lose my data if i run windows repair from USB deive ","Also, does it indicate  a problem with my HDD","Hi, You shouldn't loose anything if you \"Repair\" you will if you run \"Reset\" from the same booted menu.It doesn't necessarily indicate any issues with your HDD. It's far more likely it's just a problem with your installation. If you have further issues with a repair that will be the biggest indicator of any further issues."]},{"symptom":"16 GB RAM Installed (15,9 GB Usabble)        I bought a new desktop computer with an i7 4790 and 16 BG RAM, but the computer itself uses just 15,9 gb ram.How can i fix this?","solutions":["There is nothing  to fix. Windows never shows an exact total capacity of 16.384 GB RAM in Task Manager.I believe the 'missing' RAM is system reserved.- You will see 16GB in msinfo32 though...","Hi POMihai this is normal, some of the memory is reserved by the hardware for more information, click start, type resource and select the resource monitor look on the memory tab, it will show you what is reserved, in use etc."]},{"symptom":"Motherboard Replaced and now have a \"not geniune\" notice. Tried to activate but wont allow me access. Any suggestions?        I cant get into \"activate\" I have an OEM product key. What is the problem?","solutions":["You can not replace the Motherboard with an OEM preinstalled License with whatever Motherboard you wish to when you have a preinstalled OEM License (HP, Acer, etc),.You have to follow the directives or you void your OEM License.This was the original link. Microsoft is altering\/deleting links, but the information that was originally there remains the same (I copied it before the link disappeared)http:\/\/www.microsoft.com\/oem\/en-gb\/licensing\/sblicensing\/pages\/licensing_faq.aspx#fbid=iePP5a9JaWJQ. If my customer asks me to upgrade a PC with new hardware components, when is a new operating system needed? When would the PC be considered \"new\"?A. Generally, an end user can upgrade or replace all of the hardware components on a computer—except the motherboard—and still retain the licence for the original Microsoft OEM operating system software. If the motherboard is upgraded or replaced for reasons other than a defect, then a new computer has been created. Microsoft OEM operating system software cannot be transferred to the new computer, and the licence of new operating system software is required.If the motherboard is replaced because it is defective, you do not need to acquire a new operating system license for the PCas long as the replacement motherboard is the same make\/model or the same manufacturer's replacement\/equivalent, as defined by the manufacturer's warranty.@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@If you bought and installed your own Retail Windows License, you can change Motherboards"]},{"symptom":"My computer Keeps BSOD        My newly built computer keeps BSODing after i upgraded it from windows 8.1. The spontaneous BSOD was annoying with the error CLOCK_WATCHDOG_TIMER can anyone help me?Parts:Ryzen 5 2400gA320m S2h V2HyperX 8gb XMP 3200mhzCorsair 40 watt psuWestern digital M.2 green 120gbWD HDD 1tb","solutions":["Sure, Wishes for a wonderful New Year to you :)"]},{"symptom":"Leave Programs and Apps running all the time?        Hello:I have always closed all programs I am using when I leave my computer That goes for Home or work.I leave the Computer on 24\/7 at both places.I just wondered If I need to keep doing this or if it is really OK now days to just leave the programs I use running all the time.Programs like: Excel - MS Word AutoDesk Inventor","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,Yes you may leave your apps open 24\/7 as I do myself personally. Although I'd recommend making sure that your hardware is more than enough to perform it as some set of hardware may not be enough to perform the task which may lead to hardware failure.Other than that, I would recommend turning on sleep mode whenever you plan on leaving it for that amount of time, this prevents the hardware to overheat due to the overusage of the device."]},{"symptom":"Broadcasting on Windows 10        Applies to Windows 10 & Gaming on Windows 10As of October 2019 the broadcasting option that was once found in the Gamebar to broadcast to Mixer was removed. Microsoft\/Xbox wanted to remove this feature to enable them to improve the performance and make way for new improvements. The official statement from Microsoft here: \"With continued, great feedback from the community and after careful consideration, we have decided to remove Mixer from Xbox Game Bar to focus on delivering new, more often requested experiences across Mixer, Windows 10 and the Xbox Game Bar. You can broadcast to Mixer from Windows 10 devices using third-party tools such as OBS, Streamlabs, and XSplit and continue to use Xbox Game Bar for screen capture and sharing, controlling your music and audio settings, finding new teammates with Looking for Group (LFG), and chatting with Xbox friends across Xbox console, mobile, and PC – all without leaving your game.\"Taken from: Windows Central ArticleYou can find a support article on Xbox Support with more information on the Windows 10 Gamebar: https:\/\/beta.support.xbox.com\/help\/games-apps\/game-setup-and-play\/troubleshoot-game-bar-windows#7300e277530c4407ad68fb8d42f7e893So How can I broadcast on Windows 10?There are third party tools that are available. These are programs that you install onto your Windows 10 device and capture what is on your screen, broadcasting it to your chosen streaming provider (Mixer, Twitch, YouTube, etc...). The main one at the moment is:OBS - https:\/\/obsproject.com\/ Streamlabs - https:\/\/streamlabs.com\/ XSplit - https:\/\/www.xsplit.com\/ Of course, all of these are third party apps. These are not connected to Microsoft in anyway, shape or form. If you choose to dowload any of these programs, it is at your own risk.If you choose to broadcast to Twitch, you can do so using their Twitch Studio (Which is currently in beta). More information is found here: https:\/\/blog.twitch.tv\/en\/2019\/08\/08\/twitch-studio-going-live-is-getting-a-whole-lot-easier-ee64251bcf5\/ Recording game playYou can still record game play from your computer and upload this individually to YouTube after it has recorded. To do this, please open Windows Game bar and select record. This will bring a recording overlay on your screen where you can control your recording. This records your screen, but does not broadcast it. All recordings get saved into the Game DVR folder within Videos in your file explorer. How do I submit feedback?There are ways to submit feedback to Microsoft about your experience with Windows and gaming. You can use the Feedback hub which is found within Windows 10. More information can be found here: https:\/\/support.microsoft.com\/help\/4021566You can submit feedback to Xbox using their page here: https:\/\/www.reddit.com\/r\/xboxinsiders\/wiki\/ideas ____________________________________________Thank-you for reading this article. If you have any suggestions about what to add in the article, please leave a comment underneath. Happy gaming!My social channels: Twitter , Facebook Page , Mixer Channel","solutions":[]},{"symptom":"Upgrading Windows 7 to Windows 10        Anyone please give a solution. When I found this website I thought that I would get my answer. My question is - if upgrade MyWindows 7 to Windows 10 ,will my pres files, folders, apps and all data be lost or not?   ","solutions":["My question is - if upgrade MyWindows 7 to Windows 10 ,will my pres files, folders, apps and all data be lost or not?   -> No, they won't be lost but the wise man would back them up anyway - once every week!","It depends on what upgrade path you choose.If you have Windows 7 Pro and you want Windows 10 Home; No.And free upgrade path had to be same bit architecture and upgraded to similar edition.I suggest that you read all of this before starting to upgrade.You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700Cheers."]},{"symptom":"Windows 10S        Hello everyone, Im new to the community and have a question. I received a Acer Aspire 1 w\/Windows 10S as a gift and thinking of removing the s mode but wondering if I do can I download office docs via USB drive?","solutions":["Hi Aurora58 you should be able to access the data on the usb drive whether in S-mode or not. are you currently having a problem accessing your office docs? do you get an error message when you try? please tell us the exact wording","Hi Aurora58 you should be able to access the data on the usb drive whether in S-mode or not. are you currently having a problem accessing your office docs? do you get an error message when you try? please tell us the exact wording Hello Martmcd,I have not tried at this time, wanted to be proactive and see if anyone had run into any problems and if so what was the solution or work around.Thanks for your timely response.","Yo, are you close to Greeley ","No problem, do let us know if you experience an issue."]},{"symptom":"Language selection \/ input \/ spell check : mess        Hello all,I am Greek living in the Netherlands and I want to switch languages between English and Greek.But I want to use the spell check for all three languages (ENG, GR, NL).How can I do that? It's very complicated with all these settings ��As you can see in the screenshot, I have currently 4 different inputs to switch whenever I am typing! That cannot work, it's too time consuming.Thanks in advance--- moved from NL-NL ---","solutions":[]},{"symptom":"Wifi Connectivity Problem        I have tried updating wifi driver, rollback wifi driver, Resetting tcp, tried power-saving mode ones too. But the wifi keeps disconnecting after a minute or two. Every time I have to manually disconnect and connect again. Other devices just work fine. Please help me solve this problem.Thanks in advance.","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,I would first recommend connecting your device through a wired connection directly to your internet modem and see if the same behavior occurs.If the same behavior occurs, I would recommend performing a network reset to reset the network configurations on the systemMethod 1: Network reset 1. Open start menu and open up settings (Gear icon) 2. Under settings open network and internet 3. On status, scroll down until you see \"Network Reset\" 4. Choose reset now (This will reset your network configuration, you will need to re-insert your passkey for your wifi if you are connected wirelesslyLet me know how it goes. :)","Actually, this problem occurred on other networks too. So can I just try your suggested method?","In that case, please do proceed with method 1.","The problem is still there. It didn't resolve","I have tried updating wifi driver, rollback wifi driver, Resetting tcp, tried power-saving mode ones too. But the wifi keeps disconnecting after a minute or two. Every time I have to manually disconnect and connect again. Other devices just work fine. Please help me solve this problem.Thanks in advance.Update: When I unplugged the charger the wifi worked fine, there was no problem for hours, but as soon as I plugged the charger the problem started again."]},{"symptom":"Adding People To Windows 10 Mail From An Email        I am new to Windows 10 and the new Mail program. I have read all I can find about adding contacts to People from a received email and I am unable to do it.What I have read says to left click on a person\/email in the reading pane of an email. When I do that a window opens with the option of emailing back to that person and it shows a list of the emails that person has sent me. I can find no way to add that person to my People directory. What am I missing? I am NOT happy with the new mail program.Thanks,Pete","solutions":["The first thing you should know is that Microsoft announced that it will remove the People app because, ironically, not enough people are using it.The second thing you should know is that the Mail app does not actually provide mail\/contacts\/calendars. Mail is a middleman (middle person?) between the Windows 10 interface and your webmail providers. If you want to add a contact from a GMail to your GMail contacts, do it in GMail and you'll have no trouble. Similarly, if you want to add a contact from an Outlook.com message to your Outlook.com contacts, do it in Outlook.com and you'll have no trouble. Are you getting my drift?  😉In general: Just because Windows 10 provides a feature, that doesn't mean you're expected to use it. You have a choice.","Thanks for the quick reply and info. What you say is all new to me, as is Windows 10. I have used and been happy with W7 for many years. I wish Microsoft had allowed an easy way to transfer contacts and files from W7 to W10. I have spent a lot of time just trying to get my new PC set up like I want it.My kids would say I am old school - guilty! I don't use Gmail or Outlook.com. I do have an Apple phone, but don't use icloud. I DO back up my phone to my PC. It would be nice if there was a way to transfer or copy contacts from iTunes into W10.If Microsoft is going to remove the People app, then how\/where do you store contacts in W10?","Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.You click on the senders name in the reading pane, not on the list of emails. This will then open a dialog box where you can save the contact. Regards, Ross","Hi Ross,I guess you missed where I posted this in my original post -\"What I have read says to left click on a person\/email in the reading pane of an email. When I do that a window opens with the option of emailing back to that person and it shows a list of the emails that person has sent me\".I am clicking in the reading pane and I get what I explained above. This function doesn't appear to work for me.Pete","Hi,Sorry I probably didn’t explain that as clearly as I could.There should be a save button at the top right of that pop-up that says save.Regards,Ross","The little icon in the upper right of my popup box is an email icon. Clicking on that opens a new email to that address. There is no box, icon, or option to save the contact. I have tried everything including left and right clicking. Pete","My kids would say I am old school - guilty!Unfortunately, that's a kiss of death in today's technology.Whether we like it or not, technology changes very quickly nowadays, because that's how the majority of people want it to be. We all need to learn to accept change on a regular basis. If you don't like change, you'll like irrelevance even less.","And exactly how does that help with my immediate issue? The fact that Microsoft configured their new OS so it’s not possible to easily transfer existing contacts from the old is not my fault. I have made the progression from DOS through every public release of Windows and never had this issue before. I, like many others, will change as needed. But I don’t appreciate being forced into it. ","And exactly how does that help with my immediate issue? ...But I don’t appreciate being forced into it. As I explained in my first reply, Windows Mail is only an interface to your webmail providers. It's very basic software.If you want to add someone to your contacts from an email, and have it work every time, you should be using the original webmail provider, which will make the process pretty much effortless.Unfortunately, we can no longer accept new technology on our own schedule. Microsoft learned that lesson the hard way, which is why there are no new Windows phones, among other examples.","Hi Pete, I've attached a thread where the user is having the same issue, also a screenshot of where the button should be:https:\/\/www.tenforums.com\/browsers-email\/49266-...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Windows 10 Re-activation after a hardware change        I have Windows 7 Professional purchased with 32 bit option. Now I changed hardware like hard disk and motherboard and performed a clean windows 10 Pro installation. On Activation with the Win 7 Pro license key (of above said), it is showing Error (Code: 0xc004f050, Description: The product key you entered didn't worked. Check the product key and try again, or enter a different one.). What should I do now? My current Windows 10 installation is of 64 bit type(as my current hardware can support 64 bit).  ","solutions":["For Windows 10 you need to new Windows 10 Pro licence if you are just upgrading to Windows 10 and did not upgrade during the free period 2015 to 2016.","Hi Bivaw Have you only now just upgraded to Windows 10? If so, the free upgrade period to Windows 10 ended 3 years ago and while a lot of users are reporting they can still activate Windows 10 with a Windows 7 licence key, there is no guarantee that will still work . . .Also swapping out a motherboard can cause problems with Windows activation that the Activation troubleshooter sometimes does not resolveTaking the above into consideration, if it is possible to get Windows 10 activated on your PC, the best option would be to contact Microsoft Support and ask them to help you re-activate your Windows 10 . . .Call\/Chat\/Schedule a Call https:\/\/partner.support.services.microsoft.com\/...Or choose a local Phone Number: https:\/\/support.microsoft.com\/en-us\/help\/13948\/..."]},{"symptom":"Unable to set up windows hello face and fingerprint.        Recently purchased Dell Inspiron 5593, I am unable to set up windows hello face and fingerprint.  It says \" We couldn't find a camera compatible with windows hello face.","solutions":["Hi Manish There are a few models of the 5593, does your model have an Infra-Red Camera and a Fingerprint Scanner to facilitate Facial Recognition and Fingerprint Scanning?Please provide a link to the Page on the Dell website for your exact Model of laptop . . .","Hi Manish There are a few models of the 5593, does your model have an Infra-Red Camera and a Fingerprint Scanner to facilitate Facial Recognition and Fingerprint Scanning?Please provide a link to the Page on the Dell website for your exact Model of laptop . . .Hi Dave,Facing difficulty find the exact product.My model specificationsModel no- Inspiron 5593Ram 8GB500GB SSD hard drive.Fingerprint compatible not sure about IR camera.","Hi Manish There was an urgent System BIOS update released for your system on 19 December, which you probably need to install to get that Fingerprint Scanner working with Windows HelloThere is also an update for the Goodix Fingerprint Sensor on your laptop released on 6 November, which also probably needs to be installedSupport page for your laptop: https:\/\/www.dell.com\/support\/home\/ie\/en\/iedhs1\/...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","Thanks for the info. Ill check it out.","Hi Manish, glad to Help, I hope that gets your Fingerprint Sensor working for you . . .","Hi Manish There was an urgent System BIOS update released for your system on 19 December, which you probably need to install to get that Fingerprint Scanner working with Windows HelloThere is also an update for the Goodix Fingerprint Sensor on your laptop released on 6 November, which also probably needs to be installedSupport page for your laptop: https:\/\/www.dell.com\/support\/home\/ie\/en\/iedhs1\/...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.. Dave, I have updated BIOS. Unable to install Goodix Fingerprint Sensor. Its pops up \"Goodix fingerprint device not found\".","Hi Manish Restart (not Shut Down) your laptop Open Device Manager (accessible by right clicking your Start Button) Do you see a Biometric Devices section in the list and if so, expand that section, do you see the Goodix Fingerprint Sensor listed there?","Hi Manish Restart (not Shut Down) your laptop Open Device Manager (accessible by right clicking your Start Button) Do you see a Biometric Devices section in the list and if so, expand that section, do you see the Goodix Fingerprint Sensor listed there?There is no option like Biometric Devices in Device Manager. ","Hi Manish Your best option is to download that Dell Support Assist App, and run that, if your device does indeed have a Fingerprint scanner (may have been an optional extra) then Support Assist should find that and install the appropriate driver . . .","Thanks for your time Dave. I'll try that."]},{"symptom":"how to import contacts into Windows 10 mail (people?) from a VCard file on a hard drive        just migrated to Windows from Mac.I exported my Mac mail contacts to a hard drive as a VCard file and I'm struggling with how I then import these into Windows 10 People.When I go into People on Windows and click Import Contacts it only gives me options to import them from online sources such as Outlook.com, Exchange, Google, Yahoo or iCloud. How can I bring them all in from the hard drive I've connected?","solutions":["There is no option in the People app on Windows 10 to import contacts this has to be done using the browser interface.Are you using a Microsoft account for you contacts, in outlook.com it shows the option to import contacts from a .csv file after select People and the Manage.Can you explain in a bit more detail the process you are using and the account you are using.","Hi AnthonyThompson_888 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.To import contacts from a single .vcf file into your Contacts folder, open the Contacts folder at the following location in Windows Explorer.C:\\Users\\%username%\\Contacts and check the image attached below for your reference. I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"win 7 pro  win 10 pro        how do I upgrade from win 7 to win 10? I have product key for 10","solutions":["Hi MARVINSANDERS2 Thanks for participating in Microsoft Community, I'm Skypper G. I'm Independent advisor, let me help you with thisYou will need an USB flash drive or DVD to done this process, Please download the ISO Windows 10 from the link below and follow the process mentioned on there:https:\/\/www.microsoft.com\/en-us\/software-downlo...If the media tool does not let you to choose the Windows 10 Edition, doing this should force the installation media to give you the choice of edition to install Create the bootable installation media  Right click your Desktop, choose New - Text Document  Paste the text below into that document  [EditionID]  Core  [Channel]  Retail  Then choose File - Save As, at the bottom of the Save As dialog, change file type to 'All Files' then save that file as ei.cfg (note you must manually add the cfg file extension) Then copy that ei.cfg file into the Sources folder in your Installation Media  Then when you begin the Installation, you should be asked which Edition you want to installFor more info, see: https:\/\/www.askvg.com\/fix-cant-select-windows-1...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hello,You can upgrade to Windows 10 via ISO file.Refer this step-by-step guide:https:\/\/www.kapilarya.com\/how-to-upgrade-to-windows-10-using-iso-fileLet us know if this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP. ","I upgradede from Windows 8.1 64 bit and mistakenly installed Widows 10 32 bit. On installation, it flickered upon startup, until now the screen flickers on startup. I tried several times installing Windows 10 64 bit, but still the screen flickers on startup. Please help.Thanks.","If you have 32 bit and want 64 bit you can only do that with a clean install, but I don't think that will change the flicker that's more likely graphics drivers.If you used the upgrade path from Windows 8.1 64 bit is should have installed Windows 10 64 bit.If you want to change to 64 bit backup all your personal files and install by booting from your install media then when you see a screen with Custom install select that and delete all partitions one by on until you have just unallocated space. Select Next and let the process create what is required. You can install without a licence key initially until you reach the desktop then you need a licence key, so use your Windows 8.1 licence key."]}]}