{"windows":[{"symptom":"login        When I turn on the computer it goes to an acct that is not supposed to be there. This acct was never finished being set up and now it is the first acct when the computer is turned on and takes time for it to go away and use one of the real acct's on the computer ","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.If the account is not used or required you should delete it completely from the computer which will remove it from the welcome screen.You would need to sign in with an administrator account to do this - click START > Settings (the cog) > Accounts > Other users. Then click on the account you wish to delete and choose REMOVE.Regards, David"]},{"symptom":"Default Programs always changed after Windows 10 update        Why are my default applications always changed after a Windows 10 update ? I am really sick of having to change them back to my preferred applications.What right has Microsoft got to constantly change my preferred settings? It is MY computer and I do not wish to use some of Microsoft's applications because they don't suit my requirements.Is this just a case of 'Microsoft knows best - so just accept that' ?","solutions":["What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK","Hi, Thanks for your response - much appreciated...Apologies for not including my OS which is Windows 10 Pro version 1909 OS Build 18363.3.535Kind Regards","Hi Willum, Windows 10 is well known for resetting apps which the user has set by default. Press Win+R keys on your keyboard, the \"Run\" dialog will appear. Type regedit in it.The User Account Control dialog box opens up. Click on YES. The Registry Editor dialog box opens. Go to the following key HKEY_CURRENT_USER\\SOFTWARE\\Classes\\Local Settings\\Software\\Microsoft\\Windows\\CurrentVersion\\AppModel\\Repository\\Packages\\Microsoft.Windows.Photos_16.122.14020.0_x64__8wekyb3d8bbwe\\App\\Capabilities\\FileAssociationsPlease refer to this link: https:\/\/winaero.com\/blog\/prevent-windows-10-fro...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Thank you for your response, however there are two problems....1. There is no entry under ....' \\Packages' for :  'Microsoft.Windows.Photos_16.122.14020.0_x64__8wekyb3d8bbwe'only ..... ParentalControls, PeopleExperienceHost and PinningConfirmationDialog, so I cannot proceed any further in the registry list.2. The link https:\/\/winaero.com\/blog\/prevent-windows-10-from-resetting-your-default-apps\/Does not work - only returns \"This site can’t be reached winaero.com took too long to respond.","Hi willum08, I was able to load it on my end. Maybe you can try at the later time, or you can try to adjust your network settings.This site might need permission on your end. Thanks and regards,","Hi Richard,Thanks for your reply... I did eventually gain access to that website, however, as I mentioned in my last posting, there is no Key '........Microsoft.Windows.Photos_16.122.14020.0_x64__8wekyb3d8bbwe' in my registry listing so I can't proceed......"]},{"symptom":"User Account        I created a new user account and now I can't access the information on my computer and don't see the old place I log in.  ","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.When you create a new account is makes a separate \"profile\" folder for that account which has its own Documents, Desktop, Downloads, etc, etc,.You can find this by going in to File Explorer > This PC > C drive > Users - within there you'll see a further list of folders representing each of the user accounts that exist on the computer. Within each of these will be the various profile folders.However unless you've deleted the previous account you can also switch back to it - just click START - then 4 icons up (directly above START) click the small round profile icon and choose Sign Out. That will return you to the Welcome page where you can click the name of the previous account and switch back to that. Regards, David"]},{"symptom":"GAMES lost in pc        I have tried to find my games on my PC since 2013 and it appears that I am not the only one.  I keep getting answers from Microsoft stating they found an answer.  It has been 6 years and my downloaded games are still not found.  I tried various things you all suggested but none did the trick.  Maybe this will help all the people with this problem:  BLUESTACKS APP PLAYER.   It did work for some of the games but it was slow.  I only play the simple, mindless games.  It seems it was more for the real serious heavy duty ones.All the times I get an email it states on my new pc but my pc is not new.    I put in Microsoft Garage (I don't ever know what that is) but I had to pic a category to be able to submit.* Moved from garage","solutions":[]},{"symptom":"Windows 10 | Cursor Freezing         Hi, so recently I started having issues with my mouse, where the cursor stops working while playing games or really doing anything. I'll be in the middle of something, when all of a sudden my mouse stops working. The mouse won't start working again unless a slide it around really fast. The mouse has LED's in it, and when the cursor stops working the LED's continue to change color, which makes me think that it doesn't turn off. The mouse I use is a  'LVL UP Gaming Mouse,' seen at this link - https:\/\/www.ebay.com\/p\/28035380019?iid=323991515270&chn=ps&norover=1&mkevt=1&mkrid=711-117182-37290-0&mkcid=2&itemid=323991515270&targetid=474173459669&device=c&mktype=pla&googleloc=9013250&poi=&campaignid=6469981107&mkgroupid=79220281122&rlsatarget=aud-622524042958:pla-474173459669&abcId=1141176&merchantid=138366336&gclid=Cj0KCQiAgebwBRDnARIsAE3eZjRAOBhA85u6TnZVConzRGE7sKPbzXcYG4JzpYfm8vzNERXiaUzTKYkaAoaMEALw_wcBIf anyone knows any solutions, please answer.                                                                                                            Thanks, SkeludEdit | The issue appears to only happen while playing games, which might have something to do with RAM.","solutions":[]},{"symptom":"Windows 10 Download        Hello.Can someone help me? Am getting this error attached while trying to create a media file for windows 10.","solutions":["Hi, My name is Will i'm an independent adviser. That error usually indicates that your account doesn't have access to the drive or folder that it being read from or written to. In this case it may be related to where the installer is located, or that you don't have permission to write over the drive you are trying to make your boot media on. I would recommend running this program as an administrator and see if that resolves the issue. This can be done from the context menu (right click on the exe).If this error is still occurring afterwards we might need a bit more information to troubleshoot further, Is this error occurring before or after you choose your drive in the setup process?"]},{"symptom":"Code 56 appearing on all network adapters and \"This app can't run on your PC\"        This is the laptop model\/specs, nothing in it changed:https:\/\/www.bhphotovideo.com\/c\/product\/922982-REG\/acer_nx_m49aa_023_intel_i3_3227ub_6gb_ddr3_500gb_hd_15_6.html\/specsAs far as the code 56 goes - I've tried everything google can suggest and nothing fixed it. 1. Network reset2. Refresh install(keeping files)3. Refresh install(full wipe)4. CHKDSK scan - went on for hours \"fixing C:\" but didn't fix it.5. Troubleshooting(Network Adapter, incoming connections)6. Downloading drivers from main pc to laptop and trying to install them(timed out everytime)7. Checking if it somehow had a VPN(I've never used a VPN, couldn't find any)8. Using a wireless network adapter(also got code 56 but works fine on main PC)9. Disabling firewall, antivirus.10. Booting into safe mode with internet11. SFC scan -it found corruption but couldn't fix it. It's always had these \"corruptions\" because it's an old laptop.12. NOTHING in the \"Network Connections\" folder. 13. Uninstalled\/disabled and reenabled\/reinstalled adapters in Device ManagerHow this happened was: Over the last few months the laptop has gone into a reboot with scan which promptly made it unable to boot into windows 10, at which point I did a \"refresh install keeping files\" and it would be ok again, except this time..it wasn't. There was no internet connection to be found, even after doing a refresh install full wipe back to fresh install.Secondly: For a few weeks now I've gotten this error message every time I boot the laptop up, this happened even after the full wipe refresh install and I have no idea how to identify what app is causing the \"This app can't run on your PC\" message. Here's all the screenshots of said problem(IMGUR said files were too big): https:\/\/drive.google.com\/drive\/folders\/1549Bja3q2pkaV0XbP0QKyzSzdWW6JFLy?usp=sharingI just need this laptop to work a little while longer until I can afford a new one, unfortunately buying a new one isn't an option at the moment. ","solutions":[]},{"symptom":"The \"Settings\" window got automatically closed every time I tried to open it        When I open \"Settings\", the \"Settings\" window open, and after 1 second, it was automatically closed! I tried many method (using Admin Powershell) from online forum, but doesn't help...I tried the windows restore, but restore to all previous timepoints failed... Do I have to RESET windows? Thank you!","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.First option may seem obviously - but restart Windows. Specifically go in to the START > Power > Restart option rather than choosing Shut Down. Restart does a different process from Shut Down and might help.If you aren't already on the latest version of Windows 10 (which is 1909) it would be worthwhile upgrading to that anyway, plus it may help this problem. If you visit the following web page and follow the instructions to upgrade it's pretty straightforward:https:\/\/www.microsoft.com\/software-download\/win...There's also the possibility that the problem relates to your user account somehow - try the above options first, but if none of that works there's some more specific troubleshooting options explained here:https:\/\/www.maketecheasier.com\/fix-settings-app... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Regards, David"]},{"symptom":"Windows features on-off        which windows features should be on or off in windows10 home x64","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Unless you are having a specific issue or requirement the features should be left in their default state. Is there a particular reason you are asking this?Regards, David","Hey David thanks for the response I was trying to install the Windows Defender security feature for online protection and they told me I needed to turn it on in the windows features console box when I went to it it wasn't available then went to the windows power shell (administrator) and copied and pasted the text that Windows Support gave me and still didn't show up in the windows feature console ","I upgraded from Windows 8.1 to Windows 10 and I'm not sure if I prepared Windows 8.1 for the update but Microsoft told me that I was ready to go so I upgraded anyway I'm one of these people that love to tinker with every little thing and thinks I can get my viewing pleasure better I mostly do it because I like to stream from the Internet and I always think that I could make my computer and my experience better","The security features are an integrated part of Windows 10 - there would usually be no need to install them manually. Upgrading from 8.1 to 10 should not present any problem really.If you go START > Settings {(the cog) > Update & Security > Windows Security - what does it show there? You can also click on Virus & Threat protection for further information.Also if you have an alternative antivirus solution installed (Norton, McAfee, AVG, Avast, etc.) the built-in Windows antivirus will take a back-seat automatically."]},{"symptom":"Pen and Windows Ink Setting Missing After Windows 10 Update        my pen & windows ink setting missing like this:","solutions":["Hi vahidrezasaeinasab My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.What is the exact make and model? Open Start, type: system information Hit Enter Click System summary Look in the right pane Copy the system sku info into reply here. See example: https:\/\/imgur.com\/qzektpAIts like you need unpair the pen then pair it again. Click Start > Settings > Devices > Bluetooth & other devices Click on the pen Unpair it Restart then pair it again. Which version of Windows 10 is currently installed? See how to verify: https:\/\/answers.microsoft.com\/en-us\/windows\/wik...","Hi Dear AndreMy system is surface book and my windows versionis 1903(os build 18362.295).I unpaid the pen and pair it again 2times but my problem doesn't resolve.In pen & windows ink menu some itemes is missing and my pen doesn't write . (I send photo ) but  my surface pen connected and top button is working fine but does not write. I want this menu:","I am seeing this also on my Surface Pro 3 also with my Pen. This could be a bug or glitch.Could you try the following steps by Microsoft MVP, Barb Bowman in the following thread?https:\/\/answers.microsoft.com\/en-us\/surface\/for...If that does not work... I would also recommend you file a bug report; send me the short link so I can vote on it and bring it to the attention of the Windows engineers.https:\/\/windows10.help\/blogs\/entry\/54-how-to-su...Information in the above link is sourced from a trusted Microsoft MVP blog.","I have this exact problem.  My pen also does not ink.  The touch screen works but not with a pen.  I have received a new pen and that also doesn't work.  Tried everything.  All updates are up to date.  Things seem to have disappeared.  ","I have the same problem, already tried these step and can not solve.  I had to remove the latest windows update for the pen to work again, but I would like to update my windows, what should I do?","I have this exact problem.  My pen also does not ink.  The touch screen works but not with a pen.  I have received a new pen and that also doesn't work.  Tried everything.  All updates are up to date.  Things seem to have disappeared.  ","Tenho esse problema e somente foi resolvido voltando a atualização do windos, ou seja, se atualizar o problema aparece!!! A MS tem que consertar a atualização do windows para as nossas máquinas!","Is there a solution to this problem? I have the exact same issue","a solution would be helpful. I have the same issue. The pen settings only show a very limited number of options (same as the picture of the first post). My surface does respond to the pen. For example, if I click the top button twice it makes a screenshot. However, the screen does not respond to the pen.- Uninstalling all latest windows updates did not work for me.- Unpairing en pairing again did not work for meI have windows 10 (winver 18362.418) installed on my surface.","a solution would be helpful. I have the same issue. The pen settings only show a very limited number of options (same as the picture of the first post). My surface does respond to the pen. For example, if I click the top button twice it makes a screenshot. However, the screen does not respond to the pen.- Uninstalling all latest windows updates did not work for me.- Unpairing en pairing again did not work for meI have windows 10 (winver 18362.418) installed on my surface.The only solution that worked for me (after trying everything I could think of ) was to back everything up, wipe it clean and re-load the system and then my backed up data.  The technician with Surface took me through it over the phone.  Hope that helps."]},{"symptom":"default \"Documents\" folder        Can someone help me change my default \"Documents\" folder setting?What happened, I believe, is that when I was first installing W10, I was happily clicking through the setup checkboxes, asking if you want this there and that here, and something else over in this place.At the time, I had on my D: drive a folder, \"b\", in which I was keeping dozens of folders--most of which were documents.  (Some subfolders contains graphics only, and some upper level doc folders do, too.)Well, W10 changed my default folder for installed apps to the D:\\b folder.  And W10 renamed the folder from \"b\" to \"Documents\".  In fact, with any update, even though I rename \"Documents\" to \"b, W10 again changes the name from \"b\" to \"Documents\".Now, docs from an app such as WordPerfect go into the D:\\b instead of on the C: drive.That means that several apps that normally place their subfolder docs on the C: drive now go to the D: drive, and in the top level \"b\" folder.I know enough to edit the registry, but I don't know enough to know what to change there in order to fix this recurring mistake.","solutions":["Hi Bob, Click your Start Button, type regedit and hit Enter to open the Registry Editor Click View and make sure 'Address Bar' is turned on Paste this into the Address Bar at the top and hit Enter HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell FoldersPlease provide a screenshot of the resulting Registry Editor window and please explain where exactly you want your Documents folder to end up . . .","DaveM121,Thanks so  much for your immediate help.I'm inserting the screen shot below, and where I want the info to go is to:%USERPROFILE%\\Downloads%USERPROFILE%\\Documents%USERPROFILE%\\PersonalAs you will note, there are two \"%USERPROFILE%\\\" slots at the top of the entry for \"d:\\Downloads\", then one for \"d:\\b\" and then another for \"d:\\b\" further  down.I do not want anything to go to d:\\b.Comparing my screenshot below with a registry on another machine, its registry only shows one %USERPROFILE%\\Downloads.After making the adjustments in the registry, am I correct in assuming I'll need to physically move the folders now on D: to the C: folders? or will I have to reinstall the programs?Again, thanks.","Hi Bob %USERPROFILE%\\Personal is a value that should not exist Have you already made the following changes, if not set these values Personal: %USERPROFILE%\\Documents {F42EE2D3-909F-4907-8871-4C22FC0BF756} %USERPROFILE%\\Documents {7D83EE9B-2244-4E70-B1F5-5393042AF1E4} %USERPROFILE%\\Downloads {374DE290-123F-4565-9164-39C4925E467B} %USERPROFILE%\\Downloads Then restart (not shut down) your PC, you may then need to move the contents of the folders on D\/b into the correct folders (Documents and Downloads) but do not move the actual folders, once you have made the changes and moved the contents, you can delete the downloads and b folders form your D Drive . . .","Thanks, DaveM121.I have not yet made any changes.  For clarification, (please alert me if this is the wrong thing to do), I need to:delete the \"%USERPROFILE%\\Personal\" entryand then change the other entries to what you listed, namely:{F42EE2D3-909F-4907-8871-4C22FC0BF756} %USERPROFILE%\\Documents{7D83EE9B-2244-4E70-B1F5-5393042AF1E4} %USERPROFILE%\\Downloads{374DE290-123F-4565-9164-39C4925E467B} %USERPROFILE%\\DownloadsThen do the rest of what you instructed, i.e., restart and then transfer the folder contents.  BTW, I do not want to eliminate the preponderance of the folders in \"b\".  There are approximately 450 that belong there.As for those \"foreign\" folder contents, they have names, such as \"Audacity\", \"Corel user files\", \"FormatFactory\", etc.  I count 12 that have been installed by various apps. Should I move those, or create new folders with the same names and then transfer the files?Or do I need to reinstall those apps so that all their registry entries (if they have such--here is some of my ignorance) will align with the corrected registry?","Hi Bob No don't delete anything, (I thought you had already set Personal to Userprofile\/Personal . . .Here are the steps: 1 Double click Personal, then set its value data to this and click OK: %USERPROFILE%\\Documents 2 Double click {F42EE2D3-909F-4907-8871-4C22FC0BF756} then set its value data to this and click OK:%USERPROFILE%\\Documents 3 Double click {7D83EE9B-2244-4E70-B1F5-5393042AF1E4} then set its value data to this and click OK:%USERPROFILE%\\Downloads 4 Double click {374DE290-123F-4565-9164-39C4925E467B} then set its value data to this and click OK:%USERPROFILE%\\Downloads 5 Restart (not shut down) your PC 6 Move all files and folders from D:\\Downloads to the correct Downloads folder, move all files and folder from D;\\b to the correct Documents folderThis includes all those 'foreign' folders (Audacity . . etc.) the registry entries should just point to your user profile documents folder, not a specific folder. If that software does not work when this process is completed, then that will need to be re-installed . . . Delete Documents and b from your D drive . . .","Okay, I'm almost there.  I will do the registry corrections as listed above.However, I presently do not have a \"Documents\" folder on D: drive.   W10 renames \"b\" to \"Documents\" with any update that looks after needed corrections.And the \"d:\\b\" folder contains 100 folders and hundreds more files, many of which will be shortly categorized and moved.So I don't want to delete that entry on D:, but I suspect, from what you've laid out for me, that that folder, \"b\", won't be a problem for the registry to handle.Thanks so much for putting up with me.","The easier solution (thanks Microsoft!!!!!!!) is to restore to factory and go through the windows setup again to select the right options.","Hi Bob I am sorry, I was offline . .. It is up to you, if you want to move Documents back to its original location or leave that on D, wither way, whatever value is set in that registry key is the location Windows and Windows updates will work with . . .","  W10 renames \"b\" to \"Documents\" with any update that looks after needed corrections.And the \"d:\\b\" folder contains 100 folders and hundreds more files, many of which will be shortly categorized and moved.So I don't want to delete that entry on D:, but I suspect, from what you've laid out for me, that that folder, \"b\", won't be a problem for the registry to handle.Thanks so much for putting up with me.With D:\\b\\ no longer designated as your Docuemts folder, it shouldn't be renamed. If it's currently displaying the name 'Documents', open the folder, Shift+Right-click inthe background & select Open PowerShell window here, and type:ri desktop.ini -forceKeith","Thanks so much, DaveM121, for the help.  I followed your instructions, and got everything fixed.  I did this the other day, after your notice of being offline.No problems, and you undoubtedly saved me hours of time with those easy registry fixes.EVERYTHING'S GREAT!!"]},{"symptom":"I just reinstalled Windows 10 pro 64, and i need help with what to do next to be able to play games.        Please help me, i am desperate about this matter, can't even sleep properly since then, because i am a little depressed, sad, i bought this laptop and these nice games and cannot play them.2 weeks ago i was starting a game, then blue screen and Windows crashed, restarting loop and I had no other choice but to reinstall it, i couldn't fix it or go back cuz no restore point available.I installed my Windows again and i wasn't able to install my nvidia driver, i did try again and again till i went past 30 reinstallings, so i have no ideea what to do.My Windows is Windows 10 pro 64 OEM.My laptop is lenovo legion y520-15ikbn with i5 7300 hq, gtx 1050 4 gb and 8 gb ddr4 ram, 1 tera hdd.Is really annoying because everytime i try to even set nvidia as my desired driver from device management, intel takes over and games Works like shhhheeeeeet with intel hd, all low and low resolution, damaging my eyes constantly, i feel in some games like i am playing doom 2 or minecraft, but on lowest resolution, and fps in majority of my games are with this intel hd 630, only 20-30, but is dropping down to 10 fps lots of times, laggs and ...but is still playable, a little.Here is a list with everything i did try so far, by myself, in the first week, till i gave up for a bit and played some games with this hd 630...:I contacted nvidia support, they told me to download their driver, they even gave me a link to it, i downloaded it, installed it, the driver asked me for restart and then Windows required a reinstall, after 2-3 hours of waiting, watching the Y logo of lenovo legion Y250, and some dots that appear and dissapear.Then they told me to go on lenovo site to update my drivers, so i went to support center and when i did try to update my my bios, again Windows crashed, blue screen, restarting loop for more than 1 hour, nothing else but to reinstall it again.Then i talked with them again and we reached the conclusion that this is not an nvidia matter, but i have to talk with microsoft or lenovo.I did play some games from steam only since last week, kinda struggling with low fps and resolution, laggs and etc, thinking myself what and how to do, while doing my daily stuffs, like working, watching a movie, some you tube clips, sleeping.......Today when i went to write some stuff on a document, i observed that i downloaded nvidia driver, notebook, this is what i thought, when i downloaded it first time, 2 weeks ago, since my windows crashed.I downloaded it only once, in January when i bought my laptop, Windows and some new games, installed Windows, drivers, games and played so far all good till 2 weeks ago.I also did try with the dch driver type, but that gave me error.I didn't try with standard, i thought that was for pc only, and now i remembered that laptops are as pcțs but portable pc. I am thinking of trying the standard version next week, monday or tuesday, now i just installed like 500 gb games from my steam library and some demos and i am still about to conclude some demos, and i wait to finish collecting everything from the event from rocket League.With my nvidia driver installed, i was able to play on max settings most games, like battlefield 4, assassin's creed 4, gta 5, rise of tomb raider, soul calibur 6, fifa 20, pes 20, jump force on med settings, r6s on low settings with 90+ fps and so on.I bought my laptop in January, so i can still use the waranty, but i'd like to find a solution to my installing problems, or at least i try to, in a week, if i cannot do a thing till then, i just give up and send it to store, or change it with a pc if possible, around the same price. Btw, Tera worked kinda on med settings, with lenovo's default driver in January, and once i installed the geforce experience, worked just great with all settings and everything on highest, 40-60 fps, far cry 4 was ok too, rare lags, very rare but in gta 5 for example, i was able to play just fine for only 20-30 minutes, then starts lagging and very huge fps drops, maybe cuz it was in summer and i didn't get a cooler so far, no ideea.Also I don't think that my gpu is broken, phisically, because is tied with cpu and cpu still Works just fine.I did try  4-5 days ago to install nvidia driver again and i was able to enter in 2 demos, in one Windows crashed the instand i clicked it, then i could restore, and in the other demo i got in menu, clicked start demo and then Windows went back to restore again.","solutions":["Hi? I have the same problem? Is it ok now? Thanks in advance"]},{"symptom":"Bugcode NDIS Driver Error on New Install        I built my first computer, which has already proven to be a challenging task, and just when I finally think everything is good to go, Windows 10 decides that I can't continue. Upon trying to install using the Media Creation tool, once it installs, it will go through the entire install, restart and put me in an endless loop of restarting, first starting with a blue screen with the error code \"BUGCODE NDIS DRIVER\" with nothing else, and then a popup screen that says Your computer unexpectedly restarted and Windows cannot proceed with the install, your computer must be restarted.I've done as much research as I possibly can and have tried the following:Formatting the USB drive I used as Exfat, NTFS, quick format and \"non-quick\" formatUsed a different USB driveUsed an SD CardTaken out all Ram sticks except for 1Taking out M.2 of DIMM slotInstalled from front panel of case, and back panel of case straight into motherboardUpgrading my BIOS (Current BIOS is 0207)Switching out both cables to the SSD I'm trying to boot fromOpening up a prompt to see if I could edit the registry (I don't have all the folders that I've seen in other forums and screenshots)Letting it restart forever until I lost my mindIn another forum, I read that you can somehow install old drivers? How would I go about doing that without ever having been able to even start up Windows on this computer? Where would I get the drivers?Please help as I am desperate at this point. I spent thousands on this build and just need it to start so I can do my jobBuild is as follows:ASUS ROG Zenith Extreme Alpha X399 HEDT Gaming Motherboard AMD Threadripper 2 (TR4)ASUS ROG STRIX GeForce RTX 2080 8GB Graphics Card (with a PCI-E cable running into the motherboard as I have mounted it horizontally in the case)AMD Threadripper 1950x 16 Core Processorx4 Corsair Dominator Platinum 16GB DDR4 3200MHz C16 RAMSamsung 860 QVO 1TB SSD (Boot Drive)Enermax Liqtech 360 TR4 II Liquid CoolerCorsair RM1000x Power SupplyAll housed in a Thermaltake View 71 Tower Case","solutions":["Hi Jacob My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.If you are Performing a Clean Install by Booting from the Windows 10 install disk:Try simplifying your configuration by keeping only your mouse and keyboard attached, that means:Disconnecting multiple display monitors. Remove discrete video cards, use the on-board graphics if your motherboard supports it.Swap out memory modules - a RAM module might be corrupt - you can also ensure RAM sticks are installed slots 1 and 3. Your RAM modules might be corrupt, try scanning them for errors.https:\/\/www.groovypost.com\/howto\/use-the-memory...If you have more than one hard disk installed, disconnect all except the target disk where Windows 10 will be installed.Reset your BIOS Defaults. https:\/\/www.groovypost.com\/howto\/reset-pc-bios-...Disconnect all external devices, since connected devices can sometimes confuse setup.If setup is successful after performing these tasks, you can reinstall each removed component.Information in the above link is sourced from a trusted Microsoft MVP blog.","Hey Andre! Thanks for such a quick reply!I only have my mouse and keyboard attached, nothing else but the USB flash drive I'm using to install Windows 10 and one monitor.By swapping out memory modules, are you referring to the sticks of RAM? As in try different ones? I currently have 4 of the one I listed above and removed 3 of them to simplify the configuration. How do I scan them for errors if Windows has never started on this computer? Is there a way to do that in the UFIE screen or by keying into a command prompt?I did have an M.2 in the motherboard through the DIMM slot, but I removed that and tried again with no luck.I can try resetting the BIOS and see if that worksIs there any other information you can provide me with?Thank you again so much.","I was recommending trying each RAM module at a time, but looks like you already tried that.You could go on another working computer and make a bootable copy of Memtest then scan the memory modules.Here are some instructions: https:\/\/www.memtest86.com\/technical.htm#winYou can also try resetting the BIOS to see if that works. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I tried this with no luck unfortunately, however, I decided to use a Windows approved flash drive and ditching the media creation tool, and this solved the problem. So not sure if there's something wrong with Windows's media creation tool or not, but I was able to get past this by using their first party drive.","I've encountered the same problem today with the same motherboard in a build that I did today for a friend. It seems the problem is caused by the on-board WiFi adapter. If you go into the UEFI setup menu, under Onboard Devices Configuration and disable the Wireless LAN option, then Windows should install and boot just fine. I haven't figured out yet how to get this device working under Windows since it will blue screen even when starting up after installation is done. But so long as you can live without wireless LAN, everything else will work fine including Bluetooth.","I've encountered the same problem today with the same motherboard in a build that I did today for a friend. It seems the problem is caused by the on-board WiFi adapter. If you go into the UEFI setup menu, under Onboard Devices Configuration and disable the Wireless LAN option, then Windows should install and boot just fine. I haven't figured out yet how to get this device working under Windows since it will blue screen even when starting up after installation is done. But so long as you can live without wireless LAN, everything else will work fine including Bluetooth.Thanks for that, had the same error and disabling the Wi-Fi device on my Asus X299 Rampage did the trick. Seems it's a Asus Wi-Fi problem and not a particular mobo.To get Wi-Fi working again I installed drivers from Asus website where they have noted that this may be a problem.  Then I enabled Wi-Fi device in bios. Working fine no blue screen.","Just found this , seems it's a problem with the Wi-Fi device and Windows 10 RS5 or later","Thank you (Jesse)!  You guys are awesome. I spent a long time on tech support and trying to figure this thing out and then ran in to this thread.My build is below so if people search may be they will find this. I have a different motherboard than yours.Asus x299 Deluxe IIIntel 9960xWindows 10 Pro on USBBe Quiet! Dark Base Pro Rev.2 (Orange)I went in to bios. Click on Advanced. Go to Onboard Device section and open it up and then scroll and find the 802.11ac Wifi and set to DISABLED.  hit F10 to save and quit.  I then had to do an F8 Boot off the USB and full install again (I have like 4 or 5 installs now!)  This got through and I'm currently in windows trying to deal with new issues. ","Another Blue Screen Here I am not sure what it is creating the problem but I have Asus Alpha Zenith Extreme Edition is anybody has an Idea what could be?  Thanks","I mean did you try whats stated above?  I put instructions in my previous post. Go to your bios and find the wireless adapter and shut it off and see if that does the trick. It did it for me on My Asus x299 Deluxe II."]},{"symptom":"Computer wakes from sleep automatically every night        I put my computer to sleep before going to bed, but the signon screen is brightly lit every morning. Furthermore, when I launch Windows Update, it never seems to finish searching for new updates. In searching for a cause of the waking, I have come across the following potentially useful information. Any assistance will be greatly appreciated.>powercfg -lastwakeWake History Count - 1Wake History [0]  Wake Source Count - 1  Wake Source [0]    Type: Wake Timer    Owner: [SERVICE] \\Device\\HarddiskVolume3\\Windows\\System32\\svchost.exe (SystemEventsBroker)    Owner Supplied Reason: Windows will execute 'NT TASK\\Microsoft\\Windows\\UpdateOrchestrator\\Universal Orchestrator Start' scheduled task that requested waking the computer.***Modified title from: windows 10 wakes from sleep EVERY night and the screen stays on until morning***","solutions":["I think i found a fix that doesn't require downloading anything or complicated steps. It's worked for me so far.1.  Go to: Control Panel\\Hardware and Sound\\Power Options\\Edit Plan Settings (it may also be called Change plan settings)     (you can alternatively just search for \"Edit power plan\" in the windows search bar)2. Click \"change advanced power settings\"3. Go to \"Sleep->Allow wake timers\" and change the setting to Disable.If this doesn't work, then using psexec like RichStevens2 suggested might be the way to go.The directions i found on another forum was helpful:\"1. First go here to download PsTools. Extract it to a folder on your desktop. 2. Open Start and type cmd. Right-click the program and choose to run as administrator.3. Navigate to the folder where you extracted the tools by typing \"cd C:\\Users\\Username\\Desktop\\Pstools\", replace Username with your username and Pstools with the folder where you extracted the tools.4. When you have navigated to the correct folder, copy the following command without the quotes: \"psexec.exe -i -s %windir%\\system32\\mmc.exe \/s taskschd.msc\".5. Open the command window and right click, choose paste. Press enter.6. Navigate to Task Scheduler Library -> Microsoft -> Windows -> UpdateOrchestrator.7. Right click the task called Reboot and click on Disable.8. The task should now be disabled\"Hopefully one of these two options works for ya'll"]},{"symptom":"Widows 7        I ordered a new computer that won't be delivered for about three weeks. My current computer is 8 years old and can't handle Windows 10 anymore (I did the free upgrade from 7). My current computer doesn't have enough memory to run Windows 10 and Star Wars KOTOR 2. I started having problems with it after the 1800 cumulative updates. Would it be safe to downgrade my 8 year old computer back to Windows 7 without connecting it to the internet?","solutions":["No computer is safe on the Net unless it is properly protected with a good AV and also on-demand scan anti-malware products such as the free Malwarebytes.If you're looking for information for home users, see Windows 7 support will end on January 14, 2020.With end of support Microsoft is not telling you that your operating systems won't work.What they are saying is that after a certain date they will no longer support them.Whether they still work or not with particular programs is up to the particular program manufacturers.Example: Google Chrome is no longer supported for security updates in XP or Vista by Google and Mozilla Firefox is following the same path.What this basically means with Microsoft no longer supporting an operating system is that even though hackers may find \"holes\" and vulnerabilities to be able to access the operating systems and cause security problems, Microsoft will no longer be monitoring or rectifying those problems by way of Security Updates each month.You are on your own in regards to maintaining the Security of your operating systems.What does it mean if Windows isn't supported?____________________________________________________This will show you when support (Mainstream and Extended Support) for the various operating systems ends.Windows lifecycle fact sheet - Windows Help - Microsoft SupportAnd these FAQs show you how Microsoft arrived at the Support Lifecycle Policy:Microsoft Lifecycle Policy FAQhttps:\/\/support.microsoft.com\/en-au\/help\/17140\/lifecycle-faq-general-policy-questions@@@@@@@@@@@@@@@@@@@@@@@"]},{"symptom":"why does Windows 10 keep refreshing        I will have a folder open and trying to work in it. My folder will freeze up and at the top it will turn dark, then my Windows 10 keeps refreshing. I am getting so tired of this. It happens constantly I can't get anything done. When it refreshes everything goes away and I have to put my password in to get back to windows. What is going on, need to get this fixed.","solutions":["What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK","Version 1903 OS Build 18362.535","Hi Verna, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Try the following: 1.- Start Windows through a clean boot, it is an error-proof process, which allows us to detect if any third-party program or driver is generating the problem. If the problem does not happen you can go to the section >> How to determine what is causing the problem after you do a clean boot https:\/\/support.microsoft.com\/en-us\/help\/929135...2.- Apply the scan to your computer to remove corrupt files that may be interfering with Windows processes.https:\/\/support.microsoft.com\/en-us\/help\/929833...3.- You can perform a Windows 10 repair update. The repair update corrects all Windows errors and retains all files, applications, and settings. (However, a backup is always a good idea), this in case you decide to run this process. These are steps that the Windows MVP shares on its website. https:\/\/www.tenforums.com\/tutorials\/16397-repai...Let me know if you have something else that I can help you with, I'd be happy to help.Happy nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","well I have tried almost everything listed here except for the repair update and not really sure how to do that. After everything it is still doing the same thing. Was really hoping I could fix it myself as I cant afford a company to work on it and most of them can't fix it right anyway. Thank you for all the help you gave to me.Verna","Hi, You're welcome, we're here to help. Regards"]},{"symptom":"SSD showing up as HDD in device manager        Hi,I just installed a Samsung SSD 2TB drive.  I already have two 2TB and 1TB SSD drives and one old Western Digital 2TB disk drive insatlled.  My new SSD drive is working properly.  I was able to format it and move files to it, but it shows up as a Western Digital hard drive in Device Manager.  My new drive is listed properly in the BIOS as an SSD drive.  Is there any way to fix this?  Thanks.Zaffer","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.This is just the terminology used in device manger, it doesn’t affect the speed your drive’s read\/write speed or anything like that.Regards, Ross","Thanks Ross, Is there any way to make device manager display the right information? Thanks.","Hi,You could try run the following command from an administrator command prompt to reassess your system but it’s not guaranteed to change the device manager listing:winsat formal Regards,Ross","Hi Ross, Running winsat formal didn't work to correct the device manager listing, but I found something that did.  I went to Device Manager, to the Driver tab and clicked on Uninstall Device.  Then I restarted and the disk listing was correct.  Thanks Again.Zaffer"]},{"symptom":"Windows Hello Not Working,(We couldn't find a camera compatible with Windows Hello Face)        All of a sudden my Windows Hello has stopped working and on the lock screen it says, \"sorry something went wrong, please enter PIN\" and in settings it says We couldn't find a camera compatible with Windows Hello Face. what do I do?","solutions":["Anyone?","Hi LucaMelfi, my name is Hadrien, an independent advisor and I'll do my best to help you today.Please try the following procedures to fix your Windows Hello. Check if the issue is solved at the end of each procedure :Procedure 1 : 1) Open File Explorer, navigate to C:\\Windows\\System32\\WinBioPlugIns\\FaceDriver 2) Right-click on HelloFace.inf and click \"Install\" 3) If the file exists do the same thing for HelloFaceMigration.inf in the same directory-------------- Procedure 2 : Check on your camera manufacturer's website if there is any update available for your camera.For example if you have a Logitech camera check on the Logitech website for any update for your camera.------------ Procedure 3 : Click on Start button, type \"cmd\", right-click on \"Command prompt\" and click on \"Run as administrator\".Copy-paste the following lines in the command prompt, one by one, pressing Enter after each line (to paste right-click at the top on \"Administrator : command prompt\" > Edit > Paste) :DISM.exe \/Online \/Cleanup-image \/Restorehealth sfc \/scannow -------------- Procedure 4 : 1) Click on the Start button, type \"run\" and click on \"Run\" 2) Type \"services.msc\" (without quotes) and click on \"Ok\" 3) Find \"Windows Biometric Service\", double click on it and click on \"Stop\" 4) With File Explorer go to C:\\Windows\\System32\\WinBioDatabase and make a backup of all the files just in case. Move that backup outside of that folder.5) Once backed up delete all the files in C:\\Windows\\System32\\WinBioDatabase 6) Open another time \"services.msc\", double-click on Windows Biometric Service and restart it7) Go to Start, type \"settings\", click on \"Settings\", go to \"Accounts\", \"Sign-in options\" and register the Face data again------------- Procedure 5 : Try Greg Carmack's solutions that you didn't do already : (scroll down to see his answer) :https:\/\/answers.microsoft.com\/en-us\/windows\/for...-------------- Procedure 6 : Perform a repair upgrade of Windows following this guide : https:\/\/answers.microsoft.com\/en-us\/windows\/for... Regards, Hadrien","Hi LucaMelfi, I'm sorry the links were broken in my first answer : Here's the good link for Greg Carmack's answer : https:\/\/answers.microsoft.com\/en-us\/windows\/for... And here is the link for the repair upgrade guide : https:\/\/answers.microsoft.com\/en-us\/windows\/for... Regards, Hadrien","HelloFaceMigration.inf no this file my computer.","HelloFaceMigration.inf No this file.","I was able to solve my problem!I had the same problem.  Mine started after either a windows update or Norton security updating something on my computer, then my surface studio could not recognize my driver for my hello windows.  So I thought I could just uninstall it and restart windows and it would just refresh and reinstall the driver for the camera and the biosecurity stuff but it didn't so I ended up searching the web but I eventually solved it after reading so many forms.I followed these steps.  Step one did not work for me, but step 2 did. I had to re-register my face after deleting the data due to method one:Method 1: Resetting Windows Hello Biometric DatabaseYou can try resetting the Windows Hello Biometric Database and check if that helps. Please follow the steps mentioned below:Press Windows key + R, to openRun dialog box.Type services.msc and click onOK.Look for Windows Biometric Service, double click on it and click onStop.Now, go to C:\\Windows\\System32\\WinBioDatabase, take a backup of all the files inside theWinBioDatabase folder.After taking a backup of the files, delete all the files.Now, open Services by following step 1 and 2, and restart theWindows Biometric Service.Go to Start >> Settings >> Accounts >> Sign-in options and register the Face data again.Method 2: Installing Windows Hello Face DriverIf method 1 didn’t help. You can try to reinstalling the Windows Hello Face Driver. Follow the steps mentioned below:Press Windows key + E, to openFile Explorer.Navigate to C:\\Windows\\System32\\WinBioPlugIns\\FaceDriverLook for HelloFace.inf andHelloFaceMigration.inf file, right click on each file and selectInstall.Restart the computer.","we couldn'find a camera compatible with windows hello face"]},{"symptom":"Forza Horizon 4 won't launch        It ran great until I bought the Ultimate Add-Ons bundle, now it simply crashes after showing the splash screen for 30 seconds.From the event viewer:The program ForzaHorizon4.exe version 0.0.0.0 stopped interacting with Windows and was closed. To see if more information about the problem is available, check the problem history in the Security and Maintenance control panel. Process ID: 121c Start Time: 01d583bbce819799 Termination Time: 4294967295 Application Path: C:\\Program Files\\WindowsApps\\Microsoft.SunriseBaseGame_1.351.461.2_x64__8wekyb3d8bbwe\\ForzaHorizon4.exe Report Id: b51b6c95-35dd-4832-9833-a776463cae39 Faulting package full name: Microsoft.SunriseBaseGame_1.351.461.2_x64__8wekyb3d8bbwe Faulting package-relative application ID: SunriseReleaseFinal Hang type: ActivationEdit 12\/13\/2019: After installing the latest update last night, the game seemed to start fine. I will continue to update this post with status.Edit 12\/14\/2019: The game no longer starts.Edit 12\/28\/2019: See user realcoda's post on page 5 for a solution. Be sure to back up everything on your PC before attempting as it involves editing your registry.","solutions":["Hi, NateOlson1 My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Try to reset app by right clicking on Forza Horizon 4 > More > App Settings > \"Terminate\" then \"Reset\".I hope that will help. Regards, Marc M.","No, I've tried this solution several times to no avail.","Follow these steps. 1) launch powershell 2) Set-ExecutionPolicy Unrestricted 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system","Tried it, still having the same issue. ","I recommend you to completely repair Windows before you have to make a copy of your personal fileshttps:\/\/answers.microsoft.com\/en-us\/windows\/for...","Hi Marc, just got done with the repair and the game still won't start. Edit: Windows prompted me to update this morning. I will keep you updated when I get home tonight. ","Ok, I'll pay attention","I'm sad to report that it still crashes at the splash screen. Do you have any other fixes to try?","Check that Windows and the Microsoft Store are up to date.","Done, looks like they're both up to date."]},{"symptom":"Microsoft store doesn't recognize my device to install        I recently decided to try the Game Pass for their $1 dollar promotion but I can't install any of the games that are available....the install button is greyed out and when I select the \"...\" to install on my device it doesn't have any device listed although I clearly have my PC connected to my Microsoft account. As below for pictures of issue.","solutions":["Hi Mnemolyst This is reported quite a bit, what works for most users is to reset the Store App . . .Click your Start Button, then just type wsreset and hit Enter When that completes, restart your PC and try to download that game again . . .","Fresh install of windows but I gave it a shot just in case. Issue still remains....","Hi Mnemolyst A fresh install of Windows . . . can you please check what version of Windows 10 you have installed . ..Click your Start Button, type winver and hit Enter On the resulting dialog, what Version No. and build No. of Windows 10 are you running?","Ver 1809OS Build 17763.775","Hi Mnemolyst You are approx 1 year out of date, you should update to version 1903, which would be a requirement for recent games . . .Click the link below, then click 'Update Now' on that page to immediately get 1903 and bring your PC right up to datehttps:\/\/www.microsoft.com\/en-us\/software-downlo...","I've been having a similar issue with the Outer Worlds as well as the new Halo collection release. I've reset the store a few times to try and see if something is wrong as well as made sure my PC is up-to-date but nothing has changed.","OMG same issue! The issue isnt the game, account or anything other than complete greed and idiots who cant figure out how to securely provide content. Im deleting all Microsoft Games and installing cracked version because THEY WORK.  Any paid Microsoft game has so many encryptions and account \"requirements\" there is mountains of areas to create issues. All their efforts to secure this stuff has made it impossible to enjoy fresh games an just play. Ill say it ...Im illegally downloading from now on and I hope they try to take me to court, they cant even properly identify my device. **** em. Install pirates bay and get peer blocker and let em figure it out. Rant over, money saved.","I am having the same issue. This is SO annoying. Has anyone found a fix? The solution at the top does not work."]}]}