{"windows":[{"symptom":"help with brightness in windows 10        I have a problem and can't find to change the brightness to my screen","solutions":["Hi ,FFR98 my name is Dennis, I'm an independent advisor and I'll do my best to help today. here how to change the brightness https:\/\/support.microsoft.com\/en-us\/help\/402694...Regards, Dennis."]},{"symptom":"S Mode Disable        I have been using this laptop for months. Today, I installed a Lenovo update and my computer was in S Mode afterwards. I have read how to uninstall it but the \"Get\" button is greyed out. I am the admin on my PC, but it says to contact IT Department or Admin. Thank you.","solutions":["Hi Daigoro. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.The issue is likely a corrupted user account. Test this by following Step 16 in this Windows 10 Performance & Install Integrity checklist:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...You can also try these fixes to restore Admin control: https:\/\/www.kapilarya.com\/fix-lost-administrati...https:\/\/askleo.com\/why_does_my_computer_say_i_n...If nothing else helps then contact Microsoft Support by one of these phone numbers:https:\/\/support.microsoft.com\/en-us\/help\/405170...You can also go here: https:\/\/partner.support.services.microsoft.com\/... choose the link for Browser help, interact briefly about your exact problem, keep replying agent until it connects with an agent.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Greg, Thank you for the quick response. I created a new account as an administrator and that too did not work. I was able to run cmd but I don't know what to type in? On the link you sent it informed me to go to HKEY_LOCAL_MACHINE branch and then click File > Load Hive, however the FILE option is no longer available. I'm currently doing the Microsoft chat. Thank you!","Type Regedit in Search box, choose Run as Admin, click on HKEY_LOCAL_MACHINE, which will let you access File > Load Hive.","I'm unable to, when I open the program it says \"This helps protect your PC and keep it running smoothly.C:\\WINDOWS\\regedit.exeStill want to run this unverified app?\"This is so frustrating, I truly appreciate your assistance. ","Strange. It's a System Utility. Do you have other performance problems? If so go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly."]},{"symptom":"camera        does the camera have to be purchased an in stalled or does my new hp computer have oen built in","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query related to using Camera on your PC. Usually, when you purchase a Laptop or All-in-one Desktop PC it will have a inbuilt camera on it which can be used to take pictures and record videos. If you have purchased a Laptop\/All-in-one PC then you should have a built-in camera on the PC. You can refer the article Testing a Webcam Using YouCam (Windows 10, 8, 7) to check the camera on your PC. However, if you have purchased a Desktop PC, you will not have an inbuilt camera on it, and you may need to use an external USB camera to record videos or take pictures on the PC. I hope the information provided is helpful to you. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Keys such as \"Cap locks\" \"W\" \"2\" Randomly stops working and works again then repeats        It can't be the dust and dirt all of that stuff underneath, like is it due to games? Internet connection, or hotspot? Like everytime when it works again, and i pressed it, it spams for exam: \"wwww\" Then later stops working again and then repeats, like can somebody please help????!! Like i can't even play games or do other stuff like this. It happened like 2 months ago when i had wifi bills. yesterday was fine but TODAY! why.Things i tried.Restarting.Gone to device manager.Deleted one game.Gone to safe mode.Even it will try to act like you fixed it, but later. It still repeats i need help! is there anyway i can fix this? Can it be due to wifi bills shut off or . like i am confused.","solutions":["Hi Jay. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I will give you everything possible for keyboard problems. If you need help with any steps I'll be standing by here to help you.Sometimes a stuck key can be due to crumbs getting under it. Unplug keyboard or power off laptop, turn it upside down over a trash can and gently rake the keys to dislodge crumbs. If the key is still stuck, remove and clean under it as shown here:https:\/\/www.wikihow.com\/Repair-a-Laptop-Keyhttps:\/\/www.youtube.com\/watch?v=QCYOiK9QP08Try the Keyboard Troubleshooter at Settings > Update & Security > Troubleshoot. If this began within the recent past, See if you can System Restore to a point before the problem began:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... Check which Updates were installed at Settings > Update & Security > Windows Update > Installed Update History and try uninstalling any from around the time this started. If they return and cause the same problem then hide them with the Hide Updates tool:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... What also might work is to go into Device Manager, reached by right clicking the Start button, choose the Keyboard device, on Driver tab try Updating the driver automatically.If this fails from the same location try rolling back or Uninstalling the Keyboard driver, which works in a surprising number of cases where keyboard is messed up by Updates. Restart PC to reinstall driver.See if the keyboard will work in Safe Mode with Networking, or Safe Mode: https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... If not see if the On-screen Keyboard works at Settings > Ease of Access > Keyboard > Turn On the On Screen Keyboard.If so then it could confirm the keyboard is failing, so test it in repair mode to see if it works since it uses different drivers there:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... If not you can contact a laptop manufacturer to see if you can still get it replaced under warranty, or check for replacement keyboards for that model from the PC maker or online from after-market OEM's that exactly match it.Try resetting the keyboard: http:\/\/www.thewindowsclub.com\/reset-keyboard-se... You can also remap keyboard keys using one of these methods: https:\/\/www.makeuseof.com\/tag\/missing-key-remap... Check in your BIOS or UEFI firmware Setup for keyboard settings there, too. If it's a hardware problem then you can often easily replace a keyboard by asking Google for a replacement for your full model number laptop, confirm with seller it fits that unit, locate a video or tutorial the same way which demonstates swapping it in.If none of these works then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.Another thing that might help as it solves many problems is to Upgrade to the latest version by installing the Media Creation Tool from this linkhttp:\/\/windows.microsoft.com\/en-us\/windows-10\/m... choosing Download Tool Now, install the tool, open it and choose Upgrade this PC Now. This will save your files and apps while bringing you up to the latest version by the most stable method. It will also bring all of your Updates current and solve most problems since it reinstalls Windows.I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Like, maybe it was fixed \/ worked after paying bills to wifi service or whatever like can it? I am confused?"]},{"symptom":"Application Error 1000 - Game randomly crashes after playing for a few minutes Black Desert Online        Fresh install of windows 10. Updated to latest drivers\/Windows Updates. Memtest ok, hardware check ok, processor temperature check ok, GPU temp OK.The game is Black Desert Online, run through steam. ERROR LEVELFaulting application name: bad_module_info, version: 0.0.0.0, time stamp: 0x00000000Faulting module name: unknown, version: 0.0.0.0, time stamp: 0x00000000Exception code: 0x00000000Fault offset: 0x0000000000000000Faulting process id: 0x4b0Faulting application start time: 0x01d5c1a7ad743899Faulting application path: bad_module_infoFaulting module path: unknownReport Id: e1c4c45b-0036-4fd6-82ef-ea1ef77377c3Faulting package full name: Faulting package-relative application ID: I've also gotten this one a few times.Faulting application name: xcoronahost.xem, version: 3.5.0.42, time stamp: 0x5be55832Faulting module name: unknown, version: 0.0.0.0, time stamp: 0x00000000Exception code: 0xc0000409Fault offset: 0x0b9e033cFaulting process id: 0x5dcFaulting application start time: 0x01d5c156969472c5Faulting application path: E:\\Steam\\steamapps\\common\\Black Desert Online\\bin64\\XC\\NA\\2\\xcoronahost.xemFaulting module path: unknownReport Id: b5f4045a-8dfb-4eff-b7e5-9a79b3637bcfFaulting package full name: Faulting package-relative application ID: INFORMATION LEVELFault bucket 1583869490661074995, type 4Event Name: APPCRASHResponse: Not availableCab Id: 0Problem signature:P1: bad_module_infoP2: 0.0.0.0P3: 00000000P4: StackHash_0000P5: 0.0.0.0P6: 00000000P7: 00000000P8: PCH_84P9: P10: Attached files:\\\\?\\C:\\Users\\kingc\\AppData\\Local\\Temp\\WERF28B.tmp.WERDataCollectionStatus.txt\\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\Temp\\WER24B.tmp.WERInternalMetadata.xml\\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\Temp\\WER25C.tmp.xml\\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\Temp\\WER259.tmp.csv\\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\Temp\\WER269.tmp.txtThese files may be available here:\\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\ReportArchive\\AppCrash_bad_module_info_51754d3881ae22b633a1547e4cdd56226cc5_85207d7d_acfbfe6e-d5ab-48da-b5d3-0f02356050ddAnalysis symbol: Rechecking for solution: 0Report Id: e1c4c45b-0036-4fd6-82ef-ea1ef77377c3Report Status: 268435456Hashed bucket: 48565509f28d3c5915fb08e8f96ea833Cab Guid: 0PLEASE HELP!! I've been troubleshooting this for weeks.","solutions":["Hi kingcluck and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.Have you tried a repair using SFC and DISM Method? You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Thanks Joseph, I have tried both of those methods to no avail. :( Any other ideas?","Hi kingcluck, It's an \"xcoronahost.xem\" known issue. Have you tried compatibility mode? Thanks!","Steam wont run in compatibility mode.","Hi kingcluck and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.Can you post information about your computer like Brand, Model, GPU specifications?There has been some success with this workaround given by the Game Master that you could attempt:https:\/\/community.blackdesertonline.com\/index.p... Have you also tried sending a ticket to the game's technical support team? https:\/\/blackdesert.zendesk.com\/hc\/en-us\/reques... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"What is going on with my microsoft account password?????        Hello all and thank you in advance.In short I'm trying to sign in to my Microsoft account.  I can go to www.microsoft.com, put in my username and password and I sign in just fine, but if I go to settings it shows that Im signed into a local account, so when I try to sign in to my microsoft account from this area I get an error saying my password is wrong. I get this \"what is your username\" and I put my username in (same one I use for microsoft.com), and then password (same one I use for microsoft.com), and then something comes up that says something about keeping account as secure as possible and that I will need to type in my microsoft password again, and when I do that I get an error saying the password is wrong. I've changed my password multiple times and it's getting tiresome.  Is not the password I use when I sign in from miccrosoft.com not the same password I'd use to sign it to my microsoft account from a local account?  Resetting the password multiple times doesn't work.  The cycle mentioned above just continues to happen* Moved from education","solutions":[]},{"symptom":"Computer will not connect to Toshiba Monitor using HDMI to VGA        Hello Everyone,Having problems connecting my computer HP pavilion desktop 590 to a Toshiba TV using HDMI to VGA connection.  Any suggestions.  Appears computer not recognizing the TV\/monitor.  Using the VGA on the TV that states PC connection.","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.HDMI to VGA adaptors only work one way round - they convert a VGA output from the computer to an HDMI inpur for the TV or vice-versa. Does the adaptor you have work the correct way round?Regards, David","Just ordered HDMI to VGA converter.  Hope this help.  Last resort, or I just wait until the tv\/monitor goes out and purchase a new one.  It is an old tv\/monitor with VGA input for PC and audio in jack, just now noticed it.","Hello Alpha, I am Sai, a Microsoft Community Independent Advisor. Were you able to solve your issue with the other converter?"]},{"symptom":"CANNOT LOG INTO WINDOWS-STUCK IN AIRPLANE MODE        I cannot log into windows 10 it will not recognise my password. I have tried safe mode but it also requires the password. Windows is stuck in Airplane mode and I cannot switch it off. I have tried windows reset but it requires my password which it also does not recognise. Anyone know how to switch off airplane mode from the login screen?","solutions":["Hi graham, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Many laptops have a physical latch or a key from F1-F12 that helps changing Airplane mode state. Can you tell us the make and model of the computer for better help?"]},{"symptom":"Minecraft Windows 10 Won't Install        When I try to install Minecraft windows 10, it states that I have no account linking to my device. How Come? I don't know how this whole system works. Please help!!!","solutions":["Hi Jophy. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.If this is a Game Pass install this is a known issue with fixes here: https:\/\/www.reddit.com\/r\/theouterworlds\/comment...Otherwise I'll give you everything possible to repair the store. Even if you've tried a step please do it over in this sequence. If any steps cannot be performed then report it and move on to the next:1) Try updating Store apps: https:\/\/support.microsoft.com\/en-us\/help\/402625... 2) Make sure you have the latest Windows 10 version 1909 in Settings > System > About and if not skip to Step 10 to install it by the most stable method.3) See if the fixes here help: https:\/\/www.pcworld.com\/article\/3053099\/windows... 4) Try running the Windows Store apps Troubleshooter at Settings > Update & Security > Troubleshoot.5) Try resetting the Store cache: http:\/\/www.thewindowsclub.com\/reset-windows-sto... 6) If that fails go to Settings>Apps and highlight Microsoft Store, choose Advanced Settings, then Reset. After it resets, restart PC.7) If that fails then reinstall Store. Type CMD in Start Search, right click Command Prompt result to Run as Administrator, copy the following code and paste it into the box using the Edit tools from Box's top left dropdown menu, press Enter:PowerShell -ExecutionPolicy Unrestricted -Command \"& {$manifest = (Get-AppxPackage *WindowsStore*).InstallLocation + '\\AppxManifest.xml' ; Add-AppxPackage -DisableDevelopmentMode -Register $manifest}\"8) Clear the LocalCache Folder: Open Run by pressing the Windows key + R hotkey. Copy and paste %localappdata% in Run and click OK. Open Packages> Microsoft.WindowsStore_8wekyb3d8bbwe > LocalCache folder. Press the Ctrl + A hotkey to select all content within the LocalCache folder. Press the Delete button. 9) If these all fail then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account because of the serious and persistent problem with corrupted accounts. Then continue with the other steps to go over your install most thoroughly.10) If nothing else works then do a Repair Install, by installing Media Creation Tool and then choosing to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Jophy,The message simply means your current device doesn't have the latest release of Windows 10 instaled.Try updating to 1903 using Media Creation tool.The fastest way to get the upgrade is through Media creation tool or ISO file.Please download Media Creation Tool from the link below and select Upgrade this PC at the first screen.https:\/\/go.microsoft.com\/fwlink\/?LinkId=691209All steps, including upgrading using ISO file and Media creation tool, are covered here:https:\/\/www.yourwindowsguide.com\/2019\/05\/update-windows-10-may-2019-update-manually.htmlContent on the above blog is written by a Microsoft MVP so it is safe."]},{"symptom":"My main hard drive fails at auto repairing, yet I can still access it from my other hard drive        Ok Ive tried countless times to repair my main HDD, using all the command prompt stuff, auto repairs useless and Ive checked the log files, and it said it cant come to a conclusion on what the problem is. I booted up from my other SDD, and I can still open, and even move things in and out of that apparently corrupt drive, so what do I do? I would rather not have to lose any files, and if I have to backup my corrupt one to my SDD, then so be it. I really want a better way.","solutions":["Anyone?","Hi towerdefence, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Let us check the health of the drive. Please run Seatools and run the both, long and short tests.https:\/\/www.seagate.com\/support\/downloads\/seato...Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"How long does it take to install Windows 10?        I'm installing Windows 10 Pro 64bit on my Computer for over 9 hours and nothing has happened. Previously i saw the Windows logo and the rotating dots with some precentage under them, then my screen would go black for a couple of minutes after which the precentage went up. But now the screen has been black for a couple of hours and i dont know what to do. I'm updating from a Windows 7 Pro. ","solutions":["Hi AmewaI am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.9 hours is fair enough to assume the update is stuck due to one or more reasons. Restart the computer to restore Windows 7.Let us check the Installation log to find why the update failed. Please share the logs as mentioned in this article. You should use a File sharing service like Onedrive or Media Fire to upload files and share the link in the next reply.https:\/\/answers.microsoft.com\/en-us\/windows\/for...The Panther logs. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\PantherThe Rollback logs: These usually are created if Windows Update rolls back. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\Rollback[Only if the error code is 0xC1900101-0x30018] The Device Install Log from C:\/$Windows.~bt\\Sources\\Rollback\\setupapi\\setupapi.dev.logAs the log size might be large consider zipping before uploading.","When restarted it made the sound of tuning on followed by a \"No video imput\" on my screen","So now there is no display and power on self test?","The Computer is on, but after the Windows logo and the spinning dots stop, the screen Goes black and it says \"No video Input\" ","I see. Let us try repairing the existing OS. On a working computer, create an Installation media of Windows 10 that allows you to repair existing Windows Installation.Create a USB Flash Drive https:\/\/www.tenforums.com\/tutorials\/2376-create...Boot from the USB Flash drive-Make sure you have disabled Secure boot\/Fast boot in BIOS Settings.https:\/\/www.tenforums.com\/tutorials\/21756-boot-...https:\/\/www.tenforums.com\/tutorials\/21284-enabl...Then open Advanced Startup options after the computer boots from USB. Click Repair your computer at the first screen that says Install now.https:\/\/www.tenforums.com\/tutorials\/2294-boot-a...Select Startup repair, let it finish the job and see if the computer can boot afterward.If that doesn't help, consider doing a clean install after rescuing your files. Rescue Files when Windows won't start https:\/\/answers.microsoft.com\/en-us\/windows\/for...How to do a clean install https:\/\/answers.microsoft.com\/en-us\/insider\/for...https:\/\/answers.microsoft.com\/en-us\/windows\/for...Disclaimer: Tenforums is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","I have now to the part where i need to choose which partition to install windows on and a couple of the partitions are \"reserved for the system\". Can I delete them? Also i can't install the windows on my C: drive.","Hi, You can format them, not delete. There would be a show detail option in the bottom of the Window telling wy you cannot install on C: drive something like.Windows Cannot be installed to Disk 0 partition 1 (Show details)"]},{"symptom":"chrome toolbar        I recently received a new computer that has Windows 10. My Chrome toolbar from Windows 7 has been replaced with a toolbar I used with Windows XP.  How can I get my current (meaning Windows 7) toolbar back?","solutions":["Hi pafdavis, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Can you share a screenshot with us of the toolbar as of now? Get a Screenshot and paste back in next reply: https:\/\/answers.microsoft.com\/en-us\/windows\/wik..."]},{"symptom":"I bought a fortnite gift code for a pc person, as a step to redeem the gift by pc?        I bought a fortnite gift code for a pc person, as a step to redeem the gift by pc?","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as you have purchase fortnite gift code for a pc person, but seems that it’s not available for a PC version. We as Microsoft community forum are here to help you with any technical suggestion on Microsoft product. However, anything related to subscription based query or purchase and payment related issue or redemption issue, you need to check with our Microsoft Store support team and see if they can help you with this issue. In this kind of queries, your Microsoft account verification needs to be done over a live phone call or live chat. Once the account is verified then the concern team will be able to assist you with the issue. However, you can check the Redeem a gift card or code to your Microsoft account article and check if that helps. Regards, Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"dell optiplex        where did this come from what is it","solutions":["Hi timmaddox Segurazo is supposed to be an antivirus program with real time protection. it is classified as a Potentially Unwanted Program because of the way it is packaged with other (wanted) apps and the user does not intend to install it.there also reports of it producing a large number of pop-up adverts. has it been removed?","Quarintined  it","good. you can safely delete it. although there is no direct danger reported on the program, it might be worth running a scan with the malwarebytes to see if there is anything else.https:\/\/www.malwarebytes.com\/mwb-download\/"]},{"symptom":"Error: Unable to reach activation servers, reactivating Windows after hardware change        I recently did an overhaul on my PC, upgrading the RAM, CPU, and MOBO. I have seen the multitude of recommendations regarding how to reactivate, but I am continuously getting an error \"We can't reactivate as our servers aren't available right now.\" This has been happening for a little over 24 hours. Is this something that I just have to wait?***Original title: Windows 10 reactivation after hardware upgrade \/ servers not available***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues with Activating Windows on your PC after performing a hardware change.Usually, the error you are receiving means that the internet connection is not stable and that might be the reason you are facing activation issues. One of the things that you can is to check if any driver updates are available or any pending updates are available to be applied on the PC, restart the PC and check. Additionally you can refer the article Get help with Windows activation errors If the issue persists, you can get in touch with our Technical Support Team for further assistance with activating Windows Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"My account was bypassed back in 2018 and the person who did it redeemed my win 10 edition of minecraft on another account is there a way to get it back?        if it's been redeemed from my account it must be traceable right? ","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as you are unable to trace the redeemed Windows 10 edition of Minecraft in Microsoft Store. We as Microsoft community forum are here to help you with any technical suggestion on Microsoft product. However, anything related to subscription based query or purchase and payment related issue or redemption issue, you need to check with our Microsoft Store support team and see if they can help you with this issue. In this kind of queries, your Microsoft account verification needs to be done over a live phone call or live chat. Once the account is verified then the concern team will be able to assist you with the issue. However, you can check the Redeem a gift card or code to your Microsoft account article and check if that helps. Regards, Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"Missing Mute\/Pause\/Play\/Forward\/Backward Media Symbols. How to restore the missing Icons?        This problem only occurred after using my font pack folder to install many fonts for GFX work, one of the fonts included is which windows already installs.So during the font installation, my guess is that the preinstalled font (upon windows installation) was \"replaced\" or \"reinstalled\" again while installing my fonts, thus the windows media control icons (Mute\/Pause\/Play\/Forward\/Backward) are missing, and affects other applications.Any fix on to restore these icons? Otherwise, the fonts on my PC are absolutely fine.","solutions":["Hi Dac. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Those are the controls for Groove Music. This can be a consequence of using type Font changers and optimizer suites.You can try resetting Groove in Settings > Apps > Apps & Features > Groove Music > Advanced Options > Reset & Repair. Restart PC.If that's not enough uninstall it in the same place, restart PC, then reinstall from Store Settings > My Library.You can also try to System Restore to a point before the problem began following this guide:https:\/\/www.windowscentral.com\/how-use-system-r... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Have to buy Minecraft: Windows 10 Edition?        A while back I redeemed my mojang Windows 10 Edition code after I learned that I got Minecraft: Windows 10 Edition for free since I bought the game like way back around 2012-2013. I played it for a little while and decided to go back to playing Java like normal. Now today I've decided to pick it back up again so I could play crossplatform via xbox with my kid nephew. When I search for Minecraft: Windows 10 Edition in the Microsoft store it tells me that I have to buy the game. I'm 90% certain i'm using the right microsoft account when looking at the store, so why can't I download and play the Windows 10 Edition?","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as you are unable to re-install the Minecraft Windows 10 edition on your PC and this is due to the cross-platform update, you are unable to see the game in Microsoft Store. We can suggest you to sign out from Microsoft store and then reset the Microsoft Store cache: Press the Windows Logo Key + R to open theRun dialog box, type wsreset.exe, and then select OK.Restart the PC and sign in with the same Microsoft account which you used to install the game previously. We as Microsoft community forum are here to help you with any technical suggestion on Microsoft product. However, anything related to subscription based query or purchase and payment related issue, you need to check with ourMicrosoft Store support team and see if they can help you with this issue. In this kind of queries, your Microsoft account verification needs to be done over a live phone call or live chat. Once the account is verified then the concern team will be able to assist you with the issue. Regards, Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"Sharing Files over the network between two PC's        how can I grant permission for this computor to use all the files and drives on my other windows 10 computor?***Original title: network***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query related to accessing files over the network through other PC’s. Usually, to be able to access files between two different PC’s we need to enable network sharing. You may want to refer the articleFile sharing over a network in Windows 10 and see if that helps. In case you face any issues, then you can refer the suggestions by Roohi_Taj replied on January 8, 2019 and see if that helps. Let us know if you need any further assistance, we will be glad to assist you. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Setting up dual monitor on PC        i'm trying to add a second HP monitor to my Dell laptop.Its not being identified and says to check my cable connections or to select Extend and it wont let me change my setting***Original title: monitor add on with a Dell Laptop***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query related to connecting external monitor to the PC. Usually, you will receive an error when connecting external monitor when the cable is not connected properly. I would suggest you to follow the suggestions mentioned in the articleTroubleshoot external monitor connections in Windows 10. Additionally, you may want to refer the below articles Set up dual monitors on Windows 10How to Setup Multiple Monitors in Microsoft Windows 10 Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator"]}]}