{"windows":[{"symptom":"confirmation for drag and drop windows 10        how can I make file explore prompt me to confirm the move of a folder","solutions":["I am sorry but for security reasons I will not be calling any numbers posted, please share your solution on this thread if you have one.  Kindest Regards,","I am sorry but for security reasons I will not be calling any numbers posted, -Good policy. That spam post has been deleted. Don"]},{"symptom":"Starting at the 1st of Decmember my windows 10 desktop started booting up and going to a black  display        This usually requires hitting the reset button or sometimes hitting  Esc or enter repeatedly. In computer management, Systems logs  I find error codesof    DistributedCOM  10010.  warnings of DistributedCOM 10016.   I also have  Log Name:      SystemSource:        Microsoft-Windows-Kernel-PowerDate:          12\/31\/2019 10:03:35 PMEvent ID:      41Task Category: (63)Level:         CriticalKeywords:      (70368744177664),(2)User:          SYSTEMComputer:      DESKTOP-K18LUJIDescription:The system has rebooted without cleanly shutting down first. This error could be caused if the system stopped responding, crashed, or lost power unexpectedly.Event Xml:<Event xmlns=\"http:\/\/schemas.microsoft.com\/win\/2004\/08\/events\/event\">  <System>    <Provider Name=\"Microsoft-Windows-Kernel-Power\" Guid=\"{331c3b3a-2005-44c2-ac5e-77220c37d6b4}\" \/>    <EventID>41<\/EventID>    <Version>6<\/Version>    <Level>1<\/Level>    <Task>63<\/Task>    <Opcode>0<\/Opcode>    <Keywords>0x8000400000000002<\/Keywords>    <TimeCreated SystemTime=\"2020-01-01T03:03:35.409703500Z\" \/>    <EventRecordID>70746<\/EventRecordID>    <Correlation \/>    <Execution ProcessID=\"4\" ThreadID=\"8\" \/>    <Channel>System<\/Channel>    <Computer>DESKTOP-K18LUJI<\/Computer>    <Security UserID=\"S-1-5-18\" \/>  <\/System>   I have tried to turn off a fast start-up which works every other  time but display does not always","solutions":["Hello daveburch62, I am Andrew an independent advisor and want to help you. DCOM errors are associated with network communications which can be caused by corrupted system files. These will be easiest to check, lets start with those. Please follow these steps and let us know the results. In the search bar, type cmd. Right-click on cmd.exe and select Run as Administrator. Type SFC \/scannow and press the Enter key. Re-enter Command Prompt as Administrator and run these: dism.exe \/online \/cleanup-image \/scanhealth dism.exe \/online \/cleanup-image \/restorehealth dism.exe \/online \/cleanup-image \/startcomponentcleanup","I ran all of those commands  FromSFC \/scannow_ I get 100%dism.exe \/online \/cleanup-image \/scanhealth     _ I get  99.2%dism.exe \/online \/cleanup-image \/restorehealth _ only goes up to  20%dism.exe \/online \/cleanup-image \/startcomponentcleanup _only goes up to 99.5I ran these several times","Hi Dave, are you saying they got to this point and quit, or did they just stop updating progress?Some times these scans don't always update progress real time. DISM is worst for it. It's best to run it and then walk away. Come back to it, when it is complete it will say complete. Hopefully this is the case and it just did not update real time.","Hello Andrew, the scans completed but they did not get to 100%.This morning when I turned it on. It like started to boot up, then display goes out, then it booted up a 2nd time. So it may still have this problem. there was a new ESENT error with an event id of 455. Alsothe  DistributedCOM  10010 seem to be happening every few minutes all day longI have found stuff on-line about the computer does not have a clean shut down.I  will have to see what happens tomorrowAny info is a big help thanksDavid Burch ","Hi Dave, Did you experienced this issue after an update? If yes, what I can suggest is to rollback the updates: https:\/\/lifehacker.com\/how-to-undo-and-prevent-...And disable your windows update for the mean time, please follow this link for detailed guide:https:\/\/www.cleverfiles.com\/howto\/disable-updat...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Well this morning, it started up ok. It has run all day, I am still getting The  ESENT error with an event id of 455 andthe  DistributedCOM  10010 seems to be happening, every few minutes all day long. But it is still working","Hello  3 days after my last reply to Richard and AndrewMy computer turned on and the display went black.Hit the reset button and it came backI have the same critical errors and warnings. I will try Richards suggestions about uninstalling the update ","Hello  3 days after my last reply My computer turned on and the display went black.Hit the reset button and it came backI have the same critical errors and warnings. I will try your suggestions about uninstalling the update.When I checked on what updates were installed, I foundseveral  for .Net Framework 3.5 and 4.8  When I checked about these, there is a prerequisite that  .Net Framework 3.5 and 4.8    both be installed. I check for what is installed and it shows theyare not, but they are turned on as features. There are 6 updatesfor  .Net Framework 3.5 and 4.8  going back to 8\/29\/19. Are these installed programs or features that are turned? "]},{"symptom":"MY LAPTOP SCREEN SHUTS OFF WHEN I PLUG IT IN        so I have tried a couple of things to try and remedy this situation, even uninstalling the graphics drivers and reinstalling them and it still shuts off when I plug it in. also when the drivers were uninstalled the problem was resolved, but as soon as they finished installing the problem came right back. what should I do?","solutions":["Please explain some things.  What do you mean plug it in?  Where and what are you plugging in?Also what is your system that you are using?","Hi,Your laptop may not go compatible with the installed graphics driver. You can try t install another version of the driver.1. Uninstall the graphics driver in safe mode.2. Download another version of the graphics driver and have it installed on.BTW, to enter the safe mode：Before the appearance of the windows startup logo, you should hold down F8 and select safe mode from the menu.Regards,","Hi brodobaggins146 You have done some good troubleshooting and have correctly narrowed down the problem to your graphics card device driver . . .If the driver you are installing is an up to date driver and still the problem exists, then perhaps an older version of that driver would be more compatible with your system compared to the one Windows 10 updates is installing. New video card drivers do sometimes cause compatibility issues in Windows 10 . . . Open Device Manager (accessible by right clicking your Start Button) Expand the Display Adapters Section Right click your video card and choose Properties On the Driver Tab, choose 'Roll back Driver' Restart your PC once done . . . If that option is not available or does not resolve the issue, go to the support page for your device on the manufacturers website, then download and install the video driver they recommend, it may well be an older version to the one you are currently running","it was the graphics drivers! after doing some more research if discovered that windows had been updating and my connection had been interrupted during the update, which had messed with the way the drivers installed. I ended up doing what you advised so that I could properly update the drivers. I also twiddled with the battery setting as well just to double check. "]},{"symptom":"How do I fix the black blinking screen of death?        Okay, so I've had this Acer laptop for a good few years, always worked fine, but a few months ago, it's started doing something strange. During start up, the computer acts completely fine, but the moment I log in and reach the desktop, it starts randomly going black for unspecified amounts of time with only the cursor on screen, and then coming back a few moments later. It's also begun freezing much more often. I've tried completely reseting everything, but the issue is still occuring. I dont have the slightest clue what the issue is, so any feedback would be greatly appricated!UPDATE : A full reset of the computer has proven unsuccessful.Safe mode temporarily eliminates the issue, but network isn't available.A clean boot does not solve the issue, not even temporarilyI believe this narrows the issue down quite a lot if anybody has a new perspective on it.","solutions":["Any 3rd party anti virus, security, cleanup programs ever installed on the computer?","Yes, it came with Clean-up, Malware Bytes, and Norton.","I happen to find these possible solutions for black blinking screen of death, and hope it works for you:Method 1: Disable discrete graphics driver.1. Restart your computer.2. On the sign-in screen, click Power > Restart while holding down the Shift key.3. Your computer will restart again. Select Troubleshoot > Advanced option> Startup Settings > Restart4. Boot Windows in Safe ModeFollow the instructions based on how you’d like to use your computer:a) Hold down F4 or 4 to boot in Safe Mode.b) Hold down F5 or 5 to boot in Safe Mode with Networking (if you’d like to have internet access). Method 2: Close Secure bootRestart computer and enter BIOS (usually you can long press Del to enter)Find Secure Boot (usually it is in the navigation clips of Security) and close it.Restart the computer.","Go to Norton and get their removal software and remove Norton completely.","I've attempted to do as suggested, but the computer screen won't stay lit long enough to succeed, and it's also a race for time before the computer freezes.","Hi AblexJackblix, My name is Riccardo and I would be happy to help you! Let's start off by doing a clean boot and seeing if this alleviates the problem momentarily...https:\/\/support.microsoft.com\/en-us\/help\/929135...Have you tried updating the drivers on your computer? Going to Start > type in Device Manager > click Device Manager iconGo to your Display adapter and expand > right-click your display adapter and Update DriversWhat version of Windows 10 are you on? Go to Start > type in winver > click winver iconAre you on Build 1909? Have you tried updating? Let me know, I will be here to assist.","I followed method one, and good news! The black blinking stopped while in safemode! Although, despite holding f5, I don't have internet access, which is necessary for the activities and work I'll be using the pc for. ","I've made an attempt to follow the guide to a clean boot, but the black screen blinking makes it nearly impossible. Anything to be preformed after the start screen, or even simply viewed after the start screen, is very difficult to achieve, and is honestly a game of luck. I could boot in safe mode to attempt to get answers to questions, but aside from that, going through the device is very difficult :(","Are you able to boot in safe mode with networking? Booting in Safe Press the Windows logo key + R. Type msconfig in the Open box and then select OK. Select the Boot tab. Under Boot options, clear the Safe boot checkbox.","I was able to get into safe mode, and the blinking has stopped, though i have not been able to access network. "]},{"symptom":"Microsoft and my Account Password Nightmares        Happy New Year Y'all :-)Bottom line, Is it possible to speak to an expert at Microsoft who can help me get past my password issues once and for all?Over the years Microsoft and I have created a password morass. I have documented my passwords, but none  work.  And now, as a 'confused old guy' I am unable to resolve the problem, and please believe me I have tried. Of course Microsoft is able to bill me correctly for my 356 subscription, but when I use Excel for example Microsoft creates a yellow banner requesting my email and password.When I attempt changing my password using 'the password change system' I'm successful to a point until asked for a 'pin' then 'Microsoft Hello'. I have no record of either. Don't have a clue what 'Hello' is.I appreciate your help, IM","solutions":["Hi,My name is Will, I'm an independent adviser.Windows Hello is the name for quick login services for your PC. The options available to you depend on what hardware your device has (webcam, fingerprint sensor etc). But all devices offer a PIN option you can use instead of a password.If you don't remember your PIN you can remove or reset it by going to Settings > Accounts > Sign-in options. Under PIN there should be an \"I forgot my PIN\" option you can use to reset it.If you want to reset your password you can do so from this screen also. If you don't know your password you can recover it with the forgot password options at account.microsoft.com.I hope that helps."]},{"symptom":"Windows 10 Pro 1909 Updates wipe out Switchable Graphics Tools by Intel and AMD        amd-catalyst-15.7.1-win10-64bit.exe, when run for compatibility with Windows 8, restored the AMD and Intel Tools for controlling the Switchable Graphics.But, a short while later Windows Update wiped them out when,Driver Updates, Shown in Update History, for AMD Mobility Radeon HD 5000 Series and Intel(R) HD Graphics, replaced the Display Adapter drivers with the exact same drivers that were there before the automatic update.  This automatic updating wiped out the Switchable Graphics Controls.QUESTION:  Can the automatic updating of these  two Display Adapter drivers be turned off in this latest version of Windows 10 Pro, 1909?amd-catalyst-15.7.1-win10-64bit.exe, was run for compatibility with Windows 8, again, and restored the AMD and Intel Tools for controlling the Switchable Graphics.","solutions":["Hi, thewamp If you want to prevent Win 10 from Automatic updating drivers. Follow the instructions on this Link. Link: https:\/\/www.windowscentral.com\/how-disable-auto... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"How Fix Windows 10 Slow Startup\/Slow Bootup And Restart Issue        Fix Windows 10 Slow Startup\/Slow Bootup AndRestart Issue","solutions":["Hi Zsan#1,         Please fowllow the sugestion on the Microsoft Support Site @ https:\/\/support.microsoft.com\/en-us\/search?query=windows%2010%20slow%20performance","Hi,There are a number of things that can affect the boot up speed. I would recommend starting by checking the startup tab in task manager and disabling any programs that aren't related to your hardware and you don't need to launch with Windows.I would also recommend doing a system integrity check just to make sure there's no ongoing issues with your Windows installation. You can do this from a command prompt with \"sfc \/scannow\". This will take awhile but if it finds any integrity violations it will try to repair them and notify you afterwards if it's unable to.Please try these steps and let me know if you are experiencing issues still afterwards, so that we can troubleshoot further."]},{"symptom":"downloading apps        Can the app FORETEES be downloaded to my PC.  I have windows 10 on my Samsung computer","solutions":["Hi if you are referring to the foretees Integrated Club Management Software. i am afraid it seems to be available only for android or apple. there is a sales email address, you could ask them if they intend to make it available for windows.http:\/\/www.foretees.com\/contact-us\/request-a-demo\/that said, you may be able to use an android emulator to run the android app https:\/\/www.androidauthority.com\/best-android-e...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Freeing up space on hard drive.        Hi , I need too free up space on my hard drive. Seems other users account for 154 gb (I have no other users). In manage my account it only gives me the option to add family friends. How do I delete the other users and free up space? Any help will be appreciated ta","solutions":["Hi Greggyuk Windows Explorer is useless when it comes to working out where your hard drive space is being used . . .Click the link below to download a small free utility called Treesize. Using that tool, you will instantly see where this space is being usedhttps:\/\/www.jam-software.com\/treesize_free\/Please provide a screenshot of your C drive in that TreeSize utility for further analysis . .________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","Thanks DaveM121, downloaded and didn't really shed any more light sadly.Appreciate your help, looks like a trip to a laptop mender.ta Mate"]},{"symptom":"how to erase blocked contacts forever?        Hihow to erase blocked contacts forever?","solutions":[]},{"symptom":"Disable Windows 10 automatic restart after updates        Is there any REAL way to disable this cancer feature?This is not the first time i have lost unsaved work due to this annoying function, that almost every Windows user hates.I'm trying to behave, but it is really hard to keep calm after loosing unsaved work multiple times.Why is it that Windows cannot just wait until the user decides to restart at a convenient time? It's not like the end of the world that users doesn't restart at a specific time.In a time where Apple's Mac is already \"stealing\" a lot of Windows customers, it is a very risky (and dumb) feature to add to Windows.This alone is very difficult to argue against in a Mac vs. Windows discussion.Luckily (for Microsoft) Microsoft have secured themselves from a law suit in their policy.MS knows that all Windows users hates this feature, and yet they still have it. WHY?So back to the question. Is there any official\/unofficial way (FOR GOOD)  that allows me to disable this annoying feature?I tried following some tutorials on YouTube, but little did it help obviously, as i just came home and found my computer restarted, and my work deleted.","solutions":["Is there any REAL way to disable this cancer feature?Yes, of course. Setup active hours.Start menu -- Settings app -- Update and Security -- Windows Update -- Change active hours","Hello my name is Bradford and I'm an Independent Advisor for the Microsoft Community and I will try to resolve your problem.1. Click on the “Start” button and type gpedit.msc press Enter. 2. In the Local Group Policy Editor, go to Computer Configuration -> ->Administrative Templates-> -> Windows Components-> -> Windows Update 3. Double-click on “No auto-restart with automatic installations of scheduled updates”.4. Select \"Enabled\", and then click \"OK\". 5. Close the local group policy editor. If the above steps don't have the effect you desired please let me know!","Is there any REAL way to disable this cancer feature?Yes, of course. Setup active hours.Start menu -- Settings app -- Update and Security -- Windows Update -- Change active hoursThanks for your answer - but it's not useful. I asked if there is a way to REALLY disable automatic restart, and you answer me on how to change active hours.2 very different things.","Hello my name is Bradford and I'm an Independent Advisor for the Microsoft Community and I will try to resolve your problem.1. Click on the “Start” button and type gpedit.msc press Enter. 2. In the Local Group Policy Editor, go to Computer Configuration -> ->Administrative Templates-> -> Windows Components-> -> Windows Update 3. Double-click on “No auto-restart with automatic installations of scheduled updates”.4. Select \"Enabled\", and then click \"OK\". 5. Close the local group policy editor. If the above steps don't have the effect you desired please let me know! Thanks.When i double click the \"No auto-restart with automatic installations of scheduled updates\" i get a popup in where i can enable the policy.Though after enabling it, i get asked to set active hours.. All my hours are active. I don't want any restarts in active or inactive hours.I just want Windows to stop restarting automatically no matter what time it is. I will restart myself when i need it.","I asked if there is a way to REALLY disable automatic restart, and you answer me on how to change active hours. It's not possible to disable the restart, because the changes made by a feature update can only be processed while the computer is not being used. Most software operates this way.","Hello, Try the process below: 1. Press Windows key + R keyboard shortcut to open the Run command. 2. Type the following path and click \"OK\": %windir%\\System32\\Tasks\\Microsoft\\Windows\\UpdateOrchestrator3. Select the Reboot ) (it does not have an extension) file right-click it and select \"Rename\". 4. Rename the Reboot file to \"Reboot.old\". 5. Right-click inside the folder, select \"New,\" and click on \"Folder\". 6. Name the New Folder \"Reboot\". 7. Now restart your computer. This will disable Window's ability to restart automatically. If this solution has the desired effect let me know.","This is what I've had to do (the UpdateOrchestrator option posted by Omoikane1122).To the other answers:Active Hours are not a valid solution.  I leave my computer with long running processes over night, and I come back in the morning and discover my system rebooted.  This has cost me a lot of time and money.S_and_S:Yes, we can acknowledge that updates require restarts.  Nag me about doing them, that's fine, but DO NOT do it without my permission.  This is MY machine and the tasks I left running on it are MY livelihood.","I have the same issue. I am running computer simulations on my machine which take hours to days. You come back to your machine and it has rebooted, hussah! This is my machine and if I want to use it to make a living I don't want to lose work just because you morons think that an automatic reboot is a funny idea!I don't want to change active hours. I tried the UpdateOrchestrator option but it already says \"Disabled\" for reboot, so that obviously doesn't work. And I don't have Windows 10 Pro so I can't use the gpedit option.GET RID OF THIS F.....G BEHAVIOUR!","1: Only some hate this feature and I am not one of them. So happy!2. What update is it? Only updates like the cumulative ones and cumulative.net... requires a restart. Plus, it will only ask for a restart after the update (cumulative) is done downloading and finished installing. Actually, after restarting, then it will counts as a successful install. Normally, Windows will not ask for a restart, or automatically restart, never heard off automatically restart unless it pertains to that update. I never have that issue before.","1: Only some hate this feature and I am not one of them. So happy!2. What update is it? Only updates like the cumulative ones and cumulative.net... requires a restart. Plus, it will only ask for a restart after the update (cumulative) is done downloading and finished installing. Actually, after restarting, then it will counts as a successful install. Normally, Windows will not ask for a restart, or automatically restart, never heard off automatically restart unless it pertains to that update. I never have that issue before.Well, count me as another who hates it.  Giving me no option after downloading and installing an update (which does not warn the user of this ahead of time) other than to have my computer restart without my consent once my active hours (which can only be set to a maximum of 18 hours) are over.... that's simply not acceptable.  There is no valid reason to prevent users from postponing the restart for as long as we wish, and doing it at a time of our choosing.  Anything else leaves me inclined to disable updates altogether.  These are *our* computers, not Microsoft's.  If they can't understand that, they'll be left in Linux's dust.For those that consider Linux too small a contender for that last sentence to be anything but a joke:  consider that Android is just a modified Linux OS, and currently holds the largest market share among all internet-connected devices, having overtaken Windows by 2017.  Not long after Windows 10 was released, come to think...And if you search on Microsoft's own bing.com for <disable windows 10 update automatic restart>, you get over 28 million results.  That's more than if you search \"Avengers Endgame\", for an indication of how popular the idea of disabling this \"feature\" is.  When a customer asks for something, a smart business doesn't respond by trying to tell the customer why they shouldn't want that instead of actually giving it to them.  And no, I'm not going to pay for a more expensive version of Windows so that I can use gpedit to disable this stupidity that never should have existed in the first place.  Trying to frustrate me into paying more isn't a great business plan, either."]},{"symptom":"windows 11        people posting stupid vids on youtube. wish to know if windows 11 exists and if yes, has it been released!","solutions":["No, or at least I don't think. the microsoft would told us","Hi Astrodes. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.No, there are no plans for Windows 11 that have been announced or that I've seen via MVP channels or in forums .The present plan to extend Windows 10 into the future with twice annual Version Updates will likely continue indefinitely. These replace the old Service Packs and new editions of Windows.Hope this answers your question. If not just ask back anything else.","people posting stupid vids on youtube. wish to know if windows 11 exists and if yes, has it been released!Hello,Kindly refer the answer here:https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-update\/when-will-windows-11-be-released\/7cb93133-ef3f-440a-840c-2f1044f34409Hope this helps!","wish to know if windows 11 exists and if yes, has it been released! No.","No, it doesn't exist and according to Microsoft, it never will.Microsoft has said there will never be any versions with new names. Windows 10 is the last name. But nobody knows whether Microsoft will change its mind one day and come out with a newly-named version. But if does, there is no guarantee that it will be called Windows 11.","Hi astrodes,        NO!... there is No Windows 11. Windows 10 will keep upgrading itself Twice a year."]},{"symptom":"My desktop PC keeps waking up when I wake up my Laptop        I have a desktop and laptop both running Windows 10 and are up to date . They are both on the home network. I have set each to go to sleep after 10mins. However I have just become aware that when I turn on my laptop in one room, i can hear the desktop, which is in a completely different room, waking up! Why is happening ?","solutions":["Hi surfing69 This is possibly caused by the 'Wake on LAN' functionality in Windows, if that is enabled . . .Right click your Start Button, choose Device Manager from the resulting menu Expand the Network Adapters section Right click your WiFi Device and choose Properties Choose the Power Management Tab on the resulting dialog Turn off the 'Allow this Device to Wake this PC' option and save that setting Do this on both devices . . ."]},{"symptom":"how do I write and print a letter        how do i write and print a letter","solutions":["how do i write and print a letter - -Please see my post at How to write a letter and then print it Ask any follow-up questions here in this thread.Don","Hi Myron, Windows 10 contains a free basic Word Processing Application that you can use for typing and printing letters called Wordpad . . .Click your Start Button, then without doing anything else, just type wordpad In the resulting list, you should see the Wordpad application, right click that and choose 'Pin to Start'Now open your Start Menu again, you should see a new square Tile for Wordpad, which you can use anytime to open the Wordpad application to type letters . . .","You might need to install a Word Processor if you write a lot of letters. Microsoft Office's Word is best although expensive. Try using Wordpad on Windows 10 if you only write a few letters and can format it yourself. It's on the Start menu under Windows Accessories. "]},{"symptom":"How to run a cd on windows 10        I cannot figure out how to run a cd on my windows 10 computer","solutions":["Hi,Thank you for posting in Microsoft Community.I understand that you are trying to run the CD\/DVD in Windows. We will help you.To understand the issue better, I suggest you to answer the below question.Are you referring to audio CD\/DVD that you are trying to play in Windows 10?Are you trying to access the blank CD\/DVD in Windows 10?What is the exact issue you are facing in Windows regarding the CD\/DVD?Please post us back with more information to help you better.","My CD rom will not work at all.  The light comes on about 5 sec. and goes off.  NOTHING ever starts.","Can you see the optical drive in File Explorer?","i am referring to when I put a cd in the computer it doesn't play and I cannot find it on windows 10.same with the pen drive.i have no my computer","Did we ever get an answer on this?  I don't have a discmenu option on my CD.","When I put a cd in an try to run it nothing happens!","trying to run Kaspersky but that is not the only problem. I tried to"," I am referring a picture DVD that I want to look at.  I can't seem to find how to run it on Microsoft 10","Not helpful.  Why? I am unable to access the information Code?","Hi,Thank you for posting in Microsoft Community.I understand that you are trying to run the CD\/DVD in Windows. We will help you.To understand the issue better, I suggest you to answer the below question.Are you referring to audio CD\/DVD that you are trying to play in Windows 10?Are you trying to access the blank CD\/DVD in Windows 10?What is the exact issue you are facing in Windows regarding the CD\/DVD?Please post us back with more information to help you better.I don't know how to bring my photos up on the cd to my computer and run them.   On windows 10  and how do you bring up the drive for it."]},{"symptom":"how do i get my apps to download?        how do i get my apps to download and the all say downloading but they aren't doing anythingand I've restarted Microsoft store and it hasn't done anything  ","solutions":["Hi Cronk, We’ve rounded up the steps that help fix the Microsoft Store. Whether it’s running a troubleshooter to automatically detect and repair issues or clearing the cache, chances are that one of the helpful suggestions should help you solve your issue.https:\/\/www.makeuseof.com\/tag\/5-tips-fix-window...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","this  is  the  best  app  eeeevvvvvvveeeeeeerrrrrr"]},{"symptom":"Kein Dialog sound bei gears 5        also wie oben schon steht hab ich das problem das in gears 5 kein dialog zu hören ist aber in den untertiteln für milli sekunden zu sehen ist das was gesagt wird aber man hört einfach nix","solutions":["'Hallo Varro94, hab mal von einem Fehler mit der Logitech Gaming Software gelesen, benutzt du die vielleicht?Mfg, Liam","'Hallo Varro94, hab mal von einem Fehler mit der Logitech Gaming Software gelesen, benutzt du die vielleicht?Mfg, Liam nein benutze nichts von logitech"]},{"symptom":"Ungroup Icons on Taskbar        I cannot ungroup the icons on the taskbar.  If I go to the taskbar options and change from \"Always, hide labels\" to \"Never\" and immediately go back in, it's back to \"Always\" like it didn't save the change.  I have been chatting with MS help and they had me run a DISM scan and scannow, but there were no problems found and the issue is not fixed.  If I have 2 Excel files open,  I want to see them both on the taskbar, not grouped into one where I have to hover over and choose one.  Thanks.","solutions":["Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.I wanted to verify if you are using multiple displays? If so, please select Taskbar settings > Multiple Displays > Combine taskbar buttons on other taskbars.There are details in this article under \"Rearrange taskbar buttons\": https:\/\/support.microsoft.com\/help\/29280 Please let me know if I can help you further!","No, I am not using multiple displays.  I have partially resolved the issue.  I can change the options by booting into safe mode, changing the options, and then booting back into normal mode.  Once in normal boot mode, once again the options do not save.  So every time I want to make a change, I have to boot into safe mode.  Maybe this info will help you find a solution.","Sorry, I have more questions for you. Do you have any software installed that is used to customize the look and feel of Windows (my top suspicion)?If you can generate a Microsoft System Information Report and upload it to an online storage (like OneDrive) and share a link, I can check what is installed.https:\/\/nvidia.custhelp.com\/app\/answers\/detail\/...Does Windows prompt you about being signed in to a temporary profile? https:\/\/winaero.com\/blog\/windows-10-youve-been-...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","This article has examples of what are customization software and I'm not suggesting that you should install any of these. I'm just wondering if you have installed something similar.https:\/\/blogs.systweak.com\/windows-10-customiza... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I don't have any customization software installed that I am aware of.  Here is a link to the report:https:\/\/1drv.ms\/u\/s!Alk2SVS9dIvJjU_DxEY5q-H2QYkC?e=dg2w50","I want to start with CCleaner. Run Task Manager > Start-up tab > look for \"CCleaner Smart Cleaning\" (or anything starting with CCleaner) > Right-Click and Disable.Still in Task Manager > Details > Look for \"ccleaner64.exe\" > End Task (Click More Details on Task Manager if you cannot find Start-up or Details tab) Then try to change your taskbar settings and check if it saves.","Thanks, but it's already disabled.  I don't keep it on all the time.","Alright. Next, are you comfortable navigating in Registry? I want to verify if NoSaveSettings exists anywhere. The first post by A.User has further details: https:\/\/answers.microsoft.com\/en-us\/windows\/for...","Hello David,As a workaround for now, you might see if using an available option in the tutorial below to set it to \"Never\" via policy will force it to stick.https:\/\/www.tenforums.com\/tutorials\/104774-enable-disable-grouping-taskbar-buttons-windows.html","Finally, I do have a suspicion on Bleachbit, but I can't really find anything.So I'll drop off here too, see if any other experts will chime in."]},{"symptom":"Microsoft Solitaire        Why all of a sudden is Microsoft  charging for Klondike Solitaire?  This has been in Windows for years without a charge.  What changed?I can't believe that Microsoft needs the revenue off of this game!","solutions":["Hi le_flyer, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.Microsoft Solitaire Collection is free and includes the Klondike version. You can download it from the Microsoft Store: https:\/\/www.microsoft.com\/en-us\/p\/microsoft-sol...I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","Hi,There must be some misunderstanding.You can get free Klondike Solitaire here: https:\/\/www.microsoft.com\/en-us\/p\/klondike-solitaire-free\/9nblgggzffqc?activetab=pivot:overviewtabThanks,","The game I am playing is the one preinstalled on W10.  I have played this before and it has always been free and then in the last 30-45 days I have been getting a prompt to pay $1.99 per month or $14.?? for the year to avoid the ads.  Also, this product has never had ads before.  My question is why now on the ads and cost?  This just seems out of step for Microsoft.I will looked at the app you suggested and this is a different game. I will remove the app and re-download.  Maybe this is fix the problem.","Ads are a part of many free programs now--music, games, etc.  A fee is charged to avoid ads. Lots of info online about how to avoid the ads, but some\/many seem sketchy and should be avoided. Try this-- open Personalization, Start and turn off Show suggestions. That does turn off MS suggestions (ads for their products when you use the computer) but it might not work in games and other programs with a payment option."]},{"symptom":"recovery disc        please guide me to make recovery disc for window 10","solutions":["Hello Rajanikant, I'm Didi, an independent advisor. Please follow this tutorial, it is well explained : https:\/\/www.howtogeek.com\/131907\/how-to-create-... Regards, Didi Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hello Rajanikrant, The tutorial below can help show you how to create a USB recovery drive for Windows 10.https:\/\/www.tenforums.com\/tutorials\/4200-create-recovery-drive-windows-10-a.htmlIf you like, creating a Windows 10 installation USB can also serve as a recovery drive since it also contains WinRE, and you also have the extra option to clean install Windows 10 if needed.https:\/\/www.tenforums.com\/tutorials\/2376-create-bootable-usb-flash-drive-install-windows-10-a.html"]}]}