{"windows":[{"symptom":"Windows 10 Activation Issues        Hey guys, I'm having an issue with getting windows 10 pro acticated using an OEM key provided by Dell, during previous visits. The OEM keys are brand new and not associated with any device. However, they are not bwikg accepted on this laptop. The laptop itself has a windows sticker on the bottom to indicate that a licence key is embedded, but using ShowKeyPlus it shows only a windows 7 OEM key. I just dont understand why the windows 10 OEM key is giving me an error.  Please help! ","solutions":["Was the OEM key for Pro or Home?","HI Enzo Can you please explain what you mean by you received OEM Keys from Dell was that for a replacement motherboard, it would be unusual for them to hand out OEM keys . . .Is the OEM licences they provided you with for Windows 10 Home or Pro and does that match the version of Windows 10 you currently have installed on your PC?","Sorry, yes tge Key is for Windows 10 Pro And the key was handed out by Dell during motherboard replacements ","Hi Enzo This may be caused by a known bug in the Pro activation process . . . Open the Settings App (gear icon on your Start Menu) Go to System - About What is the exact Edition (Pro, Enterprise . . .etc) of Windows installed on your PC?"]},{"symptom":"Is there a way to know what version of windows 10 was activated on my PC        I was given a computer from a relative that he bought in 2008 that was top of the line then and still is good enough for my kids to do school on now. It had Windows 10 installed on it, but it had a password so I thought I'd just reinstall a fresh copy of Windows anyway and it'd re-activate itself, but I was wrong. The computer was a custom home built with \"after market\" parts so it isn't OEM. I installed Pro x64 but I'm just curious now if HOME or a different version would have been able to activate? Or if there is any product ID info on the hardware that Microsoft would have on file or if there is anything to do at this point. Technically it isn't a big deal as the computer still works un-activated, but if it was something easy it'd obviously be better activated. The only other thing that I'm thinking is if the computer's digital activation is linked to the previous person's Microsoft login and if so would I need to be logged in on their Microsoft account to get it to activate?","solutions":["Hi AcquiredBurrito! I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.There are 2 ways to activate Windows 10: 1. Using a product key which is typically how it has been done, and 2. Using a digital license, which is typically associated with a Microsoft account. (and in your case, possibly the previous person's Microsoft login)If possible, I would suggest to see if your relative has the product key and information on which version of Windows 10 was installed.The license does have to match the version of Windows installed, so for example, it is possible that it was previously Windows 10 Home, and so that product key would not activate the Pro version you have installed. You would have to install Windows 10 Home and re-activate with the product key. For more information on Windows 10 activation, please visit: https:\/\/support.microsoft.com\/en-ca\/help\/12440\/... I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","Try this;  it may or may not do what you want..To check if your computer is activated;Right click Start, click Command Prompt(Admin)Click Yes to \"Do you want to allow this app to make changes to your device\"enter slmgr \/xpr  Then hit the Enter keyIt will tell you when it expires. ","What is the Activation Status and Edition showing at the top of the page at Settings > Update & Security > Activation? Run the Activation Troubleshooter in the same location and report back its findings.To downgrade to Home usually involves a Clean install but there is a workaround reported by many to be working here so try that first:Downgrade from Windows 10 Pro to Home? - Microsoft Community(It's the exact same OS with a few extra expensive features hidden which most users don't need).Then see if it activates when you connect to the web.  If not you can buy a key from Microsoft here and insert it:Buy Windows 10 Home - Microsoft Store"]},{"symptom":"Is \"Microsoft JhengHei\" Font for commercial use?        Is \"Microsoft JhengHei\" Font for commercial use? I have read these articles and have said it is not allowed! In Chinese: https:\/\/mrmad.com.tw\/windows-font-family \/ https:\/\/www.zhihu.com\/question\/19889152. I will just like to make sure.Likes to look at the save side!Many thanks!NoelMoved from Office 365 admin\/ Microsoft Teams \/ Office 365 for Business","solutions":["Hi Noel, Thank you for writing to Microsoft Community Forums Windows comes with a large number of pre-installed fonts. Office and other Microsoft applications will install additional fonts. Both Office and Windows include a font section in their End User License Agreements that describes what you can do with the fonts included with these products. In general, the fonts supplied with Microsoft products may not be modified, copied or redistributed. Many of the fonts that come with Microsoft products are also available directly from their original creators. Look at the trademark and copyright notices within each font file to determine who to contact for additional end user, ISV or OEM licenses. Some of the fonts that contain copyright or trademark strings identifying Microsoft as the font’s creator can be licensed from Monotype Imaging. Please refer this article for further information:Fonts and supported products. As additional information, please refer this article: What is Copyright? Regards, Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"Uploading imported photos from photos app Windows 10 to OneDrive        I uploaded photos directly into my photos app in Windows 10 from my camera. Although these are available in my photos app they do not appear in my OneDrive even though automatic syncing is on.Without having to go through and find the uploaded pictures amongst others (about 1000 in all), how can I get these synced? Because they were uploaded directly to photos, I don’t think they are in another folder in file explorer but I might be wrong? Am I missing something obvious? To summarise, all my photos from my iphone or pictures appear in OneDrive but not the ones taken from my camera which are uploaded directly to the photos app.","solutions":["Hi Isharps. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See the Answer from Wolfgang here: https:\/\/answers.microsoft.com\/en-us\/windows\/for...Go into Photos App Settings, under Sources look at the folders linked, then check those for the pictures, which are intended to be housed in the User Pictures folder and only managed and edited in the Photos app.See this complete guide for importing Photos into Windows 10: https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Cannot Find Desktop App Converter Base Image Build 18363        I am running Windows 10 on the Release Preview ring, which means my build is 18363. I want to convert a desktop app using Microsoft's Desktop App Converter. However, the only build I can find that is even remotely related to my version of Windows is build 18362, which will not work. Is there anywhere I can download the base image for build 18363? Or do I need to wait until the next version of Windows is released?","solutions":["Hi you can download insider preview ISOs by signing in to https:\/\/www.microsoft.com\/en-us\/software-downlo...","I am not asking for Insider Preview ISO's - I am looking for the Desktop App Converter base image for Windows 10 build 18363. I have searched both https:\/\/www.microsoft.com\/en-us\/software-download\/dac and https:\/\/www.microsoft.com\/en-us\/software-download\/windowsinsiderpreviewdac but cannot find anything about a base image for build 18363.","sorry, i misunderstood. i believe, as you have already found, that the latest available is 18362. maybe somebody else can offer better info","Okay, thanks for the info. I'll leave this thread unanswered for now.","@Microsoft, please provide us with a link to the 18363 base image, it's quite frustrating to be stuck because of this. This issue has been created more than 2 months ago and still no official answer or fix or workaround.","I know - so annoying. I'm now on the official November update and still nothing has arrived. My software development has been set back by a ton because I am required to use the latest version of Windows.","On the web page Windows Desktop App Converter Base Images the Base Image for Windows 18363 is not available.Thanks.","Yep - Microsoft has released Build 18363 but has yet to make the desktop app converter image for it. Seeing how quickly the Insider images are updated for DAC, I think there is a major problem with their decision to not update this. My desktop app conversions have had to grind to a complete halt because if this, and I am more than 3 months behind because of this crappy quality. Fix this, Microsoft... Please!","An official answer Microsoft, please."]},{"symptom":"Windows 10 doesn't Sleep automatically        Hi guys,Until recently my pc does not go to sleep automatically and it's driving me crazy. I keep the settings at 30 mins auto. I have been searching answers everywhere and nothing worked. Please advise me on how to solve this issue. Thank you.","solutions":["Hi IjazIhsan. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I will give you all possible fixes for Sleep. If you need help performing any step just ask back:First confirm you have the Sleep options configured correctly as shown here: https:\/\/www.tenforums.com\/tutorials\/2843-change....You might want to try Hibernate to succeed Sleep, or use Hibernate in place of Sleep - it's just a deeper sleep that actually powers off because desktop stored in RAM during sleep is written to hard drive hiberfile then powered off.Most Sleep problems are caused by the Display driver, so try updating yours from the PC or Device maker's Support Downloads web page for your full model number, Serial Number or Dell Service tag. While there make sure you have the latest BIOS, Chipset, Network, Sound, USB and all other drivers by comparing those posted for download with the version and date of the corresponding ones in the Device Manager.If that doesn't help then in Device Manager on Display device Driver tab choose Roll back, Uninstall (then restart to reinstall) or try another one previously installed at Device Manager>Display adapter>Driver>Update Driver>Browse>Let me pick.In addition there are steps here to specifically troubleshoot Sleep mode problems:http:\/\/www.makeuseof.com\/tag\/fix-windows-10-sle... What I do is go into Advanced Power options and set Display and Sleep to 1 minutes, Hibernate to 2 minutes, then after completing each step restart the PC and observe what happens for 3 minutes.Also did it previously work? Do you have a System Restore point from when it did?http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t...This may have been caused by Windows Updates. Check which Updates were installed right before the problem began, and if necessary uninstall them from Settings > Update & Security > Windows Update > Installed Update History.You can also try to roll back using System Restore to a point before this began: http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... Then if an Update reinstalls and causes the same problem uninstall or roll it back again, then immediately hide it using the Hide Updates tool from Method Two here:https:\/\/www.askvg.com\/fixing-windows-10-automat... If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1903 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Accounts used by other apps        I have a local log in, i.e., am not using a Microsoft account for logging into the PC.In the section Accounts used by other apps under Settings > Accounts > Email & accounts:Would it be possible to delete or remove the account that I am using for the apps from being displayed in the section Accounts used by other apps? If yes, what happens to the current apps loaded in my Windows 10 laptop that use this account.I do not want to close that account. I also want to continue to use that same account for the apps. I do not mind the app asking me to sign in each time. I just do not want it displayed in Accounts used by other apps, if at all possible. And I do not want to be fiddling with the Registry.Thank you in advance.","solutions":["Yes, just go to the post which helped most, and answer \"Did this solve your problem?\" with Yes, which should then pop up a rating to choose the number of stars.Thanks! Ask for me any time.","No, there is no way to not display an email or app account used to sign into specific apps. It will display there if you sign in with it until you remove it there.The second image is a warning that it will remove your email from the Mail app, Contacts from People app, Calendar from that app, stats and other app data in other apps you signed into.So if you're unsure you should ask yourself or ask back here what you could lose if you remove the account that may be maintaining your data in those apps you're signed into."]},{"symptom":"Problem Running Bitstream Font Navigator under Windows 10        I am having a problem running an old version of Bitstream Font Navigator (version 4.0) on my laptop running Windows Home  version 10.0.18362. Whether running it from my hard drive or a thumb drive, I get the error:I am at a loss, because the required folder exists in the directory containing the fontnav.exe file. The program runs successfully on my Win XP SP3 desktop, ran on my Dell laptop under Windows 7, and runs on a friends Toshiba laptop running Windows Home version 10.0.1809. I have tried running it in Safe Mode, using selective startup without Startup items and with and without system services, but always get the same error. I've tried running it under every compatibility mode going back to Win95.Can anyone suggest a solution to this problem, or further troubleshooting steps I can take to get it running on my laptop?Thank you,Terry","solutions":["One other possibly relevant factor: my Win 10 is 64 bit, while my friend's is 32 bit, as are\/were my Win XP and Win 7 versions. Other 32 bit software runs on my laptop, but FontNav 4 may be too old to. If that is the issue, are there any ways around the problem?Thanks,Terry","Which raises another possibility: as old as the software is (ca. 2000), it may be 16 bit, which would explain why it works on 32 bit systems, but not 64 bit. I haven't been able to confirm that it is 16 bit., however.Terry"]},{"symptom":"How to create a desired PIN as a part of Windows Hello?        I would like to have 1234 as my login PIN for my PC and I have been facing this issue after the recent update of Windows 10. Please suggest me a way to set my PIN as 1234, Please do not respond with generic answers explaining the features of Local Group Policy Editor.","solutions":["See this thread which explains that sequential numbers can't be exempted in Group Policy or Registry, especially Kari's post:https:\/\/www.tenforums.com\/user-accounts-family-...Sorry I did the best I could to find a way for you."]},{"symptom":"File and Network sharing not working properly on Windows 10        I have 3 computers on my private network, A, B and C. All are set the same for discovery and sharing. Computer B can access A and C. Computer C can access A and B. However computer A can access only C. What can cause this?Note: access = computer name shows in file explorer\/Network.***Original title: Windows 10 network sharing.***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query related to network sharing between multiple PCs. For further clarity on the issue, I would like to know if all the PCs are running the same build version of Windows 10. One of the things that you can try is changing the settings for the services responsible for network and file sharing by following the suggestions byRoohi_Taj replied on January 8, 2019 and see if that helps. In addition, please make sure Windows is up to date and all the necessary updates are installed. Refer the articleKeep your PC up to date Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Input indicator bug        Hello,I can't disable Input Indicator at all. I tried every single option in settings that is related to the language bar in the task bar and tried every guide.","solutions":["Hi Roma, This tutorial will show you how to turn on or off the Language Bar and Input Indicator for your account in Windows 10.https:\/\/www.tenforums.com\/tutorials\/103041-turn...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Hi Richard,If you didn't notice, I put the image in my question just from that guide. I tried that guide and it doesn't do anything about input indicator"]},{"symptom":"Emails deleting automatically from Windows Mail app        I got a new laptop. I have been using WIN 7 with Outlook Mail app and now WIN 10 with Windows Mail App.  My email messages remained in the viewing pane until I deleted them in Outlook.  Now in Mail they disappear from the viewing pane in a couple of days on their own .  This is very disconcerting for me as I typically leave messages, some for a really long time, in that pane.  I cannot figure how to keep these messages.  There must be some way to tell the app not to delete my messages????***Original title: Email messages disappearing***","solutions":["Hi Gary, Thank you for writing to Microsoft Community Forums.  I understand that you are facing issues with accessing emails in Mail app. For further clarity on the issue, please respond to the questions below: How the email account is configured in the Mail app? (IMAP\/POP\/Exchange)Are you able to see the emails in webmail?Which email service provider are you using on Mail app?Were there any changes made to the email account settings? Ideally, in mail app the emails will sync as per the settings allowed by the email service provider, and we cannot create any rules in Mail app to delete the emails automatically. One of the things that I can suggest you is to check the Archive\/Trash folder in Mail app. In case the emails are not there in Archive\/Trash folder then, you may want to check the settings in the webmail, if any rules are setup for deleting the emails. Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Query related to changing the settings for Display name of the sender in Windows Mail app        Is there a way, when an email is addressed, to display only the first name? For reasons I do not understand, for some of my family members this already happens, even though their entries in People display their first and last names.***Original title: Windows 10 Mail and People***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query related to displaying the names of the sender in Mail app. Based on my research, the Mail app will display the name that is setup by the sender under their email account. However, when you send an email the name displayed will be the one that is saved under People app. I would encourage you to provide a feedback regarding this setting using theFeedback Hub app on Windows 10, so that our engineering team can look into this and try to implement the settings in future builds. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Windows photo viewer        I have a PC fitted with Windows 10 fully updated.  When I attempt to open JPG photos in Photos or  Windows Photo Viewer I sometimes get the message \"It looks like we don't support this file format\".  In the Properties window the Type of file is shown as \"JPG File (.JPG)\".  Other photos with exactly the same file format do open.  How do i fix this problem please?","solutions":["Go Settings, Apps, Default apps, Choose default app by file type, scroll down to .jpg and click on it and pick Photos.Where do you find Windows Photo Viewer?  I can not find it?","Hi Donald. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See discussions of the error plus possible file repair of the pictures (with a trial version to make sure first):https:\/\/www.disktuna.com\/it-looks-like-we-dont-...https:\/\/www.tenforums.com\/general-support\/52877...https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/windowsreport.com\/software-fix-corrupt-... (avoid links to anything but the jpg repairs)I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Having read through the suggestions and tried a couple I am now inclined to believe that the affected files have been corrupted.  I have had problems with my PC and that is probably the cause.  I will delete the affected files and see if I can recover them from my backups.  Thanks for the help.","I agree, Donald. You could try the repair app's trial but if you have a backup that's even better. Really pays to have backups. I copy my User folders to external monthly and have my User folders rooted in OneDrive and backed up to Google Drive backup for real time backup. Let me know if there's anything else. Also when ready please mark the post which helped most as the Answer, to help others. A rating is also appreciated."]},{"symptom":"Google Chrome asking for Parental Permissions when accessing        I installed google chrome on my laptop so I could play some browser game that don't work on Microsoft edge. and despite the face that I am an adult and Microsoft says that my account it a adult account every time I go to run chrome it says it has to ask for parental permission, and if I click for it to ask by email it just gives me an error message.This is the what it says:Something went wrongWe're working on it- try again in a little bit.Trace ID: yjtdNb8VkUW5mxCK.4.***Original title: Need to ask for parental permission to use app despite me being an adult..***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues when using Google Chrome on your PC as it keeps asking for permission from parent. Ideally, you get this error if you were previously added into Family Group as a Child account and then Google Chrome was restricted from being used. Let’s try a couple of troubleshooting steps and see if that helps in fixing the issue. Method 1: Try re-installing Google Chrome on your PC. Refer the below articles to re-install Google Chrome on your PC. Uninstall Google ChromeDownload & install Google Chrome Method 2: Create a new user account and then login with the same Microsoft Account and see if you face the same issue. Kindly follow the steps mentioned below to convert Microsoft Account to Local Account. Press Windows + S to open SearchNow type Your account infoClick on Sign in with a local account insteadFollow the on-screen instructions. Once you move to a local account create a new user account and sign in with your Microsoft Account and then see if you receive the same error. Refer the articleCreate a local user or administrator account in Windows 10 In addition, you can also try providing the parental consent for your Account and see if that helps. Refer the sectionHow do I provide consent for a child account? and sub-section I'm an adult but I'm being asked for parental consent. What do I do? from the articleParental consent and Microsoft child accounts Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"PVConnect        Why can't I save or copy and paste files\/folders to PVConnect?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please try the following steps: Open Start. Search for Command Prompt, right-click the top result, and select the Run as administrator option.Type the following command to perform a quick health check and press Enter: DISM \/Online \/Cleanup-Image \/RestoreHealthIf this does not work, please Uninstall and Reinstall the PVConnect program.","Please let us know if there is any difference after performing above steps."]},{"symptom":"Reactivating Windows 10 after a hardware change        I've tried everything on every article I was directed in and nothing seems to work when I type winver it says I own it but I have that stupid watermark in the bottom right hand oh my screen I'm just asking for help plz","solutions":["Winver tells about the ownership of Windows and has no bearing on the activation of the computer..How did you get Windows 10 on to this computer?  Was it an upgrade from Windows 7, 8, or 8.1?Was windows installed on the computer when you bought it?  If so it is OEM and is not transferable to a different version of Windows.  If you purchased a retail copy of Windows it may have transfer rights.","Hi,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.The last option is to contact Microsoft Support if troubleshooter hasn't helped. Activation depends on what type of license you have of Windows 7\/8\/10. If Windows 7\/8\/10 came preinstalled with the computer, that is called an OEM license. For an OEM license, the license dies as soon as Motherboard dies. So essentially it is non-transferable. If that is the case you need to get a new license.However, this is not same for retail licenses i.e. you purchased the license through Microsoft store. That does carry transfer rights. If that is the case, please see the below steps:Run the activation troubleshooter on the new device using the below steps:Go to Settings>Update and security>Activation and run the troubleshooter. and select I recently changed hardware on this device.(Please note that Activation troubleshooter requires you to have digital license linked to Microsoft Account.)If the troubleshooter hasn't helped, you would have to call Microsoft during support hours to get more help.https:\/\/support.microsoft.com\/en-in\/help\/405170...Please let us know if you need any assistance.","hey I have windows 10 pro and I went to the troubleshooter and I don't have the option to click I recently changed hardware on this device.","Changing hardware requires a license.  Either a retail purchased old one or a new Windows 10 one.","Hi, Please contact Global customer support if the troubleshooter doesn't have an option:https:\/\/support.microsoft.com\/en-in\/help\/405170..."]},{"symptom":"Screen Brightness Issue.        I have installed the windows 10 pro 1607 version. I am facing the screen brightness issue. I an not able to control the screen brightness.","solutions":["Hi Umar, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Likely the display driver is missing. Please see the below options: Option 1.Try Rolling back if you have an option: Go to Device Manager by typing in Devmgmt.msc in Run dialog box. Navigate to Display devices and right click ATI Radeon HD or Similar device you have. Choose Properties.On the Driver tab, hit rollback Driver to go back to the previous version. Option 2. Remove drivers completely and Install the the newest ones available from the OEM or the maker.What you need to do: 1. Uninstall everything of Display driver using DDU http:\/\/www.guru3d.com\/files-details\/display-dri...2. Reboot. 3. Make sure your device manager shows Microsoft Basic Display adapter. 4. Download the driver from the OEM or the maker like AMD 5.Run the Setup and you should be good to go. Disclaimer: Guru3d.com is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","i did not have any licence of drive easy. would you please tell me the whole procedure in the detail.","Hi Umar, No license is required i.e. you do not need to buy any of the products. Can you tell which product are you referring to?"]},{"symptom":"windows 10        is it possible to install software after switching off the s mode in windows 10?","solutions":["That is the reason to turn off the S mode.  S mode requires Microsoft Store downloads only.","Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,What software are you referring to if I may ask? By switching out of S mode, you are able to install software that does not come from the Microsoft store.If you are referring to switching back to S mode, upon switching out you can no longer get back in S mode as the S mode of windows 10 comes mostly pre-installed on devices.Under this link are information in regards to windows 10 in S mode. https:\/\/support.microsoft.com\/en-us\/help\/402008...Let me know how it goes. :)","Hello Gary,I was hoping to install Jasc PaintShopPro. It is not the most current version, I don't think...I had it installed on my Windows 7 pc...it may be too old to run in windows 10, but I think that if i install it to the folder of Program Files x86 that it will work...I had read about the no switching back to s mode, I really don't use apps much, only on my android. I wasn't planning on installing apps on my new pc.  I actually bought the wrong laptop and found out afterward info on the OS, and saw that it is a comparable to a Chromebook,. My understanding of a Chromebook is that it is used mainly for browsing the internet and playing games (basically for installing apps, not software). I really needed the pc for my work, which mainly is working with images and word processing, some audio and video editing, etc...So I decided I needed to see about exchanging it for a different pc, then realized the the one I bought had more memory and storage...that's when I started trying to find out if I can use the software I need to use on the recently purchased pc..I want to upgrade to probably Windows 10 Pro, but for sure Windows 10 Home...I just wanted to make sure I can install software on the version without the s mode...for now...thank you very much for your input:)","Thank you for your response, I am aware that it only installs the MS apps...I wanted to be sure that the new pc with windows 10 s mode would run software after turning it off....Thanks again","My pleasure! Happy to help."]},{"symptom":"Couldn't find a fingerprint scanner compatible with Windows Hello Fingerprint        Hi thereMy fingerprint scanner on my HP Envy stopped working a few days ago.  I receive an error message when viewing the sign in options \"Couldn't find a fingerprint scanner compatible with Windows Hello Fingerprint\".I've checked Device Manager to ensure that it is set to Automatic and running.  ","solutions":["Hi Tina, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.A reinstall of HP Simplepass or the fingerprint driver would likely solve the issue.Please go to the following page and select your model. https:\/\/support.hp.com\/in-en\/driversDownload Validity Fingerprint Sensor driver or HP SimplePass application under Keyboard, Mouse and Input devices.Open the setup and follow the instructions. Also, see: https:\/\/support.hp.com\/in-en\/document\/c05873680Instead of face recognition, remove fingerprint reader in Settings. Let us know how that goes. Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","These are the options that I have under drivers.","Hi Tina, You need to select Synaptics Fingerprint driver."]}]}