{"windows":[{"symptom":"weird green checkmarks on short icons on the desktop        hey all you experts, yet another strange issue I think I've found with microsoft's wonderful windows technology it seems like.  here's what I've got:this weirdness has now started occurring today, after a previous bout of weirdness happened to me last week, which is address in another unanswered thread of mine here:  shortcut indicators (arrows) disappearing when copying unrelated files in windows explorernow, per the title of this thread, I'm seeing green checkmarks on the shortcut icons on the desktop.  I've never seen that before.  have you guys?  It doesn't bother me too much, however ever since these green checkmarks started appearing, the arrow icons that usually appear on top of the shortcut icons have once again disappeared.  so the arrows have since been replaced by these checkmarks.  can any of you guys shed light on this weirdness?   thanks!","solutions":["Hi Adam Those green check marks indicate you files have been backed up to Onedrive or whatever Cloud service you run on your PC . . .When you copy an move files, those will disappear, until such time as they have been synced to the Cloud . . .","Dave,I'm not sure that's correct my man!  I deleted onDrive from this machine a long time ago!  see this image:and it seems to be the case where sometimes the arrows appear, sometimes the green checkmarks appear, and then sometimes NO symbols appear on top of the icons at all!  and *that* is the current case, right now at this hour.  can you explain this stuff to me, Dave?   =)","It looks like One drive to me too.  Look at this video, Sync files with OneDrive Files on DemandVideo        To make a file always available, even when you're offline:Right-click it and select Always keep on this device.To change a file back to an online-only file:Right-click it and select Free up space.","Horace,I'm sorry man, but I'm not seeing anything like you describe.  see this image:","hey you guys!  I've got another occurrance now.  see this awesome image!   Xs now appearing instead of other symbols!   =)","You right click the folders in One Drive. ","I told you before Horace, I do NOT have oneDrive on my machine because I despise microsoft's unreliable products.  what do you suggest I do?  re-download it just to fix a little annoyance like this?","Do a search on your PC for One Drive and see if anything comes up.","there's so many damn directories that came up Horace, it's ridiculous.  see image:","Try to get to one of the top three and right click on it, see if Settings shows. If it does click on Settings>Account>Unlink this PCand see if that helps. Here's a link too, if you need it.https:\/\/support.office.com\/en-us\/article\/Turn-off-disable-or-uninstall-OneDrive-f32a17ce-3336-40fe-9c38-6efb09f944b0"]},{"symptom":"mouse stutter + surfacebook 2 + better performance + sampling rate > 250Hz        Dear Community,I'm using a Surface Book 2 15\" \/ 250GB HHD configuration.I have a problem using my Gaming Mouse (ROCCAT) for a while now on this machine.The pointer stutters \"randomly\" (freezes every few seconds for about a second then jumping ahead).Today I made a connection to the energy profile I use and the sample rate (Hz) set in the mouse driver.Since my system is not set to english i'll call the 3 engery profile settings (the ones you find under the battery icon in the system tray) as follows:1 - longest battery life -> for the battery saving setting obviously (leaf icon)2 - better performance -> for the intermediate setting3 - best performance -> well also obvious (lighningbolt icon)With the mouse set to 1000Hz sample rate there are no issues using energy profile 1. Using profile 2 the pointer is \"hanging\" about once every 20 seconds. When profile 3 is active the mouse is constantly stuttering -> to a point where working with it is almost impossible. (Note that \"best performance\" which should make no compromises in cpu speeds etc. actually yields the worst results here)Lowering the sample rate in the mouse driver helps gradually with every step (250Hz) to the point where at the 250Hz sample rate the problem subsides and the mouse is running smoothly even using energy profile 3(best performance).Now I know what you would think - what's his problem sounds like he's got the fix right at hand.True, though I'm still wondering what's going on with my machine that this problem even occurs - especially since the problem is not connected to increased cpu usage.I tested the mouse on other Laptops and it seems fine.Another mouse model from Roccat has the same stutter problem when used with higher sample rates.Also I tried a really cheap logitech office mouse and it doesn't have any problem (presumably because the sample rate is initially low)Does anyone have a guess what's going on here and if there might be a real fix for the problem instead of a work around?Thanks in advance and cheers to all who made it to the bottom of this essay =)","solutions":[]},{"symptom":"update error 0xa00000400        error 0xa0000400  ","solutions":["Hello! I am an Independent Advisor, I would love to help you out! I would suggest going through the guided walk through for fixing windows update errors. It is a great resource that will take you step by step in order to fix any issues with windows update.Here is the link: https:\/\/support.microsoft.com\/en-us\/help\/10164\/... I hope this helps!"]},{"symptom":"Windows 10 Photo Application        The Windows 10 Photo Application will not run even though my pc tells me it is installed. I get the following messageThis application can't open . Check the Windows Store for more info about Photos. See in Store ","solutions":["Hello! I am an Independent Advisor, I would love to help you out! The first thing I would suggest to do is to reset or repair the photo app. You can find more information and instructions how to do that here: https:\/\/knowhowtechnology.wordpress.com\/2019\/09...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"spacing        How to fix the spacing between icons on desktop","solutions":["Hello i'm Timon and i'm glad to help you. Yes, you can do that, but it means editing the Windows registry, and you'll have to edit the registry each time you want to make a change, which can be inconvenient. There's no simpler way to do it.Here's why I think you shouldn't do that, even if you're comfortable with editing the registry, and this is only my opinion:Although you can, this is not a metric that Windows intends for people to change. As a result, changing it may have unanticipated consequences for the appearance and usability of your desktop.Follow this link for more information: https:\/\/mywindowshub.com\/how-to-change-desktop-...Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products).A possible workaround: Go to your desktop and left click on an empty area of your desktop background. Hold down the CTRL key on your keyboard (do not let go). Now, use the mouse wheel on the mouse, and move slide it up or down to adjust the icon size and its spacing.The icons and their spacing should adjust to your mouse scroll wheel movement. When you find the setting you like, release the CTRL key on the keyboard."]},{"symptom":"Android Your Phone App & PC Notifications: missing CNBC Notifications from Android        Hi,I posted the same question 6 months ago (July 2019). It seems like every app that creates a notification on my phone, except for one app, shows up on my PC. For some reason the CNBC app on my phone, when it creates a notification on my phone, it does not show up on my PC. I've checked the Your Phone app on PC under customize, then the option to pick which apps notify me, and CNBC is set to receive notifications on PC.Is there any setting on my phone I need to change so that when CNBC creates a notification on my phone, it shows up on my PC? If not, can you report this to Microsoft developers so they can figure out why this is happening?","solutions":["Hello Tim_539, I am Andrew an independent advisor. Perhaps there is a setting within the app causing this to not send an alert to your phone. Search through the app settings on your phone.If you wish to send this feedback to Microsoft you can do it from your computer. Type FEEDBACK in to the Windows search bar, it will bring up the feedback app.Take Care, Andrew","I've checked the app settings, and no settings to change. It should be working."]},{"symptom":"windows 10 64 bit version        since the latest updates as from 07 01 2020 the keyboards and mouse are frozen or stuck until I hit the windows key or others. have deleted one update and now held them off for a few days. it also sticks when typing ","solutions":["Open start and search for feedback and open Feedback Hub app and report this issue.Is it desktop PC or Laptop ?","Hi dpetra127, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Try to recover the operation of your keyboard and mouse through the following indications, it is a link that some Windows MVPs share.https:\/\/helpdeskgeek.com\/windows-10\/is-your-key...If the above steps do not work, starting Windows through a clean boot is an error-proof process that helps us detect if the problem is generated by third-party drivers or programs, if the error does not happen after executing it, go to >> How to determine what is causing the problem after you do a clean boot https:\/\/support.microsoft.com\/en-us\/help\/929135...We can complement the previous step with a scan to your computer, in search of corrupt files that interfere with the operability of Windows, if they exist, and are detected, they will be repaired automatically.https:\/\/support.microsoft.com\/en-us\/help\/929833...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Home LAN unable to share with all computers        I have 3 computers running Windows 10 Pro and 1 computer running Windows 10Home. All 3 Pro computers can see each other and share files. All 3Pro computers can see the Windows 10 Home computer but cannot see any of theHome computer's shared folders or files. The Home computer can see all 3Pro computers and their shared folders and files. Specifically, while in the files explorer on a Pro computer and I double click on theHome computer icon, I get either a error code 0x80070035 or cannot access \\\\Home-computer-name. I think I've read all of the \"try this\" without any luck. My only work-around is if I type in \\\\Home-computer-name\\users\\mystuff, I can access the mystuff folder. Is this all a pesty bug or can a Windows 10 Pro computer share filesboth ways with a Windows 10 Home computer?ThanksSenior Bill","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues while accessing shared folders over the network. One of the things that I would suggest you is to refer the suggestions byRoohi_Taj replied on January 8, 2019 and see if that helps. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Windows Mail has accounts \"Disappear\"        I am using my Windows Mail Version 16005.12228.20276.0 on Windows 10 version 1909.I have several accounts linked to Mail.3x Yahoo2x Outlook1x GmailA few weeks ago, when I logged in, it only showed my Outlook mails. I had to spend a significant amount of time re-linking my Yahoo and Gmail accounts. It gave me some grief (yahoo sync issues) for a couple of hours, but has worked fine since then. I am on this email daily, and it has worked without issue for weeks.Today, it again is only showing my Outlook accounts.Why are my accounts disappearing? Note, this is not a password or sync issue. Mail appears as if those accounts dont even exist. They are simply not even listed. I cannot keep adding and setting up emails every time Windows \/ Mail does an update or decides to clear itself.What is going on with this program, and how do I prevent it. If I have to spend 2 hours again, it will be setting up an alternative mail service.","solutions":["Hi Steve, Thank you for writing to Microsoft Community Forums. I understand your query related to accounts being removed from Mail app. For further clarity on the issue, please respond to the question below. Were there any updates installed recently on your PC? To check which updates were installed recently, go to Settings > Update & Security > Windows updates > View installed update history Meanwhile, I would suggest you to try running the troubleshooter for the Windows Store apps and check if the issue persists. Press Windows + I keys together to openSettingsNow click on Update & Security and selectTroubleshootScroll down and look for Windows Store appsClick on it and select Run the troubleshooterFollow the on-screen instructions Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Touchscreen nightmare after Windows 10 1903 install        Hi:I'm having problems with the Touchscreen (TS) on my HP Pavilion all-in-one 27-n190st Desktop\/Product # P2N43AV#ABA\/OS 1903 (10.0.18362)The TS stops working. I go into device manager \"HID-compliant touch screen\". Under Properties, General it says \"Currently this hardware device is not connected to the computer (Code 45). Reconnect this hardware device to computer.\" The disable\/enable is not available when Code 45 is displayed. The only way to fix the issue is to uninstall the HID-compliant touch screen driver. When I restart the computer the driver is back and will work for most of the day. If I stop using the computer for a few hours the touchscreen stops working and the exact same problem returns.Under \"Events\" for TS it says on 8\/8, when this problem started, \"Device Migrated\". I reinstalled the driver many times since then.After re-install of driver, another message says HID NOT migrated \"due to partial or ambiguous match\". When the TS is working, under driver \"Details\", it says no driver files are required or have been loaded for this device.1. I've \"scanned for hardware changes\" under HID Devices and HID touchscreen. No results.2. Under power management \"allow the computer to turn off device\" is unchecked 3. I tried to run a test on the touchscreen from F2. The problem is There's no \"Mouse\/Touch-pad\" on the list of tests. There's only a \"Mouse\" test.4. I went into startup menu in the bios. I hit F9. It asked me to select boot device. UEF I boot sources were: Windows Boot ManagerUEF: I IPv4 ... Family ControllerUEF: I IPv 6 ... Family ControllerLegacy Boot SourcesI chose \"Windows Boot Manager\". It rebooted and touchscreen worked but, it again stopped working after not using it for several hours.When the touchscreen stops working ... the USB Input Device also stops working. It also \"Migrated\"  on 8\/8, the same day the HID touch screen migrated. The USB Input device properties says \"The device cannot start  (CODE 10). \"Operation failed\".Most importantly, I noticed that Windows 10 1903 version was installed on 8\/8\/19, which is the day the Touchscreen Driver and the USB input device migrated and these problems started.5. I ran the \"Detect My Drivers\" in HP Customer Support. The result was: \"Detection was successful but you don’t need any new drivers at this time.\"6. I've selected \"update driver\" when in HID Touchscreen within Device Manager. Results: \"Best Device for your driver is already installed\" 7. I ran HP Support Assistant. It says No Updates Available. 8. In HP PC Hardware Diagnostics I ran the Mouse touchpad Drag and Drop test. I ignored the results because ALL it says is \"Failure ID: M08770-8159PN-QFFX61-G1UA13 RESULT: Failed\" But when I click on the ID it says \"The test found a problem with the mouse button. The mouse may need to be replaced.\" The problem is The mouse works perfectly.  It says nothing about the touchscreen ... even if I run the test while the touchscreen isn't working. 9. Touchscreen doesn't work in Bios10. I've installed all Windows 10 updates.Again, All of this started on 8\/8 when I installed Windows 10 1903.Any ideas would be greatly appreciated.    Thanks","solutions":["Update:I tried using F2 and testing the touch screen using HP PC Hardware Diagnostics UEFI. The Touch screen was not working on the main computer BUT the \"Touch Pointer test\" ... passed and the \"Touch and Drag Test\" ... passed. I went back into computer and the touchscreen still didn't work.Now under Device Manager it says touchscreen working, but it's not.","I forgot to add that I did an \"System Extensive Test\" in \"HP Hardware Diagnostics Test\" program.  It took a few hours. No problems were detected. **************************************************************Update:I tried using F2 and testing the touch screen using HP PC Hardware Diagnostics UEFI. The Touch screen was not working on the main computer BUT the \"Touch Pointer test\" ... passed and the \"Touch and Drag Test\" ... passed. I went back into computer and the touchscreen still didn't work.Now under Device Manager it says touchscreen working, but it's not.","i'm having problems with 1903 and a hp 24-b017c touchscreen all in one AIO PCI shouldn't have forced the 1903 update it seems.  I got the touch screen working for a while again after downloading drivers from the HP site for this particular model but it seems a reboot later, and the system probably upgraded drivers and touch screen stopped working.  HP support assistant tool shows everything up to date. Sounds like a driver issue for HP and microsoft to sort out. ","Interesting that no one from Microsoft has responded to these posts, Maybe it's not a big issue for others. I've tried every fix I could find on the internet.There's a guy on this forum that's very knowledgeable. He's been on the forum for 10 years. His name is \"Greg Carmack - Windows MVP\" but I don't know how to get a hold of him. ","I am having very similar issues with with the MS HID touchscreen driver on my Asus VivoTab Note 8 since updating to 1903 Windows 32bit Home Edition. Once in a great while the MS touchscreen driver will load on boot and the touch screen will work for that session. But the next time I start the machine the driver is missing and I have no touch screen. There seems to be no consistency as to when it loads and when it does not load. Sometimes when it does not load my I2C device indicates an error 10.I have all the latest driver updates installed on my machine. The fact that the MS touchscreen driver at times loads and the touch screen works for that session indicates to me that all the necessary software is in fact installed and works. The fact that the driver most of the time just does not load indicates to me that this is a Windows issue MS needs to fix.","Im having the same problem, you have tried more fixes than me. Im getting the code 45 hardware not connected. Also uninstalled and installed. Is there any hope? I keep seeing this do a troubleshoot of the hardware using windows but i cant find that option, i think windows removed this troubleshoot option witch a recent update. I just want to say, what a terrible update it was ","Wow, misery does love company.  I have the same problem and have also tried many fixes.  Both mine and my mother's touchscreen laptops (one ASUS, one HP) are not working - when it acts up, it's a nightmare to navigate anything.","Update: Since a Windows 10 update about a month or so ago I and my girlfriend are both experiencing mouse problems that also point to issues with Windows 10 loading device drivers on startup. Sometimes when we start Windows 10 the mouse is erratic and uncontrollable. It bounces all over the place. She has a Microsoft mouse and I have a Logitech mouse. In both cases the only thing that fixes it is to reboot Windows 10. Usually one reboot will fix it, and then it may not happen for several Window 10 startups. But invariably it does happen again.","I am having same problem on a Lonovo all in one B-40. Since this 1903 update a couple weeks ago. It first showed the HID touch screen drivers in device manager. After I checked show hidden devices. There was only a uninstall option. No stop and restart. I was getting a 45 code saying not connected. I did a backup. Then uninstalled the driver. Pressed the check for hardware changes. Never reinstalled in device manager. Turned the computer off. No joy no luck. Can't go back it says because I installed this more then 10 days ago. There is no ability to go back to previous version.  What kind if BS is that. I also before doing this did check for updates. And also driver updates. All said there were none and everything is fine. I tried troubleshooter, but there is no longer a check hardware catagory. I am getting totally disgusted with this cesspool called Microsoft. Then they have the nerve not to help you fix this crap.Lenovo warranty is up.  I can't get drivers from then unless I renew. I went into www.catalog.update.microsift.com. No HID driver that I can see I can use for the computer. I just finished a SFC and it shows no integrity violations. I finally got the 1803 working after that update and losing search and all the tiles. Now this after all was finally working. I gave this to my kid and I actually bought a MAC about a year ago.  Not one problem, but this Microsoft BS is getting old and. I should have dumped it this black Friday and cyber Monday. Get her a MAC also especially since I see no help coming from Microsoft. ","I have had the same problem for some time. I have a Lenovo Yoga 3 running Win 10 home, version 1909. I have tried most of the fixes suggested online with no success. However I stumbled on a fix that works for me and seems to activate the touchscreen. All I have to do is put the machine to sleep from logon screen. When the machine wakes from sleep touchscreen works. Unfortunately I have no idea why this works. Hope this might be helpful."]},{"symptom":"BIOS error        HelloI recently bought a gaming PC and 1 month into using it my RAM started to be undetectable (it was doing 1 long and 2 short beeps on start up and wouldnt display anything on the monitor)I eventually got the PC to recognise the RAM by doing the following:- removed the graphics card and re installed- unplugged all the connectors to the motherboard and plugged them back in- remove the CMOS battery for a minute or so- slotted the RAM back inWhich worked, the beeping stopped. HOWEVER it came up with the error message BlInitializeLibrary failed 0xc0000001 Can some one help? Windows wont boot now :(Thank you","solutions":["Hi K4YFc My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.This error has been known to occur as a result of one or more of the following: Cause 1: SAM file is damaged The SAM(Security Accounts Manager) file stores the user credentials data and is essential to Windows booting process. If that file is missing or corrupt, then the boot process is halted.Cause 2: System files are damaged Sometimes, this error may occur when the key boot-related system files become damaged because of disk write error, power outages or virus attacks.Cause 3: File system integrity compromised Alternatively, this error appears when the whole file system gets damaged on a grander scale for the same reasons.Cause 4: RAM is damaged In the worst case scenario, the PC’s memory could be permanently damaged. I would advise to switch the PC off, remove the power cable then remove the RAM module (ensuring you are earthed) and leave for a few minutes. Then re-install the RAM module and try booting the PC again.Hope this helps."]},{"symptom":"HOW CAN I RESET MY LOGIN PASSWORD?        SOMEHOW MY LOGIN CHANGED, AND I HAD TO USE MY MIROSOFT PASSWORD TO GET THE COMPUTER TO TURN ON.  I DO NOT WANT THAT O HAPPLEN EVER.","solutions":["Hi Thomas, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Did you login with Fingerprint or PIN before? You need to select the respective button at the prompt. In the attached image from left to right is Picture password, Password and PIN.Image credits tenforums.com","I USED A PIN.","Thanks. Then just select the rightmost icon under sign-in options and you should be good to go.If you have difficulties let us know."]},{"symptom":"No Document in Word won't print, but I can print from other sources        Hi there,Here is what is going on, I can't seem to print any document from Word, but I was able to print something from a browser. Why would that be happening? Thank you,Kevin Davis","solutions":["You need to tell the forum what happens when you try.","Hi KevinDavis1970, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.When printing is executed, do you see any messages or errors? Or it just doesn't print? Does this happen only with Word? Or all Office documents? If that document converts it to PDF, does it have the same error?https:\/\/docs.microsoft.com\/en-us\/office\/trouble...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M."]},{"symptom":"logitech c 270 web cam        how can I get a camera app to run this camera on windows 7 to take a still picture?","solutions":["Hello. You can get the Logitech software here. Click the download on the left menu. https:\/\/support.logi.com\/hc\/en-us\/articles\/360024320953"]},{"symptom":"PROBLEM        WINDOWS 10 UPADATES GETTING TROUBLE IN MY DEVICE","solutions":["I HOPE TO YOU WILL SOLVE MY PROBLEM","Hi Madhu448713 please try each of these and check for updates after each 1) Run the update troubleshooter settings -> Update & security -> Troubleshoot on the left, click windows update then click the run the troubleshooter button. 2) click start, type powershell right click on powershell and select run as administrator type (or paste) the following and press enter after each one net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver 3) follow the steps given in the \"fix windows update issues, walk through\" https:\/\/support.microsoft.com\/en-us\/help\/10164\/...please let us know how you get on. if you are still having issues please give us a bit more information, is it a feature update or all updates? do you get any error?what is happening when windows tries to install updates?"]},{"symptom":"Game Crashes on Windows 10        Almost all of my games crashed within an hour of playing and I don't know why","solutions":["Hi John Most likely this is caused by your video card device driver, while that may be up to date, an older version of that driver might be more compatible with your PC and stabilize your system . . .Open Device Manager (accessible by right clicking your Start Button) Expand the Display Adapters Section Right click your video card and choose Properties On the Driver Tab, choose 'Roll back Driver' Restart your PC once done . . . If that option is grayed out or does not resolve the issue, go to the support page for your device on the manufacturers website, then download and install the video driver they recommend, it may well be an older version to the one you are currently runningIf you are actually getting blue screens, to diagnose the underlying issue, I need to analyse your Mini-dump file(s):Open Windows File Explorer Navigate to C:\\Windows\\Minidump Copy any minidump files onto your Desktop, then zip those up Upload the zip file to the Cloud (OneDrive, DropBox . . . etc.), then choose to share those and get a share linkThen post the link here to the zip file, so we can take a look for you . . .","This is my minidump folder: https:\/\/www.dropbox.com\/s\/gswvqyp59scxz3r\/Minidump.zip?dl=0","Hi John Analysis of your minidump files indicates the Nvidia graphics card device driver on your PC is causing the system crashes . . .A lot of the time, this is caused by the newest device driver being installed and installing a slightly older version of that can resolve this . . .Open Device Manager (accessible by right clicking your Start Button) Expand the Display Adapters Section Right click your video card and choose Properties On the Driver Tab, choose 'Roll back Driver' Restart your PC once done . . . If that option is grayed out or does not resolve the issue, go to the support page for your device on the manufacturers website, then download and install the video driver they recommend, it may well be an older version to the one you are currently running"]},{"symptom":"Windows needs to flush\/register DNS and release\/renew IP after every boot to connect to internet        Hi,Whenever I turn on my PC or disable\/enable network adapter, it does not connects to internet without flushing and renewing DNS\/IP. I have tried updating\/reinstalling network drivers, even I reinstalled the whole OS but still the problem exists. Any solution please!","solutions":["Hello,Try to perform Network Reset once:1. Open Settings app, click Network & Internet > Status > Network reset link.2. Now click on Reset button on next screen.3. In confirmation prompt appearing next, click Yes.Let us know if this helps!Reference: https:\/\/www.kapilarya.com\/how-to-reset-network-settings-to-default-in-windows-10Note: Included link in this reply refers to blog post by a trusted Microsoft MVP.","Hi, Try these commands on CMD. netsh int tcp reset netsh int ip reset You can also try to reset your router.","Also tried network reset, same problem"]},{"symptom":"Downloading camera pictures...        In Windows 7, I plug in my camera and it automatically selects Photoshop CS6, Bridge, as the receiver. I can't get Windows 10 to do that. What settings can I change? Can't find them.","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.This article gives details on how to change the settings which control the action taken when you plug in your camera:https:\/\/www.windowscentral.com\/how-configure-au...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi Diana, Did you try the steps I suggested? Regards, Ross","Yes, I tried all of them multiple times but none of them work. It only wants to download my pictures into Onedrive. I need Photoshop Bridge to come up as an option. So what I have to do is open up Bridge and then click on Download pictures from camera...and then it will download them."]},{"symptom":"Safe Mode will not recognize password        Windows 10I can access the safe mode screen bit on entering password I am told Password invalid.I have tried safe mode with networking and used my microsoft password without success.From Googling this problem it would that this could be a OS bug.Please can you advise how to work around itCurious Roblin","solutions":["Try to enter the safe mode with the network function to repair, it may be that the network controller is outdated.Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. As soon as you see the Windows logo with the rotating dots, press and hold the power button until the computer turns off. Do this process twice..-Turn on your computer for the third time, and let it load. .-You should receive this message: Preparing Automatic Repair. After entering Mode Update the network driver may be outdated"]},{"symptom":"Overscan        My display driver does not allow me to adjust for overscan to make my display fit my screen. I have tried updating the driver but get nothing,","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please reset the Display Driver and check: Go to Device Manager. Locate Display Adapter. Double tab on it. Right click on the Graphics Driver and select Uninstall ( Do Not click on any check box).Restart the PC. Let me know the Model Number of the PC if this does not work.","Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.What's the brand and model of your computer, graphics card and display? This will allow us to find out more for you."]}]}