{"windows":[{"symptom":"i want a fresh install of windows 10 home on my conputer that is running the same windows 10 home system .. do i need a product key to do the fresh install?        what do I need for a fresh install of windows 10 home ... do I need a product key?","solutions":["Hi there, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.The first step is to determine how you have activated Windows 10. This is either with a 25 character product key, or through a digital license.Please go to this webpage and see the section under \"What activation method do I use, a digital license or a product key?\"https:\/\/support.microsoft.com\/en-ca\/help\/12440\/...Digital licenses are typically associated with the Microsoft Account used to log in to the computer. If you are using a Microsoft Account, activation should occur seamlessly if you are using the same account upon re-installation.\"If you have a digital license for your device, you can reinstall the same edition of Windows 10 on this device without entering a product key.Make sure that Windows 10 is activated before you try to reinstall it. To find out, select the Start button, and then select Settings > Update & Security > Activation . You’ll be able to confirm that your Windows 10 has been activated and that your Microsoft account is associated with your digital license.\" I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","If the computer was activated there is no longer a need for a key.If asked for a key just go to the bottom of the page and click on Skip, Do this later, or I do not have one.","Activation is registered against the motherboard as the main component of the device. As long as you have activation against that motherboard prior the clean install and you install the same edition (Home or Pro) activation will be automatic once connected to the internet, you don't need a licence key."]},{"symptom":"PC crashed every time Windows does a definition update        Hi all, whilst gaming after midnight UK time I noticed my PC would crash and become unresponsive and needed to be rebooted. I could not understand why as this is a brand new home built Ryzen 9 PC with 32 gb ram etc. This obviously had me worried.Then some days after it crashed again (after midnight UK time), each crash was at the same time of night and I also noted that the windows updater \"loading icon\" was visible on start up which lead to me wonder if Windows updates were causing the crashes.I checked the Windows update settings and the update time period was set to the time frame I was online and gaming when the crashes occurred. I then changed this to a more preferable time. On checking the update history I could see that Windows definition updates were done at the time of the crashes.Tonight I had the same crash with the same \"loading icon at bootup\" and low and behold, windows had updated the definitions at the time of the crash!Windows updates, more specifically the definition updates which are \"silent updates\" are crashing my computer so is Microsoft aware of this and looking into it ? As you no longer get a notification when windows is updating how do we avoid heavy application during the process ?I do not want this £2000 pc wrecking for sake of a silent Windows update!","solutions":["HI Craig. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything possible for fixing failed Windows Updates, so that at least something will work before you work through them all. Even if you've tried a step, please do it over in sequence:Some Updates will sort themselves out in a few days so I'd wait to see. If not or they are bothering you then here are steps you can take:1) Run the Windows Update Troubleshooter from Windows Settings > Update & Security > Troubleshoot.2) There is a new guided walk-through from Microsoft for repairing Windows Update that leads up to resetting components if necessary:https:\/\/support.microsoft.com\/en-us\/help\/10164\/.... Try running that first. 3) If that fails try manually resetting Windows Update Service: Open administrative Command Prompt and type following commands one-by-one followed by Enter key.net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Close Command Prompt and see if Windows Updates works then 4) You can also install the Updates manually that fail to install, which are logged at Settings > Update & Security > Windows Update > Installed Update History, and then search for those to download and install from this Catalog:http:\/\/test.catalog.update.microsoft.com\/v7\/sit... 5) If they continue to fail and interfere, then you can block them using one of these methods:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... 6) If problems with Updates have become chronic and especially if you have other performance problems, go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 7) If nothing else works then do a Repair Install, by installing Media Creation Tool, open installed Tool and choose to Upgrade the PC Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version 1909. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... _____________________ Good news! There are major changes in Version 1903 giving back control over Updates to the consumer. Microsoft has heard us at the highest level who announced this here:https:\/\/blogs.windows.com\/windowsexperience\/201..._____________________ I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I forgot to add, Windows no longer asks you to reboot like it used to apply the updates. It just goes ahead and does it regardless of whether you are working or gaming at the time."]},{"symptom":"microsoft store absolutely broke please help.        my app store has been broke for ages. the install button is unresponsive and does nothing. i try to run wsreset and it hangs, i reset the stores data and nothing happens, i ran scripts on powershell to reinstall the app store and they dont work, ive ran loads of trouble shooters and all i got was that they couldnt identify the problem, i tried SFC \/Scannow, and DISM \/Online \/Cleanup-image \/RestoreHealth and it didint work. I cant use the media creation tool as it says i cant save my apps and data because im trying to downgrade or whatever, the thing is though, that the bug changes, its either that the install button can be clicked but does nothing, the install button is grey and cant be clicked at all or the install button works, but the game is stuck on starting download, i am trying to download minecraft windows 10 edition on my new pc, which i already did but the game wouldnt open so i uninstalled it and here i am, ive tried everything and im so fed up of it, could i please get some help? thanks.","solutions":["Hi icyigor Click your Start Button, type winver and hit Enter On the resulting dialog, what Version No. and build No. of Windows 10 are you running?","1909 build 18363.418","Paste this in your browser and report the results, please.ms-windows-store:\/\/home","it opens the home screen of microsoft store","If you use that URL, does the Microsoft store then work for you ?In that, you can see all of the apps that are available at the store and you are able to download and install something ?Just wonderin.","The apps still won't download if I use the url, I am able to see all the apps I can't install any of them though. ","If it wouldn't be too much trouble .......Might I ask you to start the Edge browserGo to \"ms-windows-store:\/\/home\"Left click on the 3 horizontal dots in the upper right corner.Left click on \"Download and updates\"Then, left click on the \"Get updates\" button.Please let us know (screen prints are always nice) what happens when you click on the three(3) dots, :Download and updates and \"Get updates\" buttons.I am hoping that the store will recognize apps already installed on you pc (including the Microsoft store\" app and then attempt to download and apply updates to them. (Including the Microsoft store app)).Maybe, just maybe, the Microsoft app on your pc is damaged in some way and that, allowing the store to update the MS store app on your pc (if we can), might have some value in resolving this issue.One additional thing .............May I ask you to ....Right click on the \"Start\" button.Left click on \"Run\"Type in \"Winver\", then click on the \"OK\" button.Finally, post a screen shot of the results from \"Winver\".It will be interesting to \"see\" what version and build of the OS your pc is on.","Hi icyigor and thanks for reaching out. My name is Joseph. I'm an independent adviser. I'll be happy to help you out today.I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/www.kapilarya.com\/how-to-repair-windows...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","my pc is version 1909 build 18363.418also the check for updates thing stalls and never loads in, unless it takes a while ","i cant repair it because it says unsupported directory, should i try a system refresh?"]},{"symptom":"windows 10 100% disk        After being offline for a day or so, Windows 10 will spend 10-20 minutes at 100% Disk installing updates or whatever it's doing...  During this time the user interface so slow and unresponsive and  is unusable.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please make sure all the pending updates are installed. Then run Command Prompt as Administrator. Enter the following command. sfc \/scannow"]},{"symptom":"pdf files        For about the last month, when I try to open my downloaded pdf files, I get a message that the file needs conversion.  This has not happened before, I don't know how to fix it, and am endlessly frustrated.  Where do I convert, how do I convert, and convert to what???  Please help!","solutions":["Have you downloaded Adobe Reader DC?","Hello CherylRyder, I'm Didi, an independent advisor. Which software are you trying to open the PDF files with ? Go to File Explorer, find one of your PDF files, right-click on it > Open With and click on Microsoft Edge or any other browser that you like to use.The PDF file should be readable in the browser. If you want to open your PDF files automatically with your favorite browser : In Explorer right-click on one of your PDF file, click on \"Open with\" > \"Choose another app\", check \"Always use this app to open...\" and select your browser from the list.If you can't find your browser in the list right away click on \"More apps\". Regards, Didi","Thank you, thank you, thank you!!!  I downloaded Adobe Acrobat Reader DC and everything works!"]},{"symptom":"Windows Credentials Request when trying to access another pc on home Network        I have a desktop PC and a Laptop on my home network. I could share file using the network and sharing option. After the 1803 update when Homegroup was removed I could no longer access the computers in either direction without the Enter Network Credentials appearing. Recently, following one of the many supposed fixes I have managed access from my Desktop to my Laptop. The reverse direction remains stubbornly inaccessible.I have tried setting the credentials in the same way as the working direction using the Microsoft account and password, without success. Any help would be much appreciated.","solutions":["This helped me:in \"run\" type gpedit.mscthis will open Local Group Policy Editornow, navigate to Computer Configuration - Windows Settings -Security Settings - Security Options and in right window open \"Network access: Named Pipes that can be accessed anonymously\".Than type IPC$ in opened window.Apply, press OK, and you will now be able to access everything as before.You might have to install the Local Group Policy Editor to get the gpedit.msc to run.  You should be able to find it by googling for the installation batch file.  This solved my problem with Asus O' Play having login fails and asking for username and password when attempting to access Windows 10 Shared computers on my network.  Make sure you follow all the other fixes along with this one but this is the big one that most people don't know about.  ","Hi DAWizardMD..Thanks for the reply. Still trying to source something to create a disc image"]},{"symptom":"My INTEL(R) .... Network adapter is not working (Code 10)        Hello I am experiencing a problem with myIntel(R) 82578DM Gigabit network connectionIt always shows ( the device can't be started Code 10) on the device managerI have Win10 pro 64 bit and my Desktop is HP Compaq 8100 Elite CMT PC It contains all the necessary devices in addition Nvida Graphic Card.thanks in advance Ibrahim ","solutions":["Hi Ibrahim That network card (Intel 82578DM) is listed as not supported by Intel or Microsoft on Windows 10 . . .https:\/\/www.intel.com\/content\/www\/us\/en\/support...Was your system previously Windows 10, and if so, did that WiFi driver work since upgrading to Windows 10?The latest driver for that is for Windows 7 form the link below, you can try installing that into Windows 10 to see if that succeeds, however, if you are running a recent version of Windows 10, most likely that will not workhttps:\/\/downloadcenter.intel.com\/product\/55352\/...Most likely your best option would be to purchase a new WiFi card, those are available online from $5+ and they are very easy to fit . . .________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","Thanks a lot for you valued response however, it was working on Win 10 before although my PC is originally a Win 8 when firstly purchased.I will try that driver (however, i think it will not work too as i tried the win 8 driver but it says there is no network adapter connected to your PC) thanks and will update ASAP.thanksIbrhahim","Now I got the response This is not supported by your OS.and Installation process will abort.thanks IbrahimThere must be a solution for this as it was working before....","Hi Ibrahim Have you received a large Windows 10 update lately? Click your Start Button, type winver and hit Enter On the resulting dialog, what Version No. and build No. of Windows 10 are you running?","Hi Ibrahim Have you received a large Windows 10 update lately? Click your Start Button, type winver and hit Enter On the resulting dialog, what Version No. and build No. of Windows 10 are you running?Dear Dave The version is : Microsoft Windows 1903 (OS Build 18362.535)this is what i received :) thanks for your helpIbrahim ","Hi Ibrahim Yes, version 1809, 1903 and 1909 have made some older hardware Legacy, which would have previously worked on Windows 10 . . .The only solution I fell will work is a new network card, they are very inexpensive ($5) these days and would future proof your PC .. .","Hi Ibrahim Yes, version 1809, 1903 and 1909 have made some older hardware Legacy, which would have previously worked on Windows 10 . . .The only solution I fell will work is a new network card, they are very inexpensive ($5) these days and would future proof your PC .. .OkayThis is my question now :)If i bought a new Network adapter .. (most recent one) PCI.It can work for my Desktop, or not?or I still using my USB network converter however, it is only 100 MB and my network is 300-500 MB.Thanks Ibrahim ","Hi Ibrahim Yes, a new card, so long as it has the same slot, will work perfectly on your PC with Windows 10 . . ."]},{"symptom":"Personal Vault        Can't unlock personal vault with codes?    Error Code: 0x8031b003","solutions":["Hi AirGumby1944, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.You can try the following, these indications solved the problem with this same error code 0x8031b003 to other users.1.- Move all the data in the personal vault to a new folder. In OneDrive online with the browser of your choice.2. In OneDrive online, you deactivate the personal vault >> Personal vault settings >> Menu >> Personal vault options. Two warnings appear.3. In the Explorer, you remove all the remains of the personal vault. There must be a link in the personal vault and a personal vault folder that stopped working.4. Finally, you enable the personal vault, online in the browser. When you open the personal vault locally, all data must be there. Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M."]},{"symptom":"error message trying to install vcredist_ia64        \"This setup program requires an x64 platform. It cannot be installed on this platform\"tried to install all the c++, but the error is still happening","solutions":["That file is for itanium 64-bit processors on server hardware. If you have a standard 64-bit AMD\/INTEL processor you would install vcredist_x64.exe. For 32-bit processors and 32-bit applications, you would install vcredist_x86.exe."]},{"symptom":"I can't get into my windwos 10 computer        I can't get into my windwos 10 computer allof a sudden. It rejected my PIN and asks for a Password. It rejects my windows passwoprd. Can somebody please help. I my passwords are good . I am on this site from another old computer","solutions":["Hi RogerPelletier2, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Try to solve the problem by following these steps: 1.- Start in safe mode Press the >> Shift key on your keyboard, while clicking on Restart, continue pressing the Shift key until >> Advanced Recovery Options Menu >> Click on Troubleshoot >> Click on Advanced Options >> Click on Startup Settings >> Click on Restart, now Press (the option indicated) to enable safe mode >> Wait while Windows 10 starts in safe mode.https:\/\/support.microsoft.com\/en-us\/help\/12376\/...2.- Activate Inbuilt Administrator Account. Press the >> Shift key on your keyboard, while clicking on Restart, continue pressing the Shift key until >> Advanced Recovery Options Menu >> Click on Troubleshoot >> Click on Advanced Options >> Click on Command Prompt and enter the following command: net user Administrator \/active:yes Now reboot your system and log in to the built-in administrator account and try resetting the password for another account. Once you reset the password, log in to another account and to deactivate the built-in administrator account, enter the following command at the elevated command prompt. net user Administrator \/active:no Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M.","Hi RogerPelletier2, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Try to solve the problem by following these steps: 1.- Start in safe mode Press the >> Shift key on your keyboard, while clicking on Restart, continue pressing the Shift key until >> Advanced Recovery Options Menu >> Click on Troubleshoot >> Click on Advanced Options >> Click on Startup Settings >> Click on Restart, now Press (the option indicated) to enable safe mode >> Wait while Windows 10 starts in safe mode.https:\/\/support.microsoft.com\/en-us\/help\/12376\/...2.- Activate Inbuilt Administrator Account. Press the >> Shift key on your keyboard, while clicking on Restart, continue pressing the Shift key until >> Advanced Recovery Options Menu >> Click on Troubleshoot >> Click on Advanced Options >> Click on Command Prompt and enter the following command: net user Administrator \/active:yes Now reboot your system and log in to the built-in administrator account and try resetting the password for another account. Once you reset the password, log in to another account and to deactivate the built-in administrator account, enter the following command at the elevated command prompt. net user Administrator \/active:no Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Hi Marc,I have a similar issue, I attempted to access Safe Mode but then my password was not working. Eventually I noticed I was in Airplane mode but by rebooting in F5 I'm now able to connect to the internet but password still not working. I have reset my password and no luck. Whenever I restart the reboot reverts back to Airplane mode and the cycle continues. Any ideas?Thanks,Andy"]},{"symptom":"cannot create a new folder in Win 10        I have not been able to create a folder in windows 10 for sometime now. need advice","solutions":["Where are you trying to do this?  More information more help.","Hello DonBaugh, I'm Didi, an independent advisor. Can you please explain to us why you can't create a new folder so we can help you better ?Do you see any error message when trying to do it ? When you go to File Explorer then to a location where you want to create a folder and you press simultaneously Ctrl + Shift + N (a shortcut to create a new folder) or you right-click New > Folder, what happens ?Regards, Didi"]},{"symptom":"Boot Manager        Why does Boot Manager come up every time I start up my computer.  If I hit the escape key on the Boot Manager window the computer goes to the log in screen.","solutions":["Hi Nance. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) First check your PC or motherboard maker's Support Downloads web page for a UEFI firmware Update, download, follow the instructions closely on the download page, nearby Support articles, and\/or the Read me file included in download, to install the Update, restart PC. If this fixes it, you're done. If firmware is latest go to next step.2) Go into UEFI Setup to check that Windows Boot Manager is set first in Boot Priority Order. You may need to scour the tabs there for a Boot or Advanced tab. Here's how to access it:http:\/\/www.isunshare.com\/windows-password\/four-...3) If it is already set there, then take note of Settings in Setup for UEFI, CSM (should be disabled unless you're also booting a Legacy format OS), Secure Boot and Fast Boot.4) Now reset the UEFI Firmware to defaults, Save and Exit. You may have to search for this setting but it's always there. If it's offers \"Optimal defaults\" go ahead and choose those.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Upgrading to Windows 10        Below are my computer specification, can I upgrade to Windows 10? ThanksManufacturer: ToshibaModel: NotebookProcessor: Interl(R) Core(TM) i7-3612QM CPU @ 2.10GHz 2.10GHzInstalled memory (RAM): 8.00GBSystem Type: 64-bit Operating System","solutions":["Not enough information.You can check it yourself:First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.https:\/\/support.dynabook.com\/drivers\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numbers tested with 10 at their website:Toshiba - Models tested","I can't tell if you'll be able to upgrade to Windows 10 from the basic information that you've provided, but you can check for yourself. Here is a list of thebasic requirements for an upgrade to Windows 10:1 GHz processor or faster2 GB of RAMAt least 20 GB of available storageDirectX 9 or later with a WDDM 1.0 graphics cardA 1024x600 or larger displayFrom the information provided, I can't guarantee whether or not it will work. Verify that you haveat least 20 GB of available storage, DirectX 9 or later with a WDDM 1.0 graphics card, and a 1024x600 or larger displaybefore upgrading. Judging by your provided specifications though, you very likely do have all of the necessary requirements.Note: if you're currently running Windows 8.1, you already have all of the required components for a system upgrade to Windows 10.","Microsoft says more than 20GBs of hard drive space.https:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsThese are the basic requirements for installing Windows 10 on a PC. If your device does not meet these requirements, you may not have the great experience intended with Windows 10 and might want to consider purchasinga new PC.Processor: 1 gigahertz (GHz) or faster compatible processor or System on a Chip(SoC) RAM:  1 gigabyte (GB) for 32-bit or 2 GB for 64-bit  Hard drive size:32GB or larger hard diskNote: See below under “More information on hard drive space to install or update Windows 10” for more details.   Graphics card: Compatible with DirectX 9 or later with WDDM 1.0 driverTo which I have added:If you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say."]},{"symptom":"I can not upgrade from windows 7 home  to windows 10.        Hi,I get this message: 0xC1900101 - 0x2000C. The instalation failed in the SAFE_OS phase with an error during APPLY_IMAGE operation. Your help is welcome.Thank you in avance.Best regards from Albania.","solutions":["There are some standard things to try.1. Uninstall antivirus software.2. Clean boot https:\/\/support.microsoft.com\/en-gb\/help\/929135\/how-to-perform-a-clean-boot-in-windows3. Remove all none essential USB items.4. Download the ISO using the Media Creation Tool http:\/\/www.microsoft.com\/en-us\/software-download\/windows10mount the ISO image and run setup from Windows Explorer.5. Disconnect from the Internet during the upgrade.Be aware you may need a Windows 10 licence as the free upgrade period was 2015 to 2016."]},{"symptom":"Reboot Hangs Windows 7        After correcting failure to update, my Windows 7 computer will start and will shut down. But when I \"reboot\", it never completes. It hangs, and never restarts. Running a test, I get Error code 0146 for HD, and Msg error 2000-0146.  I now also have a new Drive with the letter \"I\". Its about 99mb in size, and it says around 70mb used. But when I open the drive, it says it is empty. It is an actual lettered drive now right after the C drive.  Again, it will shut down. It will restart. But it will not reboot. It hangs up and never completes the reboot.","solutions":["After correcting failure to update, my Windows 7 computer will start and will shut down. But when I \"reboot\", it never completes. It hangs, and never restarts. Running a test,I get Error code 0146 for HD, andMsg error 2000-0146.  I now also have a new Drive with the letter \"I\". Its about 99mb in size, and it says around 70mb used. But when I open the drive, it says it is empty. It is an actual lettered drive now right after the C drive.  Again, it will shut down. It will restart. But it will not reboot. It hangs up and never completes the reboot.Is that a Dell?If so, you have a failing or failed hard drive.https:\/\/www.dell.com\/community\/Storage-Drives-Media\/Error-code-2000-0146\/td-p\/3922611Computer Does Not Boot to Microsoft Windows 7https:\/\/www.dell.com\/support\/article\/au\/en\/aubsd1\/sln128763\/computer-does-not-boot-to-microsoft-windows-7?lang=en\"Resolve Hardware Issues Using ePSA or PSA Diagnostics and Guide to Error Codes\"http:\/\/www.dell.com\/support\/article\/us\/en\/19\/SLN133583\/ENPSA 1000-0146ePSA 2000-0146Hard Drive - Self test log contains previous errors.Your hard drive has indicated a failure.Update to the latest BIOS and Hard drive Firmware.Run a Chkdsk \/r or format your Hard drive and reinstall your Operating System.Repeat the PSA diagnostics.When the diagnostics still results in an error code, visit our ePSA online tool. You can get more information on possible resolutions to your issue and even get a part dispatched if needed."]},{"symptom":"Moving the \"Pictures\" folder to a new drive        Hello, I recently installed a new harddrive and wanted to move the \"Pictures\", \"Documents\" etc. folders to that drive. I tried just going into the \"Pictures\" folders properties and selected my new drive without a folder so I moved it from \"C:\\users\\account\" to just the new drive \"E:\". This in turn seemed to just create a shortcut to all the folders on that drive when really what I was after was moving the entire \"Pictures\" folder to that new drive like you would any other folder. Is there an actual way to this and if I try to move the \"Pictures\" folder now will it move all my files on that drive?I'm just concerned that all the files on my new drive is now associated with that folder and that moving it would case all the files on the new harddrive to also move in turn.Thanks for any help given!","solutions":["As long as you're restoring the Pictures folder to default location as shown here then you can approve that, no problem:https:\/\/www.tenforums.com\/tutorials\/23504-resto...","You are correct that you would move to E:\\Pictures after creating that folder there.Yes, you can use the folder you already created named Pictures on E."]},{"symptom":"windows vista will display the website that i want but will not allow me to enter and        My older laptop is on windows vista and I can enter the website that I want.  It will display but will not allow me in and I did remove google chrome but will still not let me in.  Any ideas now what","solutions":["Hi R.A.hu:Chrome has not been supported on Win XP and Vista operating systems since Chrome v49 was released in April 2016 (see Google's blog post athttps:\/\/chrome.googleblog.com\/2015\/11\/updates-to-chrome-platform-support.html).Are you currently using Internet Explorer 9 as your browser, and when you launch IE9 and go to Help | About Internet Explorer does it show that you have Update Versions9.0.60 \/ KB4014661 (Cumulative Security Update for Internet Explorer 9: April 11, 2017) as shown below?I'd recommend you install Mozilla's Firefox ESR v52.9.0 (the legacy version forWin XP and Vista, where ESR = Extended Support Release) and then see if you can access your problem website with this browser.  If you browse tohttps:\/\/www.mozilla.org\/en-US\/firefox\/new\/ from your Vista machine it should auto-detect your operating system and offer you the correct 32-bit ESR v52.9.0 installer for your region. If that doesn't work, full offline installers (all regions and languages) are available for download from their FTP server at https:\/\/archive.mozilla.org\/pub\/firefox\/releases\/52.9.0esr\/win32\/ (e.g. select the \/EN-US folder if you want the English-US installer named Firefox Setup 52.9.0esr.exe).Security updates for Firefox ESR v52.9.0 ended in June 2018 but this browsersupports newer connection protocols like TLS 1.1. and 1.2 (and can be configured to support TLS 1.3 when it becomes the official standard) for connecting to secure https:\/\/ sites.  IE9 only supports the older (and less secure) TLS 1.0 connection protocol and no longer works correctly with many websites.If Firefox ESR v52.9.0 doesn't solve your problem let us know what you mean by \"will not let me in\".  Are you trying to log in to a secure site like your bank or an online shopping site, and do you see an error message?-----------32-bit Vista Home Premium SP2 * Firefox ESR v52.9.0 * Norton Security Deluxe v22.15.2.22HP Pavilion dv6835ca, Intel Core2Duo T5550 @ 1.83 GHz, 3 GB RAM, NVIDIA GeForce 8400M GS"]},{"symptom":"Remove a defunct email account that is linked to my windows 10 mail.        I am unable to remove a defunct email account that is linked to my windows 10 mail, the email account is no longer valid so I could not log in if I did have the password. Windows 10 keeps insisting that I log in, but that account does not exist any longer. How can I detach it from my windows 10? It is very, very annoying. Please help.","solutions":["Hi My name is Lee; an Independent Consultant, I'm here to help you with your problem.Go to setting (Press menu key search setting) > on the setting page at the top search for Email and account > click on the email that you want to remove > select manage > deleted account from the devicesThanks Make it easier for other people to find solutions by marking a Reply 'Accept as Solution' if it solves your problem.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Everett. I'm Greg, an installation specialist and 9 year Windows MVP here to help you.In WIndows 10 Mail app click the three lines at top left until you see the Settings (gear) icon at bottom of the Inbox, click on it, then Manage Accounts. Select the defunct account, then Delete Account.If it won't delete there go into Settings > Accounts > Email and App accounts, choose the account, then Manage, then Delete account.I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."," I select setting \/ Email & accounts,I select the roberson-waite account, There is no delete button. I thenthen click manage.It takes me to this page on the web that displays the following,https:\/\/account.activedirectory.windowsazure.com\/Interrupts\/SignInAccessDenied.aspx?ru=https%3a%2f%2faccount.activedirectory.windowsazure.com%2fprofile%2f&reason=NoTennantAccess Denied The user ID that you entered is not recognized. If this is a new account, it may take a few hours before you have access to services.Important: This page does not yet support signing in with a Microsoft account. If you have one already, try signing in again using an account assigned to you by your organization. If you don’t have one, please request a new work or school account from your admin, and then try again. Sign outThat is as far as I get    Thank YouE Roberts","How about if you try accessing it through Windows 10 Mail app via the Settings (gear icon) at bottom of Inbox. Choose Manage Accounts, then the problem account, then Delete. Does it still take you to the page?That page looks like it's from a domain. Was the account local on this PC or did it come from a domain or server? See here for all methods how to delete Microsoft Accounts:https:\/\/www.howtogeek.com\/227763\/how-to-complet... Another way is to type netplwiz in Start Search, right click to Run as Administrator. Highlight the account on the front panel, if necessary tick the box to require password to get it to highlight, then choose Remove.I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.","Hello Greg,No matter how I access the link to the email account, it takes me to that same error website.No that email was not local to my PC, it was a Microsoft email account from my old employer who does not use that service anymore. I could access that email account from my computer at that time. Since the company changed computer systems and stopped using Microsoft 360 I have been getting the error messages on my window 10 email. I went to the site you recommended,https:\/\/www.howtogeek.com\/227763\/how-to-complet... but they had steps to remove a USER from windows, not a defunct email account from my single user pc.I also tried your suggestion of using netplwiz, but that just displayed my default USER account only. The account I'm trying to delete is an email account that window keeps telling me to fix.Can you help me with that?Thank YouE Roberts","OK, so I understand this is not a User account but only an email account that is still listed in Email Acccount Settings.You should be able to delete the account even if you can't sign into it. Try accessing it in the Mail app, Settings icon gear at bottom of Inbox, then Manage Accounts, click on the Account then Delete this account.","It does not show up if I go to settings\/mail\/then click in the gear in lower left\/manage accounts\/ this only shows 1 icloud account I have.The defunct account can be located by going to setting\/email & accounts or when I get the error from win 10 and click the fix it box that displays.","Confirming you do not have the account in the Mail app under Manage Accounts?How about in the People or Calendar apps under Settings (gear icon) > Accounts? How about in Settings > Accounts > Family & Other People?","Correction Greg,It does not show up if I go to START\/mail\/then click in the gear in lower left\/manage accounts\/ this only shows 1 icloud account I have. Is that how you meant to get to mail?","Yes, Everett, I've never seen it prompt for updating password except when the account is added to WIndows 10 Mail app. Usually when you add it there, it also adds the account to People and Calendar apps, and in Settings > Accounts > Email & App Accounts. It is usually easy to delete from any of those places. I'm afraid the problem here is that it was added as a business account and is stuck unless you can sign in to remove it that way."]},{"symptom":"Internet won’t connect to Windows 7 Desktop anymore        So i cant get me desktop to connect to the internet anymore. my computer is from 2014, but maintained well. Runs on Windows 7. I tried switching from my wired connection to a wifi connected off my phone. Nothing","solutions":["Hi DanielWeiss2,run the troubleshooter, post the Windows error message or post the screenshot.Otherwise follow all the following steps:https:\/\/support.microsoft.com\/en-us\/help\/10741\/windows-fix-network-connection-issues","Didnt work. Still no connectionim wondering if its because its a Windows 7. It wont connect the wiring or to any wifi or mobile hotspot. ","Refresh your internet connection by utrn off and turn it on again","Tried all that. Rebooted modem, router. Disconnected & reconnected all wires. its a computer issue. I borrowed a laptop & it connected flawlessly. ","Hi DanielWeiss2,you didn't do what i asked you.If you don't collaborate, it becomes difficult to be able to help you.Greetings.","Help us help you by providing more details about your system and your problem.Let's focus on connecting via your \"wired connection,\" which I assume is an Ethernet cable from your computer to your router. Please confirm that assumption and provide the make and model of your router as shown on the manufacturer's label.Does \"maintained well\" include having installed Service Pack 1 and all subsequent security updates?What happened to your system shortly before this problem started?If you get an error message when you try to connect, please provide the complete text.Open Device Manager (click Start, type Device Manager in the Search box, and press Enter).Double-click on \"Network adapters\" to expand the categoryDouble-click each item in the Network adapters category and report the complete name of the device and its \"Device Status\"If there is an \"Other devices\" category, double-click to open and report the names of all of the items in that category.Open a Command Prompt window (click Start, type Command Prompt in the Search box, and press Enter).Type the following line in the black Command Prompt window and press Enter     ipconfig \/allExamine the output from the ipconfig \/all command.  There should be at least one section with a title like \"Ethernet adapter Local Area Connection,\" but there likely will be several other sections. There likely will be several sections in which the first line is:      Media State . . . . . . . . . . . : Media disconnectedPlease report the complete name of each section that reports \"Media disconnected.\"  If there is a long hexadecimal number with curly braces as part of the name, you need not include that.For each section in which there is NO \"Media disconnected\" line, please report the following:The complete name of the sectionThe descriptionIf DHCP is enabledThe IPv4 addressThe Default Gateway addressThe DHCP server addressThe DNS server address(es)"]},{"symptom":"Most touchpad settings suddenly missing\/moved        I'm experiencing a weird issue with the touchpad settings in Windows 10. My computer is an HP Spectre X360 laptop, 2017 model I believe, and the touchpad is a Synaptics HID TouchPad. Last night, I tried to turn my touchpad off (didn't need it, since I have a Bluetooth mouse), and neither the normal on\/off switch nor the \"enable touchpad while a mouse is connected\" checkbox worked - the touchpad refused to turn off. I ignored it for a little while, then shut down my computer for the night. This morning, I turned my computer back on to discover that the vast majority of the touchpad settings in the normal Windows settings menu are completely missing, leaving only a dropdown box for changing the touchpad sensitivity.Having been unable to find any solutions on Google, I asked a Microsoft agent for help; they directed me to try and download\/install the latest version of the appropriate touchpad driver for my machine from the HP website. Turns out the driver I was using was the latest version (Synaptics TouchPad Driver (Windows 10 v1809\/v1903)) - the reinstall did nothing, even after another reboot. I also asked my mom, since she works in IT; she informed me that the Mouse Properties dialog box will have touchpad driver settings on some computers, but it doesn't on mine. I searched Synaptics in the Windows Search box at the bottom left, following advice from another Google search for what to do, and the first hit was a dialog box called Synaptics Pointing Device, which seems to have all of the missing settings, albeit in a very different interface. I'm not sure if that existed before last night or not, since I never had a reason to go looking for it.So the touchpad settings seem to have suddenly migrated, without my doing anything or asking them to. I'm still somewhat annoyed, since I just had to waste two hours of an otherwise busy day on this and the Synaptics Pointing Device dialog won't let me pin it to the Start menu, which was where I had the touchpad settings menu pinned for easy access (I like to be able to switch back and forth quickly between mouse\/disabled touchpad for gaming and no mouse\/enabled touchpad for bringing my laptop to class). I can pin this dialog to the taskbar for an effective workaround, but it's easier to misclick things on the taskbar so I prefer to keep as few things there as possible.Any idea how this could have happened, and\/or how to put the touchpad settings back where they belong?","solutions":["Go Settings, Devices, Mouse, Additional mouse options, Touchpad.","That's just the problem: there isn't a separate Touchpad tab under Mouse Properties (the dialog that came up from the \"Additional mouse options\" link, which I have been in and out of throughout this whole process), or at least there isn't on my machine.","Hi Gwyn. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.The surest way to fix a touchpad is to first assure you have the very latest touchpad driver from the HP download page here for your exact Serial and Product number:http:\/\/support.hp.com\/us-en\/drivers. The most basic thing we need to learn to maintain a PC is how to keep the latest manufacturer's drivers current. Windows Update drivers are never enough.While doing this also Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you also have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.If that doesn't help then enter Device Manager reached by right clicking the Start button, go to Mice > Touchpad and then Driver tab. Choose Update Driver, then Automatic to see if it gets a better driver that resolves the problem. If not try Update Driver > Browse > Let Me Pick to try all previously installed drivers. If that doesn't work then try uninstalling driver, Restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver.See the troubleshooting steps here: https:\/\/support.microsoft.com\/en-in\/help\/402786... Go to Settings > Devices > Touchpad to go over the Settings. Then choose Additional Settings which opens the Mouse properties box. The Touchpad software installs a tab onto it - usually the last one - that should have more settings to check, including a checkbox to Disable Touchpad when USB pointing device is attached. This prevents palm drag from causing the cursor to jumpIf this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Update History, then uninstall them from the link there, and immediately check for these again and hide with the Hide Updates tool explained here: https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...You can also go into Repair Mode by whichever method works here: https:\/\/www.tenforums.com\/tutorials\/2294-advanc... to use the new Uninstall Updates button in Advanced Troubleshoot Options:https:\/\/pureinfotech.com\/uninstall-updates-adva.... You can also use System Restore from within Windows or the above Repair Mode to get back before the problem began, then check for Updates with the Hide Update tool and hide them:https:\/\/www.windowscentral.com\/how-use-system-r...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]}]}