{"windows":[{"symptom":"First time installing Windows 10 freezes during installation        Hi, I just built a PC and am facing an issue whilst installing WindowsPart List :Motherboard : MSI Meg Z390 GodlikeProcessor : Intel i9 9900KRAM : Kingstone DDR4 (2124MHz) 32 GBGraphic Card : MSI Gaming X Trio RTX 2080TiStorage : Samsung SSD 860 500 GBBios Version:E7B10IMS.140 Bios settings:AHCI modeUEFi onlyWindows 10 WHQL SuppprtWhen I boot up the system and it comes to the initial screen showing all the components and it asks whther to continue or enter setup, I clicked on Setup to make sure my storage is set to AHCI and then rebooted and entered Boot Manager Setup and chose my USB containing the Windows Installation files which were downloaded using the Windows Media Creation Tool onto a 64GB Sandisk Ultra USB 3.0 drive, the display then goes dark and the windows loading dots appear and rotate once completely and stop the second time at the same position everytime and just freeze there until I reboot or reset CMOS and reboot. How do i go about this issue?","solutions":["Hi, It appears BIOS E7B10IMS.180 (7B10v18) may be needed to support i9-9900 processors.So try updating the BIOS."]},{"symptom":"Windows 10 Store - Apps won't update & need a proper Windows Store fix....        I am trying to update my apps and the apps will not update - it stays on this screen …..forever (?!?!?!?) I have used the WsReset and the reset button in the apps settings and restarted the laptop - no luck. What do I do now? Wait for the next Windows Update to come out, or is there and actual step-by-step procedure to fix this issue?","solutions":["Hey there Classical, There's a lot at this point we can do to reboot your updates....However let's first let windows attempt to do it.Go to Settings. Navigate to Updates & Security > Troubleshoot. Click Windows Store Apps and choose Run the troubleshooter Keep hitting next and when it is finished restart your PC then attempt to update....","Did that - same problem & no luck. What is the next step, please?","I get this message as well...\"Problem with BITS service : The requested service has already been started. More help is available by typing NET HELPMSG 2182\"","Next step is to run the BITS troubleshooter. Type BITS into cortana search bar keep hitting next to solve. If that doesn't work please visit: https:\/\/windowsreport.com\/how-to-fix-the-net-he...There are many different actions and steps to follow.","Ran the BITS troubleshooter - no luck there either. It tells me that there is no problem. Next please?"]},{"symptom":"Elite 2 controller disconnecting on Windows 10        This has been widely talked about and was wondering if there is going to be a fix? Mine, like countless others just keeps disconnecting after about 10-15 minutes with low fps on games. Tried EVERYTHING the web suggest but nothing works. Only being tethered works. Come on Microsoft  - FIX THE DAM THING.","solutions":["Hello bluedoggy, I am Andrew an independent advisor. Are you referring to the Xbox One elite 2 controller?","Yes, the xbox elite 2 controller.","Ok, I just finished helping somebody else with the same issue. The fix we found was to uninstall any controller diver suite for the controller adapter, reinstall it and resync the controller.To remove the driver, with the controller on right click the start menu, open Device Manager.Find the controller, right click and uninstall. Once done follow the instructions here. https:\/\/beta.support.xbox.com\/help\/hardware-net...On this page is also a firmware update, install this as well. Once complete let us know if the issue is resolved. Take Care","Ok, I just finished helping somebody else with the same issue. The fix we found was to uninstall any controller diver suite for the controller adapter, reinstall it and resync the controller.To remove the driver, with the controller on right click the start menu, open Device Manager.Find the controller, right click and uninstall. Once done follow the instructions here. https:\/\/beta.support.xbox.com\/help\/hardware-net...On this page is also a firmware update, install this as well. Once complete let us know if the issue is resolved. Take Care Thank you for the very kind info - much appreciated. Tried this before, several times and guided by an advisor, but still does not work. Was also recommended by an advisor here to try and add a new Bluetooth dongle and disable the motherboard bluetooth and anything related. That didn't work also.My PC is very new and not loaded with much software. I do not add software in the fear of upsetting it. Just games and that's it.","Ok, good to know what you've tried. Have you updated your PC to latest version of Windows, 1909?","Ok, good to know what you've tried. Have you updated your PC to latest version of Windows, 1909?I'm fully up to date in windows and all drivers.","Does the controller work while plugged in?","Yes, its the only time it works flawlessly being plugged in via the officially supplied cable. But don't want to be tethered.","Hi, What is the model of your Motherboard?","Hi, What is the model of your Motherboard? I have a MSI Z370 Mini-ITX.Corsair One 160i "]},{"symptom":"Keyboard, mouse, and display freezing        I have a problem when I am trying to access an app or, while in an app where the mouse pointer will freeze and then after a few seconds will begin to move according to what ever moves I had done while it was frozen. Using the buttons on the mouse will also freeze then after some time will eventually work. Placing the pointer over a field which \"highlights\" when the pointer hovers over it at times takes time to work. Keyboard entries will pause during input and then catch up with words missing sometimes. If I completely shut down and restart, the problem does not occur immediately. Sometimes it takes 30 mins or more for it to manifest itself and other times it takes an hour or so before it occurs. This problem used to manifest itself after several days but has gotten much worse in that it happens very quickly. At it's worse, when I am inputting data and the display freezes, I can tell when it is going to \"unfreeze\" by watching the display \"blink\" several times in data fields in forms are located. The entire display doesn't blink, just those fields. Windows Defender and Malwarebytes show no threats. Updates are up-to-date.Dell Inspiron 3252, Intel(R) Pebtium(R) CPU N3700 @ 1.6 GHZ, 8 GB RAMAny solution here?","solutions":["Hi, pnetrick My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps: Press the Start key and type the word CMD or Powershell, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanu p-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/929833..."]},{"symptom":"No Sound        I have a lenovo ideapad 320 15IAP.I had sound on it, but now i dont have any sound. After searching the device manager I found the realtek audio driver is hidden.Then i went into the control panel and found it to be installed Then i went into my program files and found the audio manager there. What can i do to get realtek audio driver out of hiding and working?I even tried updating and it didnt work.","solutions":["Hi ebonydj, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.I recommend complementing the steps that you have done so far, apply the indications of these official links of the brand and Microsoft, some of the steps will coincide, and if any does not solve the problem continue with the following.https:\/\/support.microsoft.com\/en-us\/help\/452028...Fix audio or sound problems in Windows 7, 8, & 10 https:\/\/support.lenovo.com\/us\/en\/solutions\/ht50...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I solved my problem. It was my speakers that were not working. I opened up my laptop and replaced my speakers. I started my laptop and got sound. "]},{"symptom":"PC PASSWORD HELP ASAP!        Hi everyone, Im Tony and I need your help asap!So recently i factory restetd my pc and i changed the pc password,long story short i dont know the old password and if my fasmily notices i changed it im in trouble!!! So my question is if there is any possible way to:-set a password and like whatever you type is the password,like this:  i could typecat and then the pc says it is correct,then i shut down the pc and open it again and type a different password likeaoiasuhda and it would still work,understand me,like any password should work!!-or to see the last password!I read somewhere that a guy had a password place to introduce but he would just type random things and it would work!HELP!so right now i am connected with my microsoft account to the pc.!!!!! PLEASE I AM BEEGGING YOU HELP ME !!!!!<3 <3 <3 :* :( ","solutions":["Hi, StefAntonio My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to enter the safe mode with the network function to repair, it may be that the network controller is outdated.Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. As soon as you see the Windows logo with the rotating dots, press and hold the power button until the computer turns off. Do this process twice..-Turn on your computer for the third time, and let it load. .-You should receive this message: Preparing Automatic Repair. After entering Mode Update the network driver may be outdated","--set a password and like whatever you type is the password,like this:  i could type cat and then the pc says it is correct,then i shut down the pc and open it again and type a different password like aoiasuhda and it would still work,understand me,like any password should work!!   can u help me with this?","I recommend that you repair Windows completely before you must make a backup of your personal files, third-party software will be removed. Here the link to download the Windows ISO.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"What happens, when you highlight filename?        Hello everyoneI have my Windows in danish, so I hope, I use the correct terms and names.When I do the following with an image-file:1)Right click – open with – Windows Picture app – right click on the motive – File information – out on the left, doube click on the file name so it gets highlighted, and then left click with the mouse outside of the window (no changes made to the filename). (Look below for my test)2)Right click on the file, press “change name \/ rename”, so the name get highlighted, and then left click with the mouse outside of the window (no changes made to the filename)3)Right click on the file, properties, click on the filename in the “properties” window, so the name get highlighted, and then left click with the mouse outside of the window (no changes made to the filename)Is there only a process in memory?Is there a writing to disk?I have been using the process monitor, and have been watching the “Picture app” and the “Disk” tap. There is 0,1 MB\/s for a couple of seconds, in the “Disk” tap, when I highlight the name in “Picture app”, then it goes to 0,0 MB\/s. 4) Is this because, that the data is being read into memory?When I highlight and click away, stays in 0,0 MB\/s. Only when I make a change to the name and press enter, then it is 0,1 MB\/s for a couple of seconds.5) I assume, that there is only being written to disk, when the filename is changed?6)Is there other apps or software, to monitor when something is being written to disk?Thank you for reading and replyingBest regardsEmil","solutions":["Hi Emil, in all three cases there should no be writes to disk. You may verify this by viewing disk statistics before operation and after it using command:fsutil fsinfo statistics c: need to be run from elevated command prompt or Windows PowerShell (administrator).","Thank you Igor for your response.The command works, and I get alot of data.What shall I look for?","Igor, I would love more help with this.Thank you again!"]},{"symptom":"Dual Boot Windows System Crashes Erratically        Hi all,I recently dual booted my Acer Swift 3 laptop with Arch Linux and GRUB. Initially the system seemed like a success however since I did this, Windows has been crashing erratically.The problems vary between the OS freezing and receiving no response from any input, or a regular BSOD, normally referencing some sort of .sys file, frequently Ntfs.sys but often others. These errors range from page fault in nonpaged area to irql not being less than or equal and sometimes just system service stopped.I have tried automatic repair countless times, I have reinstalled Windows but to no avail. I have little access to the system since I can't often use the desktop for more than 15 seconds without it crashing.If there are any journals or logs I can access and post here that might be useful, please let me know, I'm not sure where I'd find them.[EDIT]Forgot to mention that my Arch install has been running smoothly without any problems, it is just Windows where there is an issue.Thanks in advance","solutions":[]},{"symptom":"Windows Media Player eject cd when rip button is push DOES NOT RIP        Windows Media Player eject cd when rip button is push DOES NOT RIP","solutions":["Hi OscarDavila-Suliveres, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Try to solve the problem as follows: Run the Windows Media Player configuration troubleshooter. Control Panel >> Troubleshooting >> Click See all in the left navigation panel >> Click on the Windows media player settings to run the Windows Media Player configuration troubleshooter >> Do Click Advanced in the Windows Media Player configuration troubleshooter dialog box and click Run as administrator >> Click Next and follow the on-screen instructions to complete the media player configuration troubleshooter Windows, wait for the process to finish, check again.You can also check the steps that the Windows MVP shares on its website, the indications are applicable in your case, because it is due to improper operation.https:\/\/www.thewindowsclub.com\/windows-media-pl...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Urgent help needed. folder sharing not working after update. now can't work!        Hi,My computer did an automatic update to ver 1803 and folder sharing stopped. I uninstalled the last update and it worked again, but windows updated again last night and I can't turn off the update and sharing is broken again.All sharing is turned on in the sharing settings in network sharing centre.All firewalls are turned offhave right clicked on folder> properties>sharing>advanced and turned share onBeen at this all day and just can't get it to work again. Why oh why did they change this? lost a days work so far.any suggestions what to try next or how to resolve this problem?Chris","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as you are unable to use the file sharing feature after the PC upgrades to Windows 10 1803. In this scenario, we would suggest you to perform these methods and check. Method 1: Start the services. 1.    PressWindows andR key together on your Keyboard. 2.    TypeServices.msc and it enter. 3.    Search for the following services and set the startup type to Automatic.Function Discovery Provider Host (FDPHost)Function Discovery Resource Publication (FDResPub)Network Connections (NetMan)UPnP Device Host (UPnPHost)Peer Name Resolution Protocol (PNRPSvc)Peer Networking Grouping (P2PSvc)Peer Networking Identity Manager (P2PIMSvc)4.  Reboot the device and check the Network tab again. Method 2: Modify the settings. Go to control panel > Click on network and internet >Click on network and sharing. Click on Change advance sharing settings on the left pane.Select the options Turn on network discovery. Turn on file and printer sharing. Allow windows to manage home group connection(recommended).Turn on sharing so anyone with network access can read and write files in the public folders.Use 128-bit encryption to help protect files sharing connections (recommended).Turn off password protected sharing. 4.  Click on Save changes. Method 3: Turn on SMB feature. Press Windows and R key together on your Keyboard.Type appwiz.cpl and hit enter. Click on 'Turn Windows Features On or Off' (upper left side of pane).Please scroll down and under SMB 1.0 CIFS File Sharing Support, check the boxes next to SMB 1.0\/CIFS Client and SMB 1.0\/ CIFS Server. If the boxes are already ticked, please uncheck the box and check it again.It will ask you to restart your Computer. Please Restart it.  Now restart the machines and check if it is working now. If you would like me to provide additional advice, simply respond to this thread. I will get notified and I’ll reply to you as soon as I can.We await your response. Aditya RoyMicrosoft Community – Moderator","Hello,Ive tried all the 3 suggestions and still won't connect.It gives the option to sign in as Guest or registered user + password but won't connect. connection failed.This is crazy!! why did they break it with the updateChris"]},{"symptom":"\"Save as...\" doesn't work        Whenever I try to use the \"Save as...\" command -- either for an Office 2007 file or when downloading files from the web -- I get a \"Working on it\" message and can do nothing. Then, after a very, very long wait, I can enter the name of the file to save to.  Once I am allowed to enter the file name, saving appears to proceed normally. This is a fairly recent development with Windows 10.Is there a diagnosis?  A fix?","solutions":["Hi Rupestris, My name is Riccardo and I would be happy to assist today with this issue. There are a few things we can do to fix this issue for you... Step 1: Checking Integrity of File System \/ Updates Go to Start > type in cmd > right-click Command Prompt and run as administrator. Type in the following: sfc \/scannow Let the above process run and complete. After that is done, type in the following: dism \/online \/cleanup-image \/restorehealth After that is done type in: chkdsk \/f \/x \/r Press enter Restart your computer and see if this fixes the issue. Let me know I will help you until the problem is resolved.","Hi Rupestris, My name is Riccardo and I would be happy to assist today with this issue. There are a few things we can do to fix this issue for you... Step 1: Checking Integrity of File System \/ Updates Go to Start > type in cmd > right-click Command Prompt and run as administrator. Type in the following: sfc \/scannow Let the above process run and complete. After that is done, type in the following: dism \/online \/cleanup-image \/restorehealth After that is done type in: chkdsk \/f \/x \/r Press enter Restart your computer and see if this fixes the issue. Let me know I will help you until the problem is resolved. Hi Riccardo,I have run through the entire procedure you outlined, and -- 1.5 days after I started -- have tested the outcome. Slow but thorough I guess. Basically, no problems were detected and there has been no change in performance. The symptoms:  --Clicking on any link results in a long delay before the app opens. The same is true when clicking on a link within an app.  --Clicking on some icons no longer opens the relevant app.  --Issuing a 'Save as' command in any app generates a 'Working on it' message followed by a long wait before the field opens to allow the name of the file to be entered.  --Often when changing from one app to another, a 'Not responding' message is generated, followed by a long wait before the app opens.  --Working within an app for a long period seems to improve performance for that app. It is as if the system has forgotten internal links but working with the app reminds it of what it should do. Exiting the app and opening it again returns the poor performance.Any suggestions for where I might go next?"]},{"symptom":"\"WiFi doenst have a valid IP configuration\"        For the last 16 hours, I cannot connect a Win10 laptop to the wifi. I upgraded the router's firmware and now this laptop connect only via ether cable.I have the wlanreport but it cannot fit in this post.I have told the network to \"forget\". I've 2x done the network reset and followed half a dozen online articles about this problem and none work.For instance, I've read and done this:https:\/\/www.softwarebattle.com\/wi-fi-doesnt-have-valid-ip-configuration-on-windows-10\/and several other attempts and nothing has worked.I would have posted the wlanreport current, but it's too big. What do I do to fix this???","solutions":["Hi RobertBelongia, My name is Riccardo and I will be assisting you today with this issue. In looking at this, let's look at a few troubleshooting steps here: 1. Are you able to connect to wifi via another device and it works fine? 2. You stated that you can use an ethernet cable and it work fine? 3. Are you able to connect the computer to another wifi network and see if it works? I just want to see if the driver is corrupted or your WinsockLet me know.","1. Are you able to connect to wifi via another device and it works fine? Yes, my android phone can connect via wifi2. You stated that you can use an ethernet cable and it work fine?The Internet is available via a connection between the router and this computer. Win10 finds is quickly and connects.3. Are you able to connect the computer to another wifi network and see if it works?No. There is no available \"another network\". I can take the laptop to publicly available \"hot spot\" tomorrow and see if that shows a connection.I'll report about that tomorrow.Thanks for a swift reply. FWIW. This router is a TP-Link Archer C7 (AC1750). After the firmware upgrade, the same wifi password was used. My tablet (android) cannot connect. It sticks at \"obtaining IP address\" and never fully connects to the 'net.I have cold booted the modem and the router, waiting several minutes between power up\/downs.Lastly, the firmware upgrade on the router came with no security and I set it to WPA-PSK (CCMP)","Hm...it sound slike there may be an issue with the firmware, are you able to go back to an older one?","Hi RobertBelongia, temporarily configure the hotspot on your smartphone, then check if the pc can connect to the hotspot and access the internet.Also, I suggest you set the WPA2-PSK security key on the router because it is more secure.","I don't have a smartphone plan with a hotspot. I will make better encryption, per your suggestion.Thank you.","I easily connected to a public wifi.","Ok the firmware on your router is definitely having a conflict...are you able to go back to a previous date?","Your reply, Mr. RickFran is too ambiguous. How do I check firmware? All else, with a wired connection works without problem. I believe the fault is in my selection of encryption. Maybe on the previous firmware I used a different form. The smartphone connects to the wifi w\/o problem.","Sorry about that, go to: https:\/\/www.tp-link.com\/ca\/support\/download\/arc...ARe you able to download the 2018 firmware?","I've installed OpenWRT on this device.OpenWrt 18.06.5 r7897-9d401013fc \/ LuCI openwrt-18.06 branch (git-19.309.48729-bc17ef6)Kernel Version  4.9.198As I said, it's working perfectly, except with Win10.Can Win10 be confused because of the change in type of encryption? I know so little about it, that when I first flashed the OpenWRT and had to set encryption, I tried to use the same 8 numbers\/letters that came on the router label.  I couldn't figure out whether the password I wanted would work with the encryption scheme.Does the type of encryption have to match and why? Also, if I do a OS reset\/re-install will that fix it?"]},{"symptom":"Windows 10 not casting to Roku TV        I am trying to connect my windows 10 laptop via the action center and add devices. My TCL Roku tv does come up but when I try to connect it loads for a few seconds then says \"unable to connect\". I selected always allow screen mirroring on my roku tv and have reset my tv, computer and router several times. When I try to cast from chrome it says the device is not supported. ","solutions":["Hi stigman92, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.See the indications of the links that show the process in detail, each link contains the section >> Fix problems, one is a community website, and the other from a Windows MVP, where you can check the tips to solve the problem. With these steps connect my laptop to my Samsung TV. https:\/\/support.microsoft.com\/en-us\/help\/15053\/...How to set up & use Miracast on Windows 10 https:\/\/www.thewindowsclub.com\/set-up-use-mirac...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"hp stream        how do I connect a hdmi dvd\/cd player, I have plugged in with hdmi cable, downloaded the free trial dvd app played a dvd but nothing  happens.","solutions":["Hi andyman78 Are you trying to connect a DVD player to your laptop with a HDMI cable? If so, I am sorry, that will not work, the HDMI port on your laptop is output only, it cannot take input from a DVD player . . .","thanks Dave [Dave is also my name] I did suspect it was output only, but I did not know if an external dvd player could be connected some way as in my younger days I am more used to older laptops with built in dvd\/cd. I purchased a canon 3 in one printer but because my internet [voda 38 fibre] is that poor, [ookla tests even hard wired to router only 8 to 19 mbps] downloading the software and drivers fail, and tried if I could use the setup cd rom. looks like I will have to wait till voda sort my internet speed. fibre is 1-4 miles away and copper wire to me but they keep telling me I have 40mbps. rubbish. thanks for your help and any info to help appreciated. "]},{"symptom":"Camera Windows 10 MSI        My Camera doesn't seem to exist.Can someone help me figure out what's going on? I've never tried using my camera on my computer before, which I guess is a good thing since it doesn't seem to exist. I've got the permission settings for it, though, which is weird.","solutions":["Hi Izzy At the bottom right of your screen, click the up arrow, do you see the icon for SCM (indicated below, if so open that.That is a utility on MSI systems for turning on\/off your webcam, Display, Bluetooth . . etc . .If you do not find that please let me know . . . ."]},{"symptom":"set up my unofficial playstation controller to steam        i downloaded 3 old tomb raider games, 1 2 and 3, the first one seems to be going well with my generic controller which is a unofficial playstation one but with the other 2 games, it doesn't work, is there any suggestions to this?","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? Is Steam up to date? Is the controller listed under Big Picture mode>Controllers? Have you set it up as a PlayStation 4 controller? Are you connecting via USB cable or Bluetooth?","hi my windows 10 version is 1903, my steam always updates everytime i open it, but i don't know what the name of my controller is, but it worked fine with tomb raider 1 original version as it was using dosbox through steam, so i am pretty confused how it isn't working with tomb raider 2 and 3, i wouldn't mind using my keyboard but its modifying the buttons and getting use to it but i prefer my controller, plus i connected my ps4 controller to it and worked great but the sound was cut off for some strange reason","1909 is the latest version of Windows so feel free to update to this if possible.As requested is the controller appearing within Steam? You may be better using an official PS4 controller. There’s DS4 for Windows but this requires the controller to be connected via USB.http:\/\/ds4windows.com\/ Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Please do not download any repair tool which is offered by this site other than the ones I mention\/recommend..Thoroughly research any product which is mentioned here before you decide to download and install it.","when i used the ps4 controller, the sound went off for some odd reason","The sound via the PC or via the controller sound? I’ve found that Steam adds its own entry to the audio drivers which affects sound. I’ve noticed that my sound disappears & when I check the Speakers are set to Steam audio, setting my audio back to Realtek default brings the sound back.","i've sorted the audio out but yet i am still getting the problem, it is going fine with tomb raider 1, but the 2nd and 3rd it isn't, a don't know how to modify with ps4 control pad","Have you looked at DS4Windows link? What about the controller settings? Not all games are controller compatible. You should also X-post on the Steam community forum for the TR games which don’t work with the controller.","i will try the DS4 windows controller but its weird how tomb raider 1 is working fine with the controller but tomb raider 2 and 3 aren't, i will inform you how things go when i give DS4 window link a go","my compute said DS4 window can be risky, but my windows defender said there is no threats, so is it really safe?","I use this & have had no problems from Defender nor Malwarebytes. I’ve found this from Steam: Try disabling the Steam Overlay for the game. (right-click on the game in your Library list, select Properties, then un-check the option for \"Enable the Steam Overlay while in-game\")The Steam Overlay does not work properly with these old Tomb Raider games (which use an old DirectX version). This apparently prevents Steam from using the game-specific controller configuration, and may instead cause the game to respond to Steam's \"Desktop Configuration\". Turning the overlay off seems to fix this problem. If you want to actually fix the overlay, try using dgVoodoo2. (described here in another discussion) This is from the link mentioned above: To prevent crashes, and fix other things, try using dgVoodoo2. As described here https:\/\/steamcommunity.com\/app\/225300\/discussio... there is a \"DirectX wrapper\" called dgVoodoo2 that helps with several of the old TR games (from TR-II to TR-V), and fixes issues with the Steam overlay, window borders, aspect ratio and various crashes.Download it here: http:\/\/dege.freeweb.hu\/You just need to copy the .dll files from the \"MS\" folder into the game folder of any game you want to fix, plus the dgVoodooCpl.exe file somewhere else. Running the control panel allows you to hide the \"dgVoodoo Watermark\" and adjust some display options.Then \"launch setup\" when you run the game. Use the launch option: -setup For TR2\/3\/4 you may also want to try the widescreen patch: https:\/\/tombraiders.net\/stella\/downloads\/widesc...Taken from Steam’s discussion pages for the TR games."]},{"symptom":"Issues while accessing Settings and Xbox app on PC        Hello,I can't access my emails & accounts in settings. Upon clicking \"emails & accounts\", I have the buffering dots continually moving to infinity . I also can't login to any Xbox applications. When clicking \"SIGN IN\" on any Xbox app, nothing happens. As if there is no link attached to the button.Also, when trying to contact support, I can never talk to anybody. Trying to force open the link is a page that doesn't exist.Any information will help, I've been waiting for an update or anything for 2 months with disappointment.Thanks in advance,Matt Sodaro","solutions":["Hi Matt, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues while accessing Settings menu and Xbox app on your PC. For further clarity on the issue, please respond to the questions below: Which build version of Windows 10 are you using currently?Are you aware of any changes made to the PC prior to which you weren’t facing this issue?Do you face the same issue on any other app? Refer the article Which version of Windows operating system am I running? Based on the screenshot you have shared, it seems that the support link that you are trying to access is incorrect, here is the correct link to contactMicrosoft Support Meanwhile, I would suggest you to follow the steps mentioned below and see if that helps. Method 1: Run the Store App troubleshooter to identify and fix problems. Press Windows + I key together to openSettings.Click on Update &Security and then click on Troubleshoot.On the right hand pane scroll down and look for Windows Store Apps.Click on it and select Run the troubleshooter.Follow the on-screen instructions. Method 2: Try re-registering Settings and Xbox app and see if that helps. Press Windows + X keys together and click onWindows PowerShell (Admin).Now type in the following commands one by one and hitEnter: Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Get-AppXPackage -AllUsers -Name windows.immersivecontrolpanel | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register “$($_.InstallLocation)\\AppXManifest.xml” -Verbose}Restart the PC. Method 3: Try creating a new user account and see if you are able to access Settings and Xbox app. Refer the articleCreate a local user or administrator account in Windows 10 Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator","Method 1: Not sure what to do with this.Method 2:No idea what any of this meansMethod 3:Upon creating a new account, all of the issues were fixed! However on my main account, the issue still stands. Progress..","My apologies,1. Windows 10 Build: Version 1909 - 18363.5352. Any Changes: Not that I am aware of, its been a long standing issue so I can not recall.3. Other Apps: All of the apps that require me to sign into Xbox or emailsThanks in advance,Matt Sodaro"]},{"symptom":"Windows 10 BSOD after each quality update        I've been experiencing issues with Windows Updates for several months now.Almost always, when installing quality updates, Windows will not boot after installing the update. Instead, I get BSOD during boot with errors \"KMODE_EXCEPTION_NOT_HANDLED\" or \"PAGE_FAULT_IN_NON_PAGED_AREA\". I then have to run startup repair and reinstall the update; it usually works the second time, but sometimes requires more than two attempts.Windows seems to occasionally attempt to install an update that is already installed, again prompting BSOD. See screenshot below.I've run sfc \/scannow and DISM \/Online \/Cleanup-Image \/RestoreHealth  repeatedly but they do not detect any issues.","solutions":["Hi, Please upload the Dump file, So we can Analyze the error. Go to C:\\Windows\\Minidump\\ Then upload the dump file to https:\/\/onedrive.live.com\/"]},{"symptom":"W10 1903. Border gap between windows        Hello, i have a problem with gaps between windows in W10 1903 (up to date), whenever i snap two windows (two file explorers for example) i get a 1px gap around unfocused windows.i have enable the \"title bar and window borders\" coloration in Settings > Personalizations > Colors, but enabling it or disabling it doesn't change the result, i have also tried changing personalization settings such as theme or colors, also tried changing window snapping settings but i still get the gap.I tried changing the registery value PaddedBorderWidth from -60 to different other values, still nothing.I also have another computer that runs W10 1803 that does not have this problem. I know that this issue has already been discussed, but i cannot find any working solution.Here are screenshots from W10 1903:here the right window is focused and has a blue border (blue is my choosen accent color), and the left window is unfocused and has no border, you can see my wallpaper and desktop icons through it.And here is an equivalent on my W10 1803Here the accent color is red, and the unfocused window simply has a dark grey borderI hope i made it clear enough, I can provide additional information if needed.Thanks in advance.","solutions":[]},{"symptom":"Double billing        I used Microsoft Pay and entered my credit card as a payment method. When I purchased a product from Mothercare, I received double billing. One from Mothercare andthe second from Microsoft Store for the same amount. What is it?","solutions":[]}]}