{"windows":[{"symptom":"Cannot Install Windows Updates        Settings displays the following error: 0x800700c1OS Version is Windows 10 1903 64-bitI have tried a variety of solutions suggested on other posts with the following results:restart - no effectsfc \/scannnow in admin command prompt - Windows resource protection could not start the repair service.For this I went into services.msc, opened Windows Modules Installer and changed to manual. Then I entered the following into the admin command prompt -sc config trustedinstaller start=demandresult - [SC] ChangeServiceConfig SUCCESSnet start trustedinstallerresult - The Windows Modules Installer service is starting.result - The Windows Modules Installer service was started successfully.This did not change the result for sfc \/scannow.Trying DISM in admin command prompt - DISM.exe \/Online \/Cleanup-Imageresult - Error: 193result - %1 is not a valid Win32 Application.Error from the DISM log file - DISM.EXE: DISM Package Manager processed the command line but failed. HRESULT=800700C1 (surprise)I tried doing a reset including the clean reset, but it failed.I saw somewhere some people had success with modifying the .dll files in C:\\Windows\\System32\\downlevel, but it wasn't really clear what they did or why. Looking in my downlevel folder there is nothing that looks obviously out of place (like not at .dll), but I don't really know what would look out of place. place I saw this - https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-performance\/dism-error-193\/f5c78f44-0bd0-47cf-812d-f1fe7d311199Not really sure where to go from here ","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command promptDISM \/Online \/Cleanup-Image \/RestoreHealthRun these commands on the command prompt to restart windows update servicesnet stop bitsnet stop cryptsvcnet stop wuauservnet stop msiserverRen C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.old net start bitsnet start cryptsvcnet start wuauservnet start msiserverAfter successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartThis should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)"]},{"symptom":"Cumulative for Windows 10 update 2019-11 for x64-based Systems will not install; error code 0x80070570        I have tried installing 2019-11 Cumulative Update for Windows 10 Version 1903 for x64-based Systems (KB4524570)  I keep on getting Error 0x80070570. Called and spoke with tech support and no luck. The fellow couldn't even tell me what the error message 0x80070570 was. If I can not install KB4524570, it would appear that that I will not be able to install the 19H2 Win update. I do not know what to do and really would appreciate any advice I can get.","solutions":["Hi! HeywoodKlebenov I'm Marvin an Independent Advisor, and I will help you with your issue. Try installing the windows update manually. 1. Visit the Microsoft Update Catalog website in any web browser. https:\/\/www.catalog.update.microsoft.com\/Home.aspx2. Click on the search bar (located at the top right corner), type the KB number of the Windows Update package you wish to install, and press enter.4. The result page will list down various versions of Windows 10 update, including 32-bit, 64-bit, ARM, Windows 10 in S mode and others. You have to select the correct version after verifying your system configurations from Settings > System > About.5. Click the Download button and a popup window will appear. In the popup window, click the .msu file link to download it.When the file has finished downloading, double-click on the .msu file and Windows will install the new update.Restart and you will finish. If you still having problems with this, I will be around to help you. Regards.","Thank you for your response, but I have tried the download using Microsoft Update Catalog website. Still the same problem. If you have any other ideas please let me know.","I suggest you install the update with the Media Creation Tool and check if the issue persists.https:\/\/support.microsoft.com\/en-us\/help\/15088\/...","I have tried installing 2019-11 Cumulative Update for Windows 10 Version 1903 for x64-based Systems (KB4524570)  I keep on getting Error 0x80070570. Called and spoke with tech support and no luck. The fellow couldn't even tell me what the error message 0x80070570 was. If I can not install KB4524570, it would appear that that I will not be able to install the 19H2 Win update. I do not know what to do and really would appreciate any advice I can get.","I have tried installing 2019-11 Cumulative Update for Windows 10 Version 1903 for x64-based Systems (KB4524570)  I keep on getting Error 0x80070570. Called and spoke with tech support and no luck. The fellow couldn't even tell me what the error message 0x80070570 was. If I can not install KB4524570, it would appear that that I will not be able to install the 19H2 Win update. I do not know what to do and really would appreciate any advice I can get."]},{"symptom":"BSOD MEMORY_MANAGEMENT Help with Analysis        Hello, i've been getting frequent BSOD crashes under the error code mem_management so I did a driver test with CMD, followed the steps and upon startup it kept crashing. I booted into safe mode to extract the minidump files and i've uploaded the latest 3 dmp files into this onedrive link. https:\/\/onedrive.live.com\/?auth=1&id=root&cid=313D8B7743649D11Would appreciate some help with figuring out which driver is causing me issues, so I can update it and get on with my BSOD free life. THANKS!!! ","solutions":["Hi Manny The minidump files indicate bcmwl63a.sys as the cause of your system crashes, that is the device driver on your Broadcom network adapterGo to the support page for you PC on the Manufacturers website, then from there, download and install the Broadcom network device driver they recommend . . ."]},{"symptom":"Windows 10 cellural connection reverts to metered        Hi,I have a Windows 10 laptop where I use a 4g cellural connection with unlimited data plan.I have set the cellural connection as not metered connection. Unfortunately for some reason this gets reverted to metered connection automatically very often. This is quite troublesome since it stops OneDrive sync among other things when it happens.Is there any fix or trick for this?","solutions":["Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.I found an existing article that might help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this helps. Please let me know if you have further questions."]},{"symptom":"How to disable Microsoft Store in Windows 10 Home?        How to disable Microsoft Store in Windows 10 Home? I want to uninstall a few games and to prevent the games being installed by Microsoft Store.Searching for a solution, I find that people recommend using gpedit.msc to do this. But it is not in Win 10 Home.Group Edit Policy does not exist here.Also in the Registry, I do notsee Windows Store.","solutions":["Hi goodnewsforyou Right click your Start Button, then choose Powershell (admin) Paste this into Powershell and hit Enter, to uninstall the Store App from Windows 10:Get-AppxPackage -allusers *WindowsStore* | Remove-AppxPackage If you want to re-install the Store App at a later stage, you can use this command:Get-AppxPackage -allusers *WindowsStore* | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register “$($_.InstallLocation)\\AppXManifest.xml”}","Hello,Please refer FIX 2 here:https:\/\/www.kapilarya.com\/how-to-disable-microsoft-store-in-windows-10Hope this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP. ","Neither of the suggested 'solutions' worked.see attached screenshot.I ran the command in powershell admin, but then from the Start menu, was still able to launch Microsoft store. It is not disabled.UPDATE:I restarted my computer and temporarily it seemed ms store was disabled but then I was able to launch it again when I click in the Windows icon. see screenshot. ","failed. please see my reply below","Hi GoodnewsforyouHiMy name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Hit the Windows key + R and type regedit or just go to the Start menu and type the same thing.In the Registry Editor, you need to navigate to the following path – if it does not exist, right-click each parent folder and New > Key to create it using the names below:HKEY_LOCAL_MACHINE\\SOFTWARE\\Policies\\Microsoft\\WindowsStoreOnce you’re in the WindowsStore key, right-click the right side of the pane and go to New > D-WORD (32-bit) Value to create a new registry entry that must be called RemoveWindowsStore.By default, this item is configured to 0 and you need to double-click it to switch to 1. This value defines the status of the new registry key called RemoveWindowsStore, as it follows: 1 – enabled and 0 – disabled.If you want to restore access to the Microsoft Store at a later time, you can just switch to value 0 or just delete RemoveWindowsStore entirely.Hope this helps.","There is no HKEY_LOCAL_MACHINE\\SOFTWARE\\Policies\\Microsoft\\WindowsStorePlease see attached screenshot. How come the experts who posted suggested solutions earlier are not interested in seeing why it failed? ","For what little help it may be ................I found a Microsoft TechNet article dated March 14th of 2019, which suggests that, a variation of the Power Shell command DaveM121 posted, might do the trick.Here's a link to the TechNet article.Microsoft TechNet postAnd here's what the article suggests:Get-AppxPackage -name \"*windowsstore*\" -user \"username\" | Remove-AppxPackage(Of course you need to replace \"username\" with YOUR user name.)","When I read Jon B's advice, I read it to mean that to mean you should also create the HKEY_LOCAL_MACHINE\\SOFTWARE\\Policies\\Microsoft\\WindowsStore key as well, if it doesn't exist, then create the RemoveWindowsStore key under that.","Hi. goodnewsforyouIm new to windows but i think i know a solution1. Try delete microsoft store2. Try install microsoft story back3. If you do the 1 and 2 steps try uninstall back from settings or microsoft storeIf this help you thanks! With happy Nick"]},{"symptom":"How to remove Your Phone Companion Link from Samsung 10s        Received an update request to Your Phone Companion on phone but can't find that app in app list.I no longer use a PC (stopped working months ago) so I don't need the app.How can I stop receiving update requests?Regards, V","solutions":["Hi V If you no longer need that Your Phone Companion App on your Phone: On your Phone, go to Settings - Apps Then click Apps and find the Your Phone Companion App and uninstall that from thereIf you want to keep the App, then you should be able to turn off those Notifications from Settings - Notifications on your Phone . . .","Found it in System apps.Uninstall option is not available, Disable option is not available, only Force Stop.I'm not interested in keeping the app. Do I need to get a PC to uninstall it?Guess I will have to block notifications, for now."]},{"symptom":"Need help please with random BSOD while watching movies with PotPlayer 64, here's the logs:        BlueScreenView:Dump File         : 122919-11531-01.dmpCrash Time        : 29\/12\/2019 11:42:17Bug Check String  : Bug Check Code    : 0x00000124Parameter 1       : 00000000`00000000Parameter 2       : ffffa40e`d7ae3028Parameter 3       : 00000000`bf800000Parameter 4       : 00000000`00000114Caused By Driver  : hal.dllCaused By Address : hal.dll+47fe8File Description  : Product Name      : Company           : File Version      : Processor         : x64Crash Address     : ntoskrnl.exe+1c14e0Stack Address 1   : Stack Address 2   : Stack Address 3   : Computer Name     : Full Path         : C:\\Windows\\MiniDump\\122919-11531-01.dmpProcessors Count  : 12Major Version     : 15Minor Version     : 18362Dump File Size    : 2 826 220Dump File Time    : 29\/12\/2019 11:43:31==================================================Event Viewer:Nome do registo:SystemOrigem:        Microsoft-Windows-Kernel-PowerData:          29\/12\/2019 11:43:18ID do evento:  41Categoria de Tarefa:(63)Nível:         CríticoPalavras-chave:(70368744177664),(2)Utilizador:    SYSTEMComputador:    DESKTOP-0SPV6GEDescrição:O sistema foi reiniciado sem primeiro ter sido encerrado de forma correta. Este erro pode ter ocorrido porque o sistema parou de responder, sofreu uma falha ou ficou sem energia inesperadamente.Evento Xml:<Event xmlns=\"http:\/\/schemas.microsoft.com\/win\/2004\/08\/events\/event\">  <System>    <Provider Name=\"Microsoft-Windows-Kernel-Power\" Guid=\"{331c3b3a-2005-44c2-ac5e-77220c37d6b4}\" \/>    <EventID>41<\/EventID>    <Version>6<\/Version>    <Level>1<\/Level>    <Task>63<\/Task>    <Opcode>0<\/Opcode>    <Keywords>0x8000400000000002<\/Keywords>    <TimeCreated SystemTime=\"2019-12-29T11:43:18.998399100Z\" \/>    <EventRecordID>6457<\/EventRecordID>    <Correlation \/>    <Execution ProcessID=\"4\" ThreadID=\"8\" \/>    <Channel>System<\/Channel>    <Computer>DESKTOP-0SPV6GE<\/Computer>    <Security UserID=\"S-1-5-18\" \/>  <\/System>  <EventData>    <Data Name=\"BugcheckCode\">292<\/Data>    <Data Name=\"BugcheckParameter1\">0x0<\/Data>    <Data Name=\"BugcheckParameter2\">0xffffa40ed7ae3028<\/Data>    <Data Name=\"BugcheckParameter3\">0xbf800000<\/Data>    <Data Name=\"BugcheckParameter4\">0x114<\/Data>    <Data Name=\"SleepInProgress\">0<\/Data>    <Data Name=\"PowerButtonTimestamp\">0<\/Data>    <Data Name=\"BootAppStatus\">0<\/Data>    <Data Name=\"Checkpoint\">41<\/Data>    <Data Name=\"ConnectedStandbyInProgress\">false<\/Data>    <Data Name=\"SystemSleepTransitionsToOn\">23<\/Data>    <Data Name=\"CsEntryScenarioInstanceId\">0<\/Data>    <Data Name=\"BugcheckInfoFromEFI\">false<\/Data>    <Data Name=\"CheckpointStatus\">0<\/Data>  <\/EventData><\/Event>Also, tried all troubleshooting measures possible, Windows Update, SFC, chkdsk, updating alldrivers, checked devices, all seemed fine,i ran as well ,  all hardware tests from \"BurnInTest v9.1\" program  with no issues at all.This is a brand new laptop and this is the model:ACER Predator PH315-52sn: NHQ54EB00492603ACD2600Specs : http:\/\/speccy.piriform.com\/results\/hYinMnwEakF5yN238zRTSZk","solutions":["Hi Marco, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.We need log files(called dump files) that tell us what lead to crash. Please share them with us for a better analysis of the problem. Instructions can be found here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Please let us know if you need any assistance about posting dump files.","Relatório das informações do sistema escritas em: 12\/29\/19 15:57:12 Nome de sistema: DESKTOP-0SPV6GE[Relatório de Erros do Windows]Hora    Tipo    Detalhes 29\/12\/2019 14:14    Application Error    Nome da aplicação com falha: bad_module_info, versão: 0.0 .0.0, carimbo de data\/hora: 0x00000000&#x000d;&#x000a;Nome do módulo com falha: unknown, versão: 0 .0.0.0, carimbo de data\/hora: 0x00000000&#x000d;&#x000a;Código de exceção: 0xc0000005&#x000d;&#x00 0a;Desvio de falha: 0x00007ffcc87fde3a&#x000d;&#x000a;ID do processo com falha: 0x8ec&#x000d;&#x00 0a;Hora de início da aplicação com falha: 0x01d5be513de6871f&#x000d;&#x000a;Caminho da aplicação c om falha: bad_module_info&#x000d;&#x000a;Caminho do módulo com falha: unknown&#x000d;&#x000a;ID do Relatório: 11b2d56d-9628-489a-ab2d-286960e9f5ad&#x000d;&#x000a;Nome completo do pacote com falha: &#x000d;&#x000a;ID da aplicação relativa ao pacote com falha: 29\/12\/2019 14:14    Application Error    Nome da aplicação com falha: bad_module_info, versão: 0.0 .0.0, carimbo de data\/hora: 0x00000000&#x000d;&#x000a;Nome do módulo com falha: unknown, versão: 0 .0.0.0, carimbo de data\/hora: 0x00000000&#x000d;&#x000a;Código de exceção: 0xc0000005&#x000d;&#x00 0a;Desvio de falha: 0x00007ffcc87fde3a&#x000d;&#x000a;ID do processo com falha: 0x13d4&#x000d;&#x0 00a;Hora de início da aplicação com falha: 0x01d5be513de622c1&#x000d;&#x000a;Caminho da aplicação com falha: bad_module_info&#x000d;&#x000a;Caminho do módulo com falha: unknown&#x000d;&#x000a;ID d o Relatório: 60e82497-e54b-4da1-94b6-3735e46b8a6b&#x000d;&#x000a;Nome completo do pacote com falha : &#x000d;&#x000a;ID da aplicação relativa ao pacote com falha: 29\/12\/2019 14:14    Application Error    Nome da aplicação com falha: bad_module_info, versão: 0.0 .0.0, carimbo de data\/hora: 0x00000000&#x000d;&#x000a;Nome do módulo com falha: unknown, versão: 0 .0.0.0, carimbo de data\/hora: 0x00000000&#x000d;&#x000a;Código de exceção: 0xc0000005&#x000d;&#x00 0a;Desvio de falha: 0x00007ffcc87fde3a&#x000d;&#x000a;ID do processo com falha: 0x204c&#x000d;&#x0 00a;Hora de início da aplicação com falha: 0x01d5be513de5d63e&#x000d;&#x000a;Caminho da aplicação com falha: bad_module_info&#x000d;&#x000a;Caminho do módulo com falha: unknown&#x000d;&#x000a;ID d o Relatório: e925c873-0381-43f6-aade-d34def7ca0a5&#x000d;&#x000a;Nome completo do pacote com falha : &#x000d;&#x000a;ID da aplicação relativa ao pacote com falha: 29\/12\/2019 14:14    Application Error    Nome da aplicação com falha: bad_module_info, versão: 0.0 .0.0, carimbo de data\/hora: 0x00000000&#x000d;&#x000a;Nome do módulo com falha: unknown, versão: 0 .0.0.0, carimbo de data\/hora: 0x00000000&#x000d;&#x000a;Código de exceção: 0xc0000005&#x000d;&#x00 0a;Desvio de falha: 0x00007ffcc87fde3a&#x000d;&#x000a;ID do processo com falha: 0x1924&#x000d;&#x0 00a;Hora de início da aplicação com falha: 0x01d5be513de3f22c&#x000d;&#x000a;Caminho da aplicação com falha: bad_module_info&#x000d;&#x000a;Caminho do módulo com falha: unknown&#x000d;&#x000a;ID d o Relatório: 9a571264-1f5b-4efc-9433-6fe0527ff9ec&#x000d;&#x000a;Nome completo do pacote com falha : &#x000d;&#x000a;ID da aplicação relativa ao pacote com falha: 29\/12\/2019 03:23    Application Error    Nome da aplicação com falha: YourPhone.exe, versão: 1.191 12.111.0, carimbo de data\/hora: 0x5dfc4300&#x000d;&#x000a;Nome do módulo com falha: ntdll.dll, ver são: 10.0.18362.418, carimbo de data\/hora: 0x99ca0526&#x000d;&#x000a;Código de exceção: 0xc0000005 &#x000d;&#x000a;Desvio de falha: 0x0000000000028e86&#x000d;&#x000a;ID do processo com falha: 0x5d4 c&#x000d;&#x000a;Hora de início da aplicação com falha: 0x01d5bd4feb6a93c1&#x000d;&#x000a;Caminho da aplicação com falha: C:\\Program Files\\WindowsApps\\Microsoft.YourPhone_1.19112.111.0_x64__8wekyb 3d8bbwe\\YourPhone.exe&#x000d;&#x000a;Caminho do módulo com falha: C:\\Windows\\SYSTEM32\\ntdll.dll&#x 000d;&#x000a;ID do Relatório: 223a773c-1d86-47d8-b146-817ed3a73be1&#x000d;&#x000a;Nome completo do pacote com falha: Microsoft.YourPhone_1.19112.111.0_x64__8wekyb3d8bbwe&#x000d;&#x000a;ID da aplic ação relativa ao pacote com falha: App","i was tryin to find the dump file but folder is empty!C:\\Windows\\MiniDump\\122919-11531-01.dmp   it is this one?cant find it there.","Thank you. Yes, I need that.Did you run a Cleanup tool like disk Cleanup that might have removed those?","The specific BS:29\/12\/2019 11:43 Windows Error Reporting Bucket de falhas , tipo 0&#x000d;&#x000a;Nome do Evento: BlueScreen&#x000d;&#x000a;Resposta: Não disponível&#x000d;&#x000a;ID do Cab: 0&#x000d;&#x000a;&#x000d;&#x000a;Assinatura do problema:&#x000d;&#x000a;P1: 124&#x000d;&#x000a;P2: 0&#x000d;&#x000a;P3: ffffa40ed7ae3028&#x000d;&#x000a;P4: bf800000&#x000d;&#x000a;P5: 114&#x000d;&#x000a;P6: 10_0_18363&#x000d;&#x000a;P7: 0_0&#x000d;&#x000a;P8: 768_1&#x000d;&#x000a;P9: &#x000d;&#x000a;P10: &#x000d;&#x000a;&#x000d;&#x000a;Ficheiros anexados:&#x000d;&#x000a;\\\\?\\C:\\Windows\\Minidump\\122919-11531-01.dmp&#x000d;&#x000a;\\\\?\\C:\\Windows\\TEMP\\WER-15546-0.sysdata.xml&#x000d;&#x000a;\\\\?\\C:\\Windows\\MEMORY.DMP&#x000d;&#x000a;\\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\Temp\\WER4AE3.tmp.WERInternalMetadata.xml&#x000d;&#x000a;\\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\Temp\\WER4AF4.tmp.xml&#x000d;&#x000a;\\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\Temp\\WER4B03.tmp.csv&#x000d;&#x000a;\\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\Temp\\WER4B33.tmp.txt&#x000d;&#x000a;&#x000d;&#x000a;Estes ficheiros podem estar disponíveis aqui:&#x000d;&#x000a;\\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\ReportArchive\\Kernel_124_3c66bdc478278e02a50521759ad8ce3710c88a_00000000_cab_70061ec6-29a7-418b-b226-cbca54786db6&#x000d;&#x000a;&#x000d;&#x000a;Símbolo de análise: &#x000d;&#x000a;A verificar novamente a solução: 0&#x000d;&#x000a;ID do relatório: 1d920224-db85-409f-9897-606d9b230807&#x000d;&#x000a;Estado do Relatório: 2049&#x000d;&#x000a;Bucket com hash: &#x000d;&#x000a;Guid do Cab: 0","I tried to view the file with notepad, no sucess , and after a moment it disapeared, might have been the cause..No cleaners today used","this is the BS from 23-12-2019:23\/12\/2019 21:32 Windows Error Reporting Bucket de falhas , tipo 0&#x000d;&#x000a;Nome do Evento: BlueScreen&#x000d;&#x000a;Resposta: Não disponível&#x000d;&#x000a;ID do Cab: 0&#x000d;&#x000a;&#x000d;&#x000a;Assinatura do problema:&#x000d;&#x000a;P1: 124&#x000d;&#x000a;P2: 0&#x000d;&#x000a;P3: ffff830edfd15028&#x000d;&#x000a;P4: bf800000&#x000d;&#x000a;P5: 114&#x000d;&#x000a;P6: 10_0_18363&#x000d;&#x000a;P7: 0_0&#x000d;&#x000a;P8: 768_1&#x000d;&#x000a;P9: &#x000d;&#x000a;P10: &#x000d;&#x000a;&#x000d;&#x000a;Ficheiros anexados:&#x000d;&#x000a;\\\\?\\C:\\Windows\\Minidump\\122319-10718-01.dmp&#x000d;&#x000a;\\\\?\\C:\\Windows\\TEMP\\WER-13484-0.sysdata.xml&#x000d;&#x000a;\\\\?\\C:\\Windows\\MEMORY.DMP&#x000d;&#x000a;\\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\Temp\\WER4239.tmp.WERInternalMetadata.xml&#x000d;&#x000a;\\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\Temp\\WER4249.tmp.xml&#x000d;&#x000a;\\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\Temp\\WER4258.tmp.csv&#x000d;&#x000a;\\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\Temp\\WER4278.tmp.txt&#x000d;&#x000a;&#x000d;&#x000a;Estes ficheiros podem estar disponíveis aqui:&#x000d;&#x000a;\\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\ReportArchive\\Kernel_124_85a2ffd36f6d22b6c22bef58552bb8dd4db685e_00000000_cab_516d7946-4091-41ea-88ba-d7b4795ddfd6&#x000d;&#x000a;&#x000d;&#x000a;Símbolo de análise: &#x000d;&#x000a;A verificar novamente a solução: 0&#x000d;&#x000a;ID do relatório: 96519dae-4c26-41ae-8073-6fc8d4eb38bc&#x000d;&#x000a;Estado do Relatório: 2049&#x000d;&#x000a;Bucket com hash: &#x000d;&#x000a;Guid do Cab: 0","Hi, If that happens again, see if dump is generated. To better understand the issue, Please see the article below on how to share System logs.http:\/\/www.yourwindowsguide.com\/2017\/12\/how-to-...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads.","i've posted the BlueScreenview log,  Windows Event view log, msinfo32 log…Are you sure you need more?! what in specific?thanks in advance","Nothing more, Marco. Please share the link of the shared folder."]},{"symptom":"winzip is confusing? idk.        so like i downloaded this game that's a .zip file and when i tried to open the .exe file from winzip it said that it couldn't execute and it was asking if the .exe file itself was missing. that always happens with .zip files i download. what am i doing wrong","solutions":["Hi XxWeirdxX Is the file you are downloading in a zip format or an exe format? If that is in a Zip format, you do not need WinZip, you can right click the Zip file and choose 'Extract Here', which will use the built-in functionality of Explorer to open the Zip fileIf that is in an exe format, do you know if that is a self extracting Zip archive?If so, move that to a different folder on your hard drive and see if you can extract that file from there . . .If not, please provide a screenshot of that file and the exact error you are seeing . ."]},{"symptom":"Windows 10 1909 clean installation - Freezes after instalation within few minutes and never restarts        Hi, I have never ending installation issues with my HP ProBook 450 G0 laptop.1909 update was not possible via automatic updates, because it freezes somewhere midway so I made a clean install from USB flashdisk.Installation went smoothly and windows 10 booted just fine, but after 5-10 system froze out of nowhere, so only power down could restart it, and after that every restart freezes, system does not even get to login screen again.Please, could someone help me with this issue. I won't comment the reliability of Windows 10 install\/update mechanism, but this is just inacceptable. My expensive hardware is now just piece of scrap and I would very like if microsoft fixed that.Regards","solutions":["Have you checked the HP website for updates to drivers for 1909, is there a bios update.","Hi, MariusWerner My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.I recommend reviewing the RAM Memory Using these steps requires you to restart your computer, so make sure to save any files you may have open and close any running applications before proceeding. Here goes:1.- Open Control Panel. 2.- Click on System and Security. 3.- Click on Administrative Tools. 4.- Double-click the Windows Memory Diagnostic shortcut. A quick tip: Alternatively, you can also use the Windows key + R keyboard shortcut, type mdsched.exe, and click OK to launch the tool.5.- Click the Restart now and check problems option. I would recommend you to check your Hard Disk with chkdsk. 1) On your keyboard, press the Windows logo key and S key at the same time, then type cmd in the search box.2) Right-click Command Prompt, then select Run as administrator. 3) Type chkdsk \/f \/r, then press Enter on your keyboard. 4) Press Y on your keyboard. 5) Press the Windows logo key and R at the same time, then type mdsched.exe. 6) Click Restart now and check for problems (recommended). Your PC will restart immediately.7) Wait for the scans to finish.","Thanks for answer. Bios is up to date. It did not helped the automatic update from previous version, nor the clean installation.","Hello and thanks for answer.I don't think that is the problem. Everything ran just fine (omitting it was all very slow) in the previous windows 1809 version. I made clean install only because windows was not able to update itself to newer one.","Well, after few hard resets windows offered a screen with self-repair option and that fixed any mysterious issues it had, so now it works.I guess, the problem was in Windows 10 (1909, I had not this problem with clean installation of 1809), somehow failing to install themselves even from clean install :-(, but at least it was able to repair itself afterwards.","Well, after few hard resets windows offered a screen with self-repair option and that fixed any mysterious issues it had, so now it works.I guess, the problem was in Windows 10 (1909, I had not this problem with clean installation of 1809), somehow failing to install themselves even from clean install :-(, but at least it was able to repair itself afterwards.","Configure a clean Windows startup and then check if your PC is still slow and you can add the programs in parts to see what is causing problems.https:\/\/support.microsoft.com\/en-us\/help\/929135..."]},{"symptom":"Changing display adapter for monitor        My questionIn the device manager, as well as in the Advanced Screen Settings, Windows tell me that my external monitor is connected to\/run by the least powerful of the two graphics cards in my laptop (namely the Intel UHD Graphics 620, my integrated GPU), but I wan't to switch it over to the other: a Nvidia Geforce MX150.I've found a lot of guides online for declaring that certain programs should be 'rendered' by the Nvidia GPU (using the Nvidia Control Panel), but I can't seem to find outhow to change which graphics card runs the monitor itself. To my understanding, if I change which GPU runs a specific program, that GPU will be in charge of calculating what should be on-screen in the window, but it will still have to pass that information through the GPU that actually renders the screen.Below are some screenshots:Device Manager --> Displays --> Right click AOC U2790B (my external monitor) --> Properties. Where it says \"Placering\" (Danish for Location), I want it to say Nvidia Geforce MX150dxdiag for the external monitor:Display Settings (possibly screen settings) --> Advanced Display Settings --> Properties for display AdapterBackground\/what I really want to accomplishI recently bought a new AOC U2790PQU-monitor, which is a 4k, 60Hz, 10-bit display (according to the spec sheet).Windows, however, is telling me that it is only 8 bit, and I can't raise the framerate to 60Hz without lowering the resolution.After doing some research, I think it might be because Intel UHD Graphics 620 (the integrated graphics card on my laptop) is creating a bottleneck\/isn't fast enough to run the display to the max.What I really want to accomplish, though, is just to get 4k 60Hz 10-bit, so if you have another idea for what might be the problem, I'd love to test it out.","solutions":["Hi, I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.You will want to investigate if you can disable discrete graphics from the BIOS for your computer. For example, HP laptops have an option in BIOS:https:\/\/support.hp.com\/us-en\/document\/c04070522If you don't have that, NVIDIA Control Panel's Manage 3D Settings > Preferred Graphics Processor under Global Settings is your next best bet.https:\/\/support.lenovo.com\/us\/en\/solutions\/ht07... (expand section on Intel and Nvidia dual graphics)Let me know if I can help you further! Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi comnutsThank you for taking the time to help meI looked in my bios settings, and found one under Configuration calledGraphic Device. It was set to [Discrete]. I didn't change it, though, because the only other option was [UMA Only], which (I think) means that only the Intel GPU will be used - see the attached imageI also tried changing the setting in the Nvidia Control Panel that you mentioned, but the monitor is still run by the Intel. Interestingly, Task Manager still shows only the Intel being used (unless I do something really graphics heavy), even after I chose the Nvidia as my Preferred GPU.Looking through the Nvidia app, I found something looked like it could be promising. In theSet PhysX configuration-tab (Loosely translated), it looks like I should be able to change which displays belong to which GPU.(\"Skærm på bærbar\", which is what the second green box says, means \"Laptop Screen\")I can't really figure out how to actually change anything (dragging and dropping the 'screens' doesn't work, and the drop-down, which is currently set to \"Choose automatically\", doesn't move the screens around either, it just changes the diagram slightly)Do you have any experience with this tab? Even if I could move the screen to the second GPU, would that only change the PhysX thing (whatever that is), or would it also do what I'm trying to accomplish?Thanks again for your help, let me know if there's anything more I should test!","Ok, no choice for your BIOS selection then. You may change PhysX processor to your NVIDIA GPU. It is an open-source realtime physics engine middleware SDK by NVIDIA. I don't believe this would change how the monitor is connected to now.Please provide the brand and model of your computer. I can try and find out more for you.","Another question, have you tried Extend these displays? Select the Start button, then select Settings > System > Display. For Multiple monitors, select Extend these displays.","It's a Lenovo Ideapad 530s-14IKB, currently running Windows 10 1909","Yes, I've tried the different projection options. I should probably add if I haven't already that my laptop's build-in display is controlled by the Intel GPU as well.","I'm analyzing on a hardware perspective now, so I can be right or wrong. I'll let other experts take a look at your question after this.If you are using the onboard HDMI, that will be HDMI v1.4 - http:\/\/psref.lenovo.com\/syspool\/Sys\/PDF\/Lenovo_... If you read this article by NVIDIA, you won't get to 10bpc - https:\/\/nvidia.custhelp.com\/app\/answers\/detail\/.... \"One typical case is using HDMI HDR TV which are capable of 10\/12bpc but due to Bandwidth limitation of HDMI 2.0 higher color depths are not possible with4k@60hz. To accommodate such cases you can try lowering refresh rate or lowering resolution to get those options.\" DP 1.2 should be sufficient and you have a USB 3.1 Type-C Gen 1 port, it something that can be tested out. But if you are already doing this, then it must be something else.","I've been using the HDMI, so I'll try to get my hands on a USB-C to DP-converter. But even though I'm using the HDMI, shouldn't I still be able to get 4k@60hz, just without 10-bit?","Not quite, the maximum is 4096x2160 @ 24 Hz for HDMI. https:\/\/www.intel.com\/content\/www\/us\/en\/support...More FAQ you can read https:\/\/www.intel.com\/content\/www\/us\/en\/support...https:\/\/www.intel.com\/content\/www\/us\/en\/support...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Ah, thank you very much. I guess I should have done a bit more research before I bought the monitor, but I never really thought about the PC being a limiting factor.I'm afraid my USB-C doesn't support Alternate Modes, so (I think) I can't use it for DisplayPort. Either way, according to https:\/\/www.displayport.org\/displayport-over-usb-c\/, USB-C doesn't allow 10 bit at this resolution:\"4K @60Hz 24-bit color (without compression) with simultaneous USB 3.1\"It would've been nice to get the 60Hz though, but I'll manage :)Thank you again for helping me, I would've never found these sites without your help. I have one last question\/desperate hope, but I realize it's probably unlikely to be the case: Do you know if there is any way to output screen information through USB-C, even without alternate mode? I mean, my USB-C is capable of sending the amount of information required, just not in the right \"format\"."]},{"symptom":"Installed physical RAM vs Total physical RAM        Hello everyone,I tried to install 16 GB of RAM to my computer, instead of the initial 8 I had. But when I add the new RAM (in total 4x4 GB of RAM, and they are the same kind). the installed RAM increases to 16 but the total physical RAM hence the total usable RAM remains 8 GB.I want to point out, I am NOT talking about available physical memory, but TOTAL, compared to installed.(Sorry the system is not English, but this is a screenshot from System properties so the titles follow each other the same way.)I have a 64-bit Win 10, so that is not the issue. BIOS sees all four modules, and there is no indication that the GPU uses the extra memory.Tried to change the paging file size, but didn't help.I am at a loss. Especially because only appears over 8 GB of memory, no matter which module goes into which socket.Thanks in advance, hope someone can help.Cheers,Matt","solutions":["What is showing when you look at Task Manager>Performance>Memory? What is showing in Settings>System>About?","Could be a setting or motherboard issue. The following link has some suggestions: https:\/\/appuals.com\/windows-10-wont-use-full-ram\/Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","If you haven't figured out your problem why don't you run this scanner and see what it shows?https:\/\/www.crucial.com\/usa\/en\/systemscanner?cm_re=us-footer-_-us-upgrade-_-us-upgrade-scanner"]},{"symptom":"Update error        Hello,I have this problem with update and windows defender not working, i don’t know what i have to do please help me,have a nice day","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command prompt DISM \/Online \/Cleanup-Image \/RestoreHealth Run these commands on the command prompt to restart windows update services net stop bits net stop cryptsvc net stop wuauserv net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start bits net start cryptsvc net start wuauserv net start msiserver After successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig 2. On the system configuration window go to the services tab 3. Tick on hide all microsoft service so that this won't be affected 4. Choose to disable all services 5. Next, go to the startup tab and on the window choose to open task manager 6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok 8. A prompt to restart the computer will show up, choose to restart This should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo... 2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept. 4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","Hello,i am very sorry for the late reply i already fix the problem by updating the windows with microsoft media creation toolthank you for your help and have good day"]},{"symptom":"Cause of Drive Disappearing and having to be setup again?        As the title suggests, I am trying to figure out the cause of one of my drives disappearing from \"Drives and Device\" and requiring me to set it up again through Disk Management.Full story being; I had done a clean install of windows and completely reset my computer yesterday morning. I had to set up one of my storage drives through Disk Management.(I use a smaller SSD for purely Windows, along with some other important programs like GeForce Experience and the like. I also have a normal Hard Drive and another SSD for storage, both are 1TB's. The SSD, not for Windows, is the one that needed to be set up with Disk Management)So I had done that, given it the drive letter and gone through that whole process.  The SSD for storage was working completely fine throughout the entire day.I start up my computer today and realise that my SSD isnt listed under \"Drives and Devices\". Since I had only just done a fresh install of Windows, there wasn't much on it, so not much time was lost. Before setting it up in Disk Management again, I changed the cables around to different plugs to see if I could possibly restore it but that didn't work so I went ahead with setting it up.I'm not too bothered by the time lost, I am worried though about how it may have happened and if it might happen again. This is a newish drive and this is the first time that has happened to me. It hadn't happened even before the fresh Windows install.If someone could be able to tell me what the issue may have been, if it's likely to happen again and if it's something to be worried about, that would be great. Or at least be able to point me to someone that may know.","solutions":["Hi, Can you provide the following information which may help determine any issue(s): Windows Key + R > type msinfo32 in the \"Open\" box > OK > File > Save > then save as an .nfo fileThen make the resulting .nfo file available via a public folder on OneDrive or similar site.Also, can you do the following: Windows Key + R > type eventvwr in the \"Open\" box > OK > expand \"Custom Views\" and then right-click \"Administrative Events\" > select \"Save all events in Custom View As\" and save as an .evtx fileThen make the resulting .evtx file available via a public folder on OneDrive or similar site.Here's a link on using OneDrive: https:\/\/support.office.com\/en-us\/article\/share-..."]},{"symptom":"After blue screen ,Laptop could not start .For window restore ,window 10 was not found ,and had to use win8.1.How to reinstall win10 again?         Laptop Lenovo G5030 came with option to upgrade OS from Win8.1 to Win10.Was successfully upgraded.But in June ,2019,after blue screen ,Laptop could not start .For window restore ,window 10 was not found ,and had to use win8.1.How to reinstall win10 again? Thanks & Regards!!","solutions":["Hi Poshika, you can reinstall Windows 10 at any time and it will not cost you anything !You should just clean install Windows 10 rather than upgrading from Windows 8.1. This will have 3 benefits, you will not need a product key, activation will be automatic, if you have to reset again, it will reset to Windows 10, not 8.1 and your system will be more responsive and reliable . . . Since you previously had Windows 10 installed and activated on that PC during the installation process skip the steps which ask for a product key and select the option 'I am Reinstalling Windows 10 on this PC', and activation will not be an issue, your PC will have a digital entitlement stored on the Microsoft Activation Servers Make sure you install the same Edition of Windows 10 (Home, Pro . . . etc.) you previously had installed to avoid Activation issuesClick this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), you can create a bootable USB flash drive (min 8GB) using that toolThen, Boot your PC from the Installation Media you just created (change Boot Order in your BIOS) to begin installing Windows 10"]},{"symptom":"Can't connect to one specific Wi-Fi network...        Xiaomi Laptop Pro 2019.Then I boot a laptop, it can't connect to my home wi-fi. Troubleshooting resets the profile (as it says) and it works!... For 15 seconds.Turning off-on adapter in device manager - same result. Same as rebooting my router. Is there any way to make it work?","solutions":["Hi, Its possible the drivers built into Windows might be buggy. If you can cable in to the router then go to the manufactures website and download them, then you should be able to install those instead.","Hi Domitoryana,can other wireless devices connect to your wi-fi network and access the internet?If you have an Android smartphone, configure the hotspot, then connect to the hotspot with your PC and check if it works.Otherwise go to Device Management> network adapters, select your network adapter in use, click on the Power Management tab, clear the checkbox: Allow the computer to turn off the device to save energy. Try again.https:\/\/support.microsoft.com\/en-us\/help\/10741\/windows-fix-network-connection-issues"]},{"symptom":"WSUS download version 1903 but not apply        Hello and good afternnon,I have a problem with WSUS (Versión: 10.0.16299.2) and updates for windows version 1903, the update is approved but never it´s download. Somebody can help me? Please. I attached a image. Kind regards.","solutions":["Hi Luis I am sorry, Hi Community is just a consumer forum, due to the scope of your question (WSUS) can you please post this question to our sister forum on TechNet in the WSUS section (linked below)Over there you will have access to a host of WSUS experts and will get a knowledgeable and quick answer to this question . ..https:\/\/social.technet.microsoft.com\/Forums\/en-...","Hi Luis I am sorry, Hi Community is just a consumer forum, due to the scope of your question (WSUS) can you please post this question to our sister forum on TechNet in the WSUS section (linked below)Over there you will have access to a host of WSUS experts and will get a knowledgeable and quick answer to this question . ..https:\/\/social.technet.microsoft.com\/Forums\/en-...ok, thank you."]},{"symptom":"File Explorer won't show the whole list of folders when i click on downloads        After updating my windows to the latest version, I encountered this. Please help! :<","solutions":["Hi Keanu Open your Downloads folder Double click the view Ribbon (tab) so it stays open On the View Tab, click Group By and set that to 'None' That should return the view you prefer to the Downloads folder . . . ."]},{"symptom":"Beep        Hi All. A while ago a message came up on windows asking if I wanted a beep just before the os loaded. I clicked yes but now I can't find how to disable it. Can anyone help please.","solutions":["Hi Skeggy If that beep happens before your OS loads, then that setting must be in BIOS, it cannot be a Windows SettingWhat is the Make and exact Model no. of your PC - that will be printed on a sticker on the bottom casing of your PC . . ."]},{"symptom":"windows        any way to get a free version of windows greater than 7 ?","solutions":["It depends on the hardware requirements of later operating systems and also whether the computer\/laptop manufacturer supports and supplies drivers for the later operating systems as to whether it is possible or feasible to upgrade or not.Windows 8 is no longer supported.@@@@@@@@@@@@@@@@@@@@@@@@Follow these steps before you buy  Windows 8.1; extended support ends January 10, 2023 .Check to see if your Computer\/Laptop Manufacturer has Windows 8.1 Drivers available for your Model.If not available, Windows 8.1 will not install and work correctly for you.\"Windows 8.1 system requirements\"http:\/\/windows.microsoft.com\/en-us\/windows-8\/system-requirementsWindows 8\/8.1 does not come for free; you have to buy itMicrosoft no longer sells 8\/8.1.Try amazon.com, etc.Warning:You do not buy a Product Key by itself, as they are normally stolen\/pirated, Volume Licenses which are not for private use, or MSDN keys which are not to be sold by the original subscription holder.Make sure that you buy the complete sealed package (DVD, license)https:\/\/www.microsoft.com\/en-us\/howtotell\/Shop.aspxRead Section: Beware of Product Keys sold separately.@@@@@@@@@@@@@@@@@@@@@@@You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700"]},{"symptom":"Fire-wire audio device not working correctly after Win 10 updates 1903 and 1909        Our Fire-wire audio device does not respond correctly when changing Sampling rates or Buffer sizes making our hardware inoperative.These issues appeared directly after the 1903 win 10 update and continues also on 1909 Win 10 update.Before these updates all worked normally.Is there a bug on these updates, or has Microsoft changed the way that fire-wire audio devices work?Multiple PC's brands has been tested with our audio hardware resulting to the same problem.Our drivers for the audio device in use are signed under the name TC Group A\/S.Looking forward for a reply.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as the FireWire audio device not working correctly in Windows 10 1903 and 1909. As per this blog, any device which is upgraded to a newer OS version in the future will be required to reinstall this standalone driver package. We would suggest you to create a system restore point and then uninstall theFireWire audio driver device manager and then reinstall them. For additional information, please refer this article which holds good for Windows 10:FireWire port-based device does not work correctly If the PC’s are connected in a domain network then we would suggest you to post your queryin TechNet forums, where we have experts and support professionals who are well equipped with the knowledge on Domain user to assist you with the appropriate troubleshooting steps. Regards, Aditya RoyMicrosoft Community – Moderator","Hi,Thank you for writing to Microsoft Community Forums.We understand your concern as the FireWire audio device not working correctly in Windows 10 1903 and 1909.As per this blog, any device which is upgraded to a newer OS version in the future will be required to reinstall this standalone driver package.We would suggest you to create a system restore point and then uninstall theFireWire audio driver device manager and then reinstall them.For additional information, please refer this article which holds good for Windows 10:FireWire port-based device does not work correctlyIf the PC’s are connected in a domain network then we would suggest you to post your queryin TechNet forums, where we have experts and support professionals who are well equipped with the knowledge on Domain user to assist you with the appropriate troubleshooting steps.Regards,Aditya RoyMicrosoft Community – ModeratorHi and happy new year.Thanks for your answer.Unfortunately the advice given did not work for our system, even with Legacy drivers, our audio fire-wire device behaves exactly the same.I will point out once more that our issue started when 1903 and 1908 Win10 updates occurred, this mean that we were working correctlywith Windows 10 up to then. This mean that our special drivers for Win 10 (which we have) stopped working after these updates.Please can you check out if this is a bug from your side or any other major drivers\/software change that Microsoft applied on fire-wire audio devices during these updates?Also is there an other channel except the open forum that we can communicate to solve this issue with out going public?Looking forward for your reply"]}]}