{"windows":[{"symptom":"Can't preview jpg files in the preview pane -- Windows 10 Fall Update (1709)        Split from this thread.I have this issue and it started with the Windows 10 Fall update (1709).  jpg files are not displayed in the preview pane but other files are displayed (pdf, docx, xlxs, etc.).  I've tried setting the default jpg program to several different programs to no avail.  Prior to the 1709 update, jpg files were displayed in the File Explorer preview pane.  It seems to be an issue with the 1709 update.","solutions":["Noticed the same problem since 1709. The option to show icons is NOT checked and never has been, although I look there every few days just in case. The preview pane is empty white for most JPEGs, but not all. No discernable difference in the files. What's more, since 1709, most JPEGs don't even show their thumbnails, just a generic white-and-blue icon. Again, not every JPEG, but most. To make the thumbnails appear, I have to open a photo by double-clicking (opens in Photos). But even then the thumbnail only survives a while. It's back to generic icons tomorrow.  Initially I blamed it on my user account, so I went through the laborious process of starting with a new user account, but the problem remains. ","Check which application is associated with JPG files. Right click on a JPG file, select \"open with\" menu option, then \"Choose Another App\" from the child menu which appears. Ensure you are using the \"Photos\" application. I suspect you have installed another graphics package such as paint.net and it has taken over the file assocation.Problem is that Explorer need to get that application to render the image for display in the preview window, and if it cannot do so the preview window will remain blank.","My problem is not related to file association, I've tried changing file association to multiple programs, including MS Paint.  To clarify, my problem is with jpg files not displaying in the File Explorer preview pane and has nothing to do with file icons.I've discovered the problem is related to the new 1709 update feature \"OneDrive Files On-Demand\".  The problem with jpg files not displaying in the File Explorer preview pane only occurs for files that are on OneDrive with \"Files On-Demand\" enabled.  I have some files & folders specified as \"Always Keep on this device\" and I expect files to be displayed in preview -- and they are except for jpg files.  Other file types (pdf, txt, docx, xlsx, etc.) preview without issue.  jpg files on disk only and not on OneDrive ARE displayed in preview, the problem is only for jpg files on OneDrive, even though \"Always keep on this device\" is enabled.If \"Files On-Demand\" is enabled and \"Always keep on this device\" is not enabled (files are in the cloud only) then no files are previewed (makes sense).I have another computer that was just updated to 1709.  The \"Files on demand\" feature has not been enabled so all OneDrive files are on disk.  It displays jpg files on OneDrive in preview without issue.To summarize my problem as I see it...  jpg files on OneDrive are not displayed in File Explorer preview if and only if \"Files On-Demand\" is enabled, even though those files are kept on disk.","Interesting! When I posted yesterday, I believed the selection of Photos as the application to view had solved my issue. I subsequently found it had for a number of files - around 40%.I don't use OneDrive, and these were all fresh pictures I had just taken on iPhone and copied to PC.Another thread suggested changing file ending from uppercase JPG to lowercase jpg; and after I did this I was able to preview all images.What a muddle! ","I had this same problem in Windows 7, and after scouring the internet for hours (days) and pulling my hair out, finally noticed that it was only .JPG files in all CAPS, not lowercase.So I guess something changed in a Windows 7 update as well as Windows 10 (and I assume others?), because I have never seen this problem before and some of these JPGs haven't changed since the 90s.","I have the same problem.  I am a photographer so it slows me down.","Hi,Have you checked if you have the latest update for your Windows 10? Have you also encountered this after installing Fall Creators Update?What are the troubleshooting steps you've already done? If nothing yet, let's run the following scans to repair missing or corrupted system files:System File CheckerThe System File Checker or SFC is a utility in Windows that allows users to scan for corruptions in Windows system files and restore these corrupted files.DISM or System Update Readiness toolThe DISM or Deployment Image Servicing and Management can help you fix some Windows corruption errors as well.We'll be waiting for your response.Regards.","I've had this problem on all my computers.  It only happens on JPGs in OneDrive.  If they're on the computer, but not in OneDrive, they preview as they should.  Eventually, they started working in OneDrive on all 4 of my devices.  This device, I had to reset and since then, it reverted back to not showing previews of JPGs in OneDrive. I've unclicked \"save space and download files as I need them\" which seemed to work the last time, so I'll see if it works again this time or if something else made that happen, that I wasn't aware of.","Finally found the solution.Now that Windows 10 has nearly removed the old Control Panel; several items which are only available via the Control Panel are harder to find.Open the old Control Panel; type into the Win10 Search Field \"Control Panel\" and then click the result to Open it. Make sure the Categories option is set; then click on Appearance and Personalisation; then File Explorer Options.A new window will open -- click on the View tab.The first choice \"UNCHECK\" Always show icons, never thumbnails.- - - - - - - - - -I have now also found this same setting in the View Menu of Windows 10 File Explorer. At the far right-side of the header ribbon after clicking on the View Tab is an icon labelled Options.Clicking this -- select the first choice \"Change Folder and Search Options. A new window opens. Click on the View Tab; then again UNCHECK the first choice \"Always show icons, never thumbnails.\"","There is an easy solution for this. Copy (not cut) the images without preview and paste them back in the same folder. Now you will get the preview and can delete the originals."]},{"symptom":"Windows Malicious Software Removal Tool x64 - November 2019 (KB890830) -Error 0x800711c7        keep getting this message on windows update even after clicking retry several times,There were problems installing some updates, but we'll try again later.Windows Malicious Software Removal Tool x64 - November 2019 (KB890830) -Error 0x800711c7","solutions":["Hello! I am an Independent Advisor, I would love to help you out! I would suggest going through the guided walk through for fixing windows update errors. It is a great resource that will take you step by step in order to fix any issues with windows update.Here is the link: https:\/\/support.microsoft.com\/en-us\/help\/10164\/... I hope this helps!","Hello Elinor,Many have reported that manually downloading and installing MSRT sorted this.https:\/\/www.tenforums.com\/windows-10-news\/144301-kb890830-update-windows-malicious-software-removal-tool-5-77-nov-12-a.html","I tried the manual download approach - but my Surface laptop, on the Windows 10-S (Safe) setup, would not allow the manual download. It recommended going off the \"S\" setup, but that is an irreversible change I do not want. ","I tried the manual download approach - but my Surface laptop, on the Windows 10-S (Safe) setup, would not allow the manual download. It recommended going off the \"S\" setup, but that is an irreversible change I do not want. I am having the same experience on my Surface Go running Windows 10S.","If you like, you could reset Windows Update using the method below to clear the error.https:\/\/www.tenforums.com\/tutorials\/24742-reset-windows-update-windows-10-a.html","I am also having the same experience on my Acer Aspire A515-43. Windows 10-S setup on my 64-bit laptop..Windows Malicious Software Removal Tool x64 - November 2019 (KB890830) - Error 0x800711c7Also, Windows is recognizing a peripheral scanner (from Brother) as a storage and won't install the driver and can't locate on '+ new device'.I would download it from Brother website but Windows S won't allow it (also, there is no CD ROM drive on this laptop). ","Hi, have you solve this error? I am having the same issue"," I hid the update.   I hope the next one works.","How?   No error report?","Windows Malicious Software Removal Tool x64 - November 2019 (KB890830) -Error 0x800711c7    Thanks to all who replied to above question. I have taken note of all answers and will pass them on to my son, who is much more expert on computers than I am, on his next visit. Hopefully one of them will work."]},{"symptom":"my window10 updates not update automatically what i require to do action?        my window10 updates do not update automatically, whatI require to do an action.<Moderator Edit: Link removed from post>","solutions":["What version and build do you have currently. Type winver in Search and select the top result. Post a screenshot of the result or quote the version and build in full.If you are on a recent version then you will need to go to Settings > Update and security to download the updates when available."]},{"symptom":"I need help on how to activate my windows 10        My windows 10 pro has expired and it needs activation and I can't access the product key pleas assist..","solutions":["Hi Milton, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Do you believe the computer has an existing license? Get help with Windows 10 Activation errors: https:\/\/support.microsoft.com\/en-in\/help\/10738\/...https:\/\/support.microsoft.com\/en-in\/help\/12440\/...To better diagnose the issue, Please send us the results of both steps. 1. Right click Start>Command Prompt-Admin and type in the following command: slmgr.vbs \/dlv You will get a window, take a screenshot using snipping tool and paste it it next reply.2. Run the activation troubleshooter and send us the snip too. Using the Activation troubleshooter-Windows 10 https:\/\/support.microsoft.com\/en-in\/help\/20527\/...How to get a screenshot and post back: https:\/\/answers.microsoft.com\/en-us\/windows\/wik...Please let us know if you need any assistance in posting."]},{"symptom":"EPSON WF 7720 ALL OF A SUDDEN STOPED PRINTING COLOR        MY PRINTER STOPED PRINTER STOP PRINTING COLOR I CLEAN THE NOZZLES AND RAN A NUMBER OF NOZZLE CHICKS. I RAN A PURGE FILE NOW IT ONLY PRINTS BLACK  HELP I DID SEE IN EVENT PROPERTIES THATTHE PROGRAM CHROME VERSION 79.0.3945.88 STOPPED INTERACTING WITH WINDOWS AND WAS CLOSED .DETAIL:+System-Provider[ Name] Application Hang-EventID1002[ Qualifiers] 0Level2Task101Keywords0x80000000000000-TimeCreated[ SystemTime] 2020-01-11T15:11:41.000000000ZEventRecordID17248ChannelApplicationComputerMainPCSecurity-EventDatachrome.exe79.0.3945.881f8401d5c658fb95b05a4294967295C:\\Program Files (x86)\\Google\\Chrome\\Application\\chrome.exe9a9eb84e-3484-11ea-8273-ec0ec42017a454006F00700020006C006500760065006C002000770069006E0064006F0077002000690073002000690064006C00650000000000Binary data:In Words0000: 006F0054 00200070 0065006C 00650076 0010: 0020006C 00690077 0064006E 0077006F 0020: 00690020 00200073 00640069 0065006C 0030: 00000000 In Bytes0000: 54 00 6F 00 70 00 20 00 T.o.p. .0008: 6C 00 65 00 76 00 65 00 l.e.v.e.0010: 6C 00 20 00 77 00 69 00 l. .w.i.0018: 6E 00 64 00 6F 00 77 00 n.d.o.w.0020: 20 00 69 00 73 00 20 00 .i.s. .0028: 69 00 64 00 6C 00 65 00 i.d.l.e.0030: 00 00 00 00 ....","solutions":[]},{"symptom":"camera isnt working in Windows 10        What App do I use for my WebCam to work in Windows 10?I've tried updating the drivers and resetting it and can't get it to come on.","solutions":["Hello! I am an Independent Advisor, I would love to help you out! What is the make and model of your computer? What are you trying to use to view the webcam? Have you downloaded all the latest drivers for your laptop from the manufacturer website?","The app to use is Camera.","when I try to transfer my photos from my camera they don't go I have my usb cord connected.","I still get message telling me they can't find camer."]},{"symptom":"my window 10 will not update anymore        window 10 will not update due to the system reserved partition, how can this be fixed?","solutions":["Hi Robert,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Support has a good article on how to fix it. “We couldn’t update system reserved partition” error installing Windows 10https:\/\/support.microsoft.com\/en-in\/help\/308624..."]},{"symptom":"OneDrive won't sign in        I am running Windows 10 on an HP laptop. The last couple of days OneDrive continually says \"Signing In\" but never gets signed in. It has been fine prior to this. What do I do to correct the problem?","solutions":["Hi, I'm Diego Rios, an Independent Advisor willing to help other Microsoft customers.Please, clear your browsers from cache, temporary files, cookies, etc, Then verified that you place the right credentials and log in to your account. Then follow the procedures in the link below:1. Exit OneDrive (right click in the system tray) 2. Go to Control Panel > User Accounts > Credential Manager 3. Click on \"Windows Credentials\" (on the right) 4. Choose the down arrow to the right of \"OneDrive Cached Credential\" 5. Choose Edit, and enter your OneDrive (Microsoft Account) Username\/Password. 6. Go to the start menu, and launch \"OneDrive\" again This may restore your OneDrive without resetting your local copy. Alternatively, simply remove the \"OneDrive Cached Credential\" (there is an option to do so) and let OneDrive start over. The positive side is IF you wanted to move your OneDrive to another location, you'll have the opportunity to do so during the reset. Either way, you will NOT lose your online data. Please let me know if this helped and works. Best Regards, Diego R."]},{"symptom":"Install Touchpad Driver        Hello.I recently got my Lenovo Yoga2 11 back and had issues with the touchscreen and touchpad. I was able to update\/add the correct driver for the touchscreen, but can't resolve the touchpad. Specifically, my touchpad moves and clicks, but does not drag\/highlight. I disabled\/enabled and uninstalled\/installed the driver, but issue remained. I then went to the Lenovo website and downloaded the Elan\/Synapatics driver option. ***The issue is that when I go to Device Manager - Human Interface Devices.... there is no touchpad driver to activate\/install\/update. I can see the file on the C drive, but can't figure out how to \"activate\". Any tips would be great. Thanks.","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? Is the touchpad listed under device manager>Mouse\/Mice?","I am running a 1909. Under mouse is just \"ELAN pointing device\". Previously, there was touchpad and touchscreen, but after uninstalling touchpad I can't seem to get it to reaper. ","That should be the touchpad. Did you have a synaptics\/Elan tab under Mouse settings but it’s no longer there? You may require this to configure the touchpad with 1909: https:\/\/www.microsoft.com\/en-gb\/p\/elan-touchpad...I’ll check for further solutions.","This package installs the software (Touchpad driver) to enable thefollowing device. Lenovo pointing device***Above is the touchpad driver I was trying to install, but the ending states \"lenovo pointing device\". so is this a touch pad or is this a secondary component that makes the touch pad pointer more accurate?What I am seeing. As previously stated, no touchpad listed under device manager. So under settings I clicked touchpad, then additional options. When the pop up occurs it says mouse properties at the top and the icon bar, on the bottom of the screen, shows a mouse. The same tabs\/information applies when I click \"additional settings\" under mouse. So it is like I completed erased the touch pad and mouse settings filled in. ","I’ll look into further solutions & put that one on the back burner.","You say you recently got the device back - from where?If it has been in a repair shop then the technician may not have reconnected the wires for the touchpad correctly or dislodged them.","Also see this thread: https:\/\/forums.lenovo.com\/t5\/Lenovo-Yoga-Series...and look for ackerber‘s reply to see if this helps.","Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Please do not download any repair tool which is offered by this site other than the ones I mention\/recommend..Thoroughly research any product which is mentioned here before you decide to download and install it.","Did the link give you any help?","Thanks for yhe help but it did not resolve the issue. As previously stated, i iupdated the driver to touch\/mive the screen. This plus plugging in a mouse basically allows me to click\/drag and right click options. Will do for now. Thank you for all your help."]},{"symptom":"I get a blank blue screen        When i turn on my laptop, and click sign in, i only get a blank blue screen. No desk top .","solutions":["it must be after you wake up the system after sleep. When you get this blank blue screen press Esc button multiple times or ctrl + alt + del  then you will definitely get the logon screen. ","Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,I'd recommend creating a new user profile, to do this 1. Press and hold the control, shift, and escape key to pull up the task manager 2. Click on file and choose to create a new task 3. Under create a new task type in netplwiz 4. Once the user account window opens click on Add 5. Choose to sign in without a Microsoft account 6. Fill up the form and choose finish\/done 7. Highlight the newly created user account from the user account\/netplwiz window8. Hit properties and set it as an administrator 7. Sign in the account and see if the same behavior occurs. If the same issue occurs, I'd recommend performing a system restore 1. Press and hold the control, shift, and escape key to pull up the task manager 2. Click on file and choose to create a new task 3. Under create a new task type in rstrui 4. Follow the prompts and choose the recent restore point and process the system restoreIf you are not able to open up the task manager, I'd recommend performing a system restore through the windows recovery environmentYou may access the page by going to the sign in screen press and hold the shift key and press the on screen power button to choose the restart. It will then reboot and direct you to the windows recovery environment.Another alternative is, Start your computer, once the computer goes to the windows logo screen press and hold the power button for 5-10 seconds to shut it down completely. Do this for 3-5 times to force access the recovery environment.a) System Restore Go to Troubleshoot, advanced option, system restore (This would roll back the system's configuration to a specific time and date)Let me know how it goes. :)"]},{"symptom":"data usage windows 10        i was using cable internet from a long time then i wanted to switch to wireless internet but wireless internet in our country (pakistan) have limited data limit like 25gb per month (with lower price) or 50GB (higher price per month) but i did not know whats my actual data usage per month of internet and i asked the cable provider , they did not have usage statistics as well for the users so i discovered an option in windows 10 > start menu > right click > setting > network and internet > data usage.it automatically saves the internet usage for last 30 days then i was able to find out my whats my actual usage for internet for last month and then i was able to pick the wireless device with a higher data limit .Thank you for this windows 10.","solutions":[]},{"symptom":"Recurring \"OneDrive cannot connect to Windows\" problem, need to restart system every time this happens        Hi,I've been facing this issue for months, and a long thread with Microsoft Support brought nothing but \"we have escalated this to the product team.\"Quite frequently (say at least once a week) I get the following error:\"Try again\" only brings the same message box after a few minutes.I'm aware of this article but the filter driveris up and running when I get the error:PS 7.0.0-preview.3 C:\/Users\/steph>get-content'C:\\Users\\steph\\OneDrive\\Documents\\PowerShell\\Modules\\Microsoft.PowerShell.GraphicalTools\\0.2.0\\PSGetModuleInfo.xml'get-content : The cloud file provider is not running. : 'C:\\Users\\steph\\OneDrive\\Documents\\PowerShell\\Modules\\Microsoft.PowerShell.GraphicalTools\\0.2.0\\PSGetModuleInfo.xml'At line:1 char:1+ get-content 'C:\\Users\\steph\\OneDrive\\Documents\\PowerShell\\Modules\\Mic ...+ ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~+ CategoryInfo          : ReadError: (C:\\Users\\steph\\OneD…PSGetModuleInfo.xml:String) [Get-Content], IOException       + FullyQualifiedErrorId : GetContentReaderIOError,Microsoft.PowerShell.Commands.GetContentCommandPS 7.0.0-preview.3 C:\/Users\/steph>sc.exe query cldflt                                                                                                                                                                                       SERVICE_NAME: cldflt        TYPE               : 2  FILE_SYSTEM_DRIVER        STATE              : 4  RUNNING                                (STOPPABLE, NOT_PAUSABLE, IGNORES_SHUTDOWN)        WIN32_EXIT_CODE    : 0  (0x0)        SERVICE_EXIT_CODE  : 0  (0x0)        CHECKPOINT         : 0x0        WAIT_HINT          : 0x0Restarting the system restores normal operation… until the next occurrence.This affects at least two of my systems, including a brand new Dell laptop I purchased less than 2 months ago.I've tried enabling the \"OneDrive Insider Preview updates\", to no avail.Is anyone from Microsoft listening? I know I'm not alone with this problem, and we desperately need a fix--having to restart your machine in the middle of a meeting or presentation is just not acceptable...","solutions":["same problem","I have EXACTLY the same issue you have, even including the steps you tried.No, nobody at Microsoft is paying attention, and this is so annoying.","I'm facing the same thing. Only reason I usually even need to reboot my computer, ever, is because OneDrive starts this infinite loop of \"can't connect to windows\" and then parades around victoriously when I reboot and it's like \"Wow we've connected to Windows again, how amazing!\".(like, why is this a thing? Why does it run a victory lap when rebooting is required to fix it? Windows architecture provides all the mechanisms that OneDrive would need to reset and restart any malfunctioning service and fix it without rebooting, but it thinks this is a \"success\", by me, the user, doing something that isn't even offered by the obnoxious error dialog? It doesn't offer a reboot option... just \"try again\" and \"kill everything\")Worst part about this is the dialog box - offering a confusing message (you ARE Windows, you come with Windows, how are you unable to connect to yourself?), and offering only a very destructive non-option as the way forward (I absolutely can not and will not download my full OneDrive to my machine!). No way to simply \"exit\".I already tried completely sanitizing OneDrive, all its configuration, all its registry entries, all its config files and any lingering detritus from my system, then reinstalling completely clean, and after finally getting Setup to cooperate, I'm still getting this error with the same frequency. (though at least it finally seems to have stopped re-downloading new copies of itself, that might be because I killed the OneDrive update task in Task Scheduler!)I think this software has become too complex for anyone at Microsoft to actually fix.edit: let's keep track of when this occurs, shall we?\"first\" time (probably the 5th actually) was when I posted this, 11\/30\/19.Now it just did it again, 12\/2\/19. Time for another reboot, yay.once again, 12\/5\/19. aNoThEr ReBoOt, so happy fun time :(again, 12\/9\/2019. REBOOT TIME AGAIN1\/7\/2020, it's back!(same story every single time - same dialog as OP posted pops up, I close all the projects and programs and files and LIFE that I've got open at the time, reboot, try and regain some of the now-lost context of things I had to close, and OneDrive triumphantly proclaims that it's \"connected to Windows\" again.)update: ... I haven't forgotten about this thread, but here it is 1\/2\/2020 and it hasn't happened since. Nice! But my OneDrive hasn't been updating - still version 19.192.0926.0012 last modified 11\/25\/2019. Maybe a Windows update did it...? Hmm.update: HA. HA. It's back. 1\/7\/2020. Of course I had to jinx it. I'll bet you anything, it's related to network connectivity issues, some inability to load a network resource while OneDrive is being asked for something from an app or process somewhere.","Same problem here... The problem occurs every two weeks or so...rebooting always helps, but that's very annoying.","same problem","I see that the reboot is not quickin practice with the reboot the kernel is reset ... I think","Same problem here. Has  been happening on and off for a few weeks.The only fix I've found  and  it is only temporary, is to uninstall OneDrive. Then reboot the computer and reinstall OneDrive. This gets me going for a while  until the problem  tries again. Having a SSD helps with this this constant reinstalling.Is this a problem with  specific models of computers? We have several computers in the house but it seems to only a problem with this one.Mine  is a Dell Insperon - i7 550U - 8 GB RAM - Samsung EVO 500 GB - Windows 10 (latest updates)We need a FIX!","I have the problem on a ThinkPad and an HP as well.  I found that doing what JUS (above) posted also helps me for a limited time, which is to reboot.  But, it will rear it's ugly head again within a day or two.I did have to uninstall and reinstall it once to get it to work, but hope I won't have to do that again.","Same problem for me.  Restarting the computer is the only fix I've found and the problem generally occurs again in a week or two.   Quite annoying.","What version of Windows and of the OneDrive client are you running?My systems are running Windows 10 version 1909 build 18363.535 and version 2019 (build 19.222.1110.0006) of the OneDrive client, and I haven't experienced this issue (that use to be very frequent) on any of them for the past couple of months at least."]},{"symptom":"Photos        Hi all, I've a bit of a headache! Not sure how it's happened but I have roughly 52,000 files which are photos in on folder, most of the files have no thumbnails and when selected they show no image, I need to sort the files so that the genuine photos group together and the none genuine files group together enabling me to select the none genuine ones and delete them? Is there a way to filter like thus in windows? If not I'm having to delete the bogus files on by one.... thanks ","solutions":["Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.I'm wondering if thumbnails are being generated for your photos. Please check two settings: 1. View > Options > Ensure that Always Show Icons, never thumbnails is unchecked.2. Right-Click an empty area of the folder, select Properties > Customise, ensure that Pictures is selected for Optimise this folder for.If thumbnials are generating well for you and isn't the issue, can you provide further description of the issue with a screenshot?Please let me know if I can help you further!","Hi thanks for your response I have checked the settings and they are fineI think the bogus files are duplicates of the genuine files, I just need a way of grouping them together so they're not scattered throughout the good  images I can then delete them ","Ok, I'm guessing they should have a different file extension. You can under \"Hide extensions for known file types\" in Folder Options, so you will see better. Try grouping by File Type.A note though, it might be a cache file created by a photo management or editing tool if you have, like Corel AfterShot."]},{"symptom":"task manager processes don't add up to total ram usage        windows 10 (64-bits) is using 3 GB ram out of 6 GB without any program open and the summation of each process's ram usage doesn't add up to 3 GB is this a normal thing?","solutions":["Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.It is pretty normal to have 3GB of memory utilized without any programs launched.Windows 10 64-bits needs 2GB at the minimum and if you have already installed some programs, the minimum used will definitely be more.https:\/\/www.microsoft.com\/en-us\/windows\/windows...The summation shouldn't be too different from the total memory in use. So unless it is more than 200MB of difference, I would think it's normal.Please let me know if I can help you further!"]},{"symptom":"I cant find PalmCheck        So Im trying to use my Keyboard and touchpad at the same time and it doesn't work. Ive tried looking for the PalmChecker that's supposed to be below sensitivity in the settings panel. The thing is Palmchecker isn't there at all and ive tried turning the sensitivity down and I still cant use both things at the same time. Im not sure what to do, please help.Edit: I think I may have figured it out! If you hold down a letter key and then tap the space bar a few times you can begin to move your cursor","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? Thank you for keeping us updated with your problem. What make & model is the PC? Does the touchpad settings show under the old control panel>Mouse or under the newer settings app?Open Settings > Devices > Mouse. In the right pane, click Advanced mouse options. Under Mouse Properties, click Device Settings. Under Devices, click Settings. Look for Pointing and click the + sign to expand it. In the menu that opens, click the + sign beside Sensitivity, then click Palmcheck.https:\/\/answers.microsoft.com\/en-us\/windows\/for...Is the driver up to date? More here: https:\/\/www.howto-connect.com\/enable-disable-pa...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Please do not download any repair tool which is offered by this site other than the ones I mention\/recommend..Thoroughly research any product which is mentioned here before you decide to download and install it.","Do you require any further help?"]},{"symptom":"Hello I hope to find a solution for this problem.        My brother's laptop is broken and I am trying to fix it.HP TouchSmart TM2-2050USThere are NO CD \/ DVD drives in this laptop \/ netbook \/ notebook, whatever it is called. It has USB, HDMI, etc., but it has no disk drive.The computer will not be restored because there are no restore points, he says. It will not repair either. I can access the start menu by pressing the ESC key. From there, I'm not sure where to go or what to do. I was previously able to access the System Recovery screen (system recovery, system repair, command prompt, etc.) but now I have trouble even getting to that.Any help is appreciated.Thanks in advance!","solutions":["Hi, Eugeneconvery25 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Appearance        How do I change the order in which my email accounts appear?","solutions":["Hi ,CoZoMSN my name is Dennis, I'm an independent advisor and I'll do my best to help today. here how to change the order of the accounts https:\/\/www.lifewire.com\/change-account-order-o...hope this help you. Regards, Dennis. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I just had the same problem.  What I did was delete all the mail accounts from windows 10 mail. Then I added  the mail accounts back again realizing that each new account added goes to the bottom of the list."]},{"symptom":"HP Laptop - Windows 10 - Settings options for touchpad missing        Settings for my touchpad are awfully limited.  On the previous laptop that I owned there was an extensive menu for enabling and disabling touchpad gestures.  A search on this Windows Support forum yeilded a topic that directed you on how to update drivers within the Device Manager settings menu.  I updated the drivers and restarted my laptop and below is a print screen of my settings following the driver update.  As you can see there really isn't much of use there.  When I click the link on the right \"Additional settings\" the traditional Mouse Properties window appears but within that window no settings for the touchpad.  I searched this board once again but turned up empty handed.  Is there a download to patch the missing menu items or perhaps a code that will bring them back through Registry Editor?  Thank you for your help in advance.Here's a print screen of the drivers as they appear in Device Manager.Synaptics SMBus TouchPadAs I already said, I updated the drivers here and restarted the laptop.  No settings change.Here is an image I found on a search of what a correct settings for touchpad looks like.","solutions":["To the right there are Additional settings did you click on Hardware and see what was there under Touchpad?And did you try Learn other gestures?","Learn other gestures simply takes you to an internet search information dump.","Unfortunate that I didn't get a useful response here because the touchpad settings are still incorrect.","Solution found!I already checked the Start Menu previous to updating my drivers as directed through an article about synaptics touchpad but it didn't dawn on me to double check after the drivers were updated.  So, it appears that updating the drivers brought the Synaptics Touchpad menu item back to the Start Menu and it looks like this.When you open the Synaptics TouchPad start menu item you get a classic styled window with a full list of customizing options for touchpad gestures.  You can press the Settings button and get your full options there.  Also on this window is a link to the manufacturer's webpage.My tought is that the reason Synaptics Touchpad settings aren't available in the main Windows 10 system settings has something to do with copyright and software licensing and ownership issues.I figured this out on my own and outlined what I did so if this helps someone else down the road then good."]},{"symptom":"Remove Addresses From the Auto-Complete List Windows 10 mail app        How do I remove an address in the autocomplete list in the Windows 10 mail app?  I have a name that appears in the autocomplete list that I don't see in my Peoples app; thus I'm not able to delete the name by going to the Peoples app.  The suggested autocomplete address was merely misspelled by someone thus I NEED to remove it from the autocomplete list. Thank you.***Post moved by the moderator to the appropriate forum category.***","solutions":["Along with many others, I have been fighting this vexing problem. Here's what finally did the trick for me, based on piecing tips together from others.1) EXHAUSTIVELY search all your e-mail folders - ALL OF THEM, TRASH, SPAM, INBOX, ARCHIVES,everything - for e-mails that contain the bad address.  Remember that if the bad address was one of several in a message, even if it bounced the address is still part of that message. And it might be in a reply that was sent to you.2) Delete EVERY LAST ONE of the messages with the bad address. The ENTIRE message. If it's something you really need to keep, copy-and-paste the contents into a NEW message and send it to yourself. DO NOT JUST FORWARD THE MESSAGE to yourself or elsewhere - the bad address will still get dragged along with it. Make sure you do not copy headers - body text ONLY.3) Double- and triple-check what you did in steps 1 & 2 so you're not wasting time because you missed one.4) Log in to outlook.live.com and delete all of your contacts there. I am not sure this step is really necessary, but it was included in one of the other sources I used and it's not going to hurt to do it even if it's not necessary.5) On Windows, do Settings|Apps|Mail|Advanced Options|Reset. 6) On Windows, do Settings|Apps|People|Advanced Options|Reset.7) Restart your computer.After doing all this, I found that the bad e-mail address was GONE. So were a number of others, which I presume had been in my e-mail folders at some time but which had no traces left by this time (i.e., a bad address in one or two messages that had long since been permanently deleted.)It appears that Windows Mail is populating the Auto-Complete cache using ALL e-mail addresses that are present in ALL of your messages in ALL of your folders. So if you eliminate every possible trace of it and reset the Mail app, it has to rebuild the Auto-Complete cache and doesn't have any instances of the bad address to pull in."]},{"symptom":"Microsoft Visual C++ Runtime Library error message        When I open the program FiveM it updates than I got this messageMicrosoft Visual C++ Runtime Library assertion failedline:103expression: res <=1I dont know what to do please reply as soon as you can I appreciate it","solutions":["Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.1. Please ensure you have the latest Visual C++ Redistributable installed: https:\/\/support.microsoft.com\/help\/2977003 2. I assumed you are referring to this FiveM: https:\/\/fivem.net\/ The error message you received could be a programmatic bug. For better support of your issue, please create a technical support post on their forum:https:\/\/forum.cfx.re\/c\/technical-support\/27Please let me know if I can help you further! Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]}]}