{"windows":[{"symptom":"Windows 1909 start menu issue. Please help.        I recently got a new computer. I set it up, and got it updated to the newest version. I know that one of the new features is the start menu auto expand when you hover over the left side. However, I can't get my start menu to do that. I like that feature. I know its a small issue but I like the convenience of it and I can't figure out how to enable it. Anyone else have a similar issue? Any fixes. I have already reset my laptop twice and made sure it was updated but I want to have all the features of the 1909 update.  I have ran troubleshooting and command console. Please help out. Thanks.","solutions":["I gave you the steps that will lead to fixing this. If you have questions on how to perform any steps just ask back. Please do not skip any steps. We often find out later that the fix was the skipped step. If you need help performing any step I will help.The most basic thing we need to learn to maintain a PC is how to keep the latest manufacturer's drivers current. Windows Update drivers are never enough. I wrote these steps out for you once, but I will repeat them in hopes you'll understand the process better.Go to the PC maker's Support Downloads web page for your exact model or Dell Service tag on sticker, download and install the latest Display driver for your display device, comparing it with the one presently showing in the Device Manager reached by right clicking the Start button. While there check that you also have the latest chipset, BIOS, network, bluetooth, USB and all other drivers, compared to the ones presently installed in Device Manager reached by right clicking the Start button.Take your time, these drivers are absolutely critical to the PC functioning properly.If the Display driver doesn't fix the missing feature then I would run the Repair Install by installing the Media Creation Tool from this linkhttp:\/\/windows.microsoft.com\/en-us\/windows-10\/m..., choosing Download Tool Now, install the tool, open it and choose Upgrade this PC Now. This will save your files and apps while bringing you up to the latest version by the most stable method. It will also bring all of your Updates current and solve most problems since it reinstalls Windows.Keep me posted on your progress as I will be here to help until the case is resolved."]},{"symptom":"\"Cortana & Search settings\" not showing up in windows search        I am trying to disable bing results when I search using the windows 10 search bar. Every article I have found saying how to do this says that I must search \"cortana\" in the search bar and click on the result that says \"Cortana & Search settings\". However, there is no result with that name when I do this search. How can I access \"Cortana & Search settings\" without going through windows search?","solutions":["Hi Rei. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.We cannot use any web search but Bing in the taskbar or Cortana Search. But you can disable it if you don't care about getting web search results. See here:https:\/\/www.howtogeek.com\/224159\/how-to-disable...Let me know if this is what you need. ______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thank you, doing that fixed it."]},{"symptom":"what is error code 80092004?        see above","solutions":["see above Are you receiving this whilst Updating is in progress ???If so when was your computer last updated ???There were some Critical Updates related to SHA-2 and the Service Stack Update ( SSU ) and if these were not installed the computer could no longer update and could produce this ERROR.Refer to the MS Link below.https:\/\/support.microsoft.com\/en-au\/help\/4472027\/2019-sha-2-code-signing-support-requirement-for-windows-and-wsusIf so i would suggest to turn updating to : never check for updates. The reason i suggest this is that Windows 7 is at its EOL ( end of life Jan 14, 2020 ).No further support for Windows 7.To continue to use Windows 7 :Run a quality Anti Virus and complement this with a quality Anti Malware product.Avoid going to dodgy sites.Don`t respond to any e-mail if you don`t know the sender.Be wary of doing Internet Banking and or transactions.As for the ERROR :From the WEB.If you get Windows Update error 0x80092004 on Windows 7 or Server 2008 R2. ... The error associated with the error code, CRYPT_E_NOT_FOUND, suggests that Windows Update rejects the updates because cryptographic values that the update packages contain are not found."]},{"symptom":"11111111 stops  computer        HI when I use my computer what ever I open is stopped by rose and rose of number 11111111111111111 I have scaned for any virrus  nune found.can you help Regards David","solutions":["Hi David. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.In what program does this happen? Unplug the keyboard to see if it continues. If not try another keyboard. See if you can System Restore to a point before the problem began following this guide:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... You can System Restore from Repair Mode if it will not work in Windows, following one of these paths:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"media player        how do I merge pictures and music so as the music is played and the pictures are shown","solutions":["Hi Bert Windows 10 has built-in functionality to do that . .. Open the Photos App, then at the top, click Create, that will open a new App, which can be used to merge Photos, Music, Video . . .","Thanks DaveM121 . I was able to create a new album and add extra photos and videos but could not see where I was able to add music."]},{"symptom":"One Drive        Hey TeamMy computer is logged in as a \"*** Email address is removed for privacy ***\" user so it defaults to the One Drive file for that user.  I've tried to add another account with a company email address such as \"***@companyname.com.au\" address but it tells me that it isn't a Microsoft account.I was able to log onto One Drive on this computer but now I can not even log int One Drive, I get the following error;\"Sorry, another account from your organization is already signed in on this computer\" Any help on how I can get the One Drive to be logged into the companyname email address as default?CheersRonnie","solutions":["Hi Ronnie. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See here ways to use your work and personal OneDrive together on the same PC: https:\/\/www.multcloud.com\/tutorials\/onedrive-an...https:\/\/support.office.com\/en-us\/article\/how-do...But using both work and personal accounts on the same PC can be confusing, so this article sorts it out to dispel the confusion;https:\/\/www.brucebnews.com\/2016\/06\/finding-your...https:\/\/www.onmsft.com\/how-to\/how-to-manage-per...Hopefully after reading through these you'll be clearer on your options and how to implement them. If not just ask back questions so I can help you further.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi GregI can't get it to work, I'm trying to open a document that I created and saved on one drive & I get the following errors;READ-ONLYUPLOAD FAILEDIt won't let me sign into One Drive as \"companyname\" user to amend the document :OI'm actually finding it all very overwhelming and confusing!Is it possible for me to transfer the documents on \"companyname\" one drive to the \"outlook\" one drive?","Yes, of course. You can download them from Onedrive.com or copy them from the OneDrive folder to another explorer folder. Then sign in with your personal account and copy them into it's OneDrive folder, or upload them to the personal Onedrive.com account.To sign out of Onedrive on the PC unlink it as shown here: https:\/\/www.tenforums.com\/tutorials\/36246-link-...Restart PC, open OneDrive from Start Menu, sign in with the other account. Let me know how it goes."]},{"symptom":"changing file icons        Hello, i was cleaning out a folder today (sims 4) and i accidently opened the package file in notepad and it changed all my files and icons to a notepad please how do i fix this? ive tried restoring to previous window settings but it never worked, heres a photo for referance, before the icon was just a white blank sheet now everything is a notepad please help! :( thank u","solutions":["Hi Scarlett. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See here how to unset or remove a file type association so there is none: https:\/\/answers.microsoft.com\/en-us\/windows\/for...See here how to set a file type association back to it's WIndows default: https:\/\/www.tenforums.com\/tutorials\/8703-restor...To change the file type association to another one go to Settings > Apps > Default Apps > Set default by file type.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Exclude a word in a Windows 10 File Manager search        The old file manager allowed for many conditions. One was if you were looking for a word, you could exclude other words. For instance, if I wanted to search for 'Flower' but I did not want any results that had 'Daisy' in it, I would put 'Daisy' as an exception and the results would show everything else with 'Flower' except 'Daisy'.Can I identify exclusions in a Windows 10 File Manager search?","solutions":["Hi Linda. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.This is the best article I've found on delimiting searches to get exactly what you want in File Explorer:https:\/\/helpdeskgeek.com\/windows-10\/find-specif...If you want to go even more Advanced then this tutorial will take you further: https:\/\/www.howtogeek.com\/school\/learning-windo...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Use the NOT Boolean operator. It must be all caps.content:Flower NOT DaisyorName:Flower NOT DaisyFor sucessful searching of file contents, the dontents must be indexed:Keith"]},{"symptom":"headphones not working        I get no sound when I plug in headphones","solutions":["I get no sound when I plug in headphones Laptop or Desktop ???What port are you plugging it into ( rear or front ) and are the headphones USB or 3.5mm Mini Jack ???In Desktops depending on the age of the Motherboard and the Cases front wiring the front inputs may not work as they may not be wired up or un-switched.If it is a desktop try the rear GREEN PORT and see if they work.If its a Laptop.Go to the Start Orb.Type in : sound settings and press the enter Key.You should see the below.You may have your Playback settings incorrectly configured."]},{"symptom":"Associating applications with file types        I have two applications that will open a particular file type- an older and a newer application.   Files tend to open with the older, less useful application; to get the newer app with the better functionality I need to Right-click the file and select \"Open With\" from the drop down.   I would like to change the default app used to open this file type to the newer, better application.  How do I do this?  Thanks! ","solutions":["Go Settings, Apps, Default apps. at the bottom, Choose default app by file type.","Hey Hank. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Go into Settings > Apps > Default Apps > Choose Default by File type, scroll down to file type and choose the app.If it's not present then check Choose Default by App. To restore default file associations see this tutorial which has scripts to run for every file type to set it back to it's WIndows default association:https:\/\/www.tenforums.com\/tutorials\/8703-restor...To unset or set association to none see here: https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"unable to restore hp 17 laptop        after an update, my HP 17 will not let me access c drive it shows nothing used, nothing unused. will not let me download hp cloud recovery media. everytime I try to download the app it says I do not have internet access. so bottom line, I cannot restore my laptop to factory settings","solutions":["Hi Darrell. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Here are steps to recover from failed Updates or Version Update install which causes Windows to fail to start or function. If any steps won't work then report back and move on to the next. At least one step will always work, leading up to if necessary doing an automated Reset or a gold standard Clean Install: 1) Try whichever method works in this tutorial link to get into Advanced Startup Options to run System Restore or Uninstall Updates button, or if this is a version update Go Back to Old Version:https:\/\/www.tenforums.com\/tutorials\/2294-advanc.... Easiest is to restart or force shutdown the PC 3 times to force it into Repair Mode.If you are able to access System Restore or Go Back and it fails, skip to step 3.2) If necessary borrow another PC and follow the steps in the middle of this download page to create bootable installation media to access the repair options if not accessible by any other method:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... The bootable media is also the only method that doesn't require the password if you're stuck on that.Boot media by powering up the PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... You may need to enter BIOS\/UEFI Setup to turn off Fast Boot if it won't allow the Boot Menu key to interrupt starting Windows:https:\/\/www.mydigitallife.net\/comprehensive-lis... Choose UEFI version of media if offered, browse to second screen to Repair Your Computer link.3) Choose Advanced Troubleshoot options to run System Restore, or if this was a version Update choose More Options to Go Back to Old Version.If it rolls back then you can hide the Windows Updates and Version Upgrade responsible until they mature by installing and running immediately the Hide Updates tool:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... There is a new option after Version 1809 to roll back Windows Updates from the Repair Mode in Option Four here:https:\/\/www.tenforums.com\/tutorials\/5486-uninst... If this fails try a Startup Repair, or go back to Troubleshoot Options on the previous screen to Reset your PC which will save your files while reinstalling Windows.4) If that fails you can use the booted media created in Step 2 to Clean Install the latest version which should get you past all difficulties as it has hundreds of thousands of others who have followed the steps in this link and never come back to report another problem: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... The link compiles the best possible install of Windows 10 that will stay that way as long as you stick with the tools and methods given.There is a step to rescue files from the same bootable media: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Make sure during the booted install to follow the illustrated steps to delete all partitions down to Unallocated Space to get it cleanest, then click Next to let it auto-create the needed partitions, format them and begin install - this makes it foolproof.The media provided for the Clean Install is latest and normally the problems go away with the Clean Install, however if they don't you can find earlier version media to use here:https:\/\/tb.rg-adguard.net\/public.phpBurn to DVD or create bootable 8+gb flash stick installer using this tool installed to Windows:https:\/\/www.microsoft.com\/en-us\/download\/detail... Then once you're back in Windows 10, you can block the problem Update using one of these methods:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...For Version Updates the most stable method to install is using the media as shown in these steps for overcoming Version Upgrade problems:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Good news, Microsoft is giving back to users more control over Updates as announced recently here:https:\/\/blogs.windows.com\/windowsexperience\/201... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"I can't add any more Windows Hello sign-in options        I have an XPS 13 9380 that I got for Christmas recently. I was setting up my computer and I added both the Pin and a fingerprint. But, when I went back today to add all fingerprints on all hands, the face scanner, the fingerprint, and the pin said \"This option is currently unavailable.\" So I can't setup the face scanner or add or remove my fingerprint. The Pin I can remove and I did that. So, when turned off my computer I inputted my password, it had me create a new pin, and create a new fingerprint sign-in option then i resumed right where I was when i turned it off. The same message was still there for all them. I tried updating my computer and going to the files, but I didn't do anything to them. I went into the Device manager and it said everything was working properly. And, this is a personal computer so there is no interference from an organization or something.Help me, please! This is so annoying and bugs me that something is wrong with my computer, but I can't figure out what it is.Thanks!","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please create a local Administrator account (temporarily), log in to this local account and check if you can add the fingerprint ID and face ID as Sign-In option.","Yes, the local account was able to add many more fingerprints besides the first. The Hello Face won't work because apparently the XPS 13 9380 is enabled with the capabilities. So what should I do going forward?Thank you so much for your help and your reply, btw.","Alright, so it means there is some error with your Account.I would suggest you to Back up your files and delete the affected account. Then Add the same account again.","Thank you this worked, much appreciated. I have an inkling that it was because I installed Spotify on here and it is buggy garbage on pc. Even if it wasn't I'm happy that I download on here and I think I'm gonna keep only on phone and console.Thank you, again!"]},{"symptom":"Bug Check 0x124: WHEA_UNCORRECTABLE_ERROR        Hello,I recently did a fresh install of windows 10 home 64-bit and updated all my drivers. I've been getting error #132 fatal exceptions while playing world of warcraft seemingly randomly. I've had 47 in the last 30 days. Their tech support was unable to assist and after their recommendations, suggested I reach out to microsoft to read CBS logs for the blue screen crash dumps. I don't know what you need from me to do so.Here's a link to the forum post that contains a dxdiag and the errors.This is what Blizzard support suggested:Thanks for the DXDIAG. It looks like you are are experiencing at least 1 major bluescreen pointing to your CPU. So there is some sort of system instability issue you will want to figure out. This is outside of our scope of support, but we do have some recommendations listed here. If you still have issues after this, you will need to reach out to Microsoft to read the CBS logs for the Bluescreen crash dumps, or contact a local technician to take a look at what is happening.Thank you.","solutions":["Hi, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.We need log files(called dump files) that tell us what lead to crash. Please share them with us for a better analysis of the problem. Instructions can be found here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Please let us know if you need any assistance about posting dump files.","Thank you. Here's a link to both files on onedrive.","Thanks Mike. Apparently they are correct in a sense as the BSOD indicates an issue with the processor. Please run the Prime95 test and tell us the results.https:\/\/www.tenforums.com\/tutorials\/16474-prime...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads."]},{"symptom":"windows crashing. looking for help        Log Name:      SystemSource:        Microsoft-Windows-WER-SystemErrorReportingDate:          1\/5\/2020 8:51:20 PMEvent ID:      1001Task Category: NoneLevel:         ErrorKeywords:      ClassicUser:          N\/AComputer:     GAMING-PCDescription:The computer has rebooted from a bugcheck.  The bugcheck was: 0x00000050 (0xffffa40cdc6b61b9, 0x0000000000000002, 0xfffff8037394e48c, 0x0000000000000002). A dump was saved in: C:\\WINDOWS\\MEMORY.DMP. Report Id: ea3d9904-101c-4aa3-acba-827e7f0011c1.Event Xml:<Event xmlns=\"http:\/\/schemas.microsoft.com\/win\/2004\/08\/events\/event\">  <System>    <Provider Name=\"Microsoft-Windows-WER-SystemErrorReporting\" Guid=\"{ABCE23E7-DE45-4366-8631-84FA6C525952}\" EventSourceName=\"BugCheck\" \/>    <EventID Qualifiers=\"16384\">1001<\/EventID>    <Version>0<\/Version>    <Level>2<\/Level>    <Task>0<\/Task>    <Opcode>0<\/Opcode>    <Keywords>0x80000000000000<\/Keywords>    <TimeCreated SystemTime=\"2020-01-06T01:51:20.603149200Z\" \/>    <EventRecordID>2589<\/EventRecordID>    <Correlation \/>    <Execution ProcessID=\"0\" ThreadID=\"0\" \/>    <Channel>System<\/Channel>    <Computer>THECOLDFINGERS-GAMING-PC<\/Computer>    <Security \/>  <\/System>  <EventData>    <Data Name=\"param1\">0x00000050 (0xffffa40cdc6b61b9, 0x0000000000000002, 0xfffff8037394e48c, 0x0000000000000002)<\/Data>    <Data Name=\"param2\">C:\\WINDOWS\\MEMORY.DMP<\/Data>    <Data Name=\"param3\">ea3d9904-101c-4aa3-acba-827e7f0011c1<\/Data>  <\/EventData><\/Event>","solutions":["Hi, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.We need log files(called dump files) that tell us what lead to crash. Please share them with us for a better analysis of the problem. Instructions can be found here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Please let us know if you need any assistance about posting dump files."]},{"symptom":"SYSTEM_SERVICE_EXCEPTION (3b)        I had the bright idea of opening a minidump to figure out why my computer is bluescreening and realized I have no clue how to read a minidump. So lo and behold I'm here hoping someone can decipher what my issue is. I haven't installed anything recently, infact, I wiped all my drives about a month ago and did a fresh windows install so I don't think it's any past software I've forgotten about. ","solutions":["Hi Quiibbz,I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.The information you posted does not give enough information unfortunately. Please share them so that we can help better.We need log files(called dump files) that tell us what lead to crash.Please share them with us for a better analysis of the problem. Instructions can be found here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Please let us know if you need any assistance about posting dump files.","Here is my SysInfo and all the dump files in my minidump folderMy PC just had a stroke and blue screened several times before I was even allowed to login so there may be another dump or two in there now. Onedrive also failed to upload one of the dump files because it said it was empty so there's that too.","Hi, There were a wide variety of bugchecks most commonly blaming memory corruption. Looks like a Memory test is required. I suggest you to Run memory test for at least 8 passes, preferably Overnight. https:\/\/www.tenforums.com\/tutorials\/14201-memte...When the test completes post back the Image(You can use your phone's camera). Disclaimer: There are links to non-Microsoft websites which would provide accurate and safe information. Watch out for ads on the sites which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","I ran the test for 9 passes and no errors came up, the picture is in the Onedrive file with my minidumps and sysinfoHad another System_Service_Exception blue screen trying to start windows for the first time after the test. Restarted to a screen saying windows couldn't start properly so that's cool.","Thank you for the test. Indeed memory is not the issue. The next step, Let us try finding any misbehaving driver Enable Driver Verifier: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...(Must create a Restore point before) Upload the newer dumps when you get Driver_Verifier_detected_voilation. Please note that the system might crash before you reach the desktop-if it does please let us know so that we can guide you to disable Verifier.Technical Info: EXCEPTION_CODE: (NTSTATUS) 0xc0000005 - The instruction at 0x%p referenced memory at 0x%p. The memory could not be %s.","I enabled Driver Verifier and it instantly crashes to bluescreen upon startup (I restarted several times in an attempt to access my computer but it kept bluescreening). It wasn't possible to get back into my computer without bluescreening so I used my restore point to get access to my computer again. Don't know if this means my dumps are updated or not but I added the latest minidumps in my folder to the OneDrive.None of the bluescreens showed what was causing the crash, it only ever showed the bluescreen errorUPDATE: Got BSoD error Critical_Process_Died. I can no longer access my computer. Did a clean install of windows to fix the problem. Guess this driver issue no longer applies since I did a clean install.","Yes, if it is a driver issue it would be resolved, If it happens again let us know.","It happened again after a fresh install of windows and a clean wipe of all drives. :(Im beginning to think my motherboard is the cause for this issue. Its the oldest component in my computer (2011 model).","Yes, it is likely a hardware problem. What is the average temperature of the computer while running?https:\/\/openhardwaremonitor.org\/downloads\/Also inspect the motherboard for any burnt capacitor or IC. Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","I inspected my motherboard and didn't find any evidence of burnt capacitors or IC.Here is what the openhardwaremonitor software is showing for my parts:Motherboard: -Temp#1: 42.0 C-Temp#2: 25.0 CCPU:-Temp: 34.5 CGPU:-Temp: 42.0 C2TB Hard Drive:-Temp: 27.0 C2TB SSD:-Temp: 27.0 CNote: these are the max temperatures of each part when standing idle at the home screen.Also is there a chance that there is some accidental overclocking\/underclocking that could be causing this? I have never overclocked but I'm thinking maybe some incompatibilities could cause unintentional overclocking\/underclocking."]},{"symptom":"Graphics        Can my Intel (R) HD Graphics support an upgrade install from windows 7 to windows 10?","solutions":["Check with Intel.@@@@@@@@@@@@@@@@@@@Also:@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@","Can my Intel (R) HD Graphics support an upgrade install from windows 7 to windows 10?As we don`t know what your Intel Graphics are check in the below link.https:\/\/downloadcenter.intel.com\/product\/80939\/Graphics-Drivers"]},{"symptom":"Window 10 will not dectect second monitor        My HP pc has been working fine and using a plug and play monitor by Dell using a VGA to hdmi cable. It was working fine this afternoon and then it stopped working. The PC will not dectect the second monitor. I have checked cables. I have searched issues thru this online community to no avail. There is no device drivers for this monitor.  Can someone help me?","solutions":["Did you try going through settings and telling it to detect? Sometimes not all devices automatically detect second monitors. ","That is the first thing I did.  I also upulled the cable from the pc and rebooted... I have tried all the simple things to try an fix this..... Windows 10 sux..... all these update fix and brake stuff....Windows 7 was way better than the constant it works\/ it doesnt work. ","I agree with windows7 being better. I'm kicking myself for not repairing my windows7. I figured since that laptop was 10 years old it wasn't worth fixing. I'm starting to think it would've been worth fixing. also you can try undoing the most recent update if the problems started after updating.","Hi, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Please see the below options: Option 1.Try Rolling back if you have an option: Go to Device Manager by typing in Devmgmt.msc in Run dialog box. Navigate to Display devices and right click ATI Radeon HD or Similar device you have. Choose Properties.On the Driver tab, hit rollback Driver to go back to the previous version. Option 2. Remove drivers completely and Install the the newest ones available from the OEM or the maker.What you need to do: 1. Uninstall everything of Display driver using DDU http:\/\/www.guru3d.com\/files-details\/display-dri...2. Reboot. 3. Make sure your device manager shows Microsoft Basic Display adapter. 4. Download the driver from the OEM or the maker like AMD 5.Run the Setup and you should be good to go. Disclaimer: Guru3d.com is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"2020! Edge icon missing, Start menu not functioning.        Click START =Search bar disappears for a momentI have tried all the \"fixes\" listed for the since 2015 no luck.powershellGet-AppXPackage -AllUsers |Where-Object {$_.InstallLocation -like \"*SystemApps*\"} | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Current error message below I have tried other options (FIX.BAT) from youtube which may explain this.","solutions":["Pity the screen shots didn't stick","Hi OblivionMC, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.As you have multiple issues try a reinstall. Try doing a repair install. A repair Install keeps everything including Files and applications and reinstalls Windows.http:\/\/www.yourwindowsguide.com\/2016\/06\/how-to-...http:\/\/www.tenforums.com\/tutorials\/16397-repair...The best and the easiest way is to use first method in the first article. Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"I messed up my Desktop and D drive files.        Ok so I was being really dumb and tried to store the files stored on my Desktop in my D drive but everything got all jumbled and I did not get the desired result. I have tried restoring the default location on my Desktop which is now stated to be my D drive, but I get an error stating \"failed to build the list of regular subdirectories under D:\/System Volume Information.\"If I could be helped asap I would much appreciate it, thanks.","solutions":["Hi GW. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Did you move the Desktop to D without creating a Desktop folder there first, so it mixed your desktop files in with all the D drive files? This is a common error. If it's a separate hard drive there is some risk of fatal startup errors when moving Desktop folder off of the same hard drive. But I'll help you correct it now before it's too late.Follow whichever option works here to restore the Default Desktop folder location here:https:\/\/www.tenforums.com\/tutorials\/23504-resto...DO NOT copy the files back if it prompts you in Option One to do this or it will copy all of the D drive files. Wait until after it moves the Desktop folder back to C, then manually copy the actual Desktop files from D to C.If Desktop cannot be moved from the Location tab Reset Default Location button, then Option Two tells how to recreate the shell User Desktop folder from scratch. This will always work, so there is no need to panic. Be patient and follow the instructions precisely.In the future when you move User shell folders off of C, be sure to create the same folder in the target location first, or when it asks you if you want it to do this for you.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"video  editor        i need a step by step or tutorial on how to use the video editor","solutions":["Hi Pamela. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See these good guides on using the Video editor built-into Photos app: https:\/\/www.howtogeek.com\/355524\/how-to-use-win...https:\/\/turbofuture.com\/graphic-design-video\/Fr...https:\/\/www.maketecheasier.com\/edit-videos-with...https:\/\/www.techrepublic.com\/article\/how-to-edi...If you need something more then these are good alternative video editors from Windows 10:https:\/\/www.windowscentral.com\/best-video-editi...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]}]}