{"windows":[{"symptom":"PC won't shutdown completely...        Hi there! I have a PC with Windows 10 and I decided to install the MacOS creating a dual boot on 2 separate SSDs. I have successfully installed the other OS but, in the end, I gave up on Apple. To delete their system I logged into windows, normal way, and used DiskPart to clean the disk and format it later which I succeeded on. However, whenever I shutdown the PC, in the usual manner, or try to restart it, either the computer freezes on shutdown screen either it turns off (Keyboard, mouse and monitor gets turned off too) but motherboard light and fans still keep running. Please Help me!  I do not know if formatting windows is going to solve anything but that is the last option i pretend to use.","solutions":["Hi Henrique, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.If you open a Command Prompt window, and type in: shutdown \/s \/f \/t 0 Does this shut down the PC completely or does it exhibit the same behavior? If so, you may want to try to disable the fast startup setting within Control Panel > System and Security > Power Options > Choose What the Power Button Does.Source: https:\/\/www.howtogeek.com\/349114\/shutting-down-... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","Have you done a hard shutdown?  Just hold down the power button until all turns off?  Then wait 5 minutes before turning on again.","So, I disabled fast startup but it did not solve the problem. I suppose it is some trouble with motherboard uefi since it does not depend much on the OS. The OS completely shuts down, or freezes, keyboard and mouse they turn off too. The only thing that keeps running are the coolers and the rgb lighting"]},{"symptom":"sp_flash_tool.exe        I am trying to flash my mobile.I have tried versions of sp_flash_tool.exe v3.1222. (unzipped)  to  sp_flash_tool.exe v5.1944. (unzipped)Search sp flash tool then select Androidmtk.com then go down the page to Win section, download a zip version, then unzip in explorer,  Find file sp_flash_tool.exe, the file icon should show a green android, mine does not, in shows what looks like a doc picture.If I double click a version, it says extract all or run and does not load the prog.If you double click the file with a green android, it will open the prog.Anybody got ideas as to why?","solutions":[]},{"symptom":"Windows 10 login        I am trying to remove my windows 10 password so I no longer have to type it in to get to my desktop. I have tried going through the steps listed with \"netplwiz\". Currently is my only option to reformat, and not add a microsoft account to the computer?","solutions":["Hi nine2three the thing to remember with a microsoft account is that the username is the full email address associated with the account.i am sure the method below is the same as you have tried, but please try following it to the letter and when asked for a username and password enter your email address in the username field and your microsoft account password in the password field.to prevent windows asking for a password on boot click start type netplwiz and press enter untick \"users must enter a username and password...\" click apply (if it is already unticked, tick the box and click apply then untick it again and click apply)you will be asked for a username and password (used to automatically log on). if you are using a Microsoft account enter the FULL email address. enter and verify your password and click ok next time you boot the computer it will automatically log on. NOTE - there is no need to switch to a local account, it WORKS perfectly well with a Microsoft account, as long as you enter the full email address in the username field.blank passwords are NOT a good idea. do not forget the password. to prevent it asking for a password when waking from sleep, go to settings -> accounts -> sign-in options under \"require sign-in\" select Never. hope that helps please let me know if it goes wrong, include details of any steps you missed."]},{"symptom":"Your device is missing important security and quality fixes.        Ever since I updated to Feature Update 1909, my Windows Update has been stating that \"Your device is missing important security and quality fixes.\" This message never goes away, despite checking for updates on a daily basis. I still receive my normal updates, such as Definition Updates for Windows Defender, yet the message never disappears. I am on OS build 18363.535 and do not have any pending updates.EDIT: I am able to update Windows just fine, but the incessant message does not disappear.If I uninstall Feature Update 1909, my Windows Update says that I am up-to-date, along with the message stating that \"Optional feature update 1909 is available\". If I choose to install it, I am back to where I started, \"Your device is missing important security and quality fixes.\" This means that this is an issue with 1909 only.On my other PC, also running 1909, it is not having this issue. It is acting normally and stating that it is \"up-to-date\".Please guide me on how I can fix this issue. It is annoying that it never says I am up-to-date, even though I am.","solutions":["Try running the windows update troubleshooter. Setting > Update and security and select Troubleshoot the windows update . Run through the process and restart using Start > Power > Restart no matter what the result.","Try running the windows update troubleshooter. Setting > Update and security and select Troubleshoot the windows update . Run through the process and restart using Start > Power > Restart no matter what the result.That did not work. I have tried that in the past. I am able to update Windows, it just always displays that message.","Okay, you'll have to wait for another response, but don't call the support number posted it's fake.","Okay, you'll have to wit for another response, but don't call the support number posted it's fake.I have already reported that reply. No Microsoft rep would post their number in a way that avoids filters","Hello Jamg#6969, thank you for providing this question. I am a seasoned Windows expert with almost a decade in usage and support experience and hope to resolve your problems quickly.The first step would be to try resetting Windows updates using an automatic script. See:https:\/\/gallery.technet.microsoft.com\/scriptcenter\/Reset-Windows-Update-Agent-d824badcAnother common fix for this problem would be to uninstall also other updates which got installed with 1909. It is likely that it is one of the updates which depends on 1909 which did not get installed properly causing the message to be displayed.Also you can try to change the telemetry level around in the Group Policy Editor as some Users report that this solved the problem for them.See: docs.microsoft.com\/windows\/privacy\/configure-windows-diagnostic-data-in-your-organizationIf you consider your problem solved it would be very good if you marked the answer which helped you so others can find and use this thread.If this didn't solve your problem or you need further assistance please answer in this thread and i would be happy to help.kind regards F. Grobusch Edit 18:43: Changed link to Windows Update script. Accidentally put the wrong link before.","Hello Jamg#6969, thank you for providing this question. I am a seasoned Windows expert with almost a decade in usage and support experience and hope to resolve your problems quickly.The first step would be to try resetting Windows updates using an automatic script. See:http:\/\/www.yourwindowsguide.com\/2015\/12\/windows...Another common fix for this problem would be to uninstall also other updates which got installed with 1909. It is likely that it is one of the updates which depends on 1909 which did not get installed properly causing the message to be displayed.Also you can try to change the telemetry level around in the Group Policy Editor as some Users report that this solved the problem for them.See: docs.microsoft.com\/windows\/privacy\/configure-windows-diagnostic-data-in-your-organizationIf you consider your problem solved it would be very good if you marked the answer which helped you so others can find and use this thread.If this didn't solve your problem or you need further assistance please answer in this thread and i would be happy to help.kind regards F. Grobusch Thank you for your reply. Your link to \"yourwindowsguide.com\" does not lead to anything useful, only this article: https:\/\/www.yourwindowsguide.com\/2016\/11\/windows-10-almost-the-same-windows-8-1-displaces-3rd-most-used-os-in-october.html","woopsis. I am sorry. I'll edit this out. The proper link is this one: https:\/\/gallery.technet.microsoft.com\/scriptcen...","woopsis. I am sorry. I'll edit this out. The proper link is this one: https:\/\/gallery.technet.microsoft.com\/scriptcen...That did not work. I ran the script, and then signed out of my computer. It is still displaying that message.","Did you try the Telemetry level fix? If that fails too then continue to uninstall all updates you initially installed with the 1909 update.It must be one of them being not properly installed.","Did you try the Telemetry level fix? If that fails too then continue to uninstall all updates you initially installed with the 1909 update.It must be one of them being not properly installed. I use Windows 10 Home, so I cant use gpedit. I will try uninstalling the updates."]},{"symptom":"where are my friends on microsoft solitare?        where are my friends on Microsoft solitare","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please reset the game and Sign in again and check. Go to Settings (PC Settings) Click on Apps Select Apps and Features Select Microsoft Solitaire Click Advanced Options Click Reset."]},{"symptom":"How do I save the \"Delete pictures from my device after import\"        Windows 10 Photos App has a \"Delete after Import\" Dialog Box\" prior to importing photos from a camera.Unfortunately if I select the box and import, the next Import will have the box blank again.There is no way to save that setting apparently.Can you help me?Thanks","solutions":[]},{"symptom":"i cant get access 'permission' for old drive my documents folder        Hi there hope i can recieve some assistance. i just took out the hard disk drive from an older laptop which had windows 7 on it, i put this into a exterior shell and have converted it to an external hard drive.i've managed to get access to the data but unfortunately there are some critical files in 'my documents' folder of the C: which was the system drive. after researching a bit online i have found some guidance, i've gone into properties - security tab- users etc.. i went pretty deep deep inside and i've initiated a process whereby windows is \"setting security information\" on the root user file which contains my documents. the process is running and it is taking considerable time as it is going to every file and changing permissions.the problem i am having is.1) while the process was running an error came saying that it cannot apply security permission settings on administrator (the existing systems administrator which is me is seizing control)  for my documents, my videos my pictures.more specifically 'an error occurred while applying security information to: Users\/MAS\/my documents.'what do i do now i'm not sure how to proceed? i've hit continue but what should i do to get access to my documents eventually. further there was no password on my older system of any sort, so i'm hoping i can get access. appreciate if someone could assist please, thanks.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please enable the built-in local Admin Account. Log in to this account. Run the process from this Admin Account. Enable the Built-in Admin Account: Type CMD in Start Menu, when it appears right click on it and select Run as Administrator.Enter the following command and hit Enter. net user administrator \/active:yes (Similarly, after completing process you can disable the account by using the command net user administrator \/active:no )","Arif thanks for contacting me back, is there anyway we can chat further? i dont understand the instructions maybe i'm doing something wrong.i need a little more detail?i'm still receiving the error below i did what you mentioned. i am logged into the administrator account already, i'm really not sure what to do i did exactly what you said through command prompt and it was successfully enabled according to CMD.","Please Restart the PC and you will see another Account in the Log in page. Sign in to the new Administrator account."]},{"symptom":"Xbox one dashboard buttons not working (PLEASE HELP!)        So, just the other day my xbox's dashboard tiles or buttons stopped working, (example: I go to click on Netflix and it pressed the tile, but made no sound and didn't open the app.) And trust me ive tried hard resetting my xbox, unplugging my xbox, turning it off and on normally, switching controllers, NOTHING HAS WORKED. I need help, I cant get into apps or games! please tell me if theres a way to fix this...","solutions":["Hi Jaeden,The icons on your dashboard may not respond if the console is not updated or the apps are corrupted. To resolve your concern, we suggest that you perform the following methods on your Xbox One:Method 1. Power cycle your Xbox One console.    You can reset, perform a full power cycle, or physically disconnect your Xbox One console to reboot it completely and fix many common issues. This process does not erase any of your games or data.    Turn off the Xbox One console by pressing the Xbox button on the front of the console for about 10 seconds until it shuts down completely.     Unplug the console's power cable. Wait 10 seconds. Be sure to wait 10 seconds. This step resets the power supply.     Plug the console power cable back in.    Press the Xbox button on your console to turn on the Xbox One.          Method 2. Clear the storage cache on the console.     Press the menu key on the controller.      Go to Settings, and then select Disc & Blu-Ray.      In the Blu-Ray section select Persistent Storage.      Select Clear persistent storage.         Method 3. Clear MAC address.    Scroll left on the Home screen to open the guide.      Select Settings.      Select All Settings.      Select Network.      Select Network settings.      Select Advance settings.      Select Alternate MAC address.      Select Clear.     If the issue persists, there may be a problem with your console's operating system (OS) that is preventing the game from playing properly. You can reset your console’s OS without deleting your games or apps.To reset your console without losing your game data, follow these steps:Press the Xbox button  to open the guide.Select Settings.Select All Settings.Select System.Select Console info & updates.Select Reset console.On the Reset your console? screen, select Reset and keep my games & apps. This option will reset the OS and delete all potentially corrupted data without deleting your games or apps.If the console reset is successful, you may be prompted to repeat some general console set-up steps before you are returned to the Home screen.Should you need further assistance, you can reply to this post anytime.","We would like to verify if you are still experiencing issues with your Xbox One dashoboard icons.If you need further assistance, don't hesitate to let us know. ","I am having the same problem. I have an Xbox One X and the Elite controller. During games all buttons work as intended, but on the home screen I have to press and hold the A\/Select button for a long time to make a selection. My joysticks are also acting like they're stuck in the up position. I've reset the Xbox via Hard Reset, changed power outlets, changed Controller from Elite to Regular White and even did a full factory reset. Nothing fixes it. I spent over 700 dollars on this setup 3 weeks ago and I'm already having issues... ","Im having this same issue. I have the xbox one and am using a factory original controller. This has happened before but has fixed itself in just a few minutes, but this time its lasted hours. Kind of annoying to spend hundreds of dollars on these advanced gaming systems only to not be able to select things on the home screen....","So my issue ended up being I had another controller wrapped up but plugged in (wired controller) that was pushing down on a joystick. Didn't see it as my kids put a bunch of other stuff around it... ","Currently facing this issue where no icons, apps or games will open. Navigating through apps is even a challenge as i will scroll over and it will respond by skipping to the end of a menu. Hard reset and disconnecting the power has not worked. Factory reset, I can't get into the settings menu as it is one of the icons that doesnt respond. ","My issue ended up being stupid. I had a 2nd remote that was a wired remote. My son had wrapped it up to put it away and one of the joysticks was being pressed by the cable. "," One of those options worked for me.  ","Im having the EXACT SAME PROBLEM! With the exact same issues. Nothing added. Ive had 0 luck fixing this thing.","I had the same problem. Then I realized my wired controller had the a button pressed down. Hope it's as easy for you guys and gals."]},{"symptom":"Install One Drive on Windows 7        Trying to install One Drive. Getting error code 0x0070005","solutions":[]},{"symptom":"Apple keyboard & mouse to use windows10        I just installed windows 10 on my Mac and its \"working\" ok but do I need a wired windows keyboard and mouse, can I use my Apple devices?","solutions":["Hi Nancy The Apple keyboard & mouse should work with Windows 10, go into Settings - Devices, then make sure Bluetooth is turned on in Windows 10 and if necessary, click 'Add a Device' . . ."]},{"symptom":"Bluetooth Speaker Connected But Doesnt Appear as Output Device and YES I reinstalled everything but it keeps happening.        So with Windows 10 on a Dell XPS 13 9350, I got a JBL Flip Bluetooth speaker.  It hooks up, works fine, but at some point, the two stop connecting.  At first, I could only get it to work as a headset (terrible sound) but then reinstalled drivers and got it to work as an external speaker.  It has worked fine, but after a while, it will connect, but I cannot change to use it as a speaker.  That is, if I open SOUND SETTINGS it does not appear on the CHOOSE YOUR OUTPUT DEVICE pull down.  But it says that it is connected, and it is connected as an external speaker without a display screen.  (The computer has had this trouble with other bluetooth speakers, and my phone has no trouble connecting to the Flip and staying connected.)  I have reinstalled the drivers, restarted, disabled the LE enumerator, and here's the thing: if I walk through several things, and restart, eventually it will work for a while, until the computer sleeps or hibernates or otherwise the connection is stopped, and then it's back to the way it was.  So my problem isnt getting it to work, it's keeping it working so that I dont spend 15 minutes each time I want to use it!  Thanks!","solutions":["Hi Have you tried to run the Bluetooth Troubleshooter? 1. Go to settings 2.Choose the Update & Security, 3. Then click \"Troubleshoot\" then > \"Find and fix other problems\" > Select the Bluetooth.","The troubleshooter, when I am asking it to look for Bluetooth devices, says that the adapter is on the back of the computer [???] and isnt plugged in, but it doesnt seem to actually be thinking about Bluetooth at all!"]},{"symptom":"what does code 0X80070079 mean?        Hi, I'm trying to get into the Excel program have already paid but can't get into it..i keep getting a code that has me copy then paste into a search bar but nothing..i received an error message that read... code 0X80070079 The Semaphore timeout period has expired...what does this mean?Thank You     JS","solutions":["Check in the Office forum.","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. This error occurs due to Network Driver Malfunction. Please Reset the Network Adapter and check. Open Settings > Network & Internet > Status > Network Reset"]},{"symptom":"How to fix Constant crashes\/BSOD on Gaming PC        PC SpecsCPU - AMD Ryzen 5 2600X Six-Core Processor, 3600 Mhx, 6 Core(s), 12 Logical ProcessorsMotherboard - AsRock B450 Gaming K4RAM - GeIL EVO POTENZA 16GB (2 x 8GB) 288-Pin DDR4 SDRAM DDR4 3000 (PC4 24000)BiOS version\/date - American Megatrends Inc P3.10 3\/7\/2019GPU - NVIDIA GeForce RTX 2060PSU - RMx Series™ RM650x 80 PLUS Gold Fully Modular ATX Power SupplyHi there!I'm posting here because I have no idea where else to go or what else to do. I apologize for the length of this post, but I figured the more detailed I can be, the better answers and suggestions any of you might have.I recently built a gaming PC in July 2019. The PC worked fine until we had a power outage that caused the PC to turn off abruptly. Thankfully the PC was plugged into a surge protector.  However, since then, my PC has been consistently crashing with a myriad of BSOD and accompanying stop codes. The crashes occur sporadically - either every 15-20 minutes or with hours\/days between them.  They also tend to happen no matter what the PC is doing - gaming, idling, watching Netflix\/Hulu - it doesn't seem to matter.The most common ones that I see are:Critical Process DiedUnknown Store ExceptionSystem Service ExceptionMemory Management (Although I've only seen this error once)Here is a list of everything that I've attempted to troubleshoot the issue. I must apologize, as I am an extreme novice when it comes to this, but I just want to get this PC working again.1. Updated all drivers and windows2. Completed several full scans of anti-virus software (Windows Defender)3. Run system file checker. All scans have come back clean4. Run the DISM Tool. Found no issues here either5. Run chkdsk. This came back clean, although it took almost 24 full hours to complete. I'm not sure if that's normal6. Run memtest86. In total, I've run 40 passes through both partitions, and suffered 0 errors or failsAfter reading through many threads of people having similar issues; looking for something that might work for myself, I see that I should also update my BiOS. I have not done that yet - as I'm scared to. Some sites mention that updating your BiOS is likely never necessary;and in fact on the site for my motherboard's BiOS - it suggests not to update it if things are running normally. If you all think I should go ahead and do this, I will - I just don't want to brick my PC. And I'm not sure that its BiOS related, since the issues have been ongoing since about a month after I built my PC.The one thing that has worked in the past is running memtest86. After my first 8 passes (on each partition), the crashes stopped for about 3 months. I traveled home for the holidays with my PC and they promptly started again. Each subsequent run has seemed to put a stop to the crashes for days, at most.After the crashes first began, I took the PC to a MicroCenter repair shop. They charged me $40, but told me they didn't come across any issues while the PC was there. The crashes did stop for a few weeks once I got the PC back home,however.One last thing that I think is worth mentioning: When I get the BSOD and accompanying stop code, my PC does attempt to reboot. However, upon attempting the reboot - it tells me to insert a boot drive. By turning off the PC and turning it back on, the OS boots back up normally.Thank you for taking the time to read through this. I genuinely appreciate any and all suggestions to help resolve this.","solutions":["How big is the Disk drive?","How big is the Disk drive?Sorry, I should've included that. I'm running a 2 TB HDD as well as a 1 TB SSD","Hi T, thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.Please check if there are any files within c:\\windows\\minidump of your computer. If there is, please upload them in a zip file to a cloud storage, share it and post the link here.","Hi T, thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.Please check if there are any files within c:\\windows\\minidump of your computer. If there is, please upload them in a zip file to a cloud storage, share it and post the link here.Hi comnuts, I went to that folder and it was empty. In reading other threads, I discovered that its possible for Windows not to write dump files for certain crashes when it should be?I've gone into startup & recovery to ensure that Windows is supposed to be writing complete memory dumps, but there's still nothing there.As an update to my original post, I did update my BiOS and was crash-free for approximately 2 hours (up from every 20 minutes), but just had another crash...so that wasn't the fix.Any ideas on how to get Windows to write the dump files that you need?","Please also check if there is a dump file under C:\\Windows\\MEMORY.DMP. Replace C:\\Windows if you have changed your systemroot location.To configure Windows to create dump files, check out this article from a site that I like to use:https:\/\/www.pcworld.com\/article\/3103104\/how-to-... I would suggest to configure Small Memory dump first. If memory dump isn't created during a crash, change to Automatic Memory Dump.Please let me know if I can help you further! Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Please also check if there is a dump file under C:\\Windows\\MEMORY.DMP. Replace C:\\Windows if you have changed your systemroot location.To configure Windows to create dump files, check out this article from a site that I like to use:https:\/\/www.pcworld.com\/article\/3103104\/how-to-... I would suggest to configure Small Memory dump first. If memory dump isn't created during a crash, change to Automatic Memory Dump.Please let me know if I can help you further! Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I've configured to small memory dump for now...I assume I'll have to await for another crash to see. There were no files in the folder path you also mentioned either - in fact that folder path didn't even exist.I'll update after the next crash & after trying automatic memory dump as well.Thanks for your help.","Yes, you will have to wait for a crash for a dump file to be created. I'll wait for your updates.","Yes, you will have to wait for a crash for a dump file to be created. I'll wait for your updates.Alright, I've done as you asked and changed it to small memory dump. I experienced a crash, but no files still exist in the c:\\windows\\minidump folder. I also changed to automatic memory dump, experienced a 2nd crash about fifteen minutes later - and no dumps have been created. I followed the instructions on the website you provided exactly as well.During these recent crashes, I've noticed that during BSOD, the progress percentage doesn't increase. It stays at 0 and then the PC eventually restarts.I'm not sure what to do at this point. Thanks.","Ok, when you encounter BSOD, there would be a stop code. Did you managed to capture that?","Ok, when you encounter BSOD, there would be a stop code. Did you managed to capture that?Yes. All of the stop codes have been Critical_Process_Died for the last week. I should also mention that I tried running my PC in safe mode w\/ networking for the last few hours, and still encountered a BSOD with the same stop code."]},{"symptom":"remote desktop        If I upgrade my windows 10 to pro so that I can use the remote desktop to access my computer at work from my laptop, does my computer I'm trying to remotely access have to have windows 10 pro as well, or just the laptop I'm using to access the desktop with the older windows version?","solutions":["Hi Melissa. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.You'd have to have Pro version to use RDP but it's not the best choice by a long shot. After endless problems with it I changed to TeamViewer and AnyDesk ten years ago and would never go back. These are free with consumer use; AnyDesk is less likely to mistake connecting from a school or business as business (paid) usage than TeamViewer. Either one are totally reliable compared to RDP.See comparison here: https:\/\/www.gb-advisors.com\/teamviewer-vs-anyde...There's a workaround to use RDP in Home version here that might still work: https:\/\/www.thewindowsclub.com\/how-to-use-windo...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Yeah, I downloaded TeamViewer, but kind of struggling with getting it working.  I was thinking that I have to create a separate user for the computer and the laptop, which I haven't done.  I just logged into the same free user account and tried to connect, but it told me I can't connect, can't remember the reason, it was a few days ago.  I was thinking I needed to bring in geek squad to assist or something.  I just want to be able to input invoices in quickbooks desktop version from my laptop if I can't be at my office.  I don't like the having to backup and restore option from USB, it would just be easier to be able to login remotely and work in it.  Also my time clock program for employee's payroll","Melissa, try AnyDesk instead. I've never heard of Teamviewer not working but AnyDesk is just as good and doesn't even need to be installed. You download it and it opens and is ready to connect. After trying it you will be given the option to install it. Works fine either way.","Do I just have to leave it open on my work computer all the time to make a connection from my laptop when needed? It will always be ready for a remote connection?","In the app's Settings you can choose for it to start with Windows so it's always running on standby in the System Tray at bottom right of Taskbar.Then set your Power Options to Never for Sleep and Hibernate. See here to adjust your Power Plan:https:\/\/www.tenforums.com\/tutorials\/2843-change...More about setting up Unattended Access in Team Viewer or Any Desk here: https:\/\/www.teamviewer.com\/en\/res\/pdf\/first_ste...https:\/\/blog.anydesk.com\/how-does-anydesk-unatt...You can also use TeamViewer's Wake On LAN tool here: https:\/\/community.teamviewer.com\/t5\/Knowledge-B..."]},{"symptom":"Windows 10 Upgrade        I am running a computer on Windows 7 and upgraded to Windows 10. I cannot get in as I do not have the Windows password. I have a Microsoft acct and this goes through until I get to the Windows password screen. I am considered purchasing  the new Windows 10. If I do so will I need the current Windows password which I cannot access or will I be able to create a new one? I have tried everything I have come across and nothing works. I also do not have the admin password as this was a computer given to me.","solutions":["I got in touch with support.  I was going to have to do a factory reset and reload all my programs and files. I held down the shift button and hit restart and my old account showed. I clicked on it and I'm now into the Win 10 upgrade and all my files are still there. I hope this works for someone else!"]},{"symptom":"Your computer appears to be correctly configured, but the device or resource (www.microsoft.com) is not responding        I have tried everything available online, like ipconfig\/renew, winsock, setting the ip address and dns, then resetting it back to “configure automatically”. Nothing seems to fix the connection. The wifi works fine on every other device, but on my main computer, it shows that there is a connection but no internet connection.When I run the command prompt for “ping google.com”, I get nothing but “Request Time Out”. Same thing happens when I ping 8.8.8.8. When I do tracert, every single hop was a request timeout.I am out of options.","solutions":["With cmd,the winsock to: reset Winsock Also,open control-panel\/networking\/advanced\/change adapter settings,R.click any that are not in use,Delete.Next exit,open Internet Options reset to advanced settings button,exit or set other services,exit.Never seen Microsoft.com as a OS issue,as Windows update is the key..Try installing: windowsupdateagent-7.6-x86Download from Microsoft\/download center.Also is Win 7 SP1 installed,if not download.https:\/\/support.microsoft.com\/en-us\/help\/15090\/windows-7-install-service-pack-1-sp1Also,install Windows Internet Explorer,after SP1,follow the link.http:\/\/catalog.update.microsoft.com\/v7\/site\/Search.aspx?q=Internet%20explorer%202019Sorry my reset Winsock was\/is thru windows,but to reset thru Microsoft\/TechNet follow the link.https:\/\/social.technet.microsoft.com\/Search\/en-US?query=windows%207%20reset%20Winsock&ac=5#refinementChanges=60&pageNumber=1&showMore=false","I should’ve made this clear in my initial post, but I have trouble connecting to the internet. The connection to the router itself doesn’t seem to be the problem, it’s that the computer cannot connect to the Internet from the router.","Rather than trying random \"fixes,\" you need to figure out what the problem is.What edition of Windows do you have?What happened to your system shortly before the problem started?Does the computer (or other device) that you're using to access the Internet to ask your question here use the same router and the same Internet connection as the \"problem computer\"?What is the make and specific model of your router, as shown on the manufacturer's label?What is the make and specific model of the problem computer?The following assumes that you are accessing the Internet using a computer of some sort to ask your question here rather than a smartphone.On the problem computer, open a Command Prompt window (type Command Prompt in the Search box and press Enter)In the black Command Prompt window, type the following and press Enter after each lineipconfig \/all > \"%userprofile%\\Desktop\\ipinfo.txt\"exitConnect a USB flash drive to the computer, copy the file ipinfo.txt from the Desktop of the problem computer to the flash drive (the file may appear on your Desktop as just ipinfo).Eject the flash drive from the problem computer and connect it to the computer that you use to connect to the Internet\/Open Windows Explorer, browse to the flash drive, and open ipinfo.txtIn the open Notepad window, click Edit > Select All (or press CTRL+A) then click Edit > Copy (or press Ctrl+C)In the body of your Question, Right-click > Paste (or press CTRL+V) the data from the Notepad windowOn the problem computer, open Device Manager (click Start, type devmgmt.msc in the Search box, and press Enter).Double-click the \"Network adapters\" category.For each item in the Network adapters category, please provide the following informationThe complete name of the itemDouble-click the item and report its \"Device Status\"If there is an \"Other devices\" category, please provide the same information as for the Network adapters category.","I am using Window 7 Ultimate Service Pack 1.My computer went to sleep idling, when this problem suddenly occurred. This usually isn’t a problem.I am currently using a phone to access the Internet, and it is using the same router\/WiFi network as the problem computer.I currently have no way to check the make and model of the router, as I am sharing it with a neighbor (its use is a mutual agreement between us).My computer is a Lenovo computer. I’m afraid I can’t offer any more specific details after that, other than it’s a pretty old model.As I’m currently using a phone, it would be pretty difficult for me to type out everything from the ipconfig\/all command.There are no yellow triangles on any of the Network adapters.On “Other devices”, there is an “Unknown device” with a yellow triangle.","Hello. Can you ask your neighbor to reboot the router? That will refresh your IP connection. You should turn off your computer until he powers it back on. Wait 5 minutes for the network to stabilize and then power your PC back on.  See if your internet connection is restored. ","If you can get the router rebooted as suggested by Resourceful but that doesn't help, run ipconfig (no \/all) on your Lenovo laptop and report the following:IPv4 addressDefault GatewayThen run the ping command to whatever IP address was reported as the Default Gateway and report the % packet loss. For example (your output will probably say \"Wireless LAN adapter Wireless Network Connection\" rather than \"Ethernet adapter Local Area Connection\"):","Unfortunately, my neighbor is out of town for the holidays, so I’ll try asking them to reset their routers when they come back.As for pinging the Default Gateway IP, there is a 0% loss.Edit: I went to a computer repair shop today to see if the problem persists. Their wifi worked on the problem computer, so it must be the router. I’ll see if resetting the router will fix my issue.","Yes, a 0% packet loss when pinging the Default Gateway means that you can communicate with the router (which is something you had said earlier).The problem thus does seem to be the router.  Your phone is probably connecting to the Internet using its cellular connection rather than wi-fi to the router.Good luck and best wishes for the New Year!"]},{"symptom":"Windows 7 update deadline?        Will the same OS updates that are available on January 14, 2020, be available on January 15?I will have a few \"pickled\" Win 7 laptops and want to know the last day I can update them to the Win 7 max.Ken C","solutions":["We don't know the exact details of what Microsoft is doing, as we don't work for Microsoft.But for XP, Vista, etc., the updates up until their end of support date remain available.They are not suddenly going to turn the present updates off.They are just not going to release any more after that date.If you're looking for information for home users, see Windows 7 support will end on January 14, 2020.With end of support Microsoft is not telling you that your operating systems won't work.What they are saying is that after a certain date they will no longer support them.Whether they still work or not with particular programs is up to the particular program manufacturers.Example: Google Chrome is no longer supported for security updates in XP or Vista by Google and Mozilla Firefox is following the same path.What this basically means with Microsoft no longer supporting an operating system is that even though hackers may find \"holes\" and vulnerabilities to be able to access the operating systems and cause security problems, Microsoft will no longer be monitoring or rectifying those problems by way of Security Updates each month.You are on your own in regards to maintaining the Security of your operating systems.What does it mean if Windows isn't supported?____________________________________________________This will show you when support (Mainstream and Extended Support) for the various operating systems ends.Windows lifecycle fact sheet - Windows Help - Microsoft SupportAnd these FAQs show you how Microsoft arrived at the Support Lifecycle Policy:Microsoft Lifecycle Policy FAQhttps:\/\/support.microsoft.com\/en-au\/help\/17140\/lifecycle-faq-general-policy-questions@@@@@@@@@@@@@@@@@@@@@@@","I bet it won't make a bit of difference to 99% of users employing sensible internet practices.  I've forgotten to update for months at a time (always have Windows Update disabled in services.msc) and it didn't matter at all.  Of course I read my email in plain text so that helps. ","Yes if you remember back in the XP, Windows 2000, vista era as these operating systems went off support any \"public\" updates were still available through the windows update system long after the systems were officially out of support.Historically if Microsoft felt that a certain operating system was subject to a potential worm they released patches even to unsupported systems (case in point https:\/\/www.zdnet.com\/article\/microsoft-issues-second-warning-about-patching-bluekeep-as-poc-code-goes-public\/  they released public patches for XP in 2019 for heavens sake)","Yes if you remember back in the XP, Windows 2000, vista era as these operating systems went off support any \"public\" updates were still available through the windows update system long after the systems were officially out of support.Historically if Microsoft felt that a certain operating system was subject to a potential worm they released patches even to unsupported systems (case in point https:\/\/www.zdnet.com\/article\/microsoft-issues-second-warning-about-patching-bluekeep-as-poc-code-goes-public\/  they released public patches for XP in 2019 for heavens sake)I already posted that updates will still be available, as they were back then for those Operating Systems.Why tell me that?We don't know the exact details of what Microsoft is doing, as we don't work for Microsoft.But for XP, Vista, etc., the updates up until their end of support date remain available.They are not suddenly going to turn the present updates off.They are just not going to release any more after that date.","She was confirming what you said.  Why complain?  This is a point that needs to be pounded into Windows 7 people that think the sky will fall on Jan 14. If anything their computer life may improve as some updates wreck havoc with people's systems.  Instead people need to look at the main causes of infection and make sure they have basic protection and do things (like reading all email in plain text) that help.Run, services.msc, set Windows Update to Disabled.  Check in occasionally to see if there's anything important.  And of course use an antivirus that is updated continually. ","Bob, you are so right.  My 120 Win7 clients have not had a Microsoft update in 31 months now.  Not a single problem.  That's like more than 3000 computer months.  None of them are enterprise installations.","That is so encouraging.  Those updates are such a pain and most users feel so obligated to get them thinking their system will go into meltdown if they forsake their updating responsibilities.  After reading a few pages on AskWoody I realized how unnecessary so many of them were.  Then I read about telemetry.  That was a wake up call.  It feels good to know I'm better prepared with some of those updates removed.  Obviously several were put in place to benefit Microsoft, not us. Its also important to realize that if there is some serious security breach the last thing Microsoft wants is to look irresponsible to the world.  They will patch anything important no matter if an OS is technically supported to avoid looking like the bad guy to the world. ","You're USING opatch?  How about you're SELLING opatch.  Stop spamming!","No not selling,  (USING!)  They sell to multi computer businesses, but offer free for personal home use with limited ctritical updates. I am just a disabled home user trying to save money. Did you know Microsoft is still doing critical patches for XP for businesses with older computers for a fee, but not the general public. I cant afford a faster computer, but i have plenty of time to search for other available options thru web searches. I wish i could prove it to you. After finding the article i had to do another search to find download site.","No not selling,  (USING!)  They sell to multi computer businesses, but offer free for personal home use with limited ctritical updates. I am just a disabled home user trying to save money. Did you know Microsoft is still doing critical patches for XP for businesses with older computers for a fee, but not the general public. I cant afford a faster computer, but i have plenty of time to search for other available options thru web searches. I wish i could prove it to you. After finding the article i had to do another search to find download site.Richk1120,In the FAQ regarding the opatch it states:\"We may occasionally decide to provide some of these micropatches to 0patch FREE users as well, for instance to help slow down a global worm outbreak.\"This leads me to believe that even a Home User will have to pay for the patch. Please don't post the link again until it is clear that the patch will be free to all home users."]},{"symptom":"Starting a few months ago, shortly after the next to last Windows 10 update, I started getting these blue screens with stop codes        I get these blue screen error messages telling me that there was an error and the computer has to restart.  In the beginning it was only occasionally but the past day or two it has become at least a few a day.  The stop code is not always the same and on the Microsoft stop code page only two of the four codes I get from time to time (only one at a time pops up) are listed.  I'm not a computer whiz so even for those two I would never endeavor to go through the process described on the Microsoft web page.  My entire business is on this laptop and I can't afford to risk having the whole computer crash on me.  Yes, I have either the original installation disks or access to a new download on the web but buying a new computer now and reinstalling all these programs and restoring all the data files just isn't an option right now.  Does anyone know why I would start seeing all these blue screen stop codes over the past few months?  I've installed updates to Quickbooks 2019 and 2018 in addition to updates to my tax software and the new 2019 tax program but there is so much in that directory that it is simply unrealistic to remove it all and then reinstall it.  I'm hoping there is some reasonable answer as to what would cause this at this point in time.  I've had this laptop with the Windows 10 on it for almost two years and this never happened before maybe around October although I really don't remember the exact point where this started. ","solutions":["Hi Marti, please check to see if your PC has produced any minidump files: Open Windows File Explorer Navigate to C:\\Windows\\Minidump Copy any minidump files onto your Desktop, then zip those up Upload the zip file to the Cloud (OneDrive, DropBox . . . etc.), then choose to share those and get a share linkThen post the link here to the zip file, so we can take a look for you . . ."]},{"symptom":"Open .bat files whit new Windows Terminal?        So i have question, is it possible to open .bat files with the new Windows terminal? I already installed Windows Terminal but i really want to open the .bat files with the new Windows Terminal instead of the old cmd. If it is possible  can u tell me how?Already thanks for u suport.","solutions":["So i have question, is it possible to open .bat files with the new Windows terminal?Yes, this is possible.","So i have question, is it possible to open .bat files with the new Windows terminal?Yes, this is possible.How than?","So i have question, is it possible to open .bat files with the new Windows terminal?Yes, this is possible.How than? Asking \"Is it possible to open .bat files with the new Windows terminal?\" is unlikely to get you a good answer. To reply to your second question you need to post more details so that respondents know exactly what you're trying to achieve.","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. .Bat extension is a Command Prompt executable format. It would not support in the New Windows Terminal as I have checked. However, please right click on the .Bat file and select Open With and check if Windows terminal is an option. If you don't see (Most likely), then you have to execute .bat files on CMD."]},{"symptom":"Assassins creed Black flag on windows 10 Home or Pro        I have faced the issue of Windows 10 (i have the Pro Edition) not allowing games such as Assassins Creed black flag to run as normal.The Reason i am posting this is to help resolve the issue for good for all players on Windows 10 regardless of Version.1)Make sure when you install the game it is not on the same drive as your windows 10 install drive,Windows has to be a standalone install,no idea why this works but it does.2) Before you have installed the game turn off Windows account control it is in the Windows security tab of control panel.3) After the previous step install the game and run it as usual,Then click the icon for the game in either the Uplay install folder,or steam and send to desktop\/Make a shortcut.Run the game as Admin and also Windows 8 Compatibility by right clicking the shortcut and clicking on the relevant tab,tick the boxes and then click apply.Run the game and with any luck your game should be up and running,You will need to turn off User account control while playing so not a good idea to play online,I do not recommend doing so at any cost.The last thread i saw about this issue was posted back in 2015 but it still has not been fixed by the team building windows ten,Surely a simple fix can be found that allows games to be installed with UAC turned on such as those found in a firewall.at the moment i cannot find a way to install ACBF without turning off UAC which is problematic and could be fixed an a few months,it has been 5 years since that post was written and still the issue is with us. ","solutions":[]}]}