{"windows":[{"symptom":"HDD Not Recognized in Disk Management        Hello,2 weeks ago I received a new ASUS laptop (ASUS 15 X509FL) with no OS my decision).After installing the OS (Windows 10) via DOK I'v noticed that my HDD (st1000lm035-1rk172) is detected in the BIOS and the Device Manager but not detected in the Disk management so I cannot use it at all. So for now I can only use my SSD.What I tried to do so far:Uninstall the HDD from the device manager.Update the storge devices and storage controllers drivers.Install the OS again and from a different USB port.Update the BIOS into version 302.Ran windows memory diagnostic.And nothing helped it.I did noticed that in the BIOS the HDD is 'Non RAID Physical Disk'Is there anything I can do before sending the PC to a shop for the physical connection check?Thanks.","solutions":["Hi Tsvi, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.The troubleshooting steps you have taken is enough to troubleshoot a Windows-only issue. Hard drisk not visible despite a clean install ultimately confirms it as a hardware issue.Suggest you to get in touch of Acer support asap."]},{"symptom":"computer not connecting to internet        This is about my previous question.  I have internet since i'm able to send this to you on my old computer.  I purchased a new computer.  It says i'm connected but I can not log on to anything with it.  It said thread broken or no internet.  Please advise what I can do.  Thank you.","solutions":["Hello! I am an Independent Advisor, I would love to help you out! What is the make and model of the new computer? The first thing I would try is a network reset. You can do this by going to settings > network & internet > network resetAfter this you will need to connect to the network again and enter a password if needed for the network."]},{"symptom":"Cannot instal Forza Horizon 4 error code 0x80073d12        Hello i am getting error 0x80073d12 meaning that i am trying to install an addon that i do not have the game for.Thing is, all i am trying to do is install FH4 as a standalone game but the installer is trying to install the drift cars dlc on its own without installing the game first.I cannot workaround this issue. I used to be able to play FH4 on this pc last month on the very same microsoft account i am using now.Why is the installer trying to install the DLC without me clicking to install the DLC? I am clicking to install FH4....Can someone please help?Thank you in advance for your time and effort","solutions":["Oh I see it seems that there may be some files left over on your PC tricking the installer into thinking that you have it installed. Is there any files left in the folder? I would first attempt to enter settings>windows store>advanced> and reset. There's a few things we can also try such as tweaking the registry but let's avoid that for now.When you navigate to add\/remove programs is the game still showing up?"]},{"symptom":"Version 1903        i cannot load version 1903.  after 15 times trying I give up.  Any suggestions as to how to accomplish this task?","solutions":["Hi Kens, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Try updating to 1903\\9 using Media Creation tool and if it fails, share the logs.The fastest way to get the upgrade is through Media creation tool or ISO file. Please download Media Creation Tool from the link below and select Upgrade this PC at the first screen.https:\/\/go.microsoft.com\/fwlink\/?LinkId=691209All steps, including upgrading using ISO file and Media creation tool, are covered here:https:\/\/www.yourwindowsguide.com\/2019\/05\/update...Content on the above blog is written by a Microsoft MVP so it is safe. Meanwhile, if the update fails with MCT as well. Let us check the Installation log to find why the update failed. Please share the logs as mentioned in this article. You should use a File sharing service like Onedrive or Media Fire to upload files and share the link in the next reply.https:\/\/answers.microsoft.com\/en-us\/windows\/for...The Panther logs. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\PantherThe Rollback logs: These usually are created if Windows Update rolls back. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\Rollback[Only if the error code is 0xC1900101-0x30018] The Device Install Log from C:\/$Windows.~bt\\Sources\\Rollback\\setupapi\\setupapi.dev.log"]},{"symptom":"windows cleanup files        is it safe to delete windows cleanup files","solutions":["Hi John, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Do you mean Windows Update cleanup files in Disk cleanup?"]},{"symptom":"Can't access to access control editor.Access is denied.        Hello I just by mistake lock my C drive so Can anybody please help me in security tab it always says that can't access to access control editor .Access is denied please help me.","solutions":["Hello AeroAkshat, thank you for providing this question. I am a seasoned Windows expert with almost a decade in usage and support experience and hope to resolve your problems quickly.Try to boot into safe mode and do changes there. Hold the shift button while clicking restart gets you there easily. Try to make the access changes in safe mode. When booted up try to log in as Administrator. I would suggest you to follow these steps to take the ownership of the drive. a. Right click on Drive C and click Properties. b. Switch to Security tab, click Edit and Add to add your user account, if it is not listed. Assign the full control permission for your own account and click OK.c. Click Advanced, switch to Ownership tab and click Edit button. d. Highlight your user account and click Apply, and then click OK. Here please refer to another thread with the same problem: https:\/\/answers.microsoft.com\/en-us\/windows\/for...If you consider your problem solved it would be very good if you marked the answer which helped you so others can find and use this thread.If this didn't solve your problem or you need further assistance please answer in this thread and i would be happy to help.kind regards F. Grobusch","I am really thankful to you,Dear F.Grobusch for your help.This method worked.Thank you.Kind regardsAeroAkshat"]},{"symptom":"Bing        How can I eliminate BING search engine in windows 10 pro 1903?  It keeps popping up on startup.","solutions":["Hi, Unfortunately Bing is baked into Windows 10. There has been ways in the past to change this but these have now been stopped.","I guess I'll be looking for a Mac.  Microsoft has just become to controlling."]},{"symptom":"Trying to Disable Hyper-V, Getting BSOD        I have been trying to disable Hyper-V so that I can use VirtualBox. Each time I attempt to remove Hyper-V through Windows Features, the OS shuts down, and then hits a BSODs during boot. I am then able to return to a restore point.I have tried:Removing the Hyper-V features after a clean boot.Manually disabling the Hyper-V service, manually removing Hyper-V network adapters, and then disabling Hyper-V in Windows Featuers.I believe the issue might be similar to this (but not the exact same): https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/trying-disable-hyper-v-cause-blue-screen-when\/edbc92fd-845e-4f55-948a-b06c7925c24d","solutions":["P.S. Here is a link to the minidump as well as CPU-Z dump:https:\/\/1drv.ms\/u\/s!AguiID76vUJWkFKo4UAQLtB9xLtC?e=CHdC2u","Hi Brandon, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved. Start - Search - type in --> CMD Find at top and Right Click on - Run as Admin. Perform these as required and then restart the computer. To disable: bcdedit \/set hypervisorlaunchtype off To enable: bcdedit \/set hypervisorlaunchtype auto ------ Or in the above CMD prompt : dism.exe \/Online \/Enable-Feature:Microsoft-Hyper-V \/All dism.exe \/Online \/Disable-Feature:Microsoft-Hyper-V-All Type Y when asked to restart the computer. after either command. ------- Or in an elevated PowerShell : Enable-WindowsOptionalFeature -Online -FeatureName Microsoft-Hyper-V –All Disable-WindowsOptionalFeature -Online -FeatureName Microsoft-Hyper-V-All Restart the computer after either command. Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all.","Hi Rob,Your answer just gives various options to disable Hyper-V. Disabling Hyper-V is just fine, It's only when the system is restarting, it's going to BSOD. How do we resolve this?"]},{"symptom":"1903 to 1909 fails with        Trying to update to 1909, getting this error. 0x8e5e0152have 2 m.2's one for boot one for normal stuff, projects games etc. not sure if I put something where it shouldn't be and ruined my intuitive experience. drives are a samsung 860 EVO and a 970 EVOmobo is an asus maximus xi hero w\/ a 9900k. all clocks are out of the box currently while troubleshooting. Validated latest BIOS.Happy to provide any more info if needed.SFC returns:C:\\WINDOWS\\system32>sfc \/scannowBeginning system scan.  This process will take some time.Beginning verification phase of system scan.Verification 100% complete.Windows Resource Protection found corrupt files but was unable to fix some of them.For online repairs, details are included in the CBS log file located atwindir\\Logs\\CBS\\CBS.log. For example C:\\Windows\\Logs\\CBS\\CBS.log. For offlinerepairs, details are included in the log file provided by the \/OFFLOGFILE flag.C:\\WINDOWS\\system32>","solutions":["Follow this gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... To create bootable Windows 10 Installation Media (on another PC if necessary) install Media Creation Tool and follow the directions in the middle of the download page here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key for your PC maker given in this chart:https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, skip Product key, during Custom Install, delete Recovery and EFI System on Disk1, exit installer and power off PC, unplug the data cables to Disks 1 and 2.Boot the media again, delete all partitions off of Disk0, click Next to let the installer create and format the needed partitions and begin."]},{"symptom":"Windows 7 upgrade to windows 10.        Hello. I upgraded (just before last christmas ,2019) three old windows 7 laptops to windows 10 via webpage: https:\/\/www.microsoft.com\/fi-fi\/software-download\/windows10 (it's finnish). I used the special program for that (päivitysavustaja). Are these upgrades ok? I.e. free. Installation had no problem. No codes or registrations asked. They works fine now. Pasi greets.","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Yes, that's all fine. You've used the official Microsoft upgrade page. If the upgrade finds a product key in your system which is valid for upgrade to Windows 10 it will just go ahead and do it - no prompts or questions about licence!Officially the free upgrade programme has long finished, but the upgrader still seems to allow the free upgrade so far.Regards, David"]},{"symptom":"wi fi driver        I just got a new pc and it doesn't have wireless wifi only ethernal. Does anyone knows a driver witch i can install?I really need one because it is very hard to stay next to my router.","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.If the computer doesn't have WiFi facility at all then the easiest option is to purchase a USB WiFi adaptor. This is just a small USB device that includes the WiFi hardware to get you working wirelessly. They are usually quite inexpensive.Regards, David","Hello David, I just want to know a Wi-Fi driver because if i buy a adaptor i don't like to use my usb port.","I understand, however if the computer didn't come with WiFi built-in then it lacks the required hardware - you can't get WiFi just through software\/driver, the computer needs the physical hardware to do it.If it's a desktop computer and has spare slots inside you could also get a PCI or PCI-E type WiFi adpator which would fit inside and not use a USB port. These tyres of card generally have a WiFi aerial which sticks out the back."]},{"symptom":"AirPods Pro doesn't play any sound when connected to the computer        so, i started using airpods for the computer a while backhowever, later, my right airpods creates a tiny glitchy sound for a millisecond, and all of a sudden there's no more sound from the computer.it gets fixed if the \"glitchy\" sound plays again, but i want a better way to fix other than rng.","solutions":["Hi DAKINUVPEPR, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.See the suggestions on the following link of a website that some Windows MVPs share, visit the section >> How to Fix Windows 10 Apple AirPod Sync Problemshttps:\/\/www.lifewire.com\/how-to-connect-airpods...If the above instructions do not work, try starting Windows through a clean boot, it is an error-proof process, so we can detect if it is a third-party program or driver that causes the problem.https:\/\/support.microsoft.com\/en-us\/help\/929135...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Adding a privacy policy to a facebook page.        I need to add a privacy policy link to a facebook business page. I have a draft saved in a word pad document using Windows 10. Can someone explain how to create that link to be able to enter it onto the page please? I cannot see any link icons on the word pad page.Thanks.","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.You'd need to first upload the document to a webpage where it would be readable in a web browser. Facebook want the link to that page.So for example a common way of doing it would be to create a webpage on your website (eg. www.mywebsite.com\/privacy) - put your privacy policy there and then give that link to Facebook.Regards, David"]},{"symptom":"Microsoft Edge is missing from the PC        i have seen steps to try get microedge reactivated after updating to 1903. PROBLEM  I cannot access any of the pagesto do so. Micro Edge  somehow  had controlled  a lot of pages, ex: cannot click on a photo to view and or share ,other saved documents cannot access ! I am not computer or internet  savy. WHY don't Microsoft edge  offer a SIMPLE FIX fordummies ?  I feel this their  way to try charge dollars-which I refuse !!! was told the 1903 update be good necessary - IT is NOT.If I don't get a fix\/ will trash Microsoft and  go get a APPLE computer.***Original title: microsoft edge after updating  to version 1903 stopped working, disappeared***","solutions":["Hi WmDean, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.The current version of Edge shipped in 1903 is not being actively developed. The next version of Edge, based on blink Engine is available which you may download here:Microsoft Edge Insider https:\/\/www.microsoftedgeinsider.comFor extreme stability, choose the beta channel which has updates every 6 weeks. I have been using it and it is way better than the older one.","ya thanks the beta downloaded=just another browser with more flash . But did not fix my issue= I read all advice butcannot get you techies to understand. When I downloaded (which thougt was required and was going to make my windows 10better. DID NOT- you all say go here, do this-I cannot because Microsoft edge since download stopped workingwhen I try to click on a program etc  a BLUE PAGE comes on for a second and than disappears= wont load !also the edge was the default email and now that wont work...  I even tried to open control panel- it like all other type pages wont open= because somehow Microsoft or the guy whom first  sit up my computer made microedge do most everything !and now I started  restarted in safemode … and even less works- but again I cannot open any pages to  reset and start inNORMAL mode. I DO SEE IN SAFE MODE shows I am micro R windows\/build \/ 18362.19h1 release 1903 18 -202whatever all that means. I also did a system restore and got a microsoftedge  icon on desktop but wont open. READY TO GIVE UP","Hi, Thank you for writing to Microsoft Community Forums. I understand your concern related to not being able to use Microsoft Edge on your PC. I would like to know if you are still running the PC is safe mode.One of the things you can try is to re-register the apps and see if that helps. Press Windows + X keys together and click onWindows PowerShell (Admin)Now type in the below command and hit Enter: Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart the PC. You may also want to refer the article What to do if Microsoft Edge isn't working Note: Repairing the browser won't affect anything, but resetting will remove your history, cookies, and any settings you might have changed If the issue persists, you can try creating a new user account and see if Edge is working fine. Refer the articleCreate a local user or administrator account in Windows 10 Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator","Hi,Thank you for writing to Microsoft Community Forums.I understand your concern related to not being able to use Microsoft Edge on your PC. I would like to know if you are still running the PC is safe mode.One of the things you can try is to re-register the apps and see if that helps.Press Windows + X keys together and click onWindows PowerShell (Admin)Now type in the below command and hit Enter: Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart the PC.You may also want to refer the article What to do if Microsoft Edge isn't workingNote: Repairing the browser won't affect anything, but resetting will remove your history, cookies, and any settings you might have changedIf the issue persists, you can try creating a new user account and see if Edge is working fine. Refer the articleCreate a local user or administrator account in Windows 10Let us know how it goes.Regards,Prakhar KhareMicrosoft Community – ModeratorPrakhar, thanks for trying to help. I tried to type in the Get-AppX and all other letters sysmbols tries lower CASE ETCTRIED 4 TIMES  JUST GOT  RED MESSAGE SAYS ERROR ETC.= WONT WORK.yES I AM IN SAFEMODE- THOUGHT MIGHT help IT DID NOT., nOW I CANNOT GET BACK TO NORMAL START MODECANNOT UNDERSTAND  WHY I CAN NOT COMMUNICATE SUCCESSFULLY TO YOU   TECHS =  EXAMPLE I CANNOTOPEN   APPS&FEATURES  OR ANYOTHER - WHEN I CLICK ON  A BRIGHT BLUE PAGE APPEARS  FOR  1-SECOND THAN GOES AWAY .WHEN I THINK SUCCESSFULLY DOWNLOADED VERSION 1903  -  MICROSOFT ICON DISAPPERED , I DID TRIED RESTOREGOT A WHITEPAGE ICON  BUT WHEN CLICK ON OR RIGHT CLICK NOTHING HAPPENS.I TRYING GET RID OF  SAFEMODE-  BUT CANNOT AGAIN GO TO THE PAGE OR .command to do anythingtHE MANY LETTERS SYMBOLS- YOU ASKED ME TYPE IN  = WHY SO COMPLICATED  EX: NOT SURE THE  1 IS A NUMBEROR A     I CAPITAL   OR    l small  L.  itried 4 times changing the  1 l I","WOW so F tired this WINDOWS 10 version 1903 nightmare installed on 9\/28\/2019 OSbuild 18362.307 ??I just tried restore point says system restored to 9\/30\/2019 successful. YET still starts in safemodeI tred run command- opened type msconfig - enter system config -general tab clicked startup - NORMAL  -apply  okrestart  - still restarted each time to safe mode...………Now also  - my speakers do not work ????????  this is a hellish nightmare I am a disabled older vet- make 900\/mo  use to use computer did ok  UNTIL  1903 VERSION  update.and You  snops - in silicon valley, think oh well if he wants are  MISTAKE fixed he will PAY for it  !!!!!!!!!!!!YOUR WRONG- I just will throw this WINDOWS 10 1903 version  away-  try dave money get a new computer butbe a APPLE, never again Microsoft...…………………………….","Hi, Thank you for replying and I apologize for the delayed response. I certainly appreciate your efforts in trying to resolve the issue. Let’s try changing the settings to get out of Safe Mode. Press the Windows logo key+ R.Type msconfig in the Openbox and then select OK.Select the Boot tab.Under Boot options, clear the Safe boot checkbox. Click on Apply and Restart the PC. If the above changes doesn’t work, you can try the BCD edit command.  Press Windows + S key together to open Search.Now type CMD and select Run as administrator.Accept the UAC prompts.Copy and paste the following commands one by one and hitEnter:bcdedit \/deletevalue {current} safebootRestart the PC. Once you get out of Same Mode, then try running the PowerShell command mentioned in the above post. Regards,Prakhar KhareMicrosoft Community – Moderator","all microsoft apps are missing even microsoft store and microsoft edge xbox apps and the xbox bar plz help i signed in but still no store i want to install apps help .this isnt an answer its my win10 problem"]},{"symptom":"Microsoft Print to PDF        Why does this app not populate the file name?  This adds extra time to everyone's work.  People are resorting to using other programs then yours.  Please fix!","solutions":["Hi Cher! I'm Steve, an Independent Advisor and a Windows user like you. Agreed, having to re-enter the file name to print to PDF can be annoying! The best way to request a change to this is to go to File > Feedback within the office app you're using to print to PDF and use the frown\/suggestion icons to send feedback to the Microsoft Office developers. Please let me know if I can be of any further assistance!",":(Really, that's your answer.  Maybe do some research before you answer questions, being you're an Independent Advisor.  Emojis don't fix the problem."]},{"symptom":"reactivation after change of motherboard        my last windows 10 pro was a digital license. I don't know how to reactivate after change of motherboard. I have still with me the genuine windows 7 license. I don't know what to do. kindly help me. ","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Here is a article which gives details of how to reactivate after a hardware change if you have a valid license:https:\/\/support.microsoft.com\/en-gb\/help\/20530\/...Regards,Ross","my last windows 10 pro was a digital license. I don't know how to reactivate after change of motherboard. I have still with me the genuine windows 7 license. I don't know what to do. kindly help me"]},{"symptom":"Power state failure        Hi everyone, I built my first pc 4 months ago, and it works well. But there is this issue that annoys me a lot. Whenever I turn my system on, everything goes well for 5 minutes and the it shows me the blue death screen with a power state failure message, and restart the system. The restart apparently fix this issue, but it happens everytime I turn on my pc. I've tried all the solution on this community and nothing happens. How do I get rid of this problem?","solutions":["Hi Meshal,Type command prompt into the window search bar, click on Command Promptand hit run as administrator.Type below command in order and press Enter after each command.Command 1:REG ADD \"HKLM\\SYSTEM\\CurrentControlSet\\Control\\SafeBoot\\Minimal\\MSIServer\" \/VE \/T REG_SZ \/F \/D \"Service\"Command 2:net start msiserverRegards,"]},{"symptom":"please help me i keep having crashes on a new windows 10        hello therei recently reinstalled windows 10 on   12\/26\/2019 i think, because i've been getting lots of crashes and ive also tried to do system restore before i reinstalled a new windows and still crashes happen.on 12\/31\/2019 was the first crash for this new windows and on 1\/2\/2020 is the second crash, My pc is asus and it has 16 gigs of ram and Im not overclocking anything ( i also ran a memtest before i reinstalled windows 10 and it told me i had a hardware error or something but i wanted to reinstall to see if the crashes still happen so it might be because of this im not sure please tell me)the first crash was unexpected store exception and the today crash one is memory management Btw the first crash happened when I was in a middle of a match in FortniteThe second one happened when I was playing at a game called Risk of Rain 2 and I paused the game to go to google to search something and instantly after i opened google the crash happened.ive went to event viewer to check what happened and I got this from the memory management errorThe computer has rebooted from a bugcheck.  The bugcheck was: 0x0000001a (0x0000000000041792, 0xfffff700a5c7e3e8, 0x0000008000000000, 0x0000000000000000). A dump was saved in: C:\\WINDOWS\\MEMORY.DMP. Report Id: 1a2b8641-45ed-4b55-ade0-5fdef7f2ef4c.I dont have any anti viruses enabled. I didnt expect a crash that quick.also heres the dump filesfirst crash dump file:https:\/\/www.dropbox.com\/s\/hb4n3rx640sk9ft\/123119-7375-01.zip?dl=0second crash dump file:https:\/\/www.dropbox.com\/s\/ltza7f1as543v88\/010220-6984-01.zip?dl=0Please give me an answerThanks!","solutions":["Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.The results of your dump files. 1. A corrupt PTE has been detected, caused by Google Chrome. 2. The instruction at 0x%p referenced memory at 0x%p. The memory could not be %s, caused by ntkrnlmp.exe.Both ways, I suspect you have a faulty memory. Please run the standard test using Windows Memory Diagnostic tool.For more detail on this solution, check out this article from a site that I like to use:https:\/\/sea.pcmag.com\/operating-systems-and-pla... Please let me know if I can help you further! Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"How much of the ram is accessable for windows?        So, I updraded my laptop's ram from 4gb to 8 gb and I am not sure if all of the 8gb ram is consumable by windows. Is there any way to check it out?","solutions":["Hi Muhammad No, there is no need to install drivers when you install extra RAM, that is all managed automatically by Windows, there is nothing else you need to do . . ."]},{"symptom":"Ram error message when trying to use Photoshop elements 14        I have windows 10 on my computer and have installed photoshop elements 14 but I am unable to use it as I get an error message each time I try saying I have not got enough ram!!! Can anyone help?","solutions":["Hi irene654 how ram does your computer have? how much virtual memory do you have? click start type system information and press enter on the system summary page report back the total and available Physical memory and the total and available virtual memory.have a look at what else might be using memory and close other apps etc right click on taskbar and select task manager on the processes tab click the heading of the memory column to sort by memory usage.it is also possible that the photoshop scratch disk is too small https:\/\/helpx.adobe.com\/uk\/photoshop-elements\/u..."]}]}