{"windows":[{"symptom":"Cloning Windows Partition Continues to Fail        Hi All,I got a new system for myself which left me with a spare SSD for my wife. She's dual booting Windows 10 and Linux. The SSD is the same size as her HDD currently in the system. In Linux I ensured that partitions were literally identical running the fdisk command. I'm cloning one partition at a time. The Linux partitions work flawlessly (no surprise....) the Windows partition fails miserably. The clone succeeds but when I reboot I get a blue screen.I do not want to clean install for various reasons. Unlike Linux which takes 20 minutes to install, Windows takes hours and always has a series of problems along the way. Additionally, I'm not even sure I have the install media any more as the system is a few years old and I've moved and may have misplaced the original install dvds. Finally, the system is set up in a very specific way including backup scripts, mount points, specific software doing specific things at specific times. Starting from scratch is not an option.Does anyone have any suggestions on how I might get this clone to work right for the Windows partition? I knew this would be a nightmare but so far I'm 5 days into efforts and just failure after failure. It's amazing that Linux worked on first try while Windows fails with an identical copied partition . . .Thanks.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please try the following cloning method. 1. Click “Start” and type “cmd”. Right click on cmd and select “Run as administrator”.2. Type xcopy c:\\ f:\\ \/s \/e \/h \/i \/c \/y and press Enter to copy all the files and subdirectories (including any empty subdirectories, any system or hidden files) from drive C to drive F. You may change the drive letters according to your own needs.(Here F:\/ is the destination partition) If above method does not work and shows the same error, there might be some issue and you may need to Reset the PC.If you do not wish to reinstall the OS, you may go for System Reset with the option \"Remove Everything\". This will be equivalent to clean installation."]},{"symptom":"app error        how do i correct this error on windows 10.  It only comes up when I am trying to open my wordpress site or wp-admin?this file does not have an app associated with it for performing this action. Please install an app or, if one is already installed, create an association in the default apps page","solutions":["Hi Deb. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) See fixes here for the error: https:\/\/troubleshooter.xyz\/wiki\/this-file-does-...2) Try associating the app with it's recognized file types by going to Settings > Apps > Default Apps > Choose Default by App to find the app and trigger it's defaults.This is often caused by a virus or corrupted account, however. 3) So Download, install and run a full scan with the most powerful on-demand free scanner Malwarebytes:https:\/\/www.malwarebytes.com\/mwb-download\/.In the Scan Settings first set it to include scanning for Rootkits. If necessary run it in Safe Mode with Networking, or Safe Mode accessed by one of these methods:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... Clean up anything found, restart PC and then run again until it comes up clean. Check for any remainders in Settings > Apps > Apps & Features, and also in each of your browser's Extensions, Home Page settings, Search service or Add-On's as shown here:https:\/\/community.box.com\/t5\/How-to-Guides-for-... Then check for damaged System Files: https:\/\/www.lifewire.com\/how-to-use-sfc-scannow... If it cannot repair them see Step 10 here to continue: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If you want to keep Malwarebytes as an on-demand scanner then you can turn off its Real Time trial version in it's Settings > Account Details tab.4) To test if the problem is a corrupted account, create a new Local Admin account in Settings > Accounts > Family & Other People > Other, as shown here:http:\/\/www.howtogeek.com\/226540\/how-to-create-a... Sign into the new account, test if the problem persists, if not then move your files over, test that all programs work or else reinstall them, then when ready delete the old account in the same place.You can then change it to your Microsoft account if desired: https:\/\/www.tenforums.com\/tutorials\/5375-switch...5) If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","so far none of this worked but i did find the default apps associated with http etc and changed everything I could to google so I am restarting to see if this worksDeb","Hi Deb - Is it working correctly now? Another thing to do is set the default browser to Chrome (or your preferred) in Settings > Apps > Default Apps.Did you try all of the other steps I gave? Have you ruled out infection from the steps I gave?"]},{"symptom":"Minecraft Windows 10 unavailable        I previously redeemed a giftcard for buying Java and I got free minecraft for windows 10 and it worked just fine on that laptop, I decided I wanted to upgrade, so I switched to desktop which also has windows 10, whenever I try to install minecraft for windows 10 it says the game is unavailable. I own it it is in my library but does not let me install\/download whether I change devices, do wsreset.exe in an administrator command prompt, or when I reset it manually, please help. If someone who can help resolve this issue, please contact me through a reply, or any form of communicatipon you can get with me, or if you need any information.","solutions":[]},{"symptom":"Storage        HELP!!! So I recently purchased a pc about a week ago, it has ssd and hdd. I ran out of storage on my ssd and i changed all my download locations to my hdd which has over 2 tb,  games still try and download onto my ssd and cant because theres not enough space even though i changed the locations and applied and its still not working. Please help me!","solutions":["It is up to the installer of the program to allow the option of whether or not it can install on a drive other than C. Here's an article that talks about installing on a drive other than C:https:\/\/www.windowscentral.com\/how-install-apps.... Note that this is not a Microsoft web site and may contain ads or set cookies. It doesn't appear to contain anything unusual that I can see.","In what way does it not solve the issue? Please be specific."]},{"symptom":"Win 10 Pro 1909 64bit setup error        downloaded win 10 pro 1909, ran setup.exe, got error message (autorun.dll could not be loaded or is corrupt setup cannot continue. error code [0x7E].any help would be greatly appreciated, thanks for your help in advance.","solutions":["Hello JanetWeaver1, I'm Didi, an independent advisor. To fix error 0x7E first try to use the System File Checker tool following this guide, go to the \"Run the System File Checker tool (SFC.exe)\" paragraph :https:\/\/support.microsoft.com\/en-us\/help\/929833... If this doesn't help check your hard disk for any error : 1) Click Start. 2) Type cmd, right-click on Command Prompt and click on Run as Administrator 3) Type chkdsk \/r When you restart your system, your computer will be scanned for errors and attempts will be made to correct them.If it still doesn't work please refer to the answer provided by A. User on this thread, scroll down to see his answer marked in green :https:\/\/answers.microsoft.com\/en-us\/windows\/for... Regards, Didi"]},{"symptom":"Windows Update disabled whiled logged out (Windows 10 PCs)        I have observed that Windows 8 and earlier versions allow Windows Update search, download, and\/or install updates for those PCs connected to internet while no one is currently logged in. However on Windows 10 PCs only when no one is logged in, Windows Update will not check for updates until someone does log in or have the setting \"Use my sign-in info to finish setting up my device\" enabled on that PC. When logging off the session, Windows Update cancels as if something wrong.Did Microsoft have it where users will have to log in on that PC for automatic updates to check?","solutions":["This question seems out-of-scope for these consumer level forums. Try asking on Technet. Start here:https:\/\/social.technet.microsoft.com\/forums\/en-...","This is not for tech this is actually for Windows 10."]},{"symptom":"Windows 10 mail focused inbox wont disable any more        Some how focused inbox became enabled. (probably by removing and re-adding accounts).  Using the standard procedure in settings for disabling focus now does nothing. I have removed and reinstalled the MAIL CALENDAR app to no avail. Any thoughts please.","solutions":["I am glad to help. Let me know if there's anything else. Also when ready please mark the post which helped most as the Answer, to help others. A rating is also appreciated."]},{"symptom":"Windows 10 - Task View        Windows 10 - Unable to clear files on Task View.  Two calls to Geek Squad unsuccessful.  Actually, after the last call, the names of the files accessed do not appear on the screen - just a blank box.","solutions":["Hi Jeannine Open the Settings App (gear icon on your Start Menu) Go to Privacy - Activity History Untick 'Let Windows collect my activities from this PC' Untick 'Let Windows sync my activities from this PC to the cloud' Turn off 'Show activities from accounts' Then click 'Clear' to wipe any data already collected Restart your PC . . ."]},{"symptom":"Disable notification when receving a new email in Windows 10 Start menu        I really want to remove this ''receive New Email nofication''Any solutions?","solutions":["Hi PO Open the Settings App (gear icon on your Start Menu) Go to System - Notifications and Actions On that page, you can turn off all notifications or notifications for individual Apps, like your Mail App . .."]},{"symptom":"Windows Resource Protection found corrupt files but was unable to fix some of them.        C:\\WINDOWS\\system32>sfc \/scannowBeginning system scan.  This process will take some time.Beginning verification phase of system scan.Verification 45% complete.Windows Resource Protection found corrupt files but was unable to fix some of them.For online repairs, details are included in the CBS log file located atwindir\\Logs\\CBS\\CBS.log. For example C:\\Windows\\Logs\\CBS\\CBS.log. For offlinerepairs, details are included in the log file provided by the \/OFFLOGFILE flag.CBS.log: https:\/\/hastebin.com\/ixigeyelug.plAlso I've noticed some bugs.When I go to:Settings > Accounts > Sign-in options - Settings tab freezes and takes longer to be opened again.Settings > Search > Searching Windows - Settings tab closes automatically.","solutions":["Hi Krasimir When you run SFC and it finds errors that is cannot fix, it is then best to run this command, that will take longer than SFC, then run SFC again once this command completes . ..dism \/online \/cleanup-image \/restorehealth","C:\\WINDOWS\\system32>dism \/online \/cleanup-image \/restorehealthDeployment Image Servicing and Management toolVersion: 10.0.18362.1Image Version: 10.0.18363.535[==========================100.0%==========================] The restore operation completed successfully.The operation completed successfully.C:\\WINDOWS\\system32>sfc \/scannowBeginning system scan.  This process will take some time.Beginning verification phase of system scan.Verification 100% complete.Windows Resource Protection found corrupt files and successfully repaired them.For online repairs, details are included in the CBS log file located atwindir\\Logs\\CBS\\CBS.log. For example C:\\Windows\\Logs\\CBS\\CBS.log. For offlinerepairs, details are included in the log file provided by the \/OFFLOGFILE flag.","Can you tell me what does the command you requested me did?","Also I've noticed some bugs.When I go to:Settings > Accounts > Sign-in options - Settings tab freezes and takes longer to be opened again.Settings > Search > Searching Windows - Settings tab closes automatically.","Hi Krasimir Sorry, I was offline . . . Run the command above, that will fix most problems you are having with system files . . ."]},{"symptom":"Windows 10 does not boot        Hello.I have a problem with my Windows 10. I made a mistake, when connected usb mouse to my PC and clicked start button. My PC tried to loaded from this device. When unplugged mouse and tried to switch on my PC. I saw the next messages: \"Reboot and select proper Boot devices or Insert Boot Media in selected Boot devices and press a key\". I unplugged all devices from my PC, checked BIOS, but it did not help.","solutions":["Hi, Wallacepriester28 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"No audio Windows 10        I just reinstalled my Windows 10 to Fresh new Start and had Audio in first sequence of Installed new Windows 10 but when it First downloaded required restart for Display Driver to Install Audio sound has dissapeared. I cansee that many Audio settings are gone and says I dotn have Audio attached to it and i check many times it is ok attached. Help pls","solutions":["Hi, BojanB3 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps. - Press ‘Windows key + I’ together to open ‘Settings’. - Click on ‘Update & Security’. - Click on ‘Troubleshoot’. - Click on ‘Playing audio’. - Click on ‘Run the troubleshooter’. You can also update the audio drivers. https:\/\/support.microsoft.com\/en-us\/help\/402844..."]},{"symptom":"VCRUNTIME140.dll.             I need to find VCRUNTIME140.dll.  I had to run a reset and lost this program and I need to know where can I go to download this program???","solutions":["Hi Henry. I'll be glad to help you out today. VCRUNTIME140.dll is distributed with the Visual C++ runtime. You can download the latest versions here:x86: https:\/\/aka.ms\/vs\/16\/release\/vc_redist.x86.exex64: https:\/\/aka.ms\/vs\/16\/release\/vc_redist.x64.exeAfter installing the runtimes, please reboot Windows. If installing the x64 version does not resolve the issue, you may also install the x86 version. Please come back and let me know whether or not this resolved your issue.More info can be found in this support article: https:\/\/support.microsoft.com\/en-ae\/help\/297700..."]},{"symptom":"Excel 2016 problems after W10 1903 update        As from the moment I installed the 1903 update I keep on having problems with Excel 2016.  When I open Excel, a new worksheet or an excisting one, I may only get this. Not always but frequently. I try to open another worksheet which may open or not and after trying a few times, all seems to be fine again and I can proceed.  I already removed Office 2016 and installed it again, downloaded all updates but nothing seems to permanently tackle this problem. Can anyone help me how to fix this problem ?","solutions":["Try reinstalling Office. Go to Apps and Features scroll down the list until you see Microsoft Office and select the entry. Select Modify and then locate the option to Repair.","Hi Bert, Based on your concern, there's a lot of people experiencing this kind of issue as well.What I can suggest is to rollback the updates: https:\/\/lifehacker.com\/how-to-undo-and-prevent-...And disable your windows update for the mean time, please follow this link for detailed guide:https:\/\/www.cleverfiles.com\/howto\/disable-updat...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","neilpzz,I uninstalled and reinstalled Office 2016 as you suggested. I also set to not allow automatic updates and sofar this seems to help.  I'll monitor the situation a couple of weeks and hopefully this helps. If this works long term, it means that an update in Office 2016 is in conflict with W10 1903 update.  Before 1903 I didn't have any problem.I will post a comment in a few weeks.  Thanks sofar."]},{"symptom":"Blue Screen Error Windows 10 Build 1903        The following is what I got from analyzing the memory dump file. I'm not sure if this is an error with the RAM or a driver. Any help would be greatly appreciated. Thanks!Debugging Details:------------------KEY_VALUES_STRING: 1    Key  : AV.Fault    Value: ReadPROCESSES_ANALYSIS: 1SERVICE_ANALYSIS: 1STACKHASH_ANALYSIS: 1TIMELINE_ANALYSIS: 1DUMP_CLASS: 1DUMP_QUALIFIER: 401BUILD_VERSION_STRING:  18362.1.amd64fre.19h1_release.190318-1202SYSTEM_MANUFACTURER:  LENOVOSYSTEM_PRODUCT_NAME:  80VRSYSTEM_SKU:  LENOVO_MT_80VR_BU_idea_FM_Lenovo Y720-15IKBSYSTEM_VERSION:  Lenovo Y720-15IKBBIOS_VENDOR:  LENOVOBIOS_VERSION:  4GCN38WWBIOS_DATE:  07\/18\/2018BASEBOARD_MANUFACTURER:  LENOVOBASEBOARD_PRODUCT:  Provence-75IBASEBOARD_VERSION:  SDK0J40709 WINDUMP_TYPE:  1BUGCHECK_P1: ffffffffc0000005BUGCHECK_P2: fffff8070bd3f321BUGCHECK_P3: fffffc80b2b099c8BUGCHECK_P4: ffff8b019bed1930EXCEPTION_CODE: (NTSTATUS) 0xc0000005 - The instruction at 0x%p referenced memory at 0x%p. The memory could not be %s.FAULTING_IP: nt!MiDemoteCombinedPte+51fffff807`0bd3f321 498378f001      cmp     qword ptr [r8-10h],1EXCEPTION_RECORD:  fffffc80b2b099c8 -- (.exr 0xfffffc80b2b099c8)ExceptionAddress: fffff8070bd3f321 (nt!MiDemoteCombinedPte+0x0000000000000051)   ExceptionCode: c0000005 (Access violation)  ExceptionFlags: 00000000NumberParameters: 2   Parameter[0]: 0000000000000000   Parameter[1]: ffffffffffffffffAttempt to read from address ffffffffffffffffCONTEXT:  ffff8b019bed1930 -- (.cxr 0xffff8b019bed1930)rax=fffff9fcfe7f3000 rbx=0000001008000001 rcx=ffffb58806a24980rdx=fffff9805ab54c00 rsi=fffff9805ab54c00 rdi=fffffc80b2b0a210rip=fffff8070bd3f321 rsp=fffffc80b2b09c00 rbp=000000b56a980000 r8=8000000000000000  r9=ffffb5880504fb00 r10=0000000000000000r11=fffff98000000000 r12=0000000000000000 r13=fffffc80b2b0a310r14=8000000000000000 r15=ffffb58806a24980iopl=0         nv up ei ng nz na po cycs=0010  ss=0018  ds=002b  es=002b  fs=0053  gs=002b             efl=00050287nt!MiDemoteCombinedPte+0x51:fffff807`0bd3f321 498378f001      cmp     qword ptr [r8-10h],1 ds:002b:7fffffff`fffffff0=????????????????Resetting default scopeCPU_COUNT: 8CPU_MHZ: af8CPU_VENDOR:  GenuineIntelCPU_FAMILY: 6CPU_MODEL: 9eCPU_STEPPING: 9CPU_MICROCODE: 6,9e,9,0 (F,M,S,R)  SIG: 8E'00000000 (cache) 8E'00000000 (init)DEFAULT_BUCKET_ID:  WIN8_DRIVER_FAULTPROCESS_NAME:  svchost.exeCURRENT_IRQL:  2FOLLOWUP_IP: nt!MiDemoteCombinedPte+51fffff807`0bd3f321 498378f001      cmp     qword ptr [r8-10h],1BUGCHECK_STR:  AVREAD_ADDRESS:  ffffffffffffffff ERROR_CODE: (NTSTATUS) 0xc0000005 - The instruction at 0x%p referenced memory at 0x%p. The memory could not be %s.EXCEPTION_CODE_STR:  c0000005EXCEPTION_PARAMETER1:  0000000000000000EXCEPTION_PARAMETER2:  ffffffffffffffffANALYSIS_SESSION_HOST:  LAPTOP-G8PIF92NANALYSIS_SESSION_TIME:  01-09-2020 21:45:30.0355ANALYSIS_VERSION: 10.0.18362.1 x86freBAD_STACK_POINTER:  ffff8b019bed10c8LAST_CONTROL_TRANSFER:  from fffff8070bcb0237 to fffff8070bd3f321STACK_TEXT:  fffffc80`b2b09c00 fffff807`0bcb0237 : 00000000`00000000 fffff980`5ab54b70 00000000`00000003 00000000`00000000 : nt!MiDemoteCombinedPte+0x51fffffc80`b2b09cd0 fffff807`0bcac9e7 : 00000000`00000000 fffffc80`b2b0a310 00000000`00000000 00000000`00000000 : nt!MiAgePte+0x427fffffc80`b2b09d70 fffff807`0bcacea1 : fffffc80`b2b0a310 fffffc80`b2b0a310 ffffb588`00000000 fffff9fc`c02d5aa0 : nt!MiWalkPageTablesRecursively+0x1e7fffffc80`b2b09e30 fffff807`0bcacea1 : fffffc80`b2b0a310 fffffc80`b2b0a310 ffffb588`00000000 fffff9fc`fe6016a8 : nt!MiWalkPageTablesRecursively+0x6a1fffffc80`b2b09ef0 fffff807`0bcacea1 : fffffc80`b2b0a310 fffffc80`b2b0a310 ffffb588`00000000 fffff9fc`fe7f3008 : nt!MiWalkPageTablesRecursively+0x6a1fffffc80`b2b09fb0 fffff807`0bcac62c : fffffc80`b2b0a310 00000000`00000001 00000000`00000000 00000000`00000000 : nt!MiWalkPageTablesRecursively+0x6a1fffffc80`b2b0a070 fffff807`0bcac0b7 : fffffc80`b2b0a310 fffffc80`00000002 00000000`00000002 fffff807`00000000 : nt!MiWalkPageTables+0x36cfffffc80`b2b0a170 fffff807`0bcab7f2 : ffffb587`fa721080 fffff807`00000000 00000000`000b91d0 00000000`00000000 : nt!MiAgeWorkingSet+0x3a7fffffc80`b2b0a690 fffff807`0bcab10a : ffffb588`06a24980 fffffc80`b2b0a950 00000000`00000000 00000000`00000000 : nt!MiTrimOrAgeWorkingSet+0x3b2fffffc80`b2b0a780 fffff807`0bca8d60 : fffff807`00000001 00000000`00000000 fffff807`0c06a3c0 ffffb587`e8444010 : nt!MiProcessWorkingSets+0x1fafffffc80`b2b0a930 fffff807`0beca1b6 : fffff807`0c175ac0 00000000`00000008 00000000`ffffffff 00000000`00000001 : nt!MiWorkingSetManager+0xc8fffffc80`b2b0a9f0 fffff807`0bd8bb65 : 00000000`00000008 00000000`ffffffff 00000000`00000001 00000000`0000012e : nt!MmWorkingSetManager+0x12fffffc80`b2b0aa20 fffff807`0bd2a7a5 : ffffb587`e850b5c0 00000000`00000080 fffff807`0bd8ba10 00000000`00000000 : nt!KeBalanceSetManager+0x155fffffc80`b2b0ab10 fffff807`0bdc8b2a : ffff8b01`9b9b9180 ffffb587`e850b5c0 fffff807`0bd2a750 00000000`00000000 : nt!PspSystemThreadStartup+0x55fffffc80`b2b0ab60 00000000`00000000 : fffffc80`b2b0b000 fffffc80`b2b04000 00000000`00000000 00000000`00000000 : nt!KiStartSystemThread+0x2aTHREAD_SHA1_HASH_MOD_FUNC:  b7db9ad0a77622195141f6732227a097c9448076THREAD_SHA1_HASH_MOD_FUNC_OFFSET:  3dfbe6ca4b6bd95f0428b02d52d5e28fad8ead5aTHREAD_SHA1_HASH_MOD:  38bc5fec3f0409c265cf5c87da6f8f8859d0711cFAULT_INSTR_CODE:  f0788349SYMBOL_STACK_INDEX:  0SYMBOL_NAME:  nt!MiDemoteCombinedPte+51FOLLOWUP_NAME:  MachineOwnerMODULE_NAME: ntDEBUG_FLR_IMAGE_TIMESTAMP:  12dcb470STACK_COMMAND:  .cxr 0xffff8b019bed1930 ; kbIMAGE_NAME:  memory_corruptionBUCKET_ID_FUNC_OFFSET:  51FAILURE_BUCKET_ID:  AV_STACKPTR_ERROR_nt!MiDemoteCombinedPteBUCKET_ID:  AV_STACKPTR_ERROR_nt!MiDemoteCombinedPtePRIMARY_PROBLEM_CLASS:  AV_STACKPTR_ERROR_nt!MiDemoteCombinedPteTARGET_TIME:  2020-01-10T02:08:11.000ZOSBUILD:  18362OSSERVICEPACK:  0SERVICEPACK_NUMBER: 0OS_REVISION: 0SUITE_MASK:  784PRODUCT_TYPE:  1OSPLATFORM_TYPE:  x64OSNAME:  Windows 10OSEDITION:  Windows 10 WinNt TerminalServer SingleUserTS PersonalOS_LOCALE:  USER_LCID:  0OSBUILD_TIMESTAMP:  1980-01-11 10:53:20BUILDDATESTAMP_STR:  190318-1202BUILDLAB_STR:  19h1_releaseBUILDOSVER_STR:  10.0.18362.1.amd64fre.19h1_release.190318-1202ANALYSIS_SESSION_ELAPSED_TIME:  369dANALYSIS_SOURCE:  KMFAILURE_ID_HASH_STRING:  km:av_stackptr_error_nt!midemotecombinedpteFAILURE_ID_HASH:  {51bd6656-a4b2-8d9b-1231-94678dd83b3a}Followup:     MachineOwner","solutions":["Hi, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.We need log files(called dump files) that tell us what lead to crash. Please share them with us for a better analysis of the problem. Instructions can be found here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Please let us know if you need any assistance about posting dump files.","Hi Sumit. I've provided the link to a zipped folder of the dump files below. Thank you!https:\/\/1drv.ms\/u\/s!Appt3qmG-4p62Qdj1QnhoZVeLGKt?e=P7Sl8X"]},{"symptom":"Cursor Customization        I downloaded a custom cursor pack and have the folder of these in my download folder. Whenever I restart my laptop, however, the cursor resets to the default options. When I open the cursor dialogue box, it still has my custom cursors and selecting ok puts them back on. Is there a way to keep my cursor from changing back to the default?","solutions":["Hi Nathan, thanks for posting your question in the community! My name is David, an independent advisor and I am here to help you.For the incident you mention, keep in mind that the cursors you want to use must be in the folder of the following path \"c: \\ Windows \\ Cursors\" (C: represents the disk drive where you have Windows installed) copy and paste the cursors you want to use there and try again. Let me know if the information has been useful or you still need more help, I will be waiting for your response."]},{"symptom":"My laptop won't turn on without me opening the BIOS and selecting the device, constantly.        So, After I got my Dell Laptop and I added an additional SSD to it, a few days later it took a long time to load and then I got a message saying \"Corrupt OS image\", After that I opened my Boot Menu on start up and then chose the devices, Put UEFI on top of Windows Boot Manager and my Laptop properly turned on. I had to do this everytime until a few days later when the issue worsened and the UEFI on top of Windows Boot Manager didn't work anymore. Now I had to repeatedly turn on my laptop, open the Boot Menu, Change the boot options and pray that it would turn on. It usually takes 15 to 20 tries to turn on which around 45 minutes of precious time lost.I tried seeing if it was an SSD issue, it wasn't. Neither was it an issue with my Windows because I completely wiped it, yet the issue remains the same. I scanned all my hardware and all of it works fine, without any issues. ","solutions":["Hi Raja. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Have you tried setting the Windows drive first in Boot order priority in BIOS\/UEFI Setup accessed as shown here:https:\/\/www.mydigitallife.net\/comprehensive-lis...http:\/\/www.isunshare.com\/windows-password\/four-... ?But in adding the SSD the drive booting Windows may have become switched, so Please post a screenshot of Disk Management, which I read like a doctor reads X-rays. Follow the steps here so I can see everything needed to advise you:http:\/\/answers.microsoft.com\/en-us\/windows\/foru... I will be able to tell a lot more about what's happening by seeing the screenshot, along with anything more you can tell me about what has been changed since it worked correctly.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Greg! Thank you for helping.I have already tried setting the Windows first in the boot menu and it did not work, sadly :(Attached below is the screenshot of the Disk Management as you requested.Just to clear things up, I have to constantly open the boot menu using F2 and start the computer constantly until it finally, properly starts up.Hope this helps!","You have an EFI install on Disk1 which looks correct. But a UEFI install to GPT disk format must have only the Window Boot manager set first to boot at all times.  So go into UEFI setup and make sure Windows Boot Manager is set first to boot. While there check the other UEFI settings are correct: UEFI enabled, CSM or Legacy Boot disabled, Secure and Fast boot enabled. Save settings and exit.Make sure you have the latest UEFI firmware Update from the PC maker's Support downloads web page.  Follow the instructions on the Download page and in the Read Me file included in the download to install it.  There can be no power loss during install!If problem persists go into UEFI setup and again take note of the Settings, then Reset firmware to optimal Defaults, save changes and Exit. If any problems go back to check the UEFI settings are correct."]},{"symptom":"Issues with wiFi connection.        For more than a year an occasional issue appears and prevents me from connecting to the net. The Wifi options would fail to connect to the desired network, after three tries the menu would close and remain that way as if switched off. The menu would then refuse to open\/display networks and even going into settings would resolve nothing. The only thing to help seems to be a restart each time.Is there a way around this?","solutions":["Hi, Daniel My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps to repair your Internet connections: Enter the Start menu or by pressing the Win + I key combination, open the Settings and click on the Network and Internet option. Once there, we select the Status option from the menu on the left side and, within the configurations and options that are loaded in the right panel, we have to look for the restoration of the network. When you click on this option, it will show us a new window from where we can restore the network in Windows 10. In this way, all network adapters will be removed and reinstalled, and the original configuration of other network components will be restored. net. This implies that if we were using some software, such as a VPN client or virtual switches, we will have to reinstall them.A process that the system performs automatically by clicking on the Reset button that is now displayed in Network Reset in Windows 10 settings. It is normal for the process to not take long, although we must wait until the end completely and restart the computer to continue with the network configuration in Windows 10 as we have done so far.https:\/\/www.kapilarya.com\/how-to-reset-network-...https:\/\/support.microsoft.com\/en-us\/help\/10741\/...You can also check that your drivers are updated. https:\/\/support.microsoft.com\/en-us\/help\/402844...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"I get Error code (0x80070002) on my windows 10 pro OS        I get Error code (0x80070002) on my windows 10 pro OS every time I try to do an update and it stops installing. I have tried everything I can think of, does anyone know what fixes this?","solutions":["Hi, Robyn My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.If you have problems updating Windows, follow these steps: If you have a third-party antivirus, you must disable or uninstall it. Try reset Windows update components: Right click on the start button and select Powershell (admin) or Command Prompt (admin)Write the next hit enter after each line. net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Restart and try again. You can also download the Windows Error Solver: https:\/\/support.microsoft.com\/en-us\/help\/10164\/...https:\/\/aka.ms\/wudiag You can do it manually by downloading the Windows ISO. When updating with the ISO, disconnect the Internet. https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"Windows Update        We had a pop up sscreen last evening to update windows and we elected to do it at night.  It started around 10:30 p.m. And here it is 12:30p.m. The next day stuck on 90%.  What should we do?","solutions":["Hi, SueBoyd1 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]}]}