{"windows":[{"symptom":"netsh winsock reset        Hi,Wonder if anyone can assist.Have been using a 3 network dongle for a few years and had no problem. But the last time that tried to top-up the dongle to use the it kept getting - error 619 -Did a search and found - netsh winsock reset; followed the instructions below and received a message that the command had been successful and the computer needed to be rebooted. Did that and when the dongle was attached got error 619; port closed.Tried this a couple of times, removed the 3 network and reloaded, turned off the fire-wall; nothing but port closed.Does anyone have any suggestions? Thanks in advance.1. Press “Windows key”, start typing “command prompt” on the start screen.2. “Command Prompt” will appear in the list, now “Right click” on command prompt.3. Click on “Run as administrator”, if you get a UAC prompt click on “Yes”.4. Now type the command “netsh winsock reset”, press “Enter”.","solutions":["Hi north-of-Caspian,specifies the exact model of the dongle because we cannot see it from here ... It also specifies the use of the dongle.","Hi franco d'esaroThe dongle is a 3GZTE MF112 mobile broadband modem USB stickJust use it every now and then, last time was 8 months ago, since then the setting were not changed. Until the issue then the program was deleted and re-loaded with original settings which were the ones always used.","Hi north-of-caspian.try uninstalling \/ reinstalling the connection software of your ZTE MF112 dongle, or go to the manufacturer's website, download and then reinstall the latest available version of the driver for Windows Vista."]},{"symptom":"DVD play software        If I put any disk in my cd dvd drive it does not start, and how to burn a disk","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. 1. To play a CD or DVD: Insert the disc you want to play into the drive. Typically, the disc will start playing automatically. If it doesn't play, or if you want to play a disc that is already inserted, open \"Windows Media Player\", and then, in the Player Library, select the disc name in the navigation pane.If you inserted a DVD, select a DVD title or chapter name. 2. To Burn DVD\/CD: Please refer to the following page and perform the steps. https:\/\/www.groovypost.com\/howto\/burn-files-dat...Note: This is a Non-Microsoft website. However, it is potentially safe. (User's discretion required)"]},{"symptom":"about converting multiple pages to pdf format        YESTERDAY I TRIED TO CONVERT SOME PICS OF MY NOTES IN A PDF FORMAT BUT ITS CONVERTING THEM IN WRONG ORDER.HOW CAN I CONVERT THEM IN THAT ORDER WHICH I WANT","solutions":["Hi DIXITN Are those files image files and are you printing straight from File Explorer? If so, regardless of the naming convention used, WIndows will pick a strange print order . . .It is best to drop those images into an application like Wordpad in the correct order and then print those firm there to ensure the correct ordering . . ."]},{"symptom":"editors suddenly will not save other than in txt format        Hi everyone.Suddenly I am unable to save notepad docs in the save as format. I try, only to discover they are in txt format. I try again, thinking I forgot to select \"all files\" (why ya can't set a preference for saving and opening is beyond me) and oddly, it asks me if I want to replace the file. Not so odd, I suppose because again, it saves in txt.one by one, I download\/install various editors, and I am having the same problem with each of them. I tried with notepad plus, and here is the real head scratchier, it tells me it cannot save it because it is already open in notepad plus. Well, no sheet Sherlock. I'm in notepad plus creating and trying to save it. This occurred out of no where. I'm studying HTML and CSS. One minute my work is coming along fine and the next, my web pages look like they do in the editor. I was going ape, studying my page for an error, only to discover, hours later, that the problem was the format.I've hunted the web with every way of asking the question I can, yet I am seeing nothing. Am Ireally the first to encounter this?","solutions":["Hi Wolfman Notepad is the most basic of Text Editors and lacks a lot of functionality . . . To be honest, if you are studying web design.development, then Notepad++ is a much better choice, it is totally free, it has syntax highlighting row numbering . . .etc. . .https:\/\/notepad-plus-plus.org\/________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","As I said, notepad plus, wouldn't even save. Period.Since something is going on with every text editor I try, the problem is with windows and not an editor."]},{"symptom":"Computer won’t connect to WiFi, nothing is working to fix it        Hi, I have a Windows 10 computer (it is entirely wireless and therefore it does not need an ethernet cable, and it’s not like I have one anyways) that is having the utmost difficulty connecting and staying connected to the internet. You see, whenever my computer is inactive for long periods of time (typically overnight) or when I accidentally make it go to sleep, it decides it wants to disconnect and stay disconnected. It always says that there are no connections available, but everything in the house connects just fine. I have done literally everything to try and fix it. Reset the internet, restart and shut down my computer and turn it back on, attempt to update my driver (physically can’t, I cannot connect to the internet and therefore cannot update) troubleshooting is doing nothing for me. It has been like this for almost afull week.I can’t even contact the help desk because I can’t connect to the internet. Which, is stupid. How can I get help if I need to connect to the internet?? Like, that’s one of the main reasons why people contact the help desk. Why do I need to connect to the internet to use a damn help desk, I should be able to use it without internet.I digress, I am currently uninstalling and reinstalling my driver. Thats my last resort, nothing else is working. I’ve entered in all the fancy codes in powershell and nothing has worked. When I troubleshoot, it says theres a problem with my wireless adapter or access point. Again, I have triedeverything to fix this and nothing has been working. If someone could please help me, I’d greatly appreciate it.","solutions":["Hi NaviSparkles,first of all specify if it is a laptop or a desktop PC. It is always useful to have a network cable available because if the wi-fi does not work for any reason, you can try to access the internet by connecting the PC via LAN.To download Windows drivers or updates you must be connected to the internet.However try to follow this procedure:Go to Device Management> network adapters, select your network adapter in use, click on the Power Management tab, clear the checkbox: Allow the computer to turn off the device to save energy.Click on the Advanced tab, disable any option related to energy saving.Alternatively: Settings> Network and Internet> Status.Click Network Reset on the right side, follow the instructions and read the notes.https:\/\/support.microsoft.com\/en-us\/help\/4000432\/windows-10-fix-wi-fi-problems","Hi, NaviSparkles My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps to repair your Internet connections: Enter the Start menu or by pressing the Win + I key combination, open the Settings and click on the Network and Internet option. Once there, we select the Status option from the menu on the left side and, within the configurations and options that are loaded in the right panel, we have to look for the restoration of the network. When you click on this option, it will show us a new window from where we can restore the network in Windows 10. In this way, all network adapters will be removed and reinstalled, and the original configuration of other network components will be restored. net. This implies that if we were using some software, such as a VPN client or virtual switches, we will have to reinstall them.A process that the system performs automatically by clicking on the Reset button that is now displayed in Network Reset in Windows 10 settings. It is normal for the process to not take long, although we must wait until the end completely and restart the computer to continue with the network configuration in Windows 10 as we have done so far.https:\/\/www.kapilarya.com\/how-to-reset-network-...https:\/\/support.microsoft.com\/en-us\/help\/10741\/...You can also check that your drivers are updated. https:\/\/support.microsoft.com\/en-us\/help\/402844...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"My laptop doesn't show \"Projecting to this PC\" option.        So recently I wanted to project screen from my main pc to my laptop, I checked and realized I don't have \"Projecting to this PC\" option on my laptop.I tried checking if I can enable it threw regedit, but I'm missing the registry key \"connect\", then I tried to check it threw Local Group Policy Editor, but I'm also missing that. I also tried checking if my laptop is Miracast certified with command \"netsh wlan show drivers\", to which it gave me response \"Wireless Display Supported: Yes (Graphics Driver: Yes, Wi-Fi Driver: Yes)\".My laptop has Windows 10 home edition 64-bit.","solutions":["Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.I found an existing article that might help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this helps resolve your concern! Please let me know if you have further questions."]},{"symptom":"win10Enterprise edition Spanish offline installation language pack        Requires Win 10's 1809 version of the Spanish offline installation package The network is not good, it is too difficult to find a link, but the download is barely possible. Thank ","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. i would like to inform you that there is no Offline Spanish Language Pack available.You have to download it from Settings > Region and Language."]},{"symptom":"SP3 stuck at choose keyboard         Opened my SP3 today and it was on the choose  a keyboard. After I choose US it ask for a recover key.  I tried the BitLocker key and that doesn’t work. Tried all the troubleshooting items. Stuck. How do I Resolve? ","solutions":["Hi, Please can you provide a screenshot or photo of the screen you are seeing so we can better troubleshoot the issue?","here are screen shots","Hi, That is a different screen to the one for entering the BitLocker recovery key. This looks like it's either been setup by the user account or the manufacturer. What's the make and model of the device so we can look into it further from that point of view?","Different OEMs may have a number of steps to either retrieve the key or work around this step. For example HP suggests Secure Boot or Trusted Platform Module (TPM) and re-enabling it afterwards.https:\/\/support.hp.com\/gb-en\/document\/c06432394Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Error in attempts to upgrade from Windows 10 1709 to 1903 or 1909        For whatever reason, I have a Windows 10 PC that hasn't upgraded past 1709 and I'm now beginning to use that PC.  To bring it up to date, it has been attempting to download and install 1903 without success.  I consistently get the following message:\"Feature update to Windows 10, version 1903 - Error 0x80070002\"I have tried several things, multiple times, including download the creation tool from here: https:\/\/www.microsoft.com\/en-us\/software-download\/windows10... which give me version 1909.  When attempting to install from the ISO it also fails, with no descriptive message other than my \"system doesn't appear ready\" for the update even though it meets all the requirements.I have validated my version of Windows is authentic:Windows 10 is activated with a digital license.I have boot from the DVD with the ISO and it tells me to reboot to the installed Windows to perform an upgrade.When I boot to the installed Windows and run the Setup.exe from the DVD, it progresses until it tells me my system doesn't appear ready.  (Several minutes in).So, I'm stuck unless I want to totally re-install Windows and blow everything away.  In attempting that path, the 1909 installer would not take my product key, so that doesn't work either.  Am I stuck with 1709 forever?  I'm afraid even if I re-installed from the recovery drive, I may still be in the same position and unable to upgrade further.What can I do at this point?Thank you,Asa  Jay","solutions":["Hi Asa, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.If you have tried Media creation tool recently, Let us check the Installation log to find why the update failed. Please share the logs as mentioned in this article. You should use a File sharing service like Onedrive or Media Fire to upload files and share the link in the next reply.https:\/\/answers.microsoft.com\/en-us\/windows\/for...The Panther logs. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\PantherThe Rollback logs: These usually are created if Windows Update rolls back. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\Rollback[Only if the error code is 0xC1900101-0x30018] The Device Install Log from C:\/$Windows.~bt\\Sources\\Rollback\\setupapi\\setupapi.dev.logAs the log size might be large consider zipping before uploading.","I only found the setuperr.log and the setupact.log, both are fairly small and I don't have any shared cloud space linked from the affected computer so I'm copying at least the setuperr.log contents directly into this post.  The contents of the setupact.log are just a little too long to fit here.  If really needed, I can work tonight (when I have more time) to post them somewhere else.  Please let me know if at least this log provides any clues and what I might be able to do to make this upgrade successful.Thank you,Asa  Jaysetuperr.log:2019-12-30 22:21:19, Error                 DU     DU::CDUSession::Search: Failed to set WU internal configuration property for targeted scans. hr = 0x800700572019-12-30 22:23:08, Error                 CONX   ConX::Compatibility::CIndividualCompatibilityCheckerT<struct ConX::Compatibility::SecureBootCheckerImpl>::OnInvoke: Failed to determine whether secure boot is blocking Setup.. HRESULT = 0x80070002[gle=0x00000103]2019-12-30 22:23:08, Error                 CONX   CSecureBootChecker failed. [] HRESULT = 0x800700022019-12-30 22:23:08, Error                 CONX   ConX::Compatibility::CCompatibilityHost::SetScanResult: Compat scan from provider wsc:setup: failed. HRESULT = 0x800700022019-12-30 22:23:36, Error                 CONX   0xd0000034 Failed to add user mode driver [%SystemRoot%\\system32\\DRIVERS\\UMDF\\uicciso.dll]2019-12-30 22:23:45, Error                 MOUPG  CDlpActionCompat::ExecuteInstallReqScan(2047): Result = 0x800700022019-12-30 22:23:45, Error                 MOUPG  CDlpActionCompat::ExecuteRoutine(651): Result = 0x800700022019-12-30 22:23:45, Error                 MOUPG  CDlpActionImpl<class CDlpErrorImpl<class CDlpObjectInternalImpl<class CUnknownImpl<class ICompatAction> > > >::Execute(493): Result = 0x800700022019-12-30 22:23:46, Error                 MOUPG  CDlpTask::ExecuteAction(3300): Result = 0x800700022019-12-30 22:23:48, Error                 MOUPG  CDlpTask::ExecuteActions(3454): Result = 0x800700022019-12-30 22:23:48, Error                 MOUPG  CDlpTask::Execute(1631): Result = 0x800700022019-12-30 22:23:49, Error                 MOUPG  CSetupManager::ExecuteTask(2582): Result = 0x800700022019-12-30 22:23:49, Error                 MOUPG  CSetupManager::ExecuteTask(2545): Result = 0x800700022019-12-30 22:23:49, Error                 MOUPG  CSetupManager::ExecuteInstallMode(786): Result = 0x800700022019-12-30 22:23:49, Error                 MOUPG  CSetupManager::ExecuteDownlevelMode(392): Result = 0x800700022019-12-30 22:24:12, Error                 MOUPG  CSetupManager::Execute(284): Result = 0x800700022019-12-30 22:24:12, Error                 MOUPG  CSetupHost::Execute(420): Result = 0x80070002","Thanks Asa. Yes, indeed there is a problem but Setupact.log gives us more information why it happened.You do not need to have a cloud service, just use Onedrive which uses same credentials you use here to sign in. To reduce the size you may ZIP it.I look forward to the reply","Looks to me like something is blocking the entire system.  The line about checking for Secure Boot should show asis enabled or is not enabled.Are you running an Anti-Virus or something else blocking access?  Have you put anything in place to block feature upgrades, like some sort of script?Are you running BattlEye?ERROR_FILE_NOT_FOUND2 (0x2)The system cannot find the file specified.You could try downloading and running the SetupDiag utility.  It may help provide some info and other files which may help..https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/setupdiag","Happy New Year,Sorry for the lateness of my reply.  The last two days have been busy for me.I used the SetupDiag program but it returned no information other than:\"SetupDiag was unable to match to any known failure signatures.\"I don't have a OneDrive account set up for public access, so I've uploaded the log files on my personal web site where you can get to them here:asajay.com\/temp\/logs.zipYes, I have Kaspersky Free installed, but I've been Exiting it each time I attempt the upgrade.  I could uninstall it but I don't have confidence that would make a difference.Hopefully the full log file will provide some answers.Thank you,Asa  Jay","Thanks Asa. New year greetings to you too. Looking at the log files indicate secure boot is messing up with the upgrade. 2019-12-30 22:23:08, Error CONX ConX::Compatibility::CIndividualCompatibilityCheckerT<struct ConX::Compatibility::SecureBootCheckerImpl>::OnInvoke: Failed to determine whether secure boot is blocking Setup.. HRESULT = 0x80070002[gle=0x00000103]2019-12-30 22:23:08, Info CONX ConX::Compatibility::CCompatibilityController::ReportData: Type: [0], ID: [10], ReportOption: [0]2019-12-30 22:23:08, Error CONX CSecureBootChecker failed. [] HRESULT = 0x80070002You may try disabling Secure boot in BIOS and try updating again.","Well, that got me further.  I was trying to run the update from DVD with the network turned off.  The system went through more of the installer and actually rebooted the computer.  However, it said it had to roll-back the update for some reason, sorry I didn't copy it down.I'm going to attempt letting it run via the Windows Updater on the machine itself.  It takes a little longer, but it's connected to the Internet.  Maybe it will make a difference?Here are the contents of the setuperr.log, the other log is over 25 MB and I'll upload it if the on-line update fails.2020-01-02 19:43:18, Error                 MOUPG  CFCDCATQuery::RetrieveResponse(311): Result = 0x80072EE7[gle=0x00002ee7]2020-01-02 19:43:18, Error                 MOUPG  CFCDCATQuery::Query(210): Result = 0x80072EE7[gle=0x00002ee7]2020-01-02 19:43:18, Error                 MOUPG  CFCAcquirerDCAT::QueryWeb(881): Result = 0x80072EE72020-01-02 19:43:18, Error                 MOUPG  CFCAcquirerDCAT::Download(1106): Result = 0x80072EE72020-01-02 19:43:18, Error                 MOUPG  CFCPayloadDU::Download(267): Result = 0x80072EE72020-01-02 19:43:18, Error                 MOUPG  DUSetup: Error on downloading SetupDU Payload: [0x80072EE7]2020-01-02 19:43:18, Error                 MOUPG  CDlpActionDU::ExecuteFacilitatorDUSetup(2152): Result = 0x80072EE72020-01-02 19:43:28, Error                 DU     DU::CDUSession::Search: Failed to end the asynchronus search. hr = 0x802404382020-01-02 19:43:28, Error                 SP     pDUSearchAndDownload: DU search failed. hr = 0x802404382020-01-02 19:43:28, Error                 MOUPG  DUSetup: Failed to execute DUSetup seach and download  [0x80240438]2020-01-02 19:43:28, Error                 CONX   Windows::Compat::Appraiser::IsMeteredConnection (207):   Failed to get NetworkCostType assuming metered network [0x80004005].[gle=0x80004005]2020-01-02 19:44:08, Error                 CONX   Windows::Compat::Appraiser::Utilities::SendRequest (1374):   Failed to connect to the internet or send request: [12007].[gle=0x80072ee7]2020-01-02 19:44:08, Error                 CONX   Windows::Compat::Appraiser::Utilities::DownloadCabFile (4355):   Failed to send request using default proxy[gle=0x80072ee7]2020-01-02 19:44:48, Error                 CONX   Windows::Compat::Appraiser::Utilities::SendRequest (1374):   Failed to connect to the internet or send request: [12007].[gle=0x80072ee7]2020-01-02 19:44:48, Error                 CONX   Windows::Compat::Appraiser::Utilities::DownloadCabFile (4366):   Failed to send request using auto proxy[gle=0x80072ee7]2020-01-02 19:44:48, Error                 CONX   Windows::Compat::Appraiser::Utilities::DownloadAndExtractCab (4157):   Failed to download cab file: [0x80072ee7].[gle=0x80072ee7]2020-01-02 19:44:48, Error                 CONX   Windows::Compat::Appraiser::SetupAppraiser::GetAlternateData (3811):   Error downloading or extracting alternate cab, ADL link http:\/\/adl.windows.com\/appraiseradl\/2019_12_05_03_52_AMD64.cab; cab location C:\\$WINDOWS.~BT\\Sources\\Panther\\AltData.cab; Result: [0x80072ee7][gle=0x80072ee7]2020-01-02 19:44:48, Error                 CONX   Windows::Compat::Appraiser::SetupAppraiser::InitializeRunOptions (1357):   Error checking for latest SDB, swallowing: [0x80072ee7].[gle=0x80072ee7]2020-01-02 19:47:01, Error                 MOUPG  CFCDCATQuery::RetrieveResponse(311): Result = 0x80072EE7[gle=0x00002ee7]2020-01-02 19:47:01, Error                 MOUPG  CFCDCATQuery::Query(210): Result = 0x80072EE7[gle=0x00002ee7]2020-01-02 19:47:01, Error                 MOUPG  CFCAcquirerDCAT::QueryWeb(881): Result = 0x80072EE72020-01-02 19:47:01, Error                 MOUPG  CFCAcquirerDCAT::Download(1106): Result = 0x80072EE72020-01-02 19:47:01, Error                 MOUPG  CFCPayloadDU::Download(267): Result = 0x80072EE72020-01-02 19:47:01, Error                 MOUPG  DUImage: Error on downloading ImageDU Payload: [0x80072EE7]2020-01-02 19:47:01, Error                 MOUPG  CDlpActionDU::ExecuteFacilitatorDUImage(1458): Result = 0x80072EE72020-01-02 19:47:02, Error                 CSI    00000001 (F) STATUS_OBJECT_NAME_NOT_FOUND #38# from Windows::Rtl::SystemImplementation::DirectRegistryProvider::SysQueryValueKey(flags = 0, key = 834 ('\\REGISTRY\\MACHINE\\SYSTEM\\Setup'), vn = [l:7 ml:8]'Compact', kvic = 2, kvi = 2, disp = 0)[gle=0xd0000034]2020-01-02 19:47:02, Error                 CSI    00000002 (F) STATUS_OBJECT_NAME_NOT_FOUND #37# from Windows::Rtl::SystemImplementation::CKey::QueryValue(flags = 0, kn = [l:31]'\\Registry\\Machine\\SYSTEM\\Setup\\', vn = [l:7 ml:8]'Compact', ic = KeyValuePartialInformation, info = {l:0 b:}, disp = 0)[gle=0xd0000034]2020-01-02 19:47:07, Error                 CSI    00000003 (F) STATUS_OBJECT_NAME_NOT_FOUND #70# from Windows::Rtl::SystemImplementation::DirectRegistryProvider::SysQueryValueKey(flags = 0, key = 9c8 ('\\REGISTRY\\MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Fonts'), vn = [l:21 ml:22]'Arial Nova (TrueType)', kvic = 2, kvi = 2, disp = 0)[gle=0xd0000034]2020-01-02 19:47:07, Error                 CSI    00000004 (F) STATUS_OBJECT_NAME_NOT_FOUND #69# from Windows::Rtl::SystemImplementation::CKey::QueryValue(flags = 0, kn = [l:69]'\\Registry\\Machine\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Fonts\\', vn = [l:21 ml:22]'Arial Nova (TrueType)', ic = KeyValuePartialInformation, info = {l:0 b:}, disp = 0)[gle=0xd0000034]2020-01-02 19:47:16, Error                 DU     DU::CDUSession::Search: Failed to end the asynchronus search. hr = 0x802404382020-01-02 19:47:16, Error                 SP     CDownloadDUUpdates::DoExecuteInternal: Failed to search for updates. hr = 0x802404382020-01-02 19:47:16, Error                 SP     CSetupPlatform::DownloadDynamicUpdates: Failed to download updates. Error: 0x802404382020-01-02 19:47:16, Error                 MOUPG  DUImage: Failed to execute critical search and download [0x80240438]2020-01-02 19:47:25, Error                 DU     DU::CDUSession::Search: Failed to end the asynchronus search. hr = 0x802404382020-01-02 19:47:25, Error                 SP     CDownloadDUUpdates::DoExecuteInternal: Failed to search for updates. hr = 0x802404382020-01-02 19:47:25, Error                 SP     CSetupPlatform::DownloadDynamicUpdates: Failed to download updates. Error: 0x802404382020-01-02 19:47:25, Error                 MOUPG  DUImage: Failed to execute GDR search and download [0x80240438]2020-01-02 19:47:25, Error                 DU     DU::CDUSession::Search: Failed to set WU internal configuration property for targeted scans. hr = 0x800700572020-01-02 19:47:34, Error                 DU     DU::CDUSession::Search: Failed to end the asynchronus search. hr = 0x802404382020-01-02 19:47:44, Error                 DU     DU::CDUSession::Search: Failed to end the asynchronus search. hr = 0x802404382020-01-02 19:47:52, Error                 DU     DU::CDUSession::Search: Failed to end the asynchronus search. hr = 0x802404382020-01-02 19:48:01, Error                 DU     DU::CDUSession::Search: Failed to end the asynchronus search. hr = 0x802404382020-01-02 19:48:01, Error                 SP     CDownloadDUUpdates::DoExecuteInternal: Failed to search for updates. hr = 0x802404382020-01-02 19:48:01, Error                 SP     CSetupPlatform::DownloadDynamicUpdates: Failed to download updates. Error: 0x802404382020-01-02 19:48:01, Error                 MOUPG  DUImage: Failed to execute driver search and download [0x80240438]2020-01-02 19:48:10, Error                 DU     DU::CDUSession::Search: Failed to end the asynchronus search. hr = 0x802404382020-01-02 19:48:10, Error                 SP     CDownloadDUUpdates::DoExecuteInternal: Failed to search for updates. hr = 0x802404382020-01-02 19:48:10, Error                 SP     CSetupPlatform::DownloadDynamicUpdates: Failed to download updates. Error: 0x802404382020-01-02 19:48:10, Error                 MOUPG  DUImage: Failed to execute FOD search and download [0x80240438]2020-01-02 19:48:19, Error                 DU     DU::CDUSession::Search: Failed to end the asynchronus search. hr = 0x802404382020-01-02 19:48:19, Error                 SP     CDownloadDUUpdates::DoExecuteInternal: Failed to search for updates. hr = 0x802404382020-01-02 19:48:19, Error                 SP     CSetupPlatform::DownloadDynamicUpdates: Failed to download updates. Error: 0x802404382020-01-02 19:48:19, Error                 MOUPG  DUImage: Failed to execute LangPack search and download [0x80240438]2020-01-02 19:48:21, Error                 CONX   Windows::Compat::Appraiser::IsMeteredConnection (207):   Failed to get NetworkCostType assuming metered network [0x80004005].[gle=0x80004005]2020-01-02 19:49:01, Error                 CONX   Windows::Compat::Appraiser::Utilities::SendRequest (1374):   Failed to connect to the internet or send request: [12007].[gle=0x80072ee7]2020-01-02 19:49:01, Error                 CONX   Windows::Compat::Appraiser::Utilities::DownloadCabFile (4355):   Failed to send request using default proxy[gle=0x80072ee7]2020-01-02 19:49:41, Error                 CONX   Windows::Compat::Appraiser::Utilities::SendRequest (1374):   Failed to connect to the internet or send request: [12007].[gle=0x80072ee7]2020-01-02 19:49:41, Error                 CONX   Windows::Compat::Appraiser::Utilities::DownloadCabFile (4366):   Failed to send request using auto proxy[gle=0x80072ee7]2020-01-02 19:49:41, Error                 CONX   Windows::Compat::Appraiser::Utilities::DownloadAndExtractCab (4157):   Failed to download cab file: [0x80072ee7].[gle=0x80072ee7]2020-01-02 19:49:41, Error                 CONX   Windows::Compat::Appraiser::SetupAppraiser::GetAlternateData (3811):   Error downloading or extracting alternate cab, ADL link http:\/\/adl.windows.com\/appraiseradl\/2019_12_05_03_52_AMD64.cab; cab location C:\\$WINDOWS.~BT\\Sources\\Panther\\AltData.cab; Result: [0x80072ee7][gle=0x80072ee7]2020-01-02 19:49:41, Error                 CONX   Windows::Compat::Appraiser::SetupAppraiser::InitializeRunOptions (1357):   Error checking for latest SDB, swallowing: [0x80072ee7].[gle=0x80072ee7]2020-01-02 19:50:33, Error                 CONX   0xd0000034 Failed to add user mode driver [%SystemRoot%\\system32\\DRIVERS\\UMDF\\uicciso.dll]2020-01-02 19:50:40, Error                        [SetupHost.exe]  (WinRE)WinREUseNewPBRImageInternal() PBR image not found. Use the new PBR image2020-01-02 20:00:54, Error                        [SetupHost.exe]  (WinRE)WinREUseNewPBRImageInternal() PBR image not found. Use the new PBR image2020-01-02 20:06:03, Error                        CSetupAutomation::Resurrect: File not found: C:\\$WINDOWS.~BT\\Sources\\Panther\\automation.dat[gle=0x00000002]2020-01-02 20:06:03, Error                 SP     CSetupPlatform::ResurrectAutomation: Failed to resurrect automation: 0x80070002[gle=0x00000002]2020-01-02 20:09:33, Error                 MOUPG  Finalize: Error obtaining Update and Shutdown Key: [0x80070002][gle=0x000000b7]2020-01-02 20:09:48, Error                 SP     BFSVC: Error copying boot debugging files from C:\\$WINDOWS.~BT\\Sources\\system32 to \\\\?\\GLOBALROOT\\Device\\HarddiskVolume4\\EFI\\Microsoft\\Boot (kd_*_*.dll). Last Error = 0x6[gle=0x00000006]2020-01-02 20:09:48, Error                 SP     BFSVC: Error copying boot debugging files from C:\\$WINDOWS.~BT\\Sources\\system32 to \\\\?\\GLOBALROOT\\Device\\HarddiskVolume4\\EFI\\Microsoft\\Boot (kdstub.dll). Last Error = 0x6[gle=0x00000006]","I have uploaded new logs to:asajay.com\/temp\/logs.zipFrom the Windows update history, this is what I'm told:\"Last failed install attempt on ‎01\/‎02\/‎20 - 0xc1900101\"It's late for me tonight and I don't have time to try a coupe other things like totally uninstalling the AV or seeing if it was due to the external CD drive I have installed. But, I have some measure of confidence... we are getting closer.:)Asa  Jay","Thanks Asa, we made progress - the secure boot issue is resolved. But this time the error is different.Can you share the following please? [Only if the error code is 0xC1900101-0x30018] The Device Install Log from C:\/$Windows.~bt\\Sources\\Rollback\\setupapi\\setupapi.dev.log","If you could solve this situation, you could solve several other threads..  Still not sure if this is the result of another failure or is the failure.. Error                 SP     CFinalizeCriticalBoundary::DoExecute:Cannot create hardlink betweeen C:\\$WINDOWS.~BT\\Sources\\SetupPlatform.exe and C:\\WINDOWS\\System32\\OOBE\\SetupPlatform\\SetupPlatform.exe. Error: 0x000000b7[gle=0x000000b7]You might also run the command below and see what it shows.  You have quite a few superseded drivers that might be removed from the system which could cut down on errors.DISM \/online \/cleanup-image \/AnalyzeComponentStoreIf it shows a cleanup is recommended, it will help to run the next command.  It appears you have around 245 superseded packages..DISM.exe \/online \/Cleanup-Image \/StartComponentCleanup"]},{"symptom":"GPU preference for apps        I have NVIDIA GeForce MX 130 GPU in my laptop but still in the graphics settings tab, in the high performance GPU it shows the Intel's integrated GPU. While playing games I want the dedicated GPU to start. How to do?","solutions":["Hi, Is your Nvidia GPU showing up under display adaptors in device manager?","Yes it is.","It's worth making sure your drivers are up to date for your GPU. You can do this from the drivers tab n Geforce experience"]},{"symptom":"Defender Offline and Memory Integrity        Why does everyone just say HOW to start Memory Integrity instead of explaining why those Instructions may not work and why does Defender Offline Scan not work, not finish, not show any result????s...I have asked these questions since December 8th....so I just want to know...as this will be the very last HP I buy and I am done with MS....THERE IS NO CUSTOMER SUPPORT WHAT SO EVER......","solutions":["Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.From your description, I assumed you have reached out previously about a STOP error (blue screen with a 2D bar code) and the error referenced physical memory issues.Am I correct? If so, please provide the STOP error information, your laptop brand and model and when you have purchased your laptop.If not, please provide your previous questions here again as I couldn't find the history of your question.Please let me know if I can help you further!"]},{"symptom":"Z Book BSOD with Second SSD Drive        Hi allI have an issue with an HP Z Book.  It is a new Generation 6 device and came with a pre-installed second SSD drive.All worked fine until I tried to put our corporate image onto the primary OS SSD.Firstly, the new OS installed onto the secondary SSD rather than the primary.So I disconnected\/removed the secondary, recreated the partition on the primary and loaded our stock OS.The machine now works absolutely fine, as long as I do not try to re-introduce the second SSD drive.If I reinstall this, the machine boots up OK for a second or two and then BSOD's.Can anyone suggest the reason for this issue - the BSOD message reported a kernel error.Any ideas on steps to take to resolve this?ThanksPhil","solutions":["Hello! I am an Independent Advisor, I would love to help you out! Did you wipe the second drive completely clean before putting it back in? It could be an issue where perhaps the machine is booting from the second drive.Did you check BIOS to make sure that the boot priority is set to the main drive first?","Hello ThagstromThanks for your interest.I did a quick format on the secondary SSD drive when it was in the problem machine.Looking in the BIOS, the first three selectable options are:Fast bootCD-Rom bootUSB Storage bootAll of these are ticked, but I cannot see a way to drill down futher into the USB Storage Boot option.Phil","Could you send a picture of what you see in BIOS? Generally there would be a boot order option that name specific drives.","Hello ThagstromA pic of the bios screen is available at https:\/\/autode.sk\/2usglGA.As you will see, it simply states USB Storage Boot rather than specific drive details.Maybe I am missing something.ThanksPhil","This looks like boot options, but there should also be a boot order area. It would probably be under the main or advanced tab. Is that not an option anywhere?","Hello ThagstromDon't know how I missed this, but here is the boot order https:\/\/autode.sk\/2R4EQBlClearly the primary SSD M2 drive is the principle boot device.The laptop does boot up fine with the second SSD installed and even gets as far as loading Windows, it just BSODs within a few seconds of finishing the load.  So it is not possible to interrogate the second SSD.I don't believe it is possible to access the second drive from the bios.Is there any other way I can check the status of the second drive?  I do not have any other ZBooks that I can trial it in unfortunately.Thanks againPhil","If you boot from Windows 10 install media can you check to see if there are any partitions left on the second SSD. After USB boot select Install now > Language and then Custom install. See if it shows partitions still on Disk 1. I would think Disk 0 would be the working SSD. But you need to be sure before you delete anything.","Hello NeilpzzWithout the second SSD, the machine boots up fine.This is the disk management detail without the second drive installed https:\/\/autode.sk\/36HoMfy.Does this all look in order?ThanksPhil","Yes but you should boot from install media with both drives connected to see if there is a partition left on the second drive.","Hi NeilpxxThanks for the input.Unfortunately I have run into issues!!I created Windows 10 Installation USB drive.Attempted the process on another (less valuable) laptop and managed to access the drive\/partition info on that device.So I then tried the same on the Z book.To allow booting from USB drive, it was necessary to enable legacy boot option.I did that and saved the BIOS setting (a number was required to be input at this point which was displayed on screen).When I rebooted the device, I got a Bit Locker number entry request.  Now Bit Locker is enabled across the business unit (by corporate IT), but checking in AD Manager, it was showing disabled against the machine I have been working on.So I went back into the BIOS and reset the legacy boot option to disabled.  Fortunately, when I restarted the laptop, the Bit Locker trap did not re-appear.Given the value of this device, I am inclined to leave this for another day rather than brick the machine and make it useless.Thanks to you and Thagstrom, but I need to put this down for a while.I expect that the primary SSD will be sufficient for the user, the additional drive was a \"nice to have\".Phil"]},{"symptom":"I want windows 7 to not end support?        Split from this thread.Out of Windows 10 Minecraft redeem codes? I want windows 7 to not end support?","solutions":["What you want and what you get in life are often two different things.Microsoft makes those decision and we do not work for Microsoft."]},{"symptom":"How do I activate my Minecraft\/Mojang Account after deactivating it?        So just today I deactivated my Minecraft\/Mojang account to delete it from another persons computer. (Which worked great by the way) But when I tried to sign back in it wouldnt let me, saying \"Incorrect password or username\" which makes sense seeing as its deactivated and all. But the question is how do I activate it and log back in or will i never be able to play, Minecraft again??!!! I've spent ages reading articles and searching up many things yet I've still found nothing.Please help!!!!!!Also I have Java Edition not Windows 10 Edition.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. If it was a Microsoft Account and you have closed it, you can Re-open it within 30 days.Please refer to the following page and perform the steps to Re-open the account. https:\/\/support.microsoft.com\/en-in\/help\/452071..."]},{"symptom":"How to set-up Mail on Windows 10 & document settings.        Hello,I have new laptop with Windows 10 O\/S.I am not very familiar with Windows 10 so when I first time setup the Mail on laptop, I did not set it up correctly.(I mainly use Outlook, Yahoo Mail & Gmail).My questions are as below:(1). How do I go back and setup all of my 3  emails on Windows 10?(2). If I delete or uninstall all of my 3 emails would all the 3 email accounts - Outlook, Yahoo Mail & Gmail accounts will also get deleted from my 2 Android mobile phones?(3) In order to setup default program to open & read any document on Windows 10 do I have to have Microsoft Word program downloaded & installed on my laptop? Or document can be opened in Windows 10 by just making proper adjustments in Settings will be enough to open any documents, specially, any word processing documents?Early reply will be appreciated.Thanks.Mehta","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. 1. Please refer to the following page and perform the steps to Add your Accounts in Windows Mail app.https:\/\/support.office.com\/en-us\/article\/set-up...2. If you remove the accounts from Windows Mail app, they will only be removed from this app. Your original Emails will not be affected. Other email applications installed in your phone or any other device will not be affected.3. In order to open MS Word documents you need a program which can open MS Word document files. You can download and install MS Word from Store or use other free applications for the same purpose as well.","Hello, Mr. Arif Ahmed2,Thank you so much for your prompt replies to my questions. It is much appreciated.Mehta","My pleasure."]},{"symptom":"High CPU Usage        I have a number of processes that are using 60% + CPU.Have tried a lot of the fixes on other questions without success","solutions":["Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.It is very hard to determine the cause without diagnosis. But I would suggest these to start with.1. Disable SMBv1: Basically run the powershell command \"Disable-WindowsOptionalFeature -Online -FeatureName smb1protocol\". There is further details here:https:\/\/docs.microsoft.com\/en-sg\/windows-server...2. Disable PS-Remoting.Step by step here: https:\/\/4sysops.com\/wiki\/disable-powershell-rem...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.3. Disable Windows Remote Management from services. You can run these Powershell Commands too:Stop-Service winrmSet-Service -Name winrm -StartupType DisabledPlease let me know if I can help you further!"]},{"symptom":"New device today needs help updating        Can you remote log on get me updated","solutions":["Hi Soldiervfw1 I am sorry, we are not allowed to remote into your PC from here, it is best not to allow that from Community, because you do not know who you are allowing to connect to your PC. . .1 Click your Start Button, type winver and hit Enter On the resulting dialog, what Version No. and build No. of Windows 10 are you running?2 Open the Settings App (gear icon on your Start Menu) Go to Update and Security - Windows Updates What update(s) are showing as pending on your system?"]},{"symptom":"logitech HD310 webcam         when i try to open cam it has error code 0xA00F429F WindowShowFailed (0x800706D9)...can anybody help? tried all the simple fixes ...roll back driver ,update driver ....any solutions please.","solutions":["How are you trying.","Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.You could try the solutions in this link and see if it could work for you https:\/\/www.thewindowsclub.com\/windows-10-cant-...(Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.)I hope this helps with your concern! Please let me know if you have further questions.","thank you","You're very welcome. I hope it works."]},{"symptom":"Changing Administrators in Windows 10!        Hello everyone!  I think I have found the answer to everyone's question... How to change the Administrators Name(s) on Window 10.  I have that problem and I'm the original owner and only person using my computer.  To make a long story short this is what I've found.  Hope this helps or gives you a little idea where to go and look for the info.  I keyed this in my search box, and found the following. (Where is network access in windows 10 )  The 1st one is a list you can select from, the 2nd link is what may help.I just found another one that may be much better than the first two.  (See #3 below)...(1)https:\/\/duckduckgo.com\/?q=where+is+network+access+in+windows+10&bext=wcp&atb=v202-6&ia=web (2)https:\/\/www.tenforums.com\/tutorials\/111783-share-files-folders-over-network-windows-10-a.html(3)https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-networking\/network-permissions-on-windows-10\/60eb5f54-ddfb-45a4-a8e3-632f792f8b1d","solutions":[]},{"symptom":"Windows 10 - screen won't turn off after specified time        See title.... worked fine at first. I had it set to 10 minutes. Now I have to turn my screen on and off manually.***Post moved by the moderator to the appropriate forum category.***","solutions":["Hi,  Thank you for posting in the Microsoft Community Forums. Follow these steps and check the status.-          Access “Control Panel” and click on “Power Options”.-          Click on “change plan settings”. Set “never” for “put the computer to sleep”. This will ensure that the computer does not go to sleep mode. Select couple of minutes for this option “turn off the display”. When you select 1 or 2 minutes for the turn off display, the battery power consumption is also reduced. Once this is done save the settings and check if this helps.Power plans: frequently asked questions:http:\/\/windows.microsoft.com\/en-us\/windows\/power-plans-faq#1TC=windows-8 Please keep us posted on the status of the issue. If it still persists, we would try to assist you further. Thanks. ","From what I can see, there is no control panel in WINDOWS 10. But I went to additional options for the power and sleep. Set my pc to never sleep and my screen to 1 minute and saved. Clocked 3 minutes. Nothing. Is microsoft going to pay for my 21:9 moniter from images being burned into it?????","This happens to me as well.  I've also tried clean boot, disabling all services and startup tasks and nothing helps.  It seems like for some people, this is simply broken.  I've done a complete fresh install of Windows 10 as well. ","For anyone with this problemafter a few days and hours of trying and searching, i found a solution though linustechtips forum.It seems that its something USB related\/connected.someone on Linus forums said that after unplugging his joystick, the timeout for his screens started working again...so i unplugged my Xbox controller and within 1min. my screens went off as they should :)so i guess that something is not working as it should in windows, and the reason for only a few having this problem is that they are using some sort of joystick\/controller and it keep windows 'Active' somehow  Hope this will help a bit :)","Skizofrenx appears to be correct in my case.  I had a Logitech Extreme 3D Pro plugged in.  Unplugged and my displays went dark right when they were supposed to.","Same here, fixed it as soon as I unplugged my game pad.","Date-8-14-2015 after a few hours of looking around and trial and error. Found this on razer site. If you do have a game controller of any type including game pads windows ten has a issue with them. So far this has worked the best for me. Razer orbweaver stealth was not letting my pc sleep, screen saver and screen timer work. Hope this helps..Since I started using Windows 10 my computer will not go into sleep mode and my screen saver mode will not come on.This happens due to a compatibility issues between Joystick devices and Windows 10. To avoid this please disable the game controller device under Device Manager >> Human Interface Device >> HID-compliant Game Controller. However, do note that when you disable the game controller, you might lose virtual joystick related features in Synapse.","Same here, with Logitech Extreme 3D Pro joystick. Installing the most recent drivers, from the manufacturer's site, did no good obviously, since multiple brands of joysticks and controllers, and thus drivers, are exhibiting the same problem.On a side note, I noticed that when rebooting with the joystick plugged in, the OS refuses to see the joystick. Go into Control Panel, and it is not in the Devices lineup. Triggering the search for new hardware will not find it. You must unplug the joystick, and then plug it back in again, to get the OS to register its presence.My point being that while plugged in, in either state (recognized by the OS or not), it causes the monitor to never go into sleep mode, and the system will never go into hibernate mode. Unplug the joystick, and leave it that way, and all is good (even without a reboot), with sleep & hibernate.","Thank you so much!I knew it was something to do with my razer keybaord \/ mouse but your solution to disable HID-compliant Game Controller was brilliant!So brilliant it's actually the first time I reply on posts like yours :)","I had this issue as well and found a fix. While the unplugging the game controllers did resolve the issue, I encountered an issue with my all my USB devices other than my keyboard were running sluggishly and any new USB device I plugged in wasn't recognized by Windows 10. After a reboot I disabled USB selective suspend setting and now I am this issue is completely resolved without the need to plug in and remove game controllers when I am done.The setting can be found at the path below.Start > Settings > Power & Sleep > Additional Power Settings > Change Plan Settings > Change Advanced Power Settings > USB Settings > USB Selective Suspend Setting > Set to DisabledHopefully, this works for all of you as well!"]}]}