{"windows":[{"symptom":"Connect to monitor problems        I am trying to connect my HP 15 TS Notebook to an external monitor, but when I boot up my computer my external monitor won't show anything and it shows 'No Signal.' I have selected this to be my default monitor and have projection settings to Second-screen only, but it still defaults to my laptop screen for bootup. I need my external monitor to be able to see bootup. I know this is possible because I had another computer do it on another monitor. The monitor is connected via HDMI and is an Acer S231HL (https:\/\/www.acer.com\/ac\/en\/US\/content\/support-product\/2253?b=1) I've even tried updating my monitor's drivers via the Acer download page and Device Manager, but it says that 'Windows has determined that the best drivers are installed.'HP Notebook Model Number: 15-r264dxProduct Number: L0T71UABTW: This is only on the bootloader, it shows up after the bootloader loads.","solutions":["Hi Chantelle. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.An external monitor never sees what happens in boot mode, including the BIOS splash screen, until it's handed over to Windows. I know of no exception unless the monitor is built in.It's for this reason all installs and many repairs need to be done on the built-in monitor as the external won't see it until it's installed or repaired.I hope this answers your question.","Hi Chantelle. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.An external monitor never sees what happens in boot mode, including the BIOS splash screen, until it's handed over to Windows. I know of no exception unless the monitor is built in.It's for this reason all installs and many repairs need to be done on the built-in monitor as the external won't see it until it's installed or repaired.I hope this answers your question. Hi Greg, thanks for your input but I've done this on another computer with another monitor and it would view the BIOS and boot just fine.","Then that is highly unusual. There are some possible workarounds for HP to view BIOS on external monitor to try here:https:\/\/superuser.com\/questions\/935375\/how-to-b...https:\/\/superuser.com\/questions\/476933\/cannot-e...https:\/\/h30434.www3.hp.com\/t5\/Desktops-Archive-...https:\/\/h30434.www3.hp.com\/t5\/Notebook-Video-Di...Let me know if any of those work. I'll be here to help until it's resolved.","Then that is highly unusual. There are some possible workarounds for HP to view BIOS on external monitor to try here:https:\/\/superuser.com\/questions\/935375\/how-to-b...https:\/\/superuser.com\/questions\/476933\/cannot-e...https:\/\/h30434.www3.hp.com\/t5\/Desktops-Archive-...https:\/\/h30434.www3.hp.com\/t5\/Notebook-Video-Di...Let me know if any of those work. I'll be here to help until it's resolved. I've tried Fn+F4 at startup and closing lid at startup totry to force to external as well. None work for me. The link you sent me have alot so I didn't read it all-please tell me if I'm missing something."]},{"symptom":"How to stop Windows from older driver updates.        Hello,I am running the latest W10 build (version 1909) with all updates.On one of my laptops with an AMD Vega 3 GPU. Everytime I update the driver to an newer version than 26.20.12037.1000 Windows update reverses me to the version mentioned here. This is rather annoying. I've tried disabeling ''update other MS products'' in Windows update settings.https:\/\/www.laptopmag.com\/articles\/disable-automatic-driver-downloads-on-windows-10 also this linkAnd DDU (Display driver uninstaller) also doesn't solve this. Any thoughts on this?Thanks,","solutions":["No. I will NOT do that.","Hello, Arjan,I'm sorry if you were spammed. I get this impression from your second reply.Are you updating using this link?https:\/\/www.amd.com\/en\/support\/apu\/amd-ryzen-processors\/amd-ryzen-3-mobile-processors-radeon-vega-graphics\/amd-ryzen-3-0","Hello Pat,Yes that's correct. I got an reply within 30 minutes of me posting this question to call some number.Also yes, I downloaded the adrenalin 2020 driver. But Windows keeps rolling me back to the 2019 driver.Arjan","Try downloading the graphics control panel from the Microsoft store. They have a generic one. My issue after updating to 1903 was my external monitor screen would not fit. I go to my Intel graphics control panel it was gone. Windows requires you to obtain an Intel graphics control panel inside the Windows store. I was not informed this would be happening much less instantly."]},{"symptom":"File transfer from old to new computer        How do you easily transfer files from an old computer to new computer in Windows 10?","solutions":["Hi Gail It depends mainly on the amount of files to be transferred . . . You can use a USB Flash Drive, an external Hard Drive, or you can upload the files to the Cloud (OneDrive, DropBox . . etc) on one PC and then download those to the other PC form the Cloud . . .For most purposes, copying your files onto a USB flash drive to transfer files is the quickest and best way, do not cut and copy, just copy, so if anything goes wrong with the operation, you still have the original files . . ."]},{"symptom":"Annoying\/weird audio issue with headphones when plugged into the front jack        No matter what I try and do to fix this, my computer refuses to output audio to my 3mm HyperX headphones. I've tried earbuds that also plug into the front jack of my computer and it still doesn't fix anything. This happens with any kind of headphones with a 3mm plug but the computer works fine with USB headphones, which makes no sense at all. When checking Dell Audio, it says the headphones are plugged in but all I get coming out of the headphones is a cracking and popping noise that randomly occurs on both the left and right channels forever.Here are my specs:PC Model: Dell OptiPlex 3020OS: Microsoft Windows 10 Pro 1903Processor: Intel(R) Core(TM) i3-4130 CPU @ 3.40 GHz, 3400 Mhz, 2 CoresBIOS: Dell A02, 1\/7\/2014RAM: 8GBSystem type: 64-bitDevice: \"Speakers \/ Headphones (Realtek High Definition Audio Device)\"","solutions":[]},{"symptom":"Bluetooth Speakers        I have 2 UE Megabooms that I can pair via Bluetooth with my android app and use them as stereo speakers when I stream music from my phone. Can this be accomplished on my windows 10 PC so I can use them as PC speakers?","solutions":["Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.Depending on your PC if it can support bluetooth devices. If it does, you can check this tutorial for instructions:https:\/\/www.youtube.com\/watch?v=z4wEeRSGmPc(Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.)If your PC doesn't support bluetooth, you can either use a bluetooth receiver\/dongle or can check for wired options as well.I hope this answers your concern."]},{"symptom":"100s of listings of the same device in Bluetooth & Other Devices settings        My LG TV is listed 100s of times in Devices and Printers \/  Bluetooth & Other Devices settings areas. I can remove them, but only one at a time: there's nu multiple select. Any ideas on how to get rid of these without having to do them on at a time???","solutions":["Nothing unusual about that. Every time you connect a removable device it will appear in Device Manager. Even if it's the same device being connected again and again. Not harming your computer in any way.","Thanks for the quick reply! Was more worried about slowing things down, but good to hear. Thanks!"]},{"symptom":"In Windows 10, how do I change the camera view        How can I change the direction of my Camera in Windows 10.  It only give me the front camera view of ME!  There doesn't seem to be a button to turn it the other direction","solutions":["Hi Middy,To switch your camera from the front cam to rear cam, you can select theChange camera button at the top of the screen. As a guide, I included an image of the Change camera button below:Note: If the app can’t find one of your cameras, see Windows can’t find or start the camera.If you have other queries, we’re just a post away.","Hi Marilyn,Thank you for posting in Microsoft Community and being a part of Windows 10.Do let us know if you are you referring to Camera app\/ webcam on your device?If you are referring to Camera app on Windows 10, I suggest you to refer to the Microsoft help article below and check if it helps.Camera app and webcams help(Applies to Windows 10 as well)Hope it helps. Get back to us with an updated status of this issue for further assistance."]},{"symptom":"upgrade to windows 10        I have  windows 7 that on a computer that was built about 8 years ago. Within the last 6 months i get a popup message that says windows is not genuine. I am trying to upgrade to windows 10 but says I need a key number. I know nothing about what to do next can someone help?","solutions":["Did you already upgraded to Windows 10 when it was free offer to upgrade to Windows 10?If NOT you will need to purchase Windows 10 product key and then perform installation. Otherwise, if you already upgraded to Windows 10 when it was free upgrade offer and you go back to Windows 7, you could reinstall Windows 10."]},{"symptom":"How do I turn OFF windows auto update        Windows update keeps trying to update the same update that was installed already. I is a 1 hour process to install and remove when it will not install properly. I have been thru this 6 times and am tired of it! How do I turn it off of limit downloads that I choose to install?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. You may turn on the Metered Connection Settings to limit download of updates. Please refer to the following steps to learn about enabling Metered Connection. https:\/\/support.microsoft.com\/en-us\/help\/402845...","Hello Charles,Using option 7 in the tutorial below with WAU Manager is a great option to disable automatic updates in Windows 10.https:\/\/www.tenforums.com\/tutorials\/8013-enable-disable-windows-update-automatic-updates-windows-10-a.html"]},{"symptom":"Windows 10 Home. Does it have a hidden PC Administrator account?              My computer apparently has a  hidden PC Administrator account. Factory conditions reset 42 times now. Every time I reset with 24 hours I am toast.They take complete control over my computer. Disabling the ability for my cursor to select anything. I change a setting and they change it back when I change splash screens.  They generate fake splash screens that can show and say what ever they want. I have used at one time or another in last 1.5 years THE top 4 malware\/antivirus programs many can buy. I have been an electronic technician for 35 years. I PC enthusiast since 1983 with my KAYPRO II. Directly after recovery; they snag my boot files, begin installing software through a service that is a \"HOST process. They take over as the PC Administrator. This is only on the Windows 10 home editon or just Windows 10 home. This hidden administartor is your intial account when setting up windows in Windows 10 Professional. for Windows Home they have removed the ability to control and privatise your PC and let VHD virtual hard drives, WVM windows virtual Machines. Hiden remotely and or your harddrive, USB unknowling instantly controled and manipulated and a porrtion created on the usb the is very small 200-300 mb. You can not get rid of it. I have 7 usb drives that are forever history. A microcode suceptablity in the INTEL Pentium Silver series N5000 was unknown for up to a 3 year period. This is the processor in my PC. I have hundreds of reasons why they have done this but in my opinion If you install windows home you are going to subit to absolute control of what exactly it is taking over my computer.","solutions":[]},{"symptom":"My USB drives shows either as a generic device or a non-specified device        As the tittle stated, all of my USB drives shows with a \"generic device icon\" in windows explorer, and when im about to remove my device it shows as \"remove \"device\"\", when I plug the device it shows the normal drive icon for a split seccond and then changes to a generic icon, which it doesnt affect the performance of my drives, but makes me suspect that something is wrong on my computer while detecting my usb devices. I've attached some screenshots of this so you can understand me a little bit moreCheers (I apologize if you have a hard time reading the screenshots because my pc is in spanish)PS: Most of my usb drives are made by kingston and it normally shows as \"Data Traveler x.0\"","solutions":["Hi Luis. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Guardian Moderator here to help you.I'll give you everything possible to try for USB dysfunction which we see a lot here:1) Try all other USB ports. 2) Update your Chipset and USB drivers from the PC maker's Support Downloads web page for your full model number, HP Serial Number, or Dell Service tag from the sticker on PC.3) Compare the latest drivers with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now. 4) If no newer or this doesn't help, then go to the USB category in Device Manager, open each Enhanced, Hub and Host controller, from Driver tab select Roll back if available, or if not choose Uninstall.If your keyboard and mouse are USB, first program the power button to effect the needed restart after Rolling back or uninstalling the driver. Go to Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do to choose Shutdown.5) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 6) Run the Hardware Troubleshooter at Settings > Update & Security > Troubleshoot.7) Do you know when this started? If this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here: http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... If this was caused by a Version Update then you can roll it in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 8) If nothing else works then do a Repair Install, by installing Media Creation Tool and then choosing to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... In some cases you can resolve this issue by following these added steps from MS Support:Remove the USB device from Control Panel > Devices and PrintersFrom an elevated Command Prompt type the following and hit Enter: Net stop DsmSvcYou might see the following message: “The Device Setup Manager service is not started.”  This message is expected if the service has already been stoppedType the following and hit Enter: Net Start DsmSvcPlug in the USB device and check if it shows with the correct iconIf the steps above fail to resolve the issue, then follow these steps:Remove the USB device from Control Panel > Devices and PrintersFrom an elevated Command Prompt type the following commands and hit Enter after each one of them:Net stop DsmSvc(You might see the following message: “The Device Setup Manager service is not started.”  This message is expected if the service has already been stopped)Pushd %programdata%\\Microsoft\\Windows\\DeviceMetadataCache\\dmrccache\\en-USRd f4e323bf-0f31-42b6-9ad6-5d5382d3fa83 \/s  \/q(Rd will fail if you do not have that folder. The PushD and Rd commands are only necessary if the simpler Net Stop and Start commands don't resolve the issue.)Net Start DsmSvcPlug in the USB device and check if it shows with the correct icon.There is another way this behavior can be resolved. If a device is 'upgraded' from one version to the next version, the metadata will be rebuilt and the expected icon will return.(Courtesy Paul Seymour MSFT)-------------------------------------------- But remember that in Windows 10 everything depends upon the quality of the install, and Factory or Upgrade installs are inferior installs which most enthusiasts won't even run because they'd expect endless issues. Consider now or later doing the Clean Install in this link which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... There is also an automated Fresh Start that reinstalls WIndows while shedding corrupting factory bloatware, saves your files, but doesn't clear the drive to get it cleanest:https:\/\/www.howtogeek.com\/265054\/how-to-easily-... I hope this helps. Feel free to ask back any questions and let us know how it goes. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Reload of the free windows 10 home        I need to re download the free windows 10 home. where is the link to download the free windows 10 home","solutions":["Hi ladybj76 Click this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), you can create a bootable USB flash drive (min 8GB) using that tool","Hello ladybj76,In addition, here are some other official ways to download a Windows 10 ISO file from Microsoft. The ISO will be able to install either Home or Pro.https:\/\/www.tenforums.com\/tutorials\/9230-download-windows-10-iso-file.htmlhttps:\/\/www.tenforums.com\/tutorials\/2376-create-bootable-usb-flash-drive-install-windows-10-a.html"]},{"symptom":"Cannot connect my Microsoft account to my PS4 account for Minecraft Bedrock Edition        So today the Bedrock Edition of Minecraft was finally released on PS4, which means cross play is now on PS4. Being excited for this, i had my Minecraft updated and too cross play it has you tie a microsoft too your PS4 account so you can cross play. I tied my Microsoft account too my PS4 account, but I wasn’t able to cross play due too my privacy settings. I tried too change those settings, but anytime I went into the privacy tab on my account, I was sent too a help page on how to change my privacy settings. I think my account is a child account, but i don’t know what account is the parent, so i tried to tie a different microsoft account too my PS4, but when i did this, I now cannot even sign into a microsoft account, everytime i hit the button to sign into my microsoft account, it loads for a few seconds then tells me it failed trying to connect my microsoft account because something went wrong. Is there anything i can do too fix this?","solutions":["Thank you so much for making this post I was afraid I was the only one. Now hopefully MICROSOFT can PLEASE GIVE US ANSWERS.","So today the Bedrock Edition of Minecraft was finally released on PS4, which means cross play is now on PS4. Being excited for this, i had my Minecraft updated and too cross play it has you tie a microsoft too your PS4 account so you can cross play. I tied my Microsoft account too my PS4 account, but I wasn’t able to cross play due too my privacy settings. I tried too change those settings, but anytime I went into the privacy tab on my account, I was sent too a help page on how to change my privacy settings. I think my account is a child account, but i don’t know what account is the parent, so i tried to tie a different microsoft account too my PS4, but when i did this, I now cannot even sign into a microsoft account, everytime i hit the button to sign into my microsoft account, it loads for a few seconds then tells me it failed trying to connect my microsoft account because something went wrong. Is there anything i can do too fix this?My one is diffrent it says sign in with a account that is not linked to playstation network. I made a brand new accounts and all did not work kept giving me the same problem please help me ","So glad someone mentioned this as i have been trying for hours and it still isnt working. Is it giving everyone else this exact message.       “We tried to sign you in to your microsoft account but something went wrong”","So today the Bedrock Edition of Minecraft was finally released on PS4, which means cross play is now on PS4. Being excited for this, i had my Minecraft updated and too cross play it has you tie a microsoft too your PS4 account so you can cross play. I tied my Microsoft account too my PS4 account, but I wasn’t able to cross play due too my privacy settings. I tried too change those settings, but anytime I went into the privacy tab on my account, I was sent too a help page on how to change my privacy settings. I think my account is a child account, but i don’t know what account is the parent, so i tried to tie a different microsoft account too my PS4, but when i did this, I now cannot even sign into a microsoft account, everytime i hit the button to sign into my microsoft account, it loads for a few seconds then tells me it failed trying to connect my microsoft account because something went wrong. Is there anything i can do too fix this?","FRQNFTSD","FRQNFTSD FRQNFTSD","https:\/\/youtu.be\/Vi62UMy9QQcthis worked for me, try it out. Was looking for hours and found this video","On my ps4 minecraft bedrock edition  i tried to sign in to my microsoft account anf it said “We tried to sign in to your Microsoft accout,but Something went wrong.” I dont know what do to now i tried so many times to change it but nothing helped.","It wont let me join","https:\/\/youtu.be\/Vi62UMy9QQcthis worked for me, try it out. Was looking for hours and found this video"]},{"symptom":"Windows 10 Pro crashing after 1909 update        I finally updated my copy of windows 10 a couple of months ago and have had persistent instability ever since.  I've been reading forums and trying to figure out what is causing windows to crash and the PC to reboot.  I essentially use this computer as a HTPC that does some media management when the TV is off.  The PC seems to crash right when I turn on the TV.  It is a little intermittent.  The windows reliability app led me to believe that it was a video driver issue.  I have updated every driver I could find after the update, so I don't think an old driver is the issue at this point.  I actually went and installed new video card hoping that it would work better, but that didn't improve the situation.  In fact I think I might be getting some new hardware errors.  The reliability data is below concerning the windows crashing issue that I have been fighting for the last two months...I'm under the impression that the error from 'nvhda64v' is a video card driver issue, but correct me if I'm wrong.  I know people usually want to see the DMP file and that it is usually uploaded somewhere, so let me know how to do that if you want that file.  I'm really hoping for a clear identification of the problem because I am out of ideas given what I thought the problem was.  The PC never crashed before the 1909 update.SourceWindowsSummaryShut down unexpectedlyDate‎1\/‎7\/‎2020 7:20 PMStatusReport sentProblem signatureProblem Event Name: BlueScreenCode: 3bParameter 1: c0000005Parameter 2: fffff8071cf23fb3Parameter 3: ffffee09573a99d0Parameter 4: 0OS version: 10_0_18363Service Pack: 0_0Product: 256_1OS Version: 10.0.18363.2.0.0.256.48Locale ID: 1033Extra information about the problemBucket ID: 0x3B_c0000005_nvhda64v!unknown_function","solutions":["Hi, Can you zip up the minidump files in the C:\\Windows\\Minidump folder and make available (provide link) via a public folder on OneDrive or similar site.Here's a link on using OneDrive: http:\/\/windows.microsoft.com\/en-ca\/onedrive\/sha...If you have problems zipping the minidump files copy the minidump files to another location such as a folder on the Desktop.Also, you do not necessarily have to zip up the minidump files, you can upload them one at a time.","I zipped things up and I believe the minidumps are at the link below.  This evening I stopped using the nvidia HD audio driver and I am just using the windows HD audio driver hoping it will make a difference.  I'm pretty sure that I've tried this before, so I expect it isn't a solution.  I'm not sure which dump file to look at as they probably represent different states of me trying to fix the problem.  Maybe start with the most recent one. Based on my observations, the crash occurs when the TV is turned on.  Something about that seems like the triggering event.  Some interaction happens with the HDMI port on the computer and the receiver that I think causes the crash. I'm hoping something in the crash files will show that.  Ask me questions if you need more details.https:\/\/1drv.ms\/u\/s!AhWgu026KILVhTSHjS_X1D2QHSkS?e=K6pzwn","If that is the case then might as well Uninstall the update. Check the steps below to uninstall the recent update that is causing the issue.1. Run Powershell as administrator2. type \"wmic qfe list brief \/format:table\"    ###This command will display all the system updates installed on your windows 10,(make sure you dont add double quotes in the powershell)###3. then type \"wusa \/uninstall \/kb:4497464\"   ###Replace the kb and the number with the recent update you had on your win10###4. Dialog window prompt will pop up on your screen and you just have to click Yes and that will make the update permanently disabled or gone in your system!","The minidump files showed a consistent SYSTEM_SERVICE_EXCEPTION (3b) caused by the nvhda64v.sys:BugCheck 3B, {c0000005, fffff8071cf23fb3, ffffee09573a99d0, 0} *** WARNING: Unable to verify timestamp for nvhda64v.sys Probably caused by : nvhda64v.sys ( nvhda64v+3fb3 ) There may be other drivers at play. Can you provide the following file which has more information on the crash: C:\\Windows\\MEMORY.DMP The memory.dmp file will be quite large, you could zip and compress the memory.dmp file with a third party application such as 7-Zip.","The problem isn't with just a routine update.  This was the version update to 1909.  I have to roll back the version of windows to a version they are going to stop supporting or something like that, which isn't really an option.  I wouldn't have bothered updating if Microsoft wasn't pushing everyone to update.","See the link below...https:\/\/1drv.ms\/u\/s!AhWgu026KILVhTW7UQVbid4x8DqV?e=GIrqGn","There is no direct evidence but it may be the emBDA64.sys causing the issue as the ksthunk.sys and portcls.sys are crashing.That may indicate a third party audio capture driver is the issue. Can you uninstall the device and software that installed the emBDA64.sys which may be a USB audio device.","Hmmm...that sounds interesting.  I'm actually not entirely sure what device\/software emBDA64.sys is referenced to.  Is there any information in the memdump that might indicate that?  I'm guessing at this point that the Hauppauge video capture USB device might be what is having a problem.  I really just can't think of anything else.  I don't actually use the Hauppauge device, but it is installed and it was installed before the update.  So, maybe the old software doesn't play nice with a newer version of windows.  I never really got it working and abandoned it a while back, so it's not a problem to remove it.Other USB devices include dongles for wireless keyboard\/mouse, PS3 controller (for charging not for playing), and the Hauppauge video capture.  When I get home tonight, I'm uninstalling the Hauppauge device and seeing how that goes.  If there are any other suggestions, thanks in advance.","It could very well be the Hauppauge device. In the Device Manager if you double-click the Hauppauge device > Driver Details Does it list the emBDA64.sys as a driver? Also, if you re-enable the NVIDIA audio after removing the Hauppage device and driver does it still crash?","I removed the Hauppauge software\/drivers first thing this evening and didn't see the suggestion to see if it was using the emBDA64.sys driver beforehand.  I won't probably know whether this was the culprit until sometime tomorrow morning.  It usually requires some time with the display off and turning it back on for the crash to occur.  Fingers are crossed that it doesn't crash.  I think the Hauppauge software was old, so I believe there is a decent chance it was the problem.  I'll report back tomorrow."]},{"symptom":"cant launch certain apps, keep getting kernelbase.dll error        as of 4 days ago i can no longer open osu, discord, or tabletdrivergui. when i click on them, they show up in task manager for half a second, then two errors appear in eventviewer:Application: osu!.exeFramework Version: v4.0.30319Description: The process was terminated due to an unhandled exception.Exception Info: System.OutOfMemoryException   at #=zfJ9zAT7nDD42z$NcsA==.#=zxVmq$$w=(System.String[])   at #=zfJ9zAT7nDD42z$NcsA==.#=zlDSXfpM=()   at #=qXQMuiY2x1vw02Zd9pmV2TmxE_$5QQr_2TdaFlCpGUA0=.#=zDSGh9ZY=()Faulting application name: osu!.exe, version: 1.3.3.7, time stamp: 0x5e0f8cfcFaulting module name: KERNELBASE.dll, version: 10.0.14393.2189, time stamp: 0x5abda7d6Exception code: 0xe0434352Fault offset: 0x000daa12Faulting process id: 0x42a0Faulting application start time: 0x01d5c8b9d30c7643Faulting application path: C:\\Users\\omphen\\AppData\\Local\\osu!\\osu!.exeFaulting module path: C:\\WINDOWS\\System32\\KERNELBASE.dllReport Id: c43d13e1-8d3b-4fd5-a4b4-4e3a7968758bFaulting package full name: Faulting package-relative application ID: ive tried running \/sfc scannow which has found nothing wrong, i cant uninstall .net framework nor can i install the latest version as it is already installed.","solutions":[]},{"symptom":"Red Screen at Startup        Most days at startup (from sleep mode) I get a series of colored screens. Always same colors of red\/green\/blue\/yellow and white. No messages, no warning codes, etc. Turn off the computer and reboot and all is good. I have a desktop HP with the computer and monitor all built in. Have the latest Windows operating system. This has gone on for months. Usually at open in the morning and sometimes again during the day if been \"asleep\" for a few hours. Tried talking to both HP and Microsoft cust serv techs. They have tried options but still have the issue.Anyone else having this type of issue where you get the screens of death but no issue at all with your computer or operating system? ","solutions":["Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.This tutorial can give you possible steps to troubleshoot the issue https:\/\/www.youtube.com\/watch?v=HWugyoWqjqA(Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.)If it doesn't work, I found an existing article with the same issue as you're having. You can check sdonaldsonjr's answer and see if it can help or somehow give you info on what you're experiencing.https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this helps with your concern."]},{"symptom":"picture thumbnails        I am on Windows 7 Ultimate (32bit). On opening up a folder containing pictures Iused to see individual individual JPEG thumbnails but these have disappeared recently and now only blank icons appear which need to be clicked upon individually before seeing the images. I have tried resetting defaults (currently set for Windows Photo viewer) but they only affect the actual pictures not the thumbnails.","solutions":["Click on tools and Folder Options and then click on View tab and there is option statingDisplay file icon on thumbnails make sure it is checked and if not check it and press okay.If it is already checked, then uncheck it and press okay and then go back to same location and check it."]},{"symptom":"OS is completely non-functional        So last night I started up my computer and almost immediately upon reaching my desktop, the system froze then gave me the bsod. Upon restarting, it automatically launched the windows automatic repair tool. It was making slow progress for a while, but upon some googling, I decided to let it run overnight. When I woke up this morning, the repair tool must have finished, because it was stuck at the motherboard boot screen that pops up before Windows loads. No inputs did anything, I couldn't reach the BIOS or drive selection so I restarted the system and this time it gave me a black screen after the motherboard boot screen and stayed there. At this point I tried nearly every troubleshooting guide under the sun and nothing will work. I have messed with  the boot options in the BIOS, reset the BIOS to default, I can't boot windows in safe mode, I have tried reinstalling from the installation disk, I have tried all the troubleshooting options that \"repair your computer\" gives you off the installation disk, it just tells me that it can't perform the System Restore, Startup Repair, I can't uninstall either feature or quality updates, it can't find any system recovery image files. Now when I try to boot the system it tells me \"A disk read error has occurred, press ctrl+alt+de to restart\" but restarting just puts me back in the same place. I have been following troubleshooting guides and messing with every option available to me, but I have only been making backwards progress and now absolutely nothing is working to the point that most troubleshooting isn't even an option because there's so little my system will do.","solutions":[]},{"symptom":"Your Version of Flash Player might be outdated        Why am I getting the pop up, \"Your Version of Flash Player might be outdated....When I get it the address bar has info that its' from a site called 'unifiedinstaller.com . Please help me stop it and if it's connected to something that can be uninstalled on my system. I'm not tech smart and at 70yrs old and it's hard to understand everything about these systems. Thank youBarbara.  ","solutions":["Hi Barbara Well done for being suspicious, those Flash Player popups are generally trying to get you to install malware on your PC and as you noted, that link address does not lead to the official Adobe Flash Player download web page . ..Most likely you do not have malware on your PC, those popup are very prevalent on some websites . . .You can if you wish run a full system scan with Windows Defender or your preferred Anti-virus, but to be honest that will most likely find nothing . . .","Why am I getting the pop up, \"Your Version of Flash Player might be outdated....When I get it the address bar has info that its' from a site called 'unifiedinstaller.com . Please help me stop it and if it's connected to something that can be uninstalled on my system. I'm not tech smart and at 70yrs old and it's hard to understand everything about these systems. Thank youBarbara.  Hello Barb, With no disrespect meant towards this great community, may I suggest the following forum which specializes in the removal of all sorts of intruders on your computer.  https:\/\/www.landzdown.com\/index.phpFollowing the log postings instructions may seem overwhelming but if you have trouble following the instructions, simply ask for help. Happy New Year and best wishes.P.S. I'm 67 and probably know much less than you! lol","> Remove the Your Flash Player could be out of date Scam If you can't close your browser in a normal way: Open Task Manager (press Ctrl + Shift + Esc on your keyboard) and in the tab Processes end all browser processes.A good ad blocker should prevent pop ups\/fake warnings\/alerts\/ads etc. Tracking blockers help too.I use and recommend the free extensions uBlock Origin and Ghostery.Most browsers offer the same or similar extensions...  Also go through your browser's settings and adjust them to your wishes. For example, block 3rd party cookies etc.You might also want to reset your browser(s), see if you have any weird extensions\/add-ons...You might want to read: How to tighten security and increase privacy on your browser - Malwarebytes Labs | Malwarebytes Labs and Answers to common security questions - Best Practicesespecially Beware of Phony Emails, Phone Calls & Tech Support Scamswhich explains various methods how to get out of those fake alerts etcincludes Resources to protect your browser, privacy & help prevent browser pop-up ads and scamsexplains what to do when you keep on seeing these fake sites\/getting pop-ups etc despite having followed the above mentioned advices.Also:Protect yourself from tech support scamsTech support scamswww.microsoft.com\/reportascamhttps:\/\/blog.malwarebytes.com\/tech-support-scams\/:","Thank you for responding, I did a full Norton scan and it still continued, so I did a hard shut down of my computer and haven't seen it sense. I also went in and  uninstalled 'Internet Explorer 11' which I have no clue how that ended up on my system along with McAfee and Yahoo...strange. But anyway thanks again, have a great weekend. :) ","Thank you for your response, I would never be able to understand all that you suggested I should do.I believe I have resolved the issue.Thank you and have a great day.   ","Thank you , I have been able to fix it, I hope anyway.Have a great weekend and Happy New Year :) "]},{"symptom":"CPU AT 100% WHEN I OPEN TASK MANAGER BUT GOES DOWN AFTERWORDS, WHY?        So for some reason everytime I open task manager my cpu starts at 100% and then goes down intimately. It does this every single time. Its been doing this for a while now and I dont know if its a bad thing or normal. I've just recently reset my whole pc for personal reason and it still does this. I ran programs like malware byte and such and still no solution. If you guys have any reason to why its doing this please help.I uploaded an unlisted video showing what im talking about https:\/\/www.youtube.com\/watch?v=LJdxHpYOMFE   ","solutions":[]}]}