{"windows":[{"symptom":"Taskbar question        on one PC I've got both a taskbar short cut to Windows Explorer and one to Documents. On new PC the File Explorer is on taskbar but when I try to put the Documents shortcut there it won't allow. Just get a 'Pin to File Explorer' option and the folder won't appear like it did on my other PC.This is a screenshot of my other PC with both shortcutsHow do I accomplish this?Thanks","solutions":["The Winaero fix worked for me and others several times. You can trust it."]},{"symptom":"Microsoft Context Menu \"New\" option is acting slow        So, I had this issue for a while now, and I was wondering if something was corrupted in the registry files.Also, this is not about the WHOLE Context Menu being slow, it's this one option named \"New\" that is taking a lot of time to load, and I was wondering if there is a fix for this.","solutions":["Hi ShayIsNear and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.Fix a Slow Windows 10 Desktop Right-Click (Context) Menu https:\/\/www.guidingtech.com\/fix-slow-windows-10...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I already tried this.","Hi ShaylsNear, I will release the question for other experts come to give his opinion, I am sorry not to find the problem.Thanks!","Hi ShaylsNear My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Click on Start, type powershell, right click Windows Powershell and then run as administratorEnter the following commands (copy and paste) and press enter after each one (it may be worth doing one at a time to see if there is any difference)Get-AppxPackage *zune* | Remove-AppxPackage Get-AppxPackage *sketch* | Remove-AppxPackage Get-AppxPackage *photos* | Remove-AppxPackage Get-AppxPackage *wallet* | Remove-AppxPackage Get-AppxPackage *solitai* | Remove-AppxPackage Get-AppxPackage *bing* | Remove-AppxPackage Get-AppxPackage *help* | Remove-AppxPackage Get-AppxPackage *3d* | Remove-AppxPackage Get-AppxPackage *reality* | Remove-AppxPackage Get-AppxPackage *office* | Remove-AppxPackage Once these apps are removed, wait a few seconds until you can see that the Windows taskbar flickers for a tiny moment. That is the sign that Windows's Explorer acknowledged these changes. Now you can try right clicking and select \"New\". Depending on the PC's processor speed, the delay is now either non-existent or at least greatly reduced.Side note: The first three apps in the lines above cause the longest delays. Hope this helps.","Will it like LITERALLY uninstall the apps? I have a few of these that I actually use.","Yes this will remove the apps. I would recommend removing one by one and seeing if the issue is resolved. If not you can always re-install."]},{"symptom":"can't find script file UBJA5VF2F3.wsf        Every time when i connect my charges, above message showing, the same message comes even when i try another charger, what is this issue is and how to resolve the issue, please help.....","solutions":["Hi A. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) Download, install and run a full scan with the most powerful on-demand free scanner Malwarebytes:https:\/\/www.malwarebytes.com\/mwb-download\/.In the Scan Settings first set it to include scanning for Rootkits. If necessary run it in Safe Mode with Networking, or Safe Mode accessed by one of these methods:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... Clean up anything found, restart PC and then run again until it comes up clean. Check for any remainders in Settings > Apps > Apps & Features, and also in each of your browser's Extensions, Home Page settings, Search service or Add-On's as shown here:https:\/\/community.box.com\/t5\/How-to-Guides-for-... Then check for damaged System Files: https:\/\/www.lifewire.com\/how-to-use-sfc-scannow... If it cannot repair them see Step 10 here to continue: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If you want to keep Malwarebytes as an on-demand scanner then you can turn off its Real Time trial version in it's Settings > Account Details tab.2) Take the PC and charger to a shop to have it tested as it may be the wrong charger generating this error. The shop will have a universal charger that fits your device and then you'll see if it still occurs. If not they can help you get the correct charger and may have it on hand. I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Repeated crashes due to Netwtw06.sys failure        My ASUS laptop downloaded and installed the latest Windows 10 updates (on August 31) after which my laptop crashes within 5-10 minutes of use. The stop code error message I get is PAGE_FAULT_IN_NONPAGED_AREA. What failed: Netwtw06.sys.I collected my system information and DMP files here:Log files from system crashCan anyone help me?","solutions":["Hi Richard I am Vijay, an Independent Advisor. Netwtw06.sys is Intel wireless driver. You can update it to latest from computer maker's site. If there are other causes, I need to identify them through mini dumps.Looks like you missed adding link to dump file. Please add the link preferably sharing through Onedrive.HOW TO UPLOAD TO ONEDRIVE 1. Login to https:\/\/onedrive.live.com\/ utilizing the same Login ID and Password which you have used on this forum. (or use the installed Onedrive on your computer)2. Click Upload in the top OR drag and drop the file here. 3. After uploading, right click the file and choose share. 4. Click Copy Link. 5. Copy the link and paste the link here.","Hi,BugCheck 50, {ffffc8d37d50d700, 2, fffff8077cef27f3, 2}Probably caused by : Netwtw06.sys ( Netwtw06+2f27f3 )Netwtw06.sys is the Intel WiFi driver so first try updating that.Intel Driver and Support Assistant <-- run this after checking with System\/Motherboard Makerhttp:\/\/www.intel.com\/p\/en_US\/support\/detect?redirector_count=1&Intel Download Centerhttp:\/\/downloadcenter.intel.com\/Intel - Supporthttp:\/\/www.intel.com\/p\/en_US\/supportIntel - Forumshttps:\/\/forums.intel.com\/s\/?language=en_USLet me know if that helps,Rob","Did you click above on \"Log files from system crash\"? That link works for me.","Yup got them. In my interface, it didn't appear as link.","One file was of 0 byte. Remaining 4, I analyzed. A. Analysis Results File Name: 090119-34093-01.dmp PAGE_FAULT_IN_NONPAGED_AREA (50) *** WARNING: Unable to verify timestamp for Netwtw06.sys IMAGE_NAME: Netwtw06.sys File Name: 090119-37812-01.dmp PAGE_FAULT_IN_NONPAGED_AREA (50) *** WARNING: Unable to verify timestamp for Netwtw06.sys IMAGE_NAME: Netwtw06.sys File Name: 090119-42656-01.dmp PAGE_FAULT_IN_NONPAGED_AREA (50) *** WARNING: Unable to verify timestamp for Netwtw06.sys IMAGE_NAME: Netwtw06.sys File Name: 090119-43343-01.dmp PAGE_FAULT_IN_NONPAGED_AREA (50) *** WARNING: Unable to verify timestamp for Netwtw06.sys IMAGE_NAME: Netwtw06.sys B. Third Party Drivers Netwtw06.sys - Intel Wireless driver Driver date - Wed Apr 25 02:09:01 2018 C. Recommendations a. Create a system restore point first so that if something wrong happens you can revert.Type restore point in Cortana Search > Create a Restore point > Check whether against your drive, Protection is ON or not. If not ON, click Configure button below to Make it ON > Now press Create to create a restore pointb. Your Intel Wireless driver is of date 25-Apr-18. Update it to latest from computer maker's site \/ Intel site.If you need help, Windows Key+x > Device Manager > Expand network adapters > Double click Intel Wireless driver > Driver tab > Post the screenshot here.","Vijay and Rob,Updating the driver appears to have done the job.Thanks.","Happy to help! Rob","Go to the Intel website and search for the \"Computer Driver Scan\" and download it.  When you run it you will see the driver it Identifies as a problem.  It will link you to the updates.  The problem I had was caused by the Intel Wireless Driver and this process fixed it.","Yes, to be clear, Rob had this correct first.  My Gigabyte Aero 15X laptop was continually crashing to the Windows blue screen and giving a code reading \"netwtw06.sys\" (see picture below).  After repeated crashes and trial and error fixes - no more \"blue screen of death.\"  So, if you are having this issue, do this, specifically:Save everything and backup what you feel you need to.Go ahead and close everything except your browser.Download the Intel Driver Support Assistant at: https:\/\/www.intel.com\/content\/www\/us\/en\/support\/intel-driver-support-assistant.html Once the Intel software downloads, install it and run it.  It will show several items on your system - many of which will be intel hardware\/software products.  Likely, several of those will require driver updates.Run the updates.Once the updates are complete, restart.Enjoy a crash-free computer!PS:  I though I could just go to my device manager and find the device with an outdated driver, right click, and update it - that does NOT work.  It does not detect the new driver.  The intel software does.  That's why you need it.","Feel free to mark the post that provided the Answer and to provide a rating if you wish. Those help others find the correct Answer.Glad to have helped.Rob (in my other persona)"]},{"symptom":"Lenovo W540 WINDOWS 10 HDMI output ISSUE => UNRESOLVED        Dears,since 6 months I noticed a really annoying issue. When I connect my W540 to HDMI to a TV or a projector, the audio doesn't work.I have to uninstall and reinstall audio drivers, but as soon as I make an hot HDMI plug (through ultra dock station or miniDP connector), sounds disappears and I had to swear to get it back. if it gets back, because with the projector it will never come back.I use a really long HDMI cable (> 5m, but this should' t be an issue).Tried to update K21000 driver to the last version https:\/\/support.lenovo.com\/us\/en\/downloads\/ds037793Tried to unplug the W540 battery.I am quite desperate and unable to resolve this issue !!!Tried all options here but NONE working https:\/\/support.microsoft.com\/id-id\/help\/4520288\/windows-10-fix-sound-problemsSound comes after each reboot. After the 2nd HDMI hot plug sounds disappear. That's weird and crazy !Tried to reduce the screen resolutionI hope somebody can help me in resolving definitively this issue.I read several post but none provide an effective solution.I am bored an frustrated.https:\/\/www.youtube.com\/watch?v=b9B_0R5MIuQhttps:\/\/www.youtube.com\/watch?v=7AAHBMx1UWI&t=134shttps:\/\/www.youtube.com\/watch?v=fSiHz9zWPN4https:\/\/www.youtube.com\/watch?v=-dbi6qu-gXU https:\/\/www.youtube.com\/watch?v=scD69vXOJLkhttps:\/\/i.ytimg.com\/an_webp\/T1ccTce37Lg\/mqdefault_6s.webp?du=3000&sqp=CIjZ0u8F&rs=AOn4CLBXxRwk8cjS7z...I have this question too","solutions":["That's weird !"]},{"symptom":"My acer laptop keeps shutting down at the acer boot up screen        I have an acer aspire 3 a315-21, that keeps shutting down when I try to boot up. If I hold a button down while it boots up the screen stays on, but if I let go it turns off within seconds.","solutions":["Hello Jay, this is Roman, I'm a independent adviser. How \/ When did the problem start? Did you install Hardware \/ Software? Here are some actions you can try: Do you habe any USB Devices Plugged in (if yes: remove them and retry booting) First try to boot into save mode - it it works it may be a driver problem. Before the Windows logo appears, press F8 to access the Boot Options menu. In the menu select \"Safe Mode\".When \/ If \"Save Mode\" works check for updates and Drivers. best regards, Roman","It just started tonight. The battery died while I was watching a movie but after I plugged it in it wouldn't boot up it kept shutting down. Even after it was fully charged ","Can you access the secure boot like described above?","Yes, but the screen is still shutting off while I'm trying to solve the problem ","What's happening when the screen shuts off? Is the power going down, are any lights on the laptop on or is it like it is turned off?How does the screnn shut off? What do you see - how far can you go on until the screen shuts off?I'm asking you because i fear that this may be a hardware issue? best regards, Roman","Everything goes off when it shuts down the screen and lights. It just goes off it doesnt make it pass the acer boot up screen unless I'm holding down a key on the keyboard, but once I let go it goes off.","I think this issue is hardware related. Maybe someone else has a better idea... but I don't think I can help you with this issue...best regards, Roman","Hi Jay, Upon checking the thread, did you already tried removing your battery and directly plug it using the charger and try to boot again?Please let me know if this helps. Thanks and regards,","Had trouble with my acer shutting off before windows would load ran the restore and nothing would fix it then went into bios menu and moving the boot from network up to the top of the list has fixed my loading windows problem but i dont know much about why it helped and why the problem started all of a sudden ,but has been working since good luc","How do I do that?"]},{"symptom":"my spacebar is broken        every time I press the spacebar it activates caps lock. how do I fix this?","solutions":["Hi aidan32423423 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.1. Press the Windows key, type in \"Settings\" press enter. 2. Click \"Update & Security\". 3. Click \"Troubleshoot\". 4. Select \"Keyboard\". I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"No wifi        Can anyone tell me how to hook Wi-Fi up to this PC just got did I have internet drivers on it so cannot update any ideas of more than welcome please can post here or email me at jrotten76@Outlook. Thank you ( was running Windows XP Pro when got it did upgrade with USB to Windows 10 home need to get drivers installed somehow","solutions":["Hi Jon If that PC was originally Windows XP, most likely you will not be able to get WiFi card device drivers for Windows 10 due to the age of that PC . . .However, we will try, what is the Make and exact Model No. of your PC - that will be printed on a sticker on the bottom casingOpen Device Manager (accessible by right clicking your Start Button) Expand the Network Adapters section What WiFi (WLAN) device is listed there?","hp  {invent} a6000   hp pavilion a6213w.  system# GN558AA","Hi Jon There is absolutely nothing coming up on the HP website for those numbers, is there a Serial number on the bottom casing?","Prod# GN558AA. SN# CNH7471H92What","SN# CNH7471H92.  (no what)","Hi Jon I am sorry, there is absolutely no drivers available for that model, HP no longer store drivers for that on their website . . .The only option if you want to keep Windows 10 on that PC is to purchase a new network card that would be compatible with Windows 10, but honestly, if you open Device Manager (accessible by right clicking your Start Button) I would say there are also more drivers missing then just the network card - do any of those devices have an exclamation mark beside them?","they do not. but I have NO kind of internet connected to the pc. I thank you for your time","is there any way I can share my laptop wifi with it wit no drivers or anything??","Hi Jon No, if there is no WiFi card visible to Windows, it cannot receive a WiFi signal A very cheap way to resolve this would be to purchase a USB WiFi dongle, they are available form $5+ on the web . .https:\/\/www.amazon.co.uk\/s?k=tp+link+usb+wifi+a...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","thank you will do"]},{"symptom":"Toshiba satellite black screen        Toshiba stuck at \"Leading Innovation\" screen.After starting a system reset, I came back to a message saying \"error: System reset unsucessful\" or something similar to that. Now when it tries to boot it just puts up the product screen, goes black, then brings up the screen again. I cant get into any BIOS or any other menus, and no keys are working. ","solutions":["Hi, hamkas My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Windows 7 to Windows 10 upgrade... it's a headache!        Have a HP G72 Laptop. It came with Windows 7. Upgraded to Windows 10 (years ago). Recently (a few days ago) the laptop had a massive crash and I lost everything. I could not have done a better job of wiping the hard drive clean if I wanted to! Now what's happened is the HP G72 system automatically went and reloaded itself with Windows 7!!! I'm now trying to update this Service Pack 1 update so that I can get Internet Explorer (it keeps saying its out of date) to work properly... so I can get Windows 10 re-installed. AND this Service Pack update keeps loading, installing, configuring, reconfiguring etc. Its caught in a vicious cycle. OH... I can get to the Microsoft website but when I try to download from there it comes back with \"Your browser is out-of-date please update\". And I believe that's what this Service Pack 1 update is supposed to resolve. Question... well, that is the question... what is going on? Bill Gates... I hate computers! However, they're a necessary evil now-a-days!","solutions":["You can use an alternative browser to download the Win10 Media Creation Tool, e.g. Google Chrome, Firefox or Opera.http:\/\/windows.microsoft.com\/en-us\/windows-10\/media-creation-tool-install","Once you get it downloaded:The free upgrade to 10 is yours for the life of that device.The best method to upgrade back to 10 is to clean install it.\"How to Clean Install Windows 10\"http:\/\/www.tenforums.com\/tutorials\/1950-windows-10-clean-install.html_______________________________________________How to Create Bootable USB Flash Drive to Install Windows 10 fromThis tutorial will show you how to create a bootable USB flash drive that can be used to installWindows 10 with or without UEFI.________________________________________________To access BIOS\/UEFI - UEFI\/EFI configuration:https:\/\/neosmart.net\/wiki\/boot-usb-drive\/_____________________________________When your free upgrade to 10 was  originally activated Microsoft will have kept the Hardware Configuration details of your device on their Servers for recognition purposes if you have to reinstall 10.\"Activation in Windows 10\" (Digital entitlement)https:\/\/support.microsoft.com\/en-au\/help\/12440\/windows-10-activationCheers"]},{"symptom":"windows 10 update        Feature update to Windows 10, version 1903 – pogreška 0x80070017Please advise!Thank You!","solutions":["Hi, damircvijić My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.If you have problems updating Windows, follow these steps: If you have a third-party antivirus, you must disable or uninstall it. Try reset Windows update components: Right click on the start button and select Powershell (admin) or Command Prompt (admin)Write the next hit enter after each line. net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Restart and try again. You can also download the Windows Error Solver: https:\/\/support.microsoft.com\/en-us\/help\/10164\/...https:\/\/aka.ms\/wudiag You can do it manually by downloading the Windows ISO. When updating with the ISO, disconnect the Internet. https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"Loss of \"Local weather\" on Microsoft Flt. Sim. X and \"Runway 03 at KMKC\"        \"Local weather\" Suddenly got a message that local weather was no longer available. I checked operation of the computer and it is connected to the internet and working ok there. I also tried unloading and reloading MFSX but no help. Can this possibly be an internal MFSX programming problem? Do I need to replace MFSX?\"Runway 03 at KMKC\" I fly in and out of KMKC a lot. I learned early on that runway 03\/21 at KMKC is not used, especially for twin aircraft and up to heavy jets. It is to short and has landing and takeoff obstructions on each end. However MFSX controllers continue to have aircraft use 03\/21. This is not realistic operation at this airport. Is there a way to disable taking off and landing on this runway and use 01\/19 exclusively or just use 03\/21 for small single engine aircraft and 01\/19 for twins and heavier aircraft?","solutions":["You're more likely to get help here:  https:\/\/www.avsim.com\/forums\/forum\/314-microsoft-flight-simulator-forums\/","Hi Mitch,When you say \"Local weather\", I assume you mean the Real World Weather feature for download.   If so, this feature hasn't worked in FSX for a good number of years and those of us who have managed something of a download at that time, have found that the METAR data was totally inaccurate.   I would strongly suggest buying a weather program (many good ones out there:  e.g. Rex  http:\/\/rexsimulations.com\/), or else if you would prefer quite a good one (I use it & it's free), then go here:  https:\/\/www.fsrealwx.de\/And no need to replace MSFSX, unless you wish to buy FSX-Steam Edition (which incorporates FSX Deluxe plus the Acceleration Pack), or else wait for the new Sim from Microsoft due for release this year.   However, from looking at the graphical detail, one would need a fast CPU and top end graphics card and possibly paying a monthly fee for accessing parts of it.   Some aspects aren't good, but this new generation Sim may make it worthwhile.Re:  KMKC.   I've not flown in or out of there (the closest was KMCI), though I agree FSX ATC isn't the best (as you well know) in allocating appropriate runways and maintaining proper separation of aircraft in flight.   There may be a way of disabling the runway, or at least re-configuring it through an airport editor, though I'm ignorant in that area (you could try researching that aspect).   In your case however, I would accept ATC's instruction for a 03\/21 runway but use another (if winds allow it).   You'll get all sorts of objections from them, but it's a case of do or die!Chris","Chris, Tks for the reply. Yes, \"Real World Weather\". I will take a look at the web sites you mentioned. When flying a large aircraft I usually create my on weather so they will give me the longer runway.Tks again for the reply."]},{"symptom":"how can i get a list of messages i have posted?        six characters","solutions":["Click on this then: Bob-M2"]},{"symptom":"forgot windows account gmail password and  forgot gmail password as well. So I could n't access my gmail account and windows account.        Hi Sir\/ Madam,I have forgot windows account email (gmail) password and  forgot gmail password as well. So I could n't access my gmail account and windows account.  In the microsoft recovery form some questions I could n't answer exactly. This is really hard procedure set up by company. even google also, I can make use of recovery options successfully. Please ask me any account usage related questions and I can answer to prove my ownership. I am really upset that I can not access my account. I am so disappointed sir.  I really request microsoft to help me to send reset password link.  This is my humble request for you. Thanks ","solutions":["Note that we're not Microsoft here. These are peer-to-peer forums; users helping other users. No one here has any access to your account.Unfortunately, if you can't recover your password using the forms Microsoft supplies, you're completely out of luck, Here is the article that explains how:https:\/\/support.microsoft.com\/en-us\/help\/17875\/.... There are no other options to recovering your password.Your Google account is completely separate from your Microsoft account, even if you used the same address as the username. Here's the article describing how to recover your Google account:https:\/\/support.google.com\/accounts\/answer\/7682... In the future, you should record your passwords and keep them in a safe place.","Thanks for reply.  I want to know that  \"if I create a new microsoft account with new email id and add this to my windows via windows settings app, then will I have a chance to remove the old email which is logged in to windows already? and keep the new email as my windows account?","Hi, Adding a new account is just that a separate account entirely. You won't have access to any account files or settings from your original account if you are unable to log into it. You won't be able to make any changes to that account either. I would recommend looking into Gmail recovery, Google (like most providers) force you to enter a recovery email address in case you are locked out.For Google's recovery steps please visit: https:\/\/support.google.com\/accounts\/answer\/7682...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"MS Photos app freezing while searching for new photos        I am attempting to move files from my iPhone X to my Windows 10 laptop via the Photos app. I have done this numerous times in the past including recently.I plugged in my phone via USB cable, the photos app opens and begins searching for new photos and videos, it finds what I believe to be all of my media files, and freezes. The \"looking for new photos and videos\" window doesn't close. I can't cancel and have to hard close the app.I've waited 20 minutes for it to fix itself with no results.I've tried refreshing, restoring and reinstalling the app with no results. I've also signed in with both a MS account and local account as answers to similar questions have suggested. Still no change.This is frustrating. Please assist.","solutions":["Hi barbquebutt Greetings! I am Vijay, an Independent Advisor. Try these and check after each step.Re-register All Store apps (You will get many Reds, ignore that) Windows+X > Click Windows Powershell (Admin) > Copy the below line and paste in Powershell > Enter > Restart your computerGet-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}----------------------------- Report this to Microsoft so that this issue can be fixed in future updates. Press Windows Key+F to invoke Feedback Hub to send the issue to Microsoft.There are two other actions which I can recommend. You can try them one by one and check after each.1. Restore from a system restore point to a point when things were working fine https:\/\/support.microsoft.com\/en-us\/help\/12415\/...2. If the issue has been caused due to recent Windows update - I would suggest that you uninstall the latest KB update and hide it so that it doesn't install it automatically and wait for new update to come which will be installed automatically.To know which update got installed Windows Key+i to invoke Settings > Update & Security > Click View installed update history. These KBs should be from the below list. Don't uninstall any other KBFor 1903 - https:\/\/support.microsoft.com\/en-us\/help\/4498140 For 1809 - https:\/\/support.microsoft.com\/en-us\/help\/4464619 For 1803 - https:\/\/support.microsoft.com\/en-us\/help\/4099479 Make note of KB and uninstall and block it. Uninstall Windows Key + R > Type: appwiz.cpl > Enter > Click View installed updates > Select the required updates, right click, uninstall.Block Microsoft has provided a tool Show\/Hide Updates tool to block the update Download the tool from below link http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2...When you run this troubleshooter, it will search for available updates and list themSelect the update which you want to hide. Click Next and follow on-screen directionsDo let me know if you have any more question or require further help.","Hello,Try the older File Explorer method to import your photos:https:\/\/www.kapilarya.com\/how-to-import-ipad-iphone-photos-to-windows-10Let me know if this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP. ","This is what is now happening to me! It was fine before and more finds photos when plugged in on photos app and then freezes and i have to close window. I have tried repair and reinstall nothing works. need to upload my photos.Please can we get some more help to resolving this.","im having this issue... its really starting to bother me","I have had this issue for going on 3 days. Finds photos then freezes. None of the fixes seem to help...","I have the same problem.","Yes, the old method still works - thank God.However, it is embarrassing that the Photos app hangs and crashes when downloading photos from an iPhone. It is not random - it crashes every time! Can you please fix it instead of pointing people to old-style method ???Perhaps it is because I have a lot of pictures\/videos on my phone (15,000+), but that should be part of your software testing.Looking forward to Microsoft's speedy update on this issue!","Microsoft - it seems that both iphone and android users have the same symptoms. I have an almost new Samsung s10e. Others have the same symptoms with much older devices.While the approach to import photos via Explorer works, it's tedious.  Is there a fix coming for the Photos app?I did find a workaround - Since all of my photos still existed on my phone, I started doing the following deletes:- any video that had an error playing- any unwanted photo or video- doing mass deletes of photos from current month, then previous month. I only had to go back 2 months, then import seemed to work again, and I re-imported the last 2 months as well as any new photos that I'd taken during the period where the Photos app was failing to import.","This problem has been existed since 2015 (You can search about this problem in microsoft community). I don't know why microsoft can't solve this and fix the apps","This is ridiculous. I can't download photos from my iPhone - it used to be so easy to drag and drop. MS Photos app just hangs at \"9012 items found so far\". I've tried everything from several MS Communities and nothing is working. Microsoft has gone brain dead."]},{"symptom":"Transfer data from Windows Live Mail to Outlook        I just installed Office  2019 which includes Outlook.   I was previously using Windows Live Mail for my emails.   How do I transfer emails, folders, contacts and calendar information from Live Mail to Outlook?","solutions":["Hi jim and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.How to Export Windows Live Mail to Outlook https:\/\/www.freeviewer.org\/blog\/windows-live-ma...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","How do I make backups of the EML files?","Hi jim, There are many ways to backup your EML files. Check this article for detailed instructions. https:\/\/www.lifewire.com\/copy-individual-messag...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thanks! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Getting BSoD on New PC build, Windows 10 64 bit, not sure of cause        Getting BSoD on new PC built less than a week ago. All hardware components are new and are as follows:i9 9900KF CPU, ASUS z390-e motherboard, 2x16 gb (32 gb total) DDR4 G.Skill Trident RAM, NVidia GeForce RTX 2080 super, Samsung Evo 970 1 Tb SSD, corsair RM x850 PSUNot sure how to begin diagnosing the issues, would greatly appreciate help. Below is the reliability information from the crashes:-------------------------------------------------------------------------------------------------------------------------------DescriptionThe computer has rebooted from a bugcheck. The bugcheck was: 0x00000133 (0x0000000000000001, 0x0000000000001e00, 0xfffff8020f16e350, 0x0000000000000000). A dump was saved in: C:\\WINDOWS\\MEMORY.DMP. Report Id: e6705476-6a61-444a-9989-103dfcee1634.Problem signatureProblem Event Name: BlueScreenCode: 133Parameter 1: 1Parameter 2: 1e00Parameter 3: fffff8020f16e350Parameter 4: 0OS version: 10_0_18362Service Pack: 0_0Product: 768_1OS Version: 10.0.18362.2.0.0.768.101Locale ID: 1033Extra information about the problemBucket ID: 0x133_ISR_nt!ExpWaitForSpinLockSharedAndAcquire-------------------------------------------------------------------------------------------------------------------------------DescriptionThe computer has rebooted from a bugcheck. The bugcheck was: 0x0000000a (0x0000000000000004, 0x0000000000000002, 0x0000000000000001, 0xfffff80349df8a18). A dump was saved in: C:\\WINDOWS\\MEMORY.DMP. Report Id: 4729d15e-f478-47d6-b4b2-c77efc5f82bd.Problem signatureProblem Event Name: BlueScreenCode: aParameter 1: 4Parameter 2: 2Parameter 3: 1Parameter 4: fffff80349df8a18OS version: 10_0_18362Service Pack: 0_0Product: 768_1OS Version: 10.0.18362.2.0.0.768.101Locale ID: 1033Extra information about the problemBucket ID: AV_nt!KiInsertTimerTable-------------------------------------------------------------------------------------------------------------------------------DescriptionThe computer has rebooted from a bugcheck. The bugcheck was: 0x0000003b (0x00000000c0000005, 0xfffff8070f1e9bc4, 0xffffae0be4896e40, 0x0000000000000000). A dump was saved in: C:\\WINDOWS\\MEMORY.DMP. Report Id: abb68eb1-a25e-4c50-9130-3d8d9760d527.Problem signatureProblem Event Name: BlueScreenCode: 3bParameter 1: c0000005Parameter 2: fffff8070f1e9bc4Parameter 3: ffffae0be4896e40Parameter 4: 0OS version: 10_0_18362Service Pack: 0_0Product: 768_1OS Version: 10.0.18362.2.0.0.768.101Locale ID: 1033Extra information about the problemBucket ID: IP_MISALIGNED-------------------------------------------------------------------------------------------------------------------------------DescriptionThe computer has rebooted from a bugcheck. The bugcheck was: 0x0000007f (0x0000000000000008, 0xffffe7014840b2b0, 0x00000000edeef62f, 0xfffff806572235dd). A dump was saved in: C:\\WINDOWS\\MEMORY.DMP. Report Id: 8f03a8b1-4e59-451a-b0c2-2a28be40f32f.Problem signatureProblem Event Name: BlueScreenCode: 7fParameter 1: 8Parameter 2: ffffe7014840b2b0Parameter 3: edeef62fParameter 4: fffff806572235ddOS version: 10_0_18362Service Pack: 0_0Product: 768_1OS Version: 10.0.18362.2.0.0.768.101Locale ID: 1033Extra information about the problemBucket ID: 0x7f_8_STACKPTR_ERROR--------------------------------------------------------------------------------------------------------------------------------Here is a link to the %systemroot%\\Minidump  files:https:\/\/1drv.ms\/u\/s!AjwmU96fOvJPigfAMaJghX0RwH-4?e=BnpvWe","solutions":["Hi, you have different bugcheck codes. Usually this means hardware problems, probably memory errors. Please check memory for compatibility with motherboard, check memory operating modes (voltage, frequency and timings), run Windows memory diagnostic tool and switch it to wide mode.If possible I'd recommend to try another memory modules e.g. Kingston Value RAM.","I just used memtest86 to test out the RAM no errors or warnings","Problem may be in CPU or motherboard too. please check system journal (Event Viewer) for possible errors at these moments, especially Kernel-Power errors. DistributedCOM errors should be ignored.","Just checked event viewer each of the restarts in question corresponds will a critical \"Kernal-Power\" error.","Are there Kernel-Power 41 (63) errors?","I can see there is a task category with 63 for each one, so believe so. ","Kernel-Power 41 (63) error mostly means the problem with power supply unit. Can you replace it for checking?Or carefully look at motherboard and PSU for leaked or swelled up capacitors (little barrels).","I check the motherboard for capacitor issues and will see if I can get a replacement power supply. I will let you know if this solves the issues.","Sometimes problem is in BIOS CPU power saving options. Try to turn off all C-states.","So I have used another power supply and turn off C-States. I received the Kernel-Power Error again."]},{"symptom":"Multiple computer upgrades to Windows 10 or not?        Current I have five computers - 2 laptops running Windows 10, 1 laptop with Windows 7, and 2 desktop units both with Windows 7.One of the desktop units will be replaced within the next month and new one will have W.10 - solves that issue.The other two units - 1 laptop and 1 desktop? Should I try to upgrade them to Windows 10?  If either of them was to get a virus or other malware would it spread to the units running Windows 10? Basically, the question is can the infected computers spread the \"virus\" or would I be okay just letting them die a natural death and replace with new units. Both of the older computers do access the internet but I don't want to waste time upgrading them if I don't have to. Thoughts?","solutions":["You don't have to upgrade them. Microsoft is discontinuing Windows 7 support, but all that means is that you will no lomgrt get updates to it. If you are  happy with 7, stay with it; just be sure to run third=party security software that is kept up to date.","Virus\/malware infected files can be shared over a network no matter what operating system you have.If you're looking for information for home users, see Windows 7 support will end on January 14, 2020.With end of support Microsoft is not telling you that your operating systems won't work.What they are saying is that after a certain date they will no longer support them.Whether they still work or not with particular programs is up to the particular program manufacturers.Example: Google Chrome is no longer supported for security updates in XP or Vista by Google and Mozilla Firefox is following the same path.What this basically means with Microsoft no longer supporting an operating system is that even though hackers may find \"holes\" and vulnerabilities to be able to access the operating systems and cause security problems, Microsoft will no longer be monitoring or rectifying those problems by way of Security Updates each month.You are on your own in regards to maintaining the Security of your operating systems.What does it mean if Windows isn't supported?____________________________________________________This will show you when support (Mainstream and Extended Support) for the various operating systems ends.Windows lifecycle fact sheet - Windows Help - Microsoft SupportAnd these FAQs show you how Microsoft arrived at the Support Lifecycle Policy:Microsoft Lifecycle Policy FAQhttps:\/\/support.microsoft.com\/en-au\/help\/17140\/lifecycle-faq-general-policy-questions@@@@@@@@@@@@@@@@@@@@@@@"]},{"symptom":"Do you support Microsoft in their choice of making Windows 10 the last ever Windows Operating System?        Well, as most of you all know Microsoft announced a few months (or years) ago that they would be making Windows 10 theirlast ever operating system: meaning that they're not going to make a new operating system every few years and they will just release updates every month or so. I really have some skepticism on what Microsoft is doing but to make my claim valid I wanted to ask the community what they think about this \"bold\" move made by Microsoft.Please leave your ideas in the comment section below!I'll try my best to read and reply to them all.","solutions":["... they're not going to make a new operating system every few years and they will just release updates every month or so ...Technology changes very quickly today, so Microsoft no longer has the luxury of being able to wait years between new versions of Windows, particularly when its competition releases new operating systems more frequently.Instead of releasing a new operating system every few years, Microsoft now releases a new operating system twice a year: in the spring and in the fall. New operating systems are now called 'feature updates' but that's just a name. By the same token, Windows 8 can be a considered a 'feature update' to Windows 7, which was a feature update to Windows Vista, etc. because each successive version of Windows had new features. Again, it's just a name.Instead of calling these new operating systems Windows 11, Windows 12, etc. they are called Windows 10 v.1903, Windows 10 v.1909, etc. If you prefer Windows 11, 12, 13 ... go right ahead."]},{"symptom":"On screen keyboard issues        We recently purchased the MS Surface Pro in December 2019.  There are two issues with the onscreen keyboard:1) When writing an email the first letter of the first word in my email content is capitalized and then every letter there after is capitalized.  The only way to fix is to delete the capitalized words\/letter and unselect the uppercase keyboard key.  Then sometimes words will start capitalizing again.  (MS- you need to fix this bug)2)  When going to google.com in Chrome browser and starting to type a word in the search box, the cursor immediately jumps to the url box at the top of the page and the online keyboard disappears.  So now I can't finish typing my search word.  (MS-you need to fix this bug)Thanks.","solutions":["For number 1 How is your spelling correction set?","In Gmail, autocorrect is on, however the issue is broader than Gmail.","Have you checked Typing for autocorrect?","Yes, it was on.  I turned it off but that didn't fix the issue.","Hi, I also do have all kind of bug using the onscreen keyboard on the Surface pro 7 (bought last Dec.), Formatting text is very frustrating if done by hand alone. Simple task like select a portion of a text and copy it is tedious, it's all over the place. The page move up and down as the keyboard keep leaving a white large bar in the bottom of the page. ''Paste as plain text'' is hidden behind long press hold than 3 dots... and yes the cursor jump to Address bar from Search bar at first typed letter in Chrome. This Keyboard Typing Experience is really unfortunate and by now someone at Microsoft should have take your report seriously and replied to your post."]}]}