{"windows":[{"symptom":"Internet Connection        I run windows 10 with the latest update. Everything is fine except my social media online status. I have connected my internet by ethernet from the router. The problem is I am shown online permanently, even when shut down to other devices. The only time I am offline is when I cut the power supply to the CPU. ","solutions":["This is the normal Windows system.  When you start up the system connects to the network and the Internet if you have set the network for connect automatically.","Hello,Check if you logged in to social media account via your other devices such as your phone. Regards.","Hi RHYTHM1028, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.If your computer is shut down, your social media should not still show you online if it is the only device that you have logged in.For your social media, do you have an app installed on any device other than your computer? Another device may be keeping it signed in.Another way to confirm is to log out of the social media website when you are done.I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"Greedfall not Available?        Hello there, i'm trying to purchase a digital copy of the game Greedfall for PC but when I search for it in the Microsoft Store nothing comes up.  I would really like to purchase it today as this is the last day of the special sale discounted price.  Any help you can provide would be greatly appreciated.","solutions":["Where did you see the 'special' discounted price ?  I don't see the game listed on the MS Store either. Only the guide.Steam have it at 25% off atm, which is not a bad discount for a new game.btw - all on line games sites have 'special discounted' prices on games on a regular basis. Hardly a week (day ?)goes by without a so called 'sale'. 'Sales' are so common only the impatient need to buy at full price.Personally, due to the many ongoing issues with games from the MS Store it would be my last choice for any game.(Or more accurately, the way the store client software works, or fails to work properly for so many users, as well as MS encrypting all game files),.","Hi Drayen32 According to the Microsoft Store, that game is only available for the Xbox One, not for PChttps:\/\/www.microsoft.com\/en-us\/p\/greedfall\/bwm...It is available on the Steam Store, if you play Steam games . . ."," Is there a particular reason why the PC version is not available in the MS store but available everywhere else? Ironically the company most noted for and linked to Windows OS and PC hardware is not supporting the PC version of the game","Hi Drayen32 I honestly do not know why the developers of that game did not port that to PC as a Store game, there may have been difficulties getting that to run correctly on the game engine in Windows, because it is available on the Steam game engine . . ."]},{"symptom":"Unable to get XBox one controller to work with Star Trek online with Windows 10        We just bought a wired XBox one and Windows controller to be able to use it for Star Trek online on our Windows 10 PC.  We are unable to get it to work other than turning the ship.  We would like to be able to fly the ship and much more with the controller.  How can we set up the controls for the game.  The brand we bought was pdp.  We have downloaded the Hub but still have not been able to get the controller to work.  Please give us some advise.  We would like to use it but cannot get it to work.  Can you please let us know what we are doing wrong? Thank youRedFox","solutions":[]},{"symptom":"Windows 10 not starting after October 2019 update        After the Oct 8 update of Windows 10 on my home edition desktop, on restart the machine does not boot up.  After the manufacturer screen, the blue windows logo appears on the black screen and stays stuck there with no hard drive activity.  I have tried the below options and none are working:1. Doing a force boot 3 times to try and get into safe mode - does not work.2. Created recovery USB drive from a different computer and in BIOS changed the order to boot from USB drive, but still only see the black screen with blue windows logo and no hard drive activity (no hard drive light blinking)3. Created a DVD ISO with the Windows media creation tool and when I set the boot order to boot from CD\/DVD drive, it gives a message to hit a key to boot from CD or DVD.  On doing so, it again shows the same black screen with blue windows logo and this time the hard drive light blinks for a few seconds but then just stops.I am not sure what options I have, and if I can at least get to the hard drive and retrieve some files that would help.  But at this time I am unable to get past.  Could the hard drive have gone bad?  Or is there any other way to get to the safe mode and rollback the update or restore to a previous point?  Just looking for some advice.  Thanks!","solutions":["My desktop PC has done the same thing.  Friday night when i went to Switch it off, the option was to update and shut down.   So, of course, thats what i did.  Tried to turn it on the next day, it gets to the (Gigabyte) MoBo page, sits there for about 10 seconds, then quits and restarts. I can’t get to the BIOS.  I’ve tried swapping HDs.  Tried all i can think of.    The update has changed something, and now i’m not sure what to do.    Send help 😃  thank you. ","Hi, YB_934 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.I recommend you reset the BIOS to its factory settings and try again to enter Safe Mode or boot with USB to repair","I have tried resetting the BIOS too to the default, but it does not work.  I have tried multiple restarts.  Sometimes on restart it shows the blue windows logo and the message \"Preparing Automatic Repair\" at the bottom of the screen but does nothing with no spinning dots or any hard drive activity and just stays there until I force shutdown the machine.","Then try booting from USB to repair Windows and recover your files. To do this you have to configure the BIOS to boot with the USB or DVD. Then you will follow the steps of the following link:https:\/\/www.backup-utility.com\/windows-10\/reins...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I have set the BIOS boot order to boot from USB but it still does the same thing.  That is what I cannot figure out as to why it will not boot from USB even though I have the recovery media created.  I also tried with the DVD as the boot device and that does not do anything either.  Could the hard drive be the issue if this is happening?  If only I could go into safe mode with any of these options I could have tried something but at this point I am always stuck with the black screen with blue windows logo.","You have to check that the BIOS is reading the Hard Disk","How would i check that?I see the hard drive is in the boot list.","If you can see the Hard Disk in the BIOS, you might have problems with the USB to repair Windows, you should recreate the Windows USB.","I will try that, but for that reason I tried with creating a recovery DVD and have the same issues, so I do not think it should be that but I can try creating the recovery USB again.","If the Hard Disk is damaged, it should still boot with the DVD or USB and show that there is no Hard Disk."]},{"symptom":"when i install any emulator it show this and blue screen and need how should set the value and what should be value i have windows 8pro 64bit ,i3 2120cpu@3.30ghz 4gbram        System.ArgumentOutOfRangeException: Value of '8' is not valid for 'Value'. 'Value' should be between 'minimum' and 'maximum'.Parameter name: Value   at System.Windows.Forms.ProgressBar.set_Value(Int32 value)   at installer_UI.downloadInfoPage.client_DownloadProgressChanged(Object sender, DownloadProgressChangedEventArgs e)   at System.Net.WebClient.OnDownloadProgressChanged(DownloadProgressChangedEventArgs e)   at System.Net.WebClient.ReportDownloadProgressChanged(Object arg)","solutions":["System.ArgumentOutOfRangeException: Value of '8' is not valid for 'Value'. 'Value' should be between 'minimum' and 'maximum'.Parameter name: Value   at System.Windows.Forms.ProgressBar.set_Value(Int32 value)   at installer_UI.downloadInfoPage.client_DownloadProgressChanged(Object sender, DownloadProgressChangedEventArgs e)   at System.Net.WebClient.OnDownloadProgressChanged(DownloadProgressChangedEventArgs e)   at System.Net.WebClient.ReportDownloadProgressChanged(Object arg)"]},{"symptom":"USB mouse is not working on windows 10        I connected an USB mouse to my windows 10 surface book, but it is not working. It works perfectly in Ubuntu. In windows it kind of works intermittently. When the mouse is connected, a notification comes up saying \"the device you connected malfunctioned...\". I tried uninstalling and installing the drivers again but no luck. In device manager, in \"Universal Serial Bus Controller\", a new entry comes up when mouse is connected saying, \"Unknown USB Device (Port reset failed)\". I tried looking up for other answers which mentioned to use troubleshooter for the same, but I am not able to find appropriate troubleshooter for mouse category.","solutions":["Hello,As you've USB mouse, please try the official Windows USB troubleshooter:http:\/\/download.microsoft.com\/download\/D\/B\/B\/DBBF8048-0817-40DC-817D-395652B870FF\/WinUSB.diagcabLet us know if this helps!"]},{"symptom":"In windows 10  Dell laptop        windows is upgraded 7 to 10 recently.    Initially  wifi  icon appearing and worked normally.  within 2 days,  icon missing and connectivity thro wifi lost.   tried all sorts of trouble shooters.   did not work.   how to get back wifi icon and connectivity thro  wifi.  thank you.","solutions":["Hi Veerra. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything that works to fix Wifi so that at least something will work. Even if you've already tried a step please try or check it again in sequence. If you need any assistance I'll be standing by here to help:Update your network adapter drivers from the PC maker's Support Downloads web page using the full model number, HP Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.If you have the latest network driver then try on it's Driver tab also to Roll Back, or Uninstall and then restart PC to reinstall the driver. Try also all older drivers from Update Driver > Browse > Let Me Pick list working backwards.Go to Device Manager > Network Adapters, select Wifi adapter, then Power Management tab, clear the check box to \"Allow the computer to turn off the device to save energy.\" Then on the Advanced tab disable any energy-saving options.If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool explained here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them.If this was caused by Version update then you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool.For Wifi won't connect after Version 1903: https:\/\/windows101tricks.com\/fix-wifi-keeps-dis...https:\/\/www.techrepublic.com\/article\/wi-fi-and-...https:\/\/pureinfotech.com\/fix-wifi-problems-wind...Enable IPv6 in the network adapter settings: https:\/\/www.tenforums.com\/tutorials\/90033-enabl...Run the fixit from https:\/\/support.microsoft.com\/help\/929852 (Re-enable IPv6 on all nontunnel interfaces) and reboot.Right click the network icon in System Tray at bottom right end of task bar to Troubleshoot Problems.Try all of these steps: https:\/\/support.microsoft.com\/tr-tr\/help\/10741\/... https:\/\/www.kapilarya.com\/how-to-reset-network-...Go to Settings > Network & Internet > WIfi > Manage Known Networks, highlight and remove the network having problems, restart PC to see if it shows up again.Try plugging in by ethernet cable to the router to compare, then plug the ethernet cable into the modem (if separate) to see if this might be an issue with the router.Try powering off modem, router and PC and then restarting in that order with 1 minute in between each. You may need to reset your router or even optimize it following these steps:https:\/\/www.lifewire.com\/resetting-a-home-netwo...https:\/\/www.pcmag.com\/article\/258865\/how-to-set...Your router manual is always available from the manufacturer's website for your exact model.You also are entitled to Support from your internet provider to get online on all devices. This is always included in the monthly bill. If your router is less than a year old they will also Support getting it connected and optimized.Another option is you could replace the wireless adapter with an inexpensive USB nano adapter like this one:https:\/\/www.amazon.com\/OURLiNK-600Mbps-Wireless...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Veerra. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything that works to fix Wifi so that at least something will work. Even if you've already tried a step please try or check it again in sequence. If you need any assistance I'll be standing by here to help:Update your network adapter drivers from the PC maker's Support Downloads web page using the full model number, HP Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.If you have the latest network driver then try on it's Driver tab also to Roll Back, or Uninstall and then restart PC to reinstall the driver. Try also all older drivers from Update Driver > Browse > Let Me Pick list working backwards.Go to Device Manager > Network Adapters, select Wifi adapter, then Power Management tab, clear the check box to \"Allow the computer to turn off the device to save energy.\" Then on the Advanced tab disable any energy-saving options.If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool explained here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them.If this was caused by Version update then you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool.For Wifi won't connect after Version 1903: https:\/\/windows101tricks.com\/fix-wifi-keeps-dis...https:\/\/www.techrepublic.com\/article\/wi-fi-and-...https:\/\/pureinfotech.com\/fix-wifi-problems-wind...Enable IPv6 in the network adapter settings: https:\/\/www.tenforums.com\/tutorials\/90033-enabl...Run the fixit from https:\/\/support.microsoft.com\/help\/929852 (Re-enable IPv6 on all nontunnel interfaces) and reboot.Right click the network icon in System Tray at bottom right end of task bar to Troubleshoot Problems.Try all of these steps: https:\/\/support.microsoft.com\/tr-tr\/help\/10741\/... https:\/\/www.kapilarya.com\/how-to-reset-network-...Go to Settings > Network & Internet > WIfi > Manage Known Networks, highlight and remove the network having problems, restart PC to see if it shows up again.Try plugging in by ethernet cable to the router to compare, then plug the ethernet cable into the modem (if separate) to see if this might be an issue with the router.Try powering off modem, router and PC and then restarting in that order with 1 minute in between each. You may need to reset your router or even optimize it following these steps:https:\/\/www.lifewire.com\/resetting-a-home-netwo...https:\/\/www.pcmag.com\/article\/258865\/how-to-set...Your router manual is always available from the manufacturer's website for your exact model.You also are entitled to Support from your internet provider to get online on all devices. This is always included in the monthly bill. If your router is less than a year old they will also Support getting it connected and optimized.Another option is you could replace the wireless adapter with an inexpensive USB nano adapter like this one:https:\/\/www.amazon.com\/OURLiNK-600Mbps-Wireless...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi, I didn't get any reply - just an empty post."]},{"symptom":"In Start Menu icons of the most application are missing. How to fix it?        How to return icons of applications?Screenshot:","solutions":["How to return icons of applications?Screenshot:Hello, Try to re-register Start Menu using these steps: 1. Open Task Manager, click File > Run new task. 2. Type powershell in the Create new task box. Check the option 'Create this task with administrative privileges'. Click OK. 3. In the administrative Windows PowerShell window, type\/paste following and press Enter key: Get-appxpackage -all *shellexperience* -packagetype bundle |% {add-appxpackage -register -disabledevelopmentmode ($_.installlocation + “\\appxmetadata\\appxbundlemanifest.xml”)} 4. Let it complete and then restart your system. Reference: https:\/\/www.kapilarya.com\/re-register-start-menu-windows-10Let us know if this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP."]},{"symptom":"Delay in wifi network detection        For the last couple of days there has been a delay on detecting any wifi networks when my laptop is woken from sleep. Connects fine once it sees the network and detects and connects perfectly well when fisrt switched on.I have tried updating the driver, and also turning off power saving mode on the wifi and have run MS security scanner. Nothing detected and using the network adapter troubleshooter detects no issues. Other devices connect fine.Any suggestions?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please check if this is happening with a particular Network or all wireless networks.If it is happening with all networks please reset the Network Adapter from Device Manager.Go to Device Manager Locate and Expand Network Adapter Right click on the WiFi driver and select Uninstall (Do Not click on any check box)Restart the PC.","Hi thanks for the reply, it was all networks but of course has now started working normally again as soon as I posted the question. Will try your advice if it goes down again.","Sure. Keep us posted."]},{"symptom":"Verification of vendor        Hello everyone, I would like to verify if this certain seller is really legit or just one of those selling oem product keys that's not fully legal.https:\/\/productkey.ph\/faqs\/#1513685806640-64b103cc-50f4","solutions":["Hi Saya Well done for being suspicious, they are selling OEM or volume licence software and that will most likely self-deactivate after a month or so after you purchase the productThey are selling Windows 10 Home and Pro for 1\/4 the price that Microsoft sell their own software, so this cannot possibly be legit . . ."]},{"symptom":"help,blue screen , \"system service exception\"        dump:https:\/\/pan.baidu.com\/s\/14FR4Sd6hyBQP0cqPTFtnKw","solutions":["您好,我是独立顾问(Independent Advisor)Dexter,请让我来帮助您. 日志中记录了系统内核进程ntkrnlmp.exe引发了SYSTEM_SERVICE_EXCEPTION系统服务异常,可能是您的系统受损了,建议可以先参考下面的步骤对系统镜像进行校验和修复试试:1. 按键盘Win+R打开\"运行\",输入cmd然后按Ctrl+Shift+回车,以管理员身份打开命令提示符.或者按Win+S在搜索框中输入cmd,右键点击搜索结果中的\"命令提示符\">以管理员身份运行2. 在打开的命令提示符窗口中粘贴运行下面的命令: DISM.exe \/Online \/Cleanup-image \/Restorehealth sfc \/scannow 希望以上信息可以帮得到您,如果还有什么疑问的话,欢迎继续提问."]},{"symptom":"How do I create a ISO disk of my Windows Defender security essentials?        How do I create a ISO disk of my Windows Defender security essentials?","solutions":["Hi JonJon Please provide a bit more detail on this problem, what exactly are you trying to do?Security Essentials is a small file (15MB) and can be readily downloaded form the link below, and that installer can be run on any PC, it would be too small to create an ISO fromhttps:\/\/www.microsoft.com\/en-us\/download\/detail...Are you experiencing difficulties on an offline PC that you need to resolve?","Why make a copy when it is new maybe 2-3 times a day and is available in Windows updates most every time you check."]},{"symptom":"win 10 sound        I just upgraded from Win 7 home to win 10 home. I have a creative soundblaster omni surround external sound card installed. When I turn on computer everything works fine and then after a while the sound disappears. I run the troubleshooter and it says they were going to play some \"test sounds\" and each time they asked if I heard anything and I didn't. It then says I must restart my computer for the fix to take effect. It works again after restarting only to happen again. It's frustrating to keep restarting. The soundblaster wasn't originally supporting in windows 10, it was no problem in windows 7. Creative offered some drivers for windows 10 which I installed by the problem exists. I have another soundcard by c-media installed in the slot which also worked great in win 7. This is not even recognized. Any ideas?thanks","solutions":["Hi Ron. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Some Windows 7 hardware may not work in Windows 10, and some hardware that worked in earlier versions of WIndows 10 may not work now because a later version is like a new OS with Windows new model of versioning.So I'd check with your two sound card maker's to see if they Support Windows 10 Version 1909. If not then you may need to get a new card.You can also as a last resort try installing the drivers in Compatibility Mode: https:\/\/social.technet.microsoft.com\/Forums\/win...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Have you checked in Device Manager to see if the adapter is up to date?Have you checked with Soundblaster and C-media if they have new drivers for Windows 10?","Hey Lacrum,I did check with soundblaster and they had a new driver with \"windows 10 support\" and a firmware update. I installed both but the problem still arose. I don't know, if a driver was needed and worked for a while, why would it stop? I am looking for c-medias answer but so far I dont see anything for win 10.Thanks","me again. When you said check the adapter in device manager, did you mean the sound card update or another adapter like the network adapter because another thing happening is that I am frequently losing my wireless connection and I have to run the troubleshooter and it fixes a problem with the wireless gateway. Come to think of it , each time I restart for the sound issue, the internet connection is gone until reset. Related?thanks","Could be.  Check all the different adapters.  It could be Network or Printers or System devices or something else."]},{"symptom":"constant pc crashes        About a month ago I fully upgraded my pc. I installed a 2070 rtx super, with a ryzen 5 3600 cpu, on an msi tomahawk B450 max mobo. I also installed more memory, 16g ram and 500g ssd.I'm under the impression that my pc is fairly beefy, but i cant play any game at medium settings for more than about an hour or so before it crashes, depending on the game.I've seen benchmarks of the exact same system running higher graphic settings and performing very well, yet mine crashes. Has NEVER blue screened though.I've installed MSI afterburner to view my parts performance and everything is seemingly fine with my cpu temp being my only concern. it'll be at like 70-85 degrees at like 30-50% usage. otherwise my gpu's temps never go higher than about 45. nothing is overclocked. I've gone into my bios and turned my cpu fan speed up to 100% at 30c yet it still reaches those temps. not sure if that has anything to do with it, but yea. also its a stock cooler that came with its own thermal paste.I've looked everywhere for answers but have found none. windows, bios, and all drivers are up to date.When i search in windows for \"reliability monitor\" there are mulitple codes that show on different days. the 2 main ones are;---------------------------------DescriptionA problem with your hardware caused Windows to stop working correctly.Problem signatureProblem Event Name: LiveKernelEventCode: 141Parameter 1: ffff9f0156bbd010Parameter 2: fffff80357e55850Parameter 3: 0Parameter 4: 43cOS version: 10_0_18363Service Pack: 0_0Product: 768_1OS Version: 10.0.18363.2.0.0.768.101Locale ID: 1033--------------and--------------DescriptionFaulting Application Path: C:\\Windows\\System32\\RuntimeBroker.exeProblem signatureProblem Event Name: MoAppCrashPackage Full Name: Microsoft.Windows.Cortana_1.13.0.18362_neutral_neutral_cw5n1h2txyewyApplication Name: praid:runtimebroker07f4358a809ac99a64a67c1Application Version: 10.0.18362.1Application Timestamp: 4539d5a0Fault Module Name: SettingsEnvironment.Desktop.dllFault Module Version: 10.0.18362.387Fault Module Timestamp: 10b406e4Exception Code: c0000005Exception Offset: 000000000002b605OS Version: 10.0.18363.2.0.0.768.101Locale ID: 1033Additional Information 1: 789aAdditional Information 2: 789aeef51da05995f207dcf202006addAdditional Information 3: 8c17Additional Information 4: 8c17ec3e550b29b30cbdc624f58b6172-------------I'm lost and feeling hopeless. please help.","solutions":["another thing, my psu is brand new and is 750w. also i ran the heaven benchmark and cinebench at the same time, having 100% usage from cpu at 95c and 90% usage from gpu at around 70c-80c with no crashes or stutters at all,so why is it only games at lesser graphic settings at that?","Hi M3Production Please check to see if your system has produced any minidump files . . . Open Windows File Explorer Navigate to C:\\Windows\\Minidump Copy any minidump files onto your Desktop, then zip those up Upload the zip file to the Cloud (OneDrive, DropBox . . . etc.), then choose to share those and get a share linkThen post the link here to the zip file, so we can take a look for you . . ."]},{"symptom":"visual studio 2019        it looks like you're installing or modifying another product right now in visual studio 2019 window 7 32bit 3gb ram. ","solutions":["Your question is outside the scope of this Community.Kindly post your question to the MSDN Visual Studio Forums.https:\/\/social.msdn.microsoft.com\/Forums\/vstudio\/en-US\/home?category=visualstudioTechNet Forums: https:\/\/social.technet.microsoft.com\/Forums\/en-US\/homeMSDN Forums:https:\/\/social.msdn.microsoft.com\/Forums\/en-US\/homeCheers."]},{"symptom":"installation of Windows 10 in Windows 7        I can't do it after two times trials to install itHow can I get it done?","solutions":["You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700Cheers."]},{"symptom":"Assistance        I would like to know if there is any annual draws..I was told that i have won GBP1,000,000","solutions":["I would like to know if there is any annual draws..I was told that i have won GBP1,000,000No, there isn't. You did not win anything but you risk picking up a virus when responding to such fake announcements.","It is a SCAM.You have won nothing.All they want is your money and private and confidential information to steal your identity.Ignore and delete it.Protect yourself from tech support scams:https:\/\/support.microsoft.com\/en-au\/help\/4013405\/windows-protect-from-tech-support-scams_________________________________________________This is what used to be at this Microsoft link:\"What is the Microsoft Lottery scam?\"https:\/\/www.microsoft.com\/en-us\/safety\/online-privacy\/phishing-scams.aspxThe Microsoft Lottery scam is a fraud that usually starts with an email message that claims the recipient has won \"The Microsoft Lottery.\"There is no Microsoft Lottery and\/or Sweepstakes, and any message of this kind is designed to engage you in a dialogue with cybercriminals who want to persuade you to send them money.You have not won the \"Microsoft Lottery\" Microsoft customers are often targets of a scam that uses email messages to falsely promise money. Victims receive messages claiming \"You have won the Microsoft Lottery!\"There is no Microsoft Lottery. Delete the message.If you have lost money to this scam, report it to the Police. You can also send the police report to Microsoft and we will use it to help law enforcement catch the criminals who send out these e-mail messages.Cheers."]},{"symptom":"Windows 8.1 boot loop        When I restart it says 'Preparing Automatic Repair' then gets stuck in a loop 'Diagnosing your PC'. If I press f9 I can access a menu with Continue, Troubleshoot and Turn off your PC, but all three of these options cause an immediate freeze. Any advice? I don't have a CD.","solutions":["See if this assists you with your Repair options.You can use the power button to restart your computer three times. This will start the Windows Recovery Environment.\"How To Access Advanced Startup Options in Windows 8 or 8.1\"http:\/\/pcsupport.about.com\/od\/windows-8\/a\/open-advanced-startup-options-windows-8.htm\"How to Boot to Advanced Startup Options in Windows 8 and 8.1\"http:\/\/www.eightforums.com\/tutorials\/4935-startup-options-menu-boot-windows-8-a.htmlThere is detailed information here too.http:\/\/www.eightforums.com\/tutorials\/2843-automatic-repair-run-windows-8-a.html______________________________________________And please read this method:\"How to Boot to \"System Recovery Options\" in Windows 8 and 8.1\"http:\/\/www.eightforums.com\/tutorials\/2269-system-recovery-options-boot-windows-8-a.html@@@@@@@@@@@@@@@@@@@@@@@@If you need Media for Refresh and\/or to reinstall, read this information.You can contact the Laptop\/Computer Manufacturer and order Recovery Media from them for a small cost.You can download and create your own Windows 8.1 Installation Media to reinstall the Operating System with..\"Create installation media for Windows 8.1\"http:\/\/windows.microsoft.com\/en-us\/windows-8\/create-reset-refresh-mediaA similar Tutorial which may also assist you\"Create Installation Media for Windows 8.1\"http:\/\/winsupersite.com\/windows-8\/create-installation-media-windows-81In the first screen of this very simple wizard, you need to choose the following:Language. English – en-us if you're in the United States.Edition. Windows 8.1 (Core), Windows 8.1 N, Windows 8.1 Pro, Windows 8.1 Pro N, or Windows 8.1 Single Language.Architecture. 64-bit (x64 ) or 32-bit (x86)._______________________________________\"How to Create a Bootable USB or DVD with a Windows 8 or 8.1 ISO\"http:\/\/www.eightforums.com\/tutorials\/2227-create-bootable-usb-dvd-windows-8-iso.html   WarningThis will not work to install Windows 8 or 8.1 for UEFI. For that, see this tutorial below instead.UEFI Bootable USB Flash Drive - Create in Windows_____________________________________With Windows 8\/8.1 The Product Key on preinstalled Operating Systems (HP, Acer, etc) is embedded in the BIOS in the Motherboard, so that the lost and\/or worn C.O.A. Sticker problem is no more.When you reinstall it will pick up the Product Key and activate the system automatically.If it does not, follow these steps:\"How to Activate Windows 8 and 8.1 by Phone\"http:\/\/www.eightforums.com\/tutorials\/24636-activate-windows-8-phone.html\"Get help with activation errors\"http:\/\/windows.microsoft.com\/en-us\/windows-8\/activation-errors\"How to activate a Microsoft product by using Microsoft Product Activation Center\"http:\/\/support.microsoft.com\/kb\/950929\/en-us_______________________________________________This information may interest you if you do wish to keep a record of it:\"Windows 10 Embedded Product Key Tool\"https:\/\/neosmart.net\/blog\/2014\/windows-10-embedded-product-key-tool\/\"We’re proud to introduce the immediate release of our newest utility for Windows users: the NeoSmart Technologies Embedded Product Key Tool. Designed for users of Windows 7, Windows 8, and Windows 10, our embedded product key tool will retrieve and display the Windows setup product key embedded in the BIOS or EFI, allowing you to store it for safe-keeping or use it to reinstall Windows with an official Windows setup image.\"Cheers."]},{"symptom":"The application has failed to start because the side by side configuration is incorrect Windows 10        WINDOWS 10 Pro error The application has failed to start because the side by side configuration is incorrect please see the application event log or use the command line sxstrace.exe tool for more detail.I am getting the error \"\"WINDOWS 10 error The application has failed to start because the side by side configuration is incorrect please see the application event log or use the command line sxstrace.exe tool for more detail.\" for every application that i try to launch.I can't Install Quick Time AppPlease help ***Post moved by the moderator to the appropriate forum category.****Modified title for accuracy**Original title: \"WINDOWS 10 error The application has failed to start because the side by side configuration is incorrect.*","solutions":["Hi,Thank you for posting on Microsoft Community. I understand the inconvenience you are facing. I apologies for the delay in reply. I will certainly help you with this.This error may happen due to system file corruption or Visual C++ redistributable package corruption. I suggest you to follow the below given methods:Method 1:Kindly download and install Microsoft Visual C++ 2013 Redistributable Package from below given link and check if it helps:Visual C++ Redistributable Packages for Visual Studio 2013 http:\/\/www.microsoft.com\/en-in\/download\/details.aspx?id=40784Method 2:I suggest you to run System file checker. System File checker (SFC) scan is done to check if there are any corrupted system files that could be causing this issue. Kindly follow the below given steps:Press Windows key + X, select Command prompt (Admin) to bring up elevated Command prompt.In Command prompt type sfc\/scannow and press enter.Restart the computer.If no corrupted system files were found in the previous state, then I suggest you to try the following steps: Open command prompt by pressing Windows key + X and selecting “Command prompt admin”.In command prompt, type the following commands and press Enter after each command:                DISM.exe \/Online \/Cleanup-image \/Scanhealth                DISM.exe \/Online \/Cleanup-image \/RestorehealthClose the command prompt and restart the PC and check if it works.Hope this information helps. Please post back with the results, we will be glad to assist you further.Thank you.","The problem was corrupted Google Chrome, my default browser.  I deleted the program and installed a new one.  It works now."]},{"symptom":"codec        what codec is installed on windows 10","solutions":["Hi Gloria There are many codecs installed in Windows by default, can you please provide more detail on your question, are you experiencing difficulty opening media files and if so, what types of files can you not open on your pC, also, what media player are you using on your PC?","Thank you for your reply.The problem is, I am unable to open Serato DJ Pro on Windows Media Player ","Hi Gloria Sorry, I was offline . . . Are you creating tracks with Serato Dj Pro and then cannot play those tracks on your PC?If so, have you tried playing those tracks in the Groove Music App in Windows 10?If your tracks do not play in that App, what type of file (mp3, flac . . etc) are you outputting from the Serato software?"]}]}