{"windows":[{"symptom":"USB File transfer speed drops to 0 bytes and goes back up to normal multiple times        Hi, I just bought a new Kingston USB flash drive and when I tried it I noticed that when copying a file from the laptop to it file transfer speed keeps reducing to zero and freezes then goes back to the normal transfer speed and I tried it on a different laptop and I had the same issue. I searched for a fix to the problem but I came empty-handed and I need to know if the problem is in the flash drive or not so I can return itThe USB is 3.0 and I am connecting it to a 3.0 USB port. I made it on better performance from device managerI also full formatted the USB and changed its file system but nothing changed the problem remains the sameAn image shows the transfer, and when copying large files it makes the transfer take longer time than it should take","solutions":["There are spike on the picture once in 5 seconds. As for me this is not normal.But may be this is normal for this model if it has input cache - fill it in a second and then write this data to main storage during 5 second interval.High disk queue level speaks for this suggestion. I recommend to ask clarification from Kingston support."]},{"symptom":"microsoft store missing        hello after the updateof august patch my microsoft store is missing. Media files arent opening.It shows error \"you need a new app to open this ms store link\"pls help my work is been interupted","solutions":["This could help?https:\/\/youtu.be\/EQo53hvWy8Q","Hi TanishqTanwar, I'm Stefano an Independent Advisor, here to help you. Please try to re-register Microsoft Store: 1. Type \"Powershell\" in Windows search bar 2. Right click on \"Powershell\" 3. Click on \"Run as Administrator\" 4. Type : Get-AppXPackage *Microsoft.WindowsStore* | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register “$($_.InstallLocation)\\AppXManifest.xml”}and press ENTER. If this way you don't get Microsoft Store, please perform a REPAIR UPGRADE: https:\/\/answers.microsoft.com\/en-us\/windows\/for...","Hello, Try re-registering Store app. Perform these steps: 1. Search for Windows PowerShell using Cortana or Windows Search. 2. From results, right click on Windows PowerShell and select Run as administrator. 3. Then type following command and press Enter key: Get-AppXPackage *WindowsStore* -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"} Let the command complete. 4. Close Windows PowerShell. Let me know if issue still persists!","There are numerous \"solutions\" to the missing Windows Store app problem. I have tried ALL of them (really, all!), and variations of all of them. None of them work. The thing people giving the solutions don't seem to understand is that the Windows Store app is not installed AT ALL. None of the app's files are to be found on the system. The Powershell command commonly suggested:Get-AppXPackage *Microsoft.WindowsStore* | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register “$($_.InstallLocation)\\AppXManifest.xml”}doesn't work (can never possibly work) because the WindowsStore AppXManifest.xml file does not exist. Not anywhere. Not in the C:\\Program Files\\WindowsApps folder (though other app files are there). Not in some hidden folder. Not in ANY folder anywhere on my system. It is gone. It is deceased. It is an EX-AppXManifest.xml file. It has shuffled off this mortal coil. It has gone to meet its maker.Without that file, there does not seem to be any way to (re-)install the WindowsStore app. This is a SILLY situation, a sort of Catch-22: In order to re-install the WindowsStore app, you have to have the WindowsStore app files - yes, the very files you are trying to install!!!The only remnant of the WindowsStore app I have been able to find is a subfolder in the C:\\Users\\[username]\\AppData\\Local\\Packages folder named Microsoft.WindowsStore_8wekyb3d8bbwe. That folder has several subfolders, but they are all empty. In the registry there are a few WindowsStore entries, all either referencing the Packages folder or the WindowsStore license.Given that the WindowsStore files are not there, is there any way to install the WindowsStore app? Is the folder containing the AppXManifest file available anywhere for download? For example the folder for solitaire (which is on my system, and has its AppXManifest file) looks like:Microsoft.MicrosoftSolitaireCollection_4.4.8204.0_neutral_split.scale-125_8wekyb3d8bbweSo presumably there should be a similar folder for WindowsStore, like:Microsoft.WindowsStore_x.x.xxxx.x_neutral_split.scale-125_8wekyb3d8bbwe(which does NOT exist on my system). Is that folder available anywhere for download, and would it help if I had it? Or is there a .appx available for the app?Anything? Please? I can't believe there is no way to re-install the WindowsStore app in the above case!!!A very frustrated David","I am having the same issue.  ","**only working if you have a keyuse this and create a setup in pendrive or in your pc onliy(if want to install in the same pc)open it it will create a setup of win 10after the it will ask to installinstall it when you are ready as it takes timetheir will be option available-1-only install win102-keep data and delete all apps and install win103-clear installation(deletes everything) https:\/\/www.microsoft.com\/en-us\/software-download\/windows10","This could help?https:\/\/youtu.be\/EQo53hvWy8QTried that one well before I came here.  It didn't repair the Store, Feedback, or any of the other broken apps.  I had done a \"refresh\" on the machine when it slowed down to unusability, but I think the files for the various apps were already corrupted (the system had just received the 18980 insiders build).The thing is, the new build should have fixed or replaced the files if they were already corrupted (since the new revisions love to shove their app updates on you when you don't want them), so I have to suspect the update may have been the thing to break them.Sure, I could just do a full wipe and reload, but that doesn't track down the bug (it is a test machine, after all).","Guys you can install the store on xbox app on your windows 10"]},{"symptom":"How to find your Windows product key        This article will show you how to find your Windows product key.Digital License (Windows 10)If your PC ever had Windows 10 installed and activated on it, it probably created a digital license. A digital license is a hash of your hardware that gets sent to Microsoft, along with the product key that was used to activate Windows on that computer. If you ever need to reinstall Windows, just choose \"I don't have a product key\" during installation. Windows will contact the Microsoft Activation servers after installation, and activate with your digital license.Note: If you activated Windows 10 using a valid Windows 7 or Windows 8.1 product key, you'll also have a digital license.Printed on a Certificate of Authenticity Sticker (Usually older PCs running Windows 7, Vista and XP)If you have an older PC that came with Windows 7 or earlier, the product key is usually found on the Certificate of Authenticity sticker. The sticker is usually located on the underside of laptops, and could be on the top, sides, or bottom of a desktop tower. It looks something like this:Embedded in the UEFI\/BIOS (Usually newer PCs running Windows 8 or Windows 10)Most new PCs sold in stores today come with the product key permanently embedded in the firmware. Instead of printing the product key on a sticker where it could be easily stolen or smudged off, manufacturers are now opting to store it in the UEFI or BIOS. The firmware is located in ROM on the motherboard, which means if you upgrade other components like your hard drive, RAM, graphics card, or even your CPU, you should still be able to activate Windows. If you reinstall Windows, it will communicate with the firmware to install the embedded key. There is no need to retrieve the key yourself. If you want to retrieve it, you can do so by running the following command in cmd or Windows PowerShell:wmic path SoftwareLicensingService get OA3xOriginalProductKeyI purchased Windows 10 separately (Retail or OEM licenses)You can purchase Windows 10 as a digital download, or you can buy it in the box at a brick and mortar store. - For digital downloads through Microsoft You should receive an email with your product key, sent to the Microsoft account that was used to purchase Windows 10 online. If you can't find the email, check your spam folders. You can also get it by logging into your Microsoft account and going to the purchase history tab. - For digital downloads through AmazonVisit Your Games and Software.- If you bought Windows 10 in the retail packagingLook in the box for a card with your product key printed on it. It'll be about the size of a credit card with a 25-digit alphanumeric string printed on it.Azure Dev Tools for Teaching (formerly known as Microsoft Imagine and Dreamspark)This program provides students with Microsoft services, tools, training and operating systems at a discount or for free. Check with your school or university to find out if you can access this subscription and how to get assistance with the software licensing.","solutions":["what if I just bought a new CD and after peeling the covered product key (microsoft black sticker) to reveal the number and some of the number\/letter were not visible or sticked and peeled on the label, 5 are missing?please help, thanks","the product key sticker must be made of hard-sticker or coated one to avoid this kind of matter. (a valuable and expensive software but no reliable TAG or LABEL)","IS THIS WAY RELIABLE ?","not worked","That is an first option my friend, what if this is a new install (OEM) and cannot read or identify some numbers printed on the COA because of human error or some of the numbers were destroyed upon removing the microsoft black-cover sticker.The COA must be made of hard sticker, not a paper-type, did you get my point?In short this is a waste of money if I cannot retrieve or recover the number in your database.I hope microsoft will help me about this.... I already emailed (photo-shot) the COA to microsoft but still no reply (almost a-week ago).thanks","I did the notepad thing and got the product key. But it says that it's an invalid product key. What does THAT mean??","Product key for windows 7I did this to the letter and it worked but its the windows xp media ed that the computer came from the store with since then  computer i ungraded to 7 had a power outage and lost my boot mgmhad to redownload it but don't have the product key how or can I obtain it?????","Thank you for sharing the idea of Product Key.","It's July now and still no support from Microsoft about my concern.... what a waste of investment....","It worked"]},{"symptom":"Error code 0x80240fff        Error code 0x80240fff during an attempt to install some system updates","solutions":["Hi! Victor I'm Marvin an Independent Advisor, and I will help you with your issue. Try with these steps. 1. Select the advanced options, blue tab, under the retry bar 2. Now make sure the \"defer updates\" tab is checked If you still having problems with this, I will be around to help you. Regards.","Hi Marvin,In Settings\/Windows Update I see: \"There were some problems installing updates, but we'll try again later. If you keep seeing this and want to search the web or contact support for information, this may help: (0x80240fff)\"Button \"Retry\" and Advanced OptionsI have pressed 'Advanced Options' and get another screen \"Choose how updates are installed\" with \"Automatic (Recommended)\" option checked, Checkbox \"Give me updates for other MS Products...\" unchecked. I have checked this checkbox and tried again the previous screen. It worked longer but with the same result.Regards","Try with running the Windows update troubleshooter Follow these steps. 1. Press Windows + X, this will open your control panel 2. Go to the search box -> type troubleshooter in the search box and click “Troubleshooting”3. Find System and Security as shown in the below image. And then click on “Fix problems with Windows Updates”","I will reopen the question and another expert will come to help you. Thanks for being patient.","hi how can solve is problemThere were some problems installing updates, but we'll try again later. If you keep seeing this and want to search the web or contact support for information, this may help: (0x80240fff","I tried everything mentioned above.  I posted a screenshot of the WU troubleshooting tool results.  I just remembered the last time this happened.  I had to fix the name of the file in system32, and then it worked. ","I'm having this same issue. Machine was updating fine until the hard drive failed. The fresh install on a new SSD will not update.  Could there have been a change at Microsoft that is preventing an order disk from connecting?","It doesnt work. I have Windows 10 Home.",": (0x80240fff error code","I'm having this same issue. Machine was updating fine until the hard drive failed. The fresh install on a new SSD will not update.  Could there have been a change at Microsoft that is preventing an order disk from connecting?Same issue QVO 1Tb ssd samsung wont install updates?Any hardware incompatability?"]},{"symptom":"App to Take Screenshot          Hi I can't find screenshot plz explain   Thx Daniel[Original Title: Screenshot]","solutions":["Your question is not clear, would you mind elaborate it?What screenshot are you referring too?Do you have issue with taking screenshot?","Sorry if I was unclear. I can't find screenshot in my settings for the timer. I hope this makes more sense.Thanks , Daniel","Open start and search for snipping tool and I believe this is what you have been looking for."]},{"symptom":"Upload speed capped on windows 10        Okay so, for some unknown reason, my computer and brand new laptop both running on windows 10 home, are capping my upload speed at 7.9mbps (exactly 0.6mbps from my router's upload sync speed). At first it may seem normal to be running slightly lower than the upload sync speed, however on all my mobile phone devices, speed tests show that my phones are reaching between 9-10mbps. The exact same speed tests (And other speed tests) on my computer and new laptop show that the upload speed is being capped at 7.9mbps.The router is new. I have recently had the line fixed so there's no issue there. The fact that my new out of the box laptop is also capping it makes me believe there's no malware or virus issue going on here. The only thing I have narrowed it down to is that Windows itself is capping the speed somehow. I have also tried connecting to the router via ethernet cable however the speed is still capping at 7.9mbps. It is ALWAYS capping 0.6mbps under the sync speed and I'm not sure what is causing it. ","solutions":["Hi Amaad, what technology is used for your home Internet? Seems you have ADSL connection (landline phone line used). In this case download and upload channels are asymmetric and result is exactly as expected.","Then why am I receiving a much higher upload speed on my mobile devices? I receive 9-10mbps upload speed on them however on my laptop and computer, I only receive 7.9mbps max.","Does mobile devices use mobile internet or Wi-Fi from your home internet? Seems they are using 3G or 4G mobile Internet i.e. another connection.","Nope it uses Wi-Fi. I have tried taking Data off incase it was also getting into there to increase the speed, however even so, it shows that it has a greater upload speed and can seemingly utilize all of the upload speed it is acquiring from the router, whereas both my computer and laptop cannot. They are both capped at the exact same speed. ","What exactly technology is used for your home Internet connection? Or tell exact router model - it may tell information required.","I'm using ADSL like you suggested, I'm also using the talktalk wifi-hub, however I have also tried with the talktalk super-router and am receiving the same issue. Upload speed is being capped at 7.9mbps. ","ADSL technology is asymmetric and seems you have 8\/0.75 or 8\/0.6 MBps speed. You may check this in router settings. When your phones shows high speed the seems to use mobile connection.Please check router settings. It cannot provide speed higher than channel speed.","That's the issue. It is not using mobile connection. And it has previously reached the same numbers that my phone currently reaches. I have tried the speed test on my Oneplus 3 which does not have a sim inside it however the upload speed test still shows it reaches 9-10mbps. It is strictly limited to my PC and Laptop currently. ","Please check channel speeds your router reports. Or show screen with channel speeds.","I'm getting a new router tomorrow, if the problem persists I'll show everything about the router and what's going on."]},{"symptom":"Unable to link Activated Win10 PC to MS Account        I have Win 10 and it is activated with a Digital Licence. However everytime I try to link it to my MS Account it states that \"Something Went Wrong\" and does not give me the oppotunity to link.This may also be linked to the inability to run Edge and MS Store.I tried to add my PC to my MS account, having logged in to my account through Chrome, buut it fails oto find my PC.","solutions":["Go Settings, Account.  You may have to Verify you account.If you click on Manage my account it shows up in your browser and you need to click there to see all the items.","Hi BrianCox4B My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Check the Microsoft Account Sign-in Assistant Service is started Step 1: Press Win + R keys to bring up the Run dialog box. Then type services.msc and click OK.Step 2: The Services window opens. On the right pane scroll down to find Microsoft Account Sign-in Assistant Service, and then double-click on it.Step 3: Make sure the Service status is Start. Click the drop-down behind the Startup type and select Automatic or Manual. Then click Apply and OK to save the changes.Step 4: Restart your computer and then try to sign in Windows 10 with Microsoft account.Hope this helps.","Go Settings, Account.  You may have to Verify you account.If you click on Manage my account it shows up in your browser and you need to click there to see all the items.Hi - Where is \"Manage my account\"? - I cannot find anything that leads to \"Verify Accouunt\".  logging on in my MS account through Chrome - only allows me to change password - but the account is working with everything else. Going to Account and Info in Win 10 and adding a MS account resuults in the \"something went wrong\" message,.","Hi BrianCox4B My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Check the Microsoft Account Sign-in Assistant Service is started Step 1: Press Win + R keys to bring up the Run dialog box. Then type services.msc and click OK.Step 2: The Services window opens. On the right pane scroll down to find Microsoft Account Sign-in Assistant Service, and then double-click on it.Step 3: Make sure the Service status is Start. Click the drop-down behind the Startup type and select Automatic or Manual. Then click Apply and OK to save the changes.Step 4: Restart your computer and then try to sign in Windows 10 with Microsoft account.Hope this helps. Thanks for this - all steps taken but still has same problem of \"Something went Wrong\" message","Hi BrianTry creating a new local accountStep 1: Open Windows 10 Command Prompt as administrator by clicking Start, type cmd and right click the result and run as administrator.Step 2: Type net user <username> \/add (for example: net user iSumsoft \/add) and hit Enter key to add a new local user account. Then type net localgroup Administrators <username> \/add and hit Enter key to make the user an administrator account.Step 3: Sign out your current account. Then sign in Windows 10 with the newly added local admin account and then try to sign into (switch to) Microsoft account.Try Troubleshooting programStep 1: Download the program Microsoft Accounts troubleshooter from https:\/\/download.microsoft.com\/download\/F\/2\/4\/F...Step 2: Run the program. It will automatically detect invalid settings on your system. Just need to click Next and wait till troubleshooting is completed.Step 3: Once problems are fixed, reboot your Windows 10 and then try to sign in to Microsoft account.","Hi BrianTry creating a new local accountStep 1: Open Windows 10 Command Prompt as administrator by clicking Start, type cmd and right click the result and run as administrator.Step 2: Type net user <username> \/add (for example: net user iSumsoft \/add) and hit Enter key to add a new local user account. Then type net localgroup Administrators <username> \/add and hit Enter key to make the user an administrator account.Step 3: Sign out your current account. Then sign in Windows 10 with the newly added local admin account and then try to sign into (switch to) Microsoft account.Try Troubleshooting programStep 1: Download the program Microsoft Accounts troubleshooter from https:\/\/download.microsoft.com\/download\/F\/2\/4\/F...Step 2: Run the program. It will automatically detect invalid settings on your system. Just need to click Next and wait till troubleshooting is completed.Step 3: Once problems are fixed, reboot your Windows 10 and then try to sign in to Microsoft account.Hi Jon, Thank for the reply - the new admin account had the same result as the original account.The MA troubleshooter detected a Proxy problem - that it fixed and detected that there was no MS account linked to Windows 10 (!).So attempted the Use MS Account and got exactly the same result of Something Went WrongArrgghh!Brian ","Also - perhaps weirdly - OneDrive and Windows Update are both working fine - linked to my MS account.","Are you signing in to windows using your MS account or a local account?","Are you signing in to windows using your MS account or a local account?A local account- the main issue is that I cannot log \/ link into MS account via Win 10 - see first post.","So just to recap, going to settings>accounts and selecting sign in with Microsoft account instead is where it falls down?"]},{"symptom":"Other user        Hello! I can't create another user for my PC because on the lock screen page the option: 'Other user' doesn't show. What can I do?","solutions":["Have you looked at Settings>Accounts>Family and other users?","Yes I have. But the thing is that I want to add a microsoft user account and make that an admin. So I dont want just to create a simple account.","I also tried this, but it didn't help.1. Click on the Power button on the login screen.2. Press and hold the SHIFT key on keyboard and simultaneously click on Restart option.3. Once your PC restarts, on the Choose an optionscreen, tap or click Troubleshoot. If you don't see the Startup Settings option, tap or click Advanced options.4. Tap or click Startup Settings.5. Tap or click Restart.6. On the Startup Settings screen, choose the startup setting for Safe Mode with Networking (Generally F5 key is pressed to select this setting).7. Sign in to your PC with a user account that has administrator rights.","Hello Ola, I am Andrew an independent advisor. Are you saying you CAN create another user, however when logging in the new user does not show up on the login screen?Once you're logged in are you able to switch to this new user?","Hi! I actually can't create a user directly from the lock screen, because the function 'Other user' doesn't show at all.","Ok, you don't create another user from the lock screen. Press Winkey + I to open Settings. From here you can find Accounts, and create a new user profile within here.Microsoft has a good step by step here if you need the help at any point. https:\/\/support.microsoft.com\/help\/4026923\/wind..."]},{"symptom":"Перезагрузка не работает.        Пуск\/выключение\/перезагрузка, бублик перезагрузки крутится вечно компьютер на перезагрузку не уходит. только выключение кнопкой. Что делать ? ","solutions":["Добрый день. В поиске наберите Планировщик и откройте планировщик заданий. Отключите в нем все задания(в секции Библиотека планпровщика). Нажмите Win+R, в поле напечатайте taskmgr \/0 \/startup и нажмите Enter. Отключите все что есть в автозагрузке. Выключите компьютер.Проверьте проблему.","ваш совет не помог, приходится отключать компьютер кнопкой питания"]},{"symptom":"windows 10 mail app crashed now is not working        this morning i was in the process of sending an email when the default windows 10 mail app crashed and has not worked since. the app crashed at 10 am and as of 545 pm i am still unable to get any mail through the app. i have restarted the laptop, forced restart of mail app and nothing is working. i can open the app but am unable to do anything else. i can not go into the app settings to check email settings or anything. is there a way to fix it without uninstalling the app and losing all of the emails in there . this is very frustrating as i can not seem to find a answer to this problem. i have run the windows 10 troubleshooter and it says everything is fine. i have all the latest updates on laptop thank you for any help you can provide ","solutions":["Hello SONDRAR, I am Andrew an independent advisor. You can attempt to repair the mail program by going to Settings>Apps.Press Winkey+i to get to settings quickly. Open the Apps windows and find the mail app. Right click on it, you should see a repair option. Use this and then try your app again.If this continues please let.us know, we can do more troubleshootingTake Care,Andrew","I have the same problem as SondraR. My mail app crashed the other day and has not been working since. I ran troubleshooting and all it told me was there was a hanging or crashing app problem that was not fixed.I followed the advice you gave SondraR but when I opened the mail app I was not able to right click on it nor did I see a repair option. All I found was a Reset Option but I have never done this and don't know what I will loose if I reset the app."]},{"symptom":"StartupCheckLibrary.dll  not found!!        Hey , i have tried all of possible things to do in my laptop but  it is still giving me a error.i have also done the autorun.exe  but it cann't solve my problem .and also my laptop is very slow after update and it takes 3 to 4 minutes to start completely i am thinking it is due to this error ...please help me , Thank u for your support in adv.","solutions":["Hi Darshan263 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","hey Joseph , thank u for your reply.i have already done this CMD type method but it had not change anything in my error.it is still there and annoying.please give another way to solve this problem.","Hi Darshan263, I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.1. Search for Task scheduler press enter. Click on the arrow in front of Task Scheduler Library then on the arrow in front of Microsoft then on the arrow in front of Windows then on Application Experience. Look in the next pane for StartupCheckLibrary and right click and delete,Also check: Microsoft\/Windows\/WDI and look for SrvHost. If you see it then right-click and delete.http:\/\/www.geekstogo.com\/forum\/topic\/373867-the...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","If i will delete those files\/stuffs , it can be not good for my pc . so how can i download\/install those deleted files\/things which you told me to delete.","Hi Darshan263, It's not an infection or anything like that regardless of what Windows Defender thinks. It's just some old tasks that were removed by a recent update or should have been removed and weren't. The defender had a false positive on one and removed the .dll which caused the error. Removing them will have no effect as they are no longer present on systems that are up to date.http:\/\/www.geekstogo.com\/forum\/topic\/373867-the...*Do a backup or make a restore point before proceeding. It's a good idea to create a restore point before you make any changes to your computer that could potentially cause problems or make the system unstable.Thanks! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","thank you ! for your support","Hi Darshan263, Please let me know if the issue is resolved. If you don't have any more questions, feel free to choose a rating and have a great day!Thanks!"]},{"symptom":"Activate Windows        Hello,my computer died and i had it rebuilt.We did a mirrow image over to the new hard drive.Now im being asked to activate my windows 10 but I never had a key.  The upgrade was free from windows.How do I activate?Thanks so much,Paul Zaccaria","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,First, you'd need to identify if the product key for the windows 10 computer is either a retail or an OEM key.Normally OEM keys are solely embedded to one motherboard as they do not have transfer rights for other hardware, unlike retail keys which has transfer rights.For free upgrade licenses, the condition for these are relevant to an OEM key as the license is then considered a digital license once you upgraded free to windows 10.Under this link are reference to activation after hardware change https:\/\/support.microsoft.com\/en-ph\/help\/20530\/...For your windows 10 license, I'd recommend running the activation troubleshooter. Go to Settings>Update and security>Activation and run the troubleshooter. and select I recently changed hardware on this device.If the troubleshooter hasn't helped, you would have to call Microsoft during support hours to get more help.https:\/\/support.microsoft.com\/en-in\/help\/405170...","Thank you for all you wrote, however, I had tried all of that already.None of it works.Is my only alternative to purchase a new key for $135.00?  That's not really fair since I have no control over my old computer dyeing on me.What do you think?Thanks so much,Paul Zaccaria","Some users has reported that their previous retail product key before upgrading to windows worked on an entirely different hardware after they replaced their motherboard, although this may not apply for everyone. I would recommend considering getting a windows 10 retail key, in any case you plan on upgrading your device or plan on transferring your license to a different computer."]},{"symptom":"windows 10 blurry login        Since updating Windows 10, my login screen goes blurry . Unlike other threads on this topic, logging in is fortunately still possible, but the change is unwelcome. Advice from those threads suggest that I should personalise the display and turn off transparency from the colours settings. This is not possible. In the first place, the transparency switch is not visible, but on leaving the colours settings and invoking them again, the transparency switch does appear, but is already switched off and is not enabled.This appears to be an unrequested and buggy feature change. Why do we have to tolerate such rubbish?","solutions":["Hi fthynne, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.To disable Acrylic blur on the sign in screen see the following tutorial: How to Enable or Disable Acrylic Blur Effect on Sign-in Screen Background in Windows 10https:\/\/www.tenforums.com\/tutorials\/124993-enab...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads."]},{"symptom":"Upgrading to Windows 10 from Windows 7 on RAID 1 environment        i need to install windows 10 in my old windows 7 pc due to win 7 is done in 10 days,,,will installing win 10 delete the raid 1 volume in my pc...or should i delete the raid volume before i install win 10....i really need some help,,i cannot afford another pc yet so i have to go this route.....thanks***Original title: installing win 10 from win 7,,,technical question about raid 1***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query related to upgrading to Windows 10 from Windows 7 on RAID environment. Ideally, when you are upgrading Windows on a RAID environment, you need to remove the RAID environment and then proceed with the upgrade. However, we do have a dedicated forum where you should be able to find support. Let me help you in pointing towards the right direction. I would suggest you to post your query onTechNet forums, where we have support professionals with expertise on RAID environment to assist you with your query. Regards,Prakhar KhareMicrosoft Community – Moderator","thank you prakhar,,"]},{"symptom":"No Control Panel to modify available multiple Input Languages of a language.        Hi,My computer lists different input languages, one for swedish, two for arabic and threee for English.I obviously only want one of each languages.Swedish, English (doesn't matter, but prefer US Keyboard and grammar, but don't really care) and Arabic.On the arabic, I'd rather have it Lebanese\/Palestinian for vocabullary suggestions, but since I am using aWinXP targetted, discontinued plug-in for Roman-to-arabic input (IME) that was complicated to install and set up on Windows 10, I'd rather have it not touched, since I don't have an arabic keyboard, never have used one etc...Language Input MenuLanguage PreferencesOptions for English KeyboardsArabic","solutions":["Hi MahNas, I've checked a thread and it seems helpful. Please try and check this thread and see if it will work: https:\/\/superuser.com\/questions\/957552\/how-to-d...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","It is not helpful, as I showed in my screenshots, that I found the very same Settings of \"preferred language\"...Only 3 \"keyboards\" are listed in my list, when I have 6 options...."]},{"symptom":"How to delete admin account        I have inherited a laptop from a prior employee and the person left and I do not have PIN or PW.  I am trying to download Adobe and it wants me to enter an Admin PIN.  If I try to change Account User from Control Panel it wants the PIN?  I am stuck. I cannot make myself an Admin without the PIN.  Any suggestions. I have been using the laptop for a few months and have not had this issue until I tried to download the Adobe Software today.Thanks","solutions":["Please can someone answer SJ's question! I have been trying to get into my account and can't remember Administrator password. I am on day 5 trying to figure this out! There has to be a way!!","Hi SJGSHR Click your Start Button, then just type netplwiz and hit Enter Does that open a window and if so, on that Window how many users are listed and is the profile you are using listed as a member of Administrators?","Hello SJGSHR,Since this is a used computer, it would be best to reset it to start over fresh and set up with your account instead as administrator.https:\/\/www.tenforums.com\/tutorials\/4130-reset-windows-10-a.htmlIf this is a work computer, then I would recommend taking it to the IT department to have them reset it instead.","It does not list me, only the person who has the account I don't have the PIN for.","No IT Dept. small company of 3 and I am 1 of the 3. :-(","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. In order to Delete an Admin account you must be logged into another Another Admin account.If there is another Admin account in this computer, please log in to that account or ask that Administrator to log into his account and delete the account you want.","Hello-The other Admin person is no longer at the company and when I reached out to the person they don't remember the PIN. How do I make myself an Administrator? Every time I think I am making progress the screen pops up User Administrator asking for the PIN.","If you do not have access to the other Admin account you may need to ask the IT admin of your company to raise the Account Privilege of your user account.The other way around is to Reset the PC.","There is no IT Dept. small Co. if I reset the computer will I lose what I have on it? How do I reset it?","Yes, you need to back up all the data in this computer before performing a system reset.Here are various steps to reset the PC: https:\/\/support.microsoft.com\/en-in\/help\/402652..."]},{"symptom":"Restricting Settings and Control Panel for specific login        I have local admin rights on all of our PC’s. The one account most people use we named “Logon” how can i restrict anyone using this username from accessing control panel and settings but still allow any other username regular access? They all are running the latest version of Win 10 Pro. Thanks!","solutions":["Hello James,You could use the method in option 2 of the tutorial below to disable Settings and Control Panel for this specific user via group policy since you are running Windows 10 Pro.https:\/\/www.tenforums.com\/tutorials\/70002-enable-disable-control-panel-settings-windows-10-a.html","Hello James, i'm Timon and i'm glad to help you. You can try this in the Registry Editor: - Use the Windows key + R keyboard shortcut to open the Run command. - Type regedit and click OK to access Registry Editor. - Navigate to HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer from the left sidebar- Right-click empty space in the right pane and choose New > DWORD (32-bit) Value.- Name your new value NoControlPanel and change the value from 0 to 1. Restart needed for the registry changes to take effect. After rebooting you’ll be unable to open Control Panel. If you want to restore access to Control Panel, just change the NoControlPanel value from 1 back to 0.","Thank you both. Two Questions:#1: If using group policy to restrict settings and control panel, if i do this on one PC will it affect all or do i need to go to each one individually and do it. Also, do i do this logged in on the account i want to restrict and enter admin credentials or do i login as Admin?2) If using registry - same questions as above and will that also restrict settings too.i work at a call center and they all use the same login, this is the account i want them to be able to change nothing. They change colors, desktops etc.","You will be able to apply option 2 for the group policy to only the specific user you selected.https:\/\/www.tenforums.com\/tutorials\/70002-enable-disable-control-panel-settings-windows-10-a.html","Assuming you don't use Active Directory: #1: Using group policy only affect one PC. You will have to go to each PC. You have to do it as an admin. Please note that this affect all users #2: As for group policy, using the registry only affect one PC. If you edit the HKCU branch, being an admin is not mandatory, as this only affect the logged user.","How and where do i edit this branch, and why when i change settings it changes it for admin too? How can i have it only affect standard users?","To edit the registry, open the Start Menu, type Registry Editor and select Registry Editor.Then navigate to the wanted branch. Changes made to the HKEY_CURRENT_USER branch only affects the user currently logged on.If you want to populate settings to several users, you will have to do it user by user.In this case, using the Group Policy would be an easier way to do.","Ok, so i can edit the registry of that specific user. Will it prompt me for Admin rights to save it, or will i have to go through 100 steps. I just want control panel, system, and personalization not be made available to them. Are there any scripts you may know of for me to use?","Indeed you can edit the Registry for that specific user. If the user is the owner and has \"Allow FullControl\" listed under Access, you won't be prompted for admin rights.Here is some script you can add in a .bat file to simplify the process: Disable Control Panel: REG ADD HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer \/v NoControlPanel \/t REG_DWORD \/d 1Prevent Changing Desktop Background: REG ADD HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\ActiveDesktop \/v NoChangingWallPaper \/t REG_DWORD \/d 1","Great, is there also one for NoSettings? In Group Policy I can do all this except it even blocks an admin account which i find odd. Its just one login i need to restrict, and itd be great to use group policy if admin could still access everything to without having to manually go in and turn it off."]},{"symptom":"bcbtums: Failed initializing BT device, failed RAM patch download.        There is a problem with the default Windows 10 driver for ASUS USB-BT400The 'bcbtums' source reports the device initialization failure event:Failed initializing BT device, failed RAM patch download.-System-Provider[ Name]bcbtums-EventID1026[ Qualifiers]49152Level2Task0Keywords0x80000000000000-TimeCreated[ SystemTime]2020-01-07T12:54:55.729907200ZEventRecordID1075ChannelSystemComputerDESKTOP-MS4VND9Security-EventData000004000100000000000000020400C000000000000000000000000000000000000000000000000005000000Then 'WindowsUpdateClient' source reports update failure:0x8024CE0A: Broadcom Corporation driver update for ASUS USB-BT400.-System-Provider[ Name]Microsoft-Windows-WindowsUpdateClient[ Guid]{945a8954-c147-4acd-923f-40c45405a658}EventID20Version1Level2Task1Opcode13Keywords0x8000000000000028-TimeCreated[ SystemTime]2020-01-07T12:55:00.941930600ZEventRecordID1078Correlation-Execution[ ProcessID]4604[ ThreadID]6104ChannelSystemComputerDESKTOP-MS4VND9-Security[ UserID]S-1-5-18-EventDataerrorCode0x8024ce0aupdateTitleBroadcom Corporation driver update for ASUS USB-BT400updateGuid{5a44c4ed-f45a-4b74-a45e-45fda662e388}updateRevisionNumber2serviceGuid{8b24b027-1dee-babb-9a95-3517dfb9c552}And then 'BTHUSB' source reports some supported mask mismatch.-System-Provider[ Name]BTHUSB-EventID34[ Qualifiers]32773Level3Task0Keywords0x80000000000000-TimeCreated[ SystemTime]2020-01-07T12:55:01.155448300ZEventRecordID1080ChannelSystemComputerDESKTOP-MS4VND9Security-EventData0x2491f7fffff0x1fffffff00000000030028000000000022000580000000000000000000000000000000000000000000000000The solution is to download and install the original ASUS USB-BT400 driver.But why does the standard Windows driver fail with that?","solutions":["Hello Koichi, I am Andrew an independent advisor. I'm happy to hear you have figured out how to fix this issue. I urge you to report the Windows driver error to Microsoft via the feedback app.Search for FEEDBACK in the searchbar, this will open the app for you. Be as specific as you can with your hardware and what led to the issue.Thank you and take care, Andrew"]},{"symptom":"My pc does not support Miracast        My pc says it cannot support Miracast. can anyone help?","solutions":["Yes it should as I see. Have you checked for display driver and wifi updates?"]},{"symptom":"Is \"svchost_?unknown_hosted_dll\" a virus?         the ? in there makes me suspicious because im having a long stall when i open up files in my onedrive. ","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. svchost.exe is a system service. However, I suggest you to go to services.msc Right click on this \"svchost_?unknown_hosted_dll\" and select Open File Location and let me know the origin of this program and folder location.","Ok  Im rumning a memory scan for the last jour  when its finished ill check it out  appreciate your help","No problem","Its shows its in local services other thann that im pretty sure ive got a virus  been fighting it all night","May I know the folder location of this service?","Im unable to get online with the computer so im online with my dell   thing im going to call Microsoft"]}]}