{"windows":[{"symptom":"Microsoft Sign-In Issue        When I am trying to open a Microsoft Word document to edit the document, I often see a notification at the top of the document that says that I need to sign in to my Microsoft account in order to upload the document to the cloud. I have to go through the actions to sign in to the account each time this happens. Additionally, I often get a notification that says:Microsoft account problemWe need to fix your Microsoft account (most likely your password changed). Select here to fix it in Shared experiences settings. I want to know why this keeps happening? I sign in to my account each time. My password has not changed, so I'm not understanding why I keep having to sign in again. I am running Windows 10. ","solutions":["Hi CeliaSpence, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Follow the instructions in this link to try to solve the problem, they are websites that share Windows MVP, there you are told what this feature is about, and how to handle ithttps:\/\/www.trickyways.com\/2019\/06\/fix-microsof...What Are “Shared Experiences” on Windows 10? https:\/\/www.howtogeek.com\/303300\/what-are-share...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"surface pro keyboard and Microsoft wireless Bluetooth keyboard not working with surface pro 4        I am having trouble with both of my keyboards the tablet cover and the wireless.    I bought a new tablet cover thinking it was the old one and that did not work either.    Then I connected it to the docking station where I use the Microsoft wireless keyboard and that is not working either.zI checked and all of the updates are current.  Need help please.","solutions":["Hi, VLbah My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to run the troubleshooter for Bluetooth. Go to Settings - Updates & Security - Troubleshoot. Click on Bluetooth under Find and fix other problems. Follow the on-screen instructions.https:\/\/support.microsoft.com\/en-ca\/help\/402622...https:\/\/support.microsoft.com\/en-ca\/help\/15290\/...Try to update the Bluetooth drivers https:\/\/support.microsoft.com\/en-us\/help\/402844..."]},{"symptom":"Accessing my Administartor account        The previous owner of my laptop had a password protected Administrator account (I have no way of contacting them) of which, while trying to change that, I accidentally gave it all authority and now I cant even install any new apps, make major changes to the computer or even try to go to the control panel to change the user account settings. I tried to change it through command prompt but I always end up withsystem error 5 and access denied. Please I am in need of help, I don't know the password to this account and I can't hack it. My laptop is windows 10, HP NOTEBOOK 10 pro. Is there a way I can fix this problem without needing to reset my pc","solutions":["Hi Kudzai Honestly, a Reset or clean install is the only way to resolve this, you will find lots of fixes, including activating the built-in Administrator account in Windows 10, the problem with that is it is a catch 22, you need to be an admin to do that . . .I am sorry, but the only and best fix is to reset WIndows and if you cannot do that due to a password then a clean install of Windows 10 is the only way to go . . ."]},{"symptom":"Recovering deleted Desktop files        So i wanted to clear my desktop, so i moved all my desktop files onto my terabyte drive in a folder. After that I deleted every file permanently, thinking that i saved my files into my terabyte. The next day, i realize that all the files were copied as shortcuts to my terabyte. I had no access to any of these files.I have tried using Recuva to recover my desktop files, but nothing showed up.Is there any hope for me?","solutions":["You can try the following:1. Look in the Recycle Bin2. If Recuva didn't work, try two or three other similar programs.3. Send  (or take) the drive to a company that specializes in recovering deleted data. WARNING: This service is very expensive and may or may not work in your case.And for the future, be aware that almost everyone should be backing up to external media regularly. It is always possible that a hard drive crash, user error, nearby lightning strike, virus attack, even theft of the computer, can cause the loss of everything on your drive. As has often been said, it's not a matter of whether you will have such a problem, but when."]},{"symptom":"Task Barr problem.        On the Task Bar, I can't set the speaker volume to be permanently displayed.  I have to click on the \"up arrow\" then adjust my volume.  Thanks for any help.","solutions":["Hi John A little known fix for this is: Open that small panel that results form the up arrow, then you can click and drag the Volume Icon onto the Taskbar and it will stay there . . ."]},{"symptom":"FOLDERS        I just had Windows 10 installed on my PC and have a question regarding 'changing the path' to a folder.At the beginning of each year I create a new folder to download pictures from my Canon camera to.In Windows 7 I was able to have my pictures sent to the newly created folder by going through Control Panel\/Devices and Printers, double clicking on my Canon camera image and following the steps(path) to my newly created folder.Unfortunately with Windows 10 I can do the first few steps but am not able to find the next step that would lead to the other steps to the new folder.I hope this makes sense.  Don","solutions":["Hi Don, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Right click Start>Run. Type in control printers and press enter. Does the icon for cannon appear in the Window?","Hi Sumit, thank you for replying. I right clicked Start and Run, typed in control printers, pressed enter, but the icon for Canon did not appear, but when I plug my supplied USB cable into my Canon camera and into my PC the Canon icon appears in Devices and Printers.","Hi Don, You should be able to change settings when Importing just before. https:\/\/answers.microsoft.com\/en-us\/windows\/for...","Hi Sumit,Thanks for your reply. I have been crazy busy with Christmas and am finally getting back to this issue of mine. I think I may have been going in the wrong direction. Canon has a browser called Zoom Browser that directs the photos to whatever folder you have designated before hand. I think I will contact their support to find out how to change the folder where I want the photos to go to. Unless you are familiar with Zoom Browser I thank you for your input.RegardsDon "]},{"symptom":"Should I move applications folder back to C drive?        Hello,When my machine was new several months ago I moved my applications folder to a different hard drive but have only been able to install Adobe Photoshop, Lightroom and Acrobat in the applications folder on the drive other than C. Microsoft Word, Excel etc., according to their webpage cannot be installed on a drive other than C, I have purchased some more applications and a few of them at least need to be installed on the C drive, I have not installed them yet.The machine is only a few months old and doesn't have much installed on the C drive other than Firefox and ASUS for mobo and MSI for video card along with some of the Office applications.I'm new to Windows and I feel uncomfortable having some in the applications folder on a different drive but some and maybe soon to be many installed on C drive where they are buried in the (86) folder I think.Should I just wipe the C drive clean and reinstall Windows 10 Pro and install all my applications in C drive?Leave it as is and continue on? Try to move the applications folder back to C drive, uninstall the existing applications that are in the (86) folder and reinstall in applications folder?Or something else?Best regards,G.A.","solutions":["What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK","Hi G.A.Crunch I'll give you my personnal sight on this question. There is no real difference in the installation folder. It's only a different path, but it won't affect anything else.Depending on your hardware, if the software are installed on a HDD (a plater disk drive), the access time will be a bit longer, than on a SSD (flash drive).Other than that, it's up to you. For my main computer, I use the C:\/ drive for softwares, another drive for games, and another one for my data.But again, it's more a habit than anything else. I hope this helps Regards","Also I should perhaps precise that you have to reinstall the software where you want it to be. You can't just move the folder around.But it's quite obvious. As I said, for the rest, it's only a matter of habit.","What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK  Version 1909 (OS Build 18363.535)","Jay#222,You think it's not a problem to have applications on two different drives at the same time, that's how I understand your replies?My C:\/ drive is 500gb NVME SSD that I moved the applications folder from. The Drive I moved the applications folder to is a 7200rpm 2TB HDD.I had many people telling me when I built the computer and initially set it up to put all my applications on a different drive so that it will be easy to reinstall the OS when something goes wrong. Now I'm finding out not all applications will install on a different drive that the applications folder was moved to.Best,Crunch","What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK lacrumb,Can you tell me how the OS build number plays a role in this? I'm interested in learning as much as I can about Windows.Crunch","This is to me that if it is an old build the problem may have been reported and may have been addressed.","As I said, it makes no difference. Your NVME drive is a lot faster than the HDD. By the way, if you have to reinstall the System, you'll have to reinstall also most of the softwares (as all their data aren't in the installation folder, but also in various windows folder).Split as it suits you the best.","This is to me that if it is an old build the problem may have been reported and may have been addressed.Thank you.","As I said, it makes no difference. Your NVME drive is a lot faster than the HDD. By the way, if you have to reinstall the System, you'll have to reinstall also most of the softwares (as all their data aren't in the installation folder, but also in various windows folder).Split as it suits you the best. Thank you."]},{"symptom":"what software will i need for windows 7 to be able to play ubisoft computer games.        what software will i need for windows 7 to be able to play ubisoft computer games.","solutions":["You will be able to run any games and you only need its execution file.However, games might required certain hardware specification like RAM , GPU and others and you will need to check game's requirements.","please make the answer more clearer.what do i need to download for game to work?","please make the answer more clearer.what do i need to download for game to work?You need to make your question clearer:  what specific Ubisoft games are you interested in?Actually, your best source of information is Ubisoft itselfUbisoft support:  https:\/\/support.ubi.com\/en-USUbisoft forums: https:\/\/forums.ubisoft.com\/","silent hunter wolves of the pacific.","silent hunter wolves of the pacific.As near as I can determine, the \"minimum requirements\" for this game include \"only XP and Vista.\"  See, for example,https:\/\/store.steampowered.com\/app\/15200\/Silent_Hunter_Wolves_of_the_Pacific\/https:\/\/support.ubi.com\/en-us\/Faqs\/000011438\/Minimum-Requirements-PC-SH4On the other hand, seehttps:\/\/www.game-debate.com\/games\/index.php?g_id=686&game=Silent%20Hunter%204:%20Wolves%20of%20the%20PacificAgain, you should really ask either in the Ubisoft forum (if you have the actual install CD) or on the Steam forum (if you are going to get it from Steam). https:\/\/steamcommunity.com\/app\/15200\/discussions\/"]},{"symptom":"New app on windows 10        I downloaded a new home and student office app . I could only find it among my downloads so I moved it to my desktop . On double clicking it I got the message asking if I would allow it to make changes . I clicked yes and it appeared to download again . I thought I was home and dry but when I double clicked it again the same message appeared asking if I would allow it to make changes . I am not tech savvy so any answers please make simple .","solutions":["Hi Patricia So, if that is there, hopefully it is installed correctly . . . Click your Start Button and then just type word Does Microsoft Word show up in the resulting list? If so, right click that and choose 'Pin to Start' That will create a new Tile on your Start Menu for Microsoft Word, to make it easier to open WordDo the same for the other Office applications (Excel, PowerPoint .. . etc.) If Microsoft Word does not show up in that resulting list, please let me know . . ."]},{"symptom":"error 0x80070781 in microsoft store        i tried a lot To fix error 0x80070781 But Doesn't Work in This Account (Name : HeyIm7MoODy)I Want To Open This Account in MIcrosoft Store To Donwload Minecraft But When I login in it Says \"Try Again Later\"  Error 0x80070781I want To fix this Error I TRied Many Ways But Not Fixed I Updated The Windows , i used The CmdAnd i Updated Microsoft Store But Not Wooooooooooooooork Help Please","solutions":["Hi Heylm, Based on your concern, there's a lot of people experiencing this kind of issue as well.What I can suggest is to rollback the updates: https:\/\/lifehacker.com\/how-to-undo-and-prevent-...And disable your windows update for the mean time, please follow this link for detailed guide:https:\/\/www.cleverfiles.com\/howto\/disable-updat...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Hi Heylm, Based on your concern, there's a lot of people experiencing this kind of issue as well.What I can suggest is to rollback the updates: https:\/\/lifehacker.com\/how-to-undo-and-prevent-...And disable your windows update for the mean time, please follow this link for detailed guide:https:\/\/www.cleverfiles.com\/howto\/disable-updat...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards, I tried but not fixed and i cant roolba ck windows update becuase it says \"you cant roolback becuase you updated windows 10 days ago\"","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Pleas try the following steps: #1. Go to Device Manager Locate Windows Update service Double tap on it and make sure the Startup settings is set as Automatic. Restart the PC #2. Press Windows+R keys together to open Run. Type wsreset.exe Press Enter Close the black window Go to Store Download any small free app first. Search Minecraft and try to download it.","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Pleas try the following steps: #1. Go to Device Manager Locate Windows Update service Double tap on it and make sure the Startup settings is set as Automatic. Restart the PC #2. Press Windows+R keys together to open Run. Type wsreset.exe Press Enter Close the black window Go to Store Download any small free app first. Search Minecraft and try to download it. Ok i tried this way  and i tried to installl an app and its worked but the proplem that when i try to sign in to my account i get the same error \"0x80070781\" and i want to login to my account becuase i i bought minecraft in this account ","Okay, we can do one thing.Back up all your stuff from the Microsoft account.Log into the Local account.Delete the Microsoft Account.Add the Microsoft Account again.Log in to the Microsoft account and check Store.","Okay, we can do one thing.Back up all your stuff from the Microsoft account.Log into the Local account.Delete the Microsoft Account.Add the Microsoft Account again.Log in to the Microsoft account and check Store. Ok how can i do this ? (Sorry because im not expert in computer)","Pls reply ","1. You need an external drive to back up your files. 2. Here is how you can create a Local Account: https:\/\/support.microsoft.com\/en-in\/help\/402692...3. Steps to Delete an Account: Open Settings. Click on Accounts. Click on Family & other people. Under the “Other users” section, select the account you want to delete. Click the Remove button. ... Click the Delete account and data button.","1. You need an external drive to back up your files. 2. Here is how you can create a Local Account: https:\/\/support.microsoft.com\/en-in\/help\/402692...3. Steps to Delete an Account: Open Settings. Click on Accounts. Click on Family & other people. Under the “Other users” section, select the account you want to delete. Click the Remove button. ... Click the Delete account and data button. Can i i delete the account without external drive becuase i dont have","If you delete the account without backing up your files somewhere, you may loose your files (Pictures, Video, Documents etc..)"]},{"symptom":"single file access denied issue in mapped drive        Windows 10 professional system, with mapped drive to server 2016 essentials server, with AD. All applications are working correctly with the exception of a single folder.All paths and permissions map out correctly, and user can create & delete files and folders on the mapped drive and withing this particular sub folder, however two users I have tried who both have domain admin rights cannot see or access the particular application file in this sub folder.The user can search on the folder for the specified file and this is shown via the full UNC path  and not the mapped drive, but when either the administrator or this user try to access the properties is says accessed denied.If I then rename the file name to a different file extension, they can then see the file in this sub folder, and they can also access other files with the same extension in other sub folders.full permissions are given on both the share and the full path to the specified file","solutions":["This question seems out of scope for these consumer level forums. I think you'll get better results asking other IT pros in the Technet forums. Start here:https:\/\/social.technet.microsoft.com\/forums\/en-..."]},{"symptom":"No windows store on my laptop running windows 10.        One day while I was working on my laptop, my windows store and all the apps that had been download from the store stopped working i.e. stopped opening. Then I started getting an error message stating that there is no app to open this file. So I looked it up on the internet and found few options of system updates, troubleshoots ( run windows store troubleshoot), PowerShell commands and lastly the factory reset the device. I tried all of that like literally all of that but nothing seems to work. Ok now after resetting my laptop to factory settings the Microsoft store app or icon disappeared from the taskbar, the start menu, the search from everywhere so I rerepeated all the processes written above including reresetting my laptopbut it still didn't solve my problem so now I ask for help here. I haven't taken my laptop to the service centre yet. So please help.","solutions":["Hi BhuvanAgarwal, I would suggest you do a repair using an in-place upgrade. https:\/\/www.kapilarya.com\/how-to-repair-windows...Let me know how it goes. Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows 10, sudden blue screen while playing a game        So, today I have been trying to play a game on my PC (Game is Honkai Impact 3rd, PC version), it runs well for the first minutes, then suddenly at some point while playing, the PC crashes into a blue screen.Now, I been looking into the issue, ended up using a program to analyze the crash dump files, and the program says the crashes are probable due to something related to \" unifairy.sys \", been looking for that, and nothing","solutions":["Hi Alia, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.We need log files(called dump files) that tell us what lead to crash. Please share them with us for a better analysis of the problem. Instructions can be found here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Please let us know if you need any assistance about posting dump files.","Here it is o\/ https:\/\/1drv.ms\/u\/s!ArwJ_3rj5n5vaqXhvrw5f0zSZyE?e=uwj95l","Thanks Alia. Appears to be caused by Unifairy.sys which is a part of Unifairy Software(?)You may check for updates or reinstall the same which should resolve your issue. Technical Information: *** WARNING: Unable to verify timestamp for UniFairy.sys","Yeah...that's the problem, I do not know any UniFairy software at all, I been searching for it and nothing.Thanks for the help anyways!","In that case, please boot to safe mode and rename to unifairy.sys.bak. The file should be in C:\/Windows\/System32\/drivers folderhttps:\/\/www.tenforums.com\/tutorials\/2304-boot-i...Please let us know if you need any assistance.Disclaimer:This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"Windows 10 Setup Stuck at Install Now        This is honestly the weirdest thing I've ever seen. I bought a Windows 10 installation USB drive, and stuck it into my brand new PC build. The PC has an NVMe SSD (M.2) drive and no other hard disks. When booting the PC, the USB drive boots just fine. I get the menu to choose whether to do a 64-bit or 32-bit install (I choose 64-bit as I'm running a 2nd gen Ryzen 7 2700X CPU). The install program starts, I choose my language and region settings accordingly, and I then see the plain blue window that has a single button that says \"Install Now\". I click \"Install Now\", the window disappears, and I see the text at the bottom of the screen that says \"Setup is starting...\". Then the program goes back to the screen that says \"Install Now\". I can keep clicking the button and the same thing happens over and over again forever, but the installation never starts.I thought it might be a problem with the M.2 drive, but I was able to install Ubuntu Linux on it with no problem, which means it's not the hardware. Under Linux, everything ran just fine. I also tried downloading an ISO from Microsoft and creating a bootable USB thumb drive, but the same thing happens, even with the media downloaded from Microsoft's website.At this point I have no idea what to do. I've built many PCs but I've never seen this before. Can anyone out there help me out?","solutions":["Hi, JCaputo3 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.I recommend you reset the BIOS to its default values ​​and then when you go to install Windows I recommend you delete the SSD partitions and create them again.","Thanks for the reply. Unfortunately that didn't work.Regards!","If you have problems booting from a boot disk, you may have UEFI BIOS: Insert the boot installation media, then enter the BIOS and make the following changes:1. Disable Secure Boot 2. Enable Legacy Boot 3. If Available enable CSM 4. If Required enable USB Boot 5. Move the device with the bootable disc to the top of the boot order 6. Save BIOS changes, restart your System and it should boot from the Installation Media","Thanks for the reply, but the problem is not with booting. I can boot the USB installation media. It fails after clicking \"Install Now\". I see the footer message at the bottom of the screen that says \"Setup is starting...\" for a split second before being booted back to the \"Install Now\" screen. I should see the screen where I need to enter my license key, but I never get there. At this point I have tried removing components from the system one by one to try and see if any one of them are causing the problem, but so far nothing changed. The only parts I haven't swapped are the motherboard and CPU, but I can install Linux in this machine, so I doubt those components are the cause of the problem. I'm out of ideas, and I'm ready to give up on the whole thing. My build is essentially a very expensive paper weight at this point.Does the Windows 10 setup program spit out logs anywhere I can check? I'm just wondering since the hard disks have not yet been partitioned and formatted. There may be something I can check in the logs that will tell me what might be going wrong.Thanks for the help!"]},{"symptom":"Windows 10 Instant Search Calculator        Upgraded from 1803 to 1903 I think, and I did some tweaking around the settings so it would be optimized for the gaming experience, but I can't remember what I changed and disabled some of the functions which I wanted to use now but I can't as I don't remember what I changed. One of them was the Instant search calculator where if you type a mathematical operation in the search bar it automatically shows you the result, eg if you search 1 +  1 it shows you two but on mine, it doesn't show anything, it does show search up on web 1 + 1 and it says preview is not available, is there a way to fix this?","solutions":["Hi In That Instant Search Calculator is part of the Cortana functionality, did you disable Cortana when making those changes?In version 1903, Microsoft split the Search and Cortana functionality, please check that you have both turned on (icons on Taskbar), then check if that calculation function works in Cortana, not the search box . . .","Hi In That Instant Search Calculator is part of the Cortana functionality, did you disable Cortana when making those changes?In version 1903, Microsoft split the Search and Cortana functionality, please check that you have both turned on (icons on Taskbar), then check if that calculation function works in Cortana, not the search box . . .Hi thanks for the help, thats what most formus said as well however I dont know how to do it, I was wondering if you can tell me the steps and what I need to turn on and off and where I can find them, thank you","Hi In Beside your Start Menu, do you see a Magnifying glass and also a circle icon? The Magnifying glass is Windows Search and the Circle is on is Cortana If you do not see Cortana, right click an empty part of your Taskbar, do you see Cortana in the resulting menu, if so, you can turn that on from there . . .","Hi In Beside your Start Menu, do you see a Magnifying glass and also a circle icon? The Magnifying glass is Windows Search and the Circle is on is Cortana If you do not see Cortana, right click an empty part of your Taskbar, do you see Cortana in the resulting menu, if so, you can turn that on from there . . .thanks for the help and I already have cortana turned on however nothing has happened"]},{"symptom":"Windows 10 reactivation on 'removed' account        So I have been using this account when my stepfather gave me the PC. However, i have realised that this account is no longer on the servers. I had a complete PC change (except HDD) and now I can't reactivate windows because the password wont work for the account. I need more help. I tried the agent but the SLUI 04 command wont do anything. PLEASE HELP!","solutions":["Hi PG_Guy. I'm Reinald, an Independent advisor and a Windows user like you. I appreciate you for providing details about the issue and we are happy to help you.I just have a few questions so i can better assist you. By password, do you mean your Windows 10 license? Are you getting an error while trying to activate Windows? Do you happen to know what type of Windows license do you have? Is OEM, Retail or Volume?","I do not know what type of license i have. It says I have none though. I also mean account password. As I said, the account has been deleted off the servers. So the credentials do not work. The only reason i can log in is because it saved the last password used."]},{"symptom":"Active X        I am trying to setup a Mydlink system which require downloading Active X, I get a message \"This app has been blocked for your protection. An administrator has blocked you from running this app. For more information, contact the administrator. Unknown program\". Mydlink tech support told me to contact you to get past this bottleneck! ","solutions":["This is a user forum for Microsoft consumer help, not manned by Microsoft employees.I have a D-Link NAS is this what you are referring to, what is Mydlink you are setting up. Is it an online account? Can you explain more.edit, in addition what browser are you using.?","Yes, I have a DNR 202L and trying to see my footage, but it wants to download an Active X and that admin issues is stopping from doing so!","I'm afraid you need to explain more, I can search for Mydlink and see a message regarding Edge browser and to use Internet Explorer. (or Firefox)Are you using Internet Explorer to setup the account or have you set it up and trying to access the account when you have the problem.Please detail more info as I'm just guessing what you are doing.","Hello UlyessesLloyd, I am Andrew an independent advisor. To get past this annoying problem right click the installed you're trying to execute and select to RUN AS ADMINISTRATOR.","How old is this system that you are trying to setup? ActiveX is a very old Internet Explorer technology that no one uses any longer because it's easy to attack. In any case, you can't download ActiveX separately, because it's part of Internet Explorer."]},{"symptom":"Win10 Pro 1909 looses its WIFI connection after restart if no internet connection        My problem seems to be similar to :https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-networking\/wifi-not-connecting-after-restart\/4bdd6052-6fd0-479e-9b42-eff2a86d2988but none of suggested solution methods are working.My Fujitsu Notebook with :Win10 Pro 64bitVersion : 1909Build : 18363.535WIFI Card : Intel Centrino Wireless-N 2230WIFI Drivers : Manufacturer - Intel, Date - 30.04.2015, Vers - 15.18.0.1 looses its WIFI connection after Restart if i deny HTTP connections for that Notebook on my Firewall.On the other hand - if i temporary grant HTTP connectivity to it, connect to WIFI and then restart, it works fine.There nothing interesting in Alert Log as far i can tell. It seems to me, that Windows is either disconnecting WIFI while shutting down (if no HTTP) or it is disconnecting WIFI while booting after getting no HTTP connection. WIFI connection password stays stored in Windows sessiong, so i don't have to type it in again, but since this PC is not supposed to have HTTP connectivity and not all Users do know what to do, it is very annoying.I hope you can help me in this matter.","solutions":["Hi, poiuztre My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps to repair your Internet connections: Enter the Start menu or by pressing the Win + I key combination, open the Settings and click on the Network and Internet option. Once there, we select the Status option from the menu on the left side and, within the configurations and options that are loaded in the right panel, we have to look for the restoration of the network. When you click on this option, it will show us a new window from where we can restore the network in Windows 10. In this way, all network adapters will be removed and reinstalled, and the original configuration of other network components will be restored. net. This implies that if we were using some software, such as a VPN client or virtual switches, we will have to reinstall them.A process that the system performs automatically by clicking on the Reset button that is now displayed in Network Reset in Windows 10 settings. It is normal for the process to not take long, although we must wait until the end completely and restart the computer to continue with the network configuration in Windows 10 as we have done so far.https:\/\/www.kapilarya.com\/how-to-reset-network-...https:\/\/support.microsoft.com\/en-us\/help\/10741\/...You can also check that your drivers are updated. https:\/\/support.microsoft.com\/en-us\/help\/402844...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thank you, Jeffrey for your reply, but to reset the netword connections did not help either.Then on some other site i red to deactivate Microsoft WiFi Direkt Virtual Adapter that did not help.I've tried to deactivate WIFI Hotspot 2.0 functionality that did not help.I've tried to change the Driver for WIFI Device to standard one from Microsoft that did not help.I've tried to play with the config (Network type public\/private, etc) that did not help.So, at the moment i'm out of Ideas what to do. After every reboot the notebook keeps loosing the WIFI connection (disconnecting from it). Maybe someone from Microsoft has an idea? Guys?...","I recommend that you repair Windows completely before you must make a backup of your personal files, third-party software will be removed. Here the link to download the Windows ISO.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please perform the following steps: 1. Reset the Network Driver: Go to Device Manager Locate and expand Network Adapter Right click on the Wireless Driver and select Uninstall (Do Not click on any check box)Restart the PC. Connect to the WiFi Network using the Notification Center (Bottom-Right corner) * This time click on the Check box that says \"Connect Automatically\"","So, i've found out that as long i deny external connection to *.deploy.static.akamaitechnologies.com hosts (many hosts&subnets for Windows Update or something like that), the WIFI Connection is shown as \"Connected, No Internet\" and after reboot WIFI is disconnected.If i allow connections to that domain, WIFI connection is shown as \"Connected, Internet\" (in german so it might be not precise, but you get the point), then there are no problems at all.Microsoft - please check this matter, because i'll rather migrate that business branch subnet to linux than give it internet connectivity."]},{"symptom":"Internet and Network issues in Windows 10        I have a problem that I find hard to explain, even to myself and never encountered before. First, this is fairly a new build, April 2019 build. Everything is working fantastic except internet issues. I can’t tell if this problem has been always there but I haven’t noticed it or it just happened recently.Lately I have been noticing my performance in PVP games dropped noticeably, Internet is slow and I can’t seem to land my shots precisely even thought my aim is good, I played around 50 PVP matches and it is quite obvious that something is wrong, the ping is around 4ms. I’m running Fiber Optics 100Mbps and it is stable. Here’s the creepy part: I have three phones and a laptop. I have tested internet speed on all of them and I register full speed on both download and Upload, However on my PC, every time i do a speed test, the page acts weird, the pin does not move as it should, it freezes for like 5 seconds and then it jumps to 20Mbps then down to 12 to 15 Mbps. It gives the results very fast in weird like reading, its like the page is frozen, it doesn’t even calculate the upload speed it just crashes and then the whole page goes black and I can’t open other pages, but other software like Discord and twitch still running and have internet access.The router is working perfectly, I have tested the Ethernet cable I use on my PC, I plugged it to my laptop and I got full speed and everything works just great, that means the cable isn’t the problem I have tested it over laptop’s wifi as well, works great, my phones registered full speed as well. So:-    Router is ok Both Wired and over wifi on other devices-    PC is not ok Both Wired and over wifiSo the Ethernet cable and router’s wifi work fine. Its my PC, both wired and over wifi act the same way, I tried different Ethernet ports as well as external docking station that has a Ethernet port, all same results.I have tried to update the Network adapter drivers and tried different browsers, i uninstalled the browsers and reinstalled again, reset the network from Windows settings, same issue.What should i do next ?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please try resetting the Network Adapter driver from Device Manager. Go to Device Manager Locate Network Adapter Double tap on it. Right click on the Wireless Driver and select Uninstall (Do Not click on any check box)Restart the PC. Open Command prompt as Administrator Run the following commands 1. ipconfig \/flushdns 2. netsh winsock reset","This did not work too. List of things i did to troubleshoot:1- Tried connecting to the Router Via wifi2- Tried connecting using another Ethernet Cable3- Updated all Network adapters drivers4- Uninstalled Network adapters both for Ethernet and Wireless5- Tried different browsers and Internet Speed Testing Apps6- Uninstalled browsers and re-installed them7- Rest the Network Via Start > Settings > Network & Internet > Status > Network reset","Please let me know the Speedtest results. https:\/\/www.speedtest.net\/","This has been the download and upload speeds so far, i have my laptop and 3 phones here and i get 97mbps on all using the same router.I couldn't even reply to you because internet went down on the browser, i had to wait about 3-5 mins, but i still can talk to people on other chatting software like Discord.But I can't browse and open other pages. Weird","Could you please check if there is any Windows Update getting downloaded currently?","No I checked for updates almost everyday, im up to date. no other software is running as well. Just Firefox.Every time i run speed test internet goes down on the browser. I ran speed test from other services as well, same results.","Will it be possible to reset the Router?","I can but its not the Router, i flushed the new routers firmware yesterday. Same issues.I have two routers, Linksys WRT1900ACS, this is an access point router connected to my main router downstairs, i have ran a Ethernet cable from the main Router downstairs as well and tried it, same results.I have a CAT 6 Cable coming from the main router downstairs and connected to my Linksys WRT1900ACS, and this PC and Laptop alongside 3 phones are connected to this Linksys WRT1900ACS. All devices get full speed on both download and upload so the router isn't the problem. I have also disconnected the Cable coming from downstairs to my Linksys WRT1900ACS and plugged it directly to my PC, same issue.Every other device i have in the house works perfectly on the main Router and the Linksys WRT1900ACS. so it is this specific PC","Screenshot from my phones internet Speed test results","Did you check the speed after disconnecting all devices but the computer?Please check the speed of Ethernet."]},{"symptom":"How to wake with mouse? \"Properties\" not available for selection        How to wake with mouse....\"properties\" not available to select.  Other options?","solutions":["Hi Joan, You might want to check this article for guide with image. https:\/\/www.howto-connect.com\/allow-mouse-keybo...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","That option is unavailable to me since there is no pull down menu available under \"Properties\"."]}]}