{"windows":[{"symptom":"BSOD Error, can't get into Safe Mode        I recently installed a PACE driver for Auto Tune and it asked me to restart the PC. When I restarted, it booted into BSOD and gave the error \"Page Fault in Non Paged Area\". The driver which caused this was Tpkd.sys. I tried to boot into advanced startup options but it gave a blue screen on which my mouse and keyboard didn't work. the blue page had 2 buttons, \"Restart\" and \"Advanced Options\" and they both were unclickable. I searched online and I find a solution that i should Boot into Safe mode and remove the driver but i am unable to access Advanced Startup Option so I am unable to do anything. Please Reply...","solutions":["Have a look here for instructions on getting into Safe Mode:http:\/\/www.pcworld.com\/article\/2984712\/windows\/how-to-enter-windows-10s-safe-mode.html","I didn't make a Recovery Drive :(","Hi Astro, I'll try to help you on this issue. To answer your last question, You can create a recovery drive with this microsoft tool here : https:\/\/www.microsoft.com\/en-us\/software-downlo...I hope this helps Regards"]},{"symptom":"Windows Update + Microsoft Store        Hello,I have troubles with Windows Update since a lot, so I'm doing regula updates by manually downlaoding updates. It is timeconsuming but manageable on one computer.Now I have troubles with Microsoft Store: it is no more possible to update or download apps ! That is quite disappointing.My laptop history: it is an ASUS K55VD 64 bits CPU. I got it wth Windows 7 Home Premium CA. Then I've upgraded the OS to Windows 7 Pro to get more functionalities. Finally, I took the free upgrade to Windows 10 pro widely offered at this time by Microsoft. As a consequence, the product key recorded on my Laptop (sticker on the laptop back) is no more valid, as the product key I got to upgrades to 7 pro. I have not a Digital Product Key,When launch a download or an update of an app on Microsoft Store, I have teh following error:Code : 0x80072F8FI have found several solutions proposed on the web: time of the system, reset Windows Update Service, Product Key management etc.No effect so far.I have just launched the troubleshooting tool of winfows (sorry in french):The result points out the following relevant details (translated from Fech to English), other details shows no problem detected:> Detection Details:     IsPostback_RC_PendingUpdates            IsPostback: False     WaaSMedicService            Problem détected by :NoUsoScanPlugin     IsPostback_RC_PendingUpdates            IsPostback: True     Service Status           Problem linked to service BITS : The requested service is already started. You will get additional help by entering NET HELPMSG 2182.The help message 2182 is \"The requested service is already started.\"Does someone have an effective solution ?Regards","solutions":["Hi, BenoitENJALBERT My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Windows 10 Pro digital license transfer        Hi,I'm trying to transfer my windows 10 pro license to a new pc but it won't work. I've read about every help pages there is on this topic, but none solved my issue, so here I am.Here's the situation : I just bought a new laptop and I'm trying to transfer my windows 10 pro license from my old laptop to the new one.The old laptop originally came with Windows 10 Home OEM, which I upgraded to Pro using the Microsoft Store Upgrade earlier this year. I've now gone through the steps of linking my Microsoft Account one my old laptop so that I get the \"Windows is activated with a digital license linked to your Microsoft account\" message with my Windows 10 Pro license and I made sure my device appears on my Microsoft account.On my new laptop, I connected my Microsoft account, but the license shows as Windows 10 Home. I then ran the \"slmgr \/upk\" command to uninstall the license from the old laptop and I also removed the old laptop from my Microsoft account. Still, if I try the Activation troubleshoot on the new laptop, it always stays on the Windows 10 Home license.I'm out of ideas, every article I read about transferring a retail Windows 10 Pro digital license said that it was as easy as linking the license to my Microsoft account and then connecting that account on the new PC, but that doesn't work.Basically, I want my old laptop to revert to its original Windows 10 Home OEM license and I want to upgrade my new laptop from Windows 10 Home to Pro using my digital license bought on the Microsoft Store.Anybody here knows how to fix this mess?Thanks","solutions":["Hi Chg,There isn't an exact clarity on this by Microsoft but I believe the Pro upgrade inherits the type of license from the base*, which is OEM. However, Microsoft once also stated that in OEMs there are exceptions and a license transfer may be possible.The following approach is what I suggest. First of all, add the older device having Windows 10 Pro in your Microsoft account again.On the new device, use the following generic key to upgrade to Pro VK7JG-NPHTM-C97JM-9MPGT-3V66TYou would see Windows unactivated. Run the activation troubleshooter and select I recently changed hardware.Select the older device and see if it activates.Remember: If my assumption * is true, you may be left in an unactivated OS. In that case, you might need a factory reset or call Microsoft to get a pass.https:\/\/support.microsoft.com\/en-us\/contactus\/","Hi Sumit,Thanks for your answer. First, I looked at the Pro license on the old laptop (using slmgr \/dlv) and it shows as Retail, not OEM, which means I should be able to transfer it.I followed your instructions :1. Reactivated the Pro license on the old laptop2. Reconnected the old laptop to my Microsoft account and made sure it showed up in my account.3. Went on the new laptop and tried to upgrade to Pro using VK7JG-NPHTM-C97JM-9MPGT-3V66T, but got the following error message : \"We can't activate Windows on this device because you don't have a valid digital license or product key. If you think you do have a valid license or key, select Troubleshoot below. (0x803fa067)\"4. There's is no \"Troubleshoot\" button, because my activation still show as \"Windows 10 Home : Windows is activated with digital license linked to your Microsoft account\" on the new laptop...5. Even tried the slmgr \/upk command on the new laptop, which made a troubleshoot button appear, but when I click on it, the activation gets fixed by reverting back to Windows 10 Home, which is the OEM license included with the laptop.Do you have another idea or should I just call Microsoft?Thanks,","Thanks for posting back. You should disconnect from the Internet and use the generic key again. Microsoft has intentionally disabled to upgrade to Pro because some people do it without knowing the same and end up with an unactivated OS. ","I went offline and upgraded to Pro using the generic key. After the upgrade, I went back online and I tried the troubleshoot menu, which gave me this message :\"We found a Windows 10 Home digital license for this device running Windows 10 Pro. To activate using this digital license, you need to install Windows 10 Home.\"In the same window, I clicked on \"I changed hardware on this device recently\" and selected my old laptop as the current device and clicked on Activate, but got an error message : \"We can't reactivate Windows on this device, try again later.\"Am I missing something?","Unfortunately you cannot transfer OEM license to another PC as it’s tied to the Motherboard of the original PC. As you upgraded Home to Pro via the store this gave you Pro OEM which is classed as the same non-transferable license.You may phone Microsoft & request a one-time transfer but it’ll be upto them whether they agree or not.https:\/\/support.microsoft.com\/en-gb\/help\/405170...https:\/\/partner.support.services.microsoft.com\/...To speak to a real person: US: https:\/\/partner.support.services.microsoft.com\/... UK: https:\/\/partner.support.services.microsoft.com\/...","The Pro license shows up as Retail (not OEM) when I check with slmgr \/dlv. So it should be transferable.","Thank you for that. Is there any error message when you install Pro? There’s also a bug where installing Pro actually installs Enterprise so I’d also check for that too.When you installed on the new PC did you skip entering the key? Try activating with the default key: VK7JG-NPHTM-C97JM-9MPGT-3V66T","Here's what I did :1. Made sure my Pro license is linked to my microsoft account2. Connected my Microsoft account on my new laptop, which came with Windows 10 Home installed3. Put my new laptop offline and upgraded to Pro using the generic key4. After the upgrade completed, I went back online and tried the activation troubleshoot5. I selected the \"I changed hardware on this device recently\" option, which presented me with my old laptop's name. I selected it and clicked on Activate, which gives me the error message\"We can't reactivate Windows on this device, try again later.\"That's where I'm at. Still ain't able to activate my pro license on the new laptop...I want the old laptop to revert to its original OEM Home License and use my Retail Pro license to upgrade the OEM Home license on my new laptop. One would think this should be trivial!","Did you revert to the Home license on your old PC before trying to activate Pro on the new PC?It may be that the servers are overloaded due to users activating their new PCs. If the problem continues after a few days then a call th Microsoft will be required.Yes it should be simple.","No I haven't revert to the Home license on the old PC. Is there a way to do so without going through the reset procedure?"]},{"symptom":"Windows 10 Repair Loop        Good morning,My son bought a Dell Inspiron 15 3000 series laptop with Windows 8 pre-installed - which was then upgraded to Windows 10. All was working fine (although at times the laptop seemed slow and the laptop  showed 100% disk usage).Last wekk, he'd been working on the laptop, left it and then came back to a blank screen. The laptop didn't rfespond to key strokes - so he thought it had crashed and cycled the power.When the laptop then booted, it went into a loop 'preparing automatic repair' -> 'Diagnosing your PC' -> 'Repairing disk errors' -> computer restarts and then -> 'Preparing automatic repairs' ->Diagnosing your PC ' -> 'Attempting repairs'  -> 'Automatic Repair Coiuldn't Repair your PC' .........I have a Dell Latitute E6540 with two hard drives - one of which is a Windows10 (upgraded from Windows 7) that I hardly use - so that drive was put in a USB caddy and the Inspiron booted ftom there. On first boot, the Inspiron again went into some for of recovery mode - this time saying it was reparing drive D - so I assumed it was trying to recover the Inspiron hdd from the plugged in USB W10 drive. That seemed to go through ok - but after completion - when trying to boot from the Inspiron HDD (ie after unplugging the USB), it fails as it now doesn't find a bootable HDD. I can still boot from the USB ok - and can see both the C: (USB?) and D: (HDD) drives in Explorer.Is there any way to either reinstall Windows 10 to the Inspiron HDD or to recover it? My son doesn't recall the Windows license details (nor the Office license).Thanks in advance.","solutions":["Hi, SteveTu2 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Jeffrey,We tried my 10 disc again - and this time recovered the old laptop to its factory settings and that worked ok this time. That has then lost user data (but we have backups) and reset it to W8. So now we're looking at re-upgrading it to W10. Just doing that now.I'll post the outcome.Thanks for the help - much appreciated.","Glad to Help!"]},{"symptom":"Mail        Mail not working properly. Sent mail hangs in outbox, is not sent. How do I sync everything. I've reset, restarted computer and it still has the same problem.","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? Which email client are you using? Which account is affected - Hotmail\/Outlook, Gmail, Yahoo ISP etc? Does the account use SSL & are the server settings correct? Is there any error message?","Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? Which email client are you using? Which account is affected - Hotmail\/Outlook, Gmail, Yahoo ISP etc? Does the account use SSL & are the server settings correct? Is there any error message? 1909. Window10 mail and all settings have been checked and all correct","I’m sorry to see that you marked my reply as not helpful when I clearly asked you for further information. I cannot help you if you do not give me the information requested whether you feel it is correct or not.Which account is affected? Please post the information I asked for.","Sorry, I clicked unhelpful by mistake. Windows 10 version 1909. Windows mail and all server setting checked and correct.","Which account? Do you use two-factor authentication on the account? The problem is often due to incorrect smtp settings - usually requiring SSL & the correct port number. I still require the account details.How long as the problem been going on? It may also be a temporary problem with the servers.","My server is Plus net and I have two email addresses with them and a g mail address that is working ok. One of the plus net addresses is now ok but the second one is not. I'm going to reset the one that doesn't work and see if that corrects the fault. Will let you know what happens.Thanks, ","Thank you. Often deleting the account & setting it up again will work. If not then try again but use ‘other’ & manual setup & enter the account details manually.It does sound like a problem with Plusnet though, often ISPs use Sunday to run Maintenance on their systems - my ISP seems to go down more often on a Sunday.","Do you require further help?","No thanks. I contacted Microsoft support, who, after 4 hours on the phone, finally solved the problem. When you purchase a product, it's not unreasonable to expect it to work properly and it is surprising when you contact them, to find that they don't know why something is not working and take (what seems like forever) to solve it.","Support would no doubt go through the basics before moving on to more detailed fixes.For future reference & to help others may I request the information which they gave you which fixed the problem? If you’d prefer not to give this don’t worry. :)If you don’t have any further questions please feel free to mark one of the replies as the answer &\/or rate my help: 1 star means you are very unsatisfied with my help and 5 stars means you are very satisfied with the help I gave you."]},{"symptom":"camera won't start: error: 0xA00F429F<WindowShowFailed>        Hello,I went onto this site and tried everything I read that was suggested so far.  go to file explorer.....pictures.....Camera Roll. from there right click and properties. Then go to security tab and make sure the  account you are logged in with has all the check marks next to it, could be that you are logged in as Account unknown either way make sure all the accounts are checked with ...Full control ...Modify, and everything should work--did not workTo check camera privacy settings:1) Click Start2) Click settings3) In search box in upper right, type \"webcam\"4) Click \"Webcam privacy settings\"5) Check that \"Let apps use my camera\" toggle is On--did not workI did all of the below: All did not work:Give your apps permission Check your antivirus software Check for an outdated webcam driver Roll back your webcam driver Uninstall your webcam driver and scan for hardware changes If your camera isn't listed in Device manager, test ports and run a scanI tried to open in search and type in services.msc, found the camera frame server and clicked on properties to have it run automatically.  DID not workMore help??????? PLEASE??  I am about to pay $30 for a Driver Finder Program that claims to be able to \"fix\" this.  But supposedly the driver for my camera is updated, as I looked on-line at the manufacturer's websiter--and Microsoft's website said that the latest update DID update my camera with the latest driver.  ","solutions":["I too do have faced the same problem suddenly. I did exactly the same thing asCristinaCastagnini done. Except that I did even go so far as I did even uninstall the antivirusprogram too. Still I do face the same issue.I do have tried with those steps too, without solving the issue:In order to uninstall Camera I did run “Windows PowerShell (Admin)” and typed inGet-AppxPackage *camera* | Remove-AppxPackage and I did install the camera from the store.I did reinstall the driver from HP's site after having it downloaded.I do have even set a new DWORD key with the name  “EnableFrameServerMode” in HKEY_LOCAL_MACHINE\\SOFTWARE\\WOW6432Node\\Microsoft\\Windows Media Foundation\\Platform with the value 0 i it.I did even Run troubleshooting selected Windows Store Apps. Nothing did came up. I did start Skype and even Skype was¨'select Run the troubleshooter and nothing did came up as an result. I did then start up Skype. Even Skype did have it's issues with the webcam.Then I did run sfc \/scannow with nothing as the result.Please. Assist. I am running on a HP Pavilion - 15-cw1008no with HP Wide Vision HD Camera that did work from the start. The computer di came to with Win 10 Pre-installed.With Best RegardsJouni Kelottijaervi "]},{"symptom":"[Problem Solved] Scroll sideways in Edge pdf viewer        This should be basic functionality, but unfortunately, I'm stumped for a simple way to scroll sideways while viewing zoomed in on a PDF doc in Edge. Perhaps Edge should not be the default PDF viewer Microsoft, if this basic feature is missing?I suggest pressing the Alt key display a scrolling hand like Adobe Acrobat that most people are already used to. Then, while holding the Alt key, use the mouse to drag the document around the screen.If there is such a way, I haven't found it. FYI, no horizontal scrollbar appears while viewing PDFs.","solutions":["Hi Johne154, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.You apply the corrections to the browser, because I opened a PDF file through Edge, I zoomed in on the document, and I could scroll sideways with the horizontal bar at the bottom of the page.https:\/\/support.microsoft.com\/en-us\/help\/402356...But, in addition, you can select another viewer as default, one of your preference, this article that some Windows MVPs share, shows the option to run it.https:\/\/www.windowscentral.com\/how-use-microsof...Let me know if you have something else that I can help you with, I'd be happy to help.Happy holidays Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Activation failed after upgrading the motherboard.        This is a long story. My son upgraded his motherboard to a new one. So I decided to use his motherboard for one of the older computer that has a Windows 10 Professional running on it and activated.After installing the motherboard, I tried to re-activated the license for Windows 10 Pro but it failed, ran troubleshooting and click on \" I upgraded the hardware recently\" or something like that, log into my Microsoft account but couldn't find the old PC that I can use to activate. I just upgrade the motherboard, the hard drive is still the old one with Windows 10 Pro on it. I don't know how the activation server determined which license goes where, do they follow the motherboard? My son was having the same problem activating his window 10 home as well and finally give up and buy a new version. I am determine to solve this problem.My screen shot after running slmgr.vbs \/dlv is as follow. Any help is greatly appreciated.","solutions":["Forgot to add that I also tried reinstalling the old motherboard into the system. It boots up ok and I checked the Activation status, everything is just like before where Window 10 Pro is activated and showed up on my Microsoft account. The question now is how do I transfer that license to Windows 10 Pro with new motherboard?","Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? Is there any error message? Have you tried entering the default key for Pro? VK7JG-NPHTM-C97JM-9MPGT-3V66T It may be a simple case that the activation servers are overloaded with users activating their new PCs, if the problem continues then a call to support may be required:https:\/\/support.microsoft.com\/en-gb\/help\/405170...https:\/\/partner.support.services.microsoft.com\/..."]},{"symptom":"windows os for mobile        Is there future plans of windows phones in the coming years?If any i would like them to continue.","solutions":["Hi Hastings There are no plans for Windows 10 Mobile being announced by Microsoft, in fact the mew Surface Phone that is coming out in 2020 will be running a version of Android, so for the moment, we can assume Microsoft does not have any plans for another Windows Mobile version . . .","Thanks daveM121 for the reply but do you have an idea of price for the same surface phone which will release in 2020 and the date.","There is no release date for that phone as yet and as for a price, it will be expensive 1500+..."]},{"symptom":"Unable to detect bitlocker encrypted drive after suddenly failing        My secondary hard drive failed, or appeared to have some fault very suddenly. I was watching a video, which cut off in the middle, and then it said \"D:\\ is not accessible\" after which I tried accessing the drive in explorer but to no avail, and was unable to access through CLI either. I checked disk management and the drive was there but it was showing \"uninitialized\". I try to initialize it and then the drive disappears completely. I have no choice but to take it out of the laptop and connect it as an external, but I only did that after restarting once to see if it would fix the problem, which it didn't. I tried to unlock the drive after restarting, but after unlocking it disappeared again.I looked around online and found the repair-bde solution which is outlined here. Unfortunately, even though the drive shows up for a few seconds, it disappears too quickly afterwards that I can't even use this method. It says something like \"D: is not a volume\".By physically observing the drive, I can see the external's controller led blinking as if it was reading normally, this happens in the first few seconds when I connect it (when the D drive shows up in explorer as a locked drive), but then the led gets constant, and the drive keeps spinning at insane speeds (when this happens the drive disappears completely as if nothing is connected, but it still shows up in \"Safely remove this drive\", but I can't remove it either so I have to forcefully disconnect it).I understand that the drive could've failed beyond repair, but since it is still getting recognized I still have some hope in recovering the data in it, and I want to exhaust all possible options.I also tried a software such as EaseUS for recovery but it keeps \"loading disk information\" forever when the faulty drive is connected. I can't help but feel that bitlocker is complicating the process.Please help me with any possible solutions, I'd be forever grateful.P.s. It's also possible the drive was stopped in the midst of locking. My laptop has an issue where when I shutdown, it never turns off the fan or the power LED, so I have usually to wait for the disks to finish all reading\/writing and forcefully shutdown the fan when the disk activity led is silent. (This issue is caused by windows btw and I found no solutions for it whatsoever so I just came to accept it). If it was disconnected in the midst of locking the drive, does that mean the drive is now completely unsalvageable?","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as you are having difficulties with the BitLocker Encryption on the secondary drive. Let me point you in the right direction, where you would get the appropriate help for this issue. I would suggest you to post your query inTechNet forums, where we have experts and support professionals who are well equipped with the knowledge on BitLocker to assist you with the appropriate troubleshooting steps. Regards, Aditya RoyMicrosoft Community – Moderator","Ok I will ask there, but I hope you keep this question open in case anyone else can provide me with any help here as well."]},{"symptom":"What Operating system should I choose        Split from this thread.Windows 10 was a pain to set up...I don't like Windows 10 ಠ_ಠ Is Windows 8 a better alternative? Just curious.  ","solutions":["Hey there, DudeEMWWelcome to the Microsoft Community forums. It depends on what you want to use Windows 8.1 for?Before deciding to buy Windows 8.1, you may want to read this:https:\/\/support.microsoft.com\/help\/15347Regards, ","It is personal choice what operating system you want to use.Support or 8 ended in Jan, 2016.Support for 8.1 does not end until 2023.","Microsoft no longer sells Windows 8.1.You would have to try amazon.com, etc.Warning:You do not buy a Product Key by itself, as they are normally stolen\/pirated, Volume Licenses which are not for private use, or MSDN keys which are not to be sold by the original subscription holder.Make sure that you buy the complete sealed package (DVD, license) https:\/\/www.microsoft.com\/en-us\/howtotell\/Shop.aspx Read Section: Beware of Product Keys sold separately."]},{"symptom":"Не могу выставить разрешения под учётной записью администратора        Есть планшет Samsung Slate на Windows. Столкнулся  проблемой - процесс System. грузит SSD на 100%. Нашел вот такое решение https:\/\/www.google.com\/amp\/s\/pikabu.ru\/story\/zagruzka_diska_na_100_izza_sluzhbyi_system_na_windows_810reshenie_4884249%3fview=ampПроблема в том, что хоть захожу под учетной записью администратора, галочки серого цвета, то есть неактивны, соответственно другие разрешения я выставить не могу. Как это исправить?","solutions":["Здравствуйте. Пожалуйста, внимательно прочитайте комментарии к \"полезной\" статье, ссылку на которую Вы опубликовали. Резюме - не стОит так делать, как \"советует\" автор статьи."," Хорошо, сути дела особо не меняет, так как проблема осталась. Как это пофиксить?","Попробуйте отследить \"виновника\" с помощью Process Explorer: https:\/\/docs.microsoft.com\/ru-ru\/sysinternals\/d... (страница на русском: https:\/\/docs.microsoft.com\/ru-ru\/previous-versi...(v=msdn.10)?redirectedfrom=MSDN )"]},{"symptom":"document auto fill document in windows 10 mail app        Is there a way to set up auto fill documents on the windows 10 mail app, just like in outlook","solutions":["I'm sorry, this feature is not available in Windows Mail. You may wish to share your feedback\/request to Microsoft via Feedback Hub.https:\/\/support.microsoft.com\/help\/4021566"]},{"symptom":"Taskbar on Windows 10 multiple screens        I have 3 screens on a brand new Windows 10 computer.The taskbar displays at the bottom of all 3 screens - which I don't want.How can I turn taskbar off on all but the main screen please?","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Right-click on a blank bit of any of the taskbars.... from the menu click \"Taskbar Settings\". If you scroll down that list of options you'll get to a section titled \"Multiple displays\". Just below that is a switch called \"Show taskbar on all displays\" - turn that off. Regards, David"]},{"symptom":"Some Windows files are missing. Cannot create recovery.        Hi, I have Windows 10 Home.My hardware details are:my windows details are:I want to reinstall windows but I cannot create a recovery media.Please help me.","solutions":["Hi KapilG1997, you can reinstall Windows 10 at any time and it will not cost you anything !Since you previously had Windows 10 installed and activated on that PC during the installation process skip the steps which ask for a product key and select the option 'I am Reinstalling Windows 10 on this PC', and activation will not be an issue, your PC will have a digital entitlement stored on the Microsoft Activation Servers Make sure you install the same Edition of Windows 10 (Home, Pro . . . etc.) you previously had installed to avoid Activation issuesClick this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), you can create a bootable USB flash drive (min 8GB) using that toolThen, Boot your PC from the Installation Media you just created (change Boot Order in your BIOS) to begin installing Windows 10"]},{"symptom":"Assembling own Computer        Hi, I've been assembling my own computer from components I've bought online to get a full insight in my PC's performance and warranty. I would like to run a fully licensed version of Windows 10 on my new computer and been trying to figure out which kind of license I am eligible to buy. I have read these articles about OEM and Retail:https:\/\/cloudblogs.microsoft.com\/industry-blog\/en-gb\/cross-industry\/2013\/05\/14\/licensing-logic-whats-the-difference-between-oem-retail-and-volume-licenses\/https:\/\/www.zdnet.com\/article\/is-it-ok-to-use-oem-windows-on-your-own-pc-dont-ask-microsoft\/As there seems to be different answers on the web I'm still not sure if it's approved by Microsoft Software Licence Terms for assemblers and enhusiasts to, by them self, install OEM license on a home built computer?Is the answer below an offical answer from Microsoft that's still up-to-date? And where can I find this information stated by Microsoft in Software Licence Terms?https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/build-my-own-computer-using-oem-windows\/ed1b0d63-b086-4070-a6be-83c0b0384d4dBest regards, ","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.The license terms for Windows 10 OEM are here: https:\/\/www.microsoft.com\/en-us\/Useterms\/OEM\/Wi... With older versions of Windows there were restrictions that the OEM software could only be supplied with a new computer - ie. from a manufacturer. The OEM software package had warnings printed on it to this effect, and it was also mentioned in the licensing agreement. The OEM packages no longer have this warning and there is no mention of that previous restriction in the terms I've linked to above.As you're no doubt aware the main difference with an OEM license is is cannot be transferred to a new motherboard (for example if you upgrade again in the future).Regards, David","First of all I would like to thank you for your answer David.If other users are reading this reply I would like to point out the importance of difference between OEM and retail as David already spoken briefly about. However this reply and further discussion is going to be about the OEM-license.As you're no doubt aware the main difference with an OEM license is is cannot be transferred to a new motherboard (for example if you upgrade again in the future).Regards, DavidAs far as I know, besides what David mentioned above, these disadvantages also occur with an OEM-license (someone can correct me if I'm wrong).Buying a OEM-license only let's you do a clean install of Windows 10 and can not be used to update older versions of Windows.Microsoft is not providing support for OEM-licenses. In case you need help using the operating system or having any problems you won't be able to contact Microsoft support.The answer from your reply brings me to my next question. I've read the following articles to try to gather information but I'm still not sure if this is approved by license terms for Windows 10 OEM:https:\/\/www.tomshardware.com\/reviews\/get-windows-10-free-or-cheap,5717.htmlSince it's completely in accordance with license terms for Windows 10 OEM to buy a OEM and install on a self built computer, I would like to ask about the price range from different sites online. The aberration of the total price for the operating system is quite high from different sellers, re-sellers, online auctions and shopping website's online. For example an American multinational American e-commerce corporation is listing the operating system for as low as 4 USD online while if I would go to the local IT-store in my town they would charge me roughly 190 USD, both for the Windows 10 Pro, 64 bit OEM-License.The 190 USD version is also sold as OEM and not retail.What's the recommended price from when you are sold a genuine licensed Microsoft Windows 10 OEM? How can I, as a buyer and end consumer, know if my key is not part of a fraud, stolen or non-genuine key? As a buyer and consumer (apart from the risk of being scammed of my money) would I in anyway violate the Microsoft end-user license agreement by buying the cheaper version of the operating system for 4 USD instead of 190 USD?Best regards,","The 190USD price is about right, I'm in the UK, I believe that's also about the price you'd pay buying directly from Microsoft.The very cheap offers you mention available online are in many cases illegal - they often turn out to be keys intended for another channel (such as the organisation \"volume licence\", or educational versions). The only real indicator that something might be wrong is that the price is too-good-to-be-true! This recent article from Tom's Hardware explains the options quite nicely: https:\/\/www.tomshardware.com\/reviews\/get-window... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Acount name on new PC after installing Windows from my Microsoft account.        Acount name on new PC, after installing Windows when I was logged in on my Microsoft account during installation.After installing, the account name is only 5 characters. How does the system come to these 5 characters?I like to see my full first name as account name.The name cannot be changed anywhere.I installed windows from scratch again, but still only the first 5 characters.What can I do to get the full first name as account name?I do not talk about local accounts, there I can control the names.Regard,H. Verploegen","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.You need to change the display name on your Microsoft account, here is an article which details how to do this:https:\/\/support.microsoft.com\/en-gb\/help\/402772...Regards, Ross"]},{"symptom":"Windows Mixed Reality Headset No Display        I am currently borrowing a Dell Mixed Reality Headset from my uncle, which when plugged into his pc works perfectly fine. However, when I plug it into my pc I cannot get a display however tracking and motion controllers still function. I have the most up to date drivers and most recent windows update. As for my pc's specs I have:Gigabyte GTX 1660 OCRyzen 5 260016gbcorsair vengeance 3200Mhz16gb corsair vengeance RGB Pro 3200MhzAsus Tuff B450 gaming motherboardCorsair h100i proCorsair Crystal Series 280x500gb wd blue ssd250gb intel 660p1tb wb blue 7200rpm hard driveSo, as far as I know, I shouldn't have any problems actually driving the headset. Also, the USB connector is plugged into a 3.0 super speed port. I have also tried uninstalling all software related to the wmr headset. Honestly, if I can't get this thing to work I'm just going to buy a Rift S as I had originally planned.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues with using Mixed Reality Headset on your PC. I certainly appreciate your efforts in trying to resolve the issue by performing certain troubleshooting steps. You may want to refer the section My headset displays are black from the articleTroubleshooting Windows Mixed Reality and see if that helps. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Can we play on Xbox Live without an Xbox Console        Split from this thread.Just curious, are we able to play Xbox live on PC without an Xbox console?","solutions":["Just curious, are we able to play Xbox live on PC without an Xbox console?Hey there, DaveYes you can :)Regards, ","Awesome! Thanks"]},{"symptom":"Access denied to Local disk C        Hi i changed my security setting to me local disk C , and now it does not open , i am the administrator , i tried to change security setting again but my access is denied , my access is denied to all the setting , i turned on the safe mood , and opened the built-in admin user to try to change administrator permission from there , but also the access is denied message still appear , what to do in this case???* Moved from education* Original title: Access denied","solutions":["For which folder did you change the security settings?What settings did you apply?Does Windows still work?"]}]}