{"windows":[{"symptom":"Microsoft Apps - Non optional - So what's the point in having an App Store ?  Just ram them in a non optional way        Why does Microsoft have to provide so many non uninstallable apps as it isn't as though people couldn't download or install them from the Microsoft App Store ?   On the same token, Why can't Microsoft provide a Windows 10 Pro version which provides all apps as optional ?   Is it money, is the CEO that desperate or so controlled by the Board that he can't provide the world with options that many people won't use and simply don't want ?  Keep it up, as I'm leaning on Linux for web browsing and daily go to Operating System which is loaded up on a totally different drive with encryption.People are less likely to buy the things they hate and it might be time for the CEO to dwell on that before the next time they push a non optional app that nobody wants, uses or asks for.","solutions":["Hi Rod. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.The app-ification of devices comes from Phones and Tablets, and since Microsoft wanted to broaden Windows to cover those Devices too, it decided to add an App Store just like Apple has on ALL of it's devices. If they didnt' they wouldn't be competitive and lag behind trends which are toward Apps. This is highly generational, as older users don't want or need Apps while younger ones expect them.So they provide a sampler of starter Apps with Windows 10, only some of which cannot be uninstalled in App Settings. If it doesn't have an Uninstall button there is this Uninstaller from MS TechNet that loads most of them and provides an Uninstaller script - set a Restore Point since there can be unintended consequences: https:\/\/gallery.technet.microsoft.com\/scriptcen...Or you can just ignore them. If you want to express your opinion on this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems. If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Laptop sleep mode problem        I have a Toshiba laptop with Windows 10 installed.  When I put it in sleep mode it will be fine for a while, but then it will begin to make notification sounds that ping\/blingggg until I open the screen.  On the screen will be a window asking me to enter my Microsoft password.  When I enter my Microsoft password and press enter, the window disappears and goes back to a display\/screen that starts the basic login process.  How do I get rid of this window that keeps popping up.   If I put the computer back in the sleep mode, it just does the same thing over again.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as you are getting notification sound when you put the PC in sleep mode. It’s really unusual because when the PC is in sleep mode, there shouldn’t be any process\/program working in background. There could be multiple cause of such issue in the PC during sleep mode. In order to assist you further, we would like to have the wakeup report. Please perform these steps and provide us the end result. Type CMD in Windows Search and right clickCMD icon.Select Run as administrator to launch command prompt in elevated platform.Copy and paste this command: powercfg \/lastwakePress Enter key. Meanwhile, put the PC in Clean Boot and see if you still get the notification sound in sleep mode. Refer the articleHow to perform a clean boot in Windows. A ‘clean boot’ starts Windows with a minimal set of drivers and startup programs. If the notification sound is not reoccurring in Clean Boot then please refer the sectionHow to determine what is causing the problem after you do a clean bootto determine the root cause of the issue. Note: After you finish troubleshooting, follow the sectionReset the computer to start normally after clean boot troubleshootingto reset the computer to start normally. We await your response, Aditya RoyMicrosoft Community – Moderator","In My Windows 10, there is NO sleep mode option.1) only shut down and 2) restart modes are available "]},{"symptom":"sticky note syncing        Question.I can type the word \"House\" on a Sticky Note and it saves in the cloud. I can open that same sticky note in outlook.com and read \"House\". I can open outlook on my computer, go to notes and open the note and read \"House\".With that said....I DRAW a house on a note... it saves in the note in the cloud. I can open the note in outlook.com but no picture. I open outlook on my computer, go to notes and open the note and no picture...Why?Thank you for your service.Roger Benson","solutions":["Hi Roger. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.So far Sticky Notes doesn't sync images, only text. If you want to suggest this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback and may interact with you. But Microsoft will not even see it here because this is a tech forums where we are mostly volunteers trying to help solve your problems. If you want to post back a Share link from your completed feedback (see Share link in feedback box) others can vote it up and add to it, and if you have joined the Insider program I can access it to endorse it with my MVP badge and track the issue for you."]},{"symptom":"Question: Did Microsoft remove the feature where my picture password's picture syncs with my personal Microsoft account? (December 31st, 2019)        If they did, I'd very much appreciate it if they brought it back!","solutions":["Hi Thomas. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I haven't heard about any changes in Picture Password since it was set up like this:https:\/\/www.howtogeek.com\/135561\/should-you-pro...How exactly did it sync with your MS account? I know it's only local to the PC like a PIN, so how exactly did it sync and to where?______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"burn system image backup for windows 10 on a dvd        how do I manually burn a system image backup on a dvd?","solutions":["how do I manually burn a system image backup on a dvd?You don't. DVDs do not have sufficient capacity to record a Windows image. Download & install the free version of Macrium Reflect, then use it to create & store an image on a USB 500 GByte hard disk. They cost less than $50 and can also be used as your regular backup medium.","Hi Brian, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved. My Preferred Free Tool is Macrium Reflect. Macriurm Refelct - Free https:\/\/www.macrium.com\/reflectfreeHow to Create a Full-Disk Backup of Your PC with Macrium Reflect https:\/\/www.howtogeek.com\/howto\/7363\/macrium-re...Create a Windows 10 System Image using the Best Free Alternatives https:\/\/www.groovypost.com\/howto\/create-windows...Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all."]},{"symptom":"How to recover permanent deleted folder        I accidentally deleted a folder of pictures permanently - Is there any way to recover? * Moved from Community Participation Center","solutions":["You also deleted the deleted items from the Recycle Bin?Try this free Program to attempt to recover your Data, or you may need to use Data Recovery specialists, who are very, very expensive.https:\/\/www.piriform.com\/recuvaWhat it can and cant dohttps:\/\/www.piriform.com\/docs\/recuva\/introducing-recuva\/what-it-can-and-cant-doThere is also a portable version which you don't have to install on your hard driveRecuva - Portable version________________________________________________This is an interesting article about file deletion and recovery of same:Why Deleted Files Can Be Recovered, and How You Can Prevent ItWhen you delete a file, Windows removes the pointer and marks the sectors containing the file’s data as available. From the file system’s point of view, the file is no longer present on your hard drive and the sectors containing its data are considered free space.However, until Windows actually writes new data over the sectors containing the contents of the file, the file is still recoverable. A file recovery program can scan a hard drive for these deleted files and restore them. If the file has been partially overwritten, the file recovery program can only recover part of the data.@@@@@@@@@@@@@@@@@@@@@@@A word of advice: You should always have your data backed up to at least two external media destinations (external hard drive, DVDs, flash drive) in case of system file corruption and\/or hard drive failureCheers."]},{"symptom":"How to activate Windows 10        The edition installed on my PC is Microsoft Enterprise. And it says here that my windows is not activated. Few months ago, I sent my laptop to a computer shop and let them fix it because there is a notification on the right lower part of the screen which says Activate Windows. Now, that notification reappeared and I am trying to find ways on how to activate it without sending it to the shop. The error code is 0xC004F074.","solutions":["If you have a Windows 10 Enterprise version, then the only way to activate is by having a valid licence key or by buying this licence.  This is usually used by large businesses via volume licencing so if you're the sole user\/owner of this PC then its unlikely to be legitimate for you to be using this and you will need to buy an appropriate individual licence (probably either Home or Pro).","Download and run this: https:\/\/www.microsoft.com\/en-us\/p\/showkeyplus\/9... to find all keys used on the PC.Also run this to see what is currently installed & post a screenshot: Right click on start & choose powershell with admin & enter: slmgr.vbs \/dlv This will show a popup showing whether your license is OEM, Retail, or Volume amongst other information.If this states you have a volume licence then there is away to return to a legal key if there's one in the BIOS.If it does please post back. It may be that you should have Pro but there’s a bug which is downloading\/installing Enterprise.Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thank you so much for the response! I have here the screenshot but I still do not know what these information means and what to do next.","Unfortunately it appears the computer shop has installed a volume license which is illegal for home use.If showkey gives you a key then we can proceed. If it doesn’t then I need to know which version of Windows you should have installed (Home or Pro).","And I was trying to download the ShowKeyPlus app but it says that it is not compatible with my device.","You can also download it here: https:\/\/www.techspot.com\/downloads\/7129-showkey...If this still doesn’t work let me know. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Please do not download any repair tool which is offered by this site other than the ones I mention\/recommend..Thoroughly research any product which is mentioned here before you decide to download and install it.","Thank you so much for the response! Where will I buy the license and how much would it normally cost?","The Microsoft store website.  Not sure on cost off the top of my head sorry, but should be easy to find there.  Avoid random websites flogging Windows at silly cheap money there have been many reported cases of these being illegal licences sold as well, if it's too good to be true it probably is!","Any update for me?","I'm sorry for the late reply. Bee very busy for the last few days. Have I installed the right app your shared on the link? "]},{"symptom":"facing problem after updating windows        Hello,I am very sad because i couldn't find my folder which contain important documents. I just updated the windows 10 and now i am not able to see my folder. i don't know, where it went. I am afraid that due to the updates the folder got deleted but it's impossible. there must be a way to get my folder back. let me know how can i access my folder?Thanks.","solutions":["Where was the folder stored, C:\\ drive or another drive?","Hi Shirley, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Can you check the following folders: C:\/Users\/<Username>\/Documents C:\/Windows.old\/Users\/<Username>\/Documents Also do you get a message that you are being signed into a temporary account?"]},{"symptom":"Formating cd disk        I can't format a cd rw","solutions":["Hi Michael. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.What happens when you put the disk into the drive, open File Explorer, under This PC, right click on the CD\/DVD drive and choose Format? If it's RW you may need to choose Erase.More in this illustrated tutorial: https:\/\/www.techjunkie.com\/format-cd-windows\/I hope this helps. Feel free to ask back any questions and keep me posted. ________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Will Microsoft ever be sued for destroying our PCs with faulty updates?        Just needs leaving town for Christmas vaca, I allowed the windows 10 update to run. It did the \"please do not shut of your pc\" update countdown.  Everything went ok as it was already in shut down mode.  Once it shut down, I turned of the power strip and went or of state for a week to family for Christmas.  When I got back, my Acer told me it had no bootable drive. The arm crashed on the disk. All my data was lost and now I am unable to get my PC up and running again.  This is Microsoft's fault because they give us no control over if or when we want system updates.  We are forced to trust them and this happens! ","solutions":["What update was it because seems a little late in the day for November update so maybe a driver update that did this? If as I suspect from the timing it is an Insider Build then simply Microsoft have little or no responsibility for anything that happens as a result of these \"test\" builds.  Whilst I am sure they will try to push out a fix if possible the problem is when you sign up for the Insiders you are agreeing to be a guinea pig for them.  To enroll in the Insider build you agreed to:  \"You may choose to use preview, insider, beta, or other pre-release versions of the software (“previews”) that Microsoft may make available....Previews are experimental and may be substantially different from the commercially released version. Notwithstanding anything to the contrary in this agreement, previews are provided “AS IS,” and no warranty, implied or express (including the Limited Warranty), applies to these versions. By installing previews on your device, you may void or impact your device warranty and may not be entitled to support from your device manufacturer or network operator, if applicable. Microsoft is not responsible for any damage thereby caused to you. Microsoft may not provide support services for previews. If you provide Microsoft comments, suggestions or other feedback about the preview (“submission”), you grant Microsoft and its partners rights to use the submission in any way and for any purpose.\" Take a look at the entries for each build and see if you are on any of the \"know issues\" list which would go some way to seeing why this happened: https:\/\/blogs.windows.com\/windowsexperience\/tag\/windows-insider-program\/In terms of not having control of the updates either you can leave the insider program which would put you on the stable builds or if you do want to stay you have been able to since may pause the updates - more can be found here: https:\/\/blogs.windows.com\/windowsexperience\/2019\/07\/15\/windows-10-tip-more-choices-for-updates\/Sorry to be a little blunt with this but you either restrict these kind of programs to just developers etc but don't get the volume of feedback that a more public program gives. Microsoft are pretty \"worst case\" in their terms making it hard to say you didn't realise this could happen! You can find information on possible fixes for failed updates here: https:\/\/support.microsoft.com\/en-gb\/help\/4089834 and am sure people will have advice etc to get back on track and really do feel for you on this.Sam"]},{"symptom":"I can’t access a website on Windows 10        I can’t access a specific website. Im using Windows 10 and Google Chrome but I have also tried Firefox with no luck. There is no error code and it just states “firewallerror” after the URL (ex. texasfurnitureonline.com\/firewallerror). I have turned the firewall off, done a clean boot, changed every setting in Chrome to “allow” and nothing will work. My co-workers are also having the same issue on their desktops.","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.If it's happening on everyones computer in the office it sounds like it could be a network based firewall (ie. in your server\/router) which is blocking the site... or it could be the particular site has blocked your network (for example if it were a competitors website). If you try accessing the same site from a computer NOT connected to your network does it work? So perhaps a laptop linked to a mobile phone hotspot for example? Or even just directly on a mobile which is NOT linked to your Wifi?Regards, David","Yes it works on a phone.","So I would conclude there's something in the network (either at your end, or that particular websites end) which is blocking your connection. I would say this because you've said it's happening on every computer.I've tried the site on my Windows 10 computer and it loads fine, so there's not a general problem.Also the fact that the URL address seems to be changing to add the \"firewallerror\" text would suggest it's something at the webserver end as it's redirecting your request to that message.The best bet might be to try contacting the website owner and asking why this is happening.","I'm having the exact same issue.  I am getting an error with every website I try to access using Google Chrome.  My website is a Showit site, and I can only update it with Google Chrome.  Here is the error: Details about the network security diagnosis.Settings that might be blocking the connection:Filter name: GUID_MFE_CONNECT_CALLOUT_V4"]},{"symptom":"HP Notebook Bootup        when I turn it on and log in, I see a black screen because the desktop & taskbar aren't loaded yetBUT, then I get a blue screen with the error code \"REFERENCE BY POINTER\". I try going into safe mode(which worked) and deleting some things, but it doesn't change anything","solutions":["Hi, FrostyAnimations126 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Cannot delete files in Windows 10        I bought a new pc pre-loaded with windows 10.  I transferred files from my old pc which ran windows 7.  I find that I cannot delete files from my desktop or in explorer.  I hit delete button or right click and hit delete, but nothing happens.  No error, nothing.  If I rename the file by deleting the last character, I can then delete it but get this message.  Is there something I can do to not have to follow this tedious process?  Very frustrating.  Thanks","solutions":["Hi handyman_vito My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.1. Make sure in Onedrive the folder is created. Then go to file explorer then right click your onedrive and go to Settings NOT properties.Click the Account tab then click Choose Folders. Uncheck the folder that you can not delete. See if that works. 2. Turn off Files on Demand in OneDrive Select the OneDrive cloud icon in the Windows taskbar notification area. In the activity center, select More > Settings. On the Settings tab, unselect the Save space and download files as you use them box.3. Try unlinking OneDrive, and setting OneDrive up to a new folder (a newly created OneDrive folder)Hope this helps.","Thanks.  It appears one drive is the issue.  I do not want to use one drive at all.  However, when I tried to turn it off, I can't see files on my desktop at all.  How do I get all my files resident on my hard drive and how do I disconnect and even delete one drive?  Thanks for the help"]},{"symptom":"Allow mouse or keyboard to wake computer        I'm using Windows 10 Pro on my laptop, which is connected to an external monitor. After starting my laptop, the lid is closed.  When I step away from the computer for an hour or so, it goes to sleep and the monitor screen is blank.  When I return, I should be able to press the SHIFT key on my keyboard or move my mouse to wake up the laptop but it doesn't work.  I have to open the lid on my laptop and press the power button and then it wakes up immediately.My last 5 computer (all laptops) have been set up the same way with the external monitor and keeping the lid closed - I've never had any problems waking up the computer with the keyboard or mouse.How do I fix this?","solutions":["Hi JC. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Make sure Hibernate is not also set as it only wakes from the Power button: https:\/\/www.tenforums.com\/tutorials\/2843-change...Go into Device Manager, open Keyboard and Mouse, under Power Options tab tick the box to Allow this device to wake up the PC.If those all fail I will give you all possible fixes for Sleep. If you need help performing any step just ask back:First confirm you have the Sleep options configured correctly as shown here: https:\/\/www.tenforums.com\/tutorials\/2843-change....You might want to try Hibernate to succeed Sleep, or use Hibernate in place of Sleep - it's just a deeper sleep that actually powers off because desktop stored in RAM during sleep is written to hard drive hiberfile then powered off.Most Sleep problems are caused by the Display driver, so try updating yours from the PC or Device maker's Support Downloads web page for your full model number, Serial Number or Dell Service tag. While there make sure you have the latest BIOS, Chipset, Network, Sound, USB and all other drivers by comparing those posted for download with the version and date of the corresponding ones in the Device Manager.If that doesn't help then in Device Manager on Display device Driver tab choose Roll back, Uninstall (then restart to reinstall) or try another one previously installed at Device Manager>Display adapter>Driver>Update Driver>Browse>Let me pick.In addition there are steps here to specifically troubleshoot Sleep mode problems:http:\/\/www.makeuseof.com\/tag\/fix-windows-10-sle... What I do is go into Advanced Power options and set Display and Sleep to 1 minutes, Hibernate to 2 minutes, then after completing each step restart the PC and observe what happens for 3 minutes.Also did it previously work? Do you have a System Restore point from when it did?http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t...This may have been caused by Windows Updates. Check which Updates were installed right before the problem began, and if necessary uninstall them from Settings > Update & Security > Windows Update > Installed Update History.You can also try to roll back using System Restore to a point before this began: http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... Then if an Update reinstalls and causes the same problem uninstall or roll it back again, then immediately hide it using the Hide Updates tool from Method Two here:https:\/\/www.askvg.com\/fixing-windows-10-automat... If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1903 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows 10 keeps dropping sound device, losing sound        I have this bizarre problem with sound.I just rebuilt my computer due to a tired motherboard, so now I am running an MSI B450 Carbon AC mobo with a Ryzen 5 2600x cpu, nVidia Geforce GTX 1070 graphics card, 16GB ram DDR4 1066, Patriot v370 Viper headset.All drivers are up-to-date.System is clean, no malware or virus reported.I run Webroot security, IObit Advanced System Care, Driver Booster Pro, Steam, Cliqz, and little else atm since I just reinstalled the OS trying to fix this sound problem.After anywhere from 20 minutes to a few hours, the OS suddenly drops the sound device for the Patriot headset.The device is visible in the Device manager under sound, but it is greyed out, not mounted and I can't find a way to remount the device.Troubleshooting doesn't work or help because the device has been dropped, so it isn't there to be analyzed, and in any case there is nothing wrong with the driver per se, because sometimes it returns as suddenly and mysteriously as it disappeared in the first place, working just fine.Please don't advise me to follow all the usual steps offered by support, been there, done that multiple times to no avail.Reinstalling drivers and the OS makes zero difference.About half the time when the sound goes the computer freezes minutes later, but not always.It takes forever to boot, sometimes gives \"device power setting failure\" on reboot, takes forever to shut off.I just upgraded to Windows 10 from Windows 7, and am regretting it every day.Does ANYONE  have any clue as to why the device is being dropped, and why it would randomly return?","solutions":["Hi Michael. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.We have no idea what you've tried, so how would we help if you tell us we can't make any suggestions?What jumps out right away is 3rd party anti-virus, IOBit tweaking suite, and a driver finder which no expert anywhere recommends because of how often they cause problems. Unless you can disable the AV and roll back to a point before you used the tweaking suite and driver finder, it may require a Clean Install which always fixes all problems.But I'll give you all possible solutions for Sound problems in order of priority, so please try any you've already tried again in order. If you have any problems performing any steps I'll be standing by here to help you.1) Update the sound driver from the PC or device maker's Support Downloads webpage for your exact model, if it is newer than the one presently installed in Device Manager reached by right clicking the Start button. While there compare to make sure you also have the latest BIOS, Chipset, Display, Network and all other drivers. If this doesn't work then roll back the existing driver if the choice is available on Driver tab, if not Uninstall, restart PC to reinstall. If that's not enough try all previous drivers choosing Update Driver > Browse > Let Me Pick.2) Restore the Windows Audio Service which may have become disabled: https:\/\/www.tenforums.com\/tutorials\/57567-resto... 3) Next try these checklists: https:\/\/support.microsoft.com\/en-in\/help\/402699... https:\/\/www.howtogeek.com\/443702\/how-to-fix-sou...4) Right click Volume icon in System Tray, choose Sound Settings, from the Output and Input devices dropdown menus, choose then one(s) affected to see if that helps. If not use the Troubleshoot button nearby.5) Run the Playing Sound troubleshooter at Start button > Settings>Update & Security>Troubleshoot.6) Try rolling back the sound drivers in Device Manager reached by right clicking the Start button. Choose Sound controller and other audio devices, then Driver tab, then Roll back if available.7) If no newer sound drivers then uninstall the one presently installed in Device Manager, reached by right clicking the Start Button. Restart PC to reinstall.8) Try other and older drivers for your model Sound controller, too. For example, try the next oldest driver in the model's online Support Downloads list. To try all previous drivers installed on your system, in Device Manager choose Sound controller's Driver tab, then Update Driver, then Browse, then Let Me Pick. Finally, try installing the latest Sound driver in Compatibility Mode as shown here:https:\/\/social.technet.microsoft.com\/Forums\/win...9) If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 10) If this was caused by a Version update (which you can confirm at Settings > System > About) then you can roll back the version in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 11) You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... 12) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. 13) If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... -------------------------------------------- But remember that in Windows 10 everything depends upon the quality of the install, and Factory or Upgrade installs are inferior installs which most enthusiasts won't even run because they'd expect endless issues. Consider now or later doing the Clean Install in this link which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... There is also an automated Fresh Start that reinstalls WIndows while shedding corrupting factory bloatware, saves your files, but doesn't clear the drive to get it cleanest:https:\/\/www.howtogeek.com\/265054\/how-to-easily-... I hope this helps. Feel free to ask back any questions and let us know how it goes. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Did you read what I said?I have done most of that already. Step by step through every and all the recommended procedures offered by Microsoft.Two different Microsoft techs did a remote clean install to no effect.I strongly suspect a buggy (what else is new?) update is causing the problems since the headset worked fine for the first few months, and only recently have I had the long boot times and stop times issues. It still works fine when the OS remembers it's there.The sound still works through my TV monitor btw, just not through the headset, because the OS keeps dropping the USB Advanced Audio device randomly and just as randomly reacquires it.Which update do you recommend uninstalling?Like I stated in my first post: all drivers are up to date with the most recent available from the manufacturers.A decent OS offers a way for users to manually mount devices. Does Windows 10 allow such? If so, kindly explain the  procedure.It's been ~3-5 weeks since the issues began.","Why would you think you could talk that way to me on Christmas eve when I took the time to explain that I had no way to know what all you'd done so I was going to give you all possible steps in case there were some you hadn't tried?No one else would pick up a thread like that because it's usually a sure thing we'll be abused if we suggest anything.  But I decided to give you a chance.  Sure enough.Notice how you reject ALL the steps without even noticing that one of them is how to roll back Updates, then you ask me if I think it might be Updates.  Yes, that's why I gave you that step.Bye.","Sorry, but I, like many others, get frustrated at being told to do the same ineffective things over and over again.I did clearly state I have already done all recommended steps, several times.Rereading my post, I can see I offered no insult or abuse, just questioned whether you had actually read my post or just the title before you responded.I have uninstalled the last update, which is why I asked which one you recommended to uninstall.Your disdain for third party software doesn't help. The software comes highly recommended and is well thought of usually. Third party software is what makes using Windows tolerable.Microsoft has a very, very long history of buggy updates that they decline to accept responsibility for, usually blaming it on other products. It seems like most updates are required to fix bugs and holes presented by the last update.The issue is this: why does Windows 10 drop a particular sound device, while retaining others, only to reacquire it on its own sometimes? How does that happen?IS there a way for a user to manually mount that device?As I said in my reply, two different Microsoft technicians looked at my setup remotely and found nothing wrong, both reinstalled my OS, the first reinstall screwed up my computer, the second rolled it back to where it was before the first one messed it up, but neither solved the problem or offered any clue as to how to fix it.At that, the support was better than usual circular techbabble you get from them.","How would I know what \"recommended steps\" you've done unless you listed every last one of them?  Obviously I don't even know one step you've done unless you list it.  Mine are based on collecting everything that's worked for countless thousands of consumers I help in the forums, constantly adding to and subtracting from the list, adding recent issues that need to be checked, and known issues which change from month to month. If third party software is what makes Windows 10 tolerable, why have none of the millions who have completed myClean Install Windows 10 , and stuck with only the recommended (Windows) tools and methods, ever come back to report another problem I've seen?If even one of them had added a third party tweaking suite I'd expect them to report back problems.This is not Support, this is a forums where peer users give their time to help others.   I gave you a chance to cooperate, in spite of the warning signs in your first post that you were going to attack anything I said as having been on your imaginary forbidden list of things you'd already tried.  So instead of continuing, it stops here.  No one will help someone who is so uncooperative and just daring kind volunteers to suggest something they don't like.  To do this on Christmas is intolerable.If you want to complain to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback.   But Microsoft will not even see it here because this is a  tech forums where we are mostly volunteers trying to help solve your problems.","Oh, the reason the troubleshooter doesn't do a thing is that it is functioning with the assumption that there is something wrong with the device, and the device itself is ok.The troubleshooter can't troubleshoot what isn't there.The problem originates at a higher level within the OS. Something,. some event, is dismounting that device. Something else within the OS then sees the device and remounts it...sometimes, but not always, I'd say perhaps 30% of the time.It stays for a bit then is lost again, and then the machine crashes. Not a blue screen crash, it freezes. When I pull up the task manager, it goes to a blank black screen if I am in a game, any game. I can still hit the Windows key and access the task bar, allowing a reboot from there, but attempts to close the game in question don't produce results unless I load the task manager several times and close it several times then the game quits and I get back to the desktop, but still without sound.It is definitely an OS problem so far as I can see, and not an uncommon one, as my researches have found innumerable complaints and pleas for help with the issue of Windows 10 losing sound, which means it keeps losing track of sound drivers.Microsoft needs to fix the problem with their junkware.","I told you how to report this to Microsoft.  The Troubleshooter was only one step of dozens I gave including detailed tutorials with multiple steps.  It might take a full day to actually do the steps given instead of outright reject them with the absurd claim you'd already done them all.  Again, how would I know which ones you've done?I've helped more people in tech forums than anyone else on the web, daily for ten years.   When someone introduces himself telling us not to give any suggestions because they've already been tried, this is someone looking for trouble and not help.  If you want help then perform all of the steps including in the tutorials and report back results for each. ","How rude.I told you this problem has been ongoing, and that I have done the all steps that Microsoft has officially listed (yes, there is an official Microsoft recommended list of fixes) to solve the problem over the past few weeks. I have also followed all the relevant procedures I could locate via forums and Windows troubleshooting websites.I HAVE reported this to Microsoft and worked with ~five different techs going through these steps you have recommended.You ask me to spend days reinstalling (which I've done twice already) and going through all the same steps that failed previously without once addressing the real problem:Why is Windows dropping the sound driver? How is it reacquiring it?Clearly for all your supposed expertise you have no idea of what is causing the problem. It's truly ok to say \"I don't know how to fix that\" rather than insult people seeking help.I don't mind if you don't reply, since you have nothing to offer but time-wasting \"fixes\" that have failed to work. Reinstalling everything is basically a nuclear option that says \"I don't know what the problem really is, but hopefully this will fix it\".I would much rather find and fix the specific issue with dropping sound drivers, which seems to plague Windows 10 users and has done from the earliest versions so far as I can tell.","Is this the list of Microsoft sound fixes list you're referring to:https:\/\/support.microsoft.com\/en-in\/help\/4520288\/windows-10-fix-sound-problems ?  It is the only MS published list I know of.It is one of 13 steps including eight other separate tutorials I gave you.   It is only a fraction of the fixes I gave which you dismissed as though I should know you've already tried them when you didn't even say what you've tried. If this is the list you tried from MS, then you've not even begun on my list of fixes.If you've tried the Sound controller driver from the PC and adapter maker's Support downloads web page, then try uninstalling the driver, restart to see if that stabilizes it. Since there might be Display audio involved, uninstall all the Audio category drivers, restart the PC to reinstall.  If not try all older drivers in Device Manager > Sound controller > Browse > Let Me Pick.","And yes, I have done all of those...several times.Do you know the answer to these questions or not? It's fine to say no, ok?Why is Windows dropping the sound driver?What events can possibly trigger the loss?How is it reacquiring the driver on its own?Is there a way to manually mount the driver?"]},{"symptom":"file history?        how do I reconnect my file history?","solutions":["Hi Chaz. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See here how to reconnect File History: https:\/\/support.microsoft.com\/en-us\/help\/402656...Here's a complete guide to File History: https:\/\/www.howtogeek.com\/74623\/how-to-use-the-...Make sure to follow these steps to recover files or it's easy to accidentally overwrite them on a new PC:https:\/\/www.techrepublic.com\/article\/how-to-cor...The safest and most reliable backup method is to sort your files into their User Folders (Documents, Desktop, Pictures, Downloads, etc) and periodically drag or copy them to external or another hard drive. See tips for copying large groups of files here:https:\/\/www.pcworld.com\/article\/2086566\/the-man... Then have one other Cloud backup so your files are safe from fire and theft and easily accessible via the internet just like email. Some suggestions to help ease into this habit:You can drag or copy 5gb for free into OneDrive app to store in the cloud where they are safe from fire and theft. You can also choose to sync the Desktop, Pictures and Documents folders (only) in OneDrive app Settings > Backup for real time backup. More here:https:\/\/www.tenforums.com\/tutorials\/116029-turn... If you install Google Drive, you can use their new Backup to choose ANY User folders (Documents, Pictures, etc.) to sync up to 15g for free to their cloud in real time. You can also drag\/copy selected files into Drive folder. More here:https:\/\/www.blog.google\/products\/photos\/introdu...Besides your files you should back up a System Image to use in place of reinstall in 20 minutes. The best free alternative is Macrium:http:\/\/www.howtogeek.com\/howto\/7363\/macrium-ref.... There is an easy way to mount the System Image to extract files if needed. Some prefer to move their User folders off of C to make the image smaller and so they stay current if you need to re-image C. Here's how:http:\/\/www.dummies.com\/computers\/operating-syst... This way if Windows ever becomes irreparable you can restore C in 20 minutes from recovery media, and your files will be current and safe in their own separate partition. If they are left on C they will be dated from when the image was taken.I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Using robocopy to copy my C:\\Users folder results in error ERROR 1920 (0x00000780) The file cannot be accessed by the system.        I am trying to follow this procedure to move my C:\\Users folder from my 500GB SSD to my 1TB hard drive. I am on Windows 10 1909.https:\/\/www.youtube.com\/watch?v=r16puaMKI8oOf course I understand if I mess this procedure up my computer may not boot. I just set this computer up and so I don't have any important un-backed up files on it yet.When I run the `robocopy \/copyall \/mir \/xj D:\\Users C:\\Users` command described in that tutorial from a Windows 10 1909 boot media flash drive, it runs for a few seconds and then gives me the following error which keeps repeating over and over. Yes I ran diskpart and listed my volumes, when booted this way D: is the SSD drive Windows is installed on and C: is the HDD I want my Users folder on.<Date> <Time> ERROR 1920 (0x00000780) Copying File D:\\Users\\<Username>\\AppData\\Local\\Microsoft\\WindowsApps\\GameBarElevatedFT_Alias.exe The file cannot be accessed by the system. Waiting 30 seconds... Retrying...This is the \"dir\" output from the folder of interest.D:\\Users\\<Username>\\AppData\\Local\\Microsoft\\WindowsApps>dir Volume in drive D has no label. Volume Serial Number is 2E24-0CE3 Directory of D:\\Users\\<Username>\\AppData\\Local\\Microsoft\\WindowsApps12\/05\/2019  12:30 AM    <DIR>          Backup12\/20\/2019  09:19 PM                 0 GameBarElevatedFT_Alias.exe12\/05\/2019  12:30 AM    <DIR>          Microsoft.DesktopAppInstaller_8wekyb3d8bbwe12\/04\/2019  09:19 PM    <DIR>          Microsoft.MicrosoftEdge_8wekyb3d8bbwe12\/20\/2019  09:19 PM    <DIR>          Microsoft.XboxGamingOverlay_8wekyb3d8bbwe12\/04\/2019  09:19 PM                 0 MicrosoftEdge.exe12\/05\/2019  12:30 AM                 0 python.exe12\/05\/2019  12:30 AM                 0 python3.exe               4 File(s)              0 bytes               4 Dir(s)  406,692,597,760 bytes freeD:\\Users\\<Username>\\AppData\\Local\\Microsoft\\WindowsApps>Running `notepad GameBarElevatedFT_Alias.exe` from the \"D:\\Users\\<Username>\\AppData\\Local\\Microsoft\\WindowsApps\" folder results in an error message from notepad that \"The file cannot be accessed by the system\".Why am I getting this error and how should I continue?","solutions":["Can you show the file attributes of: GameBarElevatedFT_Alias.exe","What command would you like me to use for that?","Hi Jonathan, can you describe the procedure you are doing in words?","Hi Jonathan, can you describe the procedure you are doing in words? I start booted into Windows 10 1909. I have already installed some of my programs. Windows is installed on my ~500 GB SSD. My ~1 TB HDD is formatted as NTFS using Disk Management.I reboot to my original Windows installation media, a USB flash drive and press Shift + F10 to bring up a command prompt.I run `diskpart` and using diskpart run `list volume`. I see that booted this way, my ~500 GB SSD is drive D: and my ~1 TB hard drive is drive C:. I `exit` the diskpart tool.I run `robocopy \/copyall \/mir \/xj D:\\Users C:\\Users` which runs for a few seconds and then produces the repeating error shown in my original post.I press ctrl + C to get out of robocopy.At first I had been booting into the Windows recovery environment but I was having this error and decided to get out my original installation media to be as close to the video tutorial as possible but I still get the same error.","Please show the result not dir but dir \/a \/q command.","Please show the result not dir but dir \/a \/q command. D:\\Users\\<Username\\AppData\\Local\\Microsoft\\WindowsApps>dir \/a \/q Volume in drive D has no label. Volume Serial Number is 2E24-0CE3 Directory of D:\\Users\\<Username>\\AppData\\Local\\Microsoft\\WindowsApps12\/20\/2019  09:19 PM    <DIR>          ...                    .12\/20\/2019  09:19 PM    <DIR>          ...                    ..12\/05\/2019  12:30 AM    <DIR>          ...                    Backup12\/20\/2019  09:19 PM                 0 ...                    GameBarElevatedFT_Alias.exe12\/05\/2019  12:30 AM    <DIR>          ...                    Microsoft.DesktopAppInstaller_8wekyb3d8bbwe12\/04\/2019  09:19 PM    <DIR>          ...                    Microsoft.MicrosoftEdge_8wekyb3d8bbwe12\/20\/2019  09:19 PM    <DIR>          ...                    Microsoft.XboxGamingOverlay_8wekyb3d8bbwe12\/04\/2019  09:19 PM                 0 ...                    MicrosoftEdge.exe12\/05\/2019  12:30 AM                 0 ...                    python.exe12\/05\/2019  12:30 AM                 0 ...                    python3.exe               4 File(s)              0 bytes               6 Dir(s)  406,291,288,064 bytes freeD:\\Users\\<Username>\\AppData\\Local\\Microsoft\\WindowsApps>","Seems you do not have enough access rights to this folder. Please open properties of this folder and check access rights..","Seems you do not have enough access rights to this folder. Please open properties of this folder and check access rights..Here is a screenshot of the WindowsApps folder security.And here is a screenshot of the GameBarElevatedFT_Alias.exe file security.I haven't changed any of these settings so I'm not sure why they would be different for me than anyone else's.","Please show previous screen and \"Effective access\" tab on this screen.","Please show previous screen and \"Effective access\" tab on this screen.WindowsApps Security Tab of Properties.WindowsApps Effective access.GameBarElevatedFT_Alias Security Tab of Properties.GameBarElevatedFT_Alias Effective access.The blacked out rectangles are just the username."]},{"symptom":"Diarium        I tried downloading the app Diarium on the Microsoft Store for Windows 10 OS. It will not download with an error code of Code: 0x80070005. I paid for the app with no luck of the download. I tried restarting my computer, restarting Windows Store, and so on. Please Help. Thanks. ","solutions":["Hi JamesPowers4, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Does the error happen only when you try to download that application? Or does it happen with all?These indications can help you restore the proper functioning of the Windows store.https:\/\/support.microsoft.com\/en-us\/help\/402749...Additionally, you can clear the store cache and execute the store reinstallation, follow these steps:https:\/\/www.tenforums.com\/tutorials\/15057-clear...Press the Windows key + X >> PowerShell >> Copy and paste, using the mouse button: Get-AppXPackage * WindowsStore * -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$ ($ _. InstallLocation) \\ AppXManifest.xml\"} + Enter, wait for the process to finish, then it is recommended to restart the computer. Check if the problem happens exactly the same if you start Windows with a clean boot, it is an error-proof process, which allows us to detect if it happens by any third-party program or installer.https:\/\/support.microsoft.com\/en-us\/help\/929135...Let me know if you have something else that I can help you with, I'd be happy to help.Happy new year Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi, Note: The PowerShell command, run it as administrator Regards"]},{"symptom":"Headset microphone not working        I recently bought a PC (for gaming). Whenever I plug my headset into it, I can hear just fine but cannot talk. Looking in sound control panel, my headset has a \"speakers\" icon and is called speakers. Clicking on the recording tab in sound control panel, I dont even see my headset in there. I dont know whats wrong, but I know it isnt my headset because it works fine on mobile. Please Help! Thanks! (ps im plugging my headset into a port on the top of my pc with a headset icon next to it. if anyone knows how to remap the ports please share)","solutions":["Hi Zoe. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything possible to try for headset problems so at least something will work. If you need help performing any steps I am standing by here to help:First try the steps here: https:\/\/www.maketecheasier.com\/fix-headphones-n...https:\/\/www.windowscentral.com\/setting-your-hea...https:\/\/www.lifewire.com\/fix-headphones-not-wor...https:\/\/www.thewindowsclub.com\/headphones-not-w...https:\/\/merabheja.com\/fix-no-speakers-or-headph...https:\/\/troubleshooter.xyz\/wiki\/fix-headphones-...Go to Settings > Devices > Autoplay to look for the device and change the default behavior in it's Dropdown Menu.Right click Volume icon in System Tray at right end of task bar, Open Sounds Settings, in dropdown menus at top make sure Headphones are selected and Connected for both Playback and Recording Default Devices.If not again right click Volume icon in System Tray to choose Troubleshoot sound problems.See how to re-enable the \"Which device did you plug in\" popup which can solve headset issues:https:\/\/windowsreport.com\/you-just-plugged-unpl... (avoid ad links)https:\/\/h30434.www3.hp.com\/t5\/Notebook-Audio\/En...https:\/\/forums.tomshardware.com\/threads\/how-do-...https:\/\/www.dell.com\/community\/Windows-10\/How-g...https:\/\/answers.microsoft.com\/en-us\/windows\/for...Go to the Device Manager reached by right clicking the Start button, choose Sound controller device, on Driver tab choose Roll back or Uninstall, restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver. Do the same for the headset device and\/or it's microphone. Update the Sound driver from the PC or Device maker's Support downloads web page. While there also check that the Chipset, BIOS, Display, USB, Network and all other drivers are the most current.Sometimes it helps to unpair or disconnect all other Bluetooth devices from the PC in Bluetooth settings, then try again to connect the headset.If this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t...If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....To chck over the integrity of your install go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m...If you want to report this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems.If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it. If you are an Insider I can also vote it up with my MVP badge and track the issue for you.I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows 10 pro update issue        Hi,My computer could not finish the update it gives me this code (version 1909 - Error 0x800f0805) then gave me another code 0x8007001F-0x20006. Please help. ","solutions":["Hi Ismael. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I would manually upgrade to the latest version 1909 by opening the Media Creation Tool from this link:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m..., choose Download Tool Now, then open the tool and choose Upgrade This PC Now. This saves your files, apps and most settings in place, is the most stable method to change versions, brings your Updates current, resolves most problems. If any problems report back the verbatim error and number, then continue with these steps for overcoming Version Upgrade problems:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If the Version has problems I will work with you to try to resolve them. If the problems are unfixable for now, you have ten days to roll it back in Recovery settings. You can then hide it so it doesn't try to reinstall following this same method:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... Most problems are resolved by doing this gold standard Clean Install which should get you past all difficulties as it has millions of others who have followed the steps in this link and never come back to report another problem:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... . So read it over and see if its something you want to learn to do.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to rate my post, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]}]}