{"windows":[{"symptom":"How do you disable loading of the last user profile after restart on Windows 10 home?        As far as I'm aware there is no way.Disabling Settings\/Account\/Sign-in Options\/Use my Sign-in Info to automatically set up my device . . .doesn't workChanging various registry keys doesn' t work.It's not a matter of having a password set, as it will load your account with the screen locked if you have a password.You can see the last user logged in with an administrator account.Disabling smart account switching (allowing you to send the current account login to the background and login with another account) does the trick, but they shouldn't need to be linked features.You can log in to the last user logged in before the restart and log it out, leaving the PC with no user logged in as is should be after a restart.","solutions":["And just when I thought that I was the most evil genius ... it turns out that there's a more evil genius than me! 😥Are you saying that the most recently used user profile is actually signed in after a restart, or just highlighted on the sign-in screen?","Hey, someone has to be the best! Don't give up though ;)But yes, the last used user profile is logged in after a restart\/shutdown.As an admin user you can see the other user logged in under the users tab of task manager.Even before logging in I have heard sounds from my Discord","If you require users to log in with a password, they won't be able to log in without one. ","Until I recently set up an account for my young daughter all the accounts had passwords, and I was still seeing this issue.","If all user accounts are currently logged out ... and all user accounts are password-protected ... the only way for any user account to log in is to supply Windows with the password for the account.The same is true whether the user account in question has Administrators permissions or Users permissions, and whether it is a local account or a Microsoft account.I can't imagine how a password-protected user account would be able to login without the user entering their user account password.","That's true. If there is a password the profile is loaded in the background like a locked login. If there is no password the account is logged in. Others have had this issue without a solution for years as well.The other threads are locked though.https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-other_settings\/how-to-stop-auto-login-of-last-user-windows-10\/1ce4b352-0856-40c0-87a8-2f8ef299007d?page=8"]},{"symptom":"Blank screen when printing a check        I have windows 10. When I go to print a check and screen goes blank. Is anyone else having this issue and can help me resolve it.***Modified title from: Microsoft Money 1999***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. For better clarity, please let us know: Are you trying to print using Microsoft Money 1999?When you say, “I go to print a check and screen goes blank” does the computer screen go blank or only the Microsoft Money application?Are you able to print using any other software?Are you aware of any changes made to the computer recently? If you are facing issues in printing from Microsoft Money 1999, we do have a dedicated forum for issues related to Microsoft Money, let me point you in the right direction. I would suggest you to post your query inhttps:\/\/social.microsoft.com\/Forums\/en-US\/home?forum=money, where we have support professionals who will be able to provide you the insights on this issue.  I hope your query will be resolved at the earliest.  Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"cannot shut down computer        New computer - Asus Prime Z390 - A motherboard, intel LGA1151 processor, 16 gb ram, new ss hd w\/ fresh windows 10 installed. I run troubleshooter for power, internet connections, windows 10 etc. Unchecked fast start up - reviewed numerous help forums - tried everything suggested to no avail.If I click shut down or sleep system powers down and just after complete shutdown system restarts. Only way to shut down is hard shutdown - holding power button until everything is off.Thanks,Greg Lester","solutions":["In Power options have you looked at Choose what power buttons do?","Yes - did that.","Also updated drivers, windows 10.","Hi Greg, please check system files by sfc \/scannow command. Update BIOS. Check system journal (Event Viewer) for possible errors at these moments, especially Kernel-Power errors. DistributedCOM errors should be ignored.","Bios updated. system scan was clean. Event viewer listed error - metadata staging failed.Computer still not shutting down.Greg","There should be several Kernel-Power errors in system journal. Please list details of them."]},{"symptom":"windows slowdown at start up and return from sleep mode and hibernate        Windows 10 Pro 1909 (OS Build 18363.535)MSI GE73 Raider RGB 8REsince about the December cumulative update for windows 10, when I turn on my system, or wake the system, the login screen is acting like I am running windows on a 15 year old machine, not one less than a year old. the cursor severely lags, any sound that plays (i.e. the logon sound) is broken up, like the system is under heavy load, and trying to enter any keyboard input  (pin code or password) is severely delayed. once I login to windows, the issue disappears. windows becomes responsive and the input lag disappears. looking at the event viewer the problem seems to lay with the lock screen app (which surprised me. I would have thought the locking mechanism of windows would have been built into the system, not relying on an app). I am seeing some strange messages that give no real info on what went wrong with the app. had anyone else encountered this issue? is there a way to solve it? or do we have to wait for M$ to fix what they broke?error messages seen in event viewer:Fault bucket 2218673995797537995, type 5Event Name: MoAppCrashResponse: Not availableCab Id: 0Problem signature:P1: Microsoft.LockApp_10.0.18362.449_neutral__cw5n1h2txyewyP2: praid:WindowsDefaultLockScreenP3: 0.0.0.0P4: 00000000P5: StackHash_0000P6: 0.0.0.0P7: 00000000P8: 00000000P9: PCH_84P10: Attached files:\\\\?\\C:\\Users\\Cybot\\AppData\\Local\\Temp\\WERB00E.tmp.WERDataCollectionStatus.txt\\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\Temp\\WERB36A.tmp.WERInternalMetadata.xml\\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\Temp\\WERB9D4.tmp.xml\\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\Temp\\WERBAAC.tmp.csv\\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\Temp\\WERC490.tmp.txtThese files may be available here:\\\\?\\C:\\ProgramData\\Microsoft\\Windows\\WER\\ReportArchive\\AppCrash_Microsoft.LockAp_196ccb5fca52dd6d6a1038fc51d341a75da856_6df23506_0b05746a-9635-4d12-ac52-1d09d6cf15c4Analysis symbol: Rechecking for solution: 0Report Id: d9240c33-70c7-4c28-a905-70c3b8a1dc6cReport Status: 268566528Hashed bucket: c9207e59cf82a3c1aeca503e7fe8a4cbCab Guid: 0Faulting application name: bad_module_info, version: 0.0.0.0, time stamp: 0x00000000Faulting module name: unknown, version: 0.0.0.0, time stamp: 0x00000000Exception code: 0x00000000Fault offset: 0x0000000000000000Faulting process id: 0x39b0Faulting application start time: 0x01d5b38674e30b7dFaulting application path: bad_module_infoFaulting module path: unknownReport Id: d9240c33-70c7-4c28-a905-70c3b8a1dc6cFaulting package full name: Microsoft.LockApp_10.0.18362.449_neutral__cw5n1h2txyewyFaulting package-relative application ID: WindowsDefaultLockScreenI have run chkdsk on all my disks (C:, D:, and E:)I ran both the standard 'chkdsk x:' command as well as the 'chkdsk \/scan \/perf x:' command (replace x: with drive letter, i.e. c:)i have run sfc \/scannowI have also run DISM \/online \/cleanup-image \/checkhealthno issues were foundas an extra step due to the windows feature involved, I also ran a scan with MBAM premium and ESET Smart Security Premium. No threats were found.I also ran MRT which reported no threats found","solutions":["editing the registry too disable the lock screen as per instructions from here :https:\/\/www.techrepublic.com\/article\/how-to-disable-the-windows-10-lock-screen\/seems to make the issue disappear. however this is only a workaround. I would like a fully functional Windows OS, not one where I have to turn off features in order for it too work properly.","Bump.... 12\/19\/2019it has been a couple of days or so, and no response..... issue still present.","the slowdown seems to have largely disappeared on it's own without me really doing anything about it. I have noticed that there was a couple of things that might have caused the issue going on, but fixing those did not fix the issue. the 1st was the UAS driver (USB attached SCSI Storage) started to misbehave and was issuing repeated device reset signals to my Seagate Expansion drive. simply restarting windows was not sufficient to solve the issue. I had to do a full system restart by performing a 'shutdown \/r \/t 0' command using the DOS prompt. UAS driver has been operating properly since the full restart. the only issue remaining is the choppy sound at logon and startup. both Nahimic and the Realtek app have received updates since my post. I have checked to see if is there is an operation making the system super busy in the background, but there doesn't appear to be anything. this is a system less than a year old, so I should not be having this type of problem. on a system that's a year and a half old, maybe... but not one that's practically still new.","issue is still occurring for me though it's severity has been greatly reduced"]},{"symptom":"Unable to run an old application, asking to switch to large fonts        I'm trying to run an old app (used in the past with windows XP) and I'm getting a message that in order for tis app to be able to run I need to switch to 1024x768 resolution which I already did and also to switch to LARGE FONTS which I can't find the way to do it. Any ideas  or suggestions on tis?***Modified title from: Large fonts***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues in running an old program on your computer. I’ll certainly help you with this issue. However, please let us know: What is the name of the program that you are trying to run?What is the complete error message that you receive? As you have mentioned that you are using an old program, it could be possible that the program is not fully compatible with Windows 10. You may want to try running the program in Compatibility mode and see if that helps. Please refer the steps mentioned in the article Make older apps or programs compatible with Windows 10. Let us know the results.  Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Windows10 activation problem        Hello all,I am having a problem with Windows Activation, which I was alerted to when I tried to hid my task bar. I have a computer that has had a Win 10 Digital signature for approximately 4 years. (free upgrade from Win 7)  Forsome unknown reason, it no longer has one that works or is recognized.This problem has arisen from a Windows10 re-install using Win 10 media creation tool. (always downloaded and installedto a USB thumbdrive with each install.Due to constant power failures and brownouts here I have had to do 15 Win Installs in the last 12 months and 3 days,As a consequence, I do not believe that I am absolutely clueless regarding the installation of Win 10but this install, using my usual Win media creation tool install USB, seemed to bedifferent.  I clicked on the\" I don't have a product key\" as usual, in the process.Also, please note that, with every install, I format my NVME SSD during theprocess, to ensure an absolutely clean install. In this case, however, this time Ifound that I had to go through the \"win +f10 ... diskpart .... list ....clean\" procedure in order to get a partition on the formatted disk that I could install Windows to.There were no problems with the install whatsoever.What I need now is to get Microsoft to give me a digital signature or tore-recognize my computer Going to \"Settings\/update and security\/activation\" gives me a red message ... Quote, We can't activate Windows onthis device as our activation servers are not available right now. Make sure you're connected to the internet andwe'll automatically try to activate Windows when the service becomesavailable. Error code 0x80072EE7 UnquoteThis message has been given to me for 5 days now.Can you tell me what I need to do now, or, how to contact Microsoft to sortthis out without using a phone (no landline or Mobile phone signal here)I really do not feel comfortable using an un-activated Windows 10.RegardsTony","solutions":["Hi,We understand your concern as you are having windows 10 activation issue after reinstalling Windows 10. We appreciate your effort in providing us a detailed information about the issue.Ideally, when you reinstall Windows 10 and sign in with the same Microsoft account that you used to attach the digital license, it should get activated.In this scenario, we would suggest you to refer the troubleshooting steps as mentioned in this article:Get help with Windows activation errors.If the issue still persists then, we would suggest you to contact our Microsoft Customer support over chat or call Global Customer Service phone numbers as per your region.Regards.Aditya RoyMicrosoft Community – Moderator","Aditya Roy,Thank youRegardsTony","Hi Karphoops,You are welcome.Hope our call\/chat support team able to fix the activation issue. Let us know if you got the help you needed by clicking‘Yes’ or ‘No’. As this will also help other people with similar issue in future. Regards,Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"in file folder view options for changing the view are greyed out        the options to change the view from large icons is greyed out","solutions":["Hi Karen,Glad to know that the issue is resolved with the steps that are suggested. We appreciate your time and effort that you have provided to get the issue fixed. Let us know if you got the help you needed by clicking‘Yes’ or ‘No’. As this will also help other people with similar issue in future. Regards,Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"win32k.sys *sometimes* causes Blue Screen of Death during shutdown of WinXP        Hello, and thank you for reading (and, hopefully, responding to) my post.I have, yes, WinXP SP2  on my PC and, sometimes (though certainly not always), a Blue Screen of Death (BSOD) appears during shutdown.On the screen is a fair amount of information that, unfortunately, I don't remember as I write this (but, if you need to know it, I can take notes the next time I see it and report back), but I DO remember that win32k.sys seems to be the file that's causing it.  (It's mentioned on the screen.)Can you please either point me to where I can get a clean replacement for that file (if, indeed, that would solve my issue) or, in the alternative, assist me in trying to stop the BSOD from re-appearing?Thank you very much,Bram Weiser","solutions":[]},{"symptom":"Bluetooth headphones issue        I have recently added Bluetooth headphones to my laptop running Windows 10. I had to add a Bluetooth USB dongle to get the  JLab headphones to pear.  I can listen to online music or YouTube videos through the headset just fine. I can hear audio from my audio and video files on my storage devices W\/VLC Player, but can't hear any audio from iTunes or from Video Pad video editor (NCH Software) with the headphones. I got the Bluetooth Headphones to use while editing video\/audio. iTunes and Video Pad audio can be heard threw the computer speakers while the Bluetooth headphones are working. When the Bluetooth Headphones are disconnected, all of the above mentioned audio sources can be heard through the speakers. I contacted the NCH software tech and got this suggestion, \"The reason why it does not play when using VideoPad and iTunes could be related to the bluetooth transmit frequency or the audio driver priority.\" What can be done to correct this issue?Thanks M Lee","solutions":["Hi, MarcLee4 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to run the troubleshooter for Bluetooth. Go to Settings - Updates & Security - Troubleshoot. Click on Bluetooth under Find and fix other problems. Follow the on-screen instructions.https:\/\/support.microsoft.com\/en-ca\/help\/402622...https:\/\/support.microsoft.com\/en-ca\/help\/15290\/...Try to update the Bluetooth drivers https:\/\/support.microsoft.com\/en-us\/help\/402844..."]},{"symptom":"HxTsr.exe without any digital signature ???? really .. an official Microsoft tool part of the Office365 suite        https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/hxtsrexe-is-the-pseudo-camelisation-expected\/fb07427e-5ad4-4f3a-bffa-31067337e13fregardless of what it is and what is its purpose i find it utterly sloppy and beyond careless that any decent size software publishing company , let alone Microsoft with its huge market share and fair share of process hollowing\/zombifying and whatnot still issues executables without any digital signature !!C:\\Program Files (x86)\\Windows Kits\\10\\bin\\10.0.18362.0\\x64>signtool verify \/pa \"C:\\Program Files\\WindowsApps\\microsoft.windowscommunicationsapps_16005.12228.20410.0_x64__8wekyb3d8bbwe\\HxTsr.exe\"File: C:\\Program Files\\WindowsApps\\microsoft.windowscommunicationsapps_16005.12228.20410.0_x64__8wekyb3d8bbwe\\HxTsr.exeIndex  Algorithm  Timestamp========================================SignTool Error: No signature found.Number of errors: 1So this is MSFT own files and those are not being signed ... is this just pure laziness,lack of care\/duty, or just on purpose ??","solutions":["regardless of what it is and what is its purpose i find it utterly sloppy and beyond careless that any decent size software publishing company , let alone Microsoft with its huge market share and fair share of process hollowing\/zombifying and whatnot still issues executables without any digital signature !!","C:\\Program Files (x86)\\Windows Kits\\10\\bin\\10.0.18362.0\\x64>signtool verify \/pa \"C:\\Program Files\\WindowsApps\\microsoft.windowscommunicationsapps_16005.12228.20410.0_x64__8wekyb3d8bbwe\\HxTsr.exe\"File: C:\\Program Files\\WindowsApps\\microsoft.windowscommunicationsapps_16005.12228.20410.0_x64__8wekyb3d8bbwe\\HxTsr.exeIndex  Algorithm  Timestamp========================================SignTool Error: No signature found.Number of errors: 1So this is MSFT own files and those are not being signed ... is this just pure laziness,lack of care\/duty, or just on purpose ?? ","What's \"pseudo-camelisation\"?","https:\/\/en.wikipedia.org\/wiki\/Camel_case","Hello, JDStefaniak,In the past, the same occurred with Windows Vista units.Cause:This problem occurs because Device Manager verifies the digital signing information by using the class GUID of the previous driver and the driver name of the current driver. Because no driver is found to match the old class GUID, Device Manager detects the driver as an unsigned driver.https:\/\/support.microsoft.com\/en-us\/help\/955557\/even-when-a-driver-is-digitally-signed-device-manager-displays-a-not-dYou can Enable or Disable Driver Verifier if or as necessary.https:\/\/www.tenforums.com\/tutorials\/5470-enable-disable-driver-verifier-windows-10-a.html","hello Smittychat,Thanks for taking the time to reply.While your are offering steps i do not believe those are relevant. Indeed you are pointing at issues with 'drivers' being digitally signed and showing as not signed:https:\/\/support.microsoft.com\/en-us\/help\/955557\/even-when-a-driver-is-digitally-signed-device-manager-displays-a-not-dWhile my problem is rather with a application file: HxTsr.exe ...not a driver; or not as far as i can tell anyways.i have ran sigverif anyways and HxTsr.exe is not showing in the list so it does not appear to be either a driver or a system file with an expected digital signature which is exactly my issue. MSFT support states this is a file that is needed for the Office365 suite to run yet it is not digitally signed... which brings me back to fileless threats through process hollowing\/zombifying.Any core applications files on such a popular OS and set of applications that is known from such a large company should be digitally signed in this era. Any less and it is just plain carelessness and disregard for the end users that we are.","There are drivers in an executable file. This file usually installs drivers for you.Explanation of Hxtsr.exe\"The genuine  file is a software component of Microsoft Office 2013 by Microsoft Corporation.\"HxTsr.exe\" is a Microsoft compressed executable file called \"Microsoft Outlook Communications.\" It establishes and maintains contact between the Outlook 2013 or 2016 app from the Windows Store on the user's computer and Microsoft's Outlook.com, Outlook.office365.com, or Exchange e-mail and calendar websites. \"","Hi Smittychat,Again thanking you for your time here genuinely.I am simply aghast that MSFT is still delivering official files not signed.it has become next to trivial to hollow or zombify a running process these days ... the basic foundation of ensuring integrity of a file is through digitally signing it ... i do not really care about what it does and how it is used... MSFT says they need it, fine they can throw that file in their build and installers ... but since it is official, sign the <Removed Profanity> thing please.So i really want to know from MSFT themselves, why they do not bother digitally their official files that is all. unless proven otherwise by them i will consider this behavior sloppy and lazy ...bordering on reckless.do they really expect the common John Doe lambda user to even comprehend the implication of a legit MSFT process running in memory having been hollowed\/zombified .... do they really expect that same Lambda John Doe to understand that a non-digitally signed file is not to be trusted ...if yes then their softwares are not ready for mass consumption in a McDonald style and hackers and even script-kiddies have already won their wars.without that digital signature even the softwares that are meant to watch those files (like the build system file checker) can not properly do their job since there are no \"reference of truth\" that can be looked up to know if a file has been tampered with or not.I again genuinely appreciate you taking the time to respond, but i do not want you to waste your time either so unless you can answer the above or get someone that can answer the above do not reply any further.MSFT Support's silence will be just as convincing of the Company's complacence in racking in licence fees and optimizing that line of business while cutting development's cost and corners.  ","Not that you actually want an answer but another reason is because of incorrect logic when the Authenticode flag in the catalog file of the driver is checked.No need to reply. I will unsubscribe from your thread."]},{"symptom":"Password problems        I am new to Windows 10.  Now it is asking me to change my password which I tried several times this morning but it would not take my new password.  I tried the last three passwords I've had on my Windows 7 program.  So I don't what the heck to do.  Help if you can please.","solutions":["Windows 10 had an Update On 1\/8\/2020 that cleared Everbody's password's Helpful! And Extremely Unsecure."]},{"symptom":"Waiting for a reply        Cannot connect, will not even send a code to my phone. I read where the last question was answered in six minutes but it's been well over an hour. I need help. Thanks","solutions":["Hello (Jeffrey), I'm Didi, an independent advisor. Can you please give us more details about your problem : for what question are you waiting a reply and for what are you waiting for a phone code ?Regards, Didi","Didi, we can't get anywhere on the computer. It asks for our pin but says it's incorrect. Try to reset it and it says they will send a code to phone but never got code. The computer itself hasn't been totally set up so we can't get to settings etc.","Hi (Jeffrey), Please follow the methods given by Greg Carmack on this thread, scroll down to see his answer :https:\/\/answers.microsoft.com\/en-us\/windows\/for... Regards, Didi"]},{"symptom":"Print spooler needs to be reset everytime I turn on computer        I am using a Lenovo T450s running a dual boot of Ubuntu and Windows 1909. I just got a new printer, the HP Envy 5055. I setup the computer using HP's app on my phone and it worked great - successfully printed an item off my phone with no problems. Then I installed the HP Smart app on my computer. As soon as my computer was connected to the printer, it started printing out about one page per minute, a single page with a single letter \"D\" on the top left corner. During a lot of time on the phone with HP, we tried several things:1. Rebooting computer, printer2. Resetting up the printer manually (no apps)3. Resetting my wifi password (in case someone else was trying to print on my network)3. Updating my windows version (previously I was running 1809)4. Uninstalling the HP Smart app on my computer and deleting the printer and driver from my devices\/driversNone of those worked. We isolated the problem down to this: My computer was the device sending this print command. (I have since closed my HP case, since the new printer is working great - its my computer that's mucking things up.)I followed the steps in this community question:1. Running the troubleshooter2. Deleting files in the folder (including hidden files)Those didn't do anything, but I did restart my print spooler:1. Once I restarted the print spooler, it worked fine - no more printing random \"D\"s, and I was able to print other things normally from my computer.2. If I restarted the computer, the problem reverted and I had to \"restart\" the spooler again.So my question is, I don't want to have to restart my print spooler every time I power cycle my computer. How do I get this to stop happening?","solutions":["Hi Jackie. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Rather than spending too much more time fiddling I'd simply Clean Install the printer which always works, lasts longer and actually saves time:1) Power up the printer, if wired unplug it's USB cable from PC. 2) Go to Settings>Apps>Apps and Features to find and Uninstall any printer software.3) Use one of these methods to remove all of the old printer drivers: https:\/\/www.tenforums.com\/tutorials\/101274-unin...https:\/\/helpdeskgeek.com\/how-to\/remove-uninstal...4) Now type Control Panel in Start Search, open CP, choose Icon View. In Control Panel open Devices and Printers, right click printer to delete Printer and any scanner or fax of the same name. Restart PC.5) Go to the HP Support Downloads webpage here: http:\/\/support.hp.com\/us-en\/drivers to download and install the latest full software package. Now is also the time to check for any newer printer firmware to install which matters a lot.6) Extract Printer software, right click Setup file to Run as Administrator. Follow the setup screens closely as you install the software. For USB it should prompt when to plug in the printer.Older software may need to be installed in Compatibility Mode to run correctly: https:\/\/www.groovypost.com\/howto\/run-old-softwa... If you have further problems reply back with results of each step. Once it's installed and you've run a test print, then scanned it to see that it opens on the desktop, open the Printer software and go into its Settings to set the scan-to file location you prefer, also the email app you want opened for Scan to Email, if applicable.I hope this helps. Feel free to ask back any questions and let us know how it goes. If you will wait to rate my post until we are done, I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows Language vs Office Spellcheck        Hi there,I have a very frustrating language\/spellcheck problem with Windows 10. Office 365 (Outlook in this example) is arbitrarily using a language I don't have installed (English US) to check some, but not all, spelling.Outlook is set to spell check in English (New Zealand):But it's not, it's checking some of the content in English US - in this example \"Prioritized\" should be marked as misspelled and \"Prioritised\" should be considered accurate. The obvious other error here is that, regardless of the language selected, both instances of \"Prioritised\" should be treated the same and they are not:There is only one language installed in Windows and that is not English (US):All other language settings throughout the OS reflect the \"English (New Zealand)\" setting. There should be no way for anything to even use another language.I've always thought (since Windows 95 really) that language settings in Windows have been a nightmare, it really shouldn't be as complex and frustrating as it is.Question 1: How is this happening and how do I fix it permanently?Question 2: How do I expunge \"English (US)\" from Windows 10 so that it can never be used and will never come back? Ever.Thanks.","solutions":[]},{"symptom":"Named Pipe Service Trigger Provider - Restore        Heyo,I am having issues with my computer freezing intermittently for a few seconds, and I have seen a lot of possible fixes online. The issue is, I have exhausted every fix I have come across, so I decided to look deeper into my computer files to find the source of the problem.I came across this [npsvctrig - Named pipe service trigger provider] with the status \"severe\" and I found out that this service aims to trigger certain programs and responses, and when it is unable to do so it reboots, causing either a crash, cpu reboot, and in some cases, a graphics card reboot, which will effect the display being used.The issue I am having now is finding a trustworthy source to download from in order to restore the npsvctrig service. The one I found is: http:\/\/batcmd.com\/windows\/10\/services\/npsvctrig\/. I'm not sure if this website is trustworthy, and I do not wish to find out.If anyone could tell me if they have used this site before without issue, or if somebody has another link I could use, it would be greatly appreciated.Thanks!Andrew","solutions":[]},{"symptom":"Setting different times for \"sleep mode\" and \"lockout\" in Windows 10        Is there a way to set different times for \"sleep mode\" and \"lockout\"?  Just updated to Windows 10 (from Windows 7).   In Windows 7, when the computer went to \"sleep\" I did not have to reenter my password to get back on the computer.  But, that's what I am having to do with Windows 10.  I went into settings...it would allow me to change the settings, but it would not allow me to put in different settings.  Thanks.","solutions":["Hi Donald. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.To change the setting to \"Require Sign In when you've been away from PC\" to Never, go to Settings > Accounts > Sign in Options. You can set a Pin in the same place.To skip the sign-in screen altogether see here: https:\/\/www.tekrevue.com\/tip\/skip-windows-10-lo...Go over how to set your Power Plan settings: https:\/\/www.tenforums.com\/tutorials\/2843-change...You can even create a Custom Power Plan in WIndows 10: https:\/\/www.tenforums.com\/tutorials\/43655-creat...If you are blocked from making any Settings please report back the exact error or message you're getting. This can be an over-eager antivirus or account corruption which often results from Upgrade installs.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thanks for your reply....I do not want to set it to Never, nor do I want to do away with the sign in screen.  I am really not very computer savvy at ALL.  In windows 7, the computer went to sleep, but when I sat back down at the computer, all I had to do was wiggle the mouse, and it opened right back up...it was not locked, and I did not have to put in password again.  That's what I want it to do.I found the place to change the settings, but it will not allow me to put in two different times, although the default setting IS two different times.  If I change one setting, the other automatically changes to that.  I want to be able to set the sleep mode for say somewhere between 15 to 30 minutes, but then to set the lock to maybe several hours, or maybe Never.  Is that possible?  And...remember...I'm not really computer savvy, but can usually figure out simple instructions.  Thanks for your help!","Hi Donald - This is why I gave you illustrated tutorials in the links. The one for your Power Plans explains all of the settings so you can compare yours:https:\/\/www.tenforums.com\/tutorials\/2843-change...I would set it to defaults: 20 minutes timeout for Display, followed by Sleep at 30 minutes, then in Advanced Settings set Hibernate between 1-2 hours so if you don't return it doesn't wear down the RAM holding the session in memory, but writes the RAM to the hard drive and shuts down."]},{"symptom":"Reactivating windows after hardware change gives multiple device options        Hi. I recently did some hardware change to my computer, and did a clean install of windows 10. When i do the troubleshooting for activation and select the hardware change option, it asks me to select the device im currently using. It gives me two options, one is the old system, and the second is a device i dont know where came from. Its not the computer name of my new device, and it is not in my list of devices in my account page on microsoft. Has anyone experienced this before? Im not too sure what i should do. ","solutions":["The procedure is here: https:\/\/support.microsoft.com\/en-us\/help\/20530\/...Are you trying to transfer a purely retail license; if upgraded was it from a retail license? If so contact Microsoft Support by one of these phone numbers:https:\/\/support.microsoft.com\/en-us\/help\/405170...You can also go here: https:\/\/partner.support.services.microsoft.com\/... choose the link for Browser help, interact briefly about your exact problem, keep replying agent until it connects with an agent."]},{"symptom":"Why can I not create any folder in win 10 on my desktop????        why can io not create any folder in win 10 on my desktop????","solutions":["Hi TairaSt and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.1. You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...2. Take Ownership of a Folder in Windows 10 Using File Explorer https:\/\/www.laptopmag.com\/articles\/take-ownersh...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","HiRight-click the Desktop icon on the file explore.Go to Security à Select the log-in user name.Tick Full control in the section of Permissions for SYSTEM.Click OK","Did you right click on the desktop then New, Folder?","of course I have been working in windows since 1985","It worked for me and I also found it in File Explorer."]},{"symptom":"Cortona        Hi,I am already 14 and that is passed my birthday since November of 2019.So, cortona should allow me to use it and sigin in with my microsoft account. But it still says sorry, you can't you it since minor.","solutions":["Hi, Try to remove the account from Win 10 then re-adding it, Or you can go to Microsoft web, then change the age.","What do you mean? Change my age to what? I tried to sigin to my account on other pc's.","I mean change the birth date so you can use Cortana. You can also try these, \"Troubleshooting family safety features in Windows 10\". Link: https:\/\/answers.microsoft.com\/en-us\/windows\/for... \"Fix family features after Windows 10 upgrade\" Link: https:\/\/support.microsoft.com\/en-us\/help\/10551\/..."]},{"symptom":"Please help me turn off two-step verification        I followed all of the Microsoft instructions to 'turn off two-step verification,' yet when I get to the page to turn it off, the option to turn it off is not there! The only option is to turn the verification on, which somehow already happened and I have no idea how or why. I could have inadvertently thought I was clicking on something else when this happened a couple of months ago, not sure.I am sick of getting a screen that requires me to enter the last 4 of my home phone number, then get an automated call with a code that I have to enter just to delete my search or browsing history! That should not happen to anyone that only wants to delete the unnecessary ****. Clearing by disk cleanup does not clear half of the stuff - you have to sign in to Microsoft, then get surprised by a bunch of hidden ad links from all your pages you visited, click on delete the search or browsing to get rid of it. This never happened in earlier Windows versions. I hate Edge, and am not sure if it is just Edge, or what.Does anyone know how to turn off two step verification when the option to turn it off does not even show on the screen when I follow all of the instructions to turn it off? I even clicked on the 'turn on two-step verification' link, hoping there would be an option, but that was just to continue with getting it, which I already mysteriously have. This is stupid, frustrating, and annoying. Thanks!","solutions":["Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.I found an existing article that might help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/answers.microsoft.com\/en-us\/windowslive...I hope this helps resolve your concern! Please let me know if you have further questions."]}]}