{"windows":[{"symptom":"Windows 10 1903 Update 2019-12 Error 0x800f0831        My PC tells me it has successfully installed all previous updates.  This one will not install and I have tried several times.  What do I do?  I am not a confident tech person!","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command promptDISM \/Online \/Cleanup-Image \/RestoreHealthRun these commands on the command prompt to restart windows update servicesnet stop bitsnet stop cryptsvcnet stop wuauservnet stop msiserverRen C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.old net start bitsnet start cryptsvcnet start wuauservnet start msiserverAfter successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartThis should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","When I said I am not a confident tech person I mean it.  That answer is too daunting and if I go wrong I do not know what I would do.  Is there a different answer?  Simple!Thank you."]},{"symptom":"Windows 10 installation not allowing network connection        So i have a computer that has had a 1 tb hdd hardrive for years, but recently i have upgraded to an ssd and wanted to install windows 10 on my ssd, while still keeping my hdd as extra storage. So i plugged in my windows 10 usb installation usb drive and booted off of that. While in the installation process I used diskpart in command prompt to conpletely clean my hdd, which had windows 10 installed on it. I then proceeded with the dowbload for the ssd and finally got to the setup screens and everything was going well until i got onto the network screen, i sat there for about 30 minutes and nothing popped up. I have an ethernet connection with my router and the network was working fine on my old instance of Windows 10, but i ended up pressing skip this step, thinking that i could do it later. Next was supposed to be the microsoft account login, but i guess because of no internet connection I couldn't login and was told to put in my name. I put in my password and finished the setup but was brought to my desktop with no internet connection and no access to my microsoft account. I have tried many different ways to get my network to connect, but nothing has worked yet. I've even booted back up off of the Windows 10 usb and wiped my ssd, thinking that I could just go back to Windows 10 on my hdd. I went through the setup until the network screen and was left disconnected on my hdd instance of Windows 10. I cannot figure out whats happening and have been trying to fix ny computer for days. Whenever I do the network troubleshoot it says that Windows did not detect a properly installed network adapter. My specs on my computer are an Intel 17 9700k, an NVidia GTX 1060 6gb, 16 gigs of ddr4 ram, and of course my 1tb hdd and 1tb ssd.","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Windows 10 comes with a great many drivers built-in to the install file - and in the majority of cases will identify and install your network card driver automatically. However it sounds like, for whatever reason, it hasn't been able to identify your network driver in this case. If you were to look in Device Manager (right-click START, choose Device Manager) you might find you have one or more \"unknown\" devices listed - one of which will likely be your network device.There are a couple of options: 1. If the computer is a custom-build gaming type machine you might have some original installation CDs - if you have one for your motherboard it will contain drivers for your network device.2. If you know the make\/model of your mainboard and you can use a different computer to download the required drivers to a USB device and then install them on the problem PC.3. Get a USB plug-in network adapter - generally these either come with a built-in driver so work automatically or will have their own driver CD you'd need to install. that would get you online. Once you are online Window will likely be able to download the drivers for your original network device! Regards, David","Thank you for your advice, I installed my motherboards network driver and everything worked. Thank You!","You're welcome! Let us know if there's anything else. If you don't have any more questions, feel free to choose a rating. Thanks!"]},{"symptom":"Update to Windows 10 version 1903 stuck at 48%        Hi I have a customer's Acer Aspire E1-572G laptop that crashed overnight doing the 1903 update. So I took it back to try to do it for her since she needs the laptop for work.This is a standalone Workgroup laptop and not connected to a domain.I have been trying for days to upgrade this laptop to Windows to version 1903.The update downloads to 100% and then the laptop reboots to install 1903.Nothing external is plugged in.It consistently freezes at 48%.There is a single C partition so nothing out of the ordinary.The spinning circle stops.I have left it alone overnight but nothing changes.I have used the Windows 10 update troubleshooter.I have uninstalled all third party apps other than Office 2016.I have done a disk cleanup to clear out left over filesCurrently it is on 1803 so has missed the 1809 upgrade.I have tried downloading the update through the update option as well as using the media creation tool.However with a USB stick plugged in I get the not able to upgrade error message because an external drive is plugged in!I don't want to do a clean install because I don't have the reg key for my Office 2016. (Jellybean can't find the key).Anyone else with this issue and managed to fix it please?","solutions":["Hi hongkongpom The most successful method to get the 1903 upgrade is to use the Media Creation Tool to create an ISO, not a USB driveThen when the ISO file completes downloading Disconnect from the Internet Temporarily disable any 3rd party Anti-virus you may have installed Then in Windows File Explorer, double click the ISO and then run Setup.exe to begin the upgrade . . .","Watch the blow video and follow the steps. In this video I have used Media Creation Tool to install 1903 update:https:\/\/www.youtube.com\/watch?v=IaGM7UmpBYYIf it is still getting stuck I am going to upload a new video. I am working on it so by the time you will reach that point my video will be ready so you can watch.Thanks","Hi,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.We would like to see the Installation log to check what caused the update to fail\/stuck\/rollback.Share Setuperr.log and Setupact.log named files from C:\\$Windows.~BT\\Sources\\Rollback\\ and C:\\$Windows.~BT\\Sources\\PantherYou can open the folder by typing the path in Run or showing hidden files and viewing through explorer.Use Onedrive\/Google Drive\/Mediafire to share the files and drop the links in the next reply.","http:\/\/s000.tinyupload.com\/index.php?file_id=85060494741417177849https:\/\/www.mediafire.com\/file\/ibfdyncpas443hp\/setupact2.txt\/filehttp:\/\/s000.tinyupload.com\/index.php?file_id=00947298486935553894","Please read my question I have used Media Creation tool thank you","Hello I have uninstalled Avast but that has never caused problems with previous upgrades.","Hi, Looks like a driver migration is preventing as the error code is 1900101. Please share the following file: C \\$Windows.~bt\\Sources\\Rollback\\setupapi\\setupapi.dev.log","Thank you for your helphttp:\/\/s000.tinyupload.com\/index.php?file_id=76002751555731382652","I have removed all third party apps bar Microsoft Office and my Avast anti-virus.I am using a 240GB SSD which shows 61GB of free space.I tried cloning this drive to another 240GB drive and had the same problem so it's not the drive.","I am having the same problem with my ASUS B-360-H, i5 8600k.It stops every time at the 48% mark. Uhhhh"]},{"symptom":"connecting 2 win10 pc's over internet for file access        I know this is simple for some of you however, I have been getting confused by watching youtube videos on how to do this.I have two Windows 10 PC's - One desktop at work, and my laptop I use on the road. I want to have the ability to connect to my desktop from my laptop and retrieve any of my files needed using theinternet.I don't want to put \"everything\" on OneDrive which I already know I can use, I just want to remotely access my desktop from anywhere I at.Most of the info on the internet is fairly vague or videos poorly done. Most of which I can understand the Narrator (language bearier)or the video is of such poor quality I can't see what their doing. Thanks so much,Pete","solutions":["Hi Pete, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.On your work desktop, you'll need to set up the ability to allow remote connections.You can do this through Start > Settings > System > Remote Desktop, and turn on Enable Remote Desktop.There are instructions here on \"How to connect to this PC\". On your laptop, you can open Remote Desktop Connections to connect. Source: https:\/\/support.microsoft.com\/en-ca\/help\/402837... If you are using the internet, the difficulty will be making sure you have the IP address of your work desktop, and that if it changes, you note the new address for making these remote connections. You also need to consider any firewalls that may block the connections, and encrypting the connection if you are working with sensitive data.There are some third-party software options that make remote access a bit easier since they are an intermediary that connect to both devices, for example TeamViewer which offers a free version for personal use:https:\/\/www.teamviewer.com\/en\/credentials\/free-...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","i tired your instructions and it work great however, I didn't want to take over the desktop computer, I only want to access files within a folder so I could transfer files back and forth. I worry that if I use remote desktop, then if someone is using the desktop, this would impact them as well during a remote sessionPete","Hi Pete, Thanks for this extra information. The file sharing protocol used for network file sharing (SMB) is highly insecure and not recommended for over-the-internet use without encryption. Some internet service providers block this port as it can be exploited to spread malware. Business typically use a secure Virtual Private Network (VPN) connection to share files over the internet.I would suggest that if you or someone at your work does not have the expertise to set this up, that you explore using a service like OneDrive to put this folder on, and the files will then be available from wherever you have an internet connection, and in a secure manner. Is there something specific you do not like about OneDrive? There is a desktop app to allow the files to sync to the local machine, and it is also accessible over a website interface.-Ashton","Ashton,Initially that is what I was going to do, use OneDrive however, then I found out that I could not save and use QuickBooks file to a virtual drive so that kind of messed things up for my plan.In the office, we just plug out pc's into the same router and make the connection and no problems however, if I want to access my files (specifically quickbooks) while on the road, it's a problem. So I checked with quickbooks and they suggest QuickBooks online, which is their web based solution but, I already own and just upgraded to latest version. Also, I didn't want to be dependant on a life long subscription to quickbooks just to access my financial information. The other issue I have is sync on OneDrive - if I setup my desktop to use OneDrive under my MS account, it sync's everything in my OneDrive folder (as it should) however, if I log into my MS account with my laptop on the road, it also sync's everything in the local OneDrive folder on the laptop.  Since the desktop has to be on in order for me to access files remotely, I worry that making changes on the laptop with trickle over to the desktop prematurely. This might be a problem but, I haven't tried it yet. Pete","Hi Pete, Thanks for this extra information. Yes, OneDrive will sync most folders unless you exclude them manually. This article describes the process on how to select the folders:https:\/\/support.office.com\/en-us\/article\/choose... I am not sure on QuickBooks itself (and I did search around and find that there is trouble using it on cloud services such as OneDrive) but I am out of ideas on this one - hopefully another expert will chime in with some other suggestions!Best wishes, -Ashton"]},{"symptom":"Games        How do I get Premier Solitaire?","solutions":["Hi Marcella. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.You can get a free week of Premium Microsoft Solitaire collection to see if that is what you want. Go here:https:\/\/blogs.windows.com\/windowsexperience\/201...Otherwise Premier Solitaire is a wooden solitaire board game here: https:\/\/www.barnesandnoble.com\/w\/toys-games-pre...https:\/\/www.amazon.com\/New-Entertainment-1064-S...Was there some other Solitaire game you meant instead? The popular Windows 7 games are still available for free download here: https:\/\/winaero.com\/download.php?view.1836I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Tons of BSODs        I have been getting lots of random BSODs for quite a while now. They are not always the same exception. I have created a compressed folder of the minidumps I found and was hoping for some help.Here is the link to the OneDrive that contains these minidumps.https:\/\/1drv.ms\/u\/s!AiqaycZ9KqUcoDZMQnvY6LVKLTeX?e=ZROphS","solutions":["Hello TommyPham7! My name is Marco, I am an Independent Advisor. I will do my best to help you.Here are the 2 errors mentioned in the DUMP files. SYSTEM_SERVICE_EXCEPTION (fltmgr.sys) And MEMORY_MANAGEMENT Which suggests that your memory is causing problems. It can be as much hardware as software.First, scan for malware, it can be the cause of these frequent BSODs. Here are 2 reliable and free antimalware.AdwCleaner : https:\/\/www.malwarebytes.com\/adwcleaner\/ Malwarebytes : https:\/\/malwarebytes.com\/ If nothing has changed ... try these basic steps. 1] Run Windows Update Since the source of this fltmgr.sys file is Microsoft; you might want to run Windows Update and see if it resolves the issue.2] Run sfc\/scannow Now, press WINKEY + X button combo or right-click on the Start button and click onCommand Prompt (Admin) or just search for cmd in the Cortana search box, right click on the Command Prompt icon and click onRun as Administrator. Click on Yes for the UAC or User Account Control prompt that you get. Then, the Command Prompt window will finally be open.After that, type in the following command: sfc \/scannow And then hit Enter. Let it scan the whole drive for any errors and then Reboot your computer to check if it has fixed the Blue Screen of Death Error.3] Checking hardware for physical issues Sometimes, faulty hardware can also result in the software driver not working properly. We would recommend checking the internal components of the CPU for any issues. These issues are not only caused when the device encounters physical damage but can also be caused due to voltage fluctuations and short circuits. You may also want to run ChkDsk. You could run a command like the following to check and repair disk errors on your C drive:chkdsk c: \/f \/r 4] Run the Windows Memory Diagnostic Tool. Click on Start, type in mdsched.exe and allow the tool to check your computer memory (RAM) for problems.5] Update your BIOS and drivers. BIOS updates can be found on your manufacturer’s website, and driver updates can either be done manually through Device Manager (use Start Search to find it)6] If on a laptop, change power settings to High Performance. 7] If this problem occurs shortly after installing a new program, remove that program right away.Give me news. ;-) Marco _________________________________________________ Note: Il y a des liens vers des sites Web autres que Microsoft. Les pages semblent fournir des informations précises et sûres. Méfiez-vous des annonces sur les sites susceptibles de faire la publicité de produits fréquemment classés comme PUP (produits potentiellement indésirables). Avant de décider de le télécharger et de l’installer, recherchez soigneusement tous les produits annoncés sur les sites.","Hi Marco! Thanks for the quick response.Running a system scan using BitDefender resulted in nothing being found.=============================Updating windows resulted in one optional feature.=============================sfc \/scannow resulted in some files not being able to be fixed after the verification process. I've uploaded that log file at https:\/\/1drv.ms\/u\/s!AiqaycZ9KqUcoDdZ-l_LZmJ8of6V=============================Regarding the physical issues, I did try to re-set my RAM sticks. When I placed it in, there was a slight sound that sounds like sand grinding,=============================There was also a BIOS update so I updated that as well.=============================Running the memory diagnostic tool resulted in no problems being found.=============================No issues with chkdsk c: \/f \/r=============================I'll update you if I get more BSODs after running all of these. Perhaps the log from sfc \/scannow will help with resolving this issue.","Ok, but you scanned with bitdefender, but also scan with the 2 that I mentioned"]},{"symptom":"Ghost System Restore Points being reported - Want to delete them        On Windows 7, 64 bitMy  \"System Properties\/System Restore\"  is reporting 103 ghost restore points dating all the way back to October 2013.  On multiple occasions I have tried deleting ALL these using different methods suggested on the internet including Disk Cleanup, and turning off system restore under  \"System Properties\/Configure\".  Additionally, I occasionally use BCWIPE to wipe the disk free space, file slacks and MFT records. This software checks for the presence of restore files and if it finds one it suggests that you allow it to delete that file before proceeding. And I always agree to deleting it.I also use a cluster level search software called Directory Snoop to check for evidence of old restore points and don't really see anything.  I am a bit suspicious that the \"ghosts\" might be reflected in one of the *.log, *.catalog, or *.dat files in the System Volume Information.I am including screenshots that may be of help.  I would really appreciate suggestions that would allow me to get rid of these pesky entries.Ted Smith","solutions":["Best bet,R.click on Disk Cleanup\/run as Administrator\/check all the boxes,then locate: More OptionsTab\/locate Cleanup restore button,click on it,let it all run.This deletes all restore points but last good restore.."]},{"symptom":"Problems with my PC        I recently had problems with my Windows 10 PC. When I opened Edge, the picture was unstable and flickers. With Chrome, a panel intermittently opens on the right side of the web page showing the elements etc. of the page. When I opened a spreadsheet in Libreoffice, a dialogue box comes up entitled Group. This box cannot be closed and the only way to close the spreadsheet is with task master. After trying several things to fix these problems, I decided to delete both hard drives and clean them with DBAN. I then reinstalled Windows 10 on the cleaned drive but the same problems are still in evidence. Can anyone tell me how to fix these problems?","solutions":["Alright, in that case I believe there might be some issue with the F12 key of your keyboard.Please check the F12 key physically and try to clean it. Then open the programs."]},{"symptom":"File Explorer Windows 10          File explorer and documents won't open from the start or taskbar but if I switch users it works fine.  When clicking on file explorer or documents in Start,   it will show in the taskbar but won't open on desktop.  Again, if I switch users everything is fine.   ","solutions":["Any 3rd party anti virus, security, cleanup programs ever installed on the computer?","Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.Your profile could be corrupted or damaged. What I can suggest is to run System File Checker. This will ensure that corrupted system files will be replaced with good ones. You can check this link for instructions:https:\/\/support.microsoft.com\/en-ph\/help\/402652...I hope this helps with your concern! Please let me know if you have further questions."]},{"symptom":"Automatic repair loop        I accidentally pressed restart computer so i got annoyed so i just held in the button on the computer to turn it off. The next morning the computer wont start its just stuck in automatic repair loop i have tried everything in there and nothing works. I cant even clear the entire disk and get a fresh windows it wont let me and casts me back into the loop. When i want to access bios i cant because the keyboard doesnt work until the loop has already started.","solutions":[]},{"symptom":"Windows is blocking a website        I have both a PC and a Surface Pro with Windows 10 but cannot view a specific website on just my PC.  How can I get Windows 10 to allow this website on my PC?","solutions":["Hello JayWhite4, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemWhich web browser are you using to access the website? is it Edge or chrome, firefox...?Do you receive an error when accessing the website? Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolvedCheers! Farah","I am using Edge.  Here is the error I'm getting; 494 ERRORThe request could not be satisfied. Bad request. We can't connect to the server for this app or website at this time. There might be too much traffic or a configuration error. Try again later, or contact the app or website owner.If you provide content to customers through CloudFront, you can find steps to troubleshoot and help prevent this error by reviewing the CloudFront documentation.Generated by cloudfront (CloudFront)Request ID: K72UXfONZpSmdhFHQBaohj93-paEADytZUO5a1WaDc-EKO-94Pytyw==","Hello JayWhite4, this could be an issue in the cache, have you tried clearing the cache and cookies in your browser?- Open the settings menu \"three dots up right\" - Choose Privacy & Security - Under clear browsing history, check \"choose what to clear\" - Check the box for cookies & saved website data After it finishes, close Edge and reopen it again. Let me know if it helps. Cheers! Farah","YES!  That did the trick.  Gotta remember this for future reference.  Thank you so much.  😍","no worries mate, I'm glad it helped you Cheers! Farah"]},{"symptom":"factory reset        hello so a while back I couldn't use the \"reset my pc\" option on my windows tablet until I upgraded to windows 1803 then something went very wrong and almost everything was not functioning the only thing that still worked was the system troubleshooting menu for when your computer doesn't boot right I tried the reset option again and it worked only that one time, on the other tablet lots of things are messed up and I can't reset it at all what methods do you guys suggest? do you think I should delete certain things from the system? if so then what files? thanks","solutions":[]},{"symptom":"Virtual Primal Scream in Total Reality!        I'm a senior citizen.  I've worked with Microsoft through the days of 286, 386, 486 that used boxes of disks that took forever and a day to manually load the programs onto the PC.  I've loaded MS-DOS successfully.  I've learned how to manually construct pages using HTML 4.  I've worked in systems applications and development from the User, not Developer, side, so it think I have a relatively decent handle on what seems user-friendly or not.I HATE WINDOWS 10.  I even used it with my employment before retiring several years ago, and it was a pleasure leaving that behind.  I've avoided upgrading my home devices as long as I could but here we are now.  Windows 10 has invaded my home like a plague of unwanted locusts and I couldn't be more frustrated than I am right now.I don't have a degree in Computer Sciences or decryption.  I didn't grow up in Silicon Valley.  I don't have an army of grandkids on Skype nor a SMET (Subject Matter Expert Team) hiding in my closet.  It's just me.  Little old willing-to-try-it-a-few-times-because-it- can't-be-impossible-to-work-software-since-others-are-doing-it-already me.  But I have met my match.  I am completely discouraged and frustrated and wish I never upgraded from Windows 7.  And unfortunately the little mini laptop I purchased came loaded with Windows 10.  That in itself is a whole other tale of woe that offers no relief.  I'm stuck now and see no clear options other than this non-productive rant.  Sorry for taking up so much space.  Admins, feel free to delete if it's inappropriate for this forum.  In closing, I'll just reiterate......I HATE WINDOWS 10.Thank you for your attention and I wish you all good fortune and patience in the coming year.","solutions":[]},{"symptom":"When creating another account, its corrupted        TitleIt also doesnt give me the settings when you create an account (for example cortana)No idea which topic to selectnot resetting my pc btw so give me other solutions lol","solutions":[]},{"symptom":"Computer freezes in odd way        Okey here is what's happeningI turn on the PC everything normally,go google something and after 10-15minutes its freezes...i can move mouse i can click on icon in the bottom of the screen but they wont open,i can click on new page but it wont open...then i turned it off with power on\/off button and turn it on again,go check if there is some viruses and again after 10-15minutes its freezes in same way couldnt even check for viruses,again i can click on icons but everything same,sometimes spinning mouse wheel appear but it last forever...then i resterted it again go try to google whats happening and then it stands for longer and i left it then idle for 5 minutes and its freezes i dont know whats happening.......","solutions":["Hi, RastkoDincic My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps: Press the Start key and type the word CMD or Powershell, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanu p-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/929833...","gonna try now if it works up","no it doesnt,i closed cmd restarted pc ran up counter strike game and when it found  match and was loading it up it freezed every time,i told you  already some  times when i google but now when i was doing this i was googling and listening to a music and  it wasnt freezed but first time when secound command was loading i  was watching tv for a while and it frezeed then i repeat process but this time was all the time googling and listening to a music and it didnt freez when my father playin world of tanks it works normal i really dont knoe whats going on...."]},{"symptom":"putting PC on either hibernate or sleep shuts down PC        When I place the PC on either hibernate or sleep, after 10 -15 minute or so, the PC becomes inactive and the monitor is black.  The only way I can get the PC working again is to press the on\/off button and the PC shuts down and is off.  When I start it up again a page pops up and states\"Windows did not shut down successfully, etc. and then shows the following message\\:Safe ModeSafe Mode with NetworkingSafe Mode with Command PromptStart Windows NormallyI have been choosing Start Windows Normally and it takes forever for the PC to start.How can this be fixed?","solutions":["Have a check of your Mouse \/ Keyboard \/ @ Human Interface Devices Power Management settings in the Device Manager.Go to Start Orb and type in device manager and click the Enter Key.Scroll down to Keyboard and expand the column.Right click on the Keyboard and select properties.If it has a Power Management Plan set it to : allow the device to wake the computer.Do the same for the Mouse.","The “sleep” or “hibernate” functions that  run by default in Windows 7 can prove to be problematic.  I advise my clients to restrict hibernate\/sleep functions for usage only in absolutely needed circumstances.  It is commonly problematic and seldom ever fixed.  Myriads of causes you can spend weeks trying to find.  Just not worth it.FIRST: If you are running a desktop PC, shut down all sleep and hibernate functions.  They are of no value and will cause you problems eventually.  But, for some notebook PCs, where the computer is used in a truly mobile sense, where house power is not always available, you need these functions to extend battery life.Background:  The concept of sleep\/hibernate was designed to extend battery life.  If you are not running on a battery or never do, the very idea is quite useless.  If you are doing it because your computer takes a long time to startup, fix that problem.  Under normal circumstances if you are finished using the computer and do not plan to use it again for at least several hours, shut it down.  Leaving it running continuously is a sure way to shorten your computer’s lifeYou can change how these functions behave here:Start globeType Power options in the text box that pops upDesktop computers:Set all hibernate\/sleep functions to NEVERNotebook computers:Again, set all hibernate\/sleep functions to NEVER, EXCEPT when it is battery powered.In the Power Options window, Click Change Power SettingsChange Advanced Power SettingsSet hard disk to turn off after 20 minutes of non-useUnder Sleep, several settings: Sleep After NEVER Hybrid after: Never"]},{"symptom":"cyclic redundancy check error while using external hard disl windows 7        I am using  a  external hard  disk ; the hard disk when plugged in gives the error 'data error cyclic redundancy  check ; how to address this issue My computer works on wndows 7with regardsCapt S Narayanan","solutions":["A CRC means that the disk is badly flawed. You need to replace it.","IF, you wish to continue to use the computer and Windows 7, you have two choices:1. Have a local shop replace the drive and re-install windows 7 for you2. Do it yourself.The Do it yourself option is actually a better one and much more likely to produce a good result. Cost is about $100.  If you wish to do this, I will offer you a detailed step by step procedure that i use in support of my clients."]},{"symptom":"Microsoft account        So one of my family members gave me there microsoft account so i can download something but later on i turn off my computer turn it back on later and everything has changed the wallpaper of some random guy the settings app is like the dark mode function from iphone (dont know the name for pc) i tried signing back into my other account and i did all of my details was like before but none of the personalised stuff change for example wallpaper i also tried reatartiing but that never helped if anyone knows how to fix it please can you help thankyou ","solutions":["Why did you use someone else's account? When you sign into their account then you get what they have set up on their computers.Why don't you have your own account?","i needed an app they had it was a family member.i do have my own account i just needed to sign in to there account to get the things i needed i tried signing in back to my normal one but none of the personalised stuff has changed ","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. The account owner might have the Settings saved the way you see your Desktop. If you want to customize it, please disable the Sync Settings. Steps are here: https:\/\/support.microsoft.com\/en-in\/help\/402610... You can installed any supported app in Windows 10. Make sure you are logged in to an Admin account.Settings > Account"]},{"symptom":"Reactivating windows after change of motherboard        I recently changed a new motherboard. And it seems my windows was deactivated after doing a fresh install on windows.I previously had a genuine windows 7 pro , and did an upgrade to windows 10 pro from that.Is it still possible that I can get the license back on my current new build?","solutions":["Hi,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Activation depends on what type of license you have of Windows 7\/8\/10. If Windows 7\/8\/10 came preinstalled with the computer, that is called an OEM license. For an OEM license, the license dies as soon as Motherboard dies. So essentially it is non-transferable. If that is the case you need to get a new license.However, this is not same for retail licenses i.e. you purchased the license through Microsoft store. That does carry transfer rights. If that is the case, please see the below steps:Run the activation troubleshooter on the new device using the below steps:Go to Settings>Update and security>Activation and run the troubleshooter. and select I recently changed hardware on this device.(Please note that Activation troubleshooter requires you to have digital license linked to Microsoft Account.)If the troubleshooter hasn't helped, you would have to call Microsoft during support hours to get more help.https:\/\/support.microsoft.com\/en-in\/help\/405170...Please let us know if you need any assistance.","Hi,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Activation depends on what type of license you have of Windows 7\/8\/10. If Windows 7\/8\/10 came preinstalled with the computer, that is called an OEM license. For an OEM license, the license dies as soon as Motherboard dies. So essentially it is non-transferable. If that is the case you need to get a new license.However, this is not same for retail licenses i.e. you purchased the license through Microsoft store. That does carry transfer rights. If that is the case, please see the below steps:Run the activation troubleshooter on the new device using the below steps:Go to Settings>Update and security>Activation and run the troubleshooter. and select I recently changed hardware on this device.(Please note that Activation troubleshooter requires you to have digital license linked to Microsoft Account.)If the troubleshooter hasn't helped, you would have to call Microsoft during support hours to get more help.https:\/\/support.microsoft.com\/en-in\/help\/405170...Please let us know if you need any assistance. I got my windows 7 pro from a microsoft cd that has the serial number on the cd box. Is this still transferable?windows 7 pro (genuine) > free update to windows 10 pro > new motherboard > fresh install windows > activation issue , and I could not find my device in the troubleshoot area when I select recently installed new hardware.","Hello,Replacing motherboard is crucial hardware change. You would need to re-activate using steps mentioned in this support article. If your current license is retail, you can use it with new motherboard. If it is OEM, you would need to buy new license then.To check the type of license installed on your system, try this:1. Open administrative Command Prompt.2. Type slmgr \/dlv and press Enter key.3. Note the Product Key Channel section Windows Script Host box:If it mentions OEM <method>, you’ve OEM license installed.If it says Retail, you’ve retail license installed.If it mentions GVLK, VOLUME_<method> then you’ve volume license installed. Note that GVLK stands for Generic Volume License Key. This license is not intended for home users.Regards.","Hi, Yes, it is eligible for a transfer then. Are you sure you are using the same Microsoft Account?","Yes , however here's one thing that bothered me.I recently sent my pc for a fix and when it came back , it became an enterprise version. I'm not sure they upgraded from my existing or reinstalled another version. The current pc can't seem to find my device with the same account.My original windows 7 pro disc cover does says \"OEM software\" above the product key.The key was also verified by a microsoft agent previously.I tried reinserting the key on 'change my product key' method as well but it could not verify anymore.I also had 2 old desktop versions under my account , one version before this which was active , I removed those two older ones in hopes it will let me activate on my newest but I'm still stuck with windows not activated now.","Hi, I installed Windows 10 Pro on a VirtualMachine and everything was fine until I changed some of the properties of my image to give it more power to run like more memory and access to other hardware resources. Now my license is invalid despite me providing a valid license. I've tried to go through the steps of revalidating my license but nothing seems to work. What can I do to rectify this? According to the details of the slmgr \/dlv command, I have a retail license. I think it's crazy we have to go through so many steps to find a solution to this problem. Even the chat window that is supposed to help me with these kind of issues seems to not work.Below is a brief part of the chat conversation. I clicked on sign in and the chat conversation started acting weird. I never received a window to sign in. It was aware that I was trying to reactivate my windows installation but it started to ask me about a product. Have you installed this copy of Windows on any other PCs or devices? NoGreat. Hold on one moment...Thanks. I found your installation ID, and I’m going to try to activate Windows now. This may take a minute...Please sign into your Microsoft account so I can help with this issueI'm sorry, I didn't understand. It helps me when you name the product and briefly describe the issue. Or you can talk to a person.OK. You can connect to a person below.","Hi, In any case if it did not help, suggest contacting Microsoft on Monday. https:\/\/support.microsoft.com\/en-in\/help\/405170...","Already did , they told me to look for whomever sold me the oem key to do something about it as their hands are tied. ","You state your Windows 7 Pro licence was OEM so therefore Windows 10 Pro would be OEM, no transfer rights to a new device. (which is a new motherboard)To check what you currently have installed Settings > Update and security select Activation and which edition is shown in the right hand pane.If a repair shop has installed Windows 10 Enterprise the first thing to do is to get Windows 10 Pro installed. (a clean install)","You mean oem license dies with the old motherboard? I thought they are transferable? I transferred it once before. It came with my first build. Then I transferred it to my 2nd build and now current 3rd it doesn't seem to work."]},{"symptom":"PC won't shutdown completely...        Hi there! I have a PC with Windows 10 and I decided to install the MacOS creating a dual boot on 2 separate SSDs. I have successfully installed the other OS but, in the end, I gave up on Apple. To delete their system I logged into windows, normal way, and used DiskPart to clean the disk and format it later which I succeeded on. However, whenever I shutdown the PC, in the usual manner, or try to restart it, either the computer freezes on shutdown screen either it turns off (Keyboard, mouse and monitor gets turned off too) but motherboard light and fans still keep running. Please Help me!  I do not know if formatting windows is going to solve anything but that is the last option i pretend to use.","solutions":["Hi Henrique, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.If you open a Command Prompt window, and type in: shutdown \/s \/f \/t 0 Does this shut down the PC completely or does it exhibit the same behavior? If so, you may want to try to disable the fast startup setting within Control Panel > System and Security > Power Options > Choose What the Power Button Does.Source: https:\/\/www.howtogeek.com\/349114\/shutting-down-... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","Have you done a hard shutdown?  Just hold down the power button until all turns off?  Then wait 5 minutes before turning on again.","So, I disabled fast startup but it did not solve the problem. I suppose it is some trouble with motherboard uefi since it does not depend much on the OS. The OS completely shuts down, or freezes, keyboard and mouse they turn off too. The only thing that keeps running are the coolers and the rgb lighting"]}]}