{"windows":[{"symptom":"I can't print an email        I can't print an email* Original title: Printing","solutions":["Hi, Please can you provide more information? What do you see when you try to print an email?","Sometimes I just get a blank page on the printer site, and sometimes I get the list of emails over top the message.","Hi Ann, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.This problem happens only when you try to print your emails, or at all times? If you press the Ctrl + P command, what happens? If it is a general problem, I suggest consulting and applying the indications of this official link, if the current step does not solve the problem, continue with the next one. https:\/\/support.microsoft.com\/en-us\/help\/401540...If the problem persists, please indicate the model and brand of the printer. Let me know if you have something else that I can help you with, I'd be happy to help.Happy new year Regards, Marc M."]},{"symptom":"Microsoft Outlook Profile        I am using a desktop PC with Windows 10, tried to scan to email and got the message - You need to create a Microsoft Outlook Profile in Microsoft windows.  Go to control panel and open Mail, click show profile and then click add. I did this but there was no Show Profile under mail.Can some one please tell me how I can create a Microsoft Outlook Profile.ThanksCharles","solutions":["Hello Charles, i'm Timon and i'm glad to help you. The scan to mail feature is designed to open your default mail app, and attach the scanned document to a new email.It seems that you currently don't use a mail app (such as Outlook or Microsoft Mail app) but only the web version of your email, isnt it ?If this is the case, you can't use this feature and you have to scan the document then manually add the attachment.","Hey Timon,  Thank you for your response.  I used to go through Outlook when I had Verizon email.  Is there any way I can do that with AOL if that would solve the problem.Thanks again,Charles","Hello Charles, Indeed, adding your AOL account in Outlook will probably solve the problem. If needed, follow this link for more information: https:\/\/www.lifewire.com\/access-aol-email-outlo...Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products).","Thanks again, I will try that."]},{"symptom":"Microsoft Jigsaw Upgrade        I had the upgraded version of microsoft jigsaw for a number of years. Yesterday I received a message saying that my upgrade had expired and the ads returned. When I went into the program to upgrade again it would not allow the country to be changed from the US to Australia and so the state and the post codes were also wrong. How can I pay for this upgrade as I enjoy the jigsaws but not the ads.","solutions":["Have you checked with the Store?","Hi Wendy-Williams, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.When you try to change the country, can you see any message or error code? If there is, please share it.These are the suggestions to restore proper operation in the Windows store. https:\/\/support.microsoft.com\/en-us\/help\/402749...With these indications, you should be able to change the region or countries https:\/\/support.microsoft.com\/en-us\/help\/402726...Let me know if you have something else that I can help you with, I'd be happy to help.Happy new year Regards, Marc M."]},{"symptom":"Network will not recognize a new computer        I have a wireless home network with 4 computers, one with Windows 7 and the others with Windows 10 Home.  I am trying to add an additional computer with Windows 10 Home, Version 1903, Build 18362.1.My problem:  The new computer will recognize and transfer data to all the other computers: however, none of the original computers will recognize the new computer.  I have used the \"Advanced Sharing\" settings to turn on \"Network Discovery\" for both private and public networks, yet it is not discovered by the others.Any help will be greatly appreciated.","solutions":["Okay happy for you that it works then, I can close the question. Have a happy2020 !!"]},{"symptom":"dell optiplex my unit is a dell        Hi my dell OptiPlex runs great ran a diagnostic testwhat does this meanTHANK YOU","solutions":["Hi timmaddox, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.These tests appear to be for your system memory (RAM). It looks like this report is displaying through a Windows application, and depending on the utility that ran the diagnostic, it appears it was unable to complete the tests.Typically, RAM tests are only able to run with a reboot of the computer, and a dedicated utility running not on Windows. They usually need to boot off of a CD, DVD, or USB flash drive.It does not mean anything is wrong with your system memory, just that it was unable to run the test.Are you experiencing any errors or performance issues? I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"Minecraft for windows 10 gift code isnt working        The Mojang website has an option for me to claim my free copy to upgrade from java to bedrock, but at the same time it says that they have ran out of codes? Is there any way to fix this on my end because I've been waiting and haven't gotten a code yet.","solutions":["Hi, You would need to contact Mojang support for any official information on when this might be resolved. But it looks like an ongoing issues, i've seen a few posts about this recently. It looks like they aren't able to generate the codes to meet the demand for one reason or another. There's a few tickets that have been merged into this one where people are experiencing the same issue.https:\/\/bugs.mojang.com\/browse\/WEB-1690Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I hope that helps."]},{"symptom":"HDD shows 100%        Current laptop is extremely slow, on the laptop is currently windows 10 Home (64bit) - when running task manager i can see that the HDD is running at 100% (screenshot below).I've disabled several services (Superfetch & Windows Search) as well as running a disk scan and malwarebytes scan (no issues found). Disabling the services seems to help lower the HDD to about 20%, but upon a reboot its back to 100% even thought the services above are still disabled...Help - this is my parents laptop and am only here for the holidays so wont be able to trouble shoot much longer :)","solutions":["Hi originalgabe22 That version 1903 Feature update is that cause of all this disk access, it is downloading and failing and all the time accessing your hard drive . . .Microsoft have released version 1909 of Windows 10, click the link below, then click 'Update Now' on that page to immediately get 1909 and bring your PC right up to datehttps:\/\/www.microsoft.com\/en-us\/software-downlo...If you have any difficulty with that 'Update Now' option, with these major upgrades, the most successful method is to upgrade from the Windows 10 ISO - you download the ISO and then perform an Offline UpgradePlease Note, follow the steps, this is then just an update and your files and applications will remain untouched . . .Click this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), then choose ISO, not USBWhen the ISO file completes downloading Disconnect from the Internet Temporarily disable any 3rd party Anti-virus you may have installed Then, in Windows File Explorer, double click the ISO and then run Setup.exe to begin the upgrade . . ."]},{"symptom":"I can't open Whiteboard - it stalls at \"Signing you in ...\"        When I try to open Whiteboard it just hangs with the message \"Signing you in ...\".","solutions":["Hi James Thanks for participating in Microsoft Community, I'm Skypper G. I'm Independent advisor, let me help you with thisIs this happening from the web or from the app? Resolution from Whiteboard on the web: Try with another browser instead Resolution from Whiteboard Client: Uninstall it an reinstall the latest version from here: https:\/\/products.office.com\/en-us\/microsoft-whi...","Hello,My problem is with the app (not on the web).I uninstalled and reinstalled from the location above, but not difference.  It still hangs at \"Signing you in ...\"."]},{"symptom":"folder lost after win 10 update        after the latest Win 10 update a folder disappeared from my desktop. I would like to get it back.","solutions":["Hi dfh17112, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.See the suggestions on this link, it is a website that some Windows MVPs share. https:\/\/www.windowscentral.com\/how-recover-miss...Let me know if you have something else that I can help you with, I'd be happy to help.Happy new year Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"WIn 7 with PGP to Win 10        I have been running WIn 7 with PGP Whole Disk Encryption for years.  With the impending drop of support for Win 7 I need to go to Win 10.  DO I need to decrypt my data prior to installing Win 10.  Or is it a non issue?","solutions":[]},{"symptom":"All updates failing        Dell Ispiron7gb RAMWindows 10, Build 1809 Windows ProAll .Net updates have failed:Microsoft .NET Framework 4.8 on Windows 10, version 1709, Windows 10, version 1803, Windows Server, version 1803, Windows 10, version 1809 and Windows Server, version 1809 and Windows Server 2019.October 8, 2019 Cumulative Update for Microsoft .NET Framework 4.8 for Windows 10 Version 1809October 15, 2019 Cumulative Updates for 3.5, 4.7.2 and 4.8 for Windows 10 Version 1809 and Windows Server 2019December 10, 2019 Version: OS Build 17763.914Update Windows 10 to Version 1909I tried running MS Troubleshooter, but it found nothing missing.  I did a scannow from the Command Prompt and nothing was found.  I tried resetting my PC and it fails to reset.  I removed all non-Microsoft apps (Acrobat, Avast, etc) and tried reloading the updates.  They all failed again.  I guess next up is a clean-install of Windows, but this is crazy.  I should not as a user have to go through all this ****.If you have any suggestions please let me know.Thanks,Kathy","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,Before attempting a clean install, I would recommend proceeding with these stepsOpen cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command promptDISM \/Online \/Cleanup-Image \/RestoreHealthRun these commands on the command prompt to restart windows update servicesnet stop bitsnet stop cryptsvcnet stop wuauservnet stop msiserverRen C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.old net start bitsnet start cryptsvcnet start wuauservnet start msiserverAfter successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartThis should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","When l got to Step# 1 I ran into a problem.  There is no search window\/function on the start menu.  I tried clicking on System Configuration under Windows Administrative Tools, but nothing happens.Any suggestions?Thanks, Kathy","Sounds like there may be some corrupted packages and system components on the device. For now, I'd suggest proceeding with the next step.","The installation failed at the very end (5 hours later) with error 0x8007007e.Any further suggestions?Kathy","Hi Kathy My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.0x8007007e error Windows 10 may be caused by the missing or damaged Microsoft NET Framework 4.7 package. In this case, try downloading the Microsoft NET Framework 4.7 offline installer package.Step 1. Download NET Framework 4.7 offline installer package from the Microsoft Download Center fromhttps:\/\/support.microsoft.com\/en-us\/help\/318649... Step 2. Follow the on-screen instructions to install the package. Step 3. Restart your computer. After that, try to install the required updates again.Hope this helps.","I received an error message that Microsoft NET Framework 4.7 was already installed so I moved on to the 2019-12 Updated and received an error message that the component store is corrupted.This is the log entry:OS Version = 10.0.17763, SP = 0.0, Platform 2OS Description = Future OS - x64 Unkonw Edition (ProductType=48) MSI = 5.0.17763.557Windows servicing = 10.0.17763.733CommandLine = C:\\9cb77dbd4a25130546eb1907c8\\\\Setup.exe \/x86 \/x64 \/redistTimeZone = Pacific Standard TimeInitial LCID = 1033Using Simultaneous Download and Install mechanismOperation: InstallingPackage Name = Microsoft .NET Framework 4.8 SetupPackage Version = 4.8.03928User Experience Data Collection Policy: DisabledNumber of applicable items: 6Exe (C:\\9cb77dbd4a25130546eb1907c8\\SetupUtility.exe) succeeded.Exe Log File: dd_SetupUtility.txtExe (C:\\9cb77dbd4a25130546eb1907c8\\SetupUtility.exe) succeeded.Exe Log File: dd_SetupUtility.txtExe (C:\\9cb77dbd4a25130546eb1907c8\\x64-Windows10.0-KB4486153-x64.cab) failed with 0x3712 - The component store has been corrupted. .Exe Log File: CBS.logFinal Result: Installation failed with error code: (0x00003712), \"The component store has been corrupted. \" (Elapsed time: 0 00:07:15).Now what?"]},{"symptom":"How to split PDFs        How do I split PDFs in Windows 10 and HP all in one Printer?Thanks","solutions":["Hi MarkMcGuckin, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.One way to do this is to open the PDF file (for example, in Microsoft Edge, or Adobe Reader).Then, you can go to File > Print, then select the \"Microsoft Print to PDF\" printer.Choose the pages you would like to split from the original PDF, enter this in the Page Range you would like to print, and then press Print. You can then choose the location on where to save the new PDF with just the selected pages.I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"Simple way to recconect Outlook 2016\/Outlook 2013 to Outlook.com to resume email access        I am not a tech person just an average Joe who wants to get this outlook thing done once and for all. I do not want to lose my folders or contact in the process of doing this. Does anyone have any idea how to do this without the risks of losing everything. Purchased a new computer and do not want to shift over to it until this reconnect is done. Like I said not the technical type so easy peasy please.","solutions":["Hi Railer Thanks for participating in Microsoft Community, I'm Skypper G. I'm Independent advisor, let me help you with thisDo you already have the Outlook Desktop Client installed on the new computer? If it is, you just to follow the process mentioned in the link below: https:\/\/support.office.com\/en-us\/article\/add-yo...","No, I wanted to get it all combined properly before I do anything on the new device. I use Carbonite and they recommended I get email resolved before transferring everything they have backed up. Thanx","No, I wanted to get it all combined properly before I do anything on the new device. I use Carbonite and they recommended I get email resolved before transferring everything they have backed up. Thanx"]},{"symptom":"Upgrade from 7 to 10 and Seagate Backup Plus Drive        Am currently on Win 7 and want to upgrade to Win 10.  I have a Seagate Backup Plus Drive with Memeo software built in.  It is set to automatically backup all new files.  In Win 10, will it do the same auto backups?  Seagate says the backup drive works with Win 10, but the Memo S\/W will not.  I have file folders on the C: drive that I want to be backed up automatically.  How can I do that on Win 10?  Thanks","solutions":["Hi, This is a difficult question for us to help with. As this isn't as much a Microsoft\/Windows issue as a Seagate one. Specific support requires knowledge of the exact drive and software. In theory it should work fine on Windows 10, compatibility for most modern programs is good on Windows 10. If you experience issues you can try running the program in compatibility mode for Windows 7.I hope that helps."]},{"symptom":"Activation key retirieval?        So I've recently messed up my pc badly and had to perform a recovery as it corrupted my system files and I lost the activation key during this process. I've already talked to the manufacturer and they said that since the key was a physical one, they didn't keep track of it. Since I heard about activation keys being bound to a set of hardware I was wondering that can I ask Microsoft to retrieve it from a set of hardware.","solutions":["Hi, The license key should become bound to your account and are tracked by the hardware. So from the activation page you can run the troubleshooter and go through the process of activating after a hardware change to move they key.That said if this isn't the case for one reason or another, there isn't currently a way to retrieve it from Microsoft as they don't keep a record of them. You can normally retrieve them with 3rd party tools when booted. I've had good experiences using ProduKey for this in the past. Though since they are account bound these days this is unnecessary in most cases.I hope that helps.","If the computer was activated there is no longer a need for a key.If asked for a key just go to the bottom of the page and click on Skip, Do this later, or I do not have one."]},{"symptom":"Win 7 to Win 10 upgrade        Want to upgrade from Win 7 to Win 10.  Computer has 1.8T HD (1.6T free), 8GB RAM, 64 bit.  Processors: 4 Intel Core i5 2400S @2.5 ghz.  Speed 2494 Mhz.   DirectX Version DirectX 11 graphics card.  Seems like I have all of the horsepower to upgrade to Win 10.  My question is this....will the upgrade to 10 have any slower reaction time\/speed than I have now?  The only significant apps that are on the computer are Office 2010 Home (Excel, Word, Powerpoint).  Thanks","solutions":["Hi tom2012, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.I think you will have little to no noticeable performance difference upgrading from Windows 7 to Windows 10. I have upgraded several systems personally and they generally run the same speed or even faster in some cases.There have been some independent benchmark tests that show performance is not an issue in most cases, for example:https:\/\/www.techspot.com\/review\/1042-windows-10...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to help further!Regards, -Ashton"]},{"symptom":"User Profile        HiI am using a stand alone Windows 10 PC and trying to manage the C:\\ drive size.My profile is set as Local but I have 43gb of data in the C:\\Users\\Adrian\\AppData\\roaming directory but only 8gb in the C:\\Users\\Adrian\\AppData\\local directory. What type of profile is the PC using?I'm unable to select roaming in the profile (greyed out)","solutions":["A roaming profile is a standard feature of Windows that is designed for use in corporate networks, although all user accounts have them, whether or not they belong to a corporate network. It enables you to sign in to your user account from any PC on the network.","HiYes i understand the benefits of a roaming profile in a working situation but this is a home PC. ","\"A roaming profile is a standard feature of Windows that is designed for use in corporate networks, althoughall user accounts have them, whether or not they belong to a corporate network. \"","Hi AdrianTerry999, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.It is normal to have both Local and Roaming directories within the AppData folder. Depending on the programs you have installed, programs will write to both folders.You may wish to try the Disk Cleanup utility in Windows 10 to reduce disk space: To delete temporary files: 1. In the search box on the taskbar, type disk cleanup, and select Disk Cleanup from the list of results.2. Select the drive you want to clean up, and then select OK. 3. Under Files to delete, select the file types to get rid of. To get a description of the file type, select it.4. Select OK. If you need to free up more space, you can also delete system files: 1. In Disk Cleanup, select Clean up system files. 2. Select the file types to get rid of. To get a description of the file type, select it.3. Select OK. Source: https:\/\/support.microsoft.com\/en-ca\/help\/402661... I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","Hi AshtonThanks for the reply, yes I've run all of the clean up utilities which meant i gained some space but that had no effect on the roaming profile size.It just doesn't seem logical that if you have a local profile, the roaming profile is the larger directory. Might as well just have roaming profiles! RegardsAdrian","Hi Adrian, It is a bit weird, yes! I know for a fact that programs such as Mozilla Thunderbird will store profiles under C:\\Users\\<user name>\\AppData\\Roaming\\Thunderbird\\Profiles\\<Profile name>\\ even though it is only local storage!I would recommend looking elsewhere for space savings unless you can uninstall some of the applications that you see listed within Roaming.You could use a free utility such as TreeSize Free that will show you other areas that are taking up space quite nicely:https:\/\/www.jam-software.com\/treesize_freeNote: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. -Ashton"]},{"symptom":"Xbox One Wireless controller + adapter Audio does not work through controller Windows 7        Hello, i'm searching all the day and i cant find a solution.I was able to install the drivers for the controller to work through the windows 7 device manager (downloaded by windows update), but I can't get the headset to work connected by the controller. Already checked the volume mixer, has nothing related to the controller or USB devices. Even if you connect via USB cable, it does not work.Hope i find a solution here, thanks.","solutions":["Hello, i'm searching all the day and i cant find a solution.I was able to install the drivers for the controller to work through the windows 7 device manager (downloaded by windows update), but I can't get the headset to work connected by the controller. Already checked the volume mixer, has nothing related to the controller or USB devices. Even if you connect via USB cable, it does not work.Hope i find a solution here, thanks."]},{"symptom":"sea of thieves        Error there is a missing or corrupt data file that is required for this game to run. can anyone help me plz ","solutions":["Hi, LiPuppyy My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Windows Explorer Address Bar Height in Windows 10        Hello,How do you reduce the height of the Windows Explorer Address bar. For example, my address bar appears as:As you can see, there is a large amount of padding between the text (\"My Computer\" in this case) and top\/bottom borders.I've tried adjusting resolution and the scaling settings. I'm running Windows 10, all current updates are applied.Have verified on two other laptops I have and the padding issue does not exist on either one.Issue only appears in the Address bar, height is good everywhere else.Thanks for any help!","solutions":["I just put a fresh copy of win10 on an old PC of mine. I made the ISO on the 30th. Exact issue, and I can't find it mentioned anywhere else online so I think it might be new or hardware related somehow. I have not been able to check any preexisting machines of mine."]}]}