{"windows":[{"symptom":"Initializing and Formatting new Hard drive        I got a new Internal Hard drive for my computer a WD Blue 1TB PC HArd drive 7200 RPM. My problem is when formatting or initializing something went wrong and I am now unable to initialize the disk and When I try to it gives a Data error (cyclic redundancy check). Any help would be appreciated.","solutions":["Yes. If the drive is bad and it's intended for Windows I'd replace it with an SSD which is the best Upgrade one can have - lightning fast, faster than a new higher-end PC without one, especially if you do the gold standard Clean Install in this link which compiles the best possible install which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Let me know if there's anything else. Also when ready please mark the post which helped most as the Answer, to help others. A rating is also appreciated."]},{"symptom":"Windows 7 past updates available after January 14, 2019?        Hello community,I have looked everywhere for this answer yet no one is asking.After end of service for Windows 7. Will I still be able to go to Windows Update and update Windows that way? Using that exact method, and not manually going to the Microsoft Update Catalog website, will I be able to open Windows Update from the start menu, it searches and displays, like normal, the updates available for Windows 7 with the important updates, recommendations and for all things like languages and older Office installation that have come out up till January 14, 2019? Will I be able to do this after January 14, 2019 and have Windows Update work in this method showing me everything I mentioned above up to the last thing that was updated on January 14, 2019? Or will this method be shutdown and the only way is to go to Windows Update Catalog's website and manually download everything, unless all windows 7 updates will be removed from the Microsoft Update Catalog website (which is highly unlikely as there is still Windows updates showing for XP and 2000). ","solutions":["Hello community,I have looked everywhere for this answer yet no one is asking.After end of service for Windows 7. Will I still be able to go to Windows Update and update Windows that way? Using that exact method, and not manually going to the Microsoft Update Catalog website, will I be able to open Windows Update from the start menu, then have Windows Update search for, like normal, and display the updates available for Windows 7 with the important update and recommendations for all things like languages and Office? In other words, like normal, up to January 14, 2019? Or will this method be shutdown and the only way is to go to Windows Update Catalog's website to manually download everything, unless all windows 7 updates will be removed from the Microsoft Update Catalog website (which is highly unlikelyas their is still Windows updates for XP and 2000 showing). We don't work for Microsoft to guarantee anything.All we can go on is what is has happened with previous operating system and end of support with them.Microsoft hasn't said anything to the contrary.","What did Microsoft do with the older operating systems? Did they shutdown the Windows Update method that was available for those other operating systems? I do not have a copy of Windows 2000, for example, to try its Windows Update method to see if it is still functional or discontinued. What do you know from previous knowledge in regards to Windows Update?","I can't see into the future.I only know what they did.But if it did not work as previously  how would you get the updates as you don't know the 100s of KB numbers?"]},{"symptom":"Windows 7 to 10 upgrade        I am currently performing a full backup on my HDD for me to upgrade from 7 to 10. My plan was to Install 10 on a new SSD drive I have instead of the HDD but if I do that will I have to reformat my HDD after I install windows 10 on the SSD.","solutions":["If your HDD is partitioned you only need to reformat that partition that had the Windows Operating System on it.  Other partitions can still be used.","I am currently performing a full backup on my HDD for me to upgrade from 7 to 10. My plan was to Install 10 on a new SSD drive I have instead of the HDD but if I do that will I have to reformat my HDD after I install windows 10 on the SSD.You say you are upgrading from 7 to 10.But then you say you are putting 10 on a new hard driveIf you are buying Windows 10, you can keep Windows 7.You are going to have the operating systems on separate hard drives.More information is required.","Yes I want to upgrade to windows 10 but rather then save the upgrade over top of the HDD I was hoping to save the operating system upgrade to the new SSD instead of the current drive, unless that doesnt work that way. Maybe what I am asking is that if I do an upgrade does it have to go onto the same drive that windows 7 is currently on.","You never answered the most important part: Did you BUY Windows 10?If you didn't, you can't do what you want to do:The Windows Product Key\/License for the Qualifying Operating System, Windows 7, Windows 8.1, etc. is absorbed into the Windows 10 Upgrade during the installation process and becomes part of the Activated final install of Windows 10.The Qualifying Operating System License, whether it be Windows 7 or Windows 8.1, etc. can not be used elsewhere, or in a dual boot with Windows 10.@@@@@@@@@@@@@@@@@@@@@@@@@@@AND:You may or may not still get 10 for free.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@","Alright thank you very much and no I did not purchase it separately so I will contact them. So I will have to do it on the HDD if I still qualify. I will contact them and try that route. Now my external hard drive I was trying to back up came up with 2 error codes (0x8078002A) and it says backup files couldn't be created and (0x8007045D) the request couldn't be performed because of an I\/O device. Any chance you can help me figure that out and how to fix it. My external hard drive is a 3tb wd mybook. This occurred when just trying to create a system image after the full back up i mentioned earlier failed.","IF they give it to you, it has to be an upgrade to that Windows 7.@@@@@@@@@@@@@@@@@@@@@@@@@@@I don't recommend using the Windows 7 backup\/system image backup software.These are quite good programs to use for Complete PC Backup and are free:\"EaseUS Todo Backup Free\"http:\/\/www.todo-backup.com\/products\/home\/free-backup-software.htm\"Welcome to EaseUS Todo Backup Manual\"http:\/\/www.todo-backup.com\/support\/help\/http:\/\/www.todo-backup.com\/download\/docs\/User_Guide.pdf______________________________________________\"AOMEI Backupper Standard\"http:\/\/www.backup-utility.com\/free-backup-software.html\"Configure and automate AOMEI Backupper in Windows\"https:\/\/www.winhelp.us\/configure-aomei-backupper-in-windows.html_____________________________________________\"Macrium Reflect Free\"http:\/\/www.macrium.com\/reflectfree.aspx\"Macrium Reflect Tutorial\"http:\/\/www.macrium.com\/webtutorial\/tutorial.asp@@@@@@@@@@@@@@@@@@@@@@@@@But you still have to read though this:Windows support for hard disks that are larger than 2 TBhttps:\/\/support.microsoft.com\/en-us\/help\/2581408\/windows-support-for-hard-disks-that-are-larger-than-2-tb"]},{"symptom":"Print failure midway through large job - OneDrive?        Friend has Win10, Corel WordPerfect and OneDrive.  When printing large document (83pages) it printed the first 20 or so normally, but then stopped and acted like it was trying to print to OneDrive.  Is there a setting I have to look for, or do we have a file size conflict? ","solutions":["What printer?  Did you have Print Preview turned on and waited for the total to show up in Print Preview before printing?"]},{"symptom":"Brand new Acer Aspire!! Running Windows 10S 1809....will not update to version 1909!        This is a brand spanking new machine bought for my daughter as a Christmas present!Someone please help me!!!!!","solutions":["Is the computer activated?"]},{"symptom":"When I try to upgrade from 7 to 10 the tool opens, runs but closes out in the middle of upgrading each time.        Split from this thread.When I try to upgrade from 7 to 10 the tool opens, runs but closes out in the middle of upgrading each time. I meet the requirements and have tried in safe mode, made a thumb drive and tried, updated my pc and all drivers to to make sure, ran a disk test in the CMD promt and still no luck. Anyone no a solution other than doing a fresh install? I really need to keep the apps and such on this device. ","solutions":["Any 3rd party anti virus, security, cleanup programs ever installed on the computer?"]},{"symptom":"DXError        hey im trying to get directx and it is going almost all the way though the install and then it is giving me a bunch of install failed error 0x80070005 access denied and failed api installassembly","solutions":["Are you talking about a .net file.  If so go win + x, Apps and feature, Programs and features, Turn Windows features on and off."]},{"symptom":"How to rename a virtual desktop        Hi I have a surface laptop 3, but im not sure how to rename a virtual desktop made in the task view. Can anyone help me?","solutions":["Hi onlypinda This feature is still being tested by the windows insiders at the moment and is not yet available on the released version of windows 10.hopefully it will be available in the next feature update, in late spring.","if you are running an insider build in taskview, left click on the current name and it will allow you to edit it","Yes i tried that but it didnt work for me, nothing popped up ","I have windows 10 pro. Is this still in beta too? ","I assume you are running the released version (you would know if you had joined the insider program)to check, go to settings -> system -> about look under windows specifications if it is an insider preview next to Edition it will say \"windows 10 pro, insider preview\"the latest released build is 18363.xxx an insider preview will have a higher build number.windows 10 pro (version 1909) is not in beta, but Version 2004 of all windows 10 editions is."]},{"symptom":"Windows Mail        I have had a new Dell Inspiron computer for about a month and have linked three email addresses through the \"mail\" icon in the taskbar (Windows 10 Home).  It's been working fine so far with all my accounts showing up when I open \"Mail\" and all the folders have been available.  However, today for some reason when I click on the \"Mail\" icon the mail window opens for about a second and then closes.  Nothing is shown in the window except a small white envelope, no folders or accounts,  Get the same response when I try to open it through the start menu.Any ideas or suggestions?  I am by no means any kind of technical geek so please be governed accordingly with any response.  Thank you.","solutions":["Hi Don. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.This can happen sometimes but it's not that hard to fix so I'll walk you through:Reset the Mail app in Windows Settings (gear icon above Start button) > Apps and Features > Mail & Calendar > Advanced Options > Reset. Restart PC. Try adding the accounts back to see if it works now.If that fails to fix it then Re-register Mail & Calendar app from Option 2 here: http:\/\/www.tenforums.com\/tutorials\/3175-apps-re... Finally if nothing else works reinstall the Mail and Calendar app from Option Two here:http:\/\/www.tenforums.com\/tutorials\/3175-apps-re... If you have broader performance problems go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Blue screen error cause by ntoskrnl.exe        Hi!I'm a graphic artist, so not the MOST tech savvy, but i have built 3 ryzen based pc's in the last year - unfortunately the latest onehas been plagued by BSOD's and i really have no idea why......as an aside, this is my THIRD attempt writing this due to 2 BSODS in the last 30 minutesheres a link to a zip with the most recent minidump fileshttps:\/\/1drv.ms\/u\/s!Ak1Ebz-4TR7n7WDY3n0sbBe-ijJW?e=D7hX9Qheres the latest summary's from bluescreenvie112919-25437-01.dmp    29\/11\/2019 20:58:28    IRQL_NOT_LESS_OR_EQUAL    0x0000000a    00000000`00000000    00000000`000000ff    00000000`000000c1    fffff806`0cce0551    ntoskrnl.exe    ntoskrnl.exe+1c14e0                    x64    ntoskrnl.exe+1c14e0                    C:\\WINDOWS\\Minidump\\112919-25437-01.dmp    12    15    18362    720,764    29\/11\/2019 21:01:06   112919-17625-01.dmp    29\/11\/2019 20:51:44    IRQL_NOT_LESS_OR_EQUAL    0x0000000a    00000312`3053da1a    00000000`000000ff    00000000`0000002b    fffff803`672dbbfa    ntoskrnl.exe    ntoskrnl.exe+1c14e0                    x64    ntoskrnl.exe+1c14e0                    C:\\WINDOWS\\Minidump\\112919-17625-01.dmp    12    15    18362    732,372    29\/11\/2019 20:53:06   112919-11843-01.dmp    29\/11\/2019 20:23:50        0x00000189    ffffe60b`4edd37b0    00000000`00000000    00000000`00000000    00000000`00000000    ntoskrnl.exe    ntoskrnl.exe+1c14e0                    x64    ntoskrnl.exe+1c14e0                    C:\\WINDOWS\\Minidump\\112919-11843-01.dmp    12    15    18362    713,308    29\/11\/2019 20:25:04    i've tried to run through everything i could think of to see if there was any improvement - there hasnt been, its as unstable as ever, but this is what i did anyway...- updatest to latest windows 10 build 1909 - no difference from before- updating motherboard bios to latest from default - no difference either- running bios at default values (with and without memory overclocking) - no difference!- updating drivers - nada!- running windows memory test and memtest 64 - no errors (although i only ran memtest 64 for 3 hours ish, could run through that again for even longer if necessary....)heres windows system information:OS Name    Microsoft Windows 10 HomeVersion    10.0.18363 Build 18363Other OS Description     Not AvailableOS Manufacturer    Microsoft CorporationSystem Manufacturer    Micro-Star International Co., LtdSystem Model    MS-7C02System Type    x64-based PCSystem SKU    To be filled by O.E.M.Processor    AMD Ryzen 5 3600 6-Core Processor, 3600 Mhz, 6 Core(s), 12 Logical Processor(s)BIOS Version\/Date    American Megatrends Inc. 3.50, 07\/11\/2019SMBIOS Version    2.8Embedded Controller Version    255.255BIOS Mode    UEFIBaseBoard Manufacturer    Micro-Star International Co., LtdBaseBoard Product    B450 TOMAHAWK MAX (MS-7C02)BaseBoard Version    1.0Platform Role    DesktopSecure Boot State    OffPCR7 Configuration    Binding Not PossibleWindows Directory    C:\\WINDOWSSystem Directory    C:\\WINDOWS\\system32Boot Device    \\Device\\HarddiskVolume4Hardware Abstraction Layer    Version = \"10.0.18362.387\"Installed Physical Memory (RAM)    32.0 GBTotal Physical Memory    32.0 GBAvailable Physical Memory    27.5 GBTotal Virtual Memory    45.0 GBAvailable Virtual Memory    38.9 GBPage File Space    13.0 GBPage File    C:\\pagefile.sysKernel DMA Protection    OffVirtualisation-based security    Not enabledDevice Encryption Support    Reasons for failed automatic device encryption: TPM is not usable, PCR7 binding is not supported, Hardware Security Test Interface failed and the device is not Modern Standby, Un-allowed DMA-capable bus\/device(s) detected, TPM is not usableHyper-V - VM Monitor Mode Extensions    YesHyper-V - Second Level Address Translation Extensions    YesHyper-V - Virtualisation Enabled in Firmware    NoHyper-V - Data Execution Protection    Yesheres some HWINFO v. 6.15-4020 beta >NVIDIA GeForce GTX 1660RAM = corsair cmk32gx4m2d3000c16Thats all i've got right now, hopefully its of some use, i could really use an expert opinion if anyone has oneThanks!***Modified title from: contant BSOD - ntoskrnl.exe - could it be ryzen related?***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I appreciate the efforts taken by you in resolving this issue. I understand that you are receiving Blue Screen error on your computer. When do you receive the Blue Screen error?  I have analyzed the dump files shared by you. I would suggest you to try booting the computer into Safe Mode and check if it is still crashing. Refer the articleStart your PC in safe mode in Windows 10. In case, the PC is working fine in Safe Mode then you may try performing Clean Boot and see if the PC boots normally. Refer the articleHow to perform a clean boot in Windows Performing a clean boot will start the computer with minimal set of drivers and programs, to determine whether a background program is causing the issue. Some of the Startup programs will not load after performing a clean boot on the computer. However, that functionality will return when you reset the computer to start normally after finishing the troubleshooting. Note: Please refer the section Reset the computer to start normally after clean boot troubleshooting to boot the computer in to normal mode after troubleshooting. For additional information, see How to fix Error 0xA: IRQL_not_less_or_equal andTroubleshoot blue screen errors.  Let us know how it goes.  Regards,Nikhar KhareMicrosoft Community - Moderator","Do you have ASUS motherboard?","Exactly the same symptoms (including 2 BSODs in a row and \"ntoskrnl.exe+1c14e0\"), the same attempts to fix (except I did make boot time Memtest for 8 hours), but completely different hardware: Intel-based PC (i7 9700K), 16 Kingston RAM and AMD video card. For me, that indicates OS kernel to blame, BUT there is also one match in specifications - MSI motherboard. May it be faulty MB?","at the end of the day, i just replaced my memory - despite there being no errors in windows memory test, or memtest86....and so far, so good.No bluescreens as of yet, but i've not fully setup and stress tested the new buildMight be a case of trying that though if nothing else is working for you!","good to know, thanks for the update!","Did you ever get a final cause of this BSOD? I am having \"ntoskrnl.exe+1c14e0\" errors pretty regularly and they started after I installed my new NVIDIA GeForce GTX 1660. How long have you had your video card? Just curious if this may be something similar.","I have replacements for video - 2 cards and onboard video, all configurations tested - the same BSOD. Still have no definitive answer, for now waiting for motherboard replacement arrival.","Hi, Mostly the same symptoms BSOD after 30 minutes \"ntoskrnl.exe+1c14e0\", But the string vary from \"IRQ_NOT_LESS..\", \"POOL_CORUPTION_IN_FILE\", \"MEMORY_MANAGEMENT\"Mine look like memory related. It started after i upgraded from 16 Gig to 32, I had \"Patriot Viper Elite Series DDR4 16GB (2x8GB) 2666MHz\", I added an identical pair of exactly the Same model, speed, same timing,I get the error while starting a memory intensive application, Ryzen 7 1700, motherboard Asus ROG strix b450-fBut I ran memtest86+ without any errors ( 1H30 in Single core , 40 minutes all core. ) My next step will be to tests each memory sticks individually, ","i'd suggest looking at the memory compatibility for your motherboardhttps:\/\/www.asus.com\/uk\/Motherboards\/ROG-STRIX-B450-F-GAMING\/HelpDesk_QVL\/and the particular serial no. for your memory e.g. if its this modelhttps:\/\/www.amazon.com\/Patriot-2666MHz-PC4-21300-Memory-PVE416G266C6KGY\/dp\/B079NQHWMG\/ref=cm_cr_arp_d_product_top?ie=UTF8then the model no. is PVE416G266C6KGYthen see if that shows up in the compatibility listturns out my memory wasnt on the list for my motherboard and i think that might have been the issue all along!(despite the many assurances that Ryzen's memory compatibility issues were larget ironed out \"these days\". Ah well, you live and learn)Hi, Mostly the same symptoms BSOD after 30 minutes \"ntoskrnl.exe+1c14e0\", But the string vary from \"IRQ_NOT_LESS..\", \"POOL_CORUPTION_IN_FILE\", \"MEMORY_MANAGEMENT\"Mine look like memory related. It started after i upgraded from 16 Gig to 32, I had \"Patriot Viper Elite Series DDR4 16GB (2x8GB) 2666MHz\", I added an identical pair of exactly the Same model, speed, same timing,I get the error while starting a memory intensive application, Ryzen 7 1700, motherboard Asus ROG strix b450-fBut I ran memtest86+ without any errors ( 1H30 in Single core , 40 minutes all core. ) My next step will be to tests each memory sticks individually, i","I have the same issue and using this ram. All my tests are fine just like yours. I have a feeling it is this RAM as i can't get anywhere the high speeds without crashes. Has changing you RAM fixed this and if so what RAM have you replaced it withCorsair CMK16GX4M2B3200C16 Vengeance LPX 16 GB (2 x 8 GB) DDR4 3200 MHz C16"]},{"symptom":"Windows 10 pro missing title bar and part of the top of window        Hello, we are experiencing problems with certain application in windows 10 the top of teh window (the first inch)is missing... the title bar the close minimize  button are not there and if there a window underneat it it will close that window instead it happens with file explorer, google chrome, adobe reader dc.all those apps are up to date the windows are also up to date, i can't an answer anywhere i tried using system restore but the problem comes back shortly after ( a day or 2 )","solutions":["I am also experiencing this issue on a Lenovo PC. 4th Generation Intel i3 Processor - Dual screen setup. GeForce 210 GPU. Windows 10 Pro x64 - Latest build.This is the first report I could find explaining the exact same symptoms. I have noticed the following:This is a rare but extremely frustrating issue.It can occur on the top or at the bottom of the window, but not limited to just those areas.The issue only occurs with maximised windows and does not seem to affect all apps.This problem can be evasive and has been occurring intermittently in the past. It comes and goes depending on what apps are open.Some have reported that Office Protected View could be a trigger, but disabling this only works in limited cases.Troubleshooting Steps Performed: (Since April\/May 2018)Update WindowsUpdate all Affected AppsClean Install new display driversClean bootSFC scan and DISMCheck event viewerRun affected apps in compatibility modeUninstall all OEM softwareUninstall all non-essential appsUninstall all graphics driversReplace graphics card (AMD and NVIDIA)Remove graphics card altogether and run integrated GPU onlyUpdate BIOSDisable CPU Virtualization Features in BIOSReplace PC Tower - Latest W10 PRO x64 Clean Install on New PCReplace both Monitors with 2x New Identical Monitors - Both connected via digital outputsFindings:None of my troubleshooting steps have yeilded any results. The issue always returns eventually.We seriously need some action from Microsoft regarding this issue.Possible Cause:Due to the scope of affected apps and the fact that only multiple display setups seem to be affected I suspect this may be a display driver\/hardware\/configuration compatibility issue\/conflict probably related to a recent windows 10 update since build 1703\/1803 causing display issues. Temporary Workarounds:This is a quick and easy workaround: SHIFT + CTRL + WIN + B This key sequence empties the video buffer and restarts the driver, and does the same for the keyboard, the mouse and the soundcard. It was meant for helping some users and techs with stuck graphic elements, black screens, stuck sleep modes, stuck mouse buttons and buzzing or looping sounds. The issue will return eventually.Limited successChanging the primary monitor or just slightly changing the layout of multiple monitors and clicking apply resolves the issue for an unknown amount of time.Limited successWhen I use shift + right click on the taskbar icon of the affected application and select 'restore window' the interface returns, but when I maximise again it the issue returns.This is my personal choice. You can effectively work around the issue by avoiding the symptoms.Any window showing the issue symptoms need to be restored as above and NOT MAXIMISED AGAIN.Snapping Windows to the Left or Right side of a display and resizing them sideways is a quick way of using non-maximised during multi tasking workflows.Success may be limitedSome apps that support Full screen mode (Not to be confused with maximized mode) can be restored by hitting the F11 key to enable full screen and hitting F11 again to exit full screen. My interface then returns, however, some apps like Acrobat Reader DC does not respond to F11 because it has it's own full screen shortcut which will also work the same way.This would be my second choice due to how quick you can tap F11 twice. Once you re-open or move the window the symptoms could return (If in maxmised state)Success may be limitedPossible Solution:There have been reports that the following third party hotfix fixed the issue. You may want to create a system restore point before trying this:Link - Third Party HotfixLink - How to create a restore pointLimited successChanging to a single display setup may get rid of the symptoms completely. Very inconvenient, but may be viable if you can get by with one display and you have no viable\/effective workarounds.Not tested yet, but someone can confirm if this helps them. The only other effective way I can think of is going back to an earlier (Prior to 1703) build of Windows 10 or even going back to Windows 7\/8What can we do if we want a real solution?Please continue to contribute your findings. My research continues.Any response about possible cause and solutions will be of great value to the community.We need to get Microsoft's attention as I believe their operating system is at fault. There is a thread in the feedback hub about this issue:https:\/\/aka.ms\/AA3ry7p(PLEASE ADD UPVOTES - This may be the only way for MS to pay attention to it)Share and Upvote the following threads: (They also contain more insight and other workarounds)https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/windows-terminal-server-2016-multi-monitor\/aefbec87-0f5e-4f35-8296-b432d7d7f98bhttps:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/windows-10-multi-monitor-maximized-window\/3c2042ef-73df-401c-9a59-65b347d4dbeahttps:\/\/www.reddit.com\/r\/sysadmin\/comments\/8imjva\/windows_10_multi_monitor_maximized_window\/Make the issue public knowledge. If you know someone that works for a tech news outlet ask them to do an article about the struggles people are having with this specific issue. The lack of meaningful response and follow-through from MS is absolutely unacceptable.Also share on Microsoft's public channels: Facebook, Twitter Etc. TAGS: dual tripple multiple monitor multi monitor full screen maximize display top bottom toolbar interface menu tool bar toolbar title bar bottom bar status bar missing black white blank transparent maximize"]},{"symptom":"upgrade old NVMe ssd to new NVMe ssd and keep my Windows        Hi.I just got the \"Samsung 970 evo\" NVMe and I want to replace it with the old one that has my Windows on itI know there is a way with adapter and cable but I don't have that, so is there a way that I can keep my Windows ?-I don't mind to lose my files-Is it possible to save the Windows on USB Flash Drive or External Hard Drive ? ","solutions":["Hello AliSahwan, If you are not worried about losing your files, i would recommend a fresh install of windows via usb. You can find detailed instructions on how to do this here:https:\/\/www.microsoft.com\/en-us\/software-downlo...","Thank you for replying fastI have few questions-when I do the fresh install is windows going to ask me for my windows product key (license key) ?If it does what should I do ? , I don't know it-can the laptop install windows via USB flash by \"Create Windows 10 installation media\"On new NVMe ssd ?","It will activate automatically once you're connected to the internet. And yes the laptop will be able to install it via usb as long as you follow the instructions at the link provided.","You can clone the old one to the new one and keep all you stuff.Amazon has a M2 USB kit the should work.  I will be trying this in the next couple of daysI use EaseUS ToDo Backup to do the cloning..If the computer was activated there is no longer a need for a key.If asked for a key just go to the bottom of the page and click on Skip, Do this later, or I do not have one."]},{"symptom":"How to remotely remove account from pc.        Hello.Recently, I logged into my Microsoft Account to access the Xbox App on a Windows 10 domain PC. I am unable to access settings due to restrictions set. Every time someone accesses a service, such as the Microsoft Store, or the Xbox App, my account is available, and no password is required to log in, how do I remove my account remotely from this pc?.Any help would be appreciated, thanks.","solutions":["Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.First, check if the device that doesn't belong to you exists in your Microsoft Account. If so, remove it immediately.https:\/\/support.microsoft.com\/help\/4026440Next, go to Manage Your Security Info > Additional Security Optionsand sign out from all your trusted devices.https:\/\/support.microsoft.com\/help\/12428Please let me know if I can help you further!"]},{"symptom":"USB        My USB ports and Micro chip reader have stopped operating.  What is the fix?  I have Windows 10.  Lenovo computer.","solutions":["Hello PhilipWestbrook! My name is Marco, I am an Independent Advisor. I will do my best to help you.What is the model and your lenovo laptop? You have to go to the site of the laptop in question and download the latest updated drivers from the USB ports.If you wish, I can guide you if you give me the model of your laptop.","Model number is Y50-70","Its a Lenovo Y50-70.   I’d appreciate guidance Marco.","First let's try something else ... Boot into the BIOS by continuously tapping F2 on boot-up. Once in the BIOS, hit F9 to load factory default settings then hit F10 to save and exit (this reloads the hardware configuration of the machine). Once inside Windows, uninstall the USB 3,0 driver (Right Click on start button, go Device Manager > Universal Serial Bus Controllers) then scan for hardware changes.(like picture below) When the USB device comes back, try to test any USB device (e.g., USB mouse, flashdrive, etc.) and observe.","I’ll give that a try.  It is way over my head though.  thanks,","Let me know if it works"]},{"symptom":"every troubleshooter windows 10        every time I run the troubleshooter it stops right away and gives me this earror code 8x800706BE. what does the earror code mean and how do i fix it","solutions":["Which troubleshooter are you talking about?","HI Shannon. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Is this the WIndows Update troubleshooter because that error can apply to others but is most common for Updates. What is the full error message?If so, then I'll give you everything possible for fixing failed Windows Updates, so that at least something will work before you work through them all. Even if you've tried a step, please do it over in sequence:Some Updates will sort themselves out in a few days so I'd wait to see. If not or they are bothering you then here are steps you can take:1) Run the Windows Update Troubleshooter from Windows Settings > Update & Security > Troubleshoot. (You can skip this step)2) There is a new guided walk-through from Microsoft for repairing Windows Update that leads up to resetting components if necessary:https:\/\/support.microsoft.com\/en-us\/help\/10164\/.... Try running that first. 3) If that fails try manually resetting Windows Update Service: Open administrative Command Prompt and type following commands one-by-one followed by Enter key.net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Close Command Prompt and see if Windows Updates works then 4) You can also install the Updates manually that fail to install, which are logged at Settings > Update & Security > Windows Update > Installed Update History, and then search for those to download and install from this Catalog:http:\/\/test.catalog.update.microsoft.com\/v7\/sit... 5) If they continue to fail and interfere, then you can block them using one of these methods:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... 6) If problems with Updates have become chronic and especially if you have other performance problems, go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 7) If nothing else works then do a Repair Install, by installing Media Creation Tool, open installed Tool and choose to Upgrade the PC Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version 1909. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... _____________________ Good news! There are major changes in Version 1903 giving back control over Updates to the consumer. Microsoft has heard us at the highest level who announced this here:https:\/\/blogs.windows.com\/windowsexperience\/201..._____________________ I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Which troubleshooter are you talking about?none of them are working!!!"]},{"symptom":"Why is Windows 10 Search So Bad At It's Job?        I've been using Windows 10 for a while now. For the most part, I like it. There have been some good additions like virtual desktops, the merged Win8 start screen and Traditional windows start menu, and it's got some nifty internal stuff going on. The most obvious flaw is the search feature.I get it. It would be nice to have a search bar that let's you type stuff in and search your apps, your files, and the internet all at once. In theory it's an interesting tool. \"Cortana\", however, has some glaring issues that make it basically useless for everyday use. If going into my \"All Apps\" section to find what I need is easier than searching, you've failed.Issue 1: Incremental ResultsAgain, this seems like a cool feature: change the results on the fly as I type in what I want to search for, then stream in results as they come in rather than posting a progress bar. Seems like it would be neat. It's not though, since there isn't any way for me to be sure that the search is complete, and incoming results change the position of the currently displayed results. That means if I've already found the app I want and am trying to click on it, it can suddenly be replaced with a completely separate app, or file, or website. This defeats the only practical benefit of HAVING streaming results in the first place.  Add to that a system that gives you just enough time to refresh after typing additional search words to move your mouse to a result that's about to disappear, and you've got yourself a frustrating and useless feature.Issue 2: Failure to detect exact resultsThis is a big one. There are a large number of times where \"Cortana\" will fail to detect exact matches in the start menu, instead suggesting obscure system\/program files. This is the MINIMUM a search feature on the start menu should do. This alone gets the system an F. Issue 3: Bing and EdgeI don't know why Microsoft thought they needed a web search engine, but that's fine. Forcing me to use it is NOT fine. It is the furthest thing from fine I can imagine. Forcing users into a single web search provider is anti-competitive, pointless, and cripples the usefulness of the feature to the point where it's basically useless. Add in the fact that it launches Edge instead of the default browser, and you've turned your search feature into an invasive parasite.Issue 4: Greedy IndexingIndexing the file system can be a lot of work. USUALLY this runs when the computer is idle, but I've had many instances where the Indexing Service decides to run in the middle of a hard drive speed test, or during a game, ruining both. Some other new services also seem to have a hard time detecting whether or not the computer is being used.These things need to be fixed. I'm sure people have other complaints, as do I, but these are the major ones that make the current system a mess to use. What do other people think? What other improvements could be made?","solutions":["I like the O\/S generally but hate the way it fails so often when searching for files and documents on the PC it allegedly operates...Definitely don't like the way it updates as and when it sees fit rather than waiting until I choose to apply the updates.Do not like the way it merges my skype accounts regardless of my choice.The help function redirecting to the MS forums where MS reps can chose their own replies as answers does not work too well either. Just like the site busy fault that often occurs.","I'm really frustrated with the search on Win10 - thanks for articulating the issues I am experiencing. You can't even turn off the web search anymore ( or adjust it to use a different search engine ). This feels like one of the common mistakes that MS makes - changes feel like they are fueled by business development instead of usability.And I don't even know what is up with the new picture viewer. How could you guys possibly ruin a picture viewer. ","Love to use mac instead. Happy to pay double price for mac machine.I will never go back to windows; I wish I can say the same for my work machine as well where I have to stick with windows due to *special* development requirement.","Issue 2 is huge, and you hit the nail on the head. If I type the exact file name down to the case and still don't see the expected result, the entire search function is a failure. For the life of me I don't see how this version of the search bar has made it into release mode with such glaring issues.","I Agree, Issue 2 is a big headache for me too.  I often find cases where a Windows feature or app simply does not show up on search results. Sometimes, I start to type what I am looking for and see it flash up while I type and disappear once I have completed typing my search term.  eg. If I want to get to Devices and Printers,  if I type DEV I can see it pop up.  However, if I finish typing the word DEVICES it disappears leaving only Device Manager listed.  This really doesn't make any sense to me.Also, it is very inconsistent.  The search behaviour works differently when I use it on a different machine.Recently I have had a lot of issues even finding the control panel. It's as if Microsoft is trying to force me to use the new settings menu  which doesn't even have what I'm looking for, or has it but in such a basic view that doesn't allow you to do anything with it.  So, in order to get to the control panel I have to search for it inside the new settings GUI.  My recommendation to Microsoft is to allow ALL apps and settings that are available on the operating system to come up on the search results regardless if it's old or new GUI.  Let the user decide which one they prefer using.  It doesn't hurt and makes it a less frustrating environment to work in.  ","I Agree, Issue 2 is a big headache for me too.  I often find cases where a Windows feature or app simply does not show up on search results. Sometimes, I start to type what I am looking for and see it flash up while I type and disappear once I have completed typing my search term.  eg. If I want to get to Devices and Printers,  if I type DEV I can see it pop up.  However, if I finish typing the word DEVICES it disappears leaving only Device Manager listed.  This really doesn't make any sense to me.Also, it is very inconsistent.  The search behaviour works differently when I use it on a different machine.Recently I have had a lot of issues even finding the control panel. It's as if Microsoft is trying to force me to use the new settings menu  which doesn't even have what I'm looking for, or has it but in such a basic view that doesn't allow you to do anything with it.  So, in order to get to the control panel I have to search for it inside the new settings GUI.  My recommendation to Microsoft is to allow ALL apps and settings that are available on the operating system to come up on the search results regardless if it's old or new GUI.  Let the user decide which one they prefer using.  It doesn't hurt and makes it a less frustrating environment to work in.  I am replying to this comment, since the date demonstrates that Microsoft have still done nothing about the useless Search which only offers to take you to Bing. I am wanting to searchmy PC not the Web. If you adjust the Search Box items to Folders\/Files\/Music etc, it says there are no files of the name you want in any of these areas.All you can do is go to File Explorer (very slow) or, better still, to main folders where you know the item might be and use its own Search facility (Upper right hand corner). That usually works.But why did Microsoft change a working system to this pretty useless one some weeks ago?","Cortana is the box in \"Dumb as a box of rocks.\" Doesn't know what hardware is running. Cannot go beyond 'look in control panel.' Instructions finally found to hide the drooling helper don't work. WTF? You (Micro$not) have released some pretty bad OS's since 74 but this one hits a new low. Creator update took it from bloated parody of OS to not worth it. Putting the lock on hard drive tells me you damn well know it too. Win 10 desperately needs another year of serious design regroup. Flow and intuitive navigation just aren't there. It attempts to work on any hardware and ends up not working well on any. Again in local patois, WTF?To commentator above; \"Microsoft forcing users in a single option, theirs? That started with migration from DOS to a thing finally called windows. It is a window into the world was on description. Thankfully the error in view was switched to the box and\/or data. Attempting to keep platform open then allowing ease of api cross communication with iOT. Happy Happy Joy Joy SSDD. Win 8 and 8.1 were so bad they had to release 10 at least 2 user acceptance cycles early. To DFroggatt, it can't tell you what it runs on, seems to have no knowledge of bios linking hardware, doesn't know CPU names, gens, can't identify versions and is basically clueless on drivers. Go to system in settings is stock answer. This for anything outside of it's expertise. I'd always thought some knowledge was required for skills.The constant force from OS to keep skype, to use your data allotments and hardware to update strangers computers and be updated by strangers (p2p) in the at this level is beyond unsafe and into chaos. Going ix shopping in morning. This one is too much of a kluge. Peace, out.","The Windows 10 Search function is completely useless!  I have thousands of documents, spreadsheets and photos on multiple drives.  Even with Indexing the Search function takes over 30 minutes to finish, even if I select a specific folder.  And, normally never finds any documents matching the search key.It is faster by manually looking through the File Explorer.What a horrible change for Microsoft to incorporate.  Why does Windows 10 have to search the world when my searches are only on my local drives?  If I want to do an Internet search I will do so with a Browser Search Engine such as Bing or Google.Time to find a Third Party Search App for Windows 10. ","The Windows 10 Search function is completely useless!  I have thousands of documents, spreadsheets and photos on multiple drives.  Even with Indexing the Search function takes over 30 minutes to finish, even if I select a specific folder.  And, normally never finds any documents matching the search key.It is faster by manually looking through the File Explorer.What a horrible change for Microsoft to incorporate.  Why does Windows 10 have to search the world when my searches are only on my local drives?  If I want to do an Internet search I will do so with a Browser Search Engine such as Bing or Google.Time to find a Third Party Search App for Windows 10.  Problem solved, by luck!W10 now limits what it will search for, presumably to ensure it runs faster and doesn't waste space on keeping a large index on the PC.However, if you go into the Cortana search box and enter the magic word 'index' (without apostrophes), it shows 'Indexing Options' as the top search result.Click on this and it takes you to Control Panel Indexing Options, which shows you what is indexed - very little.But, by clicking on 'Modify' at the bottom you can add to its sparse list very easily.I entered all the partitions I wanted covered, with no exceptions (other than programs) and let the PC get on with it, which took well over an hour, even with a fast processor and plenty of RAM.It then announced it had completed indexing 235,000 files, images, videos etc. Search Box can now find virtually anything I want very quickly, just like the good old days.It won't find photos by Tags, but File Explorer Search (in the top right area of the page) will, once I am in the right partition where I keep my photos.Making a PC do what you want, keeps the intellect ticking over - particularly when you get to your eighties!","Watching that search bar sit at the almost complete point for ages, is bad enough. But then it does not come up with the file that I can find via manual review of the folders! Attach to the same storage array with an old XP box, and the file is found ( in less time!).I also noticed the control panel is being deprecated. Now you have to search for it. (with a search function that has trouble finding things!).They have done the same thing with many other items.The best example is the print queue. That actual window has not changed since Windows 2000, but they keep burying it under new layers of the GUI. Now to get to it you have to go Windows Flag \/ Settings \/ Devices \/ Printers & Scanners \/ Pick the one you want \/ Open queue \/ .... phew!"]},{"symptom":"Event ID 455        I get the followingsvchost (4036,R,98) TILEREPOSITORYS-1-5-18: Error -1023 (0xfffffc01) occurred while opening logfile C:\\WINDOWS\\system32\\config\\systemprofile\\AppData\\Local\\TileDataLayer\\Database\\EDB.log.I tried to following the fix action I found in the knowledge base, but I can not get access to that folder due to permissions. I am attempting access via an administrator account, but still can not access it.Please advise.NancyK1104","solutions":[]},{"symptom":"Can't connect to Windows 8 Store        Hi,I posted a question earlier. I am running Windows 8. When I open the Store the message below appears:\"This version of Windows is no longer supported b Windows Store.Get the newest version of Windows. I would like to advise that I ran through all the help methods but the problem still exist. I cannot upgrade right now maybe later.","solutions":["Support for 8 ended in Jan, 2016.You were supposed to use the free upgrade to 8.1.But if you won't do that, ask Microsoft for help@@@@@@@@@@@@@@@@@@@@@@@This is how one poster here solved their problems with the Store>https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows8_1-windows_store\/windows-store\/ca81b81b-8b86-42c1-90b5-ec3e4afa1b4a?tm=1536786596734I contacted Microsoft support, got the virtual agent and asked her to chat with live person. Told the person my problem and it was fixed in an hour.To contact Microsoft Support:What can we help you with?https:\/\/support.microsoft.com\/en-usContact support         http:\/\/windows.microsoft.com\/en-us\/windows\/contact-supportAlso: https:\/\/partner.support.services.microsoft.com\/en-au\/contact\/menu\/software\/windows\/setup\/"]},{"symptom":"Bug?        I reinstalled Windows cause I tought something ate my Icons but there it come again after fresh new start it's there again can U pls tell me is that standard Icon? I can't post a Pic here so I can't show it. Tnx","solutions":["Here's how to attache a screen shot: https:\/\/answers.microsoft.com\/en-us\/feedback\/fo...","Ok I just Used program that creates link for it ;) https:\/\/prnt.sc\/qmjrp4 here U go this is Common in Program and Features as well which I was dieing to ask why does some Recognised Company Icons dissapear for some reason!? And I just reinstalled Windows from USB Setup.exe maybe I should have booted USB? Adn i didnt know how to Format both Hard Drives and Boot from USB. Can anyone help pls thanks very much :)","I don't see anything wrong with the image you included. The icon you have circled is the correct icon for \"System and security\".","Well that is abit odd cause it should have some shield Icon or something and not a blank icon or Icon that ussually presents something that is missing. For example Discord is a very known Company but I had same Icon for the Program as for \"System and security\". If U are telling the truth than Ok but it should be different. Tnx","My Troubleshoot section in Control Panel looks just the same as yours, the icon you circled is the same.","Here I show U what I meant why does Discord have blank icon as well as screenshot program very common and it doesn't get fixed I mean idk is it fabric \"Bug\" or Publisher was lazy to cover theyre logo in Program Files? I tryed once reinstall same story but some people know the answer and I wish to hear it. Tnx  https:\/\/prnt.sc\/qmqgfj","No idea, just the way it is I suppose.Hopefully \"someone who knows the answer\" will answer you in this thread.","You're looking at Control Panel and not Settings. Settings will have the shield. Control Panel has what you see."]},{"symptom":"Newly built PC Windows 10 - No Brightness Control        The monitor is iiyama ProLite E2483HS connected with HDMI to new PC with licenced and registered copy of Windows 10. The controls on the menu on the monitor are greyed out, so I cannot adjust them on the monitor. I have reverted to the Generic monitor is Windows 10 and selected the option to delete the previous (up to date) driver from the iiyama.Still no Brightness slider.  Windows is hurting my eyes.How do I either get the slider to appear or let the monitor have control?  I have no problem with doing registry edits if it comes to it..","solutions":["Hi Andrew. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.B1) There are changes in Brightness settings as of Version 1903, with sliders now only in Settings > System > Display and in the Action Center via Windows (flag) key + A.2) See fixes for brightness controls not working: https:\/\/fossbytes.com\/how-to-fix-windows-10-bri...https:\/\/www.kapilarya.com\/fix-cant-change-scree...https:\/\/www.tenforums.com\/tutorials\/44213-adjus...https:\/\/www.trickyways.com\/2019\/06\/fix-screen-b...https:\/\/windows101tricks.com\/windows-10-brightn...3) Update the Display driver from the PC or Display adapter maker's Support Downloads web page for your exact model number, HP Serial Number or Dell Service Tag - from the sticker on the PC.While there check also for newer chipset, BIOS\/UEFI firmware (very important), network, sound, USB3 and other drivers, comparing to the ones presently installed in Device Manager reached by right clicking the Start Menu.If this doesn't give you the latest or ideal driver for what you need, compare it to the driver offered by the Intel driver update Utility here:http:\/\/www.intel.com\/content\/www\/us\/en\/support\/... or the Nvidia Update utility here: http:\/\/www.nvidia.com\/Download\/Scan.aspx?lang=e... or the AMD autodect utility here: http:\/\/support.amd.com\/us\/gpudownload\/windows\/P... For Display issues one fix that is working is to Roll back or Uninstall the Driver on the Display Device > Driver tab, restart PC to reinstall driver.You can also try older drivers in Device Manager > Display device > Driver tab > Update Driver > Browse > Let Me Pick.Then you will know you've tried everything in addition to Windows Update drivers.4) If this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Update History, then uninstall them from the link there, and immediately check for these again and hide with the Hide Updates tool explained here: https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... You can also go into Repair Mode by whichever method works here: https:\/\/www.tenforums.com\/tutorials\/2294-advanc... to use the new Uninstall Updates button in Advanced Troubleshoot Options:https:\/\/pureinfotech.com\/uninstall-updates-adva... You can also use System Restore from within Windows or the above Repair Mode to get back before the problem began, then check for Updates with the Hide Update tool and hide them:https:\/\/www.windowscentral.com\/how-use-system-r... 5) If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....If that doesn't work you can also Go Back in Repair Mode as shown here: https:\/\/www.tenforums.com\/tutorials\/2294-advanc...6) Many appreciated previously having Sliders also in the Power Plan settings which could be set separately for Plugged In and on Battery. If you're wanting this feature back you can express your opinion on this to Microsoft via the Feedback Hub app in Start Menu, where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems.If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to rate my post, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]}]}