{"windows":[{"symptom":"Windows 10 Performance issue        Hello there,My Windows 10 PC , was running fine for months, but from last week abruptly started  slowing, as soon as windows logs on, no internet connection(connected via Wifi) even though i could connect through laptops and phone devices,commands @ command prompt isnt executed system is slower all of sudden, so reinstalled the os and apps , it was working fine until yesterday, where issue started appering once againbut at the same time if i log on safe mode, everything is working fine , internet system performance is just normal like beforeis there a way to rectify this issue and should i produce any logs from Events ?","solutions":["Hi, Aftermathatrocity My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Configure a clean Windows startup and then check if your PC is still slow and you can add the programs in parts to see what is causing problems.https:\/\/support.microsoft.com\/en-us\/help\/929135...","Thanks for replying , will do that and post the response","I did as mentioned in the article but, system clean config isnt working, after clicking OK , there was no prompt to restart the PC and task manager just got stuck.everything is working fine in the safe mode including the internet connection, even now im typing all these from safe mode","I recommend that you repair Windows completely before you must make a backup of your personal files, third-party software will be removed. Here the link to download the Windows ISO.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","if reset the pc using in-place upgrade will i lose the data in D drive which has personal and other files like family pics etc","Updates are made on drive C: you still have the option to keep your files"]},{"symptom":"HDMI cable is connected and shows picture but sound comes out of the lapotp        Since I updated to Windows version 1909 from 1809, when I plug my laptop into the tv the picture will show but the sound will play through the laptop speakers. The sound was working fine before the 1909 version update. I've tried many things to fix it but nothing seems to work. Should I uninstall the update?","solutions":["Hi Giovanni, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.I can recommend you to rule out if the problem comes from third-party drivers or programs that may be interfering with the operations or processes, after the update, start Windows through a clean boot, apply the process again and check if the problem persists, if it does not happen go to the section >> How to determine what is causing the problem after you do a clean boothttps:\/\/support.microsoft.com\/en-us\/help\/929135...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M.","Thanks for your help however I tried the clean boot and yet the sound still plays through the laptop speakers. I'm going to uninstall version 1909 and go back to version 1809 until they fix the issue.","Hi, I understand, if in that version it worked without problems, surely that solves it.Regards"]},{"symptom":"Windows 10 updated but none of my apps?        Has anyone else had this problem? Windows 10 updated automatically, but somehow none of the apps on my laptop were updated including the Microsoft store. Whenever I try to open any app such Paint 3D, Sketchbook, or even Calculator a box pops up saying that I need a new ms-whatever the app is-link to open the app. Help Please!","solutions":["Hello PaunchySnail278, I'm Didi, an independent advisor. One of the solutions to fix the \"You’ll need a new app to open this ms...\" problem is to go to the Microsoft Store and install Microsoft Tips, you can find it in the store with the search bar.Regards, Didi","When I try to open Microsoft store, it starts as if it's downloading or upgrading, but then stops.","Hi PaunchySnail278, Follow the methods provided by Greg Carmack on this thread, scroll down to see his answer :https:\/\/answers.microsoft.com\/en-us\/windows\/for... Regards, Didi"]},{"symptom":"Connectivity problems        After a while the good old connectivity issues are back again. Instead of the normal Internet there is either NoNet (timeouts, reset or closed connections) or SlowNet (takes forever to connect). Also, some pages I know for years suddenly are reported ''insecure''.","solutions":["Hi, BaltaisGulbis My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps to repair your Internet connections: Enter the Start menu or by pressing the Win + I key combination, open the Settings and click on the Network and Internet option. Once there, we select the Status option from the menu on the left side and, within the configurations and options that are loaded in the right panel, we have to look for the restoration of the network. When you click on this option, it will show us a new window from where we can restore the network in Windows 10. In this way, all network adapters will be removed and reinstalled, and the original configuration of other network components will be restored. net. This implies that if we were using some software, such as a VPN client or virtual switches, we will have to reinstall them.A process that the system performs automatically by clicking on the Reset button that is now displayed in Network Reset in Windows 10 settings. It is normal for the process to not take long, although we must wait until the end completely and restart the computer to continue with the network configuration in Windows 10 as we have done so far.https:\/\/www.kapilarya.com\/how-to-reset-network-...https:\/\/support.microsoft.com\/en-us\/help\/10741\/...You can also check that your drivers are updated. https:\/\/support.microsoft.com\/en-us\/help\/402844...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","So network is self-misconfiguring and needs to be reset once in a while? Is there a more permanent solution or will I need to reset every time this happens?","I recommend that you repair Windows completely before you must make a backup of your personal files, third-party software will be removed. Here the link to download the Windows ISO.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Some bad publicity for the OS, gives an impression it is permanently self-misconfiguring. By the way, those repairs are not quick or easy and I would absolutely hate to do them every second week.","When repairing Windows completely, do not believe that it will get damaged so quickly","Connections get damaged even more quickly - I mean NoNet (when you cannot connect at all). SlowNet (you are ''connected'' but the connection is so slow that in fact there is no connection) and FailNet (when downloading of even a small file takes a day or is not possible at all because it keeps failing due to ''network errors'') are, as far as I know, permanent and unfixable.Last time I reset the OS was a month ago and I am NEVER going to do this again, not on this machine. Because it does not fix anything, just takes time and nerves as if people had nothing to do.","It also depends on the provider - with a good provider you never have this problem, or you only have it once in a while, and then repairing the connection is enough. Some other providers give you SlowNet that is not good for anything more than browsing, and the lowest class providers give you NoNet. In the world as it is, if you have a laptop and use it in several different places, this problem will always be present and I can live with it - as long as it does not get too serious.","Hi, Try these commands. Go to CMD and type, ipconfig \/flushdns Also try to release and renew the IP address. (Release the IP) ipconfig \/release (Renew the IP) ipconfig \/renew"]},{"symptom":"Fehlermeldung Datenträgercontroller: Die derzeit aktive Partition ist komprimiert        Hallo bei meinem Upgrade von Windows 7 auf Windows 10 kommt die eine Fehlermeldung :,, Datenträgercontroller: Die derzeit aktive Partition ist komprimiert   ``Wie kann ich vorgehen um diese Meldung beim Upgrade zu beseitigen und meinen Umstieg auf Windows 10 zu ermöglichen ???Danke für die Hilfe ","solutions":[]},{"symptom":"hyperx cloud 2 mic wont work after windows 10 free update        so i saw that windows 10 is now free.. so i did an update from my old version of win 10 to the new one.. it my mic just stop working... it shows it on the list also on the device manager and also in communication in sounds.. but its not working.. if i do a listen to this device.. i can hear myself .. witch means the mic is fine and also not muted... i did everything from updating drivers reinstall them plug them info onther usb. im about to get my older version back.. i just hope it gonna work again after years","solutions":["Windows 10 isn't free you need a qualifying licence. The updates to Windows 10 have always been free for new versions if you already have an activated version of Windows 10.What version and build do you have now. Type winver in Search and select the top result, post a screenshot of the result or quote the version\/build in full.It could be your drivers were updated during the update and need rolled back to use the old driver.","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Let us reset the driver and check. Please go to Device Manager Right click on the driver for this Mic and select Uninstall. Restart the PC. This will reinstall the driver. Then check the Mic."]},{"symptom":"How to enter into BIOS and Boot Manager in Lenovo ideapad 520?        How to enter the BIOS menu and How to enter Boot Manager in Lenovo Ideapad 520","solutions":["The bios is often the Del key or F2 during boot before windows loads. What does Lenovo advise?","Hi rashmiranjan1 Do you want to change the boot order, so as to boot from say a flash drive? If so, on the initial Lenovo screen, if you repeatedly press F12 or Fn + F12 does that give you a temporary boot menu to choose from?If not, then in BIOS, look for a enable USB Boot option, then move that USB drive to the top of the boot order list . . ."]},{"symptom":"how do i find a blank page to write and print a letter on microsoft word        want to find and write letter on microsoft word","solutions":["If you go to the Start menu and select the Word icon it should open Word with a blank page, is that what you want?","Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Here is an article which explains how you start a new blank document: https:\/\/support.office.com\/en-gb\/article\/create...Once completed you will be able to print by selecting the File menu at the top left of the Windows and then Print.Regards, Ross"]},{"symptom":"Microsoft Store Stuck on Starting Download and Pending        Recently, I opened up my Minecraft and I realized that it was taking forever to load compared to how quickly it usually opens. After a couple tries, I decided to uninstall and reinstall the game, but now I can't even reinstall the game. In the Microsoft Store, when I try to install the game (and I've tried other apps as well) it is stuck on starting download. I've restarted my router, and I've ruled out that my connection isn't the problem. I've signed into another account and tried downloading the game and that also didn't work. I've ran wsreset, reset the Microsoft Store in settings, and ran the troubleshooter and nothing has been working. If anyone has a fix please let me know, thanks.","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command prompt DISM \/Online \/Cleanup-Image \/RestoreHealth Run these commands on the command prompt to restart windows update services net stop bits net stop cryptsvc net stop wuauserv net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start bits net start cryptsvc net start wuauserv net start msiserver After successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig 2. On the system configuration window go to the services tab 3. Tick on hide all microsoft service so that this won't be affected 4. Choose to disable all services 5. Next, go to the startup tab and on the window choose to open task manager 6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok 8. A prompt to restart the computer will show up, choose to restart This should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to download the game again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo... 2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept. 4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)"]},{"symptom":"Excel cannot access <a subfolder>. The document may be read only or encrypted.        The above error started today. It occurs when Personal.xlsm attempts to launch, whether it is in the background when I open excel files that contain macros or if I launch Personal.xlsb from the XLStart folder. The <item in question> is a subfolder, not a file.I have used and saved files to this folder for years. I can navigate to the folder and open files in the folder. Macros in Personal.xlsb do not run.My account is an administrator account.","solutions":["Hi EliBernard and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.\"Access Denied\" or other errors when you access or work with files and folders in Windows.https:\/\/support.microsoft.com\/en-ph\/help\/262367...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Thank you for this recommendation, but the article only has resolutions for Win 7 and Win 8. Im running Win 10.","Hi EliBernard, Here is the step by step tutorial for \"Access is denied Windows 10 error\" https:\/\/windowsreport.com\/access-is-denied-wind...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I attempted every item possible in this thread with no change in my issue. I tried the Reset Permissions tool, but the zip file is password protected and the password is not provided in this thread.My OneDrive settings UI is different from that in the thread - I have no options to set to PC Only as in the display.I am a home user with Admin permission and full access to the folder in question. It is no on a network. It is a local drive on my device.","Hi EliBernard, I will release the question for other experts come to give his opinion, I am sorry not to find the problem.Thanks."]},{"symptom":"running 1 all in one pc with 2 extra monitors        HiI have go a hp all in one computer running windows 10 with a hdmi socket at the rear, i am trying to add 2 monitors from it i have brought a 1x4 hdmi splitter and 2 dvi to hdmi leads for the monitors.i have plugged them all in but 1 monitor is showing the same screen as the other monitor is there a way that i can have the 2 extra monitors as 2 separate so that i can have different files\/documents on the main pc and on the 1st extra monitor and on the 2nd extra monitor.is this possible?","solutions":["Hi Dean If you only have one video output on that all-in-one, then the same Desktop will appear on all external monitors, because the splitter only splits one output signalTo be able to have 2 separate desktops, you need to have 2 outputs on your PC . . .What is the exact Model No. of your HP All-in-One - that will be printed on a sticker on the back of your PC . . .","Hi HP Model 22-c0052naThanksDean","Hi Dean I am sorry, that HDMI is the only video output on that device, it does not have Display Port or any other video port, so I am sorry, you will not be able to have 2 separate Desktops on external monitors . . ."]},{"symptom":"Connecting ethernet        Instead of using wifi for laptop, can I connect it to the ethernet instead?  Also, will computer run faster by doing this?","solutions":["Hi nancid Yes, you can unplug the Ethernet cable any time you like, Windows will automatically switch back to WiFi when you do that . . ."]},{"symptom":"Can’t download in ie11        I have a brand new windows 10 desktop. While installing software. I noticed i can download from edge but i cant from ie11. When i try to install from ie11.  It pops up with open save or cancel. edge opens just fine.  Even i save file from ie11 to desktop. It asks what i want to open the file with.   ","solutions":["Hi, DustinDawson My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try reinstalling internet explorer 11 https:\/\/support.microsoft.com\/en-us\/help\/318378...","Hi, DustinDawson My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try reinstalling internet explorer 11 https:\/\/support.microsoft.com\/en-us\/help\/318378...Yes i have tried reinstalling ie11","Try to follow these steps to repair your Internet connections: Enter the Start menu or by pressing the Win + I key combination, open the Settings and click on the Network and Internet option. Once there, we select the Status option from the menu on the left side and, within the configurations and options that are loaded in the right panel, we have to look for the restoration of the network. When you click on this option, it will show us a new window from where we can restore the network in Windows 10. In this way, all network adapters will be removed and reinstalled, and the original configuration of other network components will be restored. net. This implies that if we were using some software, such as a VPN client or virtual switches, we will have to reinstall them.A process that the system performs automatically by clicking on the Reset button that is now displayed in Network Reset in Windows 10 settings. It is normal for the process to not take long, although we must wait until the end completely and restart the computer to continue with the network configuration in Windows 10 as we have done so far.https:\/\/www.kapilarya.com\/how-to-reset-network-...https:\/\/support.microsoft.com\/en-us\/help\/10741\/...You can also check that your drivers are updated. https:\/\/support.microsoft.com\/en-us\/help\/402844...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","If you've save the downloaded file to the desktop, what is its name? Especially tell us what its extension is. From where did you download it?","this is what i get when i got to java and try to save it to the desktop. The first time it fails, i always have to hit retry. JavaSetup8u231_exe&BHost=javadl_sun_com&File=JavaSetup8u231_exe&AuthParam=1578433863_992c3117b6d5ea0872639fa697f8cc55&ext=_exeIf i try in edge it downloads just fine. JavaSetup8u231.exe ","I am not losing internet. do you really think this will help? about willing to try.","Follow these steps: Press the Start key and type the word CMD or Powershell, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanu p-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/929833...","Follow these steps: Press the Start key and type the word CMD or Powershell, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanu p-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/929833...I tried all of that.  When i download a file it still gives me the same type file.  Still not working. ","I recommend that you repair Windows completely before you must make a backup of your personal files, third-party software will be removed. Here the link to download the Windows ISO.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","If you download a file and it gives you any type of file, you definitely succeeded in downloading it.So please be clear. Answer *all* the following questions: Exactly what do you mean by \"Can’t download in ie11\"? What is the extension of the file you downloaded? What extension did you expect it to be? From what site did you download it?"]},{"symptom":"Law firm Using Micro Craft Verdict 10 looking to switch to another billing program        Our law firm is using Micro Craft Verdict 10 and we are looking into upgrading to a newer billing program since Verdict no longer has updates and is quite dated. I was wondering if anyone has used Verdict and switched to another program and, if so, what program? Also, how was the transition? There are so many other programs to choose from and I am having a hard time finding a simple yet effective program. Thank you! I look forward to any responses.","solutions":[]},{"symptom":"Can't Get Out of S Mode        Got a new laptop for Christmas, and just started it up yesterday. I went to install Chrome (obviously) and the window popped up for me to switch out of S mode. I did so without issue and shut the laptop when I was done for the night.Today I opened it back up and S*** Mode has been reactivated and is now giving me an error when I try to change it back. I am locked out of everything I installed yesterday and I'm fuming. Can anyone help me get around this?","solutions":["Hi Emma, You might want to check this article for full guide on how to get out of S mode: https:\/\/www.windowscentral.com\/surface-go-how-u...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","> Windows 10 in S mode FAQ - Windows Help  FYI: You're not the only one with that problem...Seems that there are some problems on the Microsoft's servers side.. You might want to try contacting Microsoft here:  https:\/\/support.microsoft.com\/en-us\/help\/4051701\/global-customer-service-phone-numbersContact Us – Microsoft Support","Thank you for trying but if you read my initial query you would know that I already know how to switch off S mode. The problem is that when I did, it reset the next day and is now displaying an error message when I attempt to do it again. It's been like this for nearly a week now and I'm getting impatient.","Look at the previous post from Smeed and contact local support.","EmmaPolcynThanks for completely ignoring my post (Can't Get Out of S Mode (Ṣmeed Replied on January 4, 2020))"]},{"symptom":"Windows ten install        We went from windows 7 to 10. my computer was fine until out IT guy installed the upgrade. The upgrade we were FORCED to install! Now my computer keeps crashing (17 times in less than an hour) I'm getting an error message that says \"Watchdog violation\".  Am I going to have to buy a new computer ( Microsoft's plan all along?) as out IT guy was hinting at. Is there a fix? All of the people in my office are getting the same upgrade. This could be a significant expense. How bad would it be to NOT install windows 10? ","solutions":["You are not forced to upgrade you can continue using Windows 7 but support ends on 14th January. Buying a new PC would probably be better if your PC is not capable of running Windows 10 correctly.It sounds like it is a business decision to me.If you want to try the troubleshooting route then you need to quote the full spec or make and model of the PC you are using.","Hi Kristin On Community, we are just users like yourself helping each other, we are not Microsoft Employees . . .No-one is being forced to upgrade to Windows 10, it is true that support for Windows 7 will end next week, however, that does not mean that Windows 7 will stop working, that just means that you would not receive security updates.While Microsoft doe advise everyone to upgrade, the other choice would be to install a 3rd party anti-virus and keep Windows 7 . . .Most likely when you upgraded, that either corrupted a device driver or caused an incompatibility on your system, did you check to see if Windows 10 device drivers were available fro your PC?To diagnose the underlying issue, I need to analyse your Mini-dump file(s): Open Windows File Explorer Navigate to C:\\Windows\\Minidump Copy any minidump files onto your Desktop, then zip those up Upload the zip file to the Cloud (OneDrive, DropBox . . . etc.), then choose to share those and get a share linkThen post the link here to the zip file, so we can take a look for you . . ."]},{"symptom":"Replacement Graphics Card        Hello, I’m trying to repair an elderly friend’s desktop PC and hope someone can help. In early November Windows Update supplied a driver update for the graphics card, AMD\/ATI Radeon HD5570 DDR3. Straight afterwards the display screen was corrupted with block colours and bars, but still readable. When he restarted the PC it ground to a halt with the following notice “video TDR stop failure atikmpag.sys”, one of the graphic card’s drivers.Despite us going through all of the recovery options offered, nothing worked. They either wouldn’t run or tried to run and then came up with a message they couldn’t complete. So, for instance, we couldn’t roll back the driver, or even enter Safe Mode. I have no idea why.Eventually out of desperation we reloaded Windows 10, which initially got the computer working but still with the corrupted screen. However, when the driver update was installed again, we were back to square one. We eventually found the only thing that worked was to delete the driver file atikmpag.sys which allowed the computer to start normally, but with the corrupted screen. We have tried installing other drivers for the graphics card, but nothing works, and we can’t get back to the ones prior to the Windows supplied Driver Update.I think that the only option is to replace the graphics card with one that is still compatible with Windows 10 ver 1909. My problem is I have no idea which would be the best older or second-hand graphics card to choose. I think it fits into a PCI Express x16 slot.The desktop PC specifications are:Packard Bell iXtreme (PT.U36-PV.U36)CMOS\/BIOS American Megatrends 2009Windows 10 ver 1909 64-bitGraphics card, AMD\/ATI Radeon HD5570 DDR3http:\/\/www.packardbell.com\/pb\/en\/GB\/content\/downloadAll other devices in Device Manager are fine Please can anyone offer some advice or suggestions as to the best suitable new graphics card. The present one has an on-board fan powered through the PCI slot. The power supply unit does not have any spare cables to allow a connection to a more powerful fan like some graphics cards have. Hope you can help, thank you.","solutions":["Hi Plainsman, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Your device is too old as it looks like. To invest in a new card is not a good idea. However anything with DDR3 would work like this.https:\/\/www.amazon.com\/MSI-Radeon-R72402364P-Pr...I am using a GDDR5 model of the same and it is working great. Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","Thank you for your advice Sumit.  I knew the same graphics card wouldn't work again, I was after a different model or brand like you have suggested.  As I am in the UK, I would purchase it here.I have seen this model on Amazon.co.uk:https:\/\/www.amazon.co.uk\/ASUS-Graphics-Express-128-Bit-Dust-Proof\/dp\/B00FSC50N2\/ref=sr_1_1?keywords=AMD%2BRadeon%2BR72402364P%2B2GB%2BDDR3&qid=1578494552&sr=8-1&th=1Just a few queries on it.  The slot is PCI Express 2.0 on the PC, so hopefully PCI-E 3.0 is still compatible?  It says 128 bit, is this okay for a Windows 10 64 bit PC?  The screen has a VGA connection cable, is this okay with the DVI-D connection?  Basically do you think this one would do the job?Thank you.","Hi, PCI 3.0 is backwards compatible hence it would easily work with PCI 2.0 x16 easily.It has both DVI-D and VGA so you can use any of the same."]},{"symptom":"'We’re updating OneNote \/ Calculator \/ OneDrive (or any winodow App). It should be ready to use again shortly.        I am constantly getting 'We’re updating OneNote (or any winodow App). It should be ready to use again shortly.I have tried checking Window Updates but starting to get really annoying!","solutions":["Hi, JamesPack_939 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Sound problems with LG ultrawide        I have connected my HP laptop to an LG ultrawide screen but theres no sound when I play media other than ITUNES. i ran a troubleshoot and now the device doesnt show as LG","solutions":["sorted. there are no speakers only output for headphones.","Hi Loneloof Glad this is resolved, do you mean there were no speakers on that monitor, just a headphone socket?"]},{"symptom":"Explorer.exe keeps crashing        For the past few weeks, explorer.exe has been crashing continuously. I've seen some forum posts about this, and I've followed what they've said. I've updated my drivers, uninstalled unneeded ones, and uninstalled my AVG Antivirus. However, it's still been crashing. Is there a fix?","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,When does explorer.exe normally crashes? Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command prompt DISM \/Online \/Cleanup-Image \/RestoreHealth After successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the explorer.exe1. Go to start menu\/search msconfig 2. On the system configuration window go to the services tab 3. Tick on hide all microsoft service so that this won't be affected 4. Choose to disable all services 5. Next, go to the startup tab and on the window choose to open task manager 6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok 8. A prompt to restart the computer will show up, choose to restart This should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up.If the same behavior occurs, I'd recommend creating a new user profile as it may be due to a corruption within the user profile.1. Search for netplwiz on the start menu 2. Click on Add 3. Choose to sign in without a Microsoft account 4. Fill up the form and choose finish\/done 5. Highlight the newly created user account from the user account\/netplwiz window6. Hit properties and set it as an administrator 7. Sign in the account and see if the same behavior occurs In the event that it is still the same, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10. To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo... 2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept. 4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","Hi Roshi,In the Search type in \"View all problem reports\" and press Enter.Right-click on Windows Explorer crash details and click view technical details.Post a screenshot of that Window.","Hi Gary, I've read through your reply and I haven't been able to do any of this. Everything relating to explorer.exe (Taskbar, desktop, file explorer) has been crashing about every 10-30 seconds. This means I can't open my start menu, search for programs or files, or use my taskbar easily. Re-downloading Windows 10 is the only option that can be done, but I don't want to take all of the time to do that. Are there any other solutions you would recommend, or should I just re-download Windows 10?","Download and Install the Media Creation Tool from this link  http:\/\/windows.microsoft.com\/en-us\/windows-10\/media-creation-tool-install, choosing Download Tool Now, install the tool, open it and choose Upgrade this PC Now. .   This will save your files and apps while bringing you up to the latest version by the most stable method.  It will also bring all of your Updates current and solve most problems since it reinstalls Windows. ","I am unable to send a screenshot, but I have the information.DescriptionFaulting Application Path: C:\\Windows\\explorer.exeProblem signatureProblem Event Name: BEX64Application Name: explorer.exeApplication Version: 10.0.18362.449Application Timestamp: d3046e6bFault Module Name: SHELL32.dllFault Module Version: 10.0.18362.535Fault Module Timestamp: b3180897Exception Offset: 0000000000138cf6Exception Code: c0000409Exception Data: 0000000000000007OS Version: 10.0.18362.2.0.0.768.101Locale ID: 1033Additional Information 1: 1f4bAdditional Information 2: 1f4b6f32b6a3682e63e4ece025e3c167Additional Information 3: e6e5Additional Information 4: e6e5bf89fda4d1666bcb81360469f295","Hi, Yes. Reinstalling windows would be the quickest way to resolve this. You do this by accessing the windows recovery pageYou may access the page by going to the sign in screen press and hold the shift key and press the on screen power button to choose the restart. It will then reboot and direct you to the windows recovery environment.I would recommend going into the windows recovery environment to use access multiple troubleshooting options.Another alternative is, Start your computer, once the computer goes to the windows logo screen press and hold the power button for 5-10 seconds to shut it down completely. Do this for 3-5 times to force access the recovery environment.a) System Restore Go to Troubleshoot, advanced option, system restore (This would roll back the system's configuration to a specific time and date)b) Reset this PC In the event that it still fails, I would recommend reinstalling the operating system. The option enables you to keep your files although uninstall programs that did not came with the system.Troubleshoot - Advanced Option - Reset this PC These are the options that I would suggest using in the recovery environment. But before proceeding with this, I may need to advise trying to first create a new user profile and see if the same behavior would occur.1. Search for netplwiz on the start menu 2. Click on Add 3. Choose to sign in without a Microsoft account 4. Fill up the form and choose finish\/done 5. Highlight the newly created user account from the user account\/netplwiz window6. Hit properties and set it as an administrator 7. Sign in the account and see if the same behavior occurs","Apparently shell32.dll is a component of Windows and it is probably something else driving it into crash.Have you tried creating a new user account to check if the issue is there?","For the past few weeks, explorer.exe has been crashing continuously. I've seen some forum posts about this, and I've followed what they've said. I've updated my drivers, uninstalled unneeded ones, and uninstalled my AVG Antivirus. However, it's still been crashing. Is there a fix? Hello,Suggest you to run System File Checker scan:1. Search for 'command prompt' using Cortana or Windows Search.2. From results, right click on Command Prompt and select Run as administrator.3. Type sfc \/scannow command and press Enter key.4. Let the command complete and then reboot the machine.If issue still persists, perform clean boot:https:\/\/support.microsoft.com\/en-in\/help\/929135\/how-to-perform-a-clean-boot-in-windowsAlso refer this fix:https:\/\/www.kapilarya.com\/fix-file-explorer-not-working-in-windows-10Let us know if this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP. ","Last night, I reinstalled Windows 10. However, the problem persists. I don't want to lose all of my files in a pc reset, but I'm positive that at least one of these solutions would work.","Fingers crossed!"]}]}