{"windows":[{"symptom":"how to conect with wifi printer        Trying to connect to a wireless printer","solutions":["Read through this:https:\/\/support.microsoft.com\/en-au\/help\/17420\/windows-printer-problemsCheers."]},{"symptom":"system backup        When I did a system backup to an external hard drive, the backup now shows up in what was my D drive. What did I do wrong?","solutions":["When I did a system backup to an external hard drive, the backup now shows up in what was my D drive. What did I do wrong?You must have selected the wrong drive letter."]},{"symptom":"Start-up Repair couldn't repair your PC        Hi, my PC was unresponsive so I restarted it.  Now I keep getting the Start-up Repair page with the message Log file: C\\WINDOWS\\System32\\Logfiles\\Srt\\SrtTrail.txt.  I have tried resetting it,and using a back-up usb but to no avail.  I have a HP Pavilion running on Windows10, and would be grateful for any help.  Thanks","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,I would recommend going into the windows recovery environment to use access multiple troubleshooting options.Start your computer, once the computer goes to the windows logo screen press and hold the power button for 5-10 seconds to shut it down completely. Do this for 3-5 times to force access the recovery environment.a) Startup repairGo to troubleshoot, advanced options, startup repair (This would attempt to repair the system)b) System RestoreGo to Troubleshoot, advanced option, system restore (This would roll back the system's configuration to a specific time and date)c) Safe modeGo to Troubleshoot, advanced option, startup setting, click on restart and this would provide you multiple options in terms of booting up the computer.Choose to boot into safe mode, once accessed you could either uninstall the update or check if all your drivers are up to date. A clean boot under safe mode would also help to make sure no softwares are affecting the system1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartd) Reset this PCIn the event that it still fails, I would recommend reinstalling the operating system. The option enables you to keep your files although uninstall programs that did not came with the system.Troubleshoot - Advanced Option - Reset this PCAlternative to reinstalling windowshttps:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/support.microsoft.com\/en-in\/help\/400073...Let me know how it goes. :)","Thanks for the quick reply.  When I shut down the PC and restart it  goes straight to the Automatic repair page and I do not get the Windows  loge screen.","Hi Ladyp66 My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.1. Perform System Recovery Press the Windows logo key + X on your keyboard. Select the Power option > hold the Shift button and select Restart.restart + shiftSelect Troubleshoot > click Advanced options. Click System Restore > click Next or Choose a different restore point if it’s the first time you’re doing a system restore.Select Next > choose the desired system restore point > click Close. Press Next in order to proceed with the process. 2. Repair the error using the Command Prompt Select Troubleshoot > click Advanced options. Choose to open the Command Prompt. In the Command Prompt, type the following commands hitting the Enter button after each.bootrec.exe \/rebuildbcd bootrec.exe \/fixmbr bootrec.exe \/fixboot Then perform a check to each partition you have installed on your PC, using the commandchkdsk \/r c: Hit Enter after inputting the command, then proceed to check the next drive by changing the letter c: to d:, e: and so on.Close the Command Prompt and restart your computer to see if it fixed the issue. 3. Verify device partition Select Troubleshoot > click Advanced options. Choose to open the Command Prompt. Type bcdedit in the Command Prompt and hit Enter If the displayed value is not partition=C: then you need to perform some changes.Input the following commands and hit Enter after each one. bcdedit \/set {default} device partition=c: bcdedit \/set {default} osdevice partition=c: Afterward, you can restart your computer and see if it fixed the issue. 4. Check the system boot device through the BIOS Restart your computer and open the BIOS. Find the Boot section in your specific BIOS version. Make sure to have your Primary Boot Device set to your hard drive If you have more than one hard drives, make sure to select the one containing Windows.Save changes and restart your computer to see if it fixed the issue. Hope this helps.","Hi Jon, thanks for the above.  When I restart the computer it goes straight to the repair page, and thus I am unable to press the windows key and X and carry out the above. I have managed to get it onto the startup menu ( by pressing the windows key and X as soon as it started up) if that's any help?","Try solutions 2 and 3 once you get Windows started.","Unsure which option to go with on start menu?  Diagnostics\/boot menu\/computer setup\/system recovery\/network boot\/utilities\/run UEFI application??  Gut instinct is system recovery but don't want to exacerbate the problem.. ","Ran system recovery but did not work successfully.System restore failed to replace the file (C:\\Program Files\\WindowsApps\\828B5831.HiddenCityMysteryofShadows_1.29.2900.0_neutral_ with its original copy from the restore point.An unspecified error occurred during the system restore (0x80070780)However computer has started ok.  Tried steps 2 and 3 above - the bootrec commands were not recognised as an internal or external command,operable program or batch file..  Running step 3 gave the following result - the boot configuration data store could not be opened.  Access is denied.Will see how it runs.  Thanks for the help.","Hi LadyP66 How is your PC behaving? Jon.","Hi Jon, its going well, thanks for asking.  Don't really know how or why but fingers crossed...Many thanks for your assistance."]},{"symptom":"No option to create videos in the Photos app November 2019        I just got a shiny new laptop, but my beloved app \"Movie creator\" was of course discontinued. Looking around I was reassured that the Photos app will serve the purpose just as well. Only... when I start the Photos app, there is no button or icon that will let me record or edit a video. I have clicked on everything in the app, but there is nothing. I want to use my webcam to film myself and post it on Youtube. How the fudge am I supposed to do that now? Sorry for being a stupid old bat.Yes, I have the latest version of Windows 10: 1909 (November 2019).","solutions":["Hi AnnM If you just need to film yourself on Windows 10, you can use the built-in Camera App in WIndows 10, click your Start Button, then just type camera and hit Enter to open that AppWith regards to the movies option being missing form the Photos App, is there no 'Create' button at the top right of Photos?If not, please follow the steps provided by Andre Da Costa on this thread; https:\/\/answers.microsoft.com\/en-us\/windows\/for...","No there is no \"create\" button in Photos. I had a quick look at the page you suggest but it refers to update issues of a much older release of Windows 10. I don't see the point, I have the latest release already?!I will try the camera app. Thank you for the suggestion!","Hello AnnM! Can you please share the version number for your Photos app (found under ... > Settings)? "]},{"symptom":"Upgrading from Vista to windows 10.        Greetings, I work in a small business that operates on windows vista. I want to upgrade all of these computers (roughly 10 of them) to windows 10. What is the process of doing so, and what would it cost. Thank you for your time and advice.","solutions":["You can not upgrade from Vista to 10. The only to get to 10 is by doing a clean installation of it.","First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700@@@@@@@@@@@@@@@@@@@@@@@@@@@@You may or may not be interested in this method:What is the Microsoft Open License Program?Open Value Open Value is the recommended program if you have a small to midsize organization with five or more desktop PCs and want to simplify license management, manage software costs, and get better control over your investment. It also includes Software Assurance, providing access to valuable benefits such as training, deployment planning, software upgrades, and product support help you boost the productivity of your entire organization.Cheers."]},{"symptom":"Hang on after starting        Hello! Before few days I had an issue, here's the post. After that I faced once and now again hang on after profile loading. I needed to restart few times, one time even the power button didn't react so I removed the power supply fro the slot and put it again. The hang is this: the icons appear but the desktop clock  (additional installed program) doesn't start. Windows Explorer is unusable. After 6-7 minutes things back to normal. Here are the Error messages in Event Viewer in order they happened:A timeout was reached (30000 milliseconds) while waiting for the Sync Host_2d3e0 service to connect.The Delivery Optimization service hung on starting.A timeout was reached (30000 milliseconds) while waiting for the Google Update Service (gupdate) service to connect.The Google Update Service (gupdate) service failed to start due to the following error: The service did not respond to the start or control request in a timely fashion.All above in 2-3 minutes. After 4 minutes the thing normalized with:The start type of the Background Intelligent Transfer Service service was changed from start request to automatic start. (some words were in my language so excuse bad translation)Geolocation positioning is enabled.Also I got notification that Windows Defender is not enabled but I checked and it was.P.S. I noticed 3 Warrning messages in Event Viewer:The driver \\Driver\\WudfRd failed to load for the device SWD\\WPDBUSENUM\\...............................................and 3 Information messages after each:WUDFPf (part of UMDF) did not load yet. After it does, Windows will start the device again.P.P.S. I cleaned registry with CCleaner, deleted Google Update in Task Scheduler and disabled Google Update services. I needed to restart 5-6 times after and everytime the issue persisted. Once even I got black screen after profile loaded. System need around 8-10 minutes to load normally.","solutions":[]},{"symptom":"Fade out video and music in Microsoft Photo app        How do I make a fade in \/ fade out in the Microsoft Photo app?","solutions":["Hi TK. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See information about what Photos app can do and not do with transition effects: https:\/\/www.windowscentral.com\/using-photos-app...https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/www.techradar.com\/how-to\/windows-movie-...There is also a free app in the Microsoft Store here that can do transitions as detailed here:https:\/\/www.animotica.com\/blog\/add-fade-in-out-...https:\/\/www.microsoft.com\/en-us\/p\/animotica-mov...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thanks for using the Video Editor!This feature is available under the Custom Audio tab.Add your audio file to the right hand pane by selecting the + button or dragging and dropping it. Then select the Audio icon in the bottom right corner of the audio tile that pops up. That will open a menu where you can adjust the volume of the clip, and toggle whether you want it to fade in and out. Hope this helps!"]},{"symptom":"My outgoing email is not working - even I think emails are not coming regularly        When I send email from my email account: *** Email address is removed for privacy ***, i get a message : Delivery has failed to these recipients or groups: *** Email address is removed for privacy *** Your message couldn't be delivered because you weren't recognized as a valid sender. The most common reason for this is that your email address is suspected of sending spam and it's no longer allowed to send email. Contact your ema","solutions":["Hi Alex Ji:What is your Windows operating system (if Win 10 please include the version and build - see the How-To Geek articleHow to Find Out Which Build and Version of Windows 10 You Have), antivirus program and default browser.  What mail client do you use on your local computer (e.g., the built-in Windows Mail, MS Outlook 365, Mozilla Thunderbird, etc.) and is this e-mail account with your Internet Service Provider (e.g., Comcast\/XFinity, etc.) or is this a free e-mail account from someone else like Microsoft (e.g., @hotmail.com, @live.com, etc.) or Google (e.g., @gmail.com)?  If your problem email account is provided by someone other than Microsoft, have you contacted their Customer Support to see if they have temporarily suspended your account because your e-mail address is being used illegally by spammers?If you are having a problem sending emails from an Outlook.com account provided by Microsoft see the support articleSent email in Outlook.com comes back \"delivery failed\" for some possible fixes, and if those suggestions don't help see the instructions in Unblock my Outlook.com account.Please note that you've posted your question in the Windows Vista board.  Microsoft employees and their agents do not monitor this board (Vista reached end of support on 11-Apr-2017) and if you have a different operating system we'll ask the Forum Moderators to move your question to the correct board.-----------------32-bit Vista Home Premium SP2 * Firefox ESR v52.9.0 * Norton Security Deluxe v22.15.2.22HP Pavilion dv6835ca, Intel Core2Duo T5550 @ 1.83 GHz, 3 GB RAM, NVIDIA GeForce 8400M GS"]},{"symptom":"Windows 365        There was a banner that came up that said something like Windows 365 will be replacing Windows 10 in October.  I can't find anything regarding this.  Is this a SCAM?","solutions":["Hi ORLutheran i have not seen the banner or any pop-up, but can confirm that there is no windows 365 or any notification from microsoft that there will be.microsoft intend to continue with the biannual feature updates to keep windows 10 current and compatible with the latest technology.","Thank you!","you're welcome,","it has occurred to me that there may be some confusion with Microsoft 365 which covers a collection of software bundlesbasically the bundles include windows 10, office 365 and some security and analytical tools.even so it will not be replacing windows 10."]},{"symptom":"Unable to activate Windows 10 Pro        Hello! My problem is that I can't for some reason activate my windows with a bought product key. The first time I've tried, it worked for about 10 minutes, then windows got deactivated and when I tried to activate it, I received the error code 0xC004C003. I've tried multiple things to solve the issue, including reinstalling windows, which didn't seem to help either. Now it's saying that my product key is not valid, even tough I have bought it and never actually activated windows.Another problem would be that I've been invited to join a Microsoft Family but when I try to join, it says that something went wrong and I should refresh the page or try later. This is the day after I tried to join and still nothing happened. I am aware that other people have asked about this same question but I still can't seem to find a viable solve for this problem. Thank you!","solutions":["Hi EdwardRaschitor and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/support.microsoft.com\/en-ph\/help\/10738\/...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Thank you for your reply! However, I have already read the article and it didn't help me at all. All the article has to say in order to fix the problem, at least for me, is that I have to buy a new product key, which I don't understand why, as I already bought a key, and the other thing is to contact my device manufacturer, but the device didn't come with a key, I bought it separately. Another thing is that the troubleshooter just says that windows is unable to be activated and getting error 0x803FA067. Thank you again!","Hi EdwardRaschitor, I will release the question for other experts come to give his opinion, I am sorry not to find the problem.Thanks!"]},{"symptom":"During the time of update my system is showing an error  0x80240034        I Have tried all the method which are posted by Microsoft community. and showing I tried to update my laptop for 15-time","solutions":["Hello, anuragmaurya,Right Click Start > Select PowerShell (Admin)Copy\/Paste the following into the window then press Enter.net stop wuauserv Next, copy paste the following into the window then press Enter.rmdir %windir%\\SoftwareDistribution \/S \/QNext copy paste the following into the window then press Enter.net start wuauserv Type Exit > Press Enter to close PowerShell window.Retry updating Windows.If the above fails, try installing windows using an .iso file.https:\/\/support.microsoft.com\/en-us\/help\/12435\/windows-10-upgrade-faq","It not working . plz tell me another method to my problem. my system is now to much slow. some application are not working well. showing that \"not responding\"","Follow the steps I listed here to install in a Clean Boot State.https:\/\/answers.microsoft.com\/en-us\/insider\/forum\/all\/stuck-on-build-18999vbrelease191004-1432\/b4b79b1a-978c-4c44-8d5c-f3f7f3edff14"]},{"symptom":"sending e-mail  & receiving emails.        Outlook. com will NOT let me sent -  e-mail to correct addresses  NOR will Outlook.com let me receive e-mail messages from anyone !!!  What is wrong ??????","solutions":["Hi gloriam.foster and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.May you please provide a screenshot before we proceed with troubleshooting? Thank you!","Thank you, but unable to provide screen shot.","Shall telephone number you gave me, with thanks.  Later, as they are using 2 jack hammers & sledge hammer close by, and I cannot hear on telephone.   I sure hopes this solves my issue.  Shall let you know later today.","What you can do is head to this link: https:\/\/www.lifewire.com\/outlook-not-sending-em...It will give you the option under FILE to \"resync\" your password in Outlook. There are many more solutions to this issue we can try. Are you using the Outlook APP or are you physically logged into the Outlook.com's website?","NOT HAPPY AT ALL WITH OUTLOOK.  I PHONED.  TO RECEIVE HELP GETTING THIS ISSUE FIXED.   I WOULD HAVE TO PAY A FEE ?????????????   THIS IS NOT FAIR !   IT IS OUTLOOK THAT HAS CAUSED THIS ISSUE.  THERE ARE TO MY KNOWLEDGE TODAY AT LEAST 60 TO 70% WHO HAVE THE SAME PROBLEM WITH OUTLOOK.     LOOKING FOR $$$$ WHEN IT IS THEIR FAULT.BEWARE PEOPLE, YOU COULD BE NEXT !!!","NOT HAPPY AT ALL WITH OUTLOOK.  I PHONED.  TO RECEIVE HELP GETTING THIS ISSUE FIXED.   I WOULD HAVE TO PAY A FEE ?????????????   THIS IS NOT FAIR !   IT IS OUTLOOK THAT HAS CAUSED THIS ISSUE.  THERE ARE TO MY KNOWLEDGE TODAY AT LEAST 60 TO 70% WHO HAVE THE SAME PROBLEM WITH OUTLOOK.     LOOKING FOR $$$$ WHEN IT IS THEIR FAULT.BEWARE PEOPLE, YOU COULD BE NEXT !!!-That post was spam. You were shown this warning when posting the question that started this thread :Beware of scammers posting fake support numbers in the Microsoft Community forum. Contact https:\/\/support.microsoft.com\/contactus if you need help.Microsoft does not post phone numbers in this formatI  O  5  O  (1050)Don"]},{"symptom":"How can I upgrade photo app to create videos?        On my old Windows PC I could create videos in the photo App.  Disappointingly it's not an option on my new PC.  How can I access this feature?My new PC is Windows 10 Home v1909 64 bit.Thanks.","solutions":["Hi James I'll try to help you on this question. I just checked on my own computer, and my Photos App allow me to create a \"Video Project\"It's located on the top left corner of the app. Photos App version is : 2019.19071.17920.0 I hope this helps Regards","Hi James I'll try to help you on this question. I just checked on my own computer, and my Photos App allow me to create a \"Video Project\"It's located on the top left corner of the app. Photos App version is : 2019.19071.17920.0 I hope this helps RegardsJay, Thank you for your reply, but I don't have this option.  Mine looks like that below.My version is 2019.18114.19418.  How can I update mine to allow video editing?   My old PC had this option.Windows shows all updates as being up to date.Thanks","Go to the Windows Store, and check the top right corner \"downloads and updates\". (the arrow, next to the \"3 dots\")Also, I may have a different version of yours because of different location (I'm in France).","Go to the Windows Store, and check the top right corner \"downloads and updates\". (the arrow, next to the \"3 dots\")Also, I may have a different version of yours because of different location (I'm in France).Thanks again, Jay, but it says the app is up-to-date.","Well, As I said, it may be related to my location. I don't know. Regards","Jay, are you a member of the Windows Insiders? I am suspecting so from the version number. If this is indeed the case, you'll want to join the App Preview Program so you can still receive the latest app versions while selfhosting the new OS--go to ... > Settings and look for a \"join\" button."]},{"symptom":"Problems with scanner since Windows 10 Update        I recently did a Windows 10 update & now I cannot get my HP e-Photosmart all-in-one 7520 printer to scan & the icon is gone off of my desktop.  How do I get my scanner on my printer to work again?","solutions":["Hi Chloe3015 I am Vijay, an Independent Advisor. I am here to work with you on this problem. Before proceeding with the troubleshooting steps, Connect your Printer to the computer and Switch it ON. In case of Wireless printer, Switch it ON and connect it to the Wifi network.1. Run printer troubleshooter HP provides a tool for HP printers to troubleshoot - HP Print and Scan Doctor. Download it, launch it and follow the onscreen directions to locate problems and fix themDownload Link - http:\/\/ftp.hp.com\/pub\/printers\/hppsdr\/HPPSdr.exe 2. Update Printer Driver Download printer driver from printer manufacturer's website and reinstall. The driver link ishttps:\/\/support.hp.com\/ca-en\/drivers\/selfservic... I can notice that driver is around 4 years old, last it was released in 2015. There is a firmware released in 2018, you should install that also once your problem is over. This is not an immediate need though.3. Uninstall and reinstall the Printer (Credit to Andre Da Costa, MVP for providing steps)A. Uninstall Printer Click on Windows Key+X > Apps and Features > Scroll down and click Programs and Features > Select your printer > Select UninstallType Printer in Cortana Search box > Printers & Scanners > Select your printer > Remove deviceType Printer in Cortana Search box > Click Printers & Scanners > Scroll down and click Print server properties under Related settings > Under Driver tab, look for your printer > Select it and click Remove button at the bottomB. Install Printer Go to the Printer manufacturer’s website and search for the latest Windows 10 drivers > Reinstall the Printer driver > Reboot the computerType Printer in Cortana Search box > Click Printers & Scanners > On Right side, Click Add a printer or scanner > If Windows detects your printer, it will be listed > Select the printer and follow on screen directions to set it up (In case of Wifi printer, your computer should also be logged into Wifi network) If Windows doesn't detect your printer, then you will get a blue message - Click The printer that I want isn't listedIf you are using Bluetooth \/ Wirelss printer > Select Add a Bluetooth, wireless or network discoverable printer > Choose the printer > Select your Printer and follow on screen directionsIf you are using wired printer > Select Add a local printer or network printer with manual settings > Select Use an existing port > Select your Printer and follow on screen directionsDo let me know if you require any further help on this. Will be glad to help you.(Source - https:\/\/support.microsoft.com\/en-us\/help\/401540...) Disclaimer - This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I have exactly the same issue.I think it occurred following the Creators Update.I have a Canon Pixma MX925. It works as a printer but if I try to scan anything, the the scanner software, Canon Image Garden hangs. I have the latest drivers and latest version of the software.","Hi  !Same problem here with my Pixma MG5350.It works as a printer but if I try to scan anything it hangs. I got it to kind of work using the built in Windows 10 scanner but the quality is very bad.Any update ?Thanks in advance.Regards"]},{"symptom":"USB Ports disconnecting and reconnecting mouse randomly        Hi!I've had a problem with my USB ports for a few weeks now. Sometimes the mouse disconnects and then reconnects randomly. This usually happens inside games but has also happened while I'm browsing. A few times both my keyboard and mouse disconnects and reconnects but yesterday it got worse and both disconnected but didnt reconnect but the lights on the keyboard and mouse where still on.After the first times it happened I updated windows (didn't fix problem). Then I tried going to device manager and power management on root hubs and deselecting \"Allow the computer to turn off this device to save power\" (didn't fix problem). I have also tried going into the power plan and change USB settings to \"USB selective suspend setting disabled\" (didn't fix problem). I have uninstalled root hubs and restarted the computer (didnt fix problem). However I didn't uninstall every root hub or USB hub option because I read that for some people the usb ports didn't work at all after that. I have tried the mouse on a different computer and it works without problems I have also tried different ports and both keyboard and mouse has been connected in the USB ports on the back and the problem persists.I read that a windows update (KB4074588) could be the problem but I could not find that update on my computer in the updates section under Programs and features.RegardsIsak","solutions":["Hi, Isak92,Sorry for the spam post earlier. Please do not call the number member provided in the post. It is a scam and you will lose money as they are not Tech Support for Microsoft.Try uninstalling the Hubs and verify if the mouse and keyboard work properly after reinstalling on reboot.What is the make\/model of the mouse and keyboard?Did they come with your device or were they purchased separately?FYI: I had to replace a wifi mouse after numerous Windows 10 installations. It just no longer worked with Windows 10.","Hi Isak92, Is this a plug and play mouse? If yes, try to switch it on other ports. Then perform \"Allow the computer to turn off this device to save power\" again.If no, please uninstall the Mouse driver, restart the computer and reinstall it again.I hope that might help you solve your issue. If this won't work, please specify your Mouse's brand and model. Thanks and regards,","Hi and thanks for replying.This is everything I have under \"Universal Serial Bus controllers\"Alcor Micro USB 2.0 Card ReaderGeneric USB HubGeneric USB HubIntel(R) 8 Series\/C220 Series USB Enhanced Host Controller #1Intel(R) 8 Series\/C220 Series USB Enhanced Host Controller #2Intel(R) USB 3.0 eXtensible Host Controller - 1.0 (Microsoft)USB Composite DeviceUSB Root HubUSB Root HubUSB Root Hub (USB 3.0)Do you mean I uninstall everything in this or just the two Generic USB Hubs and the three USB Root Hubs.I use a Logitech G610 Orion and a Fnatic Flick G1 Mouse. I did swap out the mouse for a Trust Comfort mouse that has no drivers, but still had the same issue (not as often but it happened). I uninstalled the mouse drivers and downloaded the newest drivers for the mouse around the same time I uninstalled the Root Hub the first time. I haven't uninstalled or updated the drivers for the keyboard since I didn't think that one caused the issue but I'll do that too and try with a regular keyboard. None of the devices mentioned are wireless including the Trust mouse.RegardsIsak","Did you download the keyboard drivers from here? There's a GHub download on the webpage.https:\/\/logidrivers.com\/logitech-g610\/A Setup Guide is on this page.https:\/\/www.logitechupdate.com\/logitech-g610\/Fnatic software here:https:\/\/downloads.fnatic.com\/Verify if you've installed all the necessary software(s).When I uninstalled the Universal Serial Bus Drivers, I uninstalled all of them however, I did notice that there were two that did not uninstall. I'd never seen this happen and believe it was the Generic USB Hub drivers that did not uninstall.","I uninstalled everything under Universal Serial Bus controllers and removed all drivers for the keyboard and mouse. I restarted computer and installed new drivers for the keyboard and mouse. I have now tested it for a few hours and it seems to have worked. I did however get two disconnects in the beginning but I think that maybe some USB drivers hadn't finished installing even though I waited 5-10 mins after I had logged into account on windows. I had to restart twice because I had on driver left to uninstall the first time since all USB hubs got uninstalled before I could remove it.I consider this problem solved now and the help is much appreciated. Thank you for all the help!RegardsIsak","You're welcome. Glad it's now working for you.","Hi again.Unfortunately the latest fix only worked for a day and then I had the same problem with the mouse disconnecting and reconnecting. So I tried doing the same and then that didn't work.Got anymore ideas on how to fix it?RegardsIsak","None.I began experiencing issues such as you now are. The solution was to purchase a new mouse.Recently, my sister experienced the same and purchased a new mouse. That's my solution since any steps taken to resolve the issue always resulted in the mouse eventually stopped working again. Finally the new mouse took residence and all has been well since.","Can anyone help me too with this issue:I have an old Dell Tower - not sure how old it is but its works just fine and has Windows 10 and SSD installed - to  me it does what it needs to do but this darn mouse and keyboard stuff stopping working with no rhyme or reason is making me very frustrated.I cannot easily unplug and plug in the mouse\/keyboard to get it going again... they are still lit up but they are dead basically and I have to do a hard reset.USB selective suspend is disabled.I checked the drivers for the keyboard and mouse and they are updated.I checked to see if PC has KB4074588 and it does not.I am not sure what else to do.... I can go days without the issue and then days where anytime I step away from the PC it stops working.I can say when it is working it just does not just stop  ... only when I walk away and the machine is idle or the screen is locked.Any suggestions would be appreciated.","1. Go to Cortana Search and type MSconfigLook at your BiosThis will give you computer ageIf there were an update to the bios you can check at the computer manufacturer's website for the actual bios date.2. I also would like to know the name of the Processor on the unit.3. Did you try the steps I provided earlier to  correct the Mouse Issue?4. In Device Manager > Look at the mouse and keyboard driversDo you have the option to Rollback the driver? Try using that option.5. Mouse and Keyboard driver in Device Manager > Power Management TabUncheck Allow the computer to turn off this device to save powerCheck > Allow this device to wake the computerClick Apply, OkFYI: During all these Windows version updates, I first had no touchpad input on my  Toshiba laptop. No matter how many times I tried to update the synapsis driver the touchpad would  not work.A new driver was never provided for the touchpadEventually I noticed that my mouse no longer worked. The mouse was not that old but upon  purchasing a newer model of the same brand, it did and still does work on my laptop.I'm used to using a mouse but still, to first lose the touchpad and then a relatively new mouse bothers me.I removed the USB Root Hub and still the mouse would not work."]},{"symptom":"Picture icons not showing in Windows10        I have a brand new HP laptop with Windows 10. The picture icons in File Explorer are not showing.  If I change to a different size icon, sometimes 1 or 2 pictures will show. If I change again to another size icon, a couple different icons will show - never the same as the previous size.  I have followed suggestions I found online.  One suggestion to do a disk cleanup worked, then the next day, the icons were gone again.  Can anybody help me?Thank-you in advance.","solutions":["Hi ShernieL and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by a Windows Support, so it is safehttps:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","I did my best to follow the instructions.  Some were not clear to me.It did find corrupt files and repaired them.Some icons are showing up now, but many are still not showing up.  Very frustrating to have a brand new laptop doing this.","Hi ShernieL, I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/windowsreport.com\/thumbnail-previews-no...Thanks! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thank-you for posting the article for me!I had already tried a number of things in the article previously. Perhaps I can ask someone to help me with the remainder in the article, but I'm not able to do that this week.I did, however, notice something over the weekend....The thumbnails for the new pictures I am creating and saving on my new laptop are showing up perfectly!!!  The problem is with the pictures that were transferred from my old laptop, which was Windows 7.  Has there been a problem with pictures transferred from Windows 7???Thank-you for your help!!"]},{"symptom":"Is there such a thing as a reliable Bluetooth mouse for Windows 10 that does not require a dongle?        I just bought a new laptop that comes with a type C USB port, which is inspiring me to purchase a new mouse.  I would love to eliminate having to use a dongle, and to just Bluetooth into the laptop.  Can anyone recommend such a mouse?","solutions":["Hi Jacquie The Microsoft Arc Mouse is beautiful, reliable and does not require a USB dongle . . .There is also the Surface Precision Mouse and the Logitech MX Master, both of those are reliable and require no USB dongle . . ."]},{"symptom":"Issue with different windows closing on their own        I'll be using something like Firefox and suddenly it closes down. Most of the time I can't reopen it & if I can it closes again seconds later. From then on the same thing will happen to anything I try to view (Netflix app, mail app etc). I'll look at it and within 10 seconds it'll close. What's strange is that if I'm watching a video on Firefox I can still hear it playing even when it closes and I can't open it again. Firefox is still working in the background according to task manager even though the icon on the taskbar doesn't show that it is open at all. The only way I can fix the problem is by restarting the computer, although 1\/10 times the problem persists and I have to restart a second time. I notice that a lot of the time this problem happens soon after coming out of sleep mode, although that's not the only time. (Side note - sometimes after it happens with Firefox, another Firefox window with a slightly different logo pops up on the taskbar, although it won't let me open it)I need help assessing what the problem could be & how I would go about fixing it. I have tried SFC\/DISM which show no errors.","solutions":["Hello TBlue321, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemdoes this issue appears only on Firefox? you mentioned only that as an example. Can you try starting firefox in safemode? Hold Shift button and click on Firefox icon to start it, then choose safemode. it will start without extension and plug in,If everything was fine, you can try refreshing firefox by doing the same as before but this time choose Refresh firefox. This will of course delete all cache, passwords, and extensionsFeel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolvedCheers! Farah","Hi Farah,This issue happens with other apps, I was using the Netflix app and it happened then too. Although, Firefox was open in the background so I suppose it could still be the problem. I'll try using safe mode now and keep you updated, thank you for the suggestion!Many thanks,Tblue321","No worries mate, I hope it works out","Sorry for the late update! So I tried in safe mode which didn't work, I then tried refreshing & reinstalling Firefox and that didn't work either. Also I should mention that I've tried using the Netflix app 4 times & I haven't been able to make it through one episode of content without this problem occurring. Any other suggestions?Thanks"]},{"symptom":"Im stuck in a loop help pls        Hi i deleted an admin then factory reset my laptop now its stuck in a loop and keeps coming up with thisStartup repair couldnt repair your pc log file: E:\\recovery\\windowsRE\\winre.wim\\system32\\logfiles\\srt\\srttrail.txti have tried alot of things yet nothing is working so pls i really need some help.","solutions":["Hi, RyanMcKenzie5 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Help ! Laptop HP 8560p New Year's BSOD atikmpag.sys graphic drivers        I was using my laptop New Year’s Day before going to bed in the morning and got a BSOD. I hope for the best but when the laptop rebooted (an HP Elitebook 8560p with win7 x64 SP1) the screen remained black. I wished myself happy New Year and went to bed. So the next day the issue remained. I plugged and external screen which works so I saw that the BSOD is about the atikmpag.sys graphic drivers, which makes sense since the screen isn't working. So I booted in safe mode to delete (I just rename) the atikmpag.sys and atikmdag.sys files, then I can boot windows normally, but I have no graphic drivers and only the external screen works. I have updated and tried different driver versions, which doesn't solve the issue, updated BIOS, then I remembered my computer had rebooted on it's own once or twice in the last few days for windows updates and there was one on the 12\/31 but it was critical so I couldn’t uninstall it, so I Rolled back to some automatic backup from the 29th it seemed I had yet the problem remains. Now my windows update go from 12\/25 KB4507004 to 01\/04 KB4531786. I have also noticed that the “sleep” function is greyed out, if that gives anyone a hint (I spent 5min trying to solve that one, they mentioned the BIOS, which is when I updated in case it also worked for the screen). I called HP who have made it clear that this is not faulty hardware so they can’t help me, which too bad because they were real easy to get in contact with. So they gave me the number for Microsoft but I’m not getting anywhere. I expect that there is just some issue between some code for the windows update and some hardware, but I doubt my case will ever get a fix since there are no more updates for Elitebook 8560p and Windows 7 will stop Jan 14th. I would like to know if anyone has solved this kind of problem, or if it can be solved at all. The laptop seems to be about 10 years old and maybe this is just a case of planned obsolescence, which would bum me out since I don’t worship consumerism, but I would like to know if this can be fixed or if I’m tilting at windmills. Thanks for the help.","solutions":[]}]}