{"windows":[{"symptom":"All Restore Points Keep Getting Deleted.        For some reason my Windows 10 Desktop computer can't seem to keep any restore points.  I manually create a restore point, and it seems they get deleted right away. All Restore points, not just a few. System restore has been enabled on all drives, there is plenty of space, and I am able to successfully manually create a restore point. I have also noticed that sometimes restore points are created ok when some new software is installed. However, all restore points get deleted pretty quick.I have run chkdsk \/f, sfc \/scannow, made sure the Shadow Volume copy is set to automatic and is running, deleted the system pagefile.sys and created another copy, all without success. I can't find any programs that might be deleting the files. I have CCleaner installed but it is not setup to delete these files, and the people over there say it doesn't do it anyway. I have uninstalled the program and the problem persists. I am attaching some screen shots of my system restore configuration showing a manually create restore point that has been deleted within hours. The last picture shows the new restore point I just created to try and test the system again. Notice how the previous restore point is gone. (Update) I just checked my restore points and now even the \"2nd Try\" restore point is gone. See last picture. Any Help would be appreciated!","solutions":["Hi John With the introduction of Windows 10, the System Restore functionality in Windows basically became deprecated as a viable option to recover Windows . . .It is Windows 10 updates that are deleting your Restore points. The problem with Windows 10 is that is constantly updating, and with each update, there are changes made to important system files and registry keys.That is why some Windows updates will delete your restore points, to stop your system becoming a mixture of old and new system files after a System Restore and resulting in a very unstable operating system . . .","Thank you for the reply. I understand what you are saying, but I find it hard to believe that all my restore points are deleted within a matter of hours? Surely Windows doesn't update every hour or so? What's the point of even having the restore point feature? Thanks...","i think  system restore points  automatically detete is configured by gpo and registry'"]},{"symptom":"Registered Microsoft supplier        Does the person who is selling the OEM license need to be a registered Microsoft supplier or anything ?","solutions":["Hi donlindgren87 No, you do not need to be a registered Microsoft Supplier to sell OEM licences . . .The main rule regarding selling an OEM licence, is that you can install that on a PC, but you must then sell that PC on . . .It is only hardware suppliers that are really meant to sell OEM Licences with thier products, though you will find sellers all over the Internet, whether most of those are legitimate is a concern . . .","Microsoft has a distributor network.This is for UK\/Ireland:https:\/\/partner.microsoft.com\/en-gb\/Solutions\/licensing-distributors"]},{"symptom":"Picture on Welcome screen missing.        My picture shows in Accounts, Your info. It sometimes shows when signing into Microsoft on Edge. It is missing from the Welcome screen - not even the blank icon. It does not show on Community, but does on Rewards. Different computer everything works fine. Any suggestions on what's up?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please sign in to your Microsoft Account and go to Profile. Change the picture once and check if the change takes places across all your devices.","It changed, but when I put in a 2nd change I'm stuck with the first change on my one troublesome device."]},{"symptom":"Windows 10 multiple display - windows are moved and resized on display power cycle        I have a Dell XPS 13 (2015) hooked up to an Asus 23\" (MX239) monitor. They are connected via DisplayPort to HDMI cable. Both displays are set to 1920 x 1080px (their native resolution). The Dell XPS display is set to scale otherwise everything would be tiny. Also, for more detail, the Asus monitor is my primary (#1) display, and the Dell is display #2.The big and super frustrating problem is that very frequently when the screens gets turned off by the Windows \"Power & sleep\" settings, all my windows on the Dell XPS 13 get moved over to the Asus monitor, as well windowed problems that are not full screen have their position on the display altered. Again, this happens when the displays are turned off by Windows, this is before the computer goes to sleep. When I touch a key or whatnot to wake the displays, they turn on and I see the above issue of moved and resized windows.I am aware of this thread, which is still active, but it is titled Windows 7, and I noticed a Microsoft employee 4 years ago suggested starting a new thread. Since we are now through Windows 8, and on to Win 10, and this is still happening to people, let's start fresh here and get this fixed! Please. Please. Please. I have also tried the reg edits some folks suggested in that old thread with no luck. And in my research it really does seem this issue is more common with folks not using HDMI to HDMI to connect their displays.","solutions":["Hi Trevor,Welcome to Microsoft Community. Your interest in Windows 10 is much appreciated. Method 1:I would suggest you to update drivers for your Display card adapter from the Manufacturer’s website.Method 2:I would suggest you to create a new power plan and check the issue status. Creating a new power might help you to diagnose the issue.For reference: Power plans: Frequently asked questions.http:\/\/windows.microsoft.com\/en-US\/windows-8\/power-plans-faqAlso refer:http:\/\/windows.microsoft.com\/en-in\/windows-8\/how-connect-multiple-monitors#1TC=t1Keep us posted if you face any issues on windows in future. We will be glad to help you.","Hi Annu!Thanks for the follow up. Unfortunately I have the latest drivers available for an Intel 5500HD graphics card.This is definitely an ongoing issue, I had it in Windows 8.1 on the same machine, and there are almost 100 replies in this thread, which is still active, regarding this issue, going back to Windows 7 and now into Windows 10 for people with all types of graphics cards and monitors.Please see here: http:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_7-hardware\/windows-7-movesresizes-windows-on-monitor-power\/1653aafb-848b-464a-8c69-1a68fbd106aa?page=8&tm=1439182229675Thanks!","I'd also like to provide more detail...I've spent A LOT of time testing this. What I've noticed:- If I sleep from the Start Menu, then resume using laptop power button (but making sure the monitor itself is resumed first), the desktop layout is correct.- If computer goes to sleep on timeout, then this issue occurs- And I think I know why it only sometimes happens. If I have at least one open application (i.e. web browser) window maximized on my 2nd monitor, the one connected to my laptop via DisplayPort connectin, then when the computer goes to sleep this issue appear to NOT happen.This is a bug with Windows clearly by the number of people reporting it, no way this is isolated to drivers or power plan settings.","Annu -I have a similar problem to Trevor, except with a single monitor. In my case, it's a Dell P2715Q with 3840x2160 resolution, connected via DisplayPort to a desktop using Intel HD Graphics 4600. When the computer puts the screen to sleep, the windows rearrange into the upper-left corner.I've been suffering with the same problem since Windows 7. The suggestion in the thread Trevor links, to edit the settings for the simulated monitor under HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\GraphicsDrivers\\Configuration, did not fix the problem under Windows 7, and does not fix the problem under Windows 10.Having researched the problem thoroughly, it's pretty clear what's happening. When Windows puts a monitor connected via DP to sleep, it then detects a device disconnect. In Trevor's case, this leaves his system thinking there's only one monitor. In my case, it means my system gets treated as a headless display with simulated video only. In either case, the windows rearrange.This problem doesn't occur with monitors connected by some other kids of connectors, because Windows doesn't treat them as disconnected when they go to sleep. But do a web search, and you'll see a ton of people complaining about this problem.The solution is to have Windows not treat the monitor as disconnected when the computer puts it to sleep. Is there any way to flag Windows to do that?","I had a very similar problem on a HP Spectre x360 laptop which has a native screen resolution of 1920x1080.  I am not using an external monitor.  After installing Windows 10, the default scaling was set to 150% which I reset to 100% (the other mode would not be useful to me).  Upon awaking from sleep windows were resized and moved to the top left (interestingly this did not occur for “settings” -- I didn’t do extensive checking of others native windows 10 routines).    I tried the solution of modifying the registry but this did not work (see link referred to by Trevor Robertson in this thread).   One issue is that there was no “SIMULATED” entry under the “GraphicsDrivers\\Configuration”  to change.  I did change the ActiveSize, PrimSurfSize and Stride values for one the configuration entries keys (MHS062…) that had 1024x768 for the sizes.  This seemed to help some.  Resizing did not occur for all sleep\/wake scenarios but seemed to revolve mostly around activation sleep or waking with the lid.  (At this point I’m not sure what modes were working properly or not before I made this change.  I hadn’t fully realized the extent of the resizing problem when I started looking for a solution.) I was about to give up but did one more search which turned up a solution seems to have worked (at least for my case).    This link: http:\/\/www.tenforums.com\/general-discussion\/11890-intel-nuc-windows-resized-after-waking-sleep.html points to a solution (option 2) which is here http:\/\/www.tenforums.com\/tutorials\/5990-dpi-scaling-level-displays-change-windows-10-a.html#option2 The solution is to go to “Display” through the “Control Panel” and click on “set custom scaling level”.   I set the scaling level to “100%” (it was 150%) and this seems to have fixed the problem.   It is puzzling to me why this “scaling level” was (still) 150% since I has adjusted the scaling to 100% through the Windows 10 Settings by (adjusting the slider in System | Display).  Seems like a bug.I'm not sure if editing the registry first was necessary as I left in the original changes I made (and now that it works I figure it best to leave well enough alone).","I do have exactly the same problem since using Windows 10 (clean install). It did not appear to happen on Windows 7.I currently have 2 monitors connected to a GTX 970 and one monitor to the onboard intel HD Graphics device.Whenever I turn off the primary monitor, and the PC goes into sleep mode and back up, all windows I had opened on the other 2 monitors get rearranged on Monitor 1.Monitor 1 is a ultra wide predator, all windows are also scaled to fit into the top left \"normal\" wide box. So Windows doesn't even remember the ultra wide resolution...Seems this issue is around for a while, and update or confirmation that you guys can reproduce it, would be awesome.And yes, I do use the latest nvidia drivers and everything. That's totally not the problem.","For me with P2415Q and 4K UHD it turned out to be a known issue - lowering refresh rate to 30Hz fixed the problem. Issue affects UP3214Q, P2715Q and P2415Q and is described here:http:\/\/www.dell.com\/support\/Article\/us\/en\/19\/SLN295708\/ENRegistry clean for HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\GraphicsDrivers\\Configuration\\ was not helping and problem didn't manifest on lower res QHD U2515H.","Hello,I think I may have a solution for this problem.  It appears Windows 10 keeps a history of all the monitors it encounters during its life time.  This includes the basic monitor support during the OS install.  So, if you enable \"Show hidden devices\" in the Device Manager you will see all the monitors that were connected to your system.Start the Control Panel as Administrator:1.  Start Control Panel --> Device Manager2.  Select View --> Show hidden devices3.  Expand Computer --> MonitorsWhen you expand the Monitors you will see your current monitor (highlighted) and all the disconnected monitors (greyed out).   You may see monitors with \"non-PNP\" and \"PNP\" listed as well.  I believe these are aliases to your current monitor (at a lower resolution) before Windows installed drivers for it.   I uninstalled ALL the greyed out monitors.  Right-click on these monitors and select uninstall.  Keep only the highlighted monitor you are currently using.  4.  Uninstall all greyed out monitors (even non-PNP and PNP monitors)5.  Reboot your system.After doing this my windows don't resize after my monitor goes to sleep.  You can quickly test this by temporarily setting your monitor sleep time to 1 minute.Settings --> System --> Power & Sleep --> Screen [1 minute]Cheers,Stephen","I will try your fix this afternoon.  I see I do have my dual monitors there which show and the greyed out Generic Non-PnP Monitor.  If I uninstall the Generic Non-PnP is there something to worry about down the line if I change monitors or if these go out on me and I need to hook up another one?  will windows fail to show any monitor and I could end up screenless with no way to recover?thanks","I have P2715Q monitor connected to NVIDIA GTX980 through DP connector together with another monitor (Apple 27 LED Cinema Monitor) connected via another DP connector and was experiencing exactly the same issue - after waking up the monitors from sleep, all windows were moved to the Apple monitor and resized due to different scaling ratios. Lowering the refresh rate on P2715Q to 30Hz helped resolve the issue, at least so far.However, this is pretty lame as it affects the \"motion smoothness\" and generally lowers the quality of the display. It would be great to have a fix that wouldn't require lowering the refresh rate. It seems like this is related to the fact that to use this monitor with 60Hz, the DP port must be in DP 1.2 mode. Somehow either NVIDIA driver or Windows itself (or a combination of both) have issues with this when waking up the monitor from sleep. I saw this issue reported by other folks using a different graphics card (like integrated Intel for example) so I suspect this is a Windows issue rather than a driver issue.It is not a HW issue, because this exact setup works great when running Mac OS X. Resume from sleep causes no issues there."]},{"symptom":"need a script to add group or groups to AD workstations maybe powershell?        I need a script or batch job or powershell to add one or more ad groups to newly imaged or upgraded workstations.Anyone have it already written or can I do it to multiple workstations using my ad tools ?","solutions":["Hi WesBichsel, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.These forums are geared mostly toward consumer questions - we would recommend posting on Microsoft TechNet for these types of questions:https:\/\/social.technet.microsoft.com\/Forums\/en-...That being said, you are likely looking to use the Add-ADGroupMember command, which you can find the full documentation on and examples here:https:\/\/docs.microsoft.com\/en-us\/powershell\/mod...The following link contains a discussion about a script that takes a list of hostnames from a CSV file and does this:https:\/\/community.spiceworks.com\/topic\/2033985-...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I hope this has helped you. If this is not what you are looking for, you will likely find people more familiar with this over at TechNet :)Regards, and have a great day! -Ashton"]},{"symptom":"Upgrade from Windows 7 to Windows 10?        Any free upgrade from Windows 7 to Windows 10?","solutions":["Any free upgrade from Windows 7 to Windows 10? Ask Microsoft.You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700","Thank you Bill. I found the Microsoft.com website where I could download the free windows 10 upgrade. The upgrade installation was seamless and works fine. ","Glad you go it OK with no problems.Cheers."]},{"symptom":"Cancelling subscription for Xbox Game Pass on Microsoft Account        A couple months ago, I tried Game Pass, and decided that I did not want to continue using it after the first month.  I paid for the subscription using a prepaid card, and I only put money onto it when I plan to use it to make a purchase.  I chose not to renew Game Pass, so I did not load any more money onto the card.  Now, I am getting weekly attempts to charge my card for it, and Microsoft will not allow me to cancel without renewing for another month.  How do I contact an actual employee of Microsoft to request they stop trying to steal from me?  As it is I cannot load this card for any other purchases I wish to make out of fear that Microsoft will swoop in and take it.***Original title: Repeated attempts to charge my credit card***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query related to removing credit card from your Microsoft Account. You may want to refer the article How to cancel your Microsoft subscription and see if that helps. You can also try changing the credit card for your Microsoft Account, refer the articleChange the payment method or credit card linked to your Microsoft account If you are still facing issues, then you can get in touch with Microsoft Store support for further assistance with the issue. Regards,Prakhar KhareMicrosoft Community – Moderator","This does not address my problem of repeated attempts to charge my card for a service I don't want.  I have been trying to deal with this for several weeks, and its always the same thing, canned answers that instruct you to do something that does not work.  I just want you to stop trying to charge my card.  Why is that so hard to understand or do?  Stop trying to extort more money out of me just for the privilege of cancelling. "]},{"symptom":"Windows search is not working        The Windows search box is not working most of the time. I can't even click on it. Firstly I thought it's an indexing problem because I changed the laptop and copied all my information from the old device to this one (more than 100gb). But it's been several months and the problem continues. Please help me fix this.","solutions":["Hi Diana. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.You said the WIndows Search box is not working, but your screenshot shows File Explorer Search box which is not the same thing. Is it one or both? The WIndows Search box is on the task bar.For File Explorer search problems see here: https:\/\/www.slashgear.com\/windows-10-version-19...https:\/\/troubleshooter.xyz\/wiki\/fix-file-explor...https:\/\/answers.microsoft.com\/en-us\/windows\/for...For Windows Task bar Search problems see here: https:\/\/www.windowscentral.com\/how-fix-taskbar-...https:\/\/www.maketecheasier.com\/fix-windows-10-s...https:\/\/support.microsoft.com\/en-us\/help\/452014...If these don't help then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows 10 activation gift for friend, receiving their family activity emails instead of them        For Christmas I built a computer for my friend's daughter. When I bought the activation for the Windows 10 install I had to use my Paypal account information, which automatically entered all my information all over their Microsoft account & computer. Since then I have been receiving their family activity emails and screen time extension requests for the child. I was with them at their computer when they removed all of my information & replaced it with theirs. We cannot figure out why I am still receiving the emails instead of them. I checked my own Microsoft account & there is no information about my friend's device or family so it must be on their account, somewhere. We just can't figure out where. Any ideas?","solutions":["Hi Frank. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Go into Settings > Accounts > Your Info to see whose MS Account is listed. If it's yours, click the link to Sign in with a Local Account Instead, let it convert, restart PC.Then go back to the same place to choose the link which will now read Sign in with MS Account instead. Have the owner supply their information.If it's not there then check for your account under Settings > Accounts > Family & Other People or under Settings > Accounts > Email and Accounts, highlight it and Remove.There is no other reason you should be getting emails or other notifications unless you are listed in one of those places.Let me know what you find. I'll be here to help until it's resolved."]},{"symptom":"problem with Hello Face sign in on lenovo yoga c740        hello face login problem showing it couldn't find a camera compatible although I'm having my camera in working condition please help me out with this. thank you.","solutions":["Hi, I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See fixes here for Windows Hello: https:\/\/windows10skill.com\/windows-hello-not-wo...1) Turn off Fast Startup: Go to Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change settings that are unavailable > uncheck Fast Startup.2) Reset Facial Recognition and\/or Fingerprint Options https:\/\/blog.goptg.com\/how-to-reset-windows-hel...3) Modify Group Policy Settings (for Pro version only) Updates might have modified some of the crucial settings of Group Policy. Therefore, we would recommend to launch the Group Policy Editor and check\/edit the settings related to Windows Hello functionality.Pres Windows key, type gpedit, and press Enter. Click on Computer Configuration and open Administrative Templates. Select Windows Components and open Biometrics. Click on Facial Features and right-click on Configure enhanced anti-spoofing option.Select Edit and disable the Configure enhanced anti-spoofing feature. Reboot your PC. 4) Update drivers If some of the system drivers, most probably webcam and fingerprint reader drivers, were corrupted during the version upgrade process, Windows Hello may fail to perform. To fix that, try to update the corresponding drivers:Right-click on Windows key and select Device Manager. Locate the Hello, webcam, and fingerprint drivers individually and right-click on each of them.Select Remove driver software and wait for the removal to be finished. Repeat the removal with all Windows Hello related drivers and then reboot your PC.Once done, open Device Manager, click Action -> Scan for hardware changes. The system should automatically detect and reinstall the drivers. 5) If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool as shown here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... 6) If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....7) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 8) Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.9) If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... ________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Activated and not activated simultaneously?        I just got my PC to work. But when I went to personalize a bit, it said I had to activate my PC. The Virtual Agent told me the PC was already activated when I asked them. I installed windows 10 through putting it on a usb drive from another PC. I don't have a product key or digital license that I am aware of; am I missing something or is it bugged?","solutions":["Hi Ethan, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Get help with Windows 10 Activation errors: https:\/\/support.microsoft.com\/en-in\/help\/10738\/...https:\/\/support.microsoft.com\/en-in\/help\/12440\/...To better diagnose the issue, Please send us the results of both steps. 1. Right click Start>Command Prompt-Admin and type in the following command: slmgr.vbs \/dlv You will get a window, take a screenshot using snipping tool and paste it it next reply.2. Run the activation troubleshooter and send us the snip too. Using the Activation troubleshooter-Windows 10 https:\/\/support.microsoft.com\/en-in\/help\/20527\/...How to get a screenshot and post back: https:\/\/answers.microsoft.com\/en-us\/windows\/wik...Please let us know if you need any assistance in posting."]},{"symptom":"had microsoft, now it wont let me use it        I bought Microsoft word to go with my laptop. It was still the time where you bought the box with downloading instructions. However since the new update I haven't been able to write in my word. Why is it not letting me use microsoft when I already paid for it? is there something I missed?","solutions":["Hi Silva. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.When you buy Microsoft Office it lasts for life. You may just need to repair it or reinstall which you can do as often as you want.Try repairing now in Windows Settings > Apps > Apps & Features > Microsoft Office > Advanced Options > Modify > Repair.A written tutorial for doing this is here: https:\/\/support.office.com\/en-gb\/article\/repair...https:\/\/www.groovypost.com\/howto\/repair-microso...If that isn't enough just let me know. _________________________ Linked tutorial is from a trusted Microsoft MVP"]},{"symptom":"BSOD on dell notebook 7572 even after windows restore, hardware checks and reinstall drivers        After various hardware checks, windows restore and reinstall drivers im having BSODs.Checked full hardware with DELL toolsAlready checked HDs with chkdsk \/r\/fchecked ram with mdsched.exeI think some of the DELL drivers are causing the problem but i cant find which are.Please helpmsinfo e last minidump are on the linkhttps:\/\/1drv.ms\/u\/s!Av2ixi-wfgrDkZNHLl2aoJYcMlxG1w?e=Ga0afS","solutions":["Hi Galdir, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.The dump file didn't have any helpful information(Bugcheck EF) The next step, Let us try finding any misbehaving driver Enable Driver Verifier: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...(Must create a Restore point before) Upload the newer dumps when you get Driver_Verifier_detected_voilation. Please note that the system might crash before you reach the desktop-if it does please let us know so that we can guide you to disable Verifier.","Hi Sumit,Thank for the help.I have activated the verifier following the instructions.After some time the BSOD ocurred but the message was CRITICAL PROCESS DIED, not the \"DRIVER_VERIFIED_DETECTED_VIOLATION (xxxxx.sys)\"Is necessary to wait for a BSOD with the driver verifier message, right?Still, i have upload the new minidump to the same onedrive link above, maybe there is something new there.Thanks","It should have crashed right away with a Driver Verifier detected violation message. However, please continue to run it for the next day and if it doesn't BSOD let us know."]},{"symptom":"Why will my task bar not hide at times? I selected auto hide.        I selected auto hide.","solutions":["Hi Amber and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.Have you tried performing SFC and DISM methods? You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"Microsoft Solitaire Collection        All of a sudden I can not get Microsoft Solitaire collection to connect.  It just keeps trying to sign on but nothing works.","solutions":["Hi James. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Try resetting the game at Settings > Apps > Apps & Features > Microsoft Solitaire Collection > Advanced Options > Reset & Repair. Restart PC.If that's not enough then re-register the app from Option Two here: http:\/\/www.tenforums.com\/tutorials\/3175-apps-re... And if that fails uninstall the app in the same location above, restart PC, then reinstall from MS Store Settings > My Library.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.______________________________________________ Note: Linked tutorial is from Shawn Brink who is a trusted Microsoft MVP."]},{"symptom":"My computer is suddenly crashing to reboot when in games (XPlane11 or P3Dv4)        Hello everyone,My computer is consistently crashing when I am in gaming mode. I have checked my game log and that has no problem. (verified on AVSIM.At the time of crash my frame rate is above 70fps (CPU nor GPU is struggling)Piriform Speccy shows GPU temps at 65-70 degrees at time of crash.Ryzen master is showing CPU at 55 to 60 degrees at time of crashNeither CPU nor GPU is overclocked.This happens most consistently within 5 mins of starting the game and almost instantly on going to full screen (windowed) mode.All drivers have been updated and no queries\/exclamation marks in the device managerOut of the game scenerio there are no problems whatsoever.Windows 10 64 bit is up to dateI  uninstalled and reinstalled Windows and the only thing that changed is that suddenly I am being asked to activate  Windows and I do not have the digital key any more. I inserted my original Win 10 product code but it is not being recognised either. I do not believe this is related  to the problem but would like to sort this out too,Any ideasTony.","solutions":["Hi Karp. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) A Digital License doesn't use a key, except the default key that is present when you skip the key while installing Windows. If you change that to any other key, it will never activate. So, if you did, change it back now:http:\/\/winaero.com\/blog\/generic-key-to-install-... at Settings > Update & Security > Activation > Change Product Key.2) Update the Display driver from the PC or Display adapter maker's Support Downloads web page for your exact model number, HP Serial Number or Dell Service Tag - from the sticker on the PC.While there check also for newer chipset, BIOS\/UEFI firmware (very important), network, sound, USB3 and other drivers, comparing to the ones presently installed in Device Manager reached by right clicking the Start Menu.If this doesn't give you the latest or ideal driver for what you need, compare it to the driver offered by the Intel driver update Utility here:http:\/\/www.intel.com\/content\/www\/us\/en\/support\/... or the Nvidia Update utility here: http:\/\/www.nvidia.com\/Download\/Scan.aspx?lang=e... or the AMD autodect utility here: http:\/\/support.amd.com\/us\/gpudownload\/windows\/P... For Display issues one fix that is working is to Roll back or Uninstall the Driver on the Display Device > Driver tab, restart PC to reinstall driver.You can also try older drivers in Device Manager > Display device > Driver tab > Update Driver > Browse > Let Me Pick.Then you will know you've tried everything in addition to Windows Update drivers.Adjust the screen resolution until it fits and looks best at Settings > System > Display.3) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 4) Compare the install you did with this gold standard Clean Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... The reason I ask you to do this is because no one of millions who have followed the install in that link has ever come back to report problems that I have seen. It is also a great learning experience that will make you permanently the master of your PC because you will learn what works best and have applied it with your own hands. 5) Test the RAM overnight to stress it with the best bootable test memtest86, following this guide to test both sticks and slots:https:\/\/www.wikihow.com\/Test-PC-RAM-with-MemTest86Run Crucial System Scanner to check the RAM is properly spec'd and configured: https:\/\/www.crucial.com\/usa\/en\/systemscanner?cm... 6) Test the hard drive or SSD with diagnostics: https:\/\/www.lifewire.com\/free-hard-drive-testin...https:\/\/mashtips.com\/ssd-health-test-and-perfor...HP and Dell have hardware diagnostics triggered by tapping the ESC or F12 keys respectively as you power on.Best is to use the HDD\/SSD manufacturer's own if there is one, otherwise use Seatools bootable long test:http:\/\/blog.nowherelan.com\/2013\/04\/04\/boot-seat... Follow this up with a full Disk Check from the Command Prompt in Repair Mode or from bootable media:https:\/\/www.groovypost.com\/howto\/check-hard-dri... if necessary from the Command Prompt at boot:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Greg,For your further information.My system isMotherboard ASRock x570 Taichi (new) .. Ryzen9 3900x (new) .. 32gb Corsair DDR4 3200 (2 x 16gb) Ram (new).. PSU 1200w (tested OK)1.  (a) I have uninstalled and re-installed Windows 10, 3 times in the last five days.          Each reinstall involved reformating my NVME drive before using a fresh download of the Win10 Media Creation Tool.      (b) Each re-install did not give me access to a digital signature and all asked for product key.     (c) run and updated all chipset drivers Motherboard CD and ASRock website     (d) Each install of Windows was updated to latest (no further updates available)Windows crash to reboot.Following your instructions, I have carried out the following.1.   Updated BIOS ASRock x570 Taichi from 1.70 to 2.702.   Unintalled Nvidia Graphics driver 441.66 and reinstalled Driver 441.41.and 441.66 successively.3.   Uninstalled Avira free Anti Virus.4.   Checked Windows Defender, Game Mode - ON.5.   Checked all games (flight sims only P3Dv4.5 and XPlane 11. Both these games on separate SSD Drives ie Drive D and Drive F) 7.   Added all games to excluded list in Win Defender.8.   Windows Defender - turned OFF.9.   GPU and CPU - not overclocked.10. removed all unessential apps.11. Ran memtest86 - no errors 32gb RAM12. Removed all Saitek controllers and driver software. 13. checked Device manager for any conflicts. - no conflicts.Please note that after each procedure, other than BIOS update, I have rebooted and tried to run each sim. Each time I get the Sim loaded, it immediately crashes to reboot. There are no indications of error or fault in the sims error log.I have no idea what else I can do to sort this problem out.ANY ideas appreciatedRegardsTony"]},{"symptom":"windows 10 start Error (0xc000021a)        when my computer start it stop and shows 0xc000021a code. I tried many ways but can't resolve. please help to get my installed software back.Thank you","solutions":["Hi,I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Let us try repairing the existing OS.On a working computer, create an Installation media of Windows 10 that allows you to repair existing Windows Installation.Create a USB Flash Drivehttps:\/\/www.tenforums.com\/tutorials\/2376-create...Boot from the USB Flash drive-Make sure you have disabled Secure boot\/Fast boot in BIOS Settings.https:\/\/www.tenforums.com\/tutorials\/21756-boot-...https:\/\/www.tenforums.com\/tutorials\/21284-enabl...Then open Advanced Startup options after the computer boots from USB. Click Repair your computer at the first screen that says Install now.https:\/\/www.tenforums.com\/tutorials\/2294-boot-a...Select Startup repair, let it finish the job and see if the computer can boot afterward.If that doesn't help, consider doing a clean install after rescuing your files.Rescue Files when Windows won't starthttps:\/\/answers.microsoft.com\/en-us\/windows\/for...How to do a clean installhttps:\/\/answers.microsoft.com\/en-us\/insider\/for...https:\/\/answers.microsoft.com\/en-us\/windows\/for...Disclaimer: Tenforums is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"Photos software freezes; selects all photos as new; takes mulitple attempts to find device        My machine is updated to the latest Windows 10 software, and the Photos program is updated to the latest software. My iPhone is also updated to the latest software.When attempting to download photographs from my iPhone X to my Windows 10 PC, initially the Photos program does not recognize the iPhone although it is connected by a USB cable. After retrying multiple times, the Photos program will recognize the iPhone and pop up the \"Looking for new photos and video\" window. Is this just due to some timing issue?Once the \"Looking\" window is active, the program selects all of the photos on the iPhone, not just the new ones, claiming they are all new. Any way to correct this behavior?More recently once the \"Looking\" window has found all the \"items\", the animation stops moving, and there is no progress. Looking at the Task Manager screen, the program is not using any CPU time, and shows some retained memory. Once the Task Manager screen is opened, the Photos program crashes. Very frustrating since I am spending hours trying again and again attempting to luck out and hit the one time the Photos program decides to cooperate. Is there a fix for this?Thanks for your time.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Let us reset Photos app and check. Go to Settings Click on Apps Select Apps and Features Select \"Photos\" App Select Advanced Options Select Reset. Restart the PC as well as the iPhone and try to import pictures."]},{"symptom":"Anyone else seeing BSOD issues in cldflt.sys after installing KB4517389        On my laptop machine (but not on my desktop) I started getting BSOD failures in cldflt.sys after installing KB4517389. Symptoms basically the same as those reported inhttps:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/onedrives-cldfltsys-causing-ntfssys-bsod\/d2ef7f16-9e45-406f-95ca-6e595271e6d9?page=1Uninstalling KB4517389 fixes the problem. Presumably, disabling cldflt.sys would do so, too, but I haven't tried that yet.","solutions":["Hi WalterFarrell Greetings! I am Vijay, an Independent Advisor. cldflt.sys is a Windows component, hence it is not the root cause. To identify root cause, I need to analyze minidumps generated by crashes with WinDBG. WinDBG is the only tool which can do end to end complete analysis of ..dmp files generated by BSOD (Blue screen of death). Go to C:\\Windows\\Minidump Zip the contents of the folder corresponding to date and time of your crashes. Upload the content to Onedrive or any other file sharing site for me to locate the problem.If you don't get minidump files in above folder, you will need to enable minidump generation. If you need help to generate Minidump -http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... HOW TO UPLOAD TO ONEDRIVE 1. Login to https:\/\/onedrive.live.com\/ utilizing the same Login ID and Password which you have used on this forum. (or use the installed Onedrive on your computer)2. Click Upload in the top OR drag and drop the file here. 3. After uploading, right click the file and choose share. 4. Click Copy Link. 5. Copy the link and paste the link here.","I am not seeing a problem but I don't know what the file is for.  I can say, the version I have appears to have been installed by KB4517211.","Thanks, Vijay.Here's the minidump: https:\/\/1drv.ms\/u\/s!AvgPdPZisZN3hx_tlalT-vlQJqpE","Thanks, Saltgrass.The prior version of the file (installed last month) works fine. The version installed with KB4517389 fails for me on the one system (but works on the other). That file, from what I've read, is for cloud support, and specifically for OneDrive support, I think.","A. Analysis Results File Name: 101219-10000-01.dmp SYSTEM_SERVICE_EXCEPTION (3b) IMAGE_NAME: cldflt.sys *** WARNING: Unable to verify timestamp for dump_iaStor.sys B. Third Party Drivers dump_iaStor.sys - Intel RST Driver Driver date - Wed Nov 30 09:09:19 2011 C. Recommendations a. Create a system restore point first so that if something wrong happens you can revert.Type restore point in Cortana Search > Create a Restore point > Check whether against your drive, Protection is ON or not. If not ON, click Configure button below to Make it ON > Now press Create to create a restore pointb. Download latest driver Intel RST driver from and install https:\/\/downloadcenter.intel.com\/download\/27984... Download SetupRST.exe Disclaimer - This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thanks, Vijay. However:As far as I can see that file is not installed on my system; andSetupRST.exe tells me that my platform is not supported.Since installing KB4517389 makes the error occur, and removing it solves the error, isn't it more likely to be an issue with that update?","Report this to Microsoft so that this issue can be fixed in future updates. Press Windows Key+F to invoke Feedback Hub to send the issue to Microsoft.Since the issue has been caused due to recent Windows update - I would suggest that you uninstall the latest KB update and hide it so that it doesn't install it automatically and wait for new update to come which will be installed automatically.Microsoft has provided a tool Show\/Hide Updates tool to block the update Download the tool from below link http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2...When you run this troubleshooter, it will search for available updates and list themSelect the update which you want to hide. Click Next and follow on-screen directions","Thanks.","Welcome","環境は何も変わっていないのにKB4517389がインストールされた瞬間からブルースクリーンが出て自動でリブートされ、ログインしたらブルースクリーンが出て、の繰り返しになる。KB4517389をアンインストールしたら落ちなくなった・・・それだけだ。"]},{"symptom":"goggle help        Hiis there a way to delete goggle my search days all at ounce instead of individual days?thank you","solutions":["I'd ask in Google forums: https:\/\/support.google.com\/chrome\/community?hl=en"]}]}