{"windows":[{"symptom":"Dell Inspiron 3670 - Back audio jacks do not detect headset        I'm using a Run Mus K1-B headsetNothing happens when I connect the headset to the 3.5mm jack on the back panel. No audio is transmitted, and my PC does not seem to detect them. This is not a problem when I connect my external speakers, as they work normally, so it isn't a problem with the ports themselves.I have tried both line out jacks to no avail","solutions":["More than likely there is a jack on the front of the PC.","Hi Ginger. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything possible to try for headset problems so at least something will work. If you need help performing any steps I am standing by here to help:First try the steps here: https:\/\/www.maketecheasier.com\/fix-headphones-n...https:\/\/www.windowscentral.com\/setting-your-hea...https:\/\/www.lifewire.com\/fix-headphones-not-wor...https:\/\/www.thewindowsclub.com\/headphones-not-w...https:\/\/merabheja.com\/fix-no-speakers-or-headph...https:\/\/troubleshooter.xyz\/wiki\/fix-headphones-...Go to Settings > Devices > Autoplay to look for the device and change the default behavior in it's Dropdown Menu.Right click Volume icon in System Tray at right end of task bar, Open Sounds Settings, in dropdown menus at top make sure Headphones are selected and Connected for both Playback and Recording Default Devices.If not again right click Volume icon in System Tray to choose Troubleshoot sound problems.See how to re-enable the \"Which device did you plug in\" popup which can solve headset issues:https:\/\/windowsreport.com\/you-just-plugged-unpl... (avoid ad links)https:\/\/h30434.www3.hp.com\/t5\/Notebook-Audio\/En...https:\/\/forums.tomshardware.com\/threads\/how-do-...https:\/\/www.dell.com\/community\/Windows-10\/How-g...https:\/\/answers.microsoft.com\/en-us\/windows\/for...Go to the Device Manager reached by right clicking the Start button, choose Sound controller device, on Driver tab choose Roll back or Uninstall, restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver. Do the same for the headset device and\/or it's microphone. Update the Sound driver from the PC or Device maker's Support downloads web page. While there also check that the Chipset, BIOS, Display, USB, Network and all other drivers are the most current.Sometimes it helps to unpair or disconnect all other Bluetooth devices from the PC in Bluetooth settings, then try again to connect the headset.If this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t...If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....To check over the integrity of your install go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m...If you want to report this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems.If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it. If you are an Insider I can also vote it up with my MVP badge and track the issue for you.I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows 10 Education Activation Failure        I have spent about a year using my new PC, which I had a friend of mine build from the ground up. One of his friends had access to a copy of Windows 10 Education, which he installed on the PC. After a little time, I realized while trying to personalize that Windows was, apparently, not activated. He claims that he had a key and got it activated. Unfortunately, my friend cannot get into contact with the person who did the install, so I have no way of getting this key from them, if they even still have it. My PC appears to have had the key at least attempted before.Over time, I have looked more into how I could fix the issue, and every time I came up empty. Finally, I'm sick of the setbacks to Windows not being activated (and the watermark on the screen that I have been trying to look past for a year now) and want to get to the bottom of this once-and-for-all. Coming up dry yet again on a search for solutions, I thought that maybe I should suck it up and purchase Windows 10 Home to install. However, I nearly gagged when I saw the price tag. That will require quite a bit of saving up.Just looking for ideas, suggestions, anything that may help before I give in to buying another copy of Windows in an attempt to fix this one.Thanks in advance.","solutions":["Hi Jesus, thanks for posting your question in the community! My name is David, I am an independent advisor and I am here to guide you.In this situation, if you do not have the Windows 10 Education product key, the available processes are limited to obtaining the product key of the installed operating system or acquiring a new product key.I understand that your situation may be annoying, however if you want to use Windows 10 and have all the updates and features available, it is necessary to have the product key.I recommend that you check in a physical authorized computer store if they have a discount for Windows 10 Home licenses, in some situations this usually happens.Let me know if the information has been useful for you or if you still need more help."]},{"symptom":"Internet problems with my new laptop        I recently bought a new lap top. Device name: EBKCSHN5Product ID: 00325-81460-05410-AAOEMIt dropped internet and does not detect any networks.","solutions":["Hi BHASKERPUJARI, Are you sure airplane mode is not activated. Please see below: https:\/\/support.microsoft.com\/en-ca\/help\/402742...Let me know if this doesn’t fix the issue."]},{"symptom":"PC on Domain network locking automatically when using        Hi team ,     We have a SCADA system at one of our client's which comprises of around 11 operating workstations with OS - Windows 10 LTSC and  servers with OS-windows Server 2016 . It is observed that some of the operating workstations are getting locked out randomly while under operation under the user \"Operator-1\" with all software and service running in the background . User has to further to put the password to sign in again. This is disturbing the plant operation.1. This is happening only for 3 or 4 workstations in a random manner and frequency is 2 or 3 times per month. Domain settings are default domain controller settings only .2. It was observed that the user \"Operator-1\" was logged in to the domain from more than 8 workstation along with active sessions of other user accounts also.Now we had created users in active directory and segregated them to the different workstations, so that a single user is not logged in to the domain from more than 4 workstation. But we would like to know the actual root cause of this lock out issue , which has to prevent similar future incidents.***Original title: Windows 10 workstation gets locked out automatically while working.***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that the workstations are getting locked automatically when in use. We do have a dedicated forum, where we do support issues related to Domain Environment. Let me help you in pointing towards the right direction, I would suggest you to post your query onTechNet forums, where we have support professionals well equipped with the knowledge on Domain Environment to assist you with your query. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Camera will not come on        My camera on my windows 10 computer is showing that it is on but nothing is coming up like it is just a gray with a picture of a camera with a line throw it. I just got my screen fixed and I do not know if they did something that I can not fix or if I need to have them relook at my computer. Thanks for the help :)","solutions":["Hi TI. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you all other possible fixes that are working for others for webcam problems. If you need help performing any steps I am standing by to help.1) Try resetting the Camera app at Settings > Apps > Apps & Features > Camera > Advanced Options.2) Did you enable the Privacy setting to allow apps to use your webcam? https:\/\/privacy.microsoft.com\/windows-10-camera...https:\/\/www.lifewire.com\/fix-windows-10-webcam-...3) Try also these steps for when webcam isn't working: https:\/\/support.microsoft.com\/en-us\/help\/13753\/...https:\/\/www.lifewire.com\/fix-windows-10-webcam-...https:\/\/www.kapilarya.com\/something-went-wrong-...https:\/\/support.microsoft.com\/en-us\/help\/13753\/...4) Try Updating the webcam driver from the PC or webcam maker's Support Downloads web page for your full model number, Serial Number, or Dell Service Tag number from sticker on PC.Also compare all other drivers including Chipset, display, sound, etc to make sure you have the latest on the PC maker's Support Downloads web page.Additionally on Webcam Driver tab see if Roll Back is available, if not try Update Driver, first Automatically, then Browse, then Let Me Pick to try all previously installed Drivers.If these fail try to Uninstall the Driver, restart PC to reinstall. 5) If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool explained here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... 6) If this was caused by a Version Update then you can roll it in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool explained here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... 7) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. 8) If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... If there are any hurdles during install then these steps can overcome them: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thank You Greg :DYou are a Nice man ","You're most welcome TI. I am glad to help. Let me know if there's anything else. Also when ready please mark the post which helped most as the Answer, to help others.Happy New Year!"]},{"symptom":"Disk partition issues        Dear All,Below you can see the disk manager imaging of my SSD's Disk 0 is my working drive Samsung 970 EVO 2TB including windows.Disk 1 is my weekly Clone (Macrium Reflect) of Disk 0 on a Samsung 860 PRO 2 TBDisk 2 is a weekly Image of Disk 0 on a Samsung 850 PRO 1TBDisk 3 is a weekly Image of Disk 0 on and external WD My passport 1TBDisks 0, 1 and 2 display 450MB at the start with no assigned drive letter or other information.Can someone let me know what this space is and should I just leave it as it is.Thank you for your help","solutions":["Hi Dinos. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.It should be the Recovery partition Windows installs that contains the WinRE tools that Windows fails over into when it cannot start, which in previous Windows editions were on C drive.To confirm this you can install free Partition Wizard to assign a Drive letter to Explore it and look for the Recovery folder:https:\/\/www.partitionwizard.com\/download.htmlYou can also confirm it works by triggering WinRe by one of these methods: https:\/\/www.tenforums.com\/tutorials\/2294-advanc...I'm not sure why it's not labeled but could be due to it being a factory install or the multiple clonings dropping the label.The rest looks OK. ______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"why windows 10 reset has been removed        please I was using windows 10 pro and i used to reset my laptop when ever i want to format me laptop but now I'm using windows 10 home and if I try to reset my laptop windows will be will be sayinginsert your windows installation. I want to ask whether it's the windows 10 home or is the latest update that is causing it.","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,Windows 10 home also has the feature to perform a reset. Normally this happens due to the system's recovery components getting corrupted therefore some features such as the reset would malfunction.I would first suggest processing a reset feature through the windows recovery environment.1. Go to start menu and open settings (gear icon) 2. Open update and security and open recovery 3. On the recovery window, under advanced startup choose to restart now Navigate to, Troubleshoot - Advanced Option - Reset this PC Alternative to reinstalling windows https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/support.microsoft.com\/en-in\/help\/400073...Let me know how it goes. :)"]},{"symptom":"Windows Subsystem for Linux and Windows OpenSSH server - bash shell        So, I'm running Ubuntu on WSL and it APPEARS to be installed OK, I can run it and have added a local administrative user; but, when I connect via the Windows 10 OpenSSH server and try to run bash, I get this:foglight@N7QNM-RADIO C:\\Users\\foglight.N7QNM-RADIO>bashWindows Subsystem for Linux has no installed distributions.Distributions can be installed by visiting the Microsoft Store:https:\/\/aka.ms\/wslstoreHelp?Clay JacksonclayJ@n7qnm","solutions":["Hi Clay, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues with connecting to OpenSSH on Windows Subsystem for Linux. We do have a dedicated forum, where we do support issues related to Windows Subsystem for Linux. Let me help you in pointing towards the right direction, I would suggest you to post your query onTechNet forums, where we have support professionals well equipped with the knowledge on Windows Subsystem for Linux to assist you with your query. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"\"Pictures\" to become imported \/transferred to Windows Photos        How do I get the pics in Pictures to become imported to  Windows 10 Photos ...","solutions":["Hi,What do you mean “Pictures”Could you check the file extension name? It would be better if we the format (file type) of your \"picture\"Regards.","\"Pictures\" is a folder  found in This PC with all  your  stored pictures files ..I want to transfer them to \"Photos\" found at \"start\"","Hi Wolf. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Link the User Picture folder and any others that contain your pictures in the Photos app Settings > Sources > Add a Folder, as shown in this tutorial:https:\/\/www.tenforums.com\/tutorials\/116104-add-...The Pictures will now all show up in Photos app so you can edit them, create Albums, and all the other features shown in the above tutorial and these others:https:\/\/www.howtogeek.com\/320942\/how-to-use-win...http:\/\/www.thewindowsclub.com\/story-remix-edito...https:\/\/www.techradar.com\/how-to\/computing\/how-...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","\"Pictures\" is a folder  found in This PC with all  your  stored pictures files ..I want to transfer them to \"Photos\" found at \"start\"I need to move my photos from windows 7 cause I'm going to upgrade to windows 10. How do I do this without lousing my photos? Can I saved them to a folder to put them on windows 10?   Please help asp..","Thanks  ..I  have  been doing that but when you click on the folder  \"Pictures\"  to import all the files within the folder nothing happens ...if you select a specific \"file \" within Pictures lets say  the folder containing all the pictures within the file \"2019 Antarctica\" nothing is imported .By default\" Photos app\"is to find all pictures within the PC and import them automatically to \"Photos \"","What is the path showing now in Photo app Settings under Sources? It should import the pictures in dated folders in reverse chronological order under the Collection tab.","Hi, The update won’t change the partitions of your disks. There will be a folder called old (forget the accurate name) in the original C disk. It held all the files of the old system in the system partition and can be used to restore within a period of time. The other partition files will not change.Thus you can copy that picture folder (with files) to D\/E\/F disks to prevent losing any data.","you sent this to the wrong person betty ","the path??It just lists the 4 folders that I tried to import from pictures with an x beside each one At one point it had a message that it found nothing in the files ...I think that the app is corrupt ...this a new  hp pc ..I ..my last pc with win 10  installed found all the folders in Pictures and transferred them automatically by default  ..I did nothing ","This is not a transfer. Your files live in their User Pictures folder. You link them using the Sources > Add a Folder so they also appear in the Photos app to be synced between the two. Another way to think of it is Pictures folder is their home, Photos app is where they go to work or be worked on. It sounds like the wrong path is being used. It should be C:\\Users\\Your User Name\\Pictures. Isn't that where your Pictures reside?"]},{"symptom":"Drives set up with storage spaces not recognized after restart.        After a restart the computer hung for several minutes during startup, so I held the power button and then it loaded fine. After signing in I noticed that my D drive was missing, then I looked at the disk management utility where it asked me to initialize the disk then it throws the error \"a storage spaces internal error occurred\". Disk Management shows that there is a drive but that it is unallocated. Then I look at storage spaces and it doesn't list the drives at all. I dont really know what to do to troubleshoot or even how to format the drives since disk manager won't touch them.","solutions":["Hi Adam. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I would not use any RAID at all, because after 10 years daily in forums I've never seen anything except trouble with RAID, and with today's huge drives and backup imaging there's no good reason to risk your files using it.Already with Storage Spaces I've seen enough cases where all files were lost that I would not touch it.See here how to try to recover Storage Spaces: https:\/\/www.tenforums.com\/drivers-hardware\/9829...https:\/\/superuser.com\/questions\/1290859\/windows...https:\/\/superuser.com\/questions\/1295399\/did-i-j...https:\/\/www.minitool.com\/data-recovery\/recover-...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","The issue is that storage spaces does not list the pool or drives at all. But the pool shows up as unallocated and doesn't initialize in Disk Manager. The third link seems to be the closest to my situation but it doesn't have a whole lot of info since \"just came back to life\" for them. ","Try restarting the PC a few times. What output do you get if you open an elevated Command Prompt and type: Diskpart List Volume","This is what I get backThen this is what Disk Manager looks like","See how others handled Storage Spaces becoming Unallocated: https:\/\/superuser.com\/questions\/1325930\/recover...https:\/\/forums.tomshardware.com\/threads\/how-to-...The resources I've given you are the only fixes found out of many more cases where Storage Spaces failed."]},{"symptom":"WiFi gets unplugged after awhile on Laptop        My Wi-Fi gets disconnected from my laptop after doing heavy work such as playing video games. I noticed this after an update(don't know which one since we didn't have internet for awhile due to a typhoon).I tried to disable the setting \"Allow the computer to turn off this device to save power\" and thought that it might do the trickHowever, the Wi-Fi still disconnects from my laptop as shown in these images:It's not even shown on the devices list anymore. My Wi-Fi drivers are up to date and Windows is also up-to-date. Is there any workaround to this besides using the Restore Point since that isn't very efficient for me(considering the internet speed of my country).","solutions":["Hi Staki. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything that works to fix Wifi so that at least something will work. Even if you've already tried a step please try or check it again in sequence. If you need any assistance I'll be standing by here to help:Update your network adapter drivers from the PC maker's Support Downloads web page using the full model number, HP Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.If you have the latest network driver then try on it's Driver tab also to Roll Back, or Uninstall and then restart PC to reinstall the driver. Try also all older drivers from Update Driver > Browse > Let Me Pick list working backwards.Go to Device Manager > Network Adapters, select Wifi adapter, then Power Management tab, clear the check box to \"Allow the computer to turn off the device to save energy.\" Then on the Advanced tab disable any energy-saving options.If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool explained here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them.If this was caused by Version update then you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool.For Wifi won't connect after Version 1903: https:\/\/windows101tricks.com\/fix-wifi-keeps-dis...https:\/\/www.techrepublic.com\/article\/wi-fi-and-...https:\/\/pureinfotech.com\/fix-wifi-problems-wind...Enable IPv6 in the network adapter settings: https:\/\/www.tenforums.com\/tutorials\/90033-enabl...Run the fixit from https:\/\/support.microsoft.com\/help\/929852 (Re-enable IPv6 on all nontunnel interfaces) and reboot.Right click the network icon in System Tray at bottom right end of task bar to Troubleshoot Problems.Try all of these steps: https:\/\/support.microsoft.com\/tr-tr\/help\/10741\/... https:\/\/www.kapilarya.com\/how-to-reset-network-...Go to Settings > Network & Internet > WIfi > Manage Known Networks, highlight and remove the network having problems, restart PC to see if it shows up again.Try plugging in by ethernet cable to the router to compare, then plug the ethernet cable into the modem (if separate) to see if this might be an issue with the router.Try powering off modem, router and PC and then restarting in that order with 1 minute in between each. You may need to reset your router or even optimize it following these steps:https:\/\/www.lifewire.com\/resetting-a-home-netwo...https:\/\/www.pcmag.com\/article\/258865\/how-to-set...Your router manual is always available from the manufacturer's website for your exact model.You also are entitled to Support from your internet provider to get online on all devices. This is always included in the monthly bill. If your router is less than a year old they will also Support getting it connected and optimized.Another option is you could replace the wireless adapter with an inexpensive USB nano adapter like this one:https:\/\/www.amazon.com\/OURLiNK-600Mbps-Wireless...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I notice that the picture shows Airplane mode.  Do you have this on?  If so then you would not have WiFi or Bluetooth active.","I notice that the picture shows Airplane mode.  Do you have this on?  If so then you would not have WiFi or Bluetooth active.Airplane mode is turned off. Tried clicking that on and off and it's pretty much the same.","Will try the Wi-Fi adapter. And probably also LAN(I don't have a LAN cable yet) Thanks for the numerous possible solutions!"]},{"symptom":"my computer is stuck in a boot loop!        this happened about a few months ago as my computer crashed, restarted and became stuck in a boot loop.i have tried searching around, looking for things to fix the “srttrail.txt” popup, and the “your pc did not start properly.” i have since given up as i have not found an answer to this problem or one that works, but i have brought out my machine again for a second attempt.","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,I would recommend going into the windows recovery environment to access multiple troubleshooting options.Start your computer, once the computer goes to the windows logo screen press and hold the power button for 5-10 seconds to shut it down completely. Do this for 3-5 times to force access the recovery environment.a) Startup repair Go to troubleshoot, advanced options, startup repair (This would attempt to repair the system)b) System Restore Go to Troubleshoot, advanced option, system restore (This would roll back the system's configuration to a specific time and date)c) Safe mode Go to Troubleshoot, advanced option, startup setting, click on restart and this would provide you multiple options in terms of booting up the computer.Choose to boot into safe mode, once accessed you could either uninstall the update or check if all your drivers are up to date. A clean boot under safe mode would also help to make sure no softwares are affecting the system1. Go to start menu\/search msconfig 2. On the system configuration window go to the services tab 3. Tick on hide all microsoft service so that this won't be affected 4. Choose to disable all services 5. Next, go to the startup tab and on the window choose to open task manager 6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok 8. A prompt to restart the computer will show up, choose to restart d) Reset this PC In the event that it still fails, I would recommend reinstalling the operating system. The option enables you to keep your files although uninstall programs that did not came with the system.Troubleshoot - Advanced Option - Reset this PC Alternative to reinstalling windows https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/support.microsoft.com\/en-in\/help\/400073...Let me know how it goes. :)","thank you for responding!I have tried all of these options, and they did not work for me, as when i did get into the recovery environment...*all of these led me to same error (automatic repair couldn’t fix your pc...log file: C:\\WINDOWS\\System32\\Logfiles\\Srt\\SrtTrail.txt)option A; just boot loops again (preparing automatic repair > diagnosing your pc)option B; does not allow me to revert to a last known working versionoption C; would also return me to the boot loop (preparing automatic repair > diagnosing your pc ~ couldn’t repair)option D; does not allow me to reinstall windows while keeping my data or a complete wipe and a reinstall.to be completely honest, i think my machine had already taken its last breath by the looks from its current state.","Windows is software, only hardware dies. Unless your PC has confirmed dead or dying hardware, then software can always be repaired or replaced, and if you've not done a Clean Install yet this is the opportunity to get the best possible install, one which has had no return problems by any of the millions who have tried it. Let's start at the top with all possible steps to get Windows started leading up to if necessary a Reset saving files or a Clean Install with file rescue.Unplug power and remove battery, press and hold power button for 30 seconds to release all power from circuitry, plug back in and power up to see if any change.I will give you steps to access the Repair Mode to try all repairs to get Windows started, and if not to do the automated Reset or the superior Clean Install after rescuing your files.1) Use whichever method works in this link to access Advanced Startup Options: https:\/\/www.tenforums.com\/tutorials\/2294-advanc.... Easiest may be to force shut down the PC (by holding in the power button) three separate times to trigger the Startup Options. If one of these methods work, then go to Step 3.2) If none of the other methods work it may be necessary to Create Windows 10 Installation Media on another PC following the steps in the middle of the downloads page here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... Make sure to uncheck the box for Recommended Settings to choose only the licensed version.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... Choose the boot device as a UEFI device if offered, then on second screen choose Repair Your Computer. If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first. There is always a way to get the media booted and I will guide you until it does, even if necessary to reset the BIOS to defaults via several methods.3) In the Advanced Troubleshooting options try to System Restore to a point before the problems began, try the new Uninstall Updates button, then Startup Repair, then if necessary from Startup Settings try to get into Safe Mode with Networking, or lastly Safe Mode. If Startup Settings aren't available you can force Safe Mode from the Command Prompt following Step 5 here:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf..., or using the command to unhide F8 Advanced Boot Options here:https:\/\/www.tenforums.com\/tutorials\/22455-enabl... where you can also try the old reliable Last Known Good Configuration.4) From Safe Mode w\/Networking work through the Windows 10 Install Integrity Checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... Update your drivers from the PC's Support Downloads web page. Compare the latest drivers with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.5) If Safe Mode doesn’t work or help stabilize things then return to Advanced Troubleshoot options. Next try Command Prompt to run through Windows 10 Install Integrity Checklist (above link) Step 10 repair commands including sfc \/scannow, DISM, a full Disk Check: https:\/\/www.groovypost.com\/howto\/check-hard-dri..., or return to Troubleshoot options to Reset Your Windows 10 PC.6) Better yet use the same booted media to do the vastly superior Clean Install following the steps in this link to delete all partitions down to Unallocated Space to get it cleanest:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... 7) There is a step to Rescue Files from the booted media or Repair Mode Command Prompt first:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... These steps are excerpted from my tutorial that compiles everything possible for Troubleshooting Windows 10 Failure to Start:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... You can continue with the other steps there.To test hardware, Dell and HP have onboard diagnostics triggered by powering up and pressing the F12 and ESC key respectively.Test the RAM overnight to stress it with the best bootable test memtest86, following these steps which test both the sticks and the slots:https:\/\/www.wikihow.com\/Test-PC-RAM-with-MemTest86Test the hard drive with diagnostics: https:\/\/www.lifewire.com\/free-hard-drive-testin...Best is to use the manufacturer's own if there is one, otherwise use Seatools bootable long test:http:\/\/blog.nowherelan.com\/2013\/04\/04\/boot-seat... Follow this up with a full Disk Check: https:\/\/www.groovypost.com\/howto\/check-hard-dri... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer There are links to a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Sign In        wondering how you change your name when your computer first comes up where you enter pin or id number","solutions":["Hello LoisThomson, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemYou are using most likely a Microsoft account to log in, if You want to customize the login, you should create a local admin account. as described in this Microsoft article:https:\/\/support.microsoft.com\/en-us\/help\/4026923If you want to remain using Microsoft account and change the name as well, follow this article to change your account name.https:\/\/www.windowscentral.com\/how-change-accou...Please note the second link is not a Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Feel free to ask back any questions and let us know how it goes. Cheers! Farah","Hello Lois,The tutorial below can help show how to change the account name shown on the sign-in screen depending on if this a local account or Microsoft account.https:\/\/www.tenforums.com\/tutorials\/89021-change-user-name-account-windows-10-a.html","Hello Lois,The tutorial below can help show how to change the account name shown on the sign-in screen depending on if this a local account or Microsoft account.https:\/\/www.tenforums.com\/tutorials\/89021-change-user-name-account-windows-10-a.htmlThank you this resolved the question","You're most welcome. "]},{"symptom":"Autocorrect is turned off but the computer corrects my spelling of \"answer\" to andwer.        Although I have turned off autocorrect, whenever I write the word \"answer' it is corrected to \"andwer\".  HELP! It's driving me crazy.","solutions":["Shawn Brink explains how to add and remove words from Windows 10's autocorrect list.","Hi Kay. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.You said you have turned off Autocorrect Misspelled Words in Settings > Devices > Typing? Check it's still set as you want.If so what app is this happening in? It may have it's own spell check."]},{"symptom":"microsoft your phone companion for android        I have \"Your Phone Companion\" installed on my Samsung S10E. Both Galaxy Store and Google Play indicate that it is installed. It appears in the detail list of applications in \"Settings\". However, I am unable to find the icon among the icons of installed apps. Why??","solutions":["Hi Kraska. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See here how to find an app installed on your Samsung phone: https:\/\/www.samsung.com\/ae\/support\/mobile-devic...https:\/\/support.t-mobile.com\/docs\/DOC-39470I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Managing the ‘Shortcuts’ to my Folders and Documents in File Explorer        I have (literally) hundreds of Folders, Sub-Folders, Sub-sub-Folders (etc.) and (literally) thousands of Files (Documents) in my (Windows) File Explorer.Very often I need to have the same document in more than one Folder or Sub-Folder.So what I do is create ‘Shortcuts’ of the File (Document) and place them in the Folders or Sub-folders where I need to keep exact duplicates.Now very often, or it is not uncommon for me, to change the names and order of my Folders and Sub-Folders.Sometimes when I make ‘big’ changes, then the Shortcuts stop working or in other words, the links to the Shortcuts are broken.How do I manage my many Shortcuts?Is there some way I can keep track of my (many) Shortcuts in (Windows) File Explorer?Thanking YouBest RegardsImtiaz","solutions":["Hi, Unfortunately not. Since you change the file path by moving folders around a lot, this breaks the shortcuts as the file paths change.Maybe you should have a master folder which you don't move around and this holds the files you are creating shortcuts to? If you do this, you can change the folder structures where your shortcuts live without any issues."]},{"symptom":"Windows moves windows when laptop lid is open\/closed.        I want Windows to stop moving windows back and forth when I open\/close laptop lid. I have things where I want them and do not want Windows to anticipate what it thinks I need. The movements seem random and sometimes a window cannot be found on either screen. Power setting for lid close is Do Nothing.Suggestions appreciated.","solutions":["Hi Preserved, Most of the time, Screen Scaling is the culprit of this issue. Go to the Windows Start Menu. Choose Settings. Select System. Select Display. Look for Scale and layout. Select an option, such as 125% or 150%. Displayed items will appear larger as the scaling increases.Your display will re-size. Try again from the top if a certain % won't work for you. Do trial and error and if this continues, please let us know. Thanks and regards,","I do not see the connection to scale but I tried per your suggestions. The scale was 100%, I tried 105, 110, 90, and 95% but windows still shift from one screen to the other. For example if Firefox is on the external monitor and I open the laptop lid, Firefox jumps to the laptop. That is one of the least annoying but easily producible actions.","Hi, I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.There is two parts to your issue. 1. Your laptop's display power might be cut off when you close the lid. This basically detach the display on a physical level and there is nothing else you can do about it. The best way moving forward is to set your external display as the primary display.2. As you have experienced, Windows will turn off the built-in display when the lid is closed. This will move opened Applications to the external display. There is a hack by changing \"ACPI Lid\" to \"Volume Manager\" in Device Manager. See post here by yakup:https:\/\/forums.whirlpool.net.au\/archive\/1421975. Since this is a hack, by proceeding you accept risks of damaging your laptop. I did a test on my computer laptop, and it did work. The windows does not shuffle when laptop lid is closed, and it continues to show something.Let me know if I can help you further! Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thank you for responding and thanks for the hack. However, I think you have not addressed the example I gave. I will try again.Lid is open, Firefox is started on external monitor.Lid is closed, Firefox stays on external monitor.Lid is opened, Firefox moves to laptop monitor although it was never there before.Update:Tried the hack. There was no volume device so I tried using system speaker to no avail.JH","Hi JH, which is your primary display when your display is extended?","So based on my tests, Windows will always move opened windows back to the primary display when Lid is opened. I figured this is because when you close the lid, all opened windows moved to secondary display and when lid is opened they all will move to the primary display. This would be a good article to read and consider. https:\/\/sea.pcmag.com\/gallery\/33117\/6-ways-to-i...Please let me know if I can help you further! Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Laptop."]},{"symptom":"no sound threw hdmi but have vieo        no sound threw hdmi but have video","solutions":["Hi Sherie. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See fixes for HDMI sound problems: https:\/\/www.easytechguides.com\/connected-pc-to-...https:\/\/forums.tomsguide.com\/threads\/no-sound-i...https:\/\/support.hp.com\/us-en\/document\/c01186408https:\/\/www.windowstechit.com\/16388\/windows-10-...https:\/\/www.lifewire.com\/fix-hdmi-connection-pr...https:\/\/www.youtube.com\/watch?v=4DA6CMsde2kI hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Sonic Headphones For Windows\/Spartial Sound Not Working        Is it because of my computer specs? Because i tried every solution possible and i cant seem to click it(it is grey out) and when i go to properties and try to select it from a dropdown list, it auto reverts back to “off” the moment i click it","solutions":["Hi Wei. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Review how Spatial Sound for headphones is supposed to work here: https:\/\/www.howtogeek.com\/356481\/how-windows-so...See how others are handling this: https:\/\/answers.microsoft.com\/en-us\/windows\/for...?https:\/\/www.thewindowsclub.com\/something-went-w...https:\/\/answers.microsoft.com\/en-us\/windows\/for...?https:\/\/thegeekpage.com\/fix-something-went-wron...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Can't type in certain areas        Hello, please could someone help.I have an Acer EX2519 laptop and I have Office Home\/Personal (?)  installed.  It was working fine till a few weeks ago.  I can type my password and log on at start up, but it won't let me type in the following situations:-1) log onto a wifi network - type password2) type my password to login to my Microsoft account 3)  type anything in the search bar after start upKeys work fine in Word and Excel but won't work for other things.Pse help.Thanks","solutions":["Hi LauraHazelden and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes. I will keep working with you until it's resolved.Thank you!"]}]}