{"windows":[{"symptom":"saa 7130 tv card        I have a 32 bit saa 7130 tv card installed which ran with honestech tvr 2.5 software on windows 7 32 bit. I have installed windows 10 and cannot run card and software. please advise","solutions":["Check with the maker of the card to see if they have made new drivers for Windows 10.","Hi Stan. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.You'd need to contact the card manufacturer to see if Windows 10 is supported with drivers, software or patches to make it work.If not you can try installing the driver and software in Compatibility Mode as shown here:https:\/\/social.technet.microsoft.com\/Forums\/win...https:\/\/www.groovypost.com\/howto\/run-old-softwa...If not then you'd need to buy a new TV card or try some of the modern streaming apps which are popular now in Windows 10.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi stanholmes,I wish I could help coz I have the same card (I suppose) too.Step 1: Make sure that the card is detected. Sometimes it will show up as Philipps TV card. Right click on that and uninstall. Please also check the 'delete driver software for this device' on the window\/dialog box that will pop up.Step 2: Restart your pc and disable the device hardware signature enforcement (I think this is option 7)Step 3: Install your TV tuner with the software that worked with Windows 7. Use 'install driver anyway' when a prompt pop-up.TADA! You're good to go!PS: I turned it of coz snipping tool nor print screen won't capture a live image of the show.Please update me for anything.Regards,John Cyrille Ong","That card is very old. Philips does not support that card on Windows 10.","It works for me sir and I connect it to TV box to watch shows. I also noticed that he is also using honestech tvr 2.5 software which is the same as mine.I also noticed that a lot of people have 'these' kinds of problems after updating to Windows 10. Manufacturer left them out and in my opinion if a driver works for a previous version of Windows then why not try it....I got lucky I guess this time.Cheers!","I got lucky I guess this time.I prefer not to rely on luck."]},{"symptom":"win 98 gaming        how do i run a 98 program like a game on a win 10 system","solutions":["theres you a program to write , one that lets someone run win 98 games on a windows 10 system                                                               ","Hi keavenbrown, I am Dexter, an Independent Advisor, here to help you. Games written for Windows 98 cann't run on Windows 10, but you could use virtual machine to run Windows 98 and the old games.This article would help: https:\/\/socket3.wordpress.com\/2018\/10\/28\/instal..._______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","how do i run a 98 program like a game on a win 10 systemIn a virtual machine. That's how I play my W98-era Chinese Checkers game.Also have an MS-DOS virtual machine to play Gorillas."]},{"symptom":"Black screen with flickering taskbar Windows 10        I recently installed a new SSD on my ASUS laptop. To make my SSD as bootable i cloned my old HDD on to it using Kingston's cloning software.Everything is good until I login. Then all i see is a black screen with flickering taskbar. Even task manager is not working. I used CTRL+ALT+DEL to open options where i can sign out.The same problem persists on other accounts on the laptop as well.","solutions":["Hi, BakulSehgal My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"ERROR MESSAGE - VCRUNTIME140.dll        Hello I have recently experienced a Error Message - VCRUNTIME140.dll missing message, can anyone please give me some advice how to correct this please. Thank You ","solutions":["Hi WHP. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See fixes here: https:\/\/www.thewindowsclub.com\/vcruntime140-dll...You can try to repair Visual C++ here: https:\/\/docs.microsoft.com\/en-us\/visualstudio\/i...https:\/\/support.solarwinds.com\/SuccessCenter\/s\/article\/Repair-Microsoft-C-RedistributableGo into Settings > Apps > Apps & Features to locate versions of the Microsoft Visual C++ Redistributables 2015 and\/or 2017 and uninstall. Restart PC.Then reinstall them from here: https:\/\/support.microsoft.com\/en-us\/help\/297700...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Make sure you updated your Windows to the latest version. Otherwise installing Microsoft Visual C++Redistributable will solve this issue. https:\/\/support.microsoft.com\/en-us\/help\/2977003\/the-latest-supported-visual-c-downloads"]},{"symptom":"Intel Graphics driver fails to install on fresh Win10 installation        I purchased a new hard drive and installed Windows on it with media creation tool. After window's installation my second monitor is not being detected. It is plugged into my motherboard via HDMI and should be using Intel graphics as the display adapter (doesn't show up in device manager). My main monitor is plugged into my nvidia graphics card. My nvidia drivers are up to date. When I try to install intel graphics manually it says the computer does not meet the minimum requirements... the driver is coming right from my processors support page (here)Other things to note: I've restarted several times, disabled nvidia driver, plugged the second monitor into the graphics card and it works, my old hard drive with the previous installation of windows is still connected to my motherboard.Any suggestions? I've exhausted google's answersEdit: Also if I boot into my old hard drive, the second monitor doesn't work (it was working perfectly fine before installing windows on the new hard drive) And there is no Intel graphics display adapter in the device manager","solutions":["Is the Intel card detected in the BIOS\/UEFI Setup? Check all tabs. It may need to be enabled there due to a reset.If the Intel display adapter doesn't even appear in Device Manager anywhere then you'll need to reseat the card to try to get it detected.   This is likely the reason it won't install the driver, because the card isn't detected on the System.  Let me know if I'm misunderstanding this."]},{"symptom":"windows media player          i recently took my windows 7  tower in to  Geek squad to have a minor repair done somehow  they  did something wrong requiring the to reinstall windows 7 operating system  they back up files to my windows 7  and justrecent  got  a windows  10 and they back up the same files to that  anyway my question is      when they did this for some reason in my windows media player all my videos dissapeared  that i had installed there lost them  all is there any wy to retrieve them","solutions":[]},{"symptom":"shortcut indicators (arrows) disappearing when copying unrelated files in windows explorer        this is a duplication of the same thread here:   https:\/\/www.access-programmers.co.uk\/forums\/showthread.php?t=308829Noone answered me over there, probably because I'm such a smarta$$.  Who knows.  But regardless, this is still unsolved.  Here is what I have you guys....================================================================================================I have a directory setup on my laptop in the following manner:=> C:\\Users\\Owner\\Desktop\\[mixture of source files, folders and shortcuts are here]=> C:\\Users\\Owner\\Desktop\\new machine backup\\[many subdirectories are here, including a dir called \"desktop\"in the 2nd path structure outlined above, in the dir \"desktop\", I have all the source files and folders stored from the 1st path structure outline above. I regularly copy the contents of path #1 (not the shortcut links) to the subdir \"desktop\" in path #2, and subsequently copy the contents of that path to my external hard drive target dir, which is:=> D:\\new machine backup\\desktopThere's never been a problem with this operation until today, when I noticed that after doing this, all the shortcut indicators for the SC links located on the laptop's actual desktop location disappeared. see image below. funny thing is, when clicking on any of those icons, the source files still open and those sources are still located in the same place (verified by right clicking on the file and clicking \"open file location\"). furthermore, if I check the properties of any given shortcut on the laptop's desktop now, it shows a duplicated \"new machine backup\\desktop\" string in the target path! again, see image below. Anyone else have this happen? Have I caused the windows OS to become confused?  Certainly I have a tendency to confuse AI robots, so maybe the same thing happened here?","solutions":[]},{"symptom":"Xbox Game Pass for PC Beta - Can't select my d: drive to install games        I recently bought the game pass for my pc, but it has a small internal hdd so I normally download apps to my portable hdd and it is selected for all app downloads. When I try to download a game from the game pass only the c: drive shows and not d:.","solutions":["Hi FixingPhoenix80, my name is Jay. I'm an independent advisor. I'd be happy to help with your issue.Please try reinstalling gaming services. To do this: Launch powershell as an administrator and enter “get-appxpackage Microsoft.GamingServices | remove-AppxPackage -allusers”In the same powershell window, enter “start ms-windows-store:\/\/pdp\/?productid=9MWPM2CQNLHN”Install the app on that page, including accepting the UAC prompt when shown. Try installing the game again. Reference: https:\/\/beta.support.xbox.com\/help\/games-apps\/t... I hope this helps, please let me know how it goes. Thank you. Regards, Jay ____________________________________________________ Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"switch out of S mode        I follow instructions - go to settings - updates and security - activation - but when I click on store - nothing comes upIf I search on switch out of s mode in the store - I do not get the screen they show in videos - ideas?","solutions":["Hi. johnk-z My name is Anthony, an Independent Advisor trying to help. After restarting your computer, try the change process again, doing the following:1. Press the Start button located on the bottom left of your screen. 2. Select the Settings icon, located just above the power icon in the Start menu.3. Select Update and security in the Settings application. 4. Select Activation and then select Go to store. 5. Select the Get option. 6. Then press Install when you are ready to continue. 7. The process to change from S mode is seconds (maybe about five to be exact). You do not need to restart the PC for it to take effect. You can continue and start installing .exe applications now in addition to the Microsoft Store applications.And that is. While Windows 10 in S mode is designed for security and performance, it is not for everyone. Microsoft at least gives you the option to choose which version you prefer.Best Regards. Anthony. -","Same for me.  When I click on \"go to the Microsoft store\", the store opens, displays the menu bar and then a blank window below.I have ensured all windows updates installed, and all app downloads from the store itself. Windows 10 Home in S modeVersion 1809OSBuild 17763.615Microsoft Store Version 11906.1001.18.0","Hi John I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.This looks to be a known issue as many people are reporting the same. Please wait until tomorrow when it should be resolved hopefully.","Tried again today. Same as before.  Any other things to try?","Hi,Just got a new laptop today. I am having the same issue.Extremely disappointed. I am also getting a blank page on th Store.","I have the exact same problem. Typical Microsoft; they've been slowly trying to lock down users over the years and this Windows S mode bull is the worst of it so far. It's ridiculous that this is the default, and I feel bad for inexperienced users forced to use the god-awful Windows Store and Edge.Fix your garbage and let me use my computer how I want to; it's the entire reason I use the Windows OS.","Spot on summary.I too have a new laptop and not able to use 3rd party software due to Microsoft 10s restrictions. Fix this problem.","hi Anthony - thanks for replying - but my issue is I do NOT get the 'get' screen in step 5 in your list.....I see you tube videos of this process - and the screen is just not coming up for me like it does for others in step 5.....","I am having the same problem.  Go to the store and no such “switch out of s mode” appears.","I am having the same problem.  Go to the store and no such “switch out of s mode” appears.I am also having this problem.  I have just bought a new laptop and would never have got one with Windows 10 S if I'd known (thank you 'Which Best Buy' recommendation!!)  Everything is updated on the laptop but when I click on 'Go to Windows Store' all I get is a blank screen.Please, Microsoft, fix this now!  It is simply outrageous that I can't download the programmes that I want e.g. Firefox.Miriam"]},{"symptom":"Printer Brother HL1110        unable this ","solutions":["Hi David,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.I see you mentioned printer. What is the exact issue?You may see this guide as a first step:Fix Printer problems with Windows 10https:\/\/support.microsoft.com\/en-us\/help\/401540...","Unable to install printer Brother HL 1110","Here is the Quick Setup Guide for your printer, and here is the User's Guide.","Hi, Please check the following guide: https:\/\/support.brother.com\/g\/b\/faqend.aspx?c=u...Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"Constant OS Crashing\/Hardware Failure in Windows Reliability?        Hello all,My PC has been crashing a lot lately, and I am not sure why. In the Reliability Monitor, I took a look and found a lot of hardware errors. Unfortunately, it does not tell me the specific part that failed. Which is what I am hoping you folks can find out for me.Minidump folder:https:\/\/1drv.ms\/u\/s!Al68nZWXDWSshSUoudT_jq5_2AT-?e=SG7BHF","solutions":["Hi PickleWeasel425, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved.This one is not likely to be any fun. Troubleshoot blue screen errors <-- read this linkhttp:\/\/windows.microsoft.com\/en-us\/windows-10\/troubleshoot-blue-screen-errors If you are over-clocking anything STOP! (This can both cause BSOD and make troubleshooting impossible.)There were 6 different minidumps (sure wish you had zip'd them all into one zip) - 3 ea. 3B, and 1 ea. 1E, F7, and 7F. Very often a bunch of different BugChecks can mean a hardware problem is the cause.BugCheck 3B, {c0000005, fffff8061aa50d58, ffffec89f5876d60, 0}Probably caused by : memory_corruptionBugCheck 1000007F, {8, ffff9f00c2caf090, 61, fffff80739dc48fc}Probably caused by : memory_corruptionBugCheck 3B, {c0000005, fffff8012bec39ce, ffffe48a36e6e6f0, 0}Probably caused by : FLTMGR.SYS ( FLTMGR!FltpPerformPostCallbacks+1ae ) <-- this is a Windows component which means something else drove it into Fault.BugCheck 3B, {c0000005, fffff8017bba313a, ffff8d823d0de0e0, 0}Probably caused by : Ntfs.sys ( Ntfs!NtfsFindPrefixHashEntry+1fa )  <-- this is a Windows component which means something else drove it into FaultBugCheck 1E, {ffffffffc0000005, fffff8061201fb8d, 0, ffffffffffffffff}Probably caused by : ntkrnlmp.exe ( nt!NtWaitForMultipleObjects+12d )  <-- this is a Windows component which means something else drove it into FaultBugCheck F7, {fffff480c6da76e8, 8126aa3e5f96, ffff7ed955c1a069, 0}Probably caused by : memory_corruptionFurther analysis did not help which probably also often indicates a hardware error.1. Remove ALL power the reseat the cards, memory, and cables (on both ends when possible) - actually remove and replace - do not just snug.2A. Check with ASUStek Support, their on-line docs and drivers, and ask in their forums about any known issues. Update the BIOS, chipset drivers, and all major drivers (see driver update methods below).ASUS - Service <-- includes Live Chat  - Chat Icon is on lower right of pagehttps:\/\/www.asus.com\/us\/support\/Download-Center\/ASUStek Supporthttps:\/\/www.asus.com\/support\/ASUStek Forums are ZenTalk orROG (Republic of Gamers)ZenTalkhttps:\/\/www.asus.com\/zentalk\/portal.php?nocache=1ROG - Republic of Gamershttps:\/\/rog.asus.com\/forum\/?_ga=2.79315284.1301934212.1566869491-425645307.1554009500ASUStek Drivershttps:\/\/www.asus.com\/us\/support\/Download-Center\/2B. Even though the Nvidia drivers are very current they could still be involved. And it may be necessary to revert to an older stable versions. Ask their Support and Forums for known issues, nvlddmkm.sys dated 12\/24\/2019 Nvidia video drivers.Nvidia - Drivers - Use OPTION 1 to manually enter your driver info to get most current drivers. http:\/\/www.nvidia.com\/Download\/index.aspx?lang=en-usNvidia Support - check with Support as it could be a known issuehttp:\/\/www.nvidia.com\/page\/support.htmlNvidia Forums - also check for forums as it could be a known issue and\/or others likely to have ithttp:\/\/forums.nvidia.com\/2C. Check for update to the Razer drivers and ask about known issues.Razer Support & Communityhttp:\/\/www.razersupport.com\/3. Run the memory tests (see methods below).4. Sometimes it helps to reduce the system down to as simple as possible - remove all devices you boot without and use minimum memory.5. Since this does seem to be hardware, which can't be confirmed with software, try using the Stress Tests below to see if that helps identify the issue (of course NO over-clocking).PC Stress Test free software for Windows 10https:\/\/www.thewindowsclub.com\/pc-stress-test-free-software6. As needed use ALL the methods in the troubleshooters below.7. After ALL the above if needed run Driver Verifier to see if it can indicate a CAUSE (see Driver Verifier methods below).-----------------------------------------------------------Troubleshoot blue screen errors <-- read this linkhttp:\/\/windows.microsoft.com\/en-us\/windows-10\/troubleshoot-blue-screen-errors==================================================This utility makes it easy to see which versions are loaded : Run DriverView - set VIEW to Hide Microsoft drivers - update those without Dump in their names (and update BIOS and chipset drivers).DriverView - Free - utility displays the list of all device drivers currently loaded on your system. For each driver in the list, additional useful information is displayed: load address of the driver, description, version, product name, company that created the driver, and more.http:\/\/www.nirsoft.net\/utils\/driverview.html  For Drivers check System Maker as fallbacks and Device Maker's which are the most current. Right Click the Start Button - Device Manager - Display Adapter - write down the make and complete model of your video adapter - double click - Driver's tab - write down the version info. Now click UPdate Driver (this may not do anything as MS is far behind certifying drivers) - then Right Click - Uninstall - REBOOT this will refresh the driver stack.Repeat that for Network - Network Card (NIC), Wifi, Sound, Mouse and Keyboard if 3rd party with their own software and drivers and any other major device drivers you have.Now go to System Maker's site (Dell, HP, Toshiba as examples) (as rollback) and then Device Maker's site (Realtek, Intel, Nvidia, ATI as examples) and get their latest versions. (Look for BIOS, Chipset, and software updates at System Maker's site while there.)Download - SAVE - go to where you put them - Right Click - RUN AD ADMIN - REBOOT after each installation.Always check in Device Manager - Drivers tab to be sure the version you are installing actually shows up. This is because some drivers rollback before the latest is installed (sound drivers particularly do this) so install a driver - reboot - check to be sure it is installed and repeat as needed.Repeat at Device Makers - BTW at Device Makers DO NOT RUN THEIR SCANNER - check manually by model.Manually look at manufacturer's sites for drivers - and Device Maker's sites.http:\/\/pcsupport.about.com\/od\/driverssupport\/ht\/driverdlmfgr.htm    ====================================================Memory tests do not catch all errors such as mismatched memory (possible even for sticks that appear to be identical) and when faster memory is placed in the system behind slower memory. So it is best to also swap sticks in and out to check for those even if all memory tests fail to show a problem.To test RAM check here - let it run 4+ hours or so.  <-- best methodwww.memtest.orgMemTestX86 - Test RAM Withhttp:\/\/www.tenforums.com\/tutorials\/14201-memtest86-test-ram.htmlFor the Windows Memory Diagnostic Tool.Type in Cortana's search box ->  Windows Memory Diagnostics  ........find at top of the list - click it. in Windows 8\/8.1\/10 the name is \"Windows Memory Diagnostic\".================================================After doing ALL the updates you can, and if the issue continues, then run Driver Verifier. Driver Verifier can help find some BSOD issues : Using Driver Verifier to identify issues with Windows drivers for advanced usershttp:\/\/support.microsoft.com\/kb\/244617How To Troubleshoot Driver Problems in Windows Vista or 7. (8\/8.1 and 10 are essentially the same).http:\/\/www.winvistaclub.com\/t79.htmlUsing Driver Verifierhttps:\/\/msdn.microsoft.com\/en-us\/library\/windows\/hardware\/ff545448%28v=vs.85%29.aspx?f=255&MSPPError=-2147217396  WINKEY + X - RUN - type in -> verifier \/reset      hit enter to disableIf Driver Verifier creates a minidump upload it and post the link here so we can analyze it.Here to help,Rob------Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all."]},{"symptom":"Cannot use Ctrl + C for the logged in Microsoft account        When my computer is logged into my personal Microsoft account, the CTRL + C of the computer keyboard cannot be operated.If I log in with another account, the CTRL + C of the computer keyboard can be operated.當我的電腦登入個人的微軟帳戶,電腦鍵盤的CTRL+C無法操作,使用其他帳戶登入,電腦鍵盤的CTRL+C可以操作","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please perform the following steps: Open Start. Search for Command Prompt, right-click the top result, and select the Run as administrator option.Type the following command to perform a quick health check and press Enter: DISM \/Online \/Cleanup-Image \/RestoreHealth"]},{"symptom":"Bootcamp Internet Connection using windows        I have a mac book pro and use bootcamp to run a couple of window programs.  Possible you will not be to concerned about this issue, but....Up until recently all was good, but now when using WIFI on \"some\" services, the connection is very slow.  When using Xfinity, while traveling this past week, the internet speed was fast, BUT when accessing the internet pages - very slow.  I have researched via microsoft, apple and other internet sites and the best cause I believe is that due to a Microsoft update, the network drivers are not acting correctly when bootcamp is being used.  I have found many others experiencing this same issue - but with no clear answers.Is there any body out there...that knows a solution. ","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please try the following steps: 1. Reset the web browser. 2. Type CMD at Start Menu. When it appears, right click on it and select Run as Administrator.Run the following commands one by one. ipconfig \/flushdns netsh winsock reset Restart the PC. (The virtual PC)"]},{"symptom":"printer problem        I have windows 7 and have bought a new printer I have connected it wirelessly but it will not print out ","solutions":["Have you installed the Windows 7 driver for it? Please describe your problem in more detail. Tell us what \"it will not print out\"means. Exactly how are you trying? From what program? Do you see it in the list of printers in that program when you go to the print dialog? What happens when you try? If you get an error message, please quote it verbatim.","Have you installed the Windows 7 driver for it? Please describe your problem in more detail. Tell us what \"it will not print out\"means. Exactly how are you trying? From what program? Do you see it in the list of printers in that program when you go to the print dialog? What happens when you try? If you get an error message, please quote it verbatim.Hi Ken I have a Samsung RV511 (2015) Laptop and have bought a HP DeskJet 2600 All-in-one Wireless Printer  I have connected it up wirelessly and the printer shows that it is connected but when I send my work from windows to print it does not print out but it shows that it is in the queue to be printed.willi ","I have windows 7 and have bought a new printer I have connected it wirelessly but it will not print out As you have the Drivers installed and the computer sees the Printer.Check your Services.Go to the Start Orb.Type in : services and press the Enter Key.Scroll down to Print Spooler and make sure that this service is set to : Started ( under Status ) @ Automatic under ( Startup Type ). Remove all the Cued \/ Pending print jobs as well BUT make sure that you have a backup of those you want to print out.You may have to Stop the Print Spooler to do this.Also have a read through the below HP Link :https:\/\/support.hp.com\/au-en\/document\/c05367434"]},{"symptom":"Purchase in app item        I redeemed a gift card into my microsoft account to buy premium feature of an app,but now it doesn't let me pay for the item using the gift card.i tried using the account balance for purchasing an app in microsoft store, i could buy it using the account balancebut i can't use the balance to buy the in-app itemwhat's wrong? what can i do?","solutions":["Hi mamad_j2, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.The first step, we can apply it through the indications of this official link, which helps us with the correct operation of the Windows store, go step by step, if the current one does not solve the problem, continue with the following:Fix problems with apps from Microsoft Store https:\/\/support.microsoft.com\/en-us\/help\/402749...Additionally, you can follow Microsoft's suggestions when redeeming your gift card, if the problem persists, I invite you to contact Microsoft support directly in the same article.Redeem a gift card or code to your Microsoft account https:\/\/support.microsoft.com\/en-us\/help\/10604\/...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M."]},{"symptom":"Is  it safe to buy Windows from \"keysbundle.com\"        Hi can anyone tell me if it is safe to buy widows from keysbundle .com ? ","solutions":["Hi Mr. Afridi,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.We do not recommend buying keys from a 3rd party seller. They are selling the keys at way too much cheaper price which means likely the keys would stop working in future.https:\/\/www.microsoft.com\/en-us\/howtotell\/Shop....Beware of Product Keys Sold Separately With the exception of Product Key Cards (PKC’s) distributed with COA’s, Microsoft does not distribute products keys as standalone products. If you see a listing on an auction site, online classified ad, or other online page advertising product keys for sale, it’s a good indication that the keys are likely stolen or counterfeit. If you were to purchase and use a stolen or counterfeit product key to activate Windows installed on your PC, the key may not work for activation, may already be in use on another PC, or it might be blocked from use later by Microsoft when the key is reported stolen."]},{"symptom":"System Gets Automatically restart        Log Name:      SystemSource:        EventLogDate:          1\/4\/2020 6:57:35 PMEvent ID:      6008Task Category: NoneLevel:         ErrorKeywords:      ClassicUser:          N\/AComputer:      RH2ORADescription:The previous system shutdown at 6:54:10 PM on ‎1\/‎4\/‎2020 was unexpected.Event Xml:<Event xmlns=\"http:\/\/schemas.microsoft.com\/win\/2004\/08\/events\/event\">  <System>    <Provider Name=\"EventLog\" \/>    <EventID Qualifiers=\"32768\">6008<\/EventID>    <Level>2<\/Level>    <Task>0<\/Task>    <Keywords>0x80000000000000<\/Keywords>    <TimeCreated SystemTime=\"2020-01-04T13:27:35.000000000Z\" \/>    <EventRecordID>212385<\/EventRecordID>    <Channel>System<\/Channel>    <Computer>RH2ORA<\/Computer>    <Security \/>  <\/System>  <EventData>    <Data>6:54:10 PM<\/Data>    <Data>‎1\/‎4\/‎2020<\/Data>    <Data>    <\/Data>    <Data>    <\/Data>    <Data>291202<\/Data>    <Data>    <\/Data>    <Data>    <\/Data>    <Binary>E407010006000400120036000A001702E4070100060004000D0018000A001702600900003C000000010000006009000000000000B00400000100000000000000<\/Binary>  <\/EventData><\/Event>","solutions":[]},{"symptom":"BSOD error        Log Name:      SystemSource:        Microsoft-Windows-Kernel-PowerDate:          1\/4\/2020 6:57:27 PMEvent ID:      41Task Category: (63)Level:         CriticalKeywords:      (2)User:          SYSTEMComputer:      RH2ORADescription:The system has rebooted without cleanly shutting down first. This error could be caused if the system stopped responding, crashed, or lost power unexpectedly.Event Xml:<Event xmlns=\"http:\/\/schemas.microsoft.com\/win\/2004\/08\/events\/event\">  <System>    <Provider Name=\"Microsoft-Windows-Kernel-Power\" Guid=\"{331C3B3A-2005-44C2-AC5E-77220C37D6B4}\" \/>    <EventID>41<\/EventID>    <Version>2<\/Version>    <Level>1<\/Level>    <Task>63<\/Task>    <Opcode>0<\/Opcode>    <Keywords>0x8000000000000002<\/Keywords>    <TimeCreated SystemTime=\"2020-01-04T13:27:27.114411600Z\" \/>    <EventRecordID>212389<\/EventRecordID>    <Correlation \/>    <Execution ProcessID=\"4\" ThreadID=\"8\" \/>    <Channel>System<\/Channel>    <Computer>RH2ORA<\/Computer>    <Security UserID=\"S-1-5-18\" \/>  <\/System>  <EventData>    <Data Name=\"BugcheckCode\">80<\/Data>    <Data Name=\"BugcheckParameter1\">0xded91000<\/Data>    <Data Name=\"BugcheckParameter2\">0x1<\/Data>    <Data Name=\"BugcheckParameter3\">0x82a57b70<\/Data>    <Data Name=\"BugcheckParameter4\">0x0<\/Data>    <Data Name=\"SleepInProgress\">false<\/Data>    <Data Name=\"PowerButtonTimestamp\">0<\/Data>  <\/EventData><\/Event>","solutions":[]},{"symptom":"MOUSE bug - Wacom pen + tablet        https:\/\/imgur.com\/a\/zzmMqUyI am having an issue where after a minute or two, (never immediately), after using my drawing tablet, Windows decides to increase my cursor size seeminglybeyond  the maximum size in Settings.My setup is as follows:Wacom Intuos 2  (XD-1212-U)Windows 10 1903Drawing program used is Paint Tool Sai.I have already uninstalled the drivers and reinstalled them, the photos linked above were taken after several minutes of using Paint Tool Sai after having just rebooted today.I do not believe the device itself is to fault, however, device manager only has a generic listing for the drawing tablet:  \"HID-Compliant Digitizer\"I can however find the device, listed by model, in windows settings.Even if the device (drivers) is no longer supported, surely I should be able to stop the cursor from supersizing during use.I have never seen the generic windows touch interface do anything similar to this, so why should my input device?I have previously disabled all windows ink and pen \/ gesture settings where I can find them, but can no longer find these settings in 1903.My question is how do I stop the cursor supersizing?","solutions":["Hello LavendARSE ! My name is Marco, I am an Independent Advisor. I will do my best to help you.You can adjust the size of your cursor by following this path Right click on the windows start button Click on SETTNGS Then click on DEVICE And right click on MOUSE And on the far right \"Adjust mouse & cursor size\" You will now see the options to change the size of the cursor"]},{"symptom":"My hp laser jet P-1005 not working properly when open ON        Dear Sir,1. I am using windows 7 ultimate, problem is when I start  my above named printer first time,and want to print something, he dose not print, until I open Services and go toPrint Spool and stop and start the services,and go to windows\\system32\\spool\\PRINTER and then delete my stuck print job.2. After that above process, I do my Printer OFF and  ON  once again, now he dose print many time until I switched OFF.I have deleted and re-installed many time printer driver from hp-site, but I am facing same above problem..I thing that windows 7  operating system not supporting, HP-Laser jet P-1005 printer but my other friends using that printerand same driver successfully.. kindly any one solved my problem, I would be highly appreciated ....best regards.anees khan","solutions":["Windows 7 does support this printer.HP Link below.https:\/\/support.hp.com\/us-en\/drivers\/selfservice\/hp-laserjet-p1005-printer\/3435674Just make sure you have the correct one installed as to 32 Bit or 64 Bit.Also :Is the Print Spooler set to Automatic and Started ???Diag below.Cued up or pending print jobs may also cause issues at times.HP Link below.https:\/\/support.hp.com\/au-en\/document\/c00381778"]}]}