{"windows":[{"symptom":"Audio driver on an Apple Desktop        Hello,I have an Apple desktop with Windows 10 that the external speakers does not work on. I have run the sound troubleshooter several times and it installs the MStar demo audio driver which seems to get it working. By morning it is gone and no longer works. I have set it to default turned off audio enhancements and still the same results. Please help,Carl Sixkiller","solutions":["Hi Carl, It sounds like you fix it; but, then Windows does an automatic driver update and causes an issue...let's try disabling automatic drive update.Go to this link: https:\/\/www.windowscentral.com\/how-disable-auto...Follow the instructions to stop Windows 10 from automatically doing a driver update and see if this works.Let me know how it goes.","Hi again,Well I tried disabling automatic drive update and this morning it was not working again. Any other ideas?Thank you,Carl Sixkiller","What's the driver that you install to get it working?","Hello,When I run the sound troubleshoot it installs MStar demo.Thank you,Carl Sixkiller","Hi Carl, I am going to open this up to some other experts familiar with apple desktops and Windows 10.","Sounds Great.Thank you,Carl Sixkiller","Hi Carl, I am an independent advisor and a Mac user like you, and I am hoping to help you out with this.Did you use Boot Camp Assistant to install Windows 10 on your Mac? If so, do you know if the Boot Camp Installer ran after installation?If it did not run, or if you are unsure, please see the following article from Apple which outlines how to run it. This should install the necessary audio drivers.https:\/\/support.apple.com\/en-ca\/HT208495There is some additional information here: https:\/\/support.apple.com\/en-us\/HT204923Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I hope this has helped you. If this does not resolve the issue, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","Happy New Year,So I attempted to let bootcamp install the necessary drivers but when i went to look for OSXRESERVED partition. It was not there.Who ever installed Windows 10 Must have deleted it, I am guessing. So I attempted to download the bootcamp assistant but it kept telling me that the version was not compatible. What info would I need to find the correct bootcamp assistant or do you have another suggestion?Thanks for your help,Carl"]},{"symptom":"Airpods Pro super loud on Windows 10        Recently, my AirPods Pro began playing at max volume when connected to Windows 10. I can move the Windows volume slider up and down and the volume does not change. The AirPods Pro were working just fine for several weeks, not I can not use them on Windows 10.I found this post and followed its advice, but it did not fix the issue. I have removed the AirPods Pro device from the computer, rebooted the computer, and re-paired the AirPods Pro. No change. The AirPods Pro work fine on my iPhone.EDIT: It appears that the issue is with the \"Headset\" device. If I switch the volume profile to \"Headphones\" the volume plays normally and can be adjusted by the slider. See reply from \"lacrumb\" below. However, this is not a permanent solution for me as I frequently take calls and need the \"Headset\" to work for that.Any suggestions?","solutions":["On the taskbar click on the speaker, if after the title there is an ^ click on it and change the title to one of the others and see if the slider works.","Good call. Switching from \"Headset\" to \"Headphone\" allowed the volume control to work. However, I need to be able to use the \"Headset\" setting as I frequently have calls (Skype, Teams) on my computer. This is at least a workaround until I can figure our why \"Headset\" is not working in the same manner as \"Headphone\". "]},{"symptom":"Printer \"Driver is Unavailable\" or listed in \"Other devices\" \/ \"Software devices\" in Device Manager        Hi All,I have a Brother printer of an older model (MFC-4550) and I am trying to connect it using a USB-Parallel cable into Windows 10. On a previous version of windows (Windows 10 1709), the printer worked perfectly fine. Recently I updated to Ver. 1809 by wiping the computer but now the printer refuses to connect properly.On 1809, when I connect the USB into the computer, the printer is shown as \"IEEE-1284 Controller\", which is the actual cable, in Devices and Printers of Control Panel. If I click on its properties, it would list my printer model and \"USB printing support\". In Device Manager, my printer model is listed under \"Software devices\" rather than \"Printers\". I concluded it was a driver issue, and since the manufacturer's website said the printer's driver was built-in, I inferred it had to do with me updating it to 1809. I tried searching for other drivers, both manually and through window's own feature. Did stuff with \"Have Disk\" and adding printers manually using ports but all to no avail.Now I have downgraded back to an even earlier version, 1703. However it still does not work. When I plug in the cable, IEEE 1284 Controller is still there, and in Device Manager, the printer model is listed under \"Other devices\". In Control Panel, when I click on the IEEE 1284 Controller, it says it's a printer, however the \"Driver is unavailable\".I know that the printer is compatible and it does work on Windows 10, however I just have trouble installing the right drivers and Windows Update doesn't seem to do its job either. Could it be that it ONLY works on 1709? Cause that would be ridiculous.Any suggestions would be appreciated.","solutions":["Hi Justin. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Those older versions of Windows 10 may have made the old printer with ancient serial port run awhile longer, but to continue with Windows 10 on a printer that has no driver software to even try to install in Compatibility Mode is not worth the trouble.New wireless All-in-One printers that print wirelessly from every device in the house and even Alexa are $50 on Amazon. They install themselves. No need to suffer any longer.I hope this helps.","Hi Justin. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Those older versions of Windows 10 may have made the old printer with ancient serial port run awhile longer, but to continue with Windows 10 on a printer that has no driver software to even try to install in Compatibility Mode is not worth the trouble.New wireless All-in-One printers that print wirelessly from every device in the house and even Alexa are $50 on Amazon. They install themselves. No need to suffer any longer.I hope this helps. Hi Greg,Thank you for you reply, I really appreciate it. However, I am fully aware of the newer and much better printers available at low costs. In fact, I myself own much better printers. The whole point of creating this thread was to seek a solution to get my old one to work. Regardless, thank you for your response.---After countless hours of fiddling, I have finally figured out a solution, and hopefully it will benefit others as Im aware of the countless other threads on forums on the same issue.As of right now, I will assume it is because of the 1809 update, where Microsoft stopped including old printer drivers automatically in its feature update packages. I will test whether it actually also works on 1809 and 1903 through printer migration tomorrow.Steps:- Add Printer in Control Panel- Click \"The printer I want isn't listed\"- Select \"Add a local printer\" (last option)- Choose a Virtual USB Port (I chose the one with the largest number, though it really doesn't matter)- Click \"Windows Update\" on bottom right of window. This will ask Windows Update to fetch built-in drivers from all manufacturers- Find your manufacturer and printer model that matches the closest to your printer- Click \"Next\" and wait for Windows to install the driver. *This is where I ran into problems on 1809. It would always give me an error that says \"The printer was not installed.\" However, on 1703 it added the driver successfully.- Open Device Manager- Find your printer (Mine was listed under \"Other devices\", however Ive seen it under \"Unknown devices\" and \"Software devices\" as well)- Right click it and select Update Drivers- Click the 2nd Option (Something along the lines of installing a driver manually and NOT online)- Click \"Let me choose a driver from a list of available drivers on my computer\"- Choose \"All Devices\" and let it load a list of all installed drivers on your system- Find the one you installed earlier by matching your manufacturer and model to the list- Click \"Next\" and let it install the driver. If a message pops up warning about compatibility or digital signing, just click OK and let it install.- If it successfully installs you should see your printer under a \"Printer\" menu in Device Manager. The IEEE-1284 should subsequently disappear and you should have a working printer.Good Luck.","Justin, are you saying that the fix above works on the old version which you rolled back to? That version 1703 from early 2017 is so out of date I'm surprised it even lets you run it.Let us know if you find a way to install the driver in the latest version 1909 which is the media presently loaded into Media Creation Tool and latest if you want up to date security and quality fixes.Respectfully, we like to support Best Practices here and running a version that old in Windows 10 is a worst practice.","Hey Greg,Yes, the fix works on 1703, and should also work on 1709. The printer isn't ancient so I'm actually surprised it's not letting me install it on 1809.I will have to respectfully disagree with your best practice statement. While I no doubt believe that Microsoft continues to develop better and safe features in the newer versions, more often than not new upgrades break features and cause compatibility issues to users of all kind. I understand that Microsoft may not be able to provide support given that 1703 is over a year old, but numerous businesses, and for a variety of other reasons, 1703 is still widely popular. It isn't \"worst practice\" if one chooses to stay on an older version, especially if the newer one doesn't work like you wish for it to. What if I had not the capability to purchase newer printers?Thank you taking the time to respond though. I know you're just trying to help and I appreciate it.","Well I certainly understand the problem with later versions breaking things because we deal with this every day here. But that may be changing with some executive shuffling recently. The 1909 was so lean it only added all Updates to date and the ability to set appointments from the task bar Calendar. I was also speaking from personal experience with friends and family who gave up their serial devices some years back due to failing compatibility.But from all you've described if anyone can get it to work going forward, I will bet on you. I wish I had more to offer to help."]},{"symptom":"Help me to fix        When i try to login in my Microsoft Store i get an error and it give me this massage \" try again later \" And i i tried with other account and it work but i get new error and i want to login to my old account(this) because i want to download minecraft (sorry for bad english )","solutions":["Hi HeyIm7MoODy, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.See the instructions in the Windows MVP to clear the cache from the Windows store.How to Clear and Reset the Store Cache Windows 10 https:\/\/www.tenforums.com\/tutorials\/15057-clear...Fix problems with apps from Microsoft Store >> From this link apply the points in the established order, if it doesn't work, continue with the following.https:\/\/support.microsoft.com\/en-us\/help\/402749...Reinstall the Windows store by the PowerShell command Press the Windows key + X >> PowerShell >> Copy and paste with the mouse button: Get-AppXPackage * WindowsStore * -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$ ($ _. InstallLocation) \\ AppXManifest.xml\"} + Enter, restart the computer and check again. Let me know if you have something else that I can help you with, I'd be happy to help.Happy nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Not Working It Still giving me Error 0x80070781Ant In The Power Shell It Says That The Command Not True There Is Another Proplem In powershell","Hi, Try the following: Start Windows through a clean boot, it is an error-proof process, so we can detect if it is any third-party program or driver that causes the problem.https:\/\/support.microsoft.com\/en-us\/help\/929135...If it does not work repeat the steps to restore the store at least 2 more times, then the updates again.Regards","Hi, Try the following: Start Windows through a clean boot, it is an error-proof process, so we can detect if it is any third-party program or driver that causes the problem.https:\/\/support.microsoft.com\/en-us\/help\/929135...If it does not work repeat the steps to restore the store at least 2 more times, then the updates again.Regards I did the steps but still got the error when i sign in"]},{"symptom":"The time and date are missing from the taskbar.        Somehow the date and time have disappeared from the taskbar.  I had accidentally glanced across the touchpad when it happened.  It shifted the remainder of the icons from the power gauge, etc to the left.  How do I recover these two items and return the icons their normal positions?","solutions":["Try right clicking on the taskbar and selecting taskbar settings.","Hello Charles, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemright click on Taskbar settings, go to Turn system icons on or off, then enable Clock.Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolvedCheers! Farah"]},{"symptom":"Your Phone        Why can I NOT get t to sync with my phone and why in the past when it did sync did it not work starting with it not showing the icon!?*****Moved to Windows*****","solutions":["Hi, matthewDuffey!Thanks for reaching Microsoft Community. We are sorry to learn you have troubles with the Your Phone app. Can you tell us the brand and model of your smartphone? What type of Windows 10 device do you use the Your Phone app with?For the meantime, please visit this page to get help anything related to Your Phone app on Windows 10.Looking forward for your response so we can have this addressed properly.Regards,Janette_Z","Peut etre un problème de mis a jour ? ","Peut etre un problème de mis a jour ?  Barbera,Jregret Jnet Parle Francais!","Janette-Z,,I have a Samsung sm-t725 Tablet  that I use as my phone","Janettete-zI am using the latest windows10 I forgot!","Hello, matthewDuffey!Thanks for letting us know that you are using an Android smartphone, which is your Samsung. As for your computer, I understand it is Windows 10. What is the brand and model (Acer, ASUS, Lenovo, HP, etc)? That way, we can provide the proper solution for this.As for the Your Phone app issue, please make sure to visit this page to get help anything related to Your Phone app on Windows 10.Thanks!Regards,Janette_Z","Janette_Z,I am using an H.P. All in one.","Thanks for letting us know  of the device you are using, matthewDuffey.We are moving this thread to the Windows category so this will be checked further by the Windows Team.Thanks for your time.Regards, Janette_Z","no problem"]},{"symptom":"Formatted My Hard Drive and Lost Activation Key        My roommate had me fix his computer that had gotten corrupted, the only fix we could get to work out was to completely format his hard drive down to nothing. After rebooting, we were given a prompt to reinstall windows, so I went to the appropriate Microsoft website and downloaded the file to a flash drive, and reinstalled windows from there. Now it's saying that Windows is not activated. I went to this Microsoft support article to find the product activation code, it says that the code is incorrect. I've been trying just about everything to get this computer up and running but I don't really know what else to try. Did I accidentally delete the important information from the PC when I formatted the drive? It's up and running now, I'd just really like to activate windows. Thank you for any help you can provide! ","solutions":["Hi Sam Rest assured you did not delete anything relating to activation or licencing when you wiped that drive, in general Windows 10 licenceing is digital and the product key may be stored in BIOS, it is never on the hard drive . . .Did you make sure to install the exact same Edition (Home, Pro . . etc.) as was previously installed on that PC . . .Open the Settings App (gear icon on your Start Menu) Go to System - About Does the edition listed there match the previously installed edition? What is the exact activation error you are seeing in Settings - Update and Security - Activation?"]},{"symptom":"0x80073cf9 Microsoft Store error code.        So. All I want to do is download some games off the store. And so, just before the new year, everything was working and I could. Now, the **** broken store just gives me 0x80073CF9 on every game I download.Yes, I've tried all your copy-pasted fixes. None worked.I've heard some people say that if none of these fixes work, I have to do a repair upgrade. Which I cannot do since the setup won't let me keep anything. I am on an insider build. I tried to go back, however even though all files are there in Windows.old, Windows just gives up and says \"nah man, it exists too much that we can't find it\".That sucks, but if I have to do it, I have to do it.","solutions":["Well, in that case the PC require a System Reset."]},{"symptom":"window update error        error showing when i am installing app on update ","solutions":["You must post the exact error and the model name and number of your computer to get help. Also explain what you mean by Installing an app on update.","Hi, To troubleshoot this we need a bit more information, what is the error you are seeing?"]},{"symptom":"I've lost Outlook        I have Windows 10 and Office Professional Plus 16 on my PC.  I can access all the apps until yesterday when Outlook totally disappeared.  I can see in 'processes' it is 'suspended'.  The other user on PC still has Outlook so what have I done?  It's like I've deleted it visually. Help! Non-tecchie responses only as I'm not bright with IT. ","solutions":["Hi Lightbulb100, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Is the only application that presents this problem? Restart your computer, and check this official community link.Can't find Office applications in Windows 10, Windows 8, 7 https:\/\/support.office.com\/en-us\/article\/can-t-... de6764a635d6The other option is to uninstall and reinstall Office on your computer. https:\/\/support.office.com\/en-us\/article\/downlo...Note: You can try a repair before applying the previous uninstall point. Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M.","https:\/\/support.office.com\/en-us\/article\/can-t-..."]},{"symptom":"Network Card (NIC) losing connection when PC sleeps        Forgive me for the long post, but I wanted to give all the information I could up front. I am encountering a very frustrating problem for which I have yet to find an answer despite HOURS of research on forum after forum. The answers are always the same, and they have not helped me. When my new PCs go to sleep, they lose network connection. I truly hope someone can give me a real answer and not the typical, unhelpful, tech runaround (update your machine, update your drivers, blah, blah, blah). If the answer already exists in another question here or somewhere else, please someone just politely point me there, as I have been unsuccessful in finding it.The problem manifests like this:When either of my 2 PCs goes to sleep, its NIC seemingly does as well, and connection to my Synology home server is lost. This causes two problems:1 - Whenever the PC is woken, all desktop icons are gone except for Recycle Bin. The desktop must be refreshed (right-click\/Refresh) to restore icons (my Desktop folder resides on the server).2 - Any document that was open when the PC went to sleep reverts to Read-Only, resulting in having to Save As another document. All my documents reside on the server.Equipment:I have 2 identical Windows 10 PCs that I recently built (one for me, the other for my children). AMD Ryzen 5 processor. B450 AORUS PRO WIFI motherboard. Gigabyte BIOS, version F5, 01\/25\/2019.My NIC is an Intel(R) I211 Gigabit Network Connection. The PCs are hardwired (ethernet cable, not WIFI) to a home network where all user account folders (Desktop, Music, My Documents, etc) are hosted on an 8 TB Synology home server.Let's get the obvious out of the way so folks don’t have to waste their own time telling me to do things I have already done:1 - This is most likely NOT a server issue. Both previous computers (which were underpowered Windows 10 machines) did not exhibit this issue. Only the new machines do. I have changed no settings on my server at all.2 - Both machines are completely updated with all Windows 10 available updates installed.3 - My NIC has the newest driver package installed from Intel.4 - In Device Manager\/NIC Properties\/Power Management, \"Allow the computer to turn off this device\" isUNchecked.5 - In Device Manager\/NIC Properties\/Advanced, (1) Energy Efficient Internet is OFF (2) Wait for Link is Auto Detect (3) Wake on Link is Disabled (4) Wake on Magic Packet is Enabled (5) Wake on Pattern Match is Enabled6 - There is not a whole lot in my BIOS that I found helpful. I don’t know if these are relevant, but I included the info anyway: (1) Under BIOS, Network Stack is Disabled (2) Under Power, Wake on LAN is Enabled7 – Because the BIOS is so new, the one thing I haven’t checked for is a BIOS update. I highly doubt this would help even if there is one, but I hopefully will have time to check this sometime today anyway.Please excuse any perceived bluntness in my tone. At this point, I am just a bit frustrated and want this problem to go away. Hopefully one of you tech-savvy wizards out there can point me in the right direction. Thank you in advance. It’s got to be something simple I am missing. I am fairly comfortable in Regedit or whatever needs to be done. I can post screenshots\/Snagits if needed. My best regards to you.","solutions":["Hello. Does anything here help at all?https:\/\/www.top-password.com\/blog\/prevent-windows-10-from-disconnecting-network-during-sleep\/","Hello ThomasBottoms, I am Andrew an independent advisor. What you are experiencing is normal behaviour. When a PC goes to sleep it turns off all devices, including itself. It basically saves the state it was in into the memory and turns the power nearly completely off, this includes your NIC device. This article should help better explain:https:\/\/www.howtogeek.com\/128507\/htg-explains-s...There is a method to prevent this from happening, however it is only available for laptops.To do it open your Settings. Find System > Power and Sleep There's an option under NETWORK CONNECTION to choose NEVER to turn it off while sleeping.Click save and you're done. Take Care, Andrew","Andrew,Thank you for your response, but it seems this cannot always be the case. The Windows 10 desktops I had before the new machines did not lose network connectivity when going to sleep. Also, where I work, the Windows 10 desktops do not lose network connectivity when sleeping. That would be absolutely maddening. I guess if I cannot find an answer for this, I will set my PCs to never go to sleep. Thank you kindly for the link and explanation. Continuing the search...Tom","Resourceful,I have tried everything involved here that I can. The one weird issue I am running into is in the Group Policy Editor. In my GP Editor (which I had to install gpedit.msc because I have Windows 10 Home version), I do not have any options anywhere for modifying network connectivity during sleep. This is strange because I clearly see the option in the guide you sent. It must be because I have desktops and not laptops. As disheartening as it is in not finding an adequate answer, it is looking like I must set my computer to never sleep... This seems like it should be such an easy fix, but apparently not. I thank you for taking the time to look into this and provide THE MOST INFORMATIVE guide I have yet seen for this issue. If keeping network connectivity alive is not an option for a desktop, as AndrewWay1 wrote, then it should not be an option in the Power Settings. Windows is very frustrating sometimes. Thank you kindly!Tom","Hello, maybe post in Intel's forum?https:\/\/forums.intel.com\/s\/topic\/0TO0P00000018NbWAI\/intel-ethernet?language=en_USAlso, what security software do you run?"]},{"symptom":"Media Player And Media Feature Pack        I have Windows 10 Pro N ,OS Build 19041.1 and when i download Media Feature Pack and Media Player from windows apps- optional features - add a feature it says \"Install Failed\"What should i do ?","solutions":["Media Feature Pack is now as part of optional features.Settings \/ Apps \/ Optional features: Add a feature -> Scroll down to Media Feature Pack","thats what i did,and it says \"Install failed\"  What should i do ?","Hi Catalinvlad, Are you able to download it from this link? https:\/\/www.microsoft.com\/en-us\/software-downlo...If not, then you can try this out. Please let us know if this will help you solve your concern. Thanks and regards,","I downloaded it, it says that this update is not applicable on my computer.","Hi catalinvlad I notice that you are on a Windows 10 Insider Build (OS Build 19041.1), there is no version of the Media Feature Pack released for that version, the latest version of the Media Feature Pack is for version 1903 of Windows 10 . . .","Thanks !","Yes there is MFP available for build 19041. I tested that just one week ago:Quote of my posting in this thread page 1:\"I just did clean install of Windows 10 Pro N x64 en-US, v1909 using official ISO (MSDN) and linked that to receive previews in Slow Ring. When update to v2004 was completed MFP was offered in optional updates. I select that and it was downloaded and installation was finished with required restart.\">\"the latest version of the Media Feature Pack is for version 1903 of Windows 10\"Since version v1909 MFP has been included in optional updates:https:\/\/support.microsoft.com\/en-us\/help\/4516397\/media-feature-pack-for-windows-10-n-november-2019","Media Features pack is not available for windows 10 unless you have the N version.https:\/\/support.microsoft.com\/en-us\/help\/3145500\/media-feature-pack-list-for-windows-n-editions"]},{"symptom":"i have a laptop that was recently updated to Windows 10.        I can't get to any websites, can't watch DVDs. a message pops up,\"server not found\" how do i fix this","solutions":["Hello UmaShiva, I am Andrew an independent advisor. It sounds like you may have some broken system files needed for most of these functions. To make sure everything is running ok on Windows side of things run these and let the system repair itself.In the search bar, type cmd. Right-click on cmd.exe and select Run as Administrator. Type SFC \/scannow and press the Enter key. Re-enter Command Prompt as Administrator and run these: dism.exe \/online \/cleanup-image \/startcomponentcleanup dism.exe \/online \/cleanup-image \/scanhealth dism.exe \/online \/cleanup-image \/restorehealth After all this update your drivers from the manufacturers website. Let us know how it all turns out after all this.Take Care"]},{"symptom":"remote control of pc        hey friends!I want to control my laptop by my mobile device, by using any app ,which connect the pc and mobile device.I need you people help, please me help me if it is possible.I have there will be a method to control my pc by my mobile.I will be highly thankful if you people help me.\"*** Email address is removed for privacy ***\" my gmail account.you can also contact to me by using it.thanks","solutions":["I have use Team Viewer when I have had need to connect my desktop while I'm away of home.https:\/\/www.teamviewer.com\/en\/products\/teamviewer\/TeamViewer is available for PC's, iOS and Android phones.","Hello AHSANMEHBOOB, I'm Didi, an independent advisor. I advise you to use Windows Remote Desktop, you can control your computer remotely from an Android or iOS phone, here is a guide :https:\/\/support.microsoft.com\/en-us\/help\/402837... If you don't like Remote Desktop you can use other apps that are not made by Microsoft, for example Teamviewer or Anydesk.Regards, Didi"]},{"symptom":"Update to 1909 Stuck for the Past Two Days        I am updating my laptop from Windows 10 1803 to 1909. For the first couple hours, it made continual progress, but now, for the past 38 hours, it has been stuck at 91%.The fancy little progress circle is still rotating, and everything is still running, but no progress has been made for a very long time. If I force shutdown my computer, and boot to the UFIC screen, will it throw an error or will I be able to uninstall the update?The screen I’m stuck on says: “Working on updates: 91% Don’t turn off your PC. This will take a while. Your PC will restart several times.” I mean, I’m a patient guy, but there comes a point where it becomes pretty clear something’s wrong. I’ve already tried Ctrl+Alt+Del and moving my computer closer to the modem. Any other tips you have for continuing the update or safely canceling it are appreciated.","solutions":["Hi Timmy, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Unless there is something related to booting, a restart should restore to the previous version of Windows i.e. 1803.IMO you have waited for enough and reboot. Let us check the Installation log to find why the update failed. Please share the logs as mentioned in this article. You should use a File sharing service like Onedrive or Media Fire to upload files and share the link in the next reply.https:\/\/answers.microsoft.com\/en-us\/windows\/for...The Panther logs. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\PantherThe Rollback logs: These usually are created if Windows Update rolls back. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\Rollback[Only if the error code is 0xC1900101-0x30018] The Device Install Log from C:\/$Windows.~bt\\Sources\\Rollback\\setupapi\\setupapi.dev.logAs the log size might be large consider zipping before uploading.","Thanks for the advice; here's the link: https:\/\/drive.google.com\/file\/d\/1RyVW77peyKHJoJzSIQTx5vouoLdsb4R0\/view?usp=sharingIt also turns out that I was trying to update to 1903, not 1909.","Thank you for the logs. It looks like the Internet explorer has something to do with this.The last line of the logs say the following: Process C:\\WINDOWS\\system32\\ie4uinit.exe -apply did not finish in the allocated time and it was killed.Please disable unnecessary features including Internet Explorer and others, and try again.https:\/\/www.tenforums.com\/tutorials\/7247-turn-w...The fastest way to get the upgrade is through Media creation tool or ISO file. Please download Media Creation Tool from the link below and select Upgrade this PC at the first screen.https:\/\/go.microsoft.com\/fwlink\/?LinkId=691209All steps, including upgrading using ISO file and Media creation tool, are covered here:https:\/\/www.yourwindowsguide.com\/2019\/11\/update...Content on the above blog is written by a Microsoft MVP so it is safe.","Hallo, I had the same problem.a user in a different thread found a solution that worked for me.Go to: C:\\ProgramData\\Microsoft\\DiagnosisAnd delete the file called: events_normal.rbsthen start windows update as normal.why does this work? I have no idea.","This indeed was rhe cure to my woes. I was stuck at 91% for hours. I found this thread and tried said method of file deletion. Went smooth as silk after that.","My laptop has been updating for nearly the past 4 hours to the point where it feels like no progress is being made I'm on the blue screen but I've been on this screen for 2 of the 4 hours and am only at 20% hopefully i don't experience your issue","For some reason I do not have this programdata folder. Now what? ","programdata is a hidden folder. Make sure you show hidden items.","I tried deleting the file but it says I need permission from the administrator, which is me. Not sure how to get around that one. I’ve been having the same problem, stuck at 91%","I tried deleting the file but it says I need permission from the administrator, which is me. Not sure how to get around that one. I’ve been having the same problem, stuck at 91%I had the exact same problem. I tried all the suggested ways of taking ownership of the files & folders but it never worked. I gave up and did an install that does not try to save my programs and files (backup all your files first). This method did create a windows.old folder with a ton of files though, so you will need space on your drive.This is the way..."]},{"symptom":"My PC wont connect to anything        It has been a few months ago that my PC just Turned off by it self over and over then one day it didn't connect to my monitor keyboard and mouse but it still lights up it doesn't pick it up that they are there or something","solutions":["What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK","I cant do that anymore because it wont connect to anything"]},{"symptom":"Can window 10 perform automatic update on a laptop without internet connection        Hi,I would love to ask an important question. I was working on my laptop that has been disconnected from WiFi nearly a month ago. I decided to take a nap and woke up to see that the Windows 10 on my laptop is performing an automatic update without my consent. It closed all the running application file that I am working on for a whole day. It seems not normal to me. I would love to know if this is normal or a new norm with Window 10. I thought Windows 10 requires some sort of huge data from Wifi to download and also seek a consent before updating.Thank you.","solutions":["Hi Chinonso It is simply not possible for Windows 10 download updates while not connected to the Internet . . .Most likely that update was downloaded when that PC used to be connected to the Internet and that sat there as pending, and for some unknown reason decided to install at that time, possible because the PC was left idle for an extended period of time . . .Open the Settings App (gear icon on your Start Menu) Go to Update and Security - Windows Updates What is listed there as installed and is there any pending updates listed there?","Thank you for the response.The three attachments above are what I could possibly gather from my Laptop.Please, is there a way to control or receive notification from Windows Update before the update is carried out. I can either seek for an extension of time or possibly close the files on my PC.Thank you","Hi Chinonso Well, your system is right up to date, how long has that been disconnected form the Internet?That was a cumulative update for the DotNet Framework that was installed, it must have been pending for a while . . .A Notification generally does show when an update is pending or about to install, that may have shown when you were napping . . .","Thank you for your response. It was really helpful."]},{"symptom":"Airplane mode will not turn off in Windows 10 it is greyed out and cannot access wifi        Airplane mode will not turn off in Windows 10 it is greyed out and cannot access wifi, the wifi tries to start then automatically shuts itself down","solutions":["Hi Ron We need just a bit more detail . . . Are you using a PC with a monitor or a laptop? If that is a laptop, look across the top row of keys on your keyboard, is there a WiFi icon or Airplane icon on any of those keys?If that exists, press that key, and if that does not work, press the Fn Key + that key to see if that will take you out of Airplane mode . . .If the above option is not available to you, what is the Make and exact Model No. of your PC - that will be printed on a sticker on the bottom casing .. .","Hello Ron, In addition to what Dave posted, you could see if you may be able to use option 4 in the tutorial below to turn off airplane mode if it's not turned off by a physical switch.https:\/\/www.tenforums.com\/tutorials\/15411-turn-off-airplane-mode-windows-10-a.html","Hi Scott followed #4 and it got rid of the airplane icon but when you click on internet the airplane mode button is still greyed out","Hi Dave, I followed the fn etc still the same then I tired what Shawn had suggested it got rid of the airplane icon however airplane mode is still greyed out. I am using a Dell Laptop Inspiron 2305 Intel (R) Core (TM) i5-3340m CPU@2.70GHz 2.70GHzThanks for your help","I suppose go ahead and post a screenshot showing what you're seeing to see if anything may stand out.","Hi Ron Here is a page on the Dell Website, with a few steps that may resolve this for youhttps:\/\/www.dell.com\/support\/article\/ie\/en\/iedh...Also you may try re-installing your wireless device driver form the support page for your Dell PC . . .https:\/\/www.dell.com\/support\/home\/ie\/en\/iedhs1\/...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]},{"symptom":"Can't activate windows 10 after changing motherboard        Hello,I can't activate my windows 10 license after changing my motherboard.The license I have is a Windows 7 Pro license, that got changed into a Windows 10 license, when the upgrade was free.Steps I took previous to the motherboard change:- I linked my Microsoft account with my device, so that my license is registered under my account (it showed up with my mail in the accounts section)Now, with the new motherboard built in, I can't activate Windows 10 anymore.I tried the support steps listed by the Microsoft helper (Activation -> Click Troubleshoot), but that did not work.In the Activitation settings I get the error code: 0xC004F213Does anybody know a solution for this, as I haven't found one so far.","solutions":["Was the Windows 7 license a retail purchased license?  If not then you will have to buy a new license as a new motherboard is a new computer.","Hi Graf Is your Windows 10 licence based on an OEM Windows 7 licence (came pre-installed on a PC) or Retail (purchased separately to a PC)If it is a Retail licence, then it will have transfer rights to a new Motherboard or PC, if it is OEM it will not . ..Is your Windows 10 based on a Retail Windows 10 licence? If so, your best option is to contact Microsoft Support and ask them to help you re-activate your Windows 10, because there seems to be a lot of difficulty with that Activation Troubleshooter at the moment . . .Choose a local Phone Number: https:\/\/support.microsoft.com\/en-us\/help\/13948\/...","The windows 7 license was a retail license. The Windows 10 version is the free upgrade to windows 10, that Microsoft was giving people back when windows 10 came out.I guess contacting them directly is my only option then , thank you"]},{"symptom":"While running a check entire computer virus scan, how can I put my monitor to sleep?        Is there a shortcut to put my monitor into a sleep mode while my computer is running a program in the background?  I do not want to lock or put my computer to sleep.  Only the monitor.","solutions":["Sorry this has not solved your problem. This could very well be a setting in Norton, it is telling the computer HEY IM HERE DON'T TURN ME OFF, sort of like how a video player will suspend these actions when in full screen.My self I use BitDefender and told you the exact settings I revert to when running a scan with no issue. Contact Norton support, they may know a setting in their program causing the screen to not turn off.Take Care, Andrew"]}]}