{"windows":[{"symptom":"After deleted a folder it Come back again.        I don't delete a folder fro my laptop. When i delete it one copy is gone to recycle bin but main folder is stay same position on my laptop. if i change the name of the folder then name would be changed and two folder s created. Previous folder and new named folder how can i solve that problem. please give me better guideline to solve this problem.","solutions":["How are you deleting the folders?Right click > then Delete > then empty the Recycle Bin?What is the folder?"]},{"symptom":"Windows 10 pro language and keyboard settings        Hello.I have installed Windows 10 pro (i think it is UK edition) and have installed US language pack and keyboard. Under the language selection menu in notification area i see 4 choices, US, Greek (i live in Greece), US keyboard and UK keyboard. I want to remove the last 2 options but i cannot find the settings to do so. I have tried a lot and searched the web but did not find anything.Can someone please help me?Thanks in advance.","solutions":["Hi Spyros, Thank you for writing to Microsoft Community Forums. It is very unusual that the keyboard layouts are showing even though they are not installed on the PC, and I certainly appreciate your efforts in trying to resolve the issue by following troubleshooting steps. One of the things that you can try is to uninstall the keyboard layouts using the lpksetup option. Press Windows key + R. This will openRun. Alternatively, you can go to Start and search for Run.In Run dialog box, type lpksetup and hit Enter.Click on Uninstall display languages.Select the language packs you want to uninstall and click onNextRestart the PC.If the above option doesn’t work then you can use the below commands and try uninstalling the keyboard layout. Press Windows + S key together to open Search.Now type CMD and select Run as administrator.Accept the UAC prompts.Type in the following commands one by one and hit Enter:lpksetup \/u en-gbRestart the PC. Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Windows Hello asking for PIN, I don't have one. Go to create one and am told \"An error occurred capturing your PIN. Please try again later\"        I upgraded my laptop from HDD to SSD. OS installed (Win10), most apps & updates installed without issue, then came Office. I installed Office and went to sign in to Activate it. I signed in with my email and password, then it states I need to verify\/login using Windows Hello (which I've never used\/seen before). Windows Hello is convinced I have a PIN, which I 100% definitely do not (I have always had to login to my PC using my full password). Creating a pin on the new OS install did not work.I reinstalled the old HDD (running Win8.1), fired up the computer and went to sign-in options. There is no option to change my PIN, only create one. I go to create a PIN and get the following error \"An error occurred capturing your PIN. Please try again later.\"I made sure the Credential Manager Service is running, even tried manually restarting it. Changed my user security level to minimum. Nothing works.Why is it so difficult to activate something I legally own? THIS is why people pirate... You have to jump through a bunch of hoops just to get whats rightfully yours working. It's ridiculous.So now I guess I'm stuck pirating Office, thanks Microsoft.","solutions":["I upgraded my laptop from HDD to SSD. OS installed (Win10), most apps & updates installed without issue, then came Office. I installed Office and went to sign in to Activate it. I signed in with my email and password, then it states I need to verify\/login using Windows Hello (which I've never used\/seen before). Windows Hello is convinced I have a PIN, which I 100% definitely do not (I have always had to login to my PC using my full password). Creating a pin on the new OS install did not work.I reinstalled the old HDD (running Win8.1), fired up the computer and went to sign-in options. There is no option to change my PIN, only create one. I go to create a PIN and get the following error \"An error occurred capturing your PIN. Please try again later.\"I made sure the Credential Manager Service is running, even tried manually restarting it. Changed my user security level to minimum. Nothing works.Why is it so difficult to activate something I legally own? THIS is why people pirate... You have to jump through a bunch of hoops just to get whats rightfully yours working. It's ridiculous.So now I guess I'm stuck pirating Office, thanks Microsoft.1. We do not work for Microsoft.2. You have to buy Office, it does not come for free.3. Windows Hello is for Windows 10, not 8.1.4. You have posted to the Windows 8.1 forums."]},{"symptom":"where is my product key        Where I can find my product key?","solutions":["Run this cmd within powershell with admin powershell “(Get-WmiObject -query ‘select * from SoftwareLicensingService’).OA3xOriginalProductKey”Or wmic path softwarelicensingservice get OA3xOriginalProductKey if using cmd prompt.Or: Check this program to reveal if there’s a key embedded in the BIOS: https:\/\/neosmart.net\/OemKey\/Or: Download and run this: https:\/\/www.microsoft.com\/en-us\/p\/showkeyplus\/9... to find all keys used on the PC.If you purchased a PC with Win 10 installed then it most likely is using a generic key which is connected to your Microsoft account.Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thank you, It works and I do fin my keys, I appreciated your help","Great news. If you don’t have any further questions please feel free to mark one of the replies as the answer &\/or rate my help: 1 star means you are very unsatisfied with my help and 5 stars means you are very satisfied with the help I gave you."]},{"symptom":"You'll need a new app to open this - ms-windows-store error!        I tried everything to try and get Microsoft store working again. I used WSrest to try and reset it. Didn't work. I try to reinstall many times with powershell. It didn't work. This is the event error. Log Name:      Application Source:        Microsoft-Windows-Security-SPPDate:          12\/29\/2019 5:37:10 PM Event ID:      8198Task Category: None Level:         Error Keywords:      ClassicUser:          N\/A Computer:      WIN-S785NSGG1T8 Description: License Activation (slui.exe) failed with the following error code:hr=0x80072EE7 Command-line arguments: RuleId=3482d82e-ca2c-4e1f-8864-da0267b484b2;Action=AutoActivate;AppId=55c92734-d682-4d71-983e-d6ec3f16059f;SkuId=0567073a-7d74-403b-b2d5-6b35da372d8d;NotificationInterval=1440;Trigger=TimerEventEvent Xml: <Event xmlns=\"http:\/\/schemas.microsoft.com\/win\/2004\/08\/events\/event\">  <System>     <Provider Name=\"Microsoft-Windows-Security-SPP\" Guid=\"{E23B33B0-C8C9-472C-A5F9-F2BDFEA0F156}\" EventSourceName=\"Software Protection Platform Service\" \/>    <EventID Qualifiers=\"49152\">8198<\/EventID>     <Version>0<\/Version>    <Level>2<\/Level>     <Task>0<\/Task>     <Opcode>0<\/Opcode>    <Keywords>0x80000000000000<\/Keywords>     <TimeCreated SystemTime=\"2019-12-29T23:37:10.238434700Z\" \/>    <EventRecordID>98<\/EventRecordID>     <Correlation \/>    <Execution ProcessID=\"0\" ThreadID=\"0\" \/>     <Channel>Application<\/Channel>    <Computer>WIN-S785NSGG1T8<\/Computer>     <Security \/>  <\/System>   <EventData>     <Data>hr=0x80072EE7<\/Data>    <Data>RuleId=3482d82e-ca2c-4e1f-8864-da0267b484b2;Action=AutoActivate;AppId=55c92734-d682-4d71-983e-d6ec3f16059f;SkuId=0567073a-7d74-403b-b2d5-6b35da372d8d;NotificationInterval=1440;Trigger=TimerEvent<\/Data>  <\/EventData> <\/Event>","solutions":["Hi, reginagamble My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I've tried everything, but still no go. I used the Diag-app, showing this. ","Try cleaning the Microsoft Store Cache https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I've tried it. I deleted the S-I-D restart my computer and used WSreset in run, but it still didn't work. ","I recommend that you repair Windows completely before you must make a backup of your personal files, third-party software will be removed. Here the link to download the Windows ISO.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","The first option did the trick! Thank you!","I'm glad you could solve the problem"]},{"symptom":"Notification popping up then disappearing every few minutes.        At random time intervals, usually between a few minutes to an hour, I get a notification saying: \"C:\\Program Files\\WindowsApps\\Microsoft.MicrosoftOfficeHub... Windows cannot access the specified device, path, or file. You may not have the appropriate permissions to access this item.\"What is this and what can I do to get it to stop?","solutions":[]},{"symptom":"microsoft store apps closing        titlethings that didnt work:sfc \/scannowdismresetting appswsresetany other solution?","solutions":["Hi Soloaaaaa, My name is Riccardo and I will be happy to assist. You've pretty much exhausted many of the troubleshooting steps necessary to try to fix this issue.Let's see if we can still get this working... Step 1 - Are you up to date with Windows Updates? Go to Start > type in Check for Updates Click Check for Updates icon Click Check for Updates button Do you have Feature Build 1909 installed? Easy way to check is go to Start > type in winver and click the winver Icon. Step 2 - Have you tried Powershell Fix? Go to Start > type in Powershell Right-click Powershell and run as administrator Copy and paste the following: Get-appxpackage -all *shellexperience* -packagetype bundle |% {add-appxpackage -register -disabledevelopmentmode ($_.installlocation + “\\appxmetadata\\appxbundlemanifest.xml”)}Step 3 - Repair Upgrade If all of the above troubleshooting fixes don't work - you can try a repair upgrade which will restore everything back to original factory settings:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Let me know if you have any other issues regarding this I will be here to assist."]},{"symptom":"Xbox beta on my pc downloads games so slowly and my internet speed is about 2GBPS        Xbox beta on my pc downloads games so slowly and my internet speed is about 2GBPS. Im very angry and I would really like a way to fix this as i have done everything microsoft has said to do to fix it.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Extremely sorry for the inconvenience. Please try the following steps and download Xbox Beta app from Windows Store. 1. Open Command Prompts as Administrator. 2. Run the following code: ipconfig \/flushdns (There is a space between ipconfig and \/ ) Then perform the following: 1. Press Windows+R to open Run. 2. execute the following command. wsreset.exe Close the WIndow. Open Store and download Xbox Beta app."]},{"symptom":"Limited ability to operate PC after closing PC games (Steam)        Hi everyone,Recently I picked up a new gaming PC which runs the standard software and operating systems. I typically use Steam to host all my games and one thing I've noticed (particularly when I've been playing for an hour or more) is that when I exit any game to the desktop. Certain aspects of my PC will no longer function. I can no longer conventionally click the power button or mess with any settings like Sound or Wifi (Clicking the icons does nothing etc) and often messaging apps and play buttons on Netflix won't work either, I know there are other ways to do these things but this is irritating and often hinders me afterwards as shutting down (not restarting) is the only way to fix this. This is more common after an elongated period of play.Any help or advice on this would be appreciated and apologies if I'm missing something obvious, I'm kinda new to all this.","solutions":["Hi DanielHolmes3 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.Have you tried running basic commands like SFC and DISM? Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes. I will keep working with you until it's resolved.Thank you!"]},{"symptom":"i did a update and all my stuff is gone        I did a update and all my stuff is gone","solutions":["I did a update and all my stuff is gone","Hi Dan, this is happening much too often at the moment, though it may not seem so, you are logged into a temporary account . . .Before you do anything or move any files around Restart (not shut down) your PC 4 times, each time let your PC get to the Desktop before the next restart, this will fix this issue a lot of the time . ..Otherwise: Please open Windows File Explorer Navigate to C:\\Users Do you see two user folders that look like yours? Open those folders and check inside Pictures, Documents . . . etc. and see if your files are thereIf your files are there: Create a new user profile with Admin privileges Log into the new user profile Copy all your data from the old profile to the new profile (Documents Library, Pictures Library . . . etc.)If you still have not found your files, look for a Windows.old folder on your C Drive, expand that to open the users folder contained inside - check there for your files, icons . . .etc.If you do find your files . . . etc. there, copy them out as soon as possible as Windows will remove the Windows.old folder in timeNOTE VERY IMPORTANT: Do Not copy your files into the Temporary profile you are currently in, when the situation is corrected, your files will be deleted with the Temporary Profile and will not be recoverable !!"]},{"symptom":"OPEN GL 3.3 or Higher Graphic card        I just bought Aurora HD Editing Software and it says I need an OPEN GL 3.3 driver or higher. I have a 64 bit Inetel Graphics from Window's 10. I have a HP desktop. I found it says I have the latest driver so does this mean I can't use the program; can't buy the graphic's card needed ?","solutions":["Hi Mspatriciaann 1 Open Device Manager (accessible by right clicking your Start Button) Expand the Display Adapters section What is the exact Model of the device(s) you find in that section? 2 What is the exact Model No. of your HP Desktop, that will be printed on a sticker on the bottom casing . . .","I have a refurbished Hewlett-Packard HP |Compaq 8200 Elite SFF PC. Under the graphic it says Intel HD Graphics. In Aurora HDR sofewarae it says I need GL 3.3 or better graphics driver. I am using Windows Pro 10. It is a 64 bit. Intel Core i5 2400 CPU @3.10 GHz. I bought driver's pro and it says I'm up to date in all drivers. Something else needed?  I'm worried this computer just isn't new enough or loaded enough to use this software. Also it hangs up for a few seconds with my photoshop elements 2018. I have 8mb ram.  Thank you so much for responding.","Forgot --- Happy Holdays","Hi Mspatriciaann Happy Holidays to you also . . . I am sorry the 2nd gen Intel Core i5 2400 processor has Intel HD Graphics 2000 on Chip and that will not support that software and most likely will not work correctly on Windows 10, because Microsoft or Intel no longer supply drivers for that graphics option . . . You can purchase a graphics card for that PC, which would vastly improve your performance in Photoshop . . etc, they are available form $40 online . . . just google graphics cards fro a HP Compaq 8200 Elite and make sure the card supports OpenGL 3.3 . . .","You are wonderful !!  I will do this. It is a pain in the buttinsky to open it up and know how and where to change the graphics card, but I think I can do it. I did upgrade the ram myself. So glad to hear all is not lost and it will work better with my pictures !!! It has been so frustrating to put in a picture change (example clone) and the have to wait until it is recuperated to continue."]},{"symptom":"How to stop HDD-s spinning when not in use        Hi.I did a clean windows 10 install a month ago. I have SSD as primary drive and two additional HDD-s where I keep my pictures, videos, backups etc. I have set to turn off HDD-s after 10 minutes of idle but the HDD-s never stop spinning. If I set to turn off HDD-s ater 1 minute then YES the HDD-s will stop spinning after 1 minute but after 2 minutes they start to spin again! And in 1 minute they will turn off agan. On & Off - not goodI think that windows defender or something else is constantly checking viruses or errors on the HDD-s - that is so annoying. How can I stop that? How can I exclude my HDD-s from any automatic virus\/error check?On Windows 7 I did not have this issue","solutions":["Hi GaiusBaltar, My name is Riccardo and I would be happy to assist. First, to put in exclusions for to the link below: https:\/\/support.microsoft.com\/en-ca\/help\/402848...It will open the Exclusion area in Windows Defender where you can add specific files, folders or an entire drive.Please note that doing this may have unintended consequences. If a virus puts a dormant file on those drives it will be hard to detect.You can have the drives get shut off via the power plan. Please see the link below: https:\/\/www.tenforums.com\/tutorials\/65710-add-r...Let me know if you need any further assistance I will assist until this issue is resolved.DISCLAIMER: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi Riccardo.I have already tried these options and unfortunately they did not help. The turn off HDD option works only for 1 minute but then disks turn on again after 2 minutes because Windows Defender (or something else) starts to scan the HDD-s for something. Adding exclutsions also did not help.I do not believe that I have malware or anything because I recently did a clean Windows install and I have googled that many other have the same issue with Windows 10 - the HDD-s do not turn off because some process constantly reads from the HDD-s.","Hi GaiusBaltar, How about if we do all the configurations above and you do a Clean Boot of the system?https:\/\/support.microsoft.com\/en-ca\/help\/929135...See above - does this still get it to start spin-up?"]},{"symptom":"P2V Migration for historical recordkeeping        I recently moved my 96-year old father into a retirement home and replaced hiscirca 2010 desktop with an All-In-One. I retained the desktop so I can access his files and accounts since I help to maintain is finances, taxes, online accounts, genealogy, and for any legal records. I would like to dispose of one extra PC in my home before the hardware is just too old to upgrade or catastrophically fails. Therefore, I migrated the physical image to a virtual one (P2V), and have it running on my Xeon desktop. The VM seems to be working properly, but keeps complaining about Windows' authentication. Can I either just ignore the reminder since I only use teh VM occasionally and briefly to check finances?OR,Can I follow the process to transfer teh Windows 10 physical license to a virtual license?Here are some reference links:How to Transfer your Windows 10 License to a New Computerhttps:\/\/www.groovypost.com\/howto\/transfer-windows-10-license-new-pc\/Activate Your Windows 10 License via Microsoft Chat Supporthttps:\/\/www.groovypost.com\/howto\/activate-windows-10-license-microsoft-support\/Thanks to anyone who has an answer. ","solutions":["I hope you enjoy your Dad for many more years.A VM is just like a physical computer for the purposes of activation. Normally, once a computer is activated on Windows 10, it remains activated for the rest of that computer's life.However, a computer with a new motherboard is considered a new computer for the purposes of activation, and your P2V gave your Dad's copy of Windows a new motherboard. A new computer needs a new license.Here are some things to try in your situation:You could simply forget about activation. If you only rarely use that computer, it might not be worthwhile to spend the money on a new license. You'll get regularly reminders to activate, which you'll have to live with.Perhaps it's possible to obtain new, supported versions of your Dad's software, that would accept the data on your Dad's computer.","Hi Sean, legality is in dependent of license type. If old PC had preinstalled (OEM) Windows version the license is tied to PC and cannot be transferred to another one either in physical or virtual environment.If Windows was purchased separately from PC your transfer is legal."]},{"symptom":"I am so confused!        Okay so I just recently got the Dell Inspiron 13 5000 for Christmas. It is using Windows 10 and everything is up to date. I only got it 5 days ago.I really like it but whenever I am using a web browser (I think it only happens when I'm on youtube) the video will start to glitch. This is fine, I just reload the page. The issue is that the screen will freeze for a few seconds before the whole screen goes black with a little static box. I will still have a cursor but I can't do anything. I have to force my laptop to turn off to restart it. I have tried looking online to find a solution but that just confuses me more. Please help!","solutions":["Hi Anime.Girl, My name is Riccardo and I'd be happy to assist today. Well first off that's a great gift to get a laptop! I am going to put through some steps we can try to alleviate this issue for you.Step 1 - Let's Reset your Graphics Card (next time this happens) Click the following: Windows Key + Ctrl + Shift + B Does the display come back to life and not turn black? Step 2 - Update your Graphics Card Driver Go to Start > type in Device Manager > click Device Manager icon Expand your Display Adapters Right-click the display adapter (probably nvidia or Intel HD) Click Update Drivers Step 3 - Do a Clean Boot of Windows 10 Perform the steps below and do a clean boot of Windows 10 https:\/\/support.microsoft.com\/en-ca\/help\/929135...Does it allow you to now watch videos without any issues? Let me know if the above steps don't work and I will be here to support you to fix this issue."]},{"symptom":"Audio Issues - win10 - Os build 1909        Hi guys, I don't know if you guys ever counter this issue before, but after the package update my audio has been having these small little static noise that comes up pretty often if I'm listening to music or gaming, once in a while it's fine by me but then it occurs lots more recently and I got super annoyed by it. I listen to music pretty often and it makes me quite upset after the package update. I tried pretty much every method I can find on this topic, which including uninstall the audio driver in the device manager tab. Even when I use this method (uninstall), I'll still have to do it within a week later. It'd be really great if anyone can help me with this issue,  I'm also considering reinstall win as well but that will be my last option. Thank you. ","solutions":["Hi, When uninstalling the driver, did you tick the box that says 'Delete the driver' otherwise it would re-install with the older drivers. Also, did you use the drivers downloaded by Windows Updates or download them directly from the manufacturers website?","Hi, When I uninstalled, I did click the box, and I used the one provided from the update (1st tried). The 2nd and 3rd, I just went with manufacturer, but still encountered the same problem (it just less static noise so pretty much still the same case after a week.) That's why this is quite weird. ","Hmm, strange. Is it a desktop or a laptop? Have you made some hardware changes?","I also have the same issue. I have a laptop though.","Mine is a desktop, if what you mean by change that are like update that are necessary then yes, i keep everything pretty much up to date. But if change like changing the drivers that are not compatible to my main, then I don't, cause  I know it will mess up with the system","Hi Os, please check for updates for all drivers not sound only. Please check your system with LatencyMon tool and driver verifier https:\/\/support.microsoft.com\/ru-ru\/help\/244617...","Hi Igor, I did, I always make sure all of my drive are up to date, weird it's only with the audio only that I have problem with "]},{"symptom":"restoring my pc to an earlier date        I been trying to restore my pc for about a week now, the virus protection called Segurazo is keeping me from restoring, it says could not extract the files from it so system restor did not restore my pc. HELP!!!!!! im the administrator but it wont let me give permissions to make changes to the virus protection, if I restore my pc after I uninstall it , it reinstalls and stops the restoring process","solutions":["Hi mandymaldet and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this video tutorial for detailed instructions.https:\/\/www.youtube.com\/watch?v=jOW38IhxsTUI hope this helps. Feel free to ask back any questions and let me know how it goes. I will keep working with you until it's resolved.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Segurazo is very suspicious program. Most probably it is malware.The easiest way to solve your problem is to uninstall or remove the program and try restoring your PC again, and that way I think it will work.To recover your PC, follow the post.https:\/\/support.microsoft.com\/en-us\/help\/12415\/windows-10-recovery-options","I have done everything I could think of, ive unistalled it then did a system restore form my restor point and it re installs back into my pc. my Malwarebytes cant even get rid of it. I didn't evn put the software in my pc. I have never heard of it. I use one of the three virus protections , AVG Defender pro and Malwarebytes. I created m a restore point ive even used the ones already there. but nothing works.","I have done everything I could think of, ive unistalled it then did a system restore form my restor point and it re installs back into my pc. my Malwarebytes cant even get rid of it. I didn't evn put the software in my pc. I have never heard of it. I use one of the three virus protections , AVG Defender pro and Malwarebytes. I created m a restore point ive even used the ones already there. but nothing works.","Hi mandymaldet, Have you tried that while in Safe mode? Thank you!","I been trying to restore my pc for about a week now, the virus protection called Segurazo is keeping me from restoring, it says could not extract the files from it so system restor did not restore my pc. HELP!!!!!! im the administrator but it wont let me give permissions to make changes to the virus protection, if I restore my pc after I uninstall it , it reinstalls and stops the restoring process"]},{"symptom":"Can't download Games from Microsoft Store        Title, I tried everything on the troubleshooting page and whatever I found on Google.microsoft is  a piece of steaming ****, how the **** can you **** up something so trivial. **** useless trash","solutions":["Hi YuriSwagarin and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. ipconfig \/release <Enter> ipconfig \/renew <Enter> ipconfig \/flushdns <Enter> ipconfig \/registerdns <Enter> nbtstat -rr <Enter> netsh int ip reset all <Enter> netsh winsock reset <Enter> Restart your PC. I hope this helps. Feel free to ask back any questions and let me know how it goes. I will keep working with you until it's resolved.Thank you!"]},{"symptom":"Windows 8.1 reactivation        Please, help me reactivate  windows 8.1 'coz everytime i did it it's always asking for a product key which i don't haave.","solutions":["Windows 8.1 does not come for free.You need to have bought 8\/8.1 yourself or had 8\/8.1 preinstalled on a Dell, HP, etc.@@@@@@@@@@@@@@@@@@@@@@@@@@Activate Windows 7 or Windows 8.1 - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@@@@With Windows 8\/8.1 The Product Key on preinstalled Operating Systems (HP, Acer, etc) is embedded in the BIOS in the Motherboard, so that the lost and\/or worn C.O.A. Sticker problem is no more.When you reinstall it will pick up the Product Key and activate the system automatically.If it does not or you have activation problems, follow these steps:\"How to Activate Windows 8 and 8.1 by Phone\"http:\/\/www.eightforums.com\/tutorials\/24636-activate-windows-8-phone.htmlFollow these steps and do a Phone Activation and hold on for a real person to assist you.OPTION TWOTo Activate Windows 8.1 by Phone 1. Do step 2, 3, 4, 5, or 6 below for what you would like or able to do.2. Press the Windows + R to open the Rusluisn dialog, typeslui.exe 4, press Enter, and go to step 7 below.3. Open an elevated command prompt, typeslui.exe 4, press Enter, and go to step 7 below.4. Open the Power Users Tasks menu, click\/tap on System, and go to step 5A below.5. Open the Control Panel (icons view), and click\/tap on the System icon.A) Click\/tap on Activate Windows at the bottom right corner underWindows activation, and go to step 7 below. (see screenshot below)6. Open PC settings, click\/tap onActivate Windows on the left side. Etc.\"Get help with activation errors\"http:\/\/windows.microsoft.com\/en-us\/windows-8\/activation-errors\"How to activate a Microsoft product by using Microsoft Product Activation Center\"http:\/\/support.microsoft.com\/kb\/950929\/en-us_______________________________________________If phone activation is not available to you or does not let you contact Micosoft, you will have to use this method tocontact MS support _______________________________________________This information may interest you if you do wish to keep a record of it:\"Windows 10 Embedded Product Key Tool\"https:\/\/neosmart.net\/blog\/2014\/windows-10-embedded-product-key-tool\/\"We’re proud to introduce the immediate release of our newest utility for Windows users: the NeoSmart Technologies Embedded Product Key Tool. Designed for users of Windows 7, Windows 8, and Windows 10, our embedded product key tool will retrieve and display the Windows setup product key embedded in the BIOS or EFI, allowing you to store it for safe-keeping or use it to reinstall Windows with an official Windows setup image.\"You can also use:\"Belarc Advisor - Free Personal PC Audit (Version 8.5c)\"http:\/\/www.belarc.com\/free_download.htmlOr:\"Product KeyFinder\"https:\/\/www.magicaljellybean.com\/keyfinder\/Cheers."]},{"symptom":"network\/sharing        In windows 10, how do I setup a home network between my tower and laptop?","solutions":["Hi mshilliby, My name is Riccardo and I would be happy to assist you today. Setting up a home network in Windows 10 is very simple.I suggest following the steps at the website below: https:\/\/www.windowscentral.com\/how-setup-and-ma...Let me know if you need anything further. DISCLAIMER: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I apologize, another expert has stated that this article is out-of-date - please check the article below directly from Microsoft:https:\/\/support.microsoft.com\/en-ca\/help\/17145\/..."]},{"symptom":"WINDOWS UPDATE        What are the other Microsoft products I'll receive updates for when I enable Receive updates for other Microsoft products in Advanced options on the Windows Update Menu?","solutions":["Hi ChizaramEA, My name is Riccardo and I would be happy to assist. This particular setting will update other Microsoft products like: Microsoft Office Silverlight Microsoft-Made Applications (from the Microsoft Store) Basically anything on your system that is made by Microsoft and is not specifically within the Windows operating system and is an add-on.There is no real documentation as to exactly what it updates; but, the above is a good starting list of what to expect.Let me know if you have any further questions.","What are the other Microsoft products I'll receive updates for when I enable Receive updates for other Microsoft products in Advanced options on the Windows Update Menu?Any other software you have installed that was created by Microsoft, like Office.","Thanks Riccardo.This is really clear enough; I've always wanted to have an insight.Thanks again.","Thanks.","No problem"]}]}