{"windows":[{"symptom":"Task manager - GPU issue        The GPU column in the task manager is showing abrupt information,  like sometime it shows the correct value of the gpu usage of each process but sometimes it does not show anything. There is a noticeable duration till this problem is noticed so it cannot be ignored.I also noticed that its somewhat laggy !! Here the column head shows 9% whereas each process shows 0%.INCORRECT \/ MISMATCH :::::CORRECT::::::Intel i5-8genIntel UHD graphics 620 (updated)I have tried reinstalling the latest Intel driver but it did not solved the problem.Is there any way to resolve the issue of showing mismatch GPU usage without clean boot windows ?","solutions":["Hi Himanshu, There may be some minor faults in video driver prevented correct displaying. Does this occurs in the same Windows session or in different?And please note the wrong GPU load displaying is cosmetic only and does not affecr video card operation.","Yes, It occurs in the same Windows session.It worked fine previously.I noticed the fault just 2 days before.","Try to repair Windows system files by sfc \/scannow and DISM.exe \/Online \/Cleanup-Image \/RestoreHealth command from Windows PowerShell (administrator) environment. If this will not help please ask motherboard's manufacturer support - it is driver who (not) reports these data.","hey yeah..i having the same problem but instead of Firefox not showing the correct information its certain games, and not all of them neither its only certain ones. i can playing one game and its shows the same correct usage on 3 different monitoring programs. Others don't show any usage on the task manager but show normal usage on other programs.i cant help but feel that the problem is the task manager only picking up certain data when using specific programs right...i wouldn't know but please help solve this :)"]},{"symptom":"\"You'll need a new App to open this ms-wpc.\" When opening chrome. How do you fix this? (Already tried a few solutions)        Yes, I have tried most solutions given on other threads with the same problem. This happens when I'm specifically opening Chrome and no other applications. I uninstalled and reinstalled, and even ran the command on powershell a few times already. Nothing happens. I would like to have access to Chrome for my convenience in accessing many programs like Docs, Drive, and Gmail that it has (yes I am aware you can access this trough Edge).Please help. ","solutions":[]},{"symptom":"Mouse scrolling is jerky in Chrome\/Win7        I only have this problem in Chrome but there are no options in Chrome for the mousewheel so I thought I'd ask here if anyone else has noticed this in Win7.  I've tried adjusting Advanced Performance options in Windows and kept everything for max performance to minimize interactions except for showing contents of windows when dragging but that didn't make any difference.  So has anyone else had this problem?  Every click on the mousewheel is like I hit the down arrow on the keyboard.  The screen jerks incrementally instead of being smooth.  Tried 2 different type of mice.  ","solutions":["Are you using a wired mouse?  Wireless mice are subject to radio interference and that could be constant.Another possibility is a system that does not have enough resources.  That could result from infections as well.This is NOT a common problem.","Yes i have noticed a bit of a judder as well in Chrome which has always been there.I believe this to be the norm as i have seen this on many different computers over all the years.There is a slight delay between scrolling as well as the number of lines you select to scroll at a time in the Mouse Properties.","> Are you using a wired mouse?  Yes, I've tried 2 different wired mice.  Not a resources problem.  I'm using a fraction of the 16gb ram I have.  Nothing else was running except Chrome.   ","Yes, the scrolling speed seems to be both jerky and at a different rate than on all other programs.  Its very mysterious. ","Please answer as many of these questions as you can.  Maybe I can advise you.  I need a lot more info to help you diagnose this:Laptop or DesktopAge of computermake\/modelOperating system installed (e.g. Windows 7)32 or 64 bit? (Right-click on Computer, choose Properties)Service Pack 1 (SP1) installed? Same place as 5 above.Processor?  Same place as 5 aboveCapacity of disk drive, how much is in use?  Pie chart shown in ComputerModel number of hard drive (click Disk in Device Manager)If Windows has ever been re-installed since it was new, when was that?Age of hard drive if not the originalHow much memory is installed? (Right-click on Computer, choose Properties)Please list ALL installed programs.....What security software is installed?Is your internet service wireless or wired?Speed of Internet service you are using (www.speedtest.net )","You are absolutely insane.  Model of hard drive is going to influence mouse scrolling in just Chrome?  This must be spam.  How about I carbon date the hard drive so you have its accurate age?  And is that age from manufacture or how long I've owned it?  Troll somewhere else. ","Not spam.  I am an expert and offer to help you if you will supply the details any good technician would ask for.If not, simply do not reply to me.","Fair enough.  So why not answer the questions I asked?  Once again:How could the model of hard drive going to influence mouse scrolling solely in Chrome?How is the age of the hard drive going to influence mouse scrolling solely in Chrome? Does Chrome demand a certain level of hard drive performance or youth otherwise it seeks to interfere with normal mouse scrolling? How could internet connectivity type or speed possibly interfere with mouse scrolling in just one program (Chrome)?I await your reply with much curiosity.  I do see you copied and pasted your initial response.  Guess you do that with a lot of posts you see.  Its not very respectful though, or accurate.  I'm reading an article you wrote on AskWoody and its very competently written so I'm surprised that you'd copy and paste a response here.  You do seem to really know your stuff and come to conclusions in a very logical manner.  There's a typo there you might want to fix.  I'm guessing the & was supposed to be a 7.  Couldn't leave a comment on that page.\"Use the Windows Easy Transfer tool (part of Windows &)"]},{"symptom":"Windows does not boot after the Windows Hypervisor Platform is enabled        My laptop (Asus TUF FX505DU, AMD Ryzen 7 3750H with Radeon RX Vega 10, GTX1660Ti, 16GB DDR4-2666 run at DDR4-2400 by default, Windows 10 Education 1809) will not boot up (blank screen) after I enabled Windows Hypervisor Platform and Hyper-V in Windows Features after SVM is enabled in BIOS. I have to hard shut down, F2 into BIOS to disable SVM in order to boot into Desktop properly. Strange enough, if I just enable SVM in BIOS but not the Windows Hypervisor Platform and Hyper-V in Windows Feature, it does boot. Is there any solution for this issue? Thanks. ","solutions":["Hi France My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.I see some important updates available for your make and model I recommend you apply.BIOS Update May 2019 https:\/\/dlcdnets.asus.com\/pub\/ASUS\/GamingNB\/FX5...Chipset June 2019 https:\/\/dlcdnets.asus.com\/pub\/ASUS\/GamingNB\/FX7...After applying the updates, proceed to enable virtualization again in the BIOS. I would also try upgrading to the newer Windows 10 1903. Go to the following page then click 'Update Now' https:\/\/www.microsoft.com\/software-download\/win...","Updated to the latest BIOS and AMD Chipset Driver. However, it is still the same result if I enabled Windows Hypervisor Platform and Hyper-V in Windows Features after SVM is enabled in BIOS.Another thing to mention that I also unable to get the latest Windows 10 1903 update","Press Windows key + R Type: msinfo32 Hit Enter Scroll to the bottom of the system summary page Take a screenshot then post in a reply here.","Here it is, ","I am suspecting this might actually be a bug. I recommend you file a bug report; send me the short link so I can vote on it and bring it to the attention of the Windows engineers.https:\/\/windows10.help\/blogs\/entry\/54-how-to-su...Information in the above link is sourced from a trusted Microsoft MVP blog.","Bug report filed. Here is the link: https:\/\/aka.ms\/AA5ozk9Thanks for the troubleshooting. ","Thank you for your help France.","I'm having the exact same problem with my Asus Fx505DT-AL106T (Ryzen 5 3550H, Radeon RX Vega 8, Nvidia GTX 1650, 8GB DD4, Windows 10 Pro x64). Enabling Hyper-V or Hypervisor Platform renders Windows unable to boot. ","Same laptop same problem, if you find a solution plz share","Same laptop same problem, if you find a solution plz share I haven't found a solution yet. If I do, I will definitely share it."]},{"symptom":"How to return a computer to factory settings?        How to return a computer to factory settings?","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.You can reset your Windows 10 installation, please see this article for instructions:https:\/\/support.microsoft.com\/en-gb\/help\/402652...Regards, Ross"]},{"symptom":"4 beeps and then crash        When I am on a game like seige or call of duty ww2 I sometimes hear 4 quick beeps and then around 2-5 mins later it will crash","solutions":["Hi Ronan Do the beeps seem to be coming from your speakers or form the casing of your PC? Beep codes from the PC casing generally indicate a hardware problem, possibly overheating . . .What is the Make and exact Model No. of your PC - that will be printed on a sticker on the bottom casing, or if that is a self-build, what is the make and model of the mother board . . .","I am having the same problem I try to play a game like Rimworld for example and after a couple minuts the pc Beeps 4 times fast in the headphones and then the pc just freezes I don't think it's an overheating issue because I've had that in the past and I recently replaced the Thermal paste on the cpu and it usually sits around 60-70c while gaming and around 30-40 in idle\/low effort mode any help would be appreciated","I found out the problem, the powersupply wasn't strong enough, I upgraded it and have not had the problem ever since and the beeps were coming from the speaker "]},{"symptom":"Mail setup Windows 10 Build 10.0.17763 not pulling in email        Last week my problem with setting Mail in Windows 10 was solved here.  I liked it so much I decided to use it on friends computer running Windows 10 Edge.  I followed the instructions and I was able to send an email successfully but it did not pull in emails to the Inbox from the roadrunner acct. the friend uses.  The only difference I see is that my machine runs a different build of Windows 10...could this be the problem?I've deleted the acct in Mail and restarted the machine and set up from the beginning per the instructions:https:\/\/www.windowscentral.com\/how-manage-emails-and-accounts-settings-windows-10Suggestions?Thanksgp.s. in poking around else where on friends device I see email that looks like it is from Outlook but he does NOT use Outlook.","solutions":[]},{"symptom":"WINDOWS 8 E-MAIL        After 3 yrs use, I have lost all reference to the various folders shown on LH side of screen in my Windows Live Mail screen. There is no folder for sent, inbox, deleted etc. I cannot send or receive e-mails. How do I restore the Windows Live Mail?","solutions":[]},{"symptom":"Heavy distortion on my Blue Yeti on my pc        I just got a blue yeti (blackout edition). In every software I use, the mic sounds extremely distorted to the point I can't even understand it. I've been looking for a solution for hours but nothing has worked. I was told by the person I bought it from it may be an issue with USB 3.0 (I only have USB 3.0 ports) or just the computer itself. I have reinstalled drivers and that didn't work either.","solutions":["Hey Boomer. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I will give you all possible Microphone fixes to try in sequence. Even if you've already tried one I'd do it in this order as one step may affect the next.Please run the Recording Sound troubleshooter at Start button > Settings>Update & Security>Troubleshoot.Try these fixes next: https:\/\/www.windowscentral.com\/setting-your-hea...https:\/\/win10faq.com\/fix-microphone-settings\/https:\/\/www.howtogeek.com\/395296\/fix-my-microph...http:\/\/maxedtech.com\/fix-microphone-not-working...https:\/\/www.makeuseof.com\/tag\/fix-microphone-pr...Some report that what worked is turning off Fast Startup at Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change Settings Currently Unavailable > uncheck the box for Fast Startup, Save Settings. Restart and then disable Hibernate file to clear it, restart PC again and enable Hibernate again:https:\/\/www.groovypost.com\/howto\/enable-hiberna... Right click the volume icon in System Tray at right end of task bar, open Recording Devices, see if the microphone is listed, set it as Default device.Type Microphone in Start Search, open Set up Microphone, scroll down to Microphone and choose Get started to set it up.Try rolling back the sound controller drivers in Device Manager reached by right clicking the Start Menu. Choose Sound controller device, then Driver tab, then Roll back if available.Update the Sound drivers from the PC's Support Downloads web page. While there make sure you also have the latest Chipset, Display, Network, USB and all other drivers, comparing with the version presently installed in Device Manager.If no newer driver then uninstall the ones presently installed in Device Manager, reached by right clicking the Start Button. Restart PC to reinstall.When did this behavior begin? If you have an idea you might be able to System Restore back to a point before it began:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... It's possible this was caused by a Windows Update so if nothing above works, go to Settings>Update & Security>Windows Update, check the Installed Updates list for Updates that might have been just installed, try uninstalling them using the Uninstall button present there. Then hide the Updates using the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... If this was caused by a Version update (which you can confirm at Settings > System > About) then for ten days you can roll back Version in Settings>Update & Security>Recovery and hide it until it matures using the Hide Updates Tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... If there are other performance problems then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. Others are fixing USB mic and headset issues with Step 16 to test a new Local Admin account, because the account is corrupted and this is the only fix.If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows 10 - Screenshot and Windows Snipping Results in OverExposed images        For some reason, every time i take a screenshot or snip, the resulting images looks like an over exposed (very bright) image.  I have no idea why this is happening. I have updated all drivers. My system software is completely up to date.  Is anyone else seeing this issue?  Dell even replaced my brand new XPS 2-in-1 (with the latest 10th gen Intel Core i7) laptop because they could not figure this out. But the problem persists even with the new laptop. On the screen everything looks normal but the screenshot looks overexposed.  I have included the actual image (right) and the screenshot of the image (left).","solutions":["Hello KuhooEdson! My name is Marco, I am an Independent Advisor. I will do my best to help you.How do you take your screenshots? And with what software also you open them? Does the same thing happen with the Windows capture tool? To use it, click on the Windows start button and type \"snipping tool\" and test this.Marco","Hi Marco.I use the PrtSc button on my laptop as well as the Snipping tool that comes with Windows.  And yes, both methods yield the same results.  I paste the resulting screencapture into a number of applications - PowerPoint, Word, Adobe Photoshop, etc- all with the same results.ThanksKuhoo","Hi. Is this a Microsoft Support Number? I am not able to find this number of their support pages.Just being cautious.  Hope you understand.Kuhoo","Ok, in the snipping tool, before saving the image, is it normal? or is it already overexposed?","Hi. Yes, everything presents as normal. I think I have narrowed  this down to occurring only on the Chrome browser. When I  'snip'or take screenshots on native laptop apps OR on other browsers like IE or FireFox, I don't see this issue. But it is happening consistently on Chrome running on Windows 10. So i am now convinced it is a Google issue, not a Microsoft issue.  My apologies for wasting everyone's time on this community.","Don't apologize for that ;), I couldn't find an adequate answer for you, but if now it only happens on google, make a backup of your favorites or password (unless you are already synchronizing with them via your google account) and reset the application's default settings or simply reinstall it."]},{"symptom":"windows 10 download problems        hello I am trying to download windows 10 and when it asks me if I want to run or save it I say run  and it kicks me off line , this sometimes happens when I try to download an email or update adobe","solutions":["You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700"]},{"symptom":"Virus or bug        Hi i have a virus and my computer is not working or working but very very slower what is happening? What should i do? Thanks","solutions":["If you have a virus run Windows Defender and Marwarebytes.","Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Try to run a malware removal tool such as malware bytes and see if this improves the situation:https:\/\/www.malwarebytes.com\/Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"touchpad issue        I have an HP Envy - I want to delete touchpad, but it keeps returning.  I never use the touchpad - all it does is cause trouble.","solutions":["Hello! I am an Independent Advisor, I would love to help you out! Open device manager > human interface devices. Find the touchpad and right click and choose \"disable\". If you delete it, windows will autodetect it and install a driver to make it work if possible. If you disable then the touchpad will not function and should not turn back on.","Did you go Settings, Devices, Mouse, Additional mouse options?  Disable Touchpad?If that does not do it have you tried the BIOS and see if it is there and you can turn it off?","I have disabled, deleted, and anything else I can think of...It keeps returning.  One of the main reasons for getting a new computer was this problem.  I don't know what to do in BIOS."]},{"symptom":"Problem - No longer able to download videos from iPhone to windows 7 PC.        For many years I have downloaded pictures and videos from my iphone to my windows 7 PC.  Never had a problem until yesterday when I tried to download about 100 photos and videos from a recent trip. The process kept getting interrupted with error msgs and I selected the option to skip each file with errors.  The result was I got only photos - no videos.  The error msgs I got were vague and stated that something connected to my computer was not working properly.  I tried to make a new short video and download it separately - same result.  I suspect that one of the recent updates to IOS 13 on my iphone has caused some different processing of videos that is somehow incompatible with the windows 7 downloading process.  If I am right, there must be lots of windows 7 users with the same problem.  Has anyone found a fix?","solutions":["For many years I have downloaded pictures and videos from my iphone to my windows 7 PC.  Never had a problem until yesterday when I tried to download about 100 photos and videos from a recent trip. The process kept getting interrupted with error msgs and I selected the option to skip each file with errors.  The result was I got only photos - no videos.  The error msgs I got were vague and stated that something connected to my computer was not working properly.  I tried to make a new short video and download it separately - same result.  I suspect that one of the recent updates to IOS 13 on my iphone has caused some different processing of videosthat is somehow incompatible with the windows 7 downloading process.  If I am right, there must be lots of windows 7 users with the same problem.  Has anyone found a fix?A lot of us use Smartphones with Windows.Have you checked with Apple?Import photos and videos from your iPhone, iPad, or iPod touch ...Apple Support: Learn how to transfer photos and videos from your iPhone, iPad, or iPod touch to your Mac or PC. We'll also show you how to make your photos available on all your devices with iCloud Photo Library._____________________________________________And:Sync your iPhone, iPad, or iPod using iTunes on your computerThere is also a link at the end of the above to submit a question to the Apple CommunityCheers.","Thank you Bill, Actually, I started investigating my problem by visiting the Apple site. As you pointed out, they have a tutorial for how to use windows to download photos and videos from an iphone. It’s EXACTLY what I have been doing for many years, except that 2 days ago it stopped working. So it is no help at all.  I noticed that Apple also has information about using itunes to perform the download – which is your second point. I did not follow through with this because I currently use itunes to manage an extensive music collection and synch it with my ipod. A downside to this is that whenever I connect my iphone to my pc, itunes launches automatically and begins trying to synch my music library with my iphone. I do not want this because I do not have the space on my phone for this library of thousands of hours of music and if even I did, the initial synch would take many hours for something that is absolutely not wanted. Additionally, itunes is very aggressive and it’s time-consuming to cancel it once it has launched. I want nothing to do with it. So, I’m looking for a windows solution, which is why I posted to this site. Since my initial post, I have learned something new that I want to share because it may lead more quickly to a windows fix. I connected my iphone to my windows 7 PC and opened my phone to view its contents. I find that I am able to copy photos from my phone to my PC but I am unable to copy videos to my PC (What??). I get the same error msg I received previously when attempting to use the windows download process. This time there was a little more explanation that referenced a “compression routine” that perhaps had used a CODEC not recognized by windows. These are just words to me – conveying little useful information – BUT, does this suggest a windows fix to any technical gurus that may be reading this?","Thank you Bill,Actually, I started investigating my problem by visiting the Apple site. As you pointed out, they have a tutorial for how to use windows to download photos and videos from an iphone. It’s EXACTLY what I have been doing for many years, except that 2 days ago it stopped working. So it is no help at all.  I noticed that Apple also has information about using itunes to perform the download – which is your second point. I did not follow through with this because I currently use itunes to manage an extensive music collection and synch it with my ipod. A downside to this is that whenever I connect my iphone to my pc, itunes launches automatically and begins trying to synch my music library with my iphone. I do not want this because I do not have the space on my phone for this library of thousands of hours of music and if even I did, the initial synch would take many hours for something that is absolutely not wanted. Additionally, itunes is very aggressive and it’s time-consuming to cancel it once it has launched. I want nothing to do with it.So, I’m looking for a windows solution, which is why I posted to this site. Since my initial post, I have learned something new that I want to share because it may lead more quickly to a windows fix. I connected my iphone to my windows 7 PC and opened my phone to view its contents. I find that I am able to copy photos from my phone to my PC but I am unable to copy videos to my PC (What??). I get the same error msg I received previously when attempting to use the windows download process. This time there was a little more explanation that referenced a “compression routine” that perhaps had used a CODEC not recognized by windows. These are just words to me – conveying little useful information – BUT, does this suggest a windows fix to any technical gurus that may be reading this?Have you considered what I had at the end of my reply?There is also a link at the end of the above to submit a question to the Apple Community","Thanks Bill.  This is looking like a problem with Windows 7 no longer getting update support and will likely go away when I upgrade to Windows 10.  I plan to do that after my taxes are done so the videos can remain on the phone until then.  In the meantime, I hope someone reading these 2 posts may have an idea that will fix this more quickly.  There must be other Windows 7 users experiencing this same problem.  In any case, you can relax - I will not be  making any further posts here or with the “Apple community” who I’m sure could care less what I can or can’t do with Windows."]},{"symptom":"Pop-ups that keep offering connected experience        In Microsoft Word, I set my privacy settings that I do NOT want connected experiences.  I just want to type what I need to type, save, print.  Lately I'm working on a resume and EVERY time I open it I get an MS word pop-up message telling me that I should change my settings to enjoy connected experiences.  I don't see a way to turn off these annoying messages?  I'm tempted to use the mac pages which is free and less functional but doesn't bother me every time I open it. Please advise. ","solutions":["Hi MS. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See all that I find here for Connected Experiences nag messages: https:\/\/www.bleepingcomputer.com\/news\/microsoft...https:\/\/docs.microsoft.com\/en-us\/deployoffice\/p...https:\/\/answers.microsoft.com\/en-us\/msoffice\/fo...https:\/\/answers.microsoft.com\/en-us\/msoffice\/fo...https:\/\/office365.uservoice.com\/forums\/273493-o...There is also this nag message and a a fixit to run to turn it off:: https:\/\/www.zdnet.com\/article\/how-to-turn-off-m...If it's related to Shared Experiences see here: https:\/\/www.brucebnews.com\/2019\/09\/how-to-get-r...If you want to report this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems.If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it. If you are an Insider I can also vote it up with my MVP badge and track the issue for you.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"deleting content on a cd-r disc in windows 10?        How do I delete content on a cd-r disc? So that I can burn new music on it.","solutions":["Hi Blessed143 unfortunately, a CD-R disc is Recordable, you can write to it only once. you cannot erase it and write new data to it.a CD-RW is a rewritable disk can be re-used."]},{"symptom":"Command line \/silent options for Microsoft's new windows installer cleanup tool        Is there a command line version of this tool?  https:\/\/support.microsoft.com\/en-us\/help\/17588\/windows-fix-problems-that-block-programs-being-installed-or-removedIt would be great for remotely fixing PCs with installer issues.","solutions":["Hi Jason, You may want to check this command line List for Standard Installer: https:\/\/docs.microsoft.com\/en-us\/windows\/win32\/...Please let me know if this is the one that you're looking for. Thanks and regards,","Hi Jason, You may want to check this command line List for Standard Installer: https:\/\/docs.microsoft.com\/en-us\/windows\/win32\/...Please let me know if this is the one that you're looking for. Thanks and regards, I tried the standard msiexec.exe \/x{guid} \/qn command.  Unfortunately sometimes this results in the following:T h i s   a c t i o n   i s   o n l y   v a l i d   f o r   p r o d u c t s   t h a t   a r e   c u r r e n t l y   i n s t a l l e d . MsiExec.exe exited on cmpc102 with error code 1605.The reason I wanted a silent run option for the utility Microsoft provides is because it actually is able to remove it from systems that display this message.  I know the computer has an add\/remove programs entry in the registry due to inventory software we use.  So the software is at least partially installed."]},{"symptom":"Taskbar        I am trying to get the date to show on my taskbar, because it suddenly disappeared.  Any suggestions?","solutions":["Hi Mary. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.The date can disappear if the task bar is made smaller by choosing Smaller Icons in Task Bar Settings, or if Clock is disabled altogether.Right click an empty area of the Task Bar, choose Unlock TaskBar, then choose Taskbar Settings, scroll down to turn off Use Small TaskBar Icons. If that's not enough choose link to Turn System Icons On or Off, turn on Clock.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved."]},{"symptom":"Trying to burn files to CD in windows 10 and windows media player is not cooperating        When I place a CD in the machine, the windows media player pops up automatically and I cannot use the file manager to create a burn list.When I try to add files to the burn list in windows media player, it does not accept excel or word files, but will accept MP3 and JPG.I have selected data disc and not audio disc, but that doesn't seem to do anything.Has anyone been successful or do I need to buy an aftermarket SW.Disappointed that HP didn't provide any SW for this purpose.","solutions":["Hello DiamondDave2013, I'm Didi, an independent advisor. Just close Windows Media Player and use Explorer to burn your files to your CD as shown in this tutorial :https:\/\/www.groovypost.com\/howto\/burn-files-dat... Regards, Didi","Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thanks for the quick reply.  My windows media player automatically opens with I insert a disc, and apparently because of that I dont get the chance to answer the question about how to use the CDR that I just inserted.  Think thats my first problem.","Under settings for devices I found a setting that was Autoplay.This was enabled.  When I disabled it and inserted a disc, I then got the popupthat asked what I wanted to do with the disc, and I was then able to use file managerto burn a disc.  Thanks so much for your help."]},{"symptom":"Overclocking 5400 Mhz Limit on Windows 10 Home?        When i overclock my Intel 9600K processor to 5300 Mhz, the sistem is stable , and i can run any program and benchmark programs to test it, and it works fine. But when i put to 5400 Mhz the system is booting and the windows start normaly , and even i can play some old games with CPU working on50%, but when i start a Benchmark program and my cpu go to 100% , then blue screen apear on my monitor, and there is writing something like clocking watchdog error, or something like this ,the PC Freeze and then after few seconds the system reboot. The cpu temperature is fine, does not go over 70 grade celsius, the voltage is fine 1.45v , so i know it is not a problem in the hardware, can i get some information about the windows 10 home edition, if does not support more than 5300 mhz ratio and if i need to buy a Windows 10 Professional. or if i can fix it somehow on win10 home. sorry for my english.","solutions":["There is no such set limit in any version of Windows. You are overclocking. Overclocking stresses all your computer components (memory\/timing and other motherboard components). If you cannot go any faster you have simply reached your configuration's limits. Just keeping components cool at standard voltage or under-volted, does not mean you can overclock indefinitely to whatever frequency you want to without any ill effects.The faster you go above spec, the more instable your computer will be. Minor problems may not cause your computer to fail, major problems or a ton of minor problems will.","Hi Leo, Windows does not support overclocking at all. you overclock components at your own risk.Overclocking changes not software settings but hardware parameters so in General Windows have no relation with overclocking. Only certain hardware may be overclocked more or less.So the answer is NO, Windows 10 does not have such limit."]}]}