{"windows":[{"symptom":"screensaver slide show        Screensaver choosing slide show and picking a folder with all jpg pictures, big and small.  I find that some pictures will not show, although they are no different from the others. If I save these unwilling pictures again, rename or restyle, no difference.I do not have a clue. It also does not make a difference what i pick under specialised settings. Tried it.Solution?No big issue, but still annoying. Rien","solutions":["Hi Rienvan. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Make sure Screen Saver is set up correctly as shown here: https:\/\/www.digitalcitizen.life\/how-set-customi...For problems with Screen Saver see here: https:\/\/www.hightechdad.com\/2017\/09\/15\/windows-...https:\/\/www.4winkey.com\/windows-10\/how-to-fix-s...You can also try the picture folder as a Background slideshow to see if it works better:https:\/\/www.laptopmag.com\/articles\/change-deskt...There are many reports lately that Screen Saver is not displaying all pictures. It may be a bug. If you want to report this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems.If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it. If you are an Insider I can also vote it up with my MVP badge and track the issue for you.'I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Asus crashes when plugged in fix\/easy after much trial and error? [Solution]        So I had a problem with my NEW (2019) asus vivobook crashing A LOT\/OFTEN when plugged in,I tried ALL the suggested fixes I found online and none worked for more than an hour or so,while checking settings etc.. I stumbled on this fix,go to power options -advanced settings-multimedia settings (I noticed my problem while watching videos online) -video playback quality bias,I changed the ''plugged in'' setting to match the ''battery setting'' to power saving bias and so far so good.I hope this helps someone,as the problem was driving me nuts and I was about to return laptop for a refund,actually spoke to tech support at asus and they recommended I return unit about 2 minutes before I FOUND THIS SOLLUTION.","solutions":["My apologies if I have posted in wrong place,I am new here."]},{"symptom":"Frozen BSOD        My pc had a BIOS update falure so we sent it bact to aus and got it replaced after a while im not shure how long but i was playing ark and it started lagging real bad frame rate, it had been performing worse and worse lately but not to the point it made a big difference but it had 3 major fps drops (froze) then the pc itself crashed and froze and wont go past 0% i dont want to do anything without confirmation that will mess it up.  Any help pls.","solutions":["Hi Novix You have no other choice but to press and hold the Power Btton on your PC for 5 - 10 seconds to perform a hard shut downWait a couple of seconds and then start your PC again, it should start normally . . .Then form the error code on that Blue Screen, that was caused by your Intel Wireless card device driver, should this happen again, check the support page fro your PC on the manufacturers website and from there download and install the Intel WiFi card device driver they recommend . .","Then form the error code on your blue screen”. What do you mean by that i would like to be shure on everything before i do this also i have mc afee and windows defender should i uninstall windows defender?"]},{"symptom":"Trying to send my photos and videos from my Android to my PC.        My phone is not compatible with the APP","solutions":["Hi Donna. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I will show you all possible methods to transfer photos and videos from Android to PC so you can find the one which works best for you and then fix it if necessary:https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/support.microsoft.com\/en-us\/help\/402713...https:\/\/www.wikihow.tech\/Transfer-Files-from-An...https:\/\/www.technipages.com\/transfer-files-betw...https:\/\/support.google.com\/android\/answer\/90644...https:\/\/www.howtogeek.com\/361418\/all-the-ways-w...https:\/\/www.addictivetips.com\/windows-tips\/impo...To troubleshoot problems importing pictures\/videos from Android: https:\/\/www.jihosoft.com\/android-tips\/windows-1...One solution many settle on because it has less problems than USB connections in Windows 10 is to install OneDrive to Android, set it as the default Picture save location which syncs the pictures instantly to the PC's OneDrive Pictures folder where you can edit them in or out. More here about that option: https:\/\/www.wikihow.tech\/Automatically-Back-Up-...https:\/\/www.digitalcitizen.life\/how-set-onedriv...https:\/\/www.tenforums.com\/tutorials\/24298-turn-...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Photos and MS Store Apps won't open        After installing the most recent Win 10 updates, I find that I cannot open the Photos app, nor can I get Microsoft Store to open.  When trying to open Photos I get a blue dialog box with the message \"This app can't open\".  I've tried to repair and reset this app with no improvement.  Windows won't let me uninstall.When I click on MS Store in the Start Menu I get a black dialog box that states Store has just been installed and a button to launch.  clicking the Launch button removes the dialog box but doesn't launch Store.I'm running a Surface Pro 2 with Win 10.  Any help greatly appreciated.","solutions":["Hi Gus Right click your Start Button, choose Powershell (admin) Copy and paste each of these 3 commands one at a time into Powershell and hit Enter:(let each command complete, before pasting the next one) reg delete “HKCUSoftwareMicrosoftWindows NTCurrentVersionTileDataModelMigrationTileStore” \/va \/fget-appxpackage -packageType bundle |% {add-appxpackage -register -disabledevelopmentmode ($_.installlocation + “appxmetadataappxbundlemanifest.xml”)}$bundlefamilies = (get-appxpackage -packagetype Bundle).packagefamilyname get-appxpackage -packagetype main |? {-not ($bundlefamilies -contains $_.packagefamilyname)} |% {add-appxpackage -register -disabledevelopmentmode ($_.installlocation + “appxmanifest.xml”)}","The exact same thing has happened to me and like you I have tried everything. I've repaired the app, reinstalled it, done every check known to man, and even performed a clean install of Windows 10 in an attempt to fix this but it is still broken. "]},{"symptom":"Can't connect my Beats Solo 3 to my PC..        Hi there, I've had the Beats Solo 3 for a year now. It was working with no problem, until a few days ago. I wanted to listen to some music on Spotify, I connected the Beats Solo 3 (it literally showed that it is connected)- and then when I played the music, it didn't play it through the Beats Solo 3. Instead- it played it through the PC speakers.I tried reconnecting, removing device, I tried everything but was unsuccessful. I connected the Solo 3 to my iPhone X and it worked no problem. Is there something wrong with my PC?- I updated it..         It works with every device (as long as I've tried)- except mine.The problem isn't only Spotify, when I play a game\/watch a YouTube video- it does the same!","solutions":["Hi Nikole00, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Let's try to solve the problem by applying the following steps, they are official recommendations of Microsoft.1.- Connect to Bluetooth device in Windows https:\/\/support.microsoft.com\/en-us\/help\/15290\/...2.- Fix Bluetooth problems in Windows 10 https:\/\/support.microsoft.com\/en-us\/help\/14169\/...3.- Start with a clean boot in Windows, so we will know if the problem is being generated by a third-party program or driver, you also have the option of safe mode, both are error-proof starts, run and verify the results.https:\/\/support.microsoft.com\/en-us\/help\/929135...If you see any error message or code in the process, share it with us. Let me know if you have something else that I can help you with, I'd be happy to help.Happy holidays Regards, Marc M."]},{"symptom":"Can't sign into my personal account to set a PIN on my home pc        I am trying to set a pin on my account but it's not allowing me because it thinks that my account is set up with my student email. When i set the account on this pc, i originally set it to my personal, then it was in a way, but not, fully deleted from my computer,which i think set my default account to my school account. I know that when i put my school account on my personal computer i chose the option that didn't allow the school or organization to control my pc. But now when i tried to make my PIN it only shows my school email and when i try to log into my personal email, it gives me this.How do i fix this?","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand the difficulties that you are facing while setting up a PIN for your personal PC. We appreciate your effort in providing us the detailed information on the issue along with the PC. In order to get clarity and to assist you accordingly, please reply with the answers to the questions below. What is the email account showing under “Your info” in Settings Account?Are you connected to any domain network?Do you have any other user account on the same PC? Meanwhile, we would suggest you to create a new user account and sign in with the Microsoft account (i.e. Outlook) and then try creating a PIN in that user account. Follow the steps from the articleCreate a local user or administrator account in Windows 10. We await your response. Aditya RoyMicrosoft Community – Moderator","The email that shows when i go to the 'Your Info' page is my personal outlook email. The only network im connected to is my home internet through ethernet and i enabled an admin account because i was having some problems with the account earlier but then fixed them later on.I have thought of making another account but if i were to make another account how would i delete old ones? I really don't like seeing the other accounts there if im not using them. It makes me feel like im wasting space on my drive and would rather not have any extra accounts since this is my personal computer."]},{"symptom":"Delivery Optimization and other Setting Continue to Run even when Turned Off in Settings        Hi,I have a question. I am using Win 10 1803. I went into the settings and turned of delivery optimization. Go to services, and delivery optimization is still running. Go into gpedit and create a rule to stop it from running, and there it is in services running again. I have to disable it in services everytime I boot into Windows. In addition, I have to disable Windows Update and Module Installer too (unless I need them). Yet, There is Microsoft Medic running to un disable those services, unless I stop the program when running. (At the time of login to the Windows desktop). My question is, why lie to the user and create a false sense of security or function under the Settings name, if all you are going to do is run in the background regardless of the users choice or selections? Why dupe the customer at all? Is this just another \"Red X\" example of when you rolled out Win 10 and no one wanted it, so, you duped them into thinking clicking the Red X on the box would close the box, but instead install Win 10? The same goes for the Telemetry you collect and Cortana. I have to literally break Windows 10 to almost keyboard input only, in order to get rid of Cortana and telemetry. So, basically no other Microsoft product will run on the system when it is broken like that. When someone says no, the answer and action should be no.","solutions":[]},{"symptom":"'Undoing changes made to your computer'        I have recently tried to update Windows 10 on my Lenovo laptop which has unfortunately left me with a laptop I am unable to use.I have tried all options including a reset but nothing helps.Can anyone offer any advise please?Thanks","solutions":["Hi Valerie My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Start your PC, immediately as Windows attempts to load (spinning dots), press and hold Power Button for 5 - 10 seconds to perform a Hard Shut DownDo this twice On the third start Windows should boot into the Recovery Environment and from there you can access System Repair, Safe Mode, Command Prompt . . . etc.Please try each option one at a time, then see of Windows will boot . . . Go to Troubleshoot - Advanced Option - Startup Repair See if Windows startup can repair itself Go to Troubleshoot - Advanced Option - System Restore Check to see if you have a restore point you can go back to If you do not have a Restore Point, go to Troubleshoot - Advanced Option - Startup Settings and click RestartUpon restart, press 4 to enter Safe Mode Once in Safe Mode, backup your data if you do not already have a backup Open Device Manager and check to make sure all your Drivers are up to date Reboot to see if Windows will start Normally If the above fails, go to Troubleshoot - Advanced Options - Reset this PC Choose to keep your files and apps, just your files or to keep nothing Then start the Reset Hope this helps."]},{"symptom":"Resetting Microsoft store in Apps & Features removed it completely        When trying to install apps from the Microsoft store, some of the ones I needed wouldn't install (Couldn't install app, we'll retry later) So I followedthis thread and when I reset the app, it was removed from my task bar and no longer appears when I search for it in Cortana. I've tried multiple things in the powershell but I keep getting errors. Any help is much appreciated I really don't want to have to reset my PC because of this.","solutions":["If you have tried the cmds to reinstall all Windows apps then you require a more ‘intense’ repair:I recommend an in-place upgrade repair. To repair Windows without losing any data then follow the instruction here: https:\/\/www.tenforums.com\/tutorials\/16397-repai...This will also upgrade you to the latest version of Windows - currently 1909. In a nutshell you just insert the Windows 10 media (USB\/DVD) & run setup from within Windows.Please note a repair install is not a reset, this is a last attempt at repairing a PC without a clean install. If this fails to repair the problem then usually a clean install is required.Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Fortunately for me, I restarted my PC twice and it was fixed, thanks for the response though maybe it well help someone in the future XD. Thanks again!","Great news. :) If you don’t have any further questions please feel free to mark one of the replies as the answer &\/or rate my help: 1 star means you are very unsatisfied with my help and 5 stars means you are very satisfied with the help I gave you."]},{"symptom":"HP printer Model M203dw have to wait at least 50 seconds for single page print and if multiple pages several minutes between pages.        HP say it is a Microsoft issue, any thoughts and ideas?, I have already checked for driver updates etc ","solutions":["Hello. This appears to be a wireless laser printer. How far away is the PC and printer from the router? You can also try to reset your router. Could be just a simple wifi signal issue. You could also try to print with a cable to see if it is faster. ","Thanks, i have it connected via USB cable. I have also tried the trouble shooter and got the following report:There might be problems with HP Universal Printing PCL 6 (v6.8.0). Windows will take additional steps to further troubleshoot.","Hi ilikeabeer and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.May I know if that is a network printer? You may try following these steps. Check this thread for detailed instructions. https:\/\/h30434.www3.hp.com\/t5\/LaserJet-Printing...I hope this helps. Feel free to ask back any questions and let me know how it goes. I will keep working with you until it's resolved.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thanks, i have it connected via USB cable. I have also tried the trouble shooter and got the following report:There might be problems with HP Universal Printing PCL 6 (v6.8.0). Windows will take additional steps to further troubleshoot.Hello. Did the troubleshooter fix anything? Has it always printed like this or just recently, e.g. after a Windows update? What version of Windows are you running?"]},{"symptom":"It won't let me search on the index bar.        Hello, so when I want to type anything on they index searching it won't let me every time when I want to type it won't show the letters.Is it a bug?is it repairable?OR is it something that happened while updating windows?","solutions":["Hi Veok, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Let's try to solve the problem by applying the following steps, they are official recommendations of Microsoft, and of a Windows MVP, both coincide in some indications, but also offer own steps of each article.1.- Make sure the search service is running Press the Windows key + R >> Run, now type: services.msc + Enter >> Search option >> Windows Search (Scroll down to find it) >> Select the option, and right click >> Properties >> Restart , also in >> Type of start >> Automatic.2.- Fix problems in Windows Search https:\/\/support.microsoft.com\/en-us\/help\/452014...3.- How to Fix Windows 10 Search Index https:\/\/www.groovypost.com\/howto\/fix-windows-10...Let me know if you have something else that I can help you with, I'd be happy to help.Happy holidays Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Browsers malfunction        Ever since trouble was announced in Google's functioning, my Gmail from Chrome, Microsoft Edge Dev and Opera keep on freezing and disconnecting (disconnecting from what, while my Internet connection is working relatively OK?) I have to spend hours to reed my mail by just opening and shutting my messages. Gmail freezes make other applications work badly. Am I the only one to experiment these problems? Tell me what to do, should I reset my PC? Should I reinstall Windows? Or what else?","solutions":["Hi selaflaure, I hope this helps. Feel free to ask back any questions and let me know how it goes. I will keep working with you until it's resolved.Thank you!"]},{"symptom":"Unable to disable Focus Assist        The Alarm App is a vital to me. I uses it for medication reminders. It has work flawlessly for me for a year. The Windows 10 update that introduced Focus Assist has rendered it useless. I've turned off all the options in Focus Assist. I've turned it completely off in the settings menu. I've been through forums, Google searches, I've tried everything I have found. This damn focus assist keeps turning itself back on and I'm missing my crucial alarms for when I NEED to take my pills. I toggle the feature to Off from the system tray and it stays off for about 1-2 seconds and then it switches from Off to the moon symbol. I need to destroy this feature. A DLL to delete, a service to uninstall, a registry edit.... Anything would be helpful. This focus assist garbage is breaking key essential apps that used to work fine.   ***Modified title from: How Do I utterly remove, disable, break Focus Assist?***","solutions":["Hi,Thank you for writing to Microsoft Community Forums.I do understand how frustrating it could be when the features are not working as they are supposed to work. We would like to know the troubleshooting steps that you have performed so that we can eliminate the recursion of the steps.However, as you have mentioned that Focus Assist gets re-enabled automatically after disabling it. This issue may be due to a profile corruption. Hence, in order to eliminate possibilities, I would suggest you to create a new user account, disableFocus Assist and check if the issue persists. Follow the steps from the articleCreate a local user or administrator account in Windows 10 to create a new user account.Hope it helps. Please reply with the status of the issue, we will be glad to help you further.Nikhar KhareMicrosoft Community - Moderator","Hi Nikhar, Thank you for taking the time to respond. I created a new user id. Unfortunately, it's still doing the same thing. Those are my settings. I recorded a video of the focus assist icon changing in the notifications section (https:\/\/youtu.be\/h8T6ZVE1y9o). I have tried many different settings. I have even activated focus assist to run for one minute 4:00am to 4:01am without any luck.  Thank you for your time and assistance, Best Regards,Greg ","I've been able to disable focus assist many times! Ya - every time I reboot, it works for at least 2 minutes. The problem is that Windows, after the 2-minute \"reboot honeymoon\" is over, these malfunctions recur and persist until the next reboot. I can't disable focus assist. I believe the persistent malfunction may be related to the overwhelming Notifications failures. During those failures, the hover-over text for the notifications icon tells me I have a number of new notifications; however, opening the notifications pane causes Windows to report erroneously that there are no new notifications. These persistent errors and malfunctions can be quite frustrating. That's when I get it on with Microsoft Support. My favorite is when they tell me the problem is fixed just because rebooting the PC makes the Windows malfunctions disappear for a moment or two. . . It makes my anger gauge go out the roof.","I am using a preview build of Windows 10 (currently build 18361.1) and I seem to have a similar issue (maybe a little different). I have reported it in the Windows Feedback Hub, and I uploaded a video capture on the Hub of me reproducing this error. I have not yet had any responses.In my situation, Focus Assist activates every time I click the Show Desktop button, OR if I minimize all windows so that only the desktop background is showing. Every time I do this, Focus Assist activates. I can repeat the issue by going to the notification bar and turning off Focus Assist, then clicking the Show Desktop button or opening up a window and then minimizing all windows again.I have narrowed it down to an option in Focus Assist called \"When I'm using an app in full screen mode\". If I turn this OFF, then problem no longer occurs.   However, you may not have this option as I think it is only currently in the preview version of Windows.In my situation, Windows thinks that when the desktop background is the only thing on the screen, it thinks it's in \"full screen mode\" and activates Focus Assist.For the record, I am using an nVidia RTX 2060 with the latest nVidia drivers (currently 419.35, however I have used previous drivers and had the same issue). I mention the video card and driver as this issue seems to be display\/full screen related and I thought there might be a connection.The below screenshot shows the option I'm talking about. If I disable this option, then the problem goes away, but Windows should not been treating the desktop background as a \"full screen\" app to begin with.  Something is wrong.","Same here after Windows 10 May update on 2 different machines: nVidia video card and desktop background treated like full screen app...Switching option off in Focus assist section apparently fix it.If you have this issue upgrade to Windows 1903 to enable the switch.Anyway... Microsoft you should fix it!Ambrogio - Switzerland","I HATE Microsoft's \"focus\" features. At least in Outlook when I disable it it stays off. With Focus Assist, I keep turning off in settings or via action center and it keeps turning itself back on, especially if I maximize a window\/program. I want to permanently disable or uninstall this feature. Microsoft stop trying to help me focus on what you think is important to me!","I forced the May 2019 update. So far it looks like they've fixed the problem. I have focus assist turned off and now I'm getting all my alarms. ","Pleas I need also to disable definitively this ******","The desktop turns on Focus Assist. If you show desktop or close all apps, Focus Assist turns on. Forget the troubleshooting, tried it all, it's bugged.","same here... it is off until i click to show desktop or manually minimize the last window that is still showing... of course closing all apps does it to, but it seems to be something with showing the desktop.Microsoft, you need to fix this. This is a bug that has been there for going on for a while. Give us an option to permenantly disable this or stop the service from running and starting up automatically."]},{"symptom":"stopcode no more IRP stack locations        How do I prevent this error on restart? It has happened now twice in a row. I haven't tried anything.","solutions":["PS. I am using Windows 10."]},{"symptom":"Consistent crashing while paying Overwatch        Hello,I have a problem where I get consistent bluescreen crashes while playing Overwatch. This does not happen with other games like Fallout: New Vegas or while doing anything else, the crashes are unique to Overwatch. The error code is \"IRQL_NOT_LESS_OR_EQUAL\" 90% of the time, other times it could be any one of the codes listed here. I have taken the steps in this article to run driver verifier and uploaded the .dmp files, as well as my dxdiag and msinfo here.The help is AppreciatedOyles","solutions":["Do not worry about overheating, likely laptop was underpowered. See https:\/\/support.microsoft.com\/en-us\/help\/202850... I recommend to check it in authorized service workshop."]},{"symptom":"camera not working        since downloading windows 10 my camera is not working","solutions":["Hi Darrell Have you just upgraded from a previous version of Windows to Windows 10 and now the webcam is not working?If so, did you then go to the support page for your PC on the manufacturers website, then from there download and install a full set of Windows 10 device drivers?"]},{"symptom":"Nahimic a virus?        So i recently stumbled across a .exe file named nahimic and after doing some research apparently its a sound program for MSI but the problem is that i have a Z390-e and nothing in my setup is MSI (though I used to have a MSI motherboard but upgraded a week or 2 ago) so my question is could it be a virus camouflaging itself as a safe file or is it just leftover from my motherboard?","solutions":["I personally believe it is a leftover from the previous Motherboard. If you’re concerned: Try running these programs: MBAM free: https:\/\/www.malwarebytes.com\/mwb-download\/Eset online scanner: http:\/\/www.eset.com\/us\/online-scanner\/ Adwcleaner: https:\/\/www.malwarebytes.com\/adwcleaner\/Disclaimer - This post contains reference to non-Microsoft websites and there may be ads on the page for products & services including products frequently classified as a PUP (Potentially Unwanted Product). Please thoroughly research any product \/ service advertised on the page before you decide to use them. Your discretion is very much advised."]},{"symptom":"Unable to remove bluetooth device on windows 10        HelloI am running windows 10 64bit, and have a BeeWi BH100 headphone paired to my PC.The device was unable to connect and I tried to remove it via the Bluetooth settings menu. It said removed failed at first, but later I was able to remove the device. However the device doesn´t show up as available to be paired and keeps on reappearing each time I turn Bluetooth on and off.I also tried deleting via device manager, and it again reappears on its own every time I scan for hardware changes or reset my Bluetooth adapter. I have turned my Bluetooth adapter off, and click show hidden devices and tried to delete it, but when I turn the adapter back on it reappears. I tried removing the Bluetooth Enumator, Human interface drivers and AV remote and restart my PC, but it didn´t solve the problem.I also tried setting Bluetooth services to automatic and log on to Local service, without luck.There is nothing wrong with my headphones as it connects to my phone without a problem...Is there anyway to forcefully remove the device and restart the pairing from scratch, as the conventional methods do not remove my device.","solutions":["Hello,Thank you for posting in Microsoft Community.It's unfortunate that you are facing this issue. Let me assist you to resolve the issue.We appreciate your efforts in trying to resolve the issue.You may follow the steps and check if it helps in resolving the issue, as the device might be hidden.a.       PressWindows key + X.b.      Click onDevice Manager.c.       Click onView. d.      Click onHidden Devices.e.       Search for the Bluetooth device.f.        Right click on theBluetooth device and click uninstall.Hope this helps, let us know the status of the issue. We will be glad to assist you.","HelloThanks for your reply, but as I said above I already unsucessfully tried to remove it via this method.","Hello,We appreciate your time and effort to getting back to us.  I would like to inform that even if the Bluetooth driver in uninstalled from Device Manager, it will display after the systemis restarted. It will get installed by default. I suggest you to disable the Bluetooth driver from Device Manager.Hope the information is helpful. Feel free to write to write to us for any other assistance with Windows, we’ll be glad to assist you.Thank you. ","I know this is an old thread, but I (and apparently others) am having the same problem to this day with no resolution. I tried all steps above, even searched registry keys for Bluetooth devices, but the old devices persist after a reboot, uninstallation through device manager, and through the Settings app. Not only does this issue resolve through the usual suspects, it causes crashes to my Settings app. This is obviously either a bug in Windows 10 that Microsoft is unwilling to recognize, or there is something that is not fully being explained to the general public with Windows 10 and it's Bluetooth management. This issue is now affecting me at work, costing me and my company time and money. There has to be a solution to this, but I can't find it, nor will it resolve itself, nor is there an update that resolves this. I am filing a KB immediately following publishing this post.","It seems to help to turn on airplane mode \/ turn off wifi to remove bluetooth devices... maybe it helps!","It may be an old thread but the problem hasn't been fixed. It effects more than just bluetooth headphones too. Windows 10 just gets stuck with any device you pair. It will never uninstall. Have you found a solution?","worked beautifully once I understood and followed the instructions","I had the same issue.  (1st ) Turned Airplane Mode on (2nd) Disconnect Bluetooth device from sound Settings (Also remove it from default device)(3rd) Open device manger--> View--> Show Hidden Devices. In Bluetooth devices Uninstall the Bluetooth device you want to remove.(4th) Go to Device and Printer in Control Panel and Try again removing again. The device should be removed. Let me know if this works for you.","This issue still persists here (with all the methods above tried). I believe a registry hack is required.Fix your buggy OS.","In case this ever helps windows devs to fix the issue I found a workaround in my particular case:The conflict was caused by using a different Bluetooth adapter that also had pairings.By plugging that adapter in and removing the device it managed to remove it permanently for the first adapter too (or it let the first adapter to remove its pairing too). Of course that was a horrible workaround that should never be needed since if I didn't have the second adapter available the issue would not be solved for the first adapter.PS. I had also used 'show hidden devices' so it's not that (the second adapter's pairing did not show in that)"]},{"symptom":"Minecraft Windows 10 Edition        I bought Minecraft in 2014 and I have been trying to claim my copy of Minecraft for windows 10 since 2016. Every time I try and \"claim my free copy\" on Mojang's website I get an error code:Error! It looks like we've temporarily run out of gift codes for Minecraft for Windows 10. Don't worry though, more codes should be on their way. Please check back later! It has been 4 years! Still no codes?!? I am tired of waiting and always checking for codes. When will this be fixed?","solutions":["Hi _NitroBlazer_, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.I am sorry to hear that this is causing you discomfort, the information that is handled is that it was a promotion of Mojang, which is detailed in this article >>https:\/\/help.mojang.com\/customer\/en\/portal\/arti... Additionally, you can check directly on the Xbox forum where you can find much more similar cases than in this forum >>https:\/\/beta.support.xbox.com\/contact-usIf you meet the requirements and still see the message, I suggest you contact Mojang support directly, I regret not being able to help you much moreLet me know if you have something else that I can help you with, I'd be happy to help.Happy holidays Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]}]}