{"windows":[{"symptom":"Start Menu button is very slow and Search icon isn't working        Recently i wanted to delete ''Windows.old'' and i chagned a little bit some permmisions to delete that folder, after that the Start Menu button became very slow and search box stopped working.Any help please?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please perform the following steps and check. Open Start. Search for Command Prompt, right-click the top result, and select the Run as administrator option.Type the following command to perform a quick health check and press Enter: DISM \/Online \/Cleanup-Image \/RestoreHealth","The problem fixed itself, i just installed a update, thank you anyway!","You're welcome :)"]},{"symptom":"welcome screen        how do you change the name on welcome screen","solutions":["Hello John, The tutorial below can help show you how to change the account name for what is displayed on the sign-in screen.https:\/\/www.tenforums.com\/tutorials\/89021-change-user-name-account-windows-10-a.html","Hi johnbrim1 if it is a microsoft account sign in to https:\/\/account.microsoft.com\/click on your name in the blue bar click on the edit name link under your name enter the correct name and click save. if it is a local account click start, type netplwiz click on the user and click the properties button enter the correct details and click Ok please let me know if you still have a problem"]},{"symptom":"Windows apps not working.        I updated my PC from windows 10.0 to win 1903. After updating I checked windows store was not working and I found apps like camera, photos, Calender, Mail etc were not working either. I searched on google about restoring windows store and tried few methods but they did not work.Methods : 1. Fix store using wsreset command.2. Removing all Store apps and reinstalling them. 3. Removing Msstore only and reinstall it. 4. Using troubleshooter.5. Using new user account.Please, I need help . ..........And now I cannot find windows store in Get-AppxPackage -allusers :(((((","solutions":["Hello Saugat,You can see if using the command in step 3 of option 1 in the tutorial below to reinstall and re-register all apps may help.https:\/\/www.tenforums.com\/tutorials\/3175-reinstall-re-register-apps-windows-10-a.htmlIf it doesn't, then you could try doing a repair install of Windows 10 to fix it without losing anything.https:\/\/www.tenforums.com\/tutorials\/16397-repair-install-windows-10-place-upgrade.html","Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,I would recommend reinstalling the system applications using powershell 1. Open start menu and locate powershell and run it with admin permission 2. Execute this command Get-AppXPackage -AllUsers |Where-Object {$_.InstallLocation -like \"*SystemApps*\"} | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}3. Restart the computer and check if the same behavior occurs In the event that it still occurs, I would recommend a repair install\/in-place upgrade to override and fix system components while keeping your personal files and settings and set the system to the latest version of windows 10.1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)"]},{"symptom":"ORDER HISTORY        In Order History unable to find item purchased history.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please make sure you are Signing in to the following page to check your order history.https:\/\/account.microsoft.com\/billing\/ordersAlso make sure you are Signing into the above page with the same Microsoft Account from which you have made the purchase.(Users having multiple Microsoft accounts may switch the account while making a purchase)","Please let me know if you still do not see the purchase history."]},{"symptom":"Start up issues        I have an HP Envy running Windows 10, recently on start up the operating system takes over and opens everything on my desktop, from documents and PDf's to websites.  During this event I cannot even engage task manager to shut down, have to turn off with the power button, then restart and it seems ok, but this happens whenever I turn the laptop off completely overnight.  Any suggestions.","solutions":["Hi Myrna Open the Settings App (gear icon on your Start Menu) Go to Accounts - Sign-in options At the bottom of that page in the Privacy section Turn off the setting to “Use my sign-in info to automatically finish settings up my device after an update or restart”","Ok, giving it a try.  Will post an update if problem continues.Thanks Myrna","Hi Myrna, okay, please let me know . . .","Thanks Dave, this seems to have solved my problem.  I made sure that the laptop was turned off over night and not in sleep mode.  When I turned it on this morning all was good.Thanks againMyrna","Hi Myrna, glad to Help!","Uh oh, still having the same problem.  Laptop off overnight, turned on this morning and it lets me sign in then it starts opening up all the different apps on my desk top, this time it opened some stuff it hadn't opened in the past.  However, the process was quicker this time, able to regain control of the cursor without restarting the laptop.  I found the error log, see below, but don't know what it all meansMyrnaLog Name:      SystemSource:        Microsoft-Windows-DistributedCOMDate:          1\/11\/2020 7:05:54 AMEvent ID:      10016Task Category: NoneLevel:         WarningKeywords:      ClassicUser:          WOELWATER\\mmkeiComputer:      WoelwaterDescription:The application-specific permission settings do not grant Local Activation permission for the COM Server application with CLSID {2593F8B9-4EAF-457C-B68A-50F6B8EA6B54} and APPID {15C20B67-12E7-4BB6-92BB-7AFF07997402} to the user WOELWATER\\mmkei SID (S-1-5-21-414013001-2321990725-3538539119-1001) from address LocalHost (Using LRPC) running in the application container Unavailable SID (Unavailable). This security permission can be modified using the Component Services administrative tool.Event Xml:<Event xmlns=\"http:\/\/schemas.microsoft.com\/win\/2004\/08\/events\/event\">  <System>    <Provider Name=\"Microsoft-Windows-DistributedCOM\" Guid=\"{1B562E86-B7AA-4131-BADC-B6F3A001407E}\" EventSourceName=\"DCOM\" \/>    <EventID Qualifiers=\"0\">10016<\/EventID>    <Version>0<\/Version>    <Level>3<\/Level>    <Task>0<\/Task>    <Opcode>0<\/Opcode>    <Keywords>0x8080000000000000<\/Keywords>    <TimeCreated SystemTime=\"2020-01-11T15:05:54.688884300Z\" \/>    <EventRecordID>15446<\/EventRecordID>    <Correlation ActivityID=\"{c2ea19ab-b4e0-465c-818e-46d04a184a61}\" \/>    <Execution ProcessID=\"840\" ThreadID=\"2272\" \/>    <Channel>System<\/Channel>    <Computer>Woelwater<\/Computer>    <Security UserID=\"S-1-5-21-414013001-2321990725-3538539119-1001\" \/>  <\/System>  <EventData>    <Data Name=\"param1\">application-specific<\/Data>    <Data Name=\"param2\">Local<\/Data>    <Data Name=\"param3\">Activation<\/Data>    <Data Name=\"param4\">{2593F8B9-4EAF-457C-B68A-50F6B8EA6B54}<\/Data>    <Data Name=\"param5\">{15C20B67-12E7-4BB6-92BB-7AFF07997402}<\/Data>    <Data Name=\"param6\">WOELWATER<\/Data>    <Data Name=\"param7\">mmkei<\/Data>    <Data Name=\"param8\">S-1-5-21-414013001-2321990725-3538539119-1001<\/Data>    <Data Name=\"param9\">LocalHost (Using LRPC)<\/Data>    <Data Name=\"param10\">Unavailable<\/Data>    <Data Name=\"param11\">Unavailable<\/Data>  <\/EventData><\/Event>"]},{"symptom":"What happened at 01:30 EST? It bricked my PC.        Hi there! I'm trying to find out what happened to my PC that bricked my computer. First impressions I've got is that my PC started updating at 1:30 EST, and something happened in that update that caused a Startup Repair loop. It also looks like previous to that I had a series of disk errors.Here's what happened in as much detail as I can think to provide:I woke up this morning to a blue screen. My PC shut down before I sat down, might have hit spacebar when I was taking a seat. Bear with me on the timeline, I wasn't actually able to save any of the console output so I'm reciting from memory.I turned my PC back on, and I got a Startup Repair loop. I tried the following:I restarted my PC, which returned me to Startup Repair.I tried going through Startup Repair, which it said it couldn't fix the issueI tried some of the advanced options I found while googling. One was setting the registry back to last known good using regback, but I didn't actually get to the regback command as the console output I was seeing and the expected console output did not match, so I exited without changing anything. Restarting my PC went to Startup Repair.I tried to go back to a System Restore point. The System Restore process failed with an unknown error. The error output looked something like:Unable to find System Restore file D:some\/directory\/hereMy PC crashed at this point. I had to hit the power button and it booted up, which surprisingly went straight to Windows Login.I pull up the Event Viewer, and I see that there are a large amount of events happening at 11:00PM, then my computer bricked at 1:30AM EST.I woke up at 8:30ish, then I got my PC online at 9:10. I need to know what happened here. Also how to prevent it from happening again. ","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.It looks like there may be a fault with your hard disk, without looking further into the error logs it’s difficult to tell.As a precaution I would run a scan to check for errors, please see this article for details:https:\/\/www.thewindowsclub.com\/disk-error-check...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"[DRIVER_POWER_STATE_FAILURE][Asus Vivobook S15 S510UN]Constant BSOD Windows 10[version: 1809]        Hi,I am using Asus Vivobook S15 S510UN running windows 10 1809[OS build:17763.253], I have been facing regular DRIVER_POWER_STATE_FAILURE and  VIDEO_DXGKRNL_FATAL_ERROR BSOD after windows 10 october update. I tried different fixes mentioned in forums and even tried to many nvidia drivers from one mentioned in Asus website and also from nvidia website[Using DDU]. But till now i couldn't able to get past BSOD. So i thought sharing here. Below you can find last 3 Mini dump file[and one Memory.DMP after latest crash], Msinfo32 and nirsoft driver view details. So any suggestions and solutions can be really helpful.  One drive link: https:\/\/1drv.ms\/f\/s!AvYJCaSRFtREjkZX2GvhTrPuYByt","solutions":["Hi Karthik The minidump files indicate your Nvidia graphics card device driver as the cause fo your system crashes.Some of the newer Nvidia drivers are causing issue at the moment, please try this:Open Device Manager (accessible by right clicking your Start Button) Expand the Display Adapters Section Right click your video card and choose Properties On the Driver Tab, choose 'Roll back Driver' Restart your PC once done . . . If that does not resolve the issue, go to the support page for your device on the manufacturers website, then download and install the video driver they recommend, it may well be an older version to the one you are currently running","A. Analysis Results 1. File Name: 011219-44859-01.dmp DRIVER_POWER_STATE_FAILURE (9f) IMAGE_NAME: pci.sys 2. File Name: 011319-68218-01.dmp DRIVER_POWER_STATE_FAILURE (9f) IMAGE_NAME: nvlddmkm.sys *** WARNING: Unable to verify timestamp for iaStorAC.sys 3. File Name: 011319-43812-01.dmp This is a 0 byte file, hence not useful for analysis B. Third Party Drivers 1. nvlddmkm - nVidia Driver Date - 4-Dec-2017 2. iaStorAC.sys - Intel RST Driver Driver Date - 4-Dec-2018 C. Recommendations 1. Create a system restore point so that if something wrong happens you can revert.Type restore point in Cortana Search > Create a Restore point > Check whether against your drive, Protection is ON or not. If not ON, click Configure button below to Make it ON > Now press Create to create a restore point2. Your nVidia driver is very old. The driver date is 4-Dec-17. Go to computer manufacturer's website and see if any driver is released after 15-Nov-18.3. Download latest driver Intel RST driver from and install https:\/\/downloadcenter.intel.com\/download\/27984... Download SetupRST.exe 4. Also check for Windows updates as pci.sys is also named. If there is any update from Windows side, that would also flow in.Disclaimer - This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Please see the below options:Option 1.Try Rolling back if you have an option:Go to Device Manager by typing in Devmgmt.msc in Run dialog box. Navigate to Display devices and right click ATI Radeon HD or Similar device you have. Choose Properties.On the Driver tab, hit rollback Driver to go back to the previous version. Option 2. Remove drivers completely and Install the the newest ones available from the OEM or the maker.What you need to do:1. Uninstall everything of Display driver using DDUhttp:\/\/www.guru3d.com\/files-details\/display-dri...2. Reboot.3. Make sure your device manager shows Microsoft Basic Display adapter.4. Download the driver from the OEM or the maker like AMD5.Run the Setup and you should be good to go.Disclaimer:Guru3d.com is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","Hi Karthik The minidump files indicate your Nvidia graphics card device driver as the cause fo your system crashes.Some of the newer Nvidia drivers are causing issue at the moment, please try this:Open Device Manager (accessible by right clicking your Start Button) Expand the Display Adapters Section Right click your video card and choose Properties On the Driver Tab, choose 'Roll back Driver' Restart your PC once done . . . If that does not resolve the issue, go to the support page for your device on the manufacturers website, then download and install the video driver they recommend, it may well be an older version to the one you are currently runningHi DaveM121,Thanks for the reply.Thinking the same, i even gave a shot to older driver mentioned in Asus website and tried both version V23.32.13.8816[2017\/12\/27] and V23.21.13.8873[2018\/03\/29] but no luck, BSOD was still present.Now i installed latest version from Nvidia website to try my luck.","A. Analysis Results 1. File Name: 011219-44859-01.dmp DRIVER_POWER_STATE_FAILURE (9f) IMAGE_NAME: pci.sys 2. File Name: 011319-68218-01.dmp DRIVER_POWER_STATE_FAILURE (9f) IMAGE_NAME: nvlddmkm.sys *** WARNING: Unable to verify timestamp for iaStorAC.sys 3. File Name: 011319-43812-01.dmp This is a 0 byte file, hence not useful for analysis B. Third Party Drivers 1. nvlddmkm - nVidia Driver Date - 4-Dec-2017 2. iaStorAC.sys - Intel RST Driver Driver Date - 4-Dec-2018 C. Recommendations 1. Create a system restore point so that if something wrong happens you can revert.Type restore point in Cortana Search > Create a Restore point > Check whether against your drive, Protection is ON or not. If not ON, click Configure button below to Make it ON > Now press Create to create a restore point2. Your nVidia driver is very old. The driver date is 4-Dec-17. Go to computer manufacturer's website and see if any driver is released after 15-Nov-18.3. Download latest driver Intel RST driver from and install https:\/\/downloadcenter.intel.com\/download\/27984... Download SetupRST.exe 4. Also check for Windows updates as pci.sys is also named. If there is any update from Windows side, that would also flow in.Disclaimer - This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Hi Vijay,Thanks for the report analysis.1. Done2. There is no driver release from manufacturer after 15-Nov-18. [Now i am trying latest driver from Nvidia website]3. Ok. will try and update intel RST driver.4. There are no update pending from Windows side.","OK","Had two more BSOD with latest drivers from nvidia website. Minidump attached for one crash and another minidump shows 0kb size and when it is viewed through bluescreen viewer shows as below image:Minidump: https:\/\/1drv.ms\/u\/s!AvYJCaSRFtREjkszUr9W0GNai236","UpdateAfter unable to find the solution, so I thought of giving try for downgrading.I downgraded to 1709 on 13-01-2019 after giving try to all the fixes from internet and also tried contacting Asus through online chat, but still the issue was there even after trying their troubleshoot.After downgrading to 1709 , BSOD issue stopped. I have been using the system from last 10 days with day to day work load which includes active use of Nvidia MX150 graphics and i am successfully able to close my day without any BSOD.Steps i followed to downgrade can found in below thread:https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/roll-back-from-windows-10-1803-build-to-1709-after\/b7610710-626e-424b-afe9-582f02ace418If anybody has suggestions please let me know and if i face any issues will update here.[Note: Yes. I didn't tried 1803, just for safer side. If anyone can able to run the same configured machine in 1803 without issues, please leave a feedback]","UpdateAfter unable to find the solution, so I thought of giving try for downgrading.I downgraded to 1709 on 13-01-2019 after giving try to all the fixes from internet and also tried contacting Asus through online chat, but still the issue was there even after trying their troubleshoot.After downgrading to 1709 , BSOD issue stopped. I have been using the system from last 10 days with day to day work load which includes active use of Nvidia MX150 graphics and i am successfully able to close my day without any BSOD.Steps i followed to downgrade can found in below thread:https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/roll-back-from-windows-10-1803-build-to-1709-after\/b7610710-626e-424b-afe9-582f02ace418If anybody has suggestions please let me know and if i face any issues will update here.[Note: Yes. I didn't tried 1803, just for safer side. If anyone can able to run the same configured machine in 1803 without issues, please leave a feedback]HI, I am also using Asus vivbook s15 UNR. I also faced all the above mentioned issues you mentioned in windows 1809 2018 OCTOBER update. After trying all the different drivers  I restored my previous windows(1803) and after that i never faced any BSOD issues too.By the way, Intel graphics was the culprit for BSODs and not the NVIDIA graphics. I also updated the intel graphics driver which was updated via widows update(and the same driver was made available later on asus's drivers support{January end} website but it did not help me and I downgraded to my previous windows 1803).PS: I recommend that you update your windows to 1803 as it is stable and performance is good.","UpdateAfter unable to find the solution, so I thought of giving try for downgrading.I downgraded to 1709 on 13-01-2019 after giving try to all the fixes from internet and also tried contacting Asus through online chat, but still the issue was there even after trying their troubleshoot.After downgrading to 1709 , BSOD issue stopped. I have been using the system from last 10 days with day to day work load which includes active use of Nvidia MX150 graphics and i am successfully able to close my day without any BSOD.Steps i followed to downgrade can found in below thread:https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/roll-back-from-windows-10-1803-build-to-1709-after\/b7610710-626e-424b-afe9-582f02ace418If anybody has suggestions please let me know and if i face any issues will update here.[Note: Yes. I didn't tried 1803, just for safer side. If anyone can able to run the same configured machine in 1803 without issues, please leave a feedback]HI, I am also using Asus vivbook s15 UNR. I also faced all the above mentioned issues you mentioned in windows 1809 2018 OCTOBER update. After trying all the different drivers  I restored my previous windows(1803) and after that i never faced any BSOD issues too.By the way, Intel graphics was the culprit for BSODs and not the NVIDIA graphics. I also updated the intel graphics driver which was updated via widows update(and the same driver was made available later on asus's drivers support{January end} website but it did not help me and I downgraded to my previous windows 1803).PS: I recommend that you update your windows to 1803 as it is stable and performance is good.Just yesterday laptop got updated to 1803. Don't know how exactly it happened, because WIFI was set on metered connection to avoid any updates[Still wondering how it happened]. So now i am running 1803 and it seems like no issues.But as per my observations BSOD were happening only when Nvidia graphic card was live. It looks like Windows 10 1809 October release a hit and miss for most of the users.By the way if you update your machine to any further windows 10 versions in future, please leave a feedback.And thanks for your valuable comment, because putting things on record will help one or the other."]},{"symptom":"Windows 10 upgrades dropped Windows 7 Pro to Windows 10 Home        Previously I had windows 7 Pro, when the upgrade to Windows 10 occurred the installation is for Windows 10 Home, how do I recover the key or features for Windows 10 Pro? (RDP).  In at least one case I upgrded from Windows 7 to Pro. The others were Windows 7 Pro. Thank you","solutions":["How did you perform the upgrades, Media Creation Tool or ISO image.What version do you currently have. Type winver in Search and select the top result. Post back a screenshot or quote the version and build in full.","Media Creation Tool to create the ISO image. Performed new install from ISO image. I did not save files, etc.","Did you clean install using the ISO image (boot from boot media) That is to say you select a Custom install and deleted existing partitions.Or mounted the ISO in Windows Explorer (Windows 7) and run setup. Just checking what you mean by a new install.If that is the case then you didn't technically upgrade but installed Windows 10 and unless it asks which edition you want to install then the base Home was installed.Do you have licence keys for Windows 7 Pro. If you clean installed then the existing licences would have been wiped.","Hi Alan,How long ago did you upgrade? Free upgrade was ended in 2016.Did you make in-place upgrade or new installation?"]},{"symptom":"No \"delete\" button to delete account from a device        Hello,I want to remove one of my microsoft accounts from a device, but when I go to Settings -> Accounts and select the account I want to remove there is only one button - \"Manage\" (pol. Zarządzaj). How can I remove this account from my device?","solutions":["Hi, Which window are you trying to remove the account from? Normally, you'd be able to remove it from \"Access work or school\"1. Open start menu and go to settings (gear icon) 2. Select accounts 3. Under accounts open access work or school 4. Select the account and choose to disconnect Do keep me posted."]},{"symptom":"Wndows using Windows 7 Back Up and Restore        I have an intermittent failure using W7 Backup & Restore that happened last month.BU&R runs using either the weekly schedule I use or manually.The programme runs, but near the end it stops with an error number 0x8007045D along with a message 1\/O device error. and that the programme has not completed the backup.This affects the access to the backed up data and some folders and files cannot be opened or be deleted. The drive icon disappears in File Explorer.Rebooting the PC the drive icon returns and the folders & files can be accessed and deleted.I tried another back up drive and same occurs.Checks have been made on my drives and all have passed them.Occasionally the W7 BU&R works after deleting all the files, but at next back up fault occurs again.W7 BU& R has worked without any problems since new, so how do I get it working properly again?","solutions":["This utility is not supported for creating new backups. It was included in Windows 10 for people who used it in Windows 7 and wish to restore backups thus made in Windows 10.Consequently, there's no guarantee that it will work properly to make new backups. ","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Windows 7 Back Up and Restore may not work if the Back up image is for an earlier version of Windows 10.For example if the Back up image is taken for Windows 10 version 1903 and you have upgraded the PC to version 1909 (Feature Update) the 1903 back up image may not work.Once the PC undergoes a feature update you need to manually run the Windows 7 Back Up and Restore program and create a fresh Back Up image for the latest feature update (1909)","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Windows 7 Back Up and Restore may not work if the Back up image is for an earlier version of Windows 10.For example if the Back up image is taken for Windows 10 version 1903 and you have upgraded the PC to version 1909 (Feature Update) the 1903 back up image may not work.Once the PC undergoes a feature update you need to manually run the Windows 7 Back Up and Restore program and create a fresh Back Up image for the latest feature update (1909)It has been running perfectly for years and since I upgraded to Windows 10 it has also been perfect until the last month. I have run backups for my current version of Windows 10 without any problems until last month.Since the problem started last month, I have run both manually and by weekly schedule. Sometimes it works OK, and sometimes now mostly does not, hence why I said it was intermittent.Also I would like to point out that I was not trying to use the back up or image back up;, I was only doing the backup and create image back up, so these would be available if needed.","Okay, I would suggest you to perform the following steps and check if Backup and Restore works properly.Open Start.Search for Command Prompt, right-click the top result, and select the Run as administrator option.Type the following command to perform a quick health check and press Enter: DISM \/Online \/Cleanup-Image \/RestoreHealth","Ran the command and it went OK. Took about an hour.Have now tested W7 Back & Restore manually & on the Schedule with and without Windows image and it has worked OK.After next schedule will update how it gets on next week."]},{"symptom":"Laptop restarts when set off or set to sleep after upgrade to Win 10 Pro        Hello,As I have mentioned it in the title, I've upgraded my Win 7 Ultimate to Win 10 Pro and been having issues when I want to turn off my laptop or put it to sleep, it encounters an error and reboots again. I can not roll back to Win 7 Ultimate as I have deleted Windows.old using Disc Clean Up.This morning I turned it on and I prompted me a few option and I gone with fixing Repair which did not solve my issue and there for am seeking assistance with it as I do not know how to fix it on my own.Looking forward to a replay to this message, thank you.   ","solutions":["^^Bug Code : NDIS DRIVERIf I understand it, its nvidia display driver wich I already re-instaled but it did not fix my issue at all. Starting to really not like Win 10 Pro and really miss my Win 7 Ultimate!"]},{"symptom":"Installed Windows 10 upgrade.  When pulling up excel or word document it flashes up and then disappears. Don't know what's wrong.        Installed Windows 10 upgrade.  When pulling up excel or word document it flashes up and then disappears. Don't know what's wrong.","solutions":["Hi Michael, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Likely an Office repair is required, which depends on which version of Office you have installed.Repair an Office application https:\/\/support.office.com\/en-us\/article\/repair...Let us know how that goes."]},{"symptom":"Disable group by in Downloads folder (Windows 10 1903)        Hi, since I updated to the new Windows 1903 version the files in some folders like\"Downloads\" are always grouped by the date. I was able to disable this in the File Explorer itself by choosing\"Group by = none\". But in all kind of \"Save as\" dialogs from any application the group by date still appears and in those special explorer windows there is no option to disable file grouping in them. So how can I disable this globally?","solutions":["Hi Chap Sistine, Thank you for writing to Microsoft Community Forums. The Group by option in normal folders and in Save as window are different, so if you change theGroup by to type in Downloads folder, it will not change inSave as window. Then, if you change the Group by inSave as window, it will not change in normal folders. You can refer the below example. Change the Group by as size in Downloads folder - Change theGroup by as size in Save as window.Change the Group by as type in Downloads folder - (Check)Group by as size in Save as window (it will not change until youright-click in Save as window and change it to type or anything else). Also, the Group by option is specific to folders and once you changeGroup by for a particular folder, the changes will not be applied to all the folders. You need to change the Group by for every folder by opening that particular folder > Press theAlt and V > Click on G > Select the Group by settings or click onChoose columns for more options. So, once you change the Group by in Save as window, it will remain the same regardless of whichever application you open theSave as window from."]},{"symptom":"macros windows 8.1        Is there a resident macro builder in Windows 8.1?  Our JA (J=jack, A=****) administrator will not allow any downloads, including the International English keyboard for typing accent marks on vowels (for Spanish).  I want to build simple macros like Ctrl e for é etc.Thanks.","solutions":["Macros are not part of Windows 8.1, but are part of Excel, etc. and other applications"]},{"symptom":"Cannot install Windows Update KB4530684        Hello everyone! I have been trying to install this update lately, but I always get error 0x800f0922. I have tried the steps described in Microsoft troobleshooter but nothing seems to work. I want to avoid a format of my pc, as it has been less than a month since Windows 10 clean install. Is there any other solution?","solutions":["Hi, Victoria My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to download and install it manually. If you have a third-party antivirus, disable it or uninstall it and then download the file when you are going to update offline on the internet.https:\/\/www.catalog.update.microsoft.com\/Search...","This didn't work.. I have tried almost everything I have found on the internet but nothing solves my problem. So I simply hid the update."]},{"symptom":"Issues with 5.1 Surround Sound with Windows 10        I can not get 5.1 Surround Sound to play for my computer with any audio player; i.e. DVD\/CD optical drive, Pandora, etc. but when I run an audio test using the device manager it tests perfectly.  I have heard that there might be a compatibility issue with 5.1\/7.1 Surround Sound and Windows 10.Please let me know if anybody has had this problem and what the solution is.","solutions":["Hi,Thank you for posting on Microsoft Community Forums.What is the make and model of the computer?Which audio driver are you using?In order to output 5.1 surround sound, the sound card and the audio device (Speakers) must have 5.1 support and not all sound cards are configured to output 5.1 surround signal. Also, as you have mentioned that there could be compatibility issues where the audio drivers may not be fully supported on Windows 10?If the sound card supports, and is configured to output 5.1 surround signal, please ensure that the computer is set up properly to output the signal.Open the Run dialog box by pressing theWindows key and R together.Type mmsys.cpl and hit the Enter key to open theSound control panel.Under Playback tab, right click on the audio device (speaker) and selectSet default.Click on the Configure button to launch the device (speaker) setup window.Click the dropdown list under Audio channels and select5.1 Surround and click Next.Check the boxes Center, Subwoofer andSide pair and click Next.Click Finish once the configuration completes.Sometimes, the outdated, missing or corrupted audio drivers can also cause problems in 5.1 surround output. So, I would also suggest to update the audio drivers or uninstall\/reinstall the audio driver if it the latest version of the driver is already installed. Please refer to the article below.Update drivers in Windows 10You may also try installing the High Definition Audio Device driverand see if that makes any difference. Please refer to the steps for uninstalling and reinstalling drivers under sectionFix your audio issues of the link below.Fix sound problems in Windows 10Get back to us after following the steps above and let us know how it goes.We await your response.Regards,Peer SamieMicrosoft Community-Moderator","Peer,Thanks for your timely response.  Please see below my computer information that you have requested:My computer is a home build.Sound is incorporated in the Motherboard which is a Gigabyte Z390 Gaming X LGA 1151 (300 Series) Intel Z390 HDMI SATA 6Gb\/s USB 3.1 ATX Intel Motherboard with an Intel Core i7-8700K Coffee Lake 6-Core 3.7 Ghz (4.7 Ghz Turbo) LGA 1151 (300 Series) 95W BX80684178700K Desktop Processor Intel UHD Graphics 630The audio driver is a Realtek® Semiconductor Corp., Realtek High Definition Audio driver, dated 12\/4\/19, version 6.0.1.8586. The Digital Signer is Microsoft Windows Hardware Compatibility Publisher version 10.0.17763.1 (WinBuild.160101.0800)Jack Information is:L R Green Rear Panel 3.5 mm JackRL RR Black Rear Panel 3.5 mm JackC Sub Orange Rear Panel 3.5 mm JackSL SR Gray Rear Panel 3.5 mm JackSpeaker Setup is 5.1 Surround and tests properly.The version of Windows that I am running is:      Edition: Windows 10 Home                                                                                               Version: 1809                                                                                               Installed: 5\/19\/2019                                                                                               OS build: 17763.557In addition to providing you with my computer information above I have completed the rest of your suggestions.  My system configuration is set up for 5.1 surround (and it tests properly) so this is not the issue.I updated 14 drivers using Drive Easy software. Included in this update were:-AMD High Definition Audio Device-High Definition Audio Base-Realtek Audio Effects Component-Realtek Audio Universal Service-Realtek Hardware Support-Realtek High Definition AudioAfter all this I am still only getting stereo.  Once again this leads me to believe there is a compatibility issue (Windows 10 problem) as others have suggested. If Microsoft doesn't have a fix then I have options. 1) is to buy a sound card with specific drivers or 2) revert back to Windows 8.Please advise what your thoughts are at this point.Greg","Did you ever to a solution for this? because I'm seriously fked off about not only the issue itself, but the lack of ownership and or support... does buying a discrete sound card resolve the issue (being the my on-board supports 8ch audio I doubt it)?","No, I never heard back from Microsoft Support Group but this doesn't surprise me through my past experiences over the last 35 years. I suspect that they won't support a home build computer even though all my components are qualified Microsoft parts and well known.I did buy a discrete 5.1 sound card and that didn't resolve the problem.  The only thing I have left to try is to buy some new 5.1 surround sound speakers and see if my old speakers were the problem.  Until then I will just have to settle with stereo.Thanks for asking.","i think that it works but the apps wont support, it because when i listen to music on spotify i only get stereo but in games my subwoofer works.","i think that it works but the apps wont support, it because when i listen to music on spotify i only get stereo but in games my subwoofer works.Thank you for your feedback however my subwoofer would play but I would only get sound out of 2 of my 4 speakers even though it would test properly.","Try to use a game like csgo","Is there a fix to this yet?","Used the passthrough on the sub","Thanks for this suggestion but I gave up trying since I have high end sound systems in other parts of my house and really didn't need it."]},{"symptom":"icloud not sending emails through mail app        My mail app was automatically updated on the 10th January and since then my computer won't send emails from my iCloud email. I can receive not send. I get an error message saying email has been stored in the drafts folder. I have not changed my SMTP settings they still read smtp.mail.me.com:587:0 - I think the update may have messed up my settings somehow.Any ideas? I'm running Windows 10.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please reset the Mail and Calendar app and check if you can send emails. Go to Settings (PC Settings) Click on Apps Select Apps and Features Select \"Mail and Calendar\" app Click on Advanced Options Click on Reset. Restart the PC and check.","Hi ArifAhmed2,Unfortunately a reset did not solve the problem.","No problem. In that case please remove the Account from the Mail app and Add it again.Please refer to the following page to learn how you can remove an account from the Mail App.https:\/\/support.office.com\/en-us\/article\/delete..."]},{"symptom":"WiFi wont automatically turn back on after restart\/shutdown        * Mod note: If you were brought here by a search, please read the entire thread. There was an additional possible solution posted on January 11, 2020. I have a Panasonic CF-54 running Windows 10 Pro. After a windows update earlier this year my WiFi setting went from being ON as soon as I started up my laptop to now being OFF every time. I can manually turn it on in settings with no problem but I really need my WiFi to be on as soon as Windows starts without me needing to manually turn it on for work reasons. I have tried many fixes with little or no affect.I have tried:1) deleting and reinstalling\/updating my WiFi card driver (helped for 1 day the 1st time tried then went back to problem)2) doing the fix at https:\/\/www.kapilarya.com\/fix-windows-10-stuck-in-airplane-mode (no help)3) going to my WiFi adapters makers website to update driver (no help)4) changing the Channel Width for both channels (no help)5) running the network troubleshooter (no help)6) changing the \"Turn WiFi back on\" setting to all choices: Manually, In 1 hour, In 4 Hours, In 1 day  (no help)7) checking windows\/Microsoft updates (no help)Does anyone know how to have my WiFi turn on automatically on start up again?Laptop: Panasonic CF-54OS: Windows 10 Pro, Version 1803, Build 17134.228, 64-bitWireless card: Intel(R) Duel Band Wireless-AC 8260, driver version 20.50.0.4","solutions":["Hi CC7882,Based on your description, there's a possibility that your laptop might be on power saving mode. To work around this problem, please make sure to set the following configuration underPower Management and Power Options.Device Manager - Power ManagementRight-click the Windows key and select Device Manager.Expand Network adapters.Right-click the wireless or wlan adapter, then click Properties.Click on the Power Management tab and uncheck the Allow the computer to turn off this device to save power option.Click OK.Control Panel - Power OptionsIn the Cortana search, type in Control Panel, and select it from the search result.Look for and select Power Options.Under Preferred plans, click Change plan settings on your selected power plan.Click Change advanced power settings.Expand Wireless Adapter Settings.Expand also the Power Saving Mode, then set it to Maximum Performance.Click Apply, then OK.Once done, restart your laptop and see if your Wi-Fi automatically connects as soon as the laptop is turned on.Please let me know how it goes so I can further assist you if needed.Regards.","tried both solutions independently and together, no change.","Thanks for the feedback. Since your Wi-Fi was working fine before the Windows Update, I suggest that you perform the following troubleshooting steps:Roll back the Intel(R) Dual Band Wireless-AC 8260 driverRight-click the Windows key and selectDevice Manager.Expand the Network adapters category, right-clickthe Intel(R) Dual Band Wireless-AC 8260, then clickProperties.Click the Driver tab, then selectRoll Back Driver.Follow the on-screen instruction.Uninstall the Wi-Fi adapter driver and restart your laptopRight-click the Windows key and selectDevice Manager.Expand the Network adapters category, right-clickthe Intel(R) Dual Band Wireless-AC 8260, then clickUninstall.Restart your laptop to let Windows automatically reinstall the wireless adapter driver.If you have additional questions, or if the issue persists after the troubleshooting steps above, please let me know by replying to this thread. This way, I'll get notified and respond back to you as soon as I can.Regards.","Tried rolling back driver, no change. Tried uninstalling driver (which I had done before submitting my question originally), no change. After uninstalling driver, I am now unable to roll back my driver. ","In that case, please check for any available updates. Windows 10 periodically check for updates to keep your device up-to-date with the latest features through Windows Update as it is the safest way to get driver updates. But just to make sure that no updates have been missed, please navigate to Start > Settings > Update & Security > Windows Update, then click Check for updates.If there's no update available when you check for updates through Windows Update, then I suggest that you download the latest driver from the Wi-Fi adapter manufacturer's website, then manually install it through Device Manager. In case the driver you have downloaded is an .exe or .zip file, extract it to get the appropriate file. To install the driver manually, follow these steps:Right-click the Windows key and select Device Manager.Expand the Network adapters category, right-click the Intel(R) Dual Band Wireless-AC 8260, then click Update Driver.Click the option Browse my computer for driver software, then clickBrowse.Locate the .inf file from the extracted file, click OK, then clickNext.Follow the on-screen instructions.If you continue to have this issue even after performing the above steps, please reply to this thread. This way, I'll get notified and respond back to you as soon as I can.Regards.","I have the \"Intel Driver & Support Assistant\" installed and it says my driver is up to date. Windows update also says my driver is up to date. As I said in my original post, I have already gone to Intel's website to check for updates and there are none. Before this posting I have tried:1) deleting and reinstalling\/updating my WiFi card driver (helped for 1 day the 1st time tried then went back to problem)2) doing the fix at https:\/\/www.kapilarya.com\/fix-windows-10-stuck-in-airplane-mode (no help)3) going to my WiFi adapters makers website to update driver (no help)4) changing the Channel Width for both channels (no help)5) running the network troubleshooter (no help)6) changing the \"Turn WiFi back on\" setting to all choices: Manually, In 1 hour, In 4 Hours, In 1 day  (no help)7) checking windows\/Microsoft updates (no help)","The problem still exists and everything I've tried has failed. I would appreciate any help. Thanks","I'm still having the issue, nothing has helped. Any other solutions I can try that haven't been tried yet?","Hi, I had the same problem until I just recently found the solution!!https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/windows-10-wifi-not-automatically-connecting-after\/58d3d465-ba97-4d68-b225-d9fc10d24a66Finally my wifi connects automatically after a restart again. I hope this will help you too!PS: Microsoft should really look into this issue, its been a very annoying problem.","Sadly this solution didn't work either. My WiFi still won't turn on automatically after boot up. I fully agree that Microsoft needs to look into and FIX this issue because it is a major annoyance."]},{"symptom":"How to install Windows 10 on external HDD        Hello,I have an external HDD. I want to install Windows 10 Enterprise which I have purchased recently.Please guide me, if possible step by step on how to install Windows 10 on external HDD.Thanks,Siddarth Hegde","solutions":["Hi Siddarth I am sorry, Windows 10 cannot be installed to an external drive, it can only be installed on a fixed drive for licencing purposesAnd while there used to be a version of Windows 10 that you could create with the Enterprise Edition called Windows To Go, Microsoft discontinued that approx. 1 year ago . . .","Thanks DaveM121If not Windows 10, Can I install an older version of windows, like Windows 8.1  and then upgrade it to Windows 10?Thanks,Siddarth Hegde","Hi Siddarth No, I am sorry, Windows 10 will refuse to install onto an external drive, whether as a clean install or as an upgrade from a previous version of WIndows . .","Thanks, DaveM121, for the clarification","Hi Siddarth Just a thought that cam to mind, if you can find an older ISO of Windows 10 Enterprise, up to version 1803, then that would allow you to create a Windows To Go installation on a flash drive or external HDD . . .","Thanks, Dave. I will check that option","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Windows 10 cannot be installed in an external HDD. However, you may try cloning the existing hard drive to an external hard drive and change the boot order from BIOS.Here are the steps to clone a hard drive to another external HDD. Clone hard drive using xcopy program: xcopy is a program designed to copy files and directories, including subdirectories. You can use xcopy command to copy files from one disk to another even if the two disks have different formats. Learn how to use xcopy to clone drive below:1. Click “Start” and type “cmd”. Right click on cmd and select “Run as administrator”.2. Type xcopy c:\\ f:\\ \/s \/e \/h \/i \/c \/y and press Enter to copy all the files and subdirectories (including any empty subdirectories, any system or hidden files) from drive C to drive F. You may change the drive letters according to your own needs.(Here F drive is the external HDD drive letter)"]},{"symptom":"Microsoft \"S\"        So am I to assume if I want to download a program that isn't approved by Microsoft, my laptop with Microsoft S won't allow me to do it. It seems pretty restrictive doesn't it.  And if I do away with Microsoft S, I cannot get it back.  Does discontinuing the S factor cancel my warranty with Dell or Microsoft?","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.No disabling S mode doesn’t cancel or invalid your warranty. The purpose as you say is simply to allow installation of apps which are not available in the Microsoft Store. If you ever needed to return to S mode you do have the options of reinstalling Windows 10, however I appreciate this is quite an extreme option. Regards, Ross"]}]}