{"windows":[{"symptom":"[SOLVED] Can't activate windows on second hand laptop with windows 10 education error code 0x8007232B        Hi, I recently bought a second hand laptop that was factory reset and upon starting it, it asked to activate windows. The KMS server seems to be unavailable and the error code 0x8007232B shows when I tried troubleshooting it. I read about changing it to KMS to MAK but do not fully understand it... note I do not have the product key. Please help.","solutions":["Hi Moin. I'm Greg, an installation specialist and 9 year Windows MVP, here to help you.If you're getting a KMS server notification it means it was activated with a volume license used legally only by businesses and other large organizations that activate via an on-site server.This does not mean it never had a legal retail license that consumers use, but you'd have to know the history of the PC to know for sure. One thing to check is if it has an embedded Product Key from factory preinstalled WIndows, almost always Home version. If so and you can confirm the PC only shipped with WIndows 10 it's almost a sure thing you can reinstall Home and it will self-activate. To check this install ProducKey fromhttp:\/\/www.nirsoft.net\/utils\/produkey-x64.zip and look for the OEM-BIOS key only. No other key matters for this. If it has one then google the make and model + specs to see what OS it shipped with. If 10 then there's 90% chance it's Home version key, very few Pro are embedded.Otherwise you can reinstall Home and activate it with a key you buy from Microsoft here:https:\/\/www.microsoft.com\/en-us\/p\/windows-10-ho... I would only buy from MS or a major retailer who back all sales. Any discount keys are normally bogus. You can go ahead and install and wait to buy the key, you'll just not be able to customize it's looks.See here how to do a gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Moin, you must have done a Reset which reinstalls the same version. That is not the same as a true Clean Install which wipes the hard drive of all partitions first, which is what defines a Clean Install.In order to change to Home version you'll need to do a true Clean Install following the illustrated steps in this link which include everything that works best in Windows 10:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... To create bootable Windows 10 Installation Media (on another PC if necessary) install Media Creation Tool and follow the directions in the middle of the download page here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key for your PC maker given in this chart:https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, then on second screen choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, select the Unallocated Space, click Next to let it create and format the needed partitions and start install - this makes it foolproof.You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC because you will learn everything that works best and how to apply it with your own hands.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Clean install pirated Windows 7 pro to Windows 10 home with license        Hi eveyone!When i bought my pc 2 years ago it came with pirated Windows 7 pro, wich obiously is not activated.Now I want to buy a Windows 10 home legal license... But im confused.Can I download it and make a clean install and delete all my data (Because is like formatting the computer, isn't it? I have already saved my personal files) without problem? Or if my actual Windows isnt legal can I have problems? I've been reading in a lot of forums but i still dont get a clear answer.Thanks!","solutions":["Hi Ksllut0 Yes, since you have already backed up your data, it would be best to just clean install Windows 10 Home, then you can purchase a licence for that and you will have genuine activated Windows 10 Home . ..Click this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), you can create a bootable USB flash drive (min 8GB) using that toolThen, Boot your PC from the Installation Media you just created (change Boot Order in your BIOS) to begin installing Windows 10During the installation process skip the steps which ask for a product key and select the option 'I am Reinstalling Windows 10 on this PC'Make sure to install the Windows 10 Home edition Then once Windows is installed, you can purchase a Windows 10 Home licence and enter the product key for that in Settings - Update and Security - Activation . . .","Thanks! "]},{"symptom":"DOCUMENTS AND PICTURES IN MY COMPUTER MARKED X        Documents in word and PDF as  also pictures from camera have been marked X on my computer as also on one drive. Unable to open documents or view the pictures.Am using Windows 10 .","solutions":["Hi ssingh09 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.- That red X, if it is in the bottom left corner of the Documents Icon, means OneDrive has not been successful in syncing that folder, there may be just one file in that folder which OneDrive cannot sync.Here is the full tread: https:\/\/answers.microsoft.com\/en-us\/windows\/for...- Steps to fix the red X mark on folders in Windows 10. https:\/\/windowsreport.com\/red-x-folder-windows-10\/I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"No full screen bug and static audio in Minecraft           I recently was playing Minecraft on my Xbox perfectly fine but then I decided to download Minecraft on my pc so it would run smoother, I got the game and was disappointed when I arrived at it having very static audio and I was also unable to go full screen and always had the taskbar out. I'm just hoping this gets seen by more mods because I know somebody else who has the same problem as me.  My headset worked perfectly fine on other games that I played and I already tried resetting and reinstalling Minecraft so I assumed it was a bug in the game. I tried doing shortcuts to get fullscreen working and that didn't work either. I'm just hoping this has a quick bug fix so i can go and enjoy Minecraft with my friends on my pc.","solutions":["Hi, If you're using a Nvidia GPU. Try this, Right Click the Launcher then run it with \"NVIDIA dedicated gfx\"."]},{"symptom":"Keyboard settings        I have installed an Arabic keyboard. My preferred language is English. How do I switch from English to Arabic typing on the same document?","solutions":["Hi Rorono,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Press Windows key+ Spacebar keys to quickly switch keyboard languages.https:\/\/www.tenforums.com\/tutorials\/102925-chan...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads."]},{"symptom":"Excel        Does anyone have the formula for speed Kmph, when given meters and seconds. For example, if you run 100m in 12 seconds how fast is that in Kmph. because =A2\/(D2*24) doesn't calculate it correctly, cheers in advance.","solutions":["Hi ChiefOdell The generic formula you need is this one, just substitute the cell references in to this formula . . .=(Meters\/Seconds)*3.6"]},{"symptom":"How to locate the scanned documents on Windows 10?        Hi Everyone - Possibly a very simple questions to those who know, previously on Windows 7 when I scanned a document from my wireless printer to my lap top the scan used to go into \"my documents folder\". Now in Windows 10  it seems to put the scan into any obscure folder attached to \"my document folder\" therefore hard to find after scanning. How do I determine which folder the scans go to?RgdsPaulOriginal title: Scanning Wirelessly to Lap Top","solutions":["Hi Paul,Thank you for posting in Microsoft Community, we appreciate your interest in Windows 10.I understand your concern about finding the scanned content of your computer.I suggest you to refer to the below article about Scan app and check if it helps.Scan app for Windows: FAQ(Article applies to Windows 10 as well)If you are finding difficulty in finding the scanned documents on Windows 10, refer to the article below about how to find the content on Windows 10 and check if it helps.Search for anything, anywhere Hope it helps. Reply to the post for further assistance on this issue, we will be happy to help you.","Thanks the link advised me as I was on Windows 10 and this was for Windows 8 it was the wrong advice, or similar wording.What I am needing to know what controls where incoming files get filed which I scan them to my lap top and to which folder they go into. I would like them all to go into Scanned Document folder just needing guidance how and where to I make these changes as currently the are going into a very obscure folder.ThanksPaul","Hi Paul,Thank you for responding.Do let us know the model of your scanner?Are you using any application software for scanning the documents (Third-party application\/ Scan app\/ software from the scanner manufacturer)?I would like to inform that, if you are using the Scan app to scan the documents then by default those files will be saved underMy Documents in File Explorer.If you are using any other software, there would be an option to browse the files while scanning.Check with this and update us the status of this issue, we will be happy to help you.","Thank you for your help found same under Adobe Reader DC where I can change folder scans are filed in.Once again thanks for the help.RgdsPaul","Hi Paul,Thank you for responding and updating the status of this issue.We appreciate your effort in resolving the issue.Feel free to contact us for further assistance on Windows Operating System, we will be happy to help you.","Not able to locate scanned item, how do I find?","Cannot locate my scanned documents - I have Windows 10.  How do I find my scanned documents?","How to locate the scanned documents on windows 10","I have searched for over 2 hours for a document.  Where do I start?","doesn't anyone know?"]},{"symptom":"does hp pavilion g4 support windows 10        HISIRdoes hp pavilion g4 support windows 10","solutions":["First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.https:\/\/support.hp.com\/au-en\/driversSome Manufacturers have listed Model Numberss tested with 10 at their website:HP Products Tested with Windows 10\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700Cheers."]},{"symptom":"\"Windows cannot install required files. The file may be corrupt or missing. Error code: 0x80070570.\"        My HDD was corrupted so I bought a new HDD and copied the working files to the new HDD... Before that, Windows 10 was successfully installed in my new HDD but after creating 3 partitions for my old data, I installed (clean install) the OS again but this time an error came that \"Windows cannot install required files. The file may be corrupt or missing. Error code: 0x80070570.\"I can easily install Windows 7 though my bootable media (CD) but I cannot install Windows 10 1909 EnglishInternational x64 that I had downloaded through microsoft website (ISO)... the iso is not corrupted (as I had installed it on another PC)...Tried these but not worked:1. Converting ACHI to RAID to IDE and vise versa.2. Downloading a new fresh ISO.3. Changing the USB.4. chkdsk command in Windows 75. Restarting the installation several times.6. Changing RAM slots.My new HDD is in perfect condition but still problem is there... Please tell how to fix... I cannot make a DVD bootable as the new version is of 5.05GB and there are only 4.70GB DVDs available!Please help!Specs:Running: Windows 7 Ultimate x32 (for now)RAM: 4GB DDR3 1066HzProcessor: Intel Core 2 Duo E7400 @2.80GHzGraphics: Intel G41 Express Chipset Family","solutions":["Hi Deepak. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.If you can't make a DVD, use a bootable flash drive 8gb or larger, and only the Media Creation Tool following directions in the center of the download page after clicking the + next to it:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m...I will give you all possible steps to troubleshoot installation failure which work in about 90% of cases. If not we'll go from there:Follow the illustrated Clean Install steps in this tutorial which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Make sure all other drives and peripherals are unplugged. Update the BIOS or UEFI firmware to latest, or reset to Defaults, making sure SATA controller is set to AHCI, UEFI is enabled, CSM or Legacy BIOS disabled, Windows Boot Manager set first to boot, if necessary disable Secure and Fast Boot until after install: https:\/\/www.mydigitallife.net\/comprehensive-lis... https:\/\/www.groovypost.com\/howto\/reset-pc-bios-...Create the latest new Windows 10 Installation Media by installing Media Creation Tool and following the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... If you're using another PC to do this then uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first. If you can start Windows enter UEFI firmware here:http:\/\/www.isunshare.com\/windows-password\/four-... Choose the boot device as a UEFI device if offered, on first screen press Shift + F10 to open a Command Prompt, type the following commands, each followed by Enter key:DISKPART LIST DISK SEL DIS # (replace # with the disk # of the Windows disk from list in previous command)CLEAN EXIT Close Command Box, on second screen choose Install Now, then Custom Install, then at the drive selection screen choose Unallocated Space, click Next to let it create needed partitions and start install - this makes it foolproof.Make sure to follow the setup steps in the first link tutorial to complete your install. Drivers are important enough that those steps are printed in red.You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the first linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC. If all else fails you can move the hard drive to another PC to do the install with it plugged in alone. Windows 10 is remarkably adaptive to new hardware without needing adaptive restore. If it will start it will swap out all drivers requiring several restarts. You can also try applying a same-version System Image to the intact SSD\/hard drive.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Locked out of computer        I have reset my password and went through all my security steps to get into my computer. It is still saying that i am locked out and my username and password are incorrect. How do i get into my computer?","solutions":["I have reset my password and went through all my security steps to get into my computer. It is still saying that i am locked out and my username and password are incorrect. How do i get into my computer?Are you using XP, as these are the XP operating system forums?","I have reset my password and went through all my security steps to get into my computer. It is still saying that i am locked out and my username and password are incorrect. How do i get into my computer?Are you using XP, as these are the XP operating system forums? Yes","I have reset my password and went through all my security steps to get into my computer. It is still saying that i am locked out and my username and password are incorrect. How do i get into my computer?Are you using XP, as these are the XP operating system forums? YesI was replying to Rpearcy3 If you have a question start your own thread."]},{"symptom":"please how can i install window 10 into my oc,.        Split from this thread.please how can i install window 10 into my oc,.","solutions":["Split from this thread.please how can i install window 10 into my oc,.You give no information about your present PC Brand and Model Number or what operating system it has","My Model is an Acer One laptop using Windows XP, must be 12 yrs old I think.Can Windows 10 replace XP or is it a bin job.","My Model is an Acer One laptop using Windows XP, must be 12 yrs old I think.Can Windows 10 replace XP or is it a bin job.There NEVER was a free upgrade option for upgrading, which is done by a clean install, for XP to 10.You have to BUY Windows 10.But do NOT buy 10 until you run these checks.@@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.Check for that at Acer:https:\/\/www.acer.com\/ac\/en\/AU\/content\/drivers\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:Acer - Windows 10 Creators Update@@@@@@@@@@@@@@@@@@@@@@How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700Cheers."]},{"symptom":"no camera on windows        my camera started flashing on the screen and now it saying no camera is attached ","solutions":["Hi renaesinclair, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Apply the following steps suggested by the community, these steps address the problem you are currently presenting, if the current step does not solve the problem, continue with the next one.https:\/\/support.microsoft.com\/en-us\/help\/13753\/...If none of the steps help you solve the problem, share the message as you see it.Let me know if you have something else that I can help you with, I'd be happy to help.Happy holidays Regards, Marc M.","my camera started flashing on the screen and now it saying no camera is attached artur hodo","Hi renaesinclair, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Apply the following steps suggested by the community, these steps address the problem you are currently presenting, if the current step does not solve the problem, continue with the next one.https:\/\/support.microsoft.com\/en-us\/help\/13753\/...If none of the steps help you solve the problem, share the message as you see it.Let me know if you have something else that I can help you with, I'd be happy to help.Happy holidays Regards, Marc M. I have connected a Kodak Easy Share C913, and a Samsung mobile phone to my computer and the computer is not downloading pictures from either device.  This is the first time that this has happened.  Please inform me why this is happening. ","My windows 10 is experiencing the same issue stating that no camera is attached after i open the windows camera app. I've tried the troubleshooting steps listed on the microsoft website and would rather not perform system recovery. Is there a driver I can download?"]},{"symptom":"Half of the screen turns grey        Right half of the screen turns grey sometimes. It is exact half and other half works fine. When I touch the screen the issue diseappears sometimes and screen works ok a while. Any idea how to solve it. Support by phone recommended just replug all cables and update drivers, going try that now and will see how it worked.","solutions":[]},{"symptom":"WINDOWS 7 ACTIVATION KEY FROM WINDOWS INSTALLED ON LAPTOP IF CD OF WINDOWS 7 IS LOST        I had purchased dell studio 15 in 2009 with service tag: H62J3BSBills and service tag photo attached I wanted to upgrade to windows 10 now, and its runnig  original windows 7 upgraded from windows vistaI had got cd from dell for upgrade which i misplaced and now its asking windows activation keyKindly if the key  can be provided by looking into service log of my computer if possible. DELL TELLING TO CONTACT MICROSOFT Dr Divjot Singh Lamba< Phone Number removed by VM >","solutions":["I had purchased dell studio 15 in 2009 with service tag: H62J3BSBills and service tag photo attached I wanted to upgrade to windows 10 now, and its runnig  original windows 7 upgraded from windows vistaI had got cd from dell for upgrade which i misplaced and now its asking windows activation keyKindly if the key  can be provided by looking into service log of my computer if possible. DELL TELLING TO CONTACT MICROSOFT Dr Divjot Singh LambaWe don't work for Microsoft, but there is nothing to look up anyway at Microsoft.Was the 7 upgrade from Vista part of this free upgrade offer back in 2009?How does the Windows 7 Upgrade Option work?The Windows 7 Upgrade Option is available through participating PC manufacturers on selected PCs and through Microsoft on qualifying purchases of the Windows Vista packaged product. The Windows 7 Upgrade Option applies to Windows Vista Home Premium, Business, and Ultimate editions. Your Windows 7 upgrade will be to the comparable version: so you'll get either Windows 7 Home Premium, Windows 7 Professional (the upgrade to Windows Vista Business), or Windows 7 Ultimate, respectively. The Windows 7 Upgrade Option program runs from June 26, 2009 through January 31, 2010. Some Manufacturers may choose to shorten the Upgrade Option time frame.@@@@@@@@@@@@@@@@@@@@@@@@@"]},{"symptom":"How to remove Edge and Store from being added to taskbar at startup        I'd like to not have Edge and Store automatically be added to taskbar at each startup","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please perform the following steps to Disable Startup apps: Just open Settings and then search for “Startup”, and open up the Startup Apps panel.Turn off Store and Edge from Start up apps list.","Hi, I already tried that before I created the post. However, Edge and Store are not in that list","Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Right-click on the icon you want to remove and choose \"unpin from taskbar\". Regards, David","Hi. I tried that, but they're added again when i restart my pc"]},{"symptom":"Windows 10 upgrade from Windows 7 failed. How do I re-try?        Have Windows 7 Home.  Attempt upgrade to Windows 10 failed.  Ended up with just a dark blue screen.  Had to force shut down.  It is now restored back to Windows 7.  How do I re-try?","solutions":["Make sure you have Windows 7 SP1, uninstall any antivirus program. Make sure all drivers are up to date with the latest available from the manufacturers website.What is your system spec in particular the graphics card.How did you try the upgrade previously, did you use the Media Creation Tool to upgrade or did you download the ISO image by selecting create media for another PC.","Hi RSb63 The most successful method is to use the WIndows 10 ISO to upgrade to WIndows 10, download that, then disconnect from the Internet, disable any 3rd party security software you may have running on your PC and choose not to install Updates during the upgrade . . . Click this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC)Once you have the ISO file downloaded, you can double click that in File Explorer and then run Setup.exe to begin the upgrade . . .","Have 7 sp1.Antivirus removed.Drivers up to date.ATI Radeon 3100 Graphics.Used Media Creation Tool.For now I just need to know how to start the upgrade process again.  Thanks","If you now have the ISO image file then you need to open that image, try double click to see if it opens in Windows Explorer. If it does then if a new drive letter is shown select that letter and run the setup file.If not then you will need to download a program like 7-Zip to extract the contents of the image to a new folder. You can download 7-Zip here https:\/\/www.7-zip.org\/ once you have extracted the files to a new folder then you can run the setup file from that folder.It depends how your PC opens ISO image files.I'm not sure if AMD support the Radeon 3100 graphics so that could be a problem."]},{"symptom":"KB4499175        No consigo instalar la actualización KB4499175. Siempre revierte los cambios al reiniciar, y obtengo el código de error 80004005. Me notificaron que debería desinstalar Microsoft Essentials, pero el resultado siempre es el mismo. ","solutions":["¿Alguna respuesta?"]},{"symptom":"USB mouse stops working when USB flash drive is plugged in.        Hello. I have a problem with my USB 3.0 ports on 2 of my PCs. Problem description:Windows 10 Pro, genuine, with latest updates, latest drivers (original, not driverpack or other s***) and BIOS.System is on WD NVMe SSD on one PC and Samsung sata SSD on the other one.System is clean from viruses, no third party antivirus is running on the background though (I run third party antivirus in standalone mode, real time protection is done by windows defender).Lets say we have 2 USB3.0 ports.One of them is occupied by Logitech wireless USB mouse (unifying receiver). Receiver connection is USB2.I plug USB3.0 flash drive (ADATA Pro S102, 32GB). The exact same moment when USB flash drive is plugged in, mouse stops responding.The strangest part is mouse does not disappear prom device manager, and USB flash drive is working properly. To make mouse working again I have to either unplug USB flash drive (mouse starts to work immediately), or unplug and reconnect my mouse, in this case windows plays device connected sound, and again, mouse starts working. If I plug 2 usb3 flash drives to these ports, either of them is working perfectly.This problem exists on 2 of my PCs, one is laptop, other is tower PC, checked either ports on the back and on the front (I have USB3 on the front panel). The only way everything works OK is when on my tower PC mouse is plugged to the back panel to USB2.0 port, and flash drive is plugged to USB3 port. But I can not use this on my laptop.What have I tried:Disable USB selective suspend in power options;Tried another USB3 ports;Tried another mouse USB receiver;Restart, reset windows, clean reinstall windows, reset BIOS;Uninstall manufacturer drivers and let Windows install its universal drivers {this solves the problem with mouse, but adds unacceptable for me behaviour: When copying large files (>20GB) to fast large USB3 flash drive or external SSD, after about 10GB copying stops, and task manager shows USB disk active time stuck at 100% for 2 minutes, then works again 20 seconds, then again 100% for 2 minutes, and total average write speed is falling below 10 MB\/sec. The only solution to this is installing USB drivers from Intel, and transfer speeds are back to normal for my external SSD speeds of 400-500MB\/sec.}Where should I look next?Thank you.","solutions":["Hi Forgettable, You may want to check for the latest update on your Chipset drivers as well. These might help you in regards to your current concern. Let me know if this will work. I'll be waiting for your feedback. Thanks and regards,","Hello.Chipset drivers is newest available at the moment."]},{"symptom":"Teams Video Meetings        I know how to record, stop and then down load meeting videos.Can you tell me however how a video can be paused?","solutions":["Hi Rachel Do you mean to pause the recording during the Teams Meeting or to pause the video recording when you are playing that back?If that is while playing back the video, on most video players, including the Videos and TV App, pressing the Space par will toggle playback and pause . . .Pausing a recording during a meting is currently not possible, please add a comment to this topic on UserVoice, so the Teams Developers will see that:https:\/\/microsoftteams.uservoice.com\/forums\/555...","I do not know what you are using but usually there is a II icon that is pause."]},{"symptom":"Windows 10 (Home) high system data usage        Hello i am facing problem of a lot data being used by my windows 10 system i have windows 10 home single language and its using data in background i dont know why but i tried everything set up network as metered connection and have turned have background apps and turned off automatic updates and every other thing that i got on google but still its consuming too much data even if i am not doing anything just connected and waiting on desktop its still consuming a lot of data i really need solution of this if someone can help me with this ?","solutions":["Hi Kells Open the Settings App (gear icon on your Start Menu) Go to Update and Security - Windows Update Is there any large Windows updates downloading or pending? On that same section, on the left, click Delivery Optimization Temporarily turn that off, does your network usage drop back down?"]}]}