{"windows":[{"symptom":"Upgrade or new install - windows 7 pro to windows 10 pro        I have several work computers that have windows 7 pro.  Should I do a full version install or just upgrade?  They are mainly used for our electronic medical records that we access through a vpn.   I'm trying to go the cheaper route however I don't want to regret it down the road.  Purchasing 1 full license for each of the computers would be a hefty expense.  Thoughts or suggestions?Matt","solutions":["Hi Matt, Thank you for writing to Microsoft Community Forums. I understand your query related to upgrading work PC’s to Windows 10 Pro. One of the most common methods to move from one version of Windows to another is by doing an upgrade. The major advantage of doing an upgrade is that you don't have to format your hard drive. The new operating system will simply replace your previous installation, and you'll be able to keep all of your files and programs. This process takes the least amount of time.By performing a clean install of Windows, there are many advantages. Clean install is an opportunity to start fresh from scratch without any trial software that might have come preinstalled with your system. You will also regain control over your apps, as you can now install only the applications you need. However, since you are connected to an organizational network, you can get in touch with one of a trusted Microsoft Solution provider for better assistance in upgrading from Windows 7 to Windows 10. You can find a solution provider fromhere Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Windows 10 Education won't activate        So my university offers students software upgrades for free, and one of them was the Windows 10 Education deal, and since it included Excel, I decided to get it. I had Win 10 before, and being a dummy I did not back it up. I entered in the product key and got Excel, but I got a watermark saying \"Activate Windows Go to Setting to activate Windows\" on the lower right. This drove me nuts so I tried to get rid of it, and even reset my Laptop. When I tried to activate my Windows, it said my edition was Win 10 Enterprise, and that it could not be activated because \"We can't reach a critical Windows service, Make sure you're connected to internet. Wait a few minutes, and try activating again. Error code:0x80070426\"I thought that by resetting I would be able to get my Win 10 back, but clearly I was wrong. Is there no way to activate my Windows 10 Enterprise or get my original Win 10 back? ","solutions":["Hi Lazykaiju This is a known bug in the Windows upgrade process, use this fix: Open the Settings App (Gear icon on your Starr Menu) Go to Update and Security - Activation Click Change Product key Enter this generic product key: YNMGQ-8RYV3-4PGQ3-C8XTP-7CFBY When prompted, click 'Activate Product' If the above does not work first time, temporarily disconnect from the Internet and click 'Activate' again . ..(Note the generic key will cause Enterprise to downgrade to the Education edition, then your own legal licence will activate automatically after you restart (not shut down) your PC)"]},{"symptom":"How do I set my NVIDIA graphics card as my system default?        Recently, I've been having issues with game play performance and whether or not my games are using my dedicated GPU instead of my integrated GPU. I now believe most of my games are using my integrated GPU instead of my dedicated one.I want to set my NVIDIA GPU as the system default, but I'm unsure on how to do that. The only option I see people telling is 'go through NVIDIA control panel,' but that's simply not an option as the control panel does not give me the option to set my preferred GPU. You can see that here:Is there another way to manually set my GPU as the system default? Warm regards,Manthor","solutions":["Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.Switching to the dedicated Nvidia GPU - First, open the Nvidia Control Panel. One way to do that is right-clicking on an empty space on the desktop and choosing Nvidia Control Panel from the menu.- Navigate to 3D Settings > Manage 3D Settings. - Open the tab Program Settings and choose the game from the dropdown menu. - Next, select the preferred graphics processor for this program from the second dropdown. Your Nvidia GPU should show as High performance Nvidia processor.Finally, save your changes. Your game should now run with the dedicated Nvidia GPU.","I don't have that option, as I've stated before. It just does not exist in the control panel, and I can't seem to make it exist. This advice does not work, and it's not just A Hat in Time as shown here, I'm just using that as an example. That option doesn't pop up at all, no matter what game I choose.","Ok I see. Maybe you should reinstall your video card drivers. Then in the device manager, you will see in \"video card\" (display) two cards, is it an intel HD? if yes you can right click and deactivate.","I've reinstalled my drivers many times, to no avail. I did, however, disable the Intel Graphics.","So, new issue.I don't think any games use any graphics card, now. I took A Hat in Time off high performance, I can't get past the logos without it crashing.BioShock Infinite can't get past the logo's either without stalling before crashing to desktop.I can't load any game without it having horrible horrible issues. I have to go through windows to force it to use my high end graphics card, which is not what I want to do. I want to have my GTX 1050 be the default.Any ideas?","ok, in this case, reactivate your intel hd card ok, in this case, reactivate your intel hd card, this is not the problem if it causes it again. I really don't understand why you don't have the option it's really weird, maybe you should contact nvidia directly, because their software is causing this.","I will try","And then ? any good news?"]},{"symptom":"Windows Update Error Code 0x80080005        Whenever I run windows update, I receive the following:\"There were some problems installing updates, but we'll try again later. If you keep seeing this and want to search the web or contact support for information, this may help: (0x80080005)\"I have run the windows troubleshooter for the update feature, but it has not resolved the windows update issue.I'm using win10 pro, version1703, build 15063.608How have others resolved this issue?*Modified title for accuracy**Original title: windows update error (0x80080005)*","solutions":["Try resetting the software distribution folder: Before carrying out this procedure, disconnect from the Internet. That means turning off Wi-Fi and disconnecting from a wired connection. If you don't, Windows 10 will indicate some files are in use and cannot be modified or the command will be non-responsive. Also, you should restart your computer after disconnecting from the Internet. The easiest way to do it is to enable Airplane mode from the Action Center.1. Press Windows Key + X on the keyboard and then select “Command Prompt (Admin)” from the menu.2. Stop the BITS, Cryptographic, MSI Installer and the Windows Update Services. To do this, type the following commands at a command prompt. Press the “ENTER” key after you type each command.net stop wuauserv net stop cryptSvc net stop bits net stop msiserver 3. Now rename the SoftwareDistribution and Catroot2 folder. You can do this by typing the following commands in the Command Prompt. Press the “ENTER” key after you type each command.ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old ren C:\\Windows\\System32\\catroot2 Catroot2.old 4. Now, let’s restart the BITS, Cryptographic, MSI Installer and the Windows Update Services. Typethe following commands in the Command Prompt for this. Press the ENTER key after you type each command.net start wuauserv net start cryptSvc net start bits net start msiserver 5. Type Exit in the Command Prompt to close it and then restart the computer. The update Windows Update might be trying to install is kb4041676. Its causing a lot of problems for systems with Windows 10 1703. This is Microsoft's current fix at the moment: https:\/\/support.microsoft.com\/en-us\/help\/404909...I would avoid installing it until Microsoft issues a future cumulative update that surpasses it."]},{"symptom":"Whenever I try to open windows defender\/security it needs a different application.        Whenever I try to open windows defender\/security it always pops up with the 'you need another app to open this windowsdefender' and it doesnt make much sense. Any help? (Windows 10 Home) ","solutions":["Hi Kimi. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See fixes here: https:\/\/www.kapilarya.com\/fix-youll-need-a-new-...https:\/\/thegeekpage.com\/fix-youll-need-a-new-ap...One of those should do it. If not or you have any other issues go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"I've just bought a microsoft 3050 wireless mouse middle click has a horrible delay        I've just bought a microsoft 3050 wireless mouse and keyboard, the middle click has a horrible delay that I cant fix. There seems to be a lot of complaints on the web about this, but no solutions.  Particularly I use Maya and require the middle click to respond immediately.  Otherwise this mouse has to be replaced. ","solutions":["Yeah, if it's doing the same on another PC then it's likely the mouse. After all you've tried already, I'd return it."]},{"symptom":"GTA V        If I buy GTA V from the microsoft store on pc can I then download it on my PC and then play with xbox online players?","solutions":["Hi Insignias I am sorry, this is a badly ported game, cross platform gaming is not possible on GTA V.Xbox players can only play with other Xbox players, the same for PS and PC . . ."]},{"symptom":"Issues while upgrading from Windows 7 to Windows 10        Hello All,Custom build PC. Has been running fine for years with updates on Windows 7 Pro. Looking to update to Windows 10 via in-place USB method created from mediacreationtool. 1.) Computer is fully updated with drivers from manufacturers. Gigabyte board, etc, etc. 2.) SFC \/scannow has been run, errors found and repaired. 3.) Still mechanical drive, disk was fragmented, defragmented. 4.) All updates are installed other than security essentials as I know those have to be uninstalled to update to Windows 10. 5.) setupact and setuperr.logs are available as well. 6.) 120gb used on 500gb drive. 370-380gb available. 7.) No anti-virus is installed. I have tried installing via the USB created through setup.exe and that does not work. I have unplugged all devices other than mouse and keyboard. The printer is a network attached printer, not USB. I also have copied files from USB to temporary directory and still have the same outcome. If anyone could help I would greatly appreciate it. https:\/\/scritnet579-my.sharepoint.com\/:u:\/g\/personal\/sean_stanhibel_scr-it_net\/ES-wi89k9CFGrupQhER8sAsBEhNOroZCD71GD7mQ5dPGbg?e=sr8okQ***Original title: Windows 7 to Windows 10 In-Place upgrade***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query related to upgrading to Windows 10, and I certainly appreciate your efforts in trying to resolve the issue by following certain troubleshooting steps. For further clarity on the issue, please respond to the question below: Do you receive any error message\/code when trying to upgrade? Meanwhile, one of the things that you can try is performing Hardware Clean Boot and Clean Boot on the PC and see if the installation goes through. Follow the steps mentioned below to perform hardware clean boot. Press Windows key + R. This will openRun. Alternatively, you can go to Start and search for Run.In Run dialog box, type devmgmt.msc and hitEnter.Now expand the Display adapters, Printers, Sound, video and game controllers.Now right click on the drivers inside the section and click onDisable.If asked for restart click on restart later and disable all the drivers.Close the device manager window. Once you finish performing Hardware Clean Boot, perform Clean Boot on the PC and proceed with the installation. Refer the articleHow to perform a clean boot in WindowsIn addition, you may want to refer the article Get help with Windows 10 upgrade and installation errors Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Issues when trying to upgrade to Windows 10        When i started updating it goes well until it came to loading updates. It goes to 46% and it stuck. Help pls ASAP.***Original title: Upgrade win7 to win10 stuck at loading updates at 46%***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues while upgrading to Windows 10. For further clarity on the issue, please respond to the questions below: How are you trying to perform the upgrade?What is the make and model of the PC?Do you receive any error message\/code when trying to upgrade? Meanwhile, one of the things that you can try is performing Hardware Clean Boot and Clean Boot on the PC and see if the installation goes through. Follow the steps mentioned below to perform hardware clean boot. Press Windows key + R. This will openRun. Alternatively, you can go to Start and search for Run.In Run dialog box, type devmgmt.msc and hitEnter.Now expand the Display adapters, Printers, Sound, video and game controllers.Now right click on the drivers inside the section and click onDisable.If asked for restart click on restart later and disable all the drivers.Close the device manager window. Once you finish performing Hardware Clean Boot, perform Clean Boot on the PC and proceed with the installation. Refer the articleHow to perform a clean boot in WindowsIn addition, you may want to refer the article Get help with Windows 10 upgrade and installation errors Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"problems watching dplay        I am trying to watch programs on dplay but I keep getting loss of sound AND even worse the programs either wont start or when the ad breaks come on the program doesn't come back on afterwards? Im on a windows 10 Vivo how can I overcome this problem?","solutions":["You need to go to the mobile devices forum.","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please try another web browser to access https:\/\/www.dplay.com Check if this is happening with other browsers or not."]},{"symptom":"new computer constantly crashing to BSOD        My brand new custom pc has been crashing into BSOD since something like 3 days ago and some of the errors it presented were: SYSTEM_THREAD_EXCEPTION_NOT_HANDLED, SYSTEM_SERVICE_EXCEPTION, MEMORY_MANAGEMENT and, after performing driver verifier, DRIVER_VERIFIED_DETECTED_VIOLATION (AMDRyzenMasterDriver.sys). I've tried reinstalling windows twice, tried reinstalling graphics card drivers, processor drivers, everything. At first I thought the problem was faulty RAM, due to the memory_management BSOD error, but after checking, it seems fine. There are no signs of physical damage on the components and I'm out of ideas to what it could be that's causing the crashing. I'll link minidumps I got after running driver verifier, please help.one drive minidumps link:https:\/\/1drv.ms\/u\/s!AvTl-w_w9UNunDyq849ZYzjoGUBO?e=psnHGd","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. I am aware that you have already tried to reset the PC. However, I am not sure if the installation media had any issue or not.I suggest you to kindly use the following tool (Media Creation Tool) to prepare the installation Flash Drive and perform a clean installation.Here is the link: https:\/\/www.microsoft.com\/en-in\/software-downlo...","I BINGed AMDRyzenMasterDriver.sys & found this thread at the AMD support group...https:\/\/community.amd.com\/thread\/215682AMD Ryzen Master Blue ScreenDid you clean install or repair-install? It was a clean install that cured Damiss88. It may be worthwhile to post your problem there as well, especially if those minidumps all implicate AMD drivers.One other thing I found is you should not use that tool to overclock the CPU...https:\/\/www.amd.com\/en\/support\/kb\/faq\/gpu-775AMD Ryzen Master Utility FAQs","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. I am aware that you have already tried to reset the PC. However, I am not sure if the installation media had any issue or not.I suggest you to kindly use the following tool (Media Creation Tool) to prepare the installation Flash Drive and perform a clean installation.Here is the link: https:\/\/www.microsoft.com\/en-in\/software-downlo...So, I've tried to do a clean installation of windows and I had some problems while installing, like error 0x000005 and 0x807025d, but the installation started to seem fine after i changed from windows 10 pro to windows 10 home. I continued with the installation and it worked, so I went to download the drivers and when I'm about to download my motherboard's audio driver from Realtek, the pc went into BSOD once more, the error presented was MEMORY_MANAGEMENT. Now that I've downloaded all the drivers and stuff, it came into a BSOD with MEMORY_MANAGEMENT error and barely after the restart again with the error: SYSTEM THREAD EXCEPTION NOT HANDLED and what failed was dxgmms2.sys. I have a restauration point of before restarting my pc after the windows 10 home installation.","Okay, so after the first BSOD i thought that was normal and it will be fine, so i started to download my things, i've downloaded steam and it works fine since that came into a BSOD and then i restart the PC and when steam started BSOD with the error: KERNEL DATA INPAGE ERROR. now i started it and works normally, all my pc parts are under warranty but i dont know what piece have the problem, i dont even know if this is a hardware problem...","so im here again... now the PC is crashing everytime, with the MEMORY_MANAGEMENT error.i thought that was a RAM problem, but then I took it out and put it again and the error have continued.","(1) It's starting to sound eerily similar to the problems PRO had. Unless you've also got a digital license for Home, I would revert to Pro. That means you must redo the clean install of Pro. Otherwise, you will need to purchase a license for Home before long. What is it saying at \"START, Settings, Update & Security, Activation\"?(2) But first, here is the Ryzen Master Utility...https:\/\/www.amd.com\/en\/technologies\/ryzen-masterAMD Ryzen Master Utility for Overclocking ControlCheck that the computer is not being overclocked. Also, I think I would want all the other settings to be at factory default state. See whether there is a button in there to set it all to defaults. I haven't yet found a tutorial on how to use that utility.","I suggest you to kindly download the chipset driver from the manufacturer's website and install it.Then observe the PC.","(1) Is it under warranty? Why haven't you taken it back then?(2) Which AMD Ryzen is it precisely? What site are you getting drivers from?(3) Can you get into BIOS Setup & report what is seen in there?(4) What is the version of the BIOS?","(1) Is it under warranty? Why haven't you taken it back then?(2) Which AMD Ryzen is it precisely? What site are you getting drivers from?(3) Can you get into BIOS Setup & report what is seen in there?(4) What is the version of the BIOS?1- Yes it is, but I bought all the pieces individually so I need to know what piece have the problem to then take it back.2- AMD Ryzen 7 2700x with the Wraith Prism Cooler - (https:\/\/www.amd.com\/pt\/products\/cpu\/amd-ryzen-7-2700x).3- Yes I can get into BIOS Setup but I need to know what you want to see in there, I took a picture of the main page idk if this is what you want but: https:\/\/prnt.sc\/qhx2eh4- I think it is A320M-HD P5.40Bonus: Attempting to answer other replies, I always downloaded the recommended driver for my pieces on the AMD site, the one they recommend for my CPU is Ryzen Master, every configuration is in the default of the driver as you can see on the print (https:\/\/prnt.sc\/qhx95s) anyway, in the same driver I see something that in other AMD threads about seems normal, that is my EDC is always being like 90 - 99%...and idk if is this normal but when I move the cursor or open a lot of stuff the percentage increases and when it is constantly around 99% the PC turn to BSODThe CPU Voltage always be approximate to 1.3 or 1.4.I`ve never made OC on my pieces and don`t want to do.Print of Radeon Software that I use to my GPU - RX 580 (https:\/\/prnt.sc\/qhxc1d)","Just for updating you, so I've been noticing that when the EDC reaches 99% my CPU Voltage decreases of 1.4 to 0.95 idk if it is a problem but I will write about anyway.So, recently the PC is crashing frequently and the errors presented this time was different, we have:CACHE MANAGER;PAGE FAULT IN NONPAGED AREA;Also the most frequently:MEMORY MANAGMENT."]},{"symptom":"Unknown USB Device (Device Descriptor Request Failed)        Product: HP Elitebook 8760wOperating System: Microsoft Windows 10 (64-bit) Fresh install of Windows 10 Pro (partly as an attempt to rule out whatever issues that would rule out). In Device Menu, \"Universal Serial Bus controllers\", there is \"Unknown USB Device (Device Descriptor Request Failed)\"I know that it's the webcam, because when I disable the webcam in the BIOS, this listing no longer shows up when the webcam is enabled in the BOIS, but I disconnect the cable from the webcam module after removing the bezel, the listing disappears, and then reappears when I reconnect the cable I have tried to update the driver by letting Windows scan my hard drive and Windows Update without success. I have downloaded the most recent drivers (for Windows 8.1 64-bit) from the HP website here:https:\/\/ftp.hp.com\/pub\/softpaq\/sp63501-64000\/sp63913.exeRunning the downloaded file creates a folder (C:\\SwSetup\\SP63913) with a bunch of driver files in subfolders and a few executables that don't do anything noticeable, like install the webcam drivers.I've tried updating the drivers manually in Device Manager (Have Disk...) by selecting any and all .inf files in the subfolders without success. I've been searching online for general solutions to the \"Device Descriptor Request Failed\" issue and have tried a number of suggestions without success: Disabling \"Fast Startup\" in Power Options (followed by a hard restart...  re-enabled because it didn't solve the issue)Disabling USB Selective Sleep Settings in advanced Power Options (also followed by a hard restart...  also re-enabled because it didn't solve the issue)Reinstalling \"Generic USB Hub\" drivers in Device Manager Installing latest Intel Management Engine Interface driver from HP website (https:\/\/ftp.hp.com\/pub\/softpaq\/sp64001-64500\/sp64098.exe)This issue also happens with the Validity Fingerprint Sensor, although I have never used it, have it disabled in the BIOS, and wouldn't lose any sleep if it ever worked.  I only mention it because it's possible that the root cause of both devices not working is the same. Advance thanks for any assistance on this issue.","solutions":["Hi ZZ. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See two methods to install HP drivers from SP folder: https:\/\/support.hp.com\/us-en\/document\/c02860501https:\/\/support.hp.com\/us-en\/document\/c05531231Compare the install you did with this gold standard Clean Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... The reason I ask you to do this is because no one of millions who have followed the install in that link has ever come back to report problems that I have seen. It is also a great learning experience that will make you permanently the master of your PC because you will learn what works best and have applied it with your own hands. Keep me posted on your progress as I will be here to help until the case is resolved.","Hi Greg...  Thanks for responding to my post...At my earliest convenience i will take a look at your suggestions...Thanks so much...","Happy to help, ZZ. Keep me posted on your progress as I will be here to help until the case is resolved.","Greg,I'm not in front of the computer at the moment but I did take a brief glance at the links in your response and i don't see anything significantly different from what I've already done as far as drivers are concerned.  The first thing i always do after initial install is connect to the Internet and run Windows Update until there are no more updates.  My apologies, i didn't mention that in my original post.  Also, i should have mentioned that i had disabled most of the other built-in devices and ports in the BIOS so that i could focus on this one issue.  Literally the only things active are the WLAN adapter and the webcam.  The actual external USB ports aren't even active, just the bus that handles those built-in devices that use the protocol. It was my plan to identify a solution and then apply that solution to a clean install with all the BIOS features enabled."]},{"symptom":"What to do Now with my Windos 7   ????        Windows 7 will reach the end of support on January 14, 2020, my computer will still function but Microsoft will no longer provide the following:Technical support for any issuesSoftware updatesSecurity updates or fixes\"While you could continue to use your PC running Windows 7, without continued software and security updates, it will be at greater risk for viruses and malware. Going forward, the best way for you to stay secure is on Windows 10.And the best way to experience Windows 10 is on a new PC. While it is possible to install Windows 10 on your older device,it is not recommended\"So i can't afford to buy a new computer! I have an old computer and it is not recommended to download widows 10.So if i should not continue to use widows 7, what other options are there for me to use?Not recommended to download Windows 10","solutions":["Your choice of course, but I would ignore Microsoft's recommendation and stay with Windows 7. Just be sure to use third-party security security sofftare that *is* still upgraded as necessary.","With end of support Microsoft is not telling you that your operating systems won't work.What they are saying is that after a certain date they will no longer support them.Whether they still work or not with particular programs is up to the particular program manufacturers.Example: Google Chrome is no longer supported for security updates in XP or Vista by Google and Mozilla Firefox is following the same path.What this basically means with Microsoft no longer supporting an operating system is that even though hackers may find \"holes\" and vulnerabilities to be able to access the operating systems and cause security problems, Microsoft will no longer be monitoring or rectifying those problems by way of Security Updates each month.You are on your own in regards to maintaining the Security of your operating systems.What does it mean if Windows isn't supported?____________________________________________________This will show you when support (Mainstream and Extended Support) for the various operating systems ends.Windows lifecycle fact sheet - Windows Help - Microsoft SupportAnd these FAQs show you how Microsoft arrived at the Support Lifecycle Policy:Microsoft Lifecycle Policy FAQhttps:\/\/support.microsoft.com\/en-au\/help\/17140\/lifecycle-faq-general-policy-questions@@@@@@@@@@@@@@@@@@@@@@@"]},{"symptom":"\"The configuration registry database is corrupt\" for my laptop's SD card reader        I got this laptop a while back, but I never used the SD card reader on it until now. Whenever I try to insert an SD card in, nothing happens. I went to Device Manager to see if it was malfunctioning, and sure enough, in \"Other Devices\", there it was. It gave me Code 28 (The drivers for this device are not installed. There are no compatible drivers for this device.). When I tried to find the correct drivers for it and update it though, it stated \"The configuration registry database is corrupt.\" I'm not sure where to go from here, please help. The device name is \"Genesys Logic USB3.0 Card Reader\".","solutions":["Do you have an USB3.0 port?","Do you have an USB3.0 port?Yes. I'm not sure if that's the issue though, it's the SD card reader.","The type says it is a USB3.0 Card reader so I would say that it would need a 3.0 port.","The type says it is a USB3.0 Card reader so I would say that it would need a 3.0 port.I'm not quite sure what you're saying. The card reader is built into the laptop, as well as the USB 3.0 ports. That's just the name of the card reader that is built into the laptop. All the USB 3.0 ports work fine, it's only the card reader that is corrupted.","Is there any way to fix this issue? I was having sound issues earlier, and for some reason after restarting my speaker drivers were completely deleted, and I can't update the drivers anymore because the same configuration registry database is corrupt. "]},{"symptom":"Upgrade from Windows 7 home to Windows  10 home (free offer from MS) yo a purchased product key to upgrade to Windows Pro        I was originally running windows 7 home. When MS offered upgrading to Windows 10 I jumped on  the offer. Now I want to upgrade to Windows 10 Pro with a purchased product key, but each time I try it fails  with 0xc004f050 (The product key you entered didn't work)This is my second product key that did not work. Can I upgrade to Windows 10 Pro by using the path above?I searched windows forums and tried googling this issues but I cannot find anything which even comes close.Thanks in advanceRick","solutions":["Hi Rick Yes, the method you mentioned above is correct and should work . . . Where are you obtaining those Windows 10 Pro licence keys, is that from Microsoft or some 3rd party retailer?Are you getting Windows 10 Pro upgrade licence keys or the full Windows 10 Pro licence keys?","The keys were purchased from Newegg.com which I guess is a third-party and the key that I requested was a Windows pro upgrade","Hi Rick It is hard to verify if the licence key is genuine, your best option would be to contact Microsoft Support and ask them to either verify that licence key, or upgrade your system with that key:Choose a local Phone Number: https:\/\/support.microsoft.com\/en-us\/help\/13948\/...","I have tried contacting Microsoft support but there’s no way for me at least that I can see is how to do that if you have a link or something I’d really appreciate it","Hi thanks much for your reply. I did contact MS. Apparently the steps to accomplish what I was trying to do isCall MS Customer  SupportThey gave me a generic product  ID to use. But before you use this ID you have to disconnect your PC from the webOnce off the web.. I used the Product ID which they supplied.Reboot the PCWhile coming up plug your PC back onto the WEBAfter rebooting and after you login to your PC, Winnows will take you to the activate screen. Insert the new Product ID and choose activate.I did find something like this on the web while looking for a solution.. In fact the generic ID is in the solution, the secret they neglected to add was to disconnect your PC from the web.The rep explained that when trying to update the current version to the new version the 2 product keys do not match.. That is why I got the error \"wrong product ID\"Thanks everyone who replied to my post","Hi Rick, I am so glad this is resolved"]},{"symptom":"Windows install problem\/syestem file delete        Mistakenly i deleted system Reserve partition when i want to install new windows. And formated windows install disk.   Now i want to try install windows 10. But again and again i failed. How can i succeeded?  Please help anyone.Thanks  ","solutions":["Hi S_Imran When you say you are re-installing Windows 10, are you booting your system from a Windows 10 USB bootable drive or are you just trying to use the built in Reset option?if you are clean installing Windows 10 using a bootable Windows 10 flash drive, then there will be no issue caused by removing the System Reserved Partition, because it is best when doing a clean install to remove all partitions from the target drive . . .Please explain the process you are using and the exact error(s) you are encountering . . .","Is this a real question?","I use bootable pendrive to install windows 10. I share jpg image file what exactly problem facing to install. When i select partition 2 and click next. In bottom line show a alert. Alert: We couldn't create a new partition or locate an existing one. For more information, see setup log files. ","Hi S_Imran Sorry, I was offline . . . This is no problem, go to hat window again, delete Drive 0 Partition 1, Partition 2 and Partition 3Those will merge into unallocated space Select that unallocated space and click \/Next' to begin the Windows installation . . ."]},{"symptom":"DRIVERS        how many drivers do I need in windows 10. and if I need one , which one is best? I have IP Vanish, for a vpn, if that means anthing.i just look up information to fix things and do a little streaming on my tv. Windows 10 is on my home comp. do a little u-tube and facebook, I'M 66 AND JUST RETIRED SO NOT THE GREATEST WITH COMPUTERS. All these drivers keep poping up, and they try to install. its a pain..,    THANK YOU   \"TONYPEPPERONI\"","solutions":["Hey Tony. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.Let me know if there's anything else. I'm here to help.","What's all this nonsense about being 66 and not the greatest with computers? If you've made it to 66, what you know that a younger person doesn't know could fill an encyclopedia. Could a millennial troubleshoot a carburetor or replace a part in a dishwasher? Oh no, there's no 'app' for that.A driver is the software that a hardware device like a graphics card or a network adapter needs to work properly. Your computer has dozens of hardware devices, so it has dozens of drivers, but very few of those drivers ever need to be updated.Younger people are frequently under the impression that you need to keep all your drivers up to date. But the truth is: drivers are a good example of 'if it ain't broke, don't fix it.' Drivers rarely need to be updated, and when they do, Windows 10 takes care of that for you, because you have better things to do with your retirement.Will there ever come a time when you need to update a driver on your own? Yes, that's certainly possible. But is it likely? Not enough to worry about it. So go and enjoy your retirement - you've earned it."]},{"symptom":"Xbox one controller not connecting to PC or showing up in device manager        Hello, I recently got a new PC and am trying to connect my new xbox one controller to play game on it. My computer doesn't have bluetooth support so i'm trying to use a micro-usb cable to connect it. When i plug the controller in it vibrates but it doesn't show up in device manager and won't work on my computer.  Any help would be appreciated. ","solutions":["Hi FS. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.You can add an inexpensive Bluetooth USB nano adapter like this one: https:\/\/www.amazon.com\/ZEXMTE-Bluetooth-Receive...Did you choose View tab in Device Manager and Show Hidden Devices, check all categories? Are their devices in error with a ! mark?Here are all the current fixes for Xbox One Controller not connecting: https:\/\/www.makeuseof.com\/tag\/how-to-fix-xbox-o...https:\/\/gaming.stackexchange.com\/questions\/2877...https:\/\/www.lifewire.com\/xbox-one-controller-tr...https:\/\/support.xbox.com\/en-US\/xbox-one\/control...https:\/\/www.ifixit.com\/Wiki\/Xbox_One_Wireless_C...You can also contact Xbox Support here. You have a one year warranty including support and replacement for a new controller:https:\/\/support.xbox.com\/en-US\/contact-usI hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hey there, fauxset420Welcome to the Microsoft Community forums. What controller have you got?Regards, ","Hey, I just got an Xbox One S controller as a gift. ","Hey Greg, I did check all categories in the device manager and clicked show hidden devices, The controller doesn't show up in there. I'm thinking it might be an issue with the cable i'm using to connect the controller so i ordered an xbox usb\/microusb cable to use and see if it fixes the issue. It's arriving at 8pm tomorrow so ill keep you posted and see if it fixes it. Thank you."]},{"symptom":"Windows 10 “Locking” auto shutdown after 1 min        Hi community and microsoft,i have a big problem. I turn on my computer,i login and after 1-2 min,my computer auto shutdown,but before that i get bluescreen “LOCKING” message.I turn on and after 1 min is happend the same thing.I try to create a short task for shutdown and to write shutdown -a in a command prompt.Nothing change.Please i dont know what to do.","solutions":["Hi Alex. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Guardian Moderator here to help you.1) Test for overheating by installing CoreTemp to monitor temps from the System Tray. Set overheat protection to Sleep or Hibernate if it reaches Core Max temp which it will calculate for your processor. See here:https:\/\/www.thewindowsclub.com\/core-temp-monito...If it's overheating then clean out the dust first: http:\/\/lifehacker.com\/#%21153409\/spring-cleanin...http:\/\/www.youtube.com\/watch?v=8QZ8j46GB2w&...http:\/\/www.youtube.com\/watch?v=T0BQ6YUFaoYhttp:\/\/www.instructables.com\/id\/Cleaning-Your-L...If that's not enough then investigate replacing the thermal heat paste on CPU, or a laptop cooling pad.2) See fixes for random shutdown here: https:\/\/tecoreviews.com\/how-to\/computer-randoml...3) Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.4) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 5) If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1903 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to rate my post, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Did you manage to fix this?Have same problem"]},{"symptom":"Windows 10 Indexing Service        After a Windows update the windows indexing service malfunctions, it does not show files when searching by file name or word in the document content. I tried everything but the problem remains. Any suggestions?George Papadimitriou","solutions":["Hey there George, Evan here an Independent Adviser hopefully I can assist you today!! Sounds really frustrating. Please type Indexing Options into your search bar and this will pop up a dialogue window. Then click \"troubleshoot indexing\".Keep hitting Next until it offers you some solutions that may help. If it doesn't, repeat my first step and go to advanced options. You will add a \"filetype extension\" to the Indexing options..........this *should* force Indexing to rebuild its search parameters and therefore include your files again.I have a hunch that the update jostled some things around and now your Indexing needs some TLC.","Hi Evan, thanks for the advice, I tried it but the indexing service is still as good as dead. File content indexing has passed away for good and file name indexing occasionally works if you access the searching tool from particulars paths which may change according to their own free will. I looked for third-party indexing tools but I think that they are expensive (yearly subscriptions) for what they offer as the Windows Indexing Tool when it was still working, covered my needs and it was free.Regards,George","This may work... https:\/\/www.voidtools.com\/It's a free indexer but it might not be everything you're looking for. Happy New Year George!","Thanks a lot Evan, I will try it. Happy New Year to you too!!!George"]}]}