{"windows":[{"symptom":"Seagate backup device not detcted        Dear community,Need to install SP2 using the standalone installation package in my Windows 7 64bit version PC but the Seagate device is not detected .Need help with possible answers.Thanks,Bud","solutions":["There is no official Windows 7 SP2.And you need SP1 to be installed anyway for further updates.Here is the information about SP1:Install Windows 7 Service Pack 1 (SP1)To check if Windows 7 SP1 is already installed on your PC, select the Start button, right-clickComputer, and then select Properties.If Service Pack 1 is listed under Windows edition, SP1 is already installed on your PC.@@@@@@@@@@@@@@@@@@@@@@@@@@Installing Windows 7 SP1 using Windows Update (recommended) If your PC is set to automatically install updates, you’ll be prompted by Windows Update to install SP1. Follow the instructions to install the update.Or:And the download link from the above link:Go to the Windows 7 Service Pack 1 download page on the Microsoft website.@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Then:Convenience rollup update for Windows 7 SP1 and Windows Server ...This article describes a convenience rollup for Windows 7 Service Pack 1 (SP1)-based and Windows Server 2008 R2 SP1-based computers. This rollup package includes most updates that were released after the release of SP1 for Windows 7 and Windows Server 2008 R2, through April 2016. This convenience rollup is intended to make it easy to integrate fixes that were released after SP1 for Windows 7 and Windows Server 2008 R2. We recommend that Enterprises include this rollup package in the image creation process to make it easier to quickly set up a computer.There are concise download details about it from aakkam22  in this link:https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_7-update\/how-to-obtain-and-install-windows-7-sp2\/c2c7009f-3a10-4199-9c89-48e1e883051eFurther reading about the above \"convenience update\", dubbed Service Pack 2:https:\/\/www.howtogeek.com\/255435\/how-to-update-windows-7-all-at-once-with-microsofts-convenience-rollup\/Cheers."]},{"symptom":"installation of windows 10 november update 1909        I currently have windows 10 1809. Today i saw an option to update to Windows 10 1909 . I want to know if there will be any sort of problem if I directly update my system to Windows 10 1909?I also want to know that do problems in Windows 10 1903 still exist like high CPU usage , wifi error etc. because with every update fix microsoft was releasing regarding \"May Update 1903\" more new issues were being reported by user. Will it be safe to install windows 10 1903?","solutions":["Hello SK123, i'm Timon and i'm glad to help you. There should not be a problem to update to 1909 directly. That's said, updates are an extremely complex mechanism and nobody can guarantee you there will be no problem this time.As always, if you are not confident, you can delay this update, and wait for the potential issues to be solved.","I want to know if there will be any sort of problem if I directly update my system to Windows 10 1909?That's impossible to know now ... which is why the smart way to install a new version of Windows is - and always has been - to wait at least 3 months. Let corporate testers and professional reviewers uncover the early problems that are inevitable in any major update to an operating system, and give Microsoft an opportunity to fix them.If you want to keep up with the latest bugs, and Microsoft's progress towards fixing them, you need only consult the web page on Microsoft's own website where they provide all that information. For v.1909 you can find that here:Windows 10, version 1909 and Windows Server, version 1909After approximately 3 months, or even longer, consult that web page and see if there are any unresolved bugs that could affect your particular configuration. If there are none, then you can feel safe in allowing Microsoft Update to install the update for you.Only Directly's 'independent advisors' will tell you to install a new feature update as soon as possible, and to install directly from Microsoft's website instead of waiting for Microsoft Update, because they're competing for cash awards from Directly.I also want to know that do problems in Windows 10 1903 still exist like high CPU usage , wifi error etc.The number 1 rule for updating a computer is:  Don't update over a problem. Solve your problems first, then update. The only reason to update over a problem is if the update solves a specific problem that you are experiencing. For the v.1903 update, you can see if your specific problem is solved by v.1909 here:Windows 10, version 1903 and Windows Server, version 1903Otherwise, if your existing problems are caused by unsupported hardware or software, or configuration mistakes (for which I am famous,) or malware, solve the problems first.(The number 2 rule for updating a computer is: Backup before you start.)","Thank you sir... It really helped me to think in right direction that I shouldn't update. ","Thank sir.. ","In general, I agree with S-and-S. Also, MS generally does \"phased\" rollouts so you may or may not get the upgrade (feature update) right away.In my case, I have a desktop with very old hardware (though current nVidia GPU driver) running Win10 Pro, a nearly 10-year-old laptop running Win10 Home, and a very cheap 2-in-1 running Win10 Home. All were on 1903 fully updated as of November Patch Tuesday. 1909 showed up in Windows Update as an \"optional update\" in both the laptop and the tablet within the first week; I went ahead and installed it in them (no critical unbacked-up data) and it seems to be working fine.It hasn't been offered to the desktop yet. There's apparently no way to tell when that will happen; in the past, I have sometimes had to do a manual install of a feature update from media after several months, which has almost always worked fine (once, I had to restore from an image backup, wait a bit, and try again; forget which one that was). So, yes, always do an image backup before doing a feature update, preferably the week before it becomes publicly available; it's your ultimate recovery mechanism.1909 is odd, though; unlike previous feature updates, it doesn't wipe out the previous \"version\" - 1903 is still there. Not sure what that is all about. The stories about it being a relatively minor \"service pack,\" rather than a full replacement as in the past, may be correct - essentially a cumulative update on steroids.In general, if you're on the current version (1903 at this point) prior to the latest feature release, it's safe to wait as long as the release of the next feature update. You'll still get monthly updates to that previous version. After that, not so much; MS treats Win10 computers sort of like phones, and all support for a feature level gets dropped within a couple of years of its release for non-Enterprise users. Also, they do have different approaches for different hardware, so I'm content to give them a few months to figure my olde beastie out. IOW, it's early days so Don't Panic.","I currently have windows 10 1809. Today i saw an option to update to Windows 10 1909 . I want to know if there will be any sort of problem if I directly update my system to Windows 10 1909?I also want to know that do problems in Windows 10 1903 still exist like high CPU usage , wifi error etc. because with every update fix microsoft was releasing regarding \"May Update 1903\" more new issues were being reported by user. Will it be safe to install windows 10 1903?","About all I can say is that I had 1903 (May 2019 update) on all 3 of my computers - a desktop, a laptop, and a tablet\/2-in-1. It worked OK on all of them (only the tablet, the newest, got it right away, though; the laptop was a little later). Of those 3, 1909 is now installed on 2 and working OK. It hasn't been offered to the desktop yet. The desktop (a 13-year-old beast with a Core2 Extreme and 8G RAM) was the last to get 1903, too, though the delay after the others was only a few weeks.If you're coming from 1809, I'd strongly recommend doing a full backup - data and image - before upgrading. And yes, from yours it would be an upgrade - full replacement. You'll probably have to reinstall any software that's not part of Windows or from the Windows Store. That's because from 1809 it'll install 1903 first, then the 1909 update. You want that backup (on a separate drive, of course) so you have the ability to roll back if things break.I never had the problems with 1903 some people complained about. So perhaps that was a \"do you feel lucky\" situation, and I got lucky. There are no guarantees in the computer game - you take precautions so you can restore to a known working point if things break, then try it.","I don't know whether server is having a problem but I do know that 1909 is having the same damn problem with the 100% cpu usage as in earlier updates.  This time I have not been able to resolve the issue.  This truly sucks.  You have high end systems and they crawl like running windows ME. Thank God I have linux and OSX systems because windows will always be a garbage os.","Thank You so much. "]},{"symptom":"Activation        Is there any way to pay for an activation without re-installing the operating system? Apparently the OS I bought through amazon had an invalid product key (windows 10 pro). I've read online that this is possible, but the Microsoft representative I spoke with on the phone said it's not possible. If i have to re-install the OS I will lose 4 days of work and have to re-purchase some programs that don't allow license transfer.","solutions":["HI TG. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.What is the Activation Status and Edition showing at the top of the page at Settings > Update & Security > Activation?Run the Activation Troubleshooter in the same location and report back its findingsIf it's the same version you can buy a key from Microsoft and insert it in Settings > Update & Security > Activation > Change Product Key. Unless you know you need the extra expensive features in Pro then I'd buy Home which is the exact same OS with just a few extra features included in the chart below: https:\/\/www.microsoft.com\/en-us\/windows\/comparehttps:\/\/www.microsoft.com\/en-us\/p\/windows-10-ho...Since it's illegal piracy to sell preinstalled Windows without a way to activate it, I'd check if it actually has a license first. Install ProducKey fromhttp:\/\/www.nirsoft.net\/utils\/produkey-x64.zip and look for the OEM-BIOS key. If it's there then it's likely Home version although we can search the exact make\/model to see what OS it shipped with. If it's Windows 7 or 8 it might even activate with the preinstalled key so you can try copy and pasting it into Settings > Update & Security > Activation > Change Product Key.Once all possibilities are exhausted you can decide if you want to buy a Pro key or downgrade in-place to Home which is also possible using this workaround:https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Greg, thanks for your response. The activation status is \"not activated\". The edition says windows 10 education. Below the product key it says, \"we can't activate windows on this device because you don't have a valid digital license or product key....error code 0xC004C060.\"The troubleshooter just says \"we can't activate your copy of windows. Make sure you're connected to the internet and try again...\"The product key shown in the ProduKey program matches the one in the activation window. If I buy windows home, will i have to re-install the OS?","Education is not a retail version, it's also uses Volume Licensing not available to consumers.So yes you'd need to reinstall Home. You can try the same downgrade workaround here first which works for Pro>Home as it may work for Education:https:\/\/answers.microsoft.com\/en-us\/windows\/for...If not or you want a fresh start then follow the gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... To create bootable Windows 10 Installation Media (on another PC if necessary) install Media Creation Tool and follow the directions in the middle of the download page here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key for your PC maker given in this chart:https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, then on second screen choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, select the Unallocated Space, click Next to let it create and format the needed partitions and start install - this makes it foolproof.There is a step to rescue your files first using the booted media if you don't have them backed up:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC because you will learn everything that works best and how to apply it with your own hands.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","If I revert back to Windows 10 pro (which is what i bought) can i downgrade to home without re-installing the OS? Even with the workaround you still need a valid key, which apparently i do not have.","You can use the same method I gave to try to Downgrade from Education to Pro, but I thought you wanted to buy Home version? If so they try the Downgrade from Education to Home which should work because it's also an Upgrade path (so should downgrade)","I do want to buy windows 10 home. What i meant was that the installation disc i bought was for Pro. Somehow, in my trying to find a way to activate it, the OS changed itself to the education version. However, I can revert back to Pro if that will facilitate me downgrading to home. How risky is the downgrade workaround? The article's author says \"test your luck\", which seems to indicate that it may not work. I apologize if I am misunderstanding something here. I appreciate your help.","You buy the Product Key, the latest installation media is available all the time on the Media Creation Tool website here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... If you paid a lot for a Product Key you should contact Amazon and have them refund it as it's criminal theft to sell Product Keys that dont' work. You can also report it to Microsoft as piracy which they will investigate:https:\/\/www.microsoft.com\/en-us\/howtotell\/cfr\/r...As I said twice now, you can try the workaround to downgrade to Pro or Home. I would choose the one you're going to buy a legitimate genuine Product key for. Buy only from a major retailer willing to back all sales, or from Microsoft using the links I gave in my first post."]},{"symptom":"Windows 10 Activation after hardware change        I got a new motherboard and windows became unactivated. I don't have the product key and troubleshooting from settings isn't working. Is there some way it was or can be emailed to me?","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Firstly it depends on the type of license you have. An OEM license cannot be moved to a new mainboard - it's linked with the original board and a new board will require a new licence. You have an OEM version if Windows was supplied along with your original PC. If you have a Retail version it CAN be moved to new hardware - you'd have a retail version if you purchased Windows separately from your PC.The general guidance for activation when changing hardware is here: https:\/\/support.microsoft.com\/en-us\/help\/20530\/... You can confirm the licence version Windows has by following the information here:https:\/\/www.tenforums.com\/tutorials\/49586-deter... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Regards, David","Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Firstly it depends on the type of license you have. An OEM license cannot be moved to a new mainboard - it's linked with the original board and a new board will require a new licence. You have an OEM version if Windows was supplied along with your original PC. If you have a Retail version it CAN be moved to new hardware - you'd have a retail version if you purchased Windows separately from your PC.The general guidance for activation when changing hardware is here: https:\/\/support.microsoft.com\/en-us\/help\/20530\/... You can confirm the licence version Windows has by following the information here:https:\/\/www.tenforums.com\/tutorials\/49586-deter... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Regards, David If I had my product key would I be able to reactivate on my new motherboard?","It still depends on whether that Product Key was a Retail or OEM version. Sometimes, especially if your code hasn't been used to activate for a long time, I find that it will activate on changed hardware, even if it's an OEM code. But the official line is that an OEM code is not valid to use on a new mainboard. First check what type of code you have using the above guidance.","Well it's a pre-built PC so it had windows pre installed. So it's OEM right?","I'd expect so, yes. But unless you run the \"slmgr -dli\" command detailed in the link we can't know for sure.If the computer was a custom build (ie. often a gaming computer) the Product Key would actually be on a small sticker on the outside of your case. This is typically the case with a custom build from a relatively small supplier.If the computer was from a big make (HP, Dell, Acer, Lenovo, etc.) then the Product Key was most likely stored in the BIOS of the old mainboard.Unfortunately if Windows was OEM you are going to need to a new license for your new mainboard I'm afraid."]},{"symptom":"Hi        I cant do multiplayer on my ps4 and when I go to the servers it says to go to aka.ms\/accountsettings and I cant seem to fix this problem please helpMoved from: Security, privacy, and accounts \/ Other","solutions":[]},{"symptom":"How do I make this music folder show just the album art instead of multiple images of the files inside the folder?        Okay, this is really frustrating me and I could really use some help with this. I'm trying to figure out how to make this one album show just the album art instead of every single file inside the folder; I want this folder to look like every other folder, the only problem is: I have no idea how to do that. The folder I'm trying to fix is highlighted\/selected in the picture below, your help is much appreciated :)","solutions":["Have you tried to drag the ones that need to be in that folder to the folder and dropped them?","Hi RudderbuttCosplays Do you have the image you want to display on that folder? If so copy the image into that folder, then right click the image and rename it to Folder.jpg that should force Windows to show just that one image . . .","I did that once.  As I remember I had to convert the art to a .ico file.  That makes it an ICON.  Then I could change the manila folder icon to that art image.  So the folders looked like photos and movie posters.   Unfortunately some of the icons would default back to the manila folder image.","If viewing online with OneDrive you can easily change the folder art.  Using the Photos app on your PC you can create an album.  The album art could even be a video which shows moving previews. ","Thanks for your replies everyone. I'm happy to say that it is now working and fixed itself somehow :)"]},{"symptom":"i need tio re download window 7 64bit Home premier        I need to re download Window 7 64bit Home Premier","solutions":["It depends what type of license you have:Download Windows 7 Disc Images (ISO Files) - MicrosoftMicrosoft doesn't supply them for OEM preinstalled licenses (Dell, HP, etc.).@@@@@@@@@@@@@@@@@@@@@@@@@@@@If preinstalled:Or you can use this for preinstalled OEM or Retail Licenses. This is on a first come, first served monthly  basis.Download the correct ISO file and make your own disk and use the Product Key that is on the COA Sticker.https:\/\/www.heidoc.net\/joomla\/technology-science\/microsoft\/67-microsoft-windows-and-office-iso-download-toolDownload: Windows ISO Downloader.exeAnd here are instructions on how to burn ISO images to disk:http:\/\/www.snapfiles.com\/get\/ISORecorder.htmlYou change the Boot Order in the BIOS to be able to boot from your installation media:How to Boot Your Computer From a Disc or USB DriveThen do a clean install:http:\/\/www.sevenforums.com\/tutorials\/1649-clean-install-windows-7-a.htmlThe COA sticker is either on the underside of the Laptop or in the Battery Compartment.With a Desktop it is either on the side, rear or top of the Computer Case.Using the downloaded ISO file Method may require phone Activation.If it does require phone Activation, do not follow the Auto Prompts, but hold on for a real person to explain to as to what has been done for re-installation purposes\"How to Activate Windows 7 by Phone\"http:\/\/www.sevenforums.com\/tutorials\/18715-activate-windows-7-phone.htmlThe above method also will require you to go to your Computer Manufacturer's website > Support and Downloads Section > locate your Model Number and Operating System > then download and install the latest Drivers for it. ________________________________________________Using the USB method in conjunction with the above Windows 7 download:http:\/\/www.sevenforums.com\/tutorials\/2432-usb-windows-7-installation-key-drive-create.html\"How to Get and Use the Windows 7 USB\/DVD Download Tool\"http:\/\/www.sevenforums.com\/tutorials\/31541-windows-7-usb-dvd-download-tool.html________________________________________________And this is very good and easy to use:Rufus - Create bootable USB drives the easy wayCheers."]},{"symptom":"Calendar widget not visible when searching for a date        When I open a Windows Explorer and use the search box in the top-right corner to make a search for a date, I don't see anymore the calendar widget appearing below the search box to select a range of dates. In the past it was working.I use Windows 10 1909 (18363.535) 64-bit, French.","solutions":["Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.In 1909, it was removed unfortunately and the only way is to type the date range. For example datemodified: 01\/01\/2019 .. 02\/02\/2019. If you'd like to roll back to previous build, you can do so if 10 days hasn't pass yet as it is still working in 1903. You could refer to this link as others with same issue created a feedback so you can also up vote for Microsoft to notice the problem.https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this answers your concern.","Thanks for the quick reply!You write \"In 1909, it was removed unfortunately\". Is there any hope it will come back in a future release? The Search function was already not a lot user-friendly, as people needed to know the right keywords in order to do a specialized search, instead of having a simple GUI with the most useful file properties.(Yes, the ribbon shows some options, but they are hard-coded like \"yesterday\", \"this month\" (for modification date), \"very small\", \"small\" (for size). Moreover these options appeared only after a first search has been done, which could prove very long as it is not yet filtered).Joël","Hi, I understand and I would also love the previous feature to come back as it was very handy and user friendly. As I mentioned, other users in the link I gave has created a feedback on where you could up vote so it will be noticed and hopefully Microsoft restore it in future updates. For now, let's just bear with using the format i gave (datemodified:01\/01\/2019 .. 02\/02\/2019) when searching. I know it's not as easy as how the calendar popup works but it functions the same way."]},{"symptom":"time setting        I would like to use  military time but do nt see the option. Is it possible to do this?thanks..","solutions":["Start button > Settings app > Time & Language > Region > Additional date, time and regional settings > Change date, time and number formats","Hi anjaptb, Yes it is possible to switch Windows 10 to show the 24-hour clock vs. the 12-hour clock.Do the following: Go to Start > type in Control Panel > View by: Large icons > click Region > change your Long Time HH:mm:ssClick Apply (see attached)"]},{"symptom":"Issues pairing B&W PX to Windows 10 Home on Microsoft Surface Laptop 3        Hi guys,I have a set of B&W PX headphones (fully updated) which I am trying to pair as an audio device with my MS SL3 (one month old, all updates completed).  NB - I am having no problems pairing the headphones with other devices such as my phone (Samsung Galaxy 10+).I am able to pair the device, but it recognises it as \"other device\" not as an audio device, such as my earbuds which you can also see below, which pair correctly. (Apologies for the large picture)Any help appreciated.","solutions":["Hi Hamish. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I will give you everything that's working for others with the known issues with Bluetooth and headsets:First HEADSET: First try the steps here: https:\/\/www.maketecheasier.com\/fix-headphones-n...https:\/\/www.windowscentral.com\/setting-your-hea...https:\/\/www.lifewire.com\/fix-headphones-not-wor...https:\/\/www.thewindowsclub.com\/headphones-not-w...https:\/\/merabheja.com\/fix-no-speakers-or-headph...https:\/\/troubleshooter.xyz\/wiki\/fix-headphones-...Right click Volume icon in System Tray at right end of task bar, Open Sound Settings, in dropdown menus at top make sure Headphones are selected.If not choose Troubleshoot. Also try the Hardware Troubleshooter at Settings > Update & Security > Troubleshoot.Go to the Device Manager reached by right clicking the Start button, choose Sound controller device, on Driver tab choose Roll back or Uninstall, restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver. Do the same for the headset device and\/or it's microphone. Update the Sound driver from the PC or Device maker's Support downloads web page. While there also check that the Chipset, BIOS, Display, USB, Network and all other drivers are the most current.BLUETOOTH Troubleshooting: See Fixes here: https:\/\/support.microsoft.com\/en-us\/help\/14169\/...http:\/\/superuser.com\/questions\/823894\/how-to-ma...Try the Bluetooth troubleshooter at Settings > Update & Security > Troubleshoot. Try turning off Fast Startup at Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change settings that are unavailable > uncheck Fast Startup.Try Updating the Bluetooth driver from the PC maker's Support Downloads webpage for your exact model. Install it even if it's the same or newer than the one in Device Manager reached by right clicking the Start button.Right click Start button to access Device Manager, locate Bluetooth device (if necessary from View tab Show Hidden Devices), on Driver tab see if Roll Back is available, if not try Update Driver, first automatically, then Browse, then Let Me Pick to try all previously installed Drivers. If these fail try to Uninstall the Driver, restart PC to reinstall. Then try pairing again, if necessary run the Bluetooth Troubleshooter again. If you think the BT adapter has failed, you can replace it easily with a USB nano adapter like this one:https:\/\/www.amazon.com\/ZEXMTE-Bluetooth-Receive... If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1909 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Don't have brightness option anywhere after upgrading to Windows 10        I upgraded to Windows 10 yesterday and i can't seem to find the brightness setting absolutely anywhere.All drivers are updated, nothing comes up when troubleshooting in any way so no corrupt files, no brightness slider in action center nor brightness option in it as well, just night light, no option to add it to the notification center either, so nowhere in quick actions, no slider or options on display settings or power plan, Generic PnP Monitor is enabled and uninstalling it and installing again doesn't work, windows itself is fully updated.What can i even do? I don't get why such a feature is absolutely nowhere to be seen.Edit: I managed to find the color calibration tool, but for some reason when i crank it up the gamma doesn't change in the slightest, it's the same, anyone know why that is?Default gamma: https:\/\/fume.feen.us\/fi36xpk7fp.pngHigh gamma: https:\/\/fume.feen.us\/p38rh7ry1v.png","solutions":["HiMy name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.You might not see the Change brightness for the built-in display slider on PCs that have an external monitor. To change the brightness on an external monitor, use the buttons on it.The Brightness slider appears in action center in Windows 10, version 1903. To find the brightness slider in earlier versions of Windows 10, select Settings > System > Display, and then move the Change brightness slider to adjust the brightness.If you don't have a desktop PC and the slider doesn't appear or work, try updating the display driver. In the search box on the taskbar, type Device Manager, and then select Device Manager from the list of results. In Device Manager, select Display adapters, then select the display adapter. Press and hold (or right-click) the display adapter name, then select Update driver and follow the instructions.﻿﻿﻿Hope this helps.","Sadly i already tried all of that, the adapter is fully updated, and the slider is missing from Settings > System > Display, i'm using a desktop PC.","Have you tried using the buttons on the actual monitor to adjust the brightness?","Yes, but everything's maxed out, what i wanted is to increase brightness, and i'm not sure why the slider in color calibration does nothing.","Update: Somehow the color calibrator started working so i'll be using that as i did before, even though any other brightness options are still missing."]},{"symptom":"Hello receive an error in Windows 10 logs about restarting due to  BUGCHECK        Could you please advise what the issue could be:The computer has rebooted from a bugcheck.  The bugcheck was: 0x00000050 (0xffffa98dceaa108e, 0x0000000000000002, 0xfffff80230fd923c, 0x0000000000000002). A dump was saved in: C:\\Windows\\MEMORY.DMP. Report Id: 8dc2de1c-76c8-4f96-b8bc-9e0d13e13e80.placed dump file here:https:\/\/1drv.ms\/u\/s!ArrOIwXfeLwngbtU5LStFsxnZeea2g?e=LYBGAeThanks.","solutions":["Hi CrypticCape1789 Can you please check to see if your system has produced any minidump files and if so, provide those as a separate upload for analysis . . .Open Windows File Explorer Navigate to C:\\Windows\\Minidump Copy any minidump files onto your Desktop, then zip those up Upload the zip file to the Cloud (OneDrive, DropBox . . . etc.), then choose to share those and get a share linkThen post the link here to the zip file, so we can take a look for you . . .","Hi DaveM121,Thank you for looking into this. Minidumps copied here:https:\/\/1drv.ms\/u\/s!ArrOIwXfeLwngbtWmkqqWGqzNmteSA?e=bfqVg9Thanks,Bijan","Hi CrypticCape1789 Bug Check 0x50, This indicates that invalid system memory has been referenced. Typically the memory address is wrong or the memory address is pointing at freed memory.Try to run the DISM \/Online \/Cleanup-Image \/RestoreHealth Go to CMD and run it as Administrator then type DISM \/Online \/Cleanup-Image \/RestoreHealth Other method. Driver Verifier. Check this link : https:\/\/docs.microsoft.com\/en-us\/windows-hardwa...","Hi jhestech A+Thanks for the help. I attempted that solution but it kept restarting even after that. I ended up installing a new image of the OS to solve the issue I am not sure what got the system corrupted in the first place. Thanks again."]},{"symptom":"\"DESKTOP-FA45PT0\" error message???        Trying to upload music to sonos. continually get error message: \"DESKTOP-FA45PT0\" is not responding. How do I fix? Thank you!","solutions":["Hi Loki. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.That's your computer name which you can change any time in Settings > System > About > Change Computer Name.See fixes for music upload failure to Sonos: https:\/\/support.sonos.com\/s\/article\/2401?langua...https:\/\/en.community.sonos.com\/troubleshooting-...https:\/\/en.community.sonos.com\/setting-up-sonos...https:\/\/en.community.sonos.com\/music-services-a...https:\/\/www.smarthomesounds.co.uk\/blog\/faqs\/how...If none of the above help I'd contact Sonos Support or post in their forums via the links for that above.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thank you very much for your prompt response. What shouldI change the computer name to and why is that important? Thanks!","It's up to you. I thought you should know so you could recognize it easier in the future, but not necessary unless you want your own PC name.Any progress on the music transfer?"]},{"symptom":"Windows 10 Fresh Install Problems        So a couple days ago, I noticed my Dell Inspiron 5565 running on Windows 10s performance slowed down greatly. I also believe that this is due to a virus. Running out of options, i decided to completely reset my laptop. When doing this, it stopped at 64% and started going into a boot loop. After some research, I decided on going with a fresh install of Windows 10 via a flash drive. The problem is, that I can only boot from UEFI and not Legacy because whenever i do, it says no bootable device could be found. And UEFI only recognizes the Fat32 format, and I cant put anything bigger than 4 gigs on that format so its not possible to boot from it since a specific file on the Windows 10 .iso is bigger than 4 gigs. I really dont know what to do anymore because i've spent countless hours trying all different formats and messing around with the settings and cant get anything to work. Im using a 16gig flashdrive, and the only other PC i have is a Mac which inconveniences things more. Thank you to anyone who reads this and any help is appreciated. If you have any questions, let me know. Thanks!EDIT: First I just wanted to say thank you to everyone who helped me out while I was having this issue. But it turns out that Dell has a Windows 10 .iso on their website and for some reason it seems to be slightly altered so that no individual file is over 4 gigs compared to the original Win 10 .iso on the official Microsoft website. Again, thank you to everyone who helped!","solutions":["Hi, Abc123dog,Question: If you thought you had a virus, what steps did you take to get rid of it? Rootkit viruses can prevent the installation of the OS. This is why I'm asking.Try repairing the system before doing the clean install. Use the free edition of MiniTool Partition Wizard and follow the steps in this tutorial.https:\/\/www.partitionwizard.com\/partitionmagic\/the-requested-system-device-cannot-be-found.html","Thanks for the quick response!I couldn't really do much when trying to get rid of whatever it was since I didn't have an antivirus of any sort and didn't know of any good free ones. I thought Windows Defender was turned on but apparently it wasn't even though I'm sure it was on a couple months ago. When I went to turn it on, there was an error message saying something about having to be an admin to turn it on even though I double checked to see if I was an admin and I'm the only account on there. Being pretty inexperienced with computers and such, some of my friends and I also tried going through all my files, seeing if there was anything out of the ordinary, but found nothing. They think it might be disguising itself as a Windows program which does seem possible at this point. Thank you for this possible solution though, I'll get on it as soon as possible!","Just an FYI:If there were a virus on the system one of the first things they will do is turn off the installed Anti-Virus software. Using Windows Defender Offline you can download to USB and scan the system.I've also used Malicious Software Removal Tool to remove malware.These are some free versions you may use in future.BitDefenderKasperskyAviraAVGAvast","Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.The 4 GB limit for FAT32 is for single file. That means you can't put a single file having more than 4GB size.Windows 10 iso is definitely more than 4GB, but you are supposed to extract the iso and copy the contents inside the iso to the flash drive. The contents inside the iso does not contain any file having size more than 4GB.Hence, please mount the iso, copy the contents inside and paste them to the flash drive (FAT32).Then, boot from the flash drive.","Thanks for the response! Though almost all files in the .iso are less than four gigs, it seems there is one that is greater than 4 gigs. I figured out the specific file name and it is install.wim which is 4.61 gigs.","Try repairing the system before doing the clean install. Use the free edition of MiniTool Partition Wizard and follow the steps in this tutorial.https:\/\/www.partitionwizard.com\/partitionmagic\/the-requested-system-device-cannot-be-found.htmlThank you but it seems that this program is only for Windows and the only other pc i have aside from my windows 10 laptop is a Mac. Perhaps there is a version for Mac? Also thanks for all the suggestions on the anti-viruses!","Alright, in that please try to reset the PC from recovery environment. Shut down the PC. Press and hold the Shift and the Power button for 10-15 seconds. It will bring you to the Recovery Environment. Select Troubleshoot. Select Reset this PC.","EDIT: First I just wanted to say thank you to everyone who helped me out while I was having this issue. But it turns out that Dell has a Windows 10 .iso on their website and for some reason it seems to be slightly altered so that no individual file is over 4 gigs compared to the original Win 10 .iso on the official Microsoft website. Again, thank you to everyone who helped!I saw you'd edited the original post. Seems all is well in your world.You're welcome and Happy New Year.PS: These are utilities for Mac users. I'm not a Mac user and advise that you read all about these utilities which may or may not be free.https:\/\/www.thetechmentor.com\/posts\/top-10-mac-repair-tools\/"]},{"symptom":"Windows 10 Activation        Hello,I tried to activate a Windows 10 on a virtual machine with a product key, but it said that the key is already used.I remembered that I activated before on another virtual machine which I deleted a few months ago.I can't access to my deleted virtual machine, so I can't use the key on another copy.What should I do? ","solutions":["That's good, you should be protected. They are a legit site that provides discount keys to schools for students to buy.Did you copy and paste the key because the main reason for failure is it's easy to enter a wrong character? Triple check if you manually input it.If so then contact their Support here: https:\/\/onthehub.com\/help\/Let them know you are being helped in Microsoft Community Forums by a senior Activation MVP and we are waiting to hear how they make this right. Be polite but firm. They must make it right. Ask for a manager if necessary."]},{"symptom":"Bluetooth skipping        Bluetooth sound skips every 30 seconds or so.  Have latest drivers, installed\/uninstalled bluetooth numerous times, checked for bluetooth interference.  Speaker is placed right next to my computer.  Is there such a thing as a defective bluetooth connection on my computer?","solutions":["Hi, LARRYRB My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to run the troubleshooter for Bluetooth. Go to Settings - Updates & Security - Troubleshoot. Click on Bluetooth under Find and fix other problems. Follow the on-screen instructions.https:\/\/support.microsoft.com\/en-ca\/help\/402622...https:\/\/support.microsoft.com\/en-ca\/help\/15290\/...Try to update the Bluetooth drivers https:\/\/support.microsoft.com\/en-us\/help\/402844..."]},{"symptom":"XBox One Guide button        Hello, I recently updated windows 10 on my computer to the newest build and of course, I immediately ran into MAJOR problems. First and foremost... It is my computer Microsoft. If I have a button on a controller I WANT to use or a feature I do not want to use, I should be able to choose. I really despise the direction modern tech companies are going in this regard. Quit designing stuff for lazy morons, they can learn to do everything just like everyone else.Anyways.....I use a front end on my pc to launch games and media, on top of the front end I use a thing called rocket launcher that allows me to have universal controls of all media and applications. It adds stuff like universal controller profiles, universal pause screens, fancy load\/exit screens, etc etc. RocketLauncher works just fine... MY CONTROLLER DOES NOTThe way I have it set up, button 11 on the controller (the guide button) is supposed to launch my \"Pause Screen\". It doesn't do this anymore. It launches the stupid game bar **** no one needed or asked for. I want to control the guide button and what it does or does not do. (I also want an easy way to permanently disable stoopid features like the \"game bar\" but that is an entirely different topic)What I have tried...I unselected \"open game bar using this button on a controller\", no fixI turned off the game bar in settings\/gaming, no fix but did re-allow other apps that used the guide button for a function to use it againI downloaded Xbox Accessories and tried to reconfigure the controller to my liking              no fix, the guide button isn't even an option                        (Also it would be AMAZING if you could do keyboard binds to buttons. Thx for letting me set joystk inversion though)I tried to investigate the controller properties of the controller in \"game controllers\" from the devices and printers app              no fix, button 11 or anything relating to the guide button is even detectedI went into device manager and rolled back the drivers,               no fixI went out and bought a Sony DS4 controller and I can configure their fake guide button just fine.Notes:    The button is there, the button lights up when the controller is on, the button flashes when looking for a bt connection, the button works on an Xbox one just fine, launchbox detects it as button 11 when binding, steam and retroarch detects it and uses it for their own dumb overlays (which I have disabled now), All this leads me to believe that it is indeed Microsoft restricting me from configuring this button. Everything works as intended on my windows 7 machine and my wife's Windows 8 tablet. Windows 10 really does improve upon a lot of things but it fails in just about the same number of areas. Please quit trying to force people to use their computers how YOU think we should. Freedom MUST remain a top priority, otherwise, everything else is utterly pointless.I really don't like using this ps4 controller, it feels wrong in my hands so hopefully someone can help me out. Thank you in advance.","solutions":["Ohh yeah, I forgot to mention (bc it is irrelevant) but I have tried two separate Xbox one controllers and have the same issue on both (Microsoft deciding how I use things I own)","Hi Luigi. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.If you want to complain to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. But Microsoft will not even see it here because this is a tech forums where we are mostly volunteers trying to help solve your problems. I would uninstall Game Bar app: https:\/\/gist.github.com\/joshschmelzle\/04c57d957...Then try binding the key again using your choice of tool to do this. To make the Guide buttons on Xbox controllers remappable see here: https:\/\/github.com\/AntiMicro\/antimicro\/issues\/90Let me know if this much helps. If not we'll go from there. ______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Installed wrong win 10 version.        HII installed the wrong windows 10 version: Windows 10 pro N.While the product key I purchased is for Windows 10 Pro.I tried to use the key I have for activation but it didn't accept it.  What should I do?Thanks,Rune","solutions":["Hi ,runeschjetne my name is Dennis, I'm an independent advisor and I'll do my best to help today. in that case you need to install the system again but let it be windows 10 pro, performing the installation just like you installed windows 10 pro N.It's the only way the key works Regards, Dennis.","Hi Dennis!Thx for the input.Feared that was the only solution.Regards Rune","welcome :) Regards, Dennis."]},{"symptom":"PC makes me choose an option        Im new to pc and had bought one a month ago and used it for a bit and it worked perfect now its only booting straight to choose an option doesnt even let me press f12 or anything and ive tried the reset but it said it was unable to do so and im just lost ","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,I would recommend going into the windows recovery environment to use access multiple troubleshooting options.Have you tried using these options on the recovery environment? a) Startup repair Go to troubleshoot, advanced options, startup repair (This would attempt to repair the system)b) System Restore Go to Troubleshoot, advanced option, system restore (This would roll back the system's configuration to a specific time and date)c) Safe mode Go to Troubleshoot, advanced option, startup setting, click on restart and this would provide you multiple options in terms of booting up the computer.Choose to boot into safe mode, once accessed you could either uninstall the update or check if all your drivers are up to date. A clean boot under safe mode would also help to make sure no softwares are affecting the system1. Go to start menu\/search msconfig 2. On the system configuration window go to the services tab 3. Tick on hide all microsoft service so that this won't be affected 4. Choose to disable all services 5. Next, go to the startup tab and on the window choose to open task manager 6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok 8. A prompt to restart the computer will show up, choose to restart d) Reinstall system using bootable media Alternative to reinstalling windows https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/support.microsoft.com\/en-in\/help\/400073...Let me know how it goes. :)"]},{"symptom":"bluetooth        can i use a bluetooth adapter for my Asus x553m","solutions":["Hi Joanne. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.To know if your PC has bluetooth (if you're unsure) go here to turn on Bluetooth on an Asus PC:https:\/\/www.techwalla.com\/articles\/how-to-turn-...If not I'll give all possible steps for troubleshooting Bluetooth in order of priority, so even if you've tried them please do it over in sequence. Many problems right now are being solved by updating to the latest version so if you want to skip to that step see the Repair Install at bottom. I also provide an option to buy an inexpensive USB adapter so if that applies now you can skip to that step:Try Updating the Bluetooth driver from the PC maker's Support Downloads webpage for your exact model. Install it even if it's the same or newer than the one in Device Manager reached by right clicking the Start button.Right click Start button to access Device Manager, locate Bluetooth device (if necessary from View tab Show Hidden Devices), on Driver tab see if Roll Back is available, if not try Update Driver, first automatically, then Browse, then Let Me Pick to try all previously installed Drivers. If these fail Uninstall the Driver, restart PC to reinstall. If the BT driver is not there, access the View tab in Device Manager to \"Show Hidden Devices.\"Make sure you're pairing correctly as shown here: https:\/\/support.microsoft.com\/en-us\/help\/15290\/... See Fixes here which are all working: https:\/\/support.microsoft.com\/en-us\/help\/14169\/...https:\/\/superuser.com\/questions\/1017867\/make-wi...https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/www.lifewire.com\/fix-windows-10-bluetoo...Try the Bluetooth troubleshooter at Settings > Update & Security > Troubleshoot. Try turning off Fast Startup at Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change settings that are unavailable > uncheck Fast Startup.If this is a mic or headset right click Volume icon in System Tray to Open Sound Settings, make sure the correct device is selected for input or output in the dropdown menu.Then try pairing again, if necessary run the Bluetooth Troubleshooter again. If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....If you think the BT adapter has failed, you can replace it easily with a USB nano adapter like this one:https:\/\/www.amazon.com\/ZEXMTE-Bluetooth-Receive... Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1909 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]}]}