{"windows":[{"symptom":"Creating ADC in Windows 10        Hi there!I need to connect and configure a \"Powerwave Tecnologies\" repeater. It uses legacy hardware and connection creation solution, that I could make without any problem in Windows XP. (I had to create an advanced connection with direct communication cable modem, in order to farther configure the device). But now I have a new notebook with Windows 10 installed, and all my tries to create such connection unsuccessful. Is there any solution, or I have to use XP again?","solutions":[]},{"symptom":"Windows Store and Minecraft Windows 10 Edition        I purchased Minecraft Java Edition a long time ago and was eligible to receive Minecraft Windows 10 edition for free. I got the code for the free upgrade, and redeemed it with no problems on my old Surface Pro 4.I recently got a Lenovo Legion Y530 and I can't redownload Minecraft Windows 10 edition on the same Microsoft account. I checked my owned library and going to the app purchase screen says I don't own any versions of Minecraft. I even logged into my Minecraft Account, retrieved the code and putting it into the windows store and it said that I had already redeemed this code. All of the other apps I have purchased aren't appearing in my library too. The only game it said I own was Candy Crush Saga. I really don't know what to do and I should own a version of Minecraft as I purchased the Java edition. Any help would be greatly appreciated.","solutions":["Hi Jack, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.What is the build number reported in Settings>System>About under Windows specifications?"]},{"symptom":"Windows 10 Mail        Hello!I am again having a problem with Windows 10 Mail.I have a Btinternet address.I get a message saying my settings are out of date.The settings are not out of date, if I access BT Mail the address and password are correct.I have deleted the account from Windows 10 Mail and re-installed it but get the same message.The settings are correct it just will not work.My other account which is BTopenworld has never been an issue.Any ideas would be helpful!","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please reset the Mail app and check. Open Settings (PC Settings) Click on Apps Select Apps and Features Select \"Mail\" app Click on Advanced Options Click on Reset","Arif,I have done as suggested but it's still the same.I have looked at account settings for some reason the password shown is 16 digits.Even if I insert the correct password which is 9 digits, it still cannot sync and if I look at account settings it still comes back as 16 digits and tells me to reset my password.This only happens on my BTinternet address.","No problem. Please Remove the Account from the Mail and Calendar app and Add the account again.Steps to Remove an account from Mail app: https:\/\/support.office.com\/en-us\/article\/delete...","Have you tried to setup manually instead of letter Mail do it for you.https:\/\/www.bt.com\/help\/email\/manage-email-account\/manual-settings\/what-are-the-settings-for-outgoing-and-incoming-bt-email-serversDelete the account in Mail and select Advanced setup, it could be other settings not correct and not your user name and password.","i had the same problem a couple of days ago this worked for meInternet Time synchronization or incorrect Date & Time may trigger the “Your mail account settings are out of date” error.I went all settings date and time and clicked sync now that worked for me","Hello!I've tried all the above and it's still not working.Worked perfectly ok yesterday.When I look at account setting still shows 16 digits for the password, however I can't show the password.","Don't worry about the number of character shown. This is a security feature often used in the password field to make sure the password length is not whatever the password is.I wonder what has changed since yesterday.","Hello!Nothing has changed and it now works!Apparently no one knows why it does it, but it I've been told it stops and starts by itself.Can take anytime from a few hours to a couple of days.Cheers,","Is there any difference after performing above steps?"]},{"symptom":"Kernel Security Check Failure Blue Screen on startup        Good dayMy laptop keeps on getting the blue screen on first startup.  I cannot figure out what is the cause.  Please assist?  I have the dmp and nfo files for upload, if necessary.Thanks","solutions":["Hi Charlene Please check to see if your system has created any minidump files . . . Open Windows File Explorer Navigate to C:\\Windows\\Minidump Copy any minidump files onto your Desktop, then zip those up Upload the zip file to the Cloud (OneDrive, DropBox . . . etc.), then choose to share those and get a share linkThen post the link here to the zip file, so we can take a look for you . . ."]},{"symptom":"Which program is using the folder while trying to rename it?        Why the name of the program is not displayed? which program is using that folder?","solutions":["Where are you?","Hi I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Please explain more as what you wrote doesn't even begin to explain the problem. What exactly are you trying to do? What is happening instead? What have you tried to do about it so far?","I think \"Renaming an folder\/directory in windows OS GUI is one of the basic functionality\"Sometimes, when we try to rename a folder, windows popup says that it cannot be renamed because it is being used by some other program.My question is \"Why that popup doesn't contain the name of the program which is using the folder\"","I think \"Renaming an folder\/directory in windows OS GUI is one of the basic functionality\"Sometimes, when we try to rename a folder, windows popup says that it cannot be renamed because it is being used by some other program.My question is \"Why that popup doesn't contain the name of the program which is using the folder\"Hello,It seems you're renaming a folder that contain files being used by some program or Windows background service.Can you tell us what folder you're trying to rename?Regards.","I hardly matters which folder i am trying to rename!!!Only thing is (\"when we try to rename a folder, windows popup says that it cannot be renamed because it is being used by some other program\") popup should display the name of the program.I know that my folder was being used by some indexing services or antivirus services.But this info should be available in the popup itself rather forcing the user to end-up guessing and closing suspected programs. ","That's a good question. See this guide for file can't be renamed because it's in use by another program: https:\/\/www.itechtics.com\/delete-move-or-rename...______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I hardly matters which folder i am trying to rename!!!Only thing is (\"when we try to rename a folder, windows popup says that it cannot be renamed because it is being used by some other program\") popup should display the name of the program.I know that my folder was being used by some indexing services or antivirus services.But this info should be available in the popup itself rather forcing the user to end-up guessing and closing suspected programs. Okay, kindly use the Feedback hub app (Windows + F) and submit your opinion to Windows engineering team.Regards."]},{"symptom":"Windows 10 Setting        What is the settings option \"app execution aliases\" for?","solutions":["Hi CharCharCharlie, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.App Execution Aliases typically are used by advanced users who call programs using command prompt, a script file, or through Start > Run.You can kind of think of it like a shortcut to a file, and being able to \"map\" microsoftword.exe (which is more memorable) to C:\\Program Files\\Microsoft Office\\root\\Office16\\WINWORD.EXE for example.This website has a good visual example: https:\/\/www.tenforums.com\/tutorials\/102096-mana...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"I cannot get Windows Audio  to run.        I have reinstalled my drivers for my Desktop which is about 2 months old. No luck. The troubleshooter points to needing both Windows Audio & Windows Audio Endpoint Builder Services must be both running. I cannot get Windows Audio to start in services. My system doesn't show any devices for playback. Any help would be greatly appreciated.","solutions":["Hi, What is your OS Build version? To find out, Go to CMD and type winver btw Have you tried to run the system file checker? Run CMD as Administrator then type sfc \/scannow","I have reinstalled my drivers for my Desktop which is about 2 months old. No luck. The troubleshooter points to needing both Windows Audio & Windows Audio Endpoint Builder Services must be both running.I cannot get Windows Audio to start in services. My system doesn't show any devices for playback. Any help would be greatly appreciated.Hello,What happens when you start both services, did you received any error?Regards."]},{"symptom":"Touchpad Gestures settings missing under Windows Settings        Settings for my touchpad are awfully limited.  On the previous laptop that I owned there was an extensive menu for enabling and disabling touchpad gestures.  A search on this Windows Support forum yeilded a topic that directed you on how to update drivers within the Device Manager settings menu.  I updated the drivers and restarted my laptop and below is a print screen of my settings following the driver update.  As you can see there really isn't much of use there.  When I click the link on the right \"Additional settings\" the traditional Mouse Properties window appears but within that window no settings for the touchpad.  I searched this board once again but turned up empty handed.  Is there a download to patch the missing menu items or perhaps a code that will bring them back through Registry Editor?  Thank you for your help in advance.***Modified title from: Touchpad ***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are unable to find Gestures settings for Touchpad on your computer. I’ll certainly help you with this issue. The touchpad gesture settings depends on the model of the laptop that you are using. For us to investigate more on this, please share the details requested below: Were you able to find the gesture settings earlier?What is the make and model of the laptop that you are using?What is the version of Windows 10 that you are using currently? To check typewinver in the search bar on the Taskbar and hitEnter. However, as you have already tried updating the Touchpad drivers, I would suggest you to check if there any pending Windows updates on the computer. You can navigate toStart >> Settings >> Update & Security >> Windows Update >> Check for updates. We await your response. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"file explore says access denied        What to do if file explore says access denied when i select a user, i'm the administrator","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Even an administrator user doesn't have access to other users profile folders (ie. c:\\users\\username) by default, these folders are set to be private. However usually when you attempt to open them Windows will offer to adjust the security to give you access.You can also right-click the folder and use the Security section to give yourself access manually.When I click another users folder on my own computer (and I'm also an administrator) it says this for example.Regards, David","What to do if file explore says access denied when i select a user, i'm the administratorHello,Can you share exact error message\/warning you received? I'll help.Regards."]},{"symptom":"Store windows 10        I can no longer download applications on my windows store 10. when I open it closes by itselfwhat to do to solve the problem?","solutions":["Hello Erick,You could see if resetting the \"Microsoft Store\" app using the method in the tutorial below may be able to fix it.https:\/\/www.tenforums.com\/tutorials\/48107-reset-app-windows-10-a.html","Hi Erick, reset Store running wsreset command. See solutions at https:\/\/support.microsoft.com\/en-us\/help\/402749...","I can no longer download applications on my windows store 10. when I open it closes by itselfwhat to do to solve the problem? Hello, Try re-registering Store app. Perform these steps: 1. Search for Windows PowerShell using Cortana or Windows Search. 2. From results, right click on Windows PowerShell and select Run as administrator. 3. Then type following command and press Enter key: Get-AppXPackage *WindowsStore* -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"} Let the command complete. 4. Close Windows PowerShell. Let me know if issue still persists!"]},{"symptom":"Windows 10        I have had Windows 10 installed and have no sound.  I have tried all googles suggestions without success.","solutions":["Hi, do you have speaker icon in down right corner? Is it normal or with red cross? If normal, check settings, probably sound output is selected incorrectly.","I have had Windows 10 installed and have no sound.  I have tried all googles suggestions without success.Hello, Please run Playing Audio troubleshooter from Settings app > Update & security > Troubleshoot. Let us know what it reports back. Regards."]},{"symptom":"Microsoft Store: Can't install game (Try Again Later: Something happened on our end)        I purchased Ark: Survival Evolved from the Microsoft Store and it began installing with no issues. About halfway through the 90gb installation it encountered an error and I had to start the installation from the beginning. But now when I try to begin I encounter the same error over and over; \"Try Again Later: Something happened on our end\".I tried the wsreset command, but it doesn't solve the issue.","solutions":["Hi MS. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything possible to repair the store. Even if you've tried a step please do it over in this sequence. If any steps cannot be performed then report it and move on to the next:1) Try updating Store apps: https:\/\/support.microsoft.com\/en-us\/help\/402625... 2) Make sure you have the latest Windows 10 version 1909 in Settings > System > About and if not skip to Step 10 to install it by the most stable method.3) See if the fixes here help: https:\/\/www.pcworld.com\/article\/3053099\/windows... 4) Try running the Windows Store apps Troubleshooter at Settings > Update & Security > Troubleshoot.5) Try resetting the Store cache: http:\/\/www.thewindowsclub.com\/reset-windows-sto... 6) If that fails go to Settings>Apps and highlight Microsoft Store, choose Advanced Settings, then Reset. After it resets, restart PC.7) If that fails then reinstall Store. Type CMD in Start Search, right click Command Prompt result to Run as Administrator, copy the following code and paste it into the box using the Edit tools from Box's top left dropdown menu, press Enter:PowerShell -ExecutionPolicy Unrestricted -Command \"& {$manifest = (Get-AppxPackage *WindowsStore*).InstallLocation + '\\AppxManifest.xml' ; Add-AppxPackage -DisableDevelopmentMode -Register $manifest}\"8) Clear the LocalCache Folder: Open Run by pressing the Windows key + R hotkey. Copy and paste %localappdata% in Run and click OK. Open Packages> Microsoft.WindowsStore_8wekyb3d8bbwe > LocalCache folder. Press the Ctrl + A hotkey to select all content within the LocalCache folder. Press the Delete button. 9) If these all fail then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account because of the serious and persistent problem with corrupted accounts. Then continue with the other steps to go over your install most thoroughly.10) If nothing else works then do a Repair Install, by installing Media Creation Tool and then choosing to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I purchased Ark: Survival Evolved from the Microsoft Store and it began installing with no issues. About halfway through the 90gb installation it encountered an error and I had to start the installation from the beginning. But now when I try to begin I encounter the same error over and over; \"Try Again Later: Something happened on our end\".I tried the wsreset command, but it doesn't solve the issue.Hello,See if this fix helps you:https:\/\/www.kapilarya.com\/try-again-later-something-happened-on-our-end-store-app-windows-10Hope this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP. "]},{"symptom":"fail to activate my windows 8 pro        in year 2012 i bought my laptop acer aspire one with windows 7 home basic.  on 03\/11\/2012 i get offer from microsoft to upgarde to windows 8 pro. so i did a buying online with my order no wd04689164 together with cd driver. now my laptop got problem due to hard disk corrupted. i changed my hard disk and installed a new windows 8 pro. i try to activate it but failed. Why ?thank you.","solutions":["I explained that as a possible cause for your problem in my original reply to you.2. If you had 7 and upgraded to 8, you have to follow the same reinstall path.You can't clean install with an upgrade license.You have to do what you originally had and did > reinstall 7 > then upgrade to 8."]},{"symptom":"Reducing Windows 10 data usage        I understand that there is an option to set a connection as a metered connection.  There is also an option in Settings\/Data  Usage to \"Limit what store apps and Windows features can do in the background\" by selecting \"Always\".  What is the difference?  Which is most effective? Or should I do both?","solutions":["Hi JL1225, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.You are correct that both options are available. If you set the connection as a metered connection, some apps might work differently on a metered connection to help reduce your data usage. Also, some updates for Windows won't be installed automatically.Source: https:\/\/support.microsoft.com\/en-ca\/help\/402845... The option \"Limit what Store apps and Windows features can do in the background\" applies specifically to apps installed through the Windows Store and other Windows features, and enabling this would limit even more data usage. It is optional, but if you would like to reduce the amount of data the connection uses, selecting both is most effective.I hope this has helped you. Please reply with any other questions you may have and we would be happy to look into providing some different suggestions!Regards, -Ashton","Thank you very much.  I will  try this!","You're very welcome! Please feel free to let us know if you have any other questions :)Have a great day! -Ashton"]},{"symptom":"Windows 7 to Windows 10 Free Upgrade        Hello Everyone, I have been running Windows 7 Home Basic for a long time and now when the announcement for the official support is coming to an end. I would like to have upgraded to Windows 10. I just wanted to know if that's possible or if I have to reach out to specific support to request a link ( if they allow still ). Looking forward to some suggestions and probable solutions. Thanks upfront! ","solutions":["Unless you have a retail purchased license of Windows 7 you will have to purchase Windows 10 from Microsoft to activate the computer.If you computer was purchased with Windows installed it is an OEM license and can not be upgraded free.Regular free upgrade ended in 2016.","Hello Everyone, I have been running Windows 7 Home Basic for a long time and now when the announcement for the official support is coming to an end. I would like to have upgraded to Windows 10. I just wanted to know if that's possible or if I have to reach out to specific support to request a link ( if they allow still ). Looking forward to some suggestions and probable solutions. Thanks upfront! ","am asking for a software in 2020","am asking for a software in 2020","Ok, so in one sentence- it can't be done. Right?","Not unless you have a legally purchased key.","The free upgrade was nothing to do with being Retail only.It was for Retail and OEM.And OEM users are still getting the free upgrade.@@@@@@@@@@@@@@@@@@@@@@@@@You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700Cheers."]},{"symptom":"Can't login to computer with password, but I can with PIN.        How do I reset password","solutions":["Hi John. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Go here to change your password for a Local or MS Account: https:\/\/support.microsoft.com\/en-us\/help\/402845...https:\/\/support.microsoft.com\/en-us\/help\/402697...Be sure to set up test questions to change the password from the locks screen in case you get locked out:https:\/\/www.windowscentral.com\/how-reset-passwo...See here how to reset or recover a lost password: https:\/\/www.groovypost.com\/howto\/recover-lost-w...I suggest a strong complicated password that's also easy to remember, such as for example a [childhood street address]+[phone number] that only you remember. It has all the elements any site would require.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hello,If you're using Microsoft account, try to reset the password online using another device, visit this link:https:\/\/account.live.com\/password\/resetAfter resetting the password, see if you can login to original device with new password.If you're using local account, refer this support article:https:\/\/support.microsoft.com\/en-in\/help\/4028457\/windows-10-reset-your-local-account-passwordLet us know this helps!"]},{"symptom":"Uninstall Your Phone Companion App        Hi,Regrettably, I am less than underwhelmed by the new Phone Companion App that came with the latest Windows 10 update.Having said that, how do I uninstall Microsoft Phone Companion?  When I try from the Apps menu, I have to go to Advanced Options, which brings to Your Phone Companion App; I try clicking on the TERMINATE button, but nothing happens -- and apparently, the App is running in the background so I can't uninstallWould appreciate some advise on this one as wellThank you very much","solutions":["Hello there! If Windows warns you that it is running in the background then you will have to go to settings > privacy > background apps and turn off background apps.Afterwards, try to disable\/uninstall the app. Still doesn't work? Clean boot the PC Clean boot: https:\/\/support.microsoft.com\/en-us\/help\/929135... Restart again and then try.","You cannot uninstall it. That is a system app. Just stop it working in the background and forget.","Hi Rsnic, thanks for your question. Hopefully I can help! The easiest way to uninstall the Phone Companion is in the Start Menu. Open the Start Menu and find the app, right-click it and click Uninstall.If that doesn't work, try using Add or Remove Programs. Click Start, and type Add or Remove Programs. Click the result and it will open the Settings app. Find Phone Companion in the list, click it and click Uninstall.Hopefully this helps! If you need any more information, please let me know. Thanks!","Hi Rsnic Right click your Start Button, choose Powershell (admin) Paste this command into Powershell and hit Enter Get-AppxPackage *windowsphone* | Remove-AppxPackage When that command completes, close Powershell That's It!","Thanks, worked like a charm. It reset the app to a default starting point.","There is no option to uninstall the Your Phone App on my windows 10 computer.  When you right click the only option that looks promising is the Settings which has a \"Terminate\" button that does nothing.  Neither Phone Companion or Your Phone are listed in the Programs and Features. so you can't uninstall there.  I even found a line to enter into Power Shell that did nothing.  I will carefully research before I install another Microsoft App.","Hello Help65, I uninstalled mine by using Ccleaner ","Phone Companion refuses to pair with my Essential PH-1, I've tried all the steps provided by MS my last step is to reset my phone and PC biy I would like to uninstall Phone Companion first and reinstall it.","Ill tell ya, I went through hell getting it paired when it first came out. I basically just kept retrying and retrying and finally it went. Took hours.I would not trust the app as it is anyways. I have it working, and I think they need to really work on a direct connection via bluetooth or wifi (instead of calling on ms servers, first) or scrap this idea all together. It really needs work.If I were you I would wait until the Windows update drops with the updated your phone program, it might get better. Otherwise its just not worth the stress. There are obvious problems.","I uninstalled it from Windows using powershell (admin).I unistalled it from my apps in my Android phone.Apparently it's not until 1903 is sent to your computer according to this:https:\/\/answers.microsoft.com\/en-us\/insider\/forum\/all\/your-phone-companion\/8067fda5-3891-464a-b9de-c30e52fa476cThis app came installed in my 1803 Windows update. It's claimed to work in 1809. Pffftt!!!This \"app\" has been out for at least a year or more and it isn't doing well AT ALL! LOT's of complaints.LOT's of confusion, I'm not sure if the 1903 version will do what is claimed either. This link apparently \"explains\" how it works. I'm following it but found no answers:https:\/\/answers.microsoft.com\/en-us\/insider\/forum\/insider_apps-insider_other-insiderplat_pc\/phone-screen-supported-devices\/18794409-3e4a-40eb-a6b1-7d06a16b956e?page=50&rtAction=1558693279849Another note on this app is here:https:\/\/www.neowin.net\/news\/your-phone-companion-gets-a-new-icon-and-mobile-data-sync\/The problem in this one is 2 paragraphs are on the app update for version 3.4.8 and THREE paragraphs on it's new ICON. Question: WHO CARES ABOUT THE ICON WHEN SO MANY CAN'T GET IT TO WORK AT ALL??? Microsoft only!!!Can you tell I'm another frustrated Windows 10 PC owner?My half educated guess is you have to be in the Windows Insider Fast Ring to actually play with the Your Phone app.OH, just another bit of info on the Your Phone \"won't\" app:https:\/\/www.neowin.net\/news\/tags\/build_18908"]},{"symptom":"How to stop the printer        How to stop the printer","solutions":["How to stop the printerTurn it off at its own on\/off button."]},{"symptom":"Our supplier used KLM server for Windows Server 2019. Is it legal?        We bought 8 pieces Microsoft Windows Server Standard Core 2019 SNGL OLP 2Lic NL CoreLic Remarketed.Because first time the MS activation server determined the specified product key is blocked, we asked the supplier for help. After some trials, they forwarded their partner's mail how to fix it using KLM server.Their mail:The problem was that the activation via the GUI interface (the normal user interface) is unfortunately very error-prone and often led to problems which had to be solved by an activation via Command Line Interface. However, the activation via DOS Box and the corresponding commands requires a lot more expert knowledge, so it was very complex to explain this to customers & end users!This is why we now deliver you for the Activation of Microsoft Office and Windows Server Licenses our Activation Toolbox!Main component of this toolbox is our Activation Batch Files (approx. 500kb) which executes a manual KMS activation via Command Line Interface commands. This could theoretically also be entered manually in the command line, in order to make it easier for you and your customers, we have summarized this in a small batch fileàyou could download the Activation Toolbox for Windows Server 2019 Standard at:             https:\/\/we.tl\/t-8uj7b9fFakThis activation possibility offers the advantages, security & stability of a Microsoft KMS activation without the customer having to undertake the complicated process of setting up, administering and maintaining his own KMS host. Enclosed you will find a short description and information regarding the process described above. These documents are kept neutral so that you can pass them on to your customers!Even if this may sound very complex & cumbersome at first, it is very easy in practice for you and your customers. ·         Install the software·         execute our batch file after the installation (which you receive with the delivery \/ mail of the ISO files) ·         and 15-20 seconds later the license is activated. See attached a short guideline regarding that!Of course, all volume licenses (whether new or purchased from us) are multi-bit, multilingual and downgrade able.We are happy to provide the corresponding ISO files for installation and our Activation Batch Files also for a corresponding downgrade at your customer!Now our Windows Server is activated, but I want to be sure that it is legal and it will work for more than a decade.Thank you for your help in advance.Best regards,István Vizsy","solutions":["Hi István Vizsy, Thank you for writing to Microsoft Community Forums. I understand your query regarding activation of Windows Server 2019.  As you are using Windows Server 2019 and Volume License keys, we do have a dedicated team for issues related to Volume License activation. I would suggest you to get in touch with ourVolume licensing team and they will help you with the details. For any technical issues related to Windows Server 2019, you can also post your query inTechNet forums, where we have support professionals to help you appropriately. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Uninstaller for Windows 10        Is there an uninstaller in Windows 10, I've mistakenly installed a driver updater, and it keeps sending annoying pop-ups","solutions":["HI Nigel. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Go into Settings > Apps > Apps & Features to look for the app and Uninstall it. If it's not there or wont' uninstall normally see these steps to force it out: https:\/\/www.techradar.com\/news\/software\/10-tips...https:\/\/www.howtogeek.com\/314734\/how-to-manuall...Freeware like this always tries to sneak in other apps that can sometimes be harmful. So Download, install and run a full scan with the most powerful on-demand free scanner Malwarebytes:https:\/\/www.malwarebytes.com\/mwb-download\/.In the Scan Settings first set it to include scanning for Rootkits. If necessary run it in Safe Mode with Networking, or Safe Mode accessed by one of these methods:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... Clean up anything found, restart PC and then run again until it comes up clean. Check for any remainders in Settings > Apps > Apps & Features, and also in each of your browser's Extensions, Home Page settings, Search service or Add-On's as shown here:https:\/\/community.box.com\/t5\/How-to-Guides-for-... Then check for damaged System Files: https:\/\/www.lifewire.com\/how-to-use-sfc-scannow... If it cannot repair them see Step 10 here to continue: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If you want to keep Malwarebytes as an on-demand scanner then you can turn off its Real Time trial version in it's Settings > Account Details tab.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","If you do not find it in Apps and features try Programs and features.You can also go File Explorer and search and find it and right click on it and Delete."]}]}