{"windows":[{"symptom":"Windows 7 Keyboard Problem        Hello, I have a laptop that have windows 7 and when I press a button like k it combines with any number. Can someone please help me ","solutions":["Hello, I have a laptop that have windows 7 and when I press a button like k it combines with any number. Can someone please help me Do you have a spare USB Keyboard to test with ???If not see if you can borrow one.Hook it up to your laptop and see if it works correctly.If it does then i would suspect your laptops Keyboard to be faulty.","Hi, you can press Fn+NumLock to have a try."]},{"symptom":"my bluetooth has stopped working since moving up to windows 10        Does anyone know how to fix this?","solutions":["Hi, mrs My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to run the troubleshooter for Bluetooth. Go to Settings - Updates & Security - Troubleshoot. Click on Bluetooth under Find and fix other problems. Follow the on-screen instructions.https:\/\/support.microsoft.com\/en-ca\/help\/402622...https:\/\/support.microsoft.com\/en-ca\/help\/15290\/...Try to update the Bluetooth drivers https:\/\/support.microsoft.com\/en-us\/help\/402844..."]},{"symptom":"Attaching office files        I cannot attach office files to emails. 1) It does not matter if it is outlook online or app, gmail or any other browser type. It does not matter which browser Edge, IE, Chrome, Firefox have all been tried. 2) I can attach other types of files such as pdf's and jpegs. 3) It used to be that I could not use the attach button to attach, now I cannot drag and drop either. 4) Windows 10. 5) No new software6) Windows and office is up to date. 7) Oh in order to open an excel file, I must open it from excel. I cannot open it by clicking on it in the folder. I need this fixed. I have had somebody look at my computer. All defaults are correct. ","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Would you be able to create a temporary local account and try to attach these files?Please let me know the status.","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Would you be able to create a temporary local account and try to attach these files?Please let me know the status. I am insure of what you mean by temporary local account. ","I mean, create a local user account.","No it will not let me create another account. It says to try again or come back later. ","Using GMail as an example, when you click on the attachment iconAre you able to browse to the file you wish to attach, and select it?","Using GMail as an example, when you click on the attachment iconAre you able to browse to the file you wish to attach, and select it?Yes i am. Like I said prior, I can attach non Microsoft Office files like pdf's, jpegs etc. When I try to attach or try to drop the file into the email, it freezes up the file explorer folder and the browser or outlook ","Are the files that you wish to attach stored in your user profile, for example:C:\\Users\\your account name\\File.docx-OR-Are the files that you wish to attach stored on OneDrive or some other cloud storage?","Did you check if there is any System Restore Point before the date this issue started to occur?If there is a system restore point earlier to the date when this issue started to occur, you may go for a System Restore.","I just found that I can drag and drop a file from the desktop into an email. I cannot use the attach button and attach it that way. I drag and drop from any folder on the computer or network drive. ","I would suggest you to kindly reset all the browser and try again with the Attach button"]},{"symptom":"My PC plays cd's but will not play dvd's it says that the computer cannot read because of error .BUP Can anyone help?        As above, can anyone helo?","solutions":["Hello i'm Timon and i'm glad to help you. BUP files are backup files and not meant to be opened. You don't really open files on a DVD. Have you tried with VLC player ?"]},{"symptom":"Cannot run as administrator - intermittent issue - 15 minutes after a restart run as admin works again        Windows 1 pro  Version 10.0.18362 Build 18362i9-9900K, 32 GBRunning my normal, user account which is an admin acctHave not done any upgrades recently that I know of to WindowsWhen I start or restart Windows I am unable to run as administrator  - No response to Command Prompt as admin (non admin cmd works OK)  - No response to Powershell as admin (non admin works OK)  - File Explorer does not start when selected from task bar  - OneDrive grayed outThen - what seems me to be very weird --  after approx 15 minutes of on time, run as admin suddenly works again. And, the previously non responsive attempts to open file explorer, powershell as admin and cmd as admin suddenly open and pop up on the screen. Weird!!I have a second admin account that I set up for emergency use. That account does not exhibit this issue. If I log into my normal user account and have the run as admin issue described above and then switch users to the backup admin account I find no issues with the backup account.I am in over my head on this one. Have searched community and other online sources for ideas.  Have run sfc and dism.  Ran DISM with \/RestoreHealth, and it found some things to clean up, but the problem persists.Appreciate any thought\/ideas what I might try.  Thanks!","solutions":["What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK","Thanks for reply.Ver 1903 (OS Build 18362.449)","Have you thought of upgrading?","Yes, but have it delayed on purpose. Running some software that is frequently trashed by upgrades.If upgrade is only solution, I will do it. But, want to try other approaches first. Many thanks.","Well, my problem magically disappeared a couple of days ago. Thought all was well until today when it returned! So, bit the bullet and upgraded Windows to 1909 and all the updates I could find. Problem persists - unable to Run as Administrator for approx 15 minutes after starting up. After that all is well.Would appreciate any suggestions. I could live with this behavior but it worries me that there might be something ugly like a virus causing it. I have run Windows Defender and Malwarebytes.Many thanks!","Just wanted to provide some feedback in case others have similar issue:Finally got around to trying to fix the issue after the holidays.  Noticed that a new user account I had created was having a similar long delay in getting logged into OneDrive. Turned out that was the culprit with my original admin user account.I blew away my OneDrive credentials in Control Panel and then unlinked my OneDrive account. Rebooted. All my \"run as admin\" issues were gone. Reestablished my OneDrive account, and now all is well.Thanks again for the help on this forum."]},{"symptom":"External disk fixing takes very long time        Hi,I have Windows 10.I had a problem with my external hard drive (it said fatal hardware error) as it was not recognized by the system, though found as disk F:\\. I restarted as sometimes it fixes such bugs.right at the start of booting, windows started fixing my external hard drive, completing after an hour.At this point the explorer did not work properly, so I restarted it again. That was about 17 hours ago.The computer tried to fix my external again, and is stuck on stage 2 where it's progress in a very slow.write now the message I get is: Fixing (F:) Stage 2: 92% (372408 of 400908); Total 71% ETA 6:09:27..17 hours ago it was on 372108, so with this rate it will take months just to complete stage 2!what should I do??I would appreciate any help and\/or suggestions. I must add that loosing the files within the external hard drive is not an option, but not using the computer for about half a year is not desirable as well...My system is Windows 10Thank you in advance!","solutions":["Hi Guy It is not safe to stop a Disk Check in Stage 2, you could corrupt all data on that drive, it sill not take that length of time to check that disk, it has just stalled on a group of clusters and once it passes by that, the progress should get much faster . . . To be honest, when that completes, you need to backup that data somewhere, in case that drive is actually failing since you received the 'fatal hardware error' . . .The best option, when that drive comes back online is to backup that drive, then form inside Windows, format the drive and then restore the data onto that drive.If the format succeeds, then most likely that drive is okay, if not, it is time to think about purchasing another drive . . .","Hi Dave,Thank you for the extremely fast reply!Forgive me if the next might be a dumb question, as I never came a cross with such a fenomena before:How long a processing of this kind (fixing etc.) is considered normal?","Hi Guy For a 2TB drive, anywhere from 1 - 8 hours, so you have already exceeded that by a long stretch, once the process can get past that error area, it should gather pace and continue to completion a lot faster . . .","Got it, I guess I will just have to wait for the process to end.many thanks for your kind advice and help!","Hi Dave,since our last correspondence the computer added few more hundreds of cluster to the counting of stage 2, and now shows:Fixing (F:) Stage 2: 93% (372951 of 400908); Total 71% ETA 17:03:18..where before it showed:Fixing (F:) Stage 2: 92% (372408 of 400908); Total 71% ETA 6:09:27..it does show progress but I really need my computer. Isn't any way that I will be able to use my computer and that the process, that might take more days or even weeks,will work in the background?It is working for 44 hours already and though it shows painfully slow progress, its ending time may be in weeks from now :-(.What should I do?Thanks in advance,Guy.","Hi Guy Once that moves on from Stage 2, you can if you wish stop that process, it is just in Stage 1 and 2 you cannot safely stop that . . .","Thanks Dave,I would appreciate to understand what is the risk involved in stopping it.As I mentioned, it does not seem to complete stage 2 in the foreseeable future...If its okay, can you share with me what exactly does it do on stage 2?Maybe there is a point in time when its safer to stop then other. Say, when its counter goes up by one (just an example).I completely agree with you that the safest option is to let it finish, but it already finished once, where it took an hour or so and now it takes forever. If it could not fix in the first time - what are the chances it will now?What is the the chance of success anyway after so long a processing time?Sorry for the mass of questions, it just that the situation where windows denies you from the computer  as well as the disk is quite frustratingThanks again,Guy."]},{"symptom":"Windows 10 stuck in \"Undoing changes made to you computer\" restart loop        An update started about 24 hours ago and my PC is not stuck in undoing changes made to your computer. now it's only doing the update then restarting loop that I can access anything. I have tried to access safe mode with start-up, pressing f8 and nothing happens. I can access my mobo (Asus ROG) but nothing in there is letting me get to a point where I can get into the advanced repair or safe mode. I tried A USB with a windows installation on it only for that to not recognize the other log in needed. ","solutions":["Hi xHollowd Start your PC, just as Windows attempts to load (spinning dots), immediately press and hold Power Button for 5 - 10 seconds to perform a Hard Shut DownDo this twice On the third start Windows will boot into the Recovery Environment and from there you can access System Repair, Safe Mode, Command Prompt . . . etc.","Attempted this, hard restart when the spinning dots appeared, held down for 10 seconds. Tried this two different times and wasn't able to boot into the recovery environment. ","Hi xHollowd Were you unable to get into the Recovery Environment using the above steps? If so, what exactly happened when you tried that?","Yes, unable to get into the recovery environment. It went right to the spinning dots with \"undoing changes made to your computer\" scene after the initial spinning dots screne.","Hi xHollowd My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.If this is a desktop computer, I recommend you try resetting the BIOS: Try resetting your BIOS defaults: https:\/\/www.groovypost.com\/howto\/reset-pc-bios-...If that does not work and you have a desktop computer... Power down Unplug it Open the system unit Remove the CMOS CR-2032 chip Plug it in, start the machine, wait 10 seconds Power down, unplug it, reinstall the CMOS CR-2032 chip Plug it in again, power up Option 1 Go to another working computer, download then install Macrium Reflect Free and create bootable Rescue Flash Drive.Boot from it and click on 'fix windows boot problems' Make sure bios is set to uefi or legacy bios depending on how it was installed. See instructions how to download it: https:\/\/www.groovypost.com\/howto\/create-windows...See the section: Create Rescue Media Option 2 First of all, if you have any non-essential hardware attached to your computer apart from mouse and keyboard, disconnect them.See if the system boots successfully, if it does not, carry out the following stepsPower on and off your computer three times How do you do that? Power on, when you see the Windows Logo - power off Power on, when you see the Windows Logo - power off Power on, it will then your computer will boot into the Advanced Recovery environmentYou might be asked to sign in with your Microsoft Account or Local Account password.********************************************** Click Advanced Options Click Troubleshoot Click Advanced Options Click System Restore, see if you can go back to an earlier time. If not, boot into the recovery environment again, then try performing a startup repair.Perform the startup repair a couple more times then restart again to see if you are able to boot to the desktop successfully.If that does not work, boot into the recovery environment, then click 'Go back to previous version of Windows' - choose this option if you recently upgraded to a new Windows 10 Feature Update. If this option is not available, you can skip this step.Option 3 If that does not work. Power on and off your computer three times On the third time, your computer will boot into the Advanced Recovery environmentClick Advanced Options Click Troubleshoot Click Reset this PC Click Keep my files Choose your account Enter your password Click Continue Click Reset Option 4 Review the following guide for instructions and details about configuring your BIOS or UEFI boot settings for DVD, CD, USB or SD Card.BIOS\/UEFI Setup Guide: Boot from a CD, DVD, USB Drive or SD Card https:\/\/www.groovypost.com\/howto\/bios-uefi-setu...Once your computer is set to boot from the DVD or USB, you should see this option.The Windows logo will appear on screen, this might be here for a while, as long as you see the indicater, everything should be ok.Select your Language, Time and Keyboard method then click Next. Click Install now Setup will also prompt you to select the edition you have a license for - Home or Pro. Please make sure you choose the right edition. If you choose the wrong edition, your only option will be to perform a clean install again.The copy of Windows 10 you download and upgrade from will correspond with the edition of Windows you have installed, if it does not, this is why you might be experiencing problems activating:Windows 7 Starter, Home Basic, Home Premium, Windows 8.0 Core, Windows 8.1 Core should install Windows 10 HomeWindows 7 Professional, Windows 7 Ultimate, Windows 8.0 Pro, Windows 8.1 Pro should install Windows 10 ProIF YOU ARE NOT SURE WHICH EDITION YOUR SYSTEM CAME WITH, CHOOSE WINDOWS 10 HOME. Wait while Setup starts. Accept the license terms and click Next Click Custom Select the Primary Partition then click Next You will receive the following warning: The partition you selected might contain files from a previous Windows Installation. If it does, these files and folders will be moved to a folder named Windows.old. You will be able to access the information in Windows.old, but you will be able to use your previous version of Windows. Click OK Wait while Windows installs When this phase of setup is complete, Windows will automatically restart and reboot into setup again.Windows is detecting and installing your hardware. After this is complete, Windows will restart one last time.Out of Box Experience The Out of Box Experience page is where you get to configure detailed settings in Windows, which includes creating a user account, privacy, sync PC settings and install modern applications.Windows will check if there is an active Internet connection. If it does not find one, you will be presented with the following screen.Create a Local Account and click Next Wait while Windows finalizes your settings Continue to wait while Windows installs modern applications. When setup is complete you can retrieve any personal files from the Windows.old Browse to C:\\ Local Disk and open the Windows.old folder how to recover your files from Windows.old: https:\/\/answers.microsoft.com\/en-us\/windows\/for...","Wow! Your suggestion is both borderline ridiculous and extremely complex at the same time.If you really want to fix it, try booting to a recovery using a disc, USB or recovery OS on the device. You will probably need to get to a boot option for the latter from the device supplier.Truth is that Windows is intrusive with the updates, obviously seriously flawed, hence the constant need for updates and given that Microsoft regularly threatens to cease supporting even current versions, a thorn in the side of those of us forced to use it. To qualify that statement; I just threw away a dual boot device that was 'compelled' to perform yet another update for which there was insufficient available space, it therefore failed. Upon the recommendation of Microsoft I added an external 128GB USB, at which point it appeared to go ahead and perform the update - without my confirmation to do so. It failed, then for five hours I watched the screen display the 'undoing changes made to your computer' screen, for basically no reason (i.e. it didn't tell me anything had failed???) and then after numerous attempts to get out of it (it demands that the USB be reinserted to complete the process) it became all to clear that it simply wasn't doing anything.At this point, since I knew there was no way to resolve it so I opted to dispose of my $400 tablet!! Pity that Microsoft cannot be held liable for such loss.So in conclusion; Windows has progressively become the worst possible (and bloated) OS but we are forced to use it because Microsoft have made too many people dependent on it. Hopefully the day will come when Linux will be readily available as an alternative with as many developers utilizing its superior code as do Windows today.","Wow! Your suggestion is both borderline ridiculous and extremely complex at the same time.If you really want to fix it, try booting to a recovery using a disc, USB or recovery OS on the device. You will probably need to get to a boot option for the latter from the device supplier.Truth is that Windows is intrusive with the updates, obviously seriously flawed, hence the constant need for updates and given that Microsoft regularly threatens to cease supporting even current versions, a thorn in the side of those of us forced to use it. To qualify that statement; I just threw away a dual boot device that was 'compelled' to perform yet another update for which there was insufficient available space, it therefore failed. Upon the recommendation of Microsoft I added an external 128GB USB, at which point it appeared to go ahead and perform the update - without my confirmation to do so. It failed, then for five hours I watched the screen display the 'undoing changes made to your computer' screen, for basically no reason (i.e. it didn't tell me anything had failed???) and then after numerous attempts to get out of it (it demands that the USB be reinserted to complete the process) it became all to clear that it simply wasn't doing anything.At this point, since I knew there was no way to resolve it so I opted to dispose of my $400 tablet!! Pity that Microsoft cannot be held liable for such loss.So in conclusion; Windows has progressively become the worst possible (and bloated) OS but we are forced to use it because Microsoft have made too many people dependent on it. Hopefully the day will come when Linux will be readily available as an alternative with as many developers utilizing its superior code as do Windows today.That is the EXACT problem I have. My disk was too small. Tried to delete EVERYTHING but still too small. It's just a lonovo Yoga PC I'm using for netflix. Excellent... But I had to try with external storage. First a disk. After a while it managed to do a rollback. Then I tried with a USB stick, and now it's stuck on \"undoing changes made to your computer\". I have tried 1000 different things, but I cannot get it out of this state. It will reboot from time to time and go back into the same black screen with this text. I'm so annoyed! I use this computer many many time a day. And I've avoided the update for a loooong time, but now it was bugging me daily. And the only result is that it has destroyed my computer??? It's the latest feature update. I'm really not very happy about this...","I have an HP laptop and I have partially gotten around this by holding F9 during bootup to go into boot options and redo the recovery from USB drive.          Of course, this will probably go back into the loop if I try to upgrade to 1903 again, but at least it will buy some time for me to use my computer while I figure out a way to upgrade in the future - if ever.","Hi xHollowd My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.If this is a desktop computer, I recommend you try resetting the BIOS: Try resetting your BIOS defaults: https:\/\/www.groovypost.com\/howto\/reset-pc-bios-...If that does not work and you have a desktop computer... Power down Unplug it Open the system unit Remove the CMOS CR-2032 chip Plug it in, start the machine, wait 10 seconds Power down, unplug it, reinstall the CMOS CR-2032 chip Plug it in again, power up Option 1 Go to another working computer, download then install Macrium Reflect Free and create bootable Rescue Flash Drive.Boot from it and click on 'fix windows boot problems' Make sure bios is set to uefi or legacy bios depending on how it was installed. See instructions how to download it: https:\/\/www.groovypost.com\/howto\/create-windows...See the section: Create Rescue Media Option 2 First of all, if you have any non-essential hardware attached to your computer apart from mouse and keyboard, disconnect them.See if the system boots successfully, if it does not, carry out the following stepsPower on and off your computer three times How do you do that? Power on, when you see the Windows Logo - power off Power on, when you see the Windows Logo - power off Power on, it will then your computer will boot into the Advanced Recovery environmentYou might be asked to sign in with your Microsoft Account or Local Account password.********************************************** Click Advanced Options Click Troubleshoot Click Advanced Options Click System Restore, see if you can go back to an earlier time. If not, boot into the recovery environment again, then try performing a startup repair.Perform the startup repair a couple more times then restart again to see if you are able to boot to the desktop successfully.If that does not work, boot into the recovery environment, then click 'Go back to previous version of Windows' - choose this option if you recently upgraded to a new Windows 10 Feature Update. If this option is not available, you can skip this step.Option 3 If that does not work. Power on and off your computer three times On the third time, your computer will boot into the Advanced Recovery environmentClick Advanced Options Click Troubleshoot Click Reset this PC Click Keep my files Choose your account Enter your password Click Continue Click Reset Option 4 Review the following guide for instructions and details about configuring your BIOS or UEFI boot settings for DVD, CD, USB or SD Card.BIOS\/UEFI Setup Guide: Boot from a CD, DVD, USB Drive or SD Card https:\/\/www.groovypost.com\/howto\/bios-uefi-setu...Once your computer is set to boot from the DVD or USB, you should see this option.The Windows logo will appear on screen, this might be here for a while, as long as you see the indicater, everything should be ok.Select your Language, Time and Keyboard method then click Next. Click Install now Setup will also prompt you to select the edition you have a license for - Home or Pro. Please make sure you choose the right edition. If you choose the wrong edition, your only option will be to perform a clean install again.The copy of Windows 10 you download and upgrade from will correspond with the edition of Windows you have installed, if it does not, this is why you might be experiencing problems activating:Windows 7 Starter, Home Basic, Home Premium, Windows 8.0 Core, Windows 8.1 Core should install Windows 10 HomeWindows 7 Professional, Windows 7 Ultimate, Windows 8.0 Pro, Windows 8.1 Pro should install Windows 10 ProIF YOU ARE NOT SURE WHICH EDITION YOUR SYSTEM CAME WITH, CHOOSE WINDOWS 10 HOME. Wait while Setup starts. Accept the license terms and click Next Click Custom Select the Primary Partition then click Next You will receive the following warning: The partition you selected might contain files from a previous Windows Installation. If it does, these files and folders will be moved to a folder named Windows.old. You will be able to access the information in Windows.old, but you will be able to use your previous version of Windows. Click OK Wait while Windows installs When this phase of setup is complete, Windows will automatically restart and reboot into setup again.Windows is detecting and installing your hardware. After this is complete, Windows will restart one last time.Out of Box Experience The Out of Box Experience page is where you get to configure detailed settings in Windows, which includes creating a user account, privacy, sync PC settings and install modern applications.Windows will check if there is an active Internet connection. If it does not find one, you will be presented with the following screen.Create a Local Account and click Next Wait while Windows finalizes your settings Continue to wait while Windows installs modern applications. When setup is complete you can retrieve any personal files from the Windows.old Browse to C:\\ Local Disk and open the Windows.old folder how to recover your files from Windows.old: https:\/\/answers.microsoft.com\/en-us\/windows\/for...Thanks Andre Da Costa for your help but i want to tell you that there is a confusion in my mind that if i reset my bios will it harm my pc ?","Man i have a lenovo and didn't working to me.Please help"]},{"symptom":"LiveKernelEvent 141 - Hardware failure?!        Hi everyone! If anyone has any idea of the issue troubling me, please reply. My laptop froze completely when I was streaming videos on google chrome. It was running on battery, and using the silent power mode (tones down the fan speed and clock speeds to save battery obviously). I use an Asus Tuf fx505du. I promptly checked Reliability History and here is the message that it gave me:DescriptionA problem with your hardware caused Windows to stop working correctly.Problem signatureProblem Event Name: LiveKernelEventCode: 141Parameter 1: ffffd7865c392460Parameter 2: fffff802178f09f0Parameter 3: 0Parameter 4: 4410OS version: 10_0_17763Service Pack: 0_0Product: 768_1OS Version: 10.0.17763.2.0.0.768.100Locale ID: 3081Extra information about the problemBucket ID: rejected_by_ruleServer information: ac54f250-5a87-4376-8cb0-08ab3949d204All my graphics drivers for the AMD integrated graphics and the Nvidia discrete graphics chip have just been removed and reinstalled to the most updated version the day before due to previous BSOD issues: VIDEO_SCHEDULER_INTERNAL_ERROR and DEVICE_POWER_STATE_FAILURE. Thanks in advance.","solutions":["Hello MikaKusuma, I am Andrew an independent advisor. When you updated your graphics driver did you update via Windows or the vendor? Typically the vendors driver is best to use, if you used Microsoft provided drivers please go to the makers website and download their specific driver. If when reinstalling the drivers this time around you did use the vendors drivers then run these scans to completion.In the search bar, type cmd. Right-click on cmd.exe and select Run as Administrator. Type SFC \/scannow and press the Enter key. Re-enter Command Prompt as Administrator and run these: dism.exe \/online \/cleanup-image \/scanhealth dism.exe \/online \/cleanup-image \/restorehealth dism.exe \/online \/cleanup-image \/startcomponentcleanup Complete all these and let us know if the problem persists. Take Care, Andrew","Hello, sorry for not responding. I did reinstall the drivers using the vendors software, in this case nvidias. But freezes still happen every so often, this being one of them in addition to the 141 and 142 LiveKernelEvents:DescriptionA problem with your hardware caused Windows to stop working correctly.Problem signatureProblem Event Name: LiveKernelEventCode: 193Parameter 1: 810Parameter 2: 0Parameter 3: 0Parameter 4: 0OS version: 10_0_18363Service Pack: 0_0Product: 768_1OS Version: 10.0.18363.2.0.0.768.100Locale ID: 3081Extra information about the problemBucket ID: LKD_0x193_DxgkrnlLiveDump:810__dxgkrnl!DxgCreateLiveDumpWithWdLogsServer information: 95d177bd-e2b5-44f5-b825-921aa17ea25dI'm lost. Would the best course of action be to reset the laptop and run a clean windows install? "]},{"symptom":"black screen        HelloI have a problem with the system, which is when I turn on the laptop, the device works, but the screen becomes black and the device remains like this. I did a repair but did not help. Whenever I turned off the device, I got the black screen, I tried to reinstall Windows (Windows 10 and the activation key is original) but did not work (knowing I downloaded it from the company and burned it on usb) and sometimes it shows me an error (SrtTrail.txt) knowing that I tried to update the system but it shows me the same errorI updated it and had to reinstall Windows even though my devicespecifications are the followingProcessor: intel(R)core(TM)i3-2350MRAM:8GB64bit","solutions":[]},{"symptom":"Getting rid of irritating new File Explorer feature        I have been using versions of Windows for many years. Recently Windows to appears to have introduced a new feature in File Explorer which I find quite irritating. It concerns the way the contents of folders are displayed.When opening a folder in File Explorer there have been for years different ways of viewing the contents such as seeing icons, list, or details and to sort them by name, date, type etc. I'm very happy with those options. But a new additional way of displaying has been recently introduced which I find quite irritating. It groups the files bytoday, last day, last week, last month, etc. I find this grouping completely useless and makes finding individual files more difficult for me. Unfortunately I cannot find any way of getting rid of this irritating grouping and putting all the files back together into a single group and then displaying it as has traditionally been done. I can then display them using the the other options which have been available for many years.Can someone please tell me how to do this so I no longer see this useless today, last day, last week, last month, etc grouping of files in my File Explorer?","solutions":["Hi Wob Please see that 'Group By' button indicated on your screenshot below . . . ."]},{"symptom":"a folder on local network has got no security tab and content that i make there is only seen by me        helloi have one folder on the network that has got no security tab.i can make a subfolder with content there, but this is only seen from my workstation.other workers can´t see it.the content that i make inside the folder is flaged in the \"detail\" tab in the \"file\" area :-availability: available-offlinestatus: offline (synchronization necessary)-approved for user: EMPTY!!it must have something to do with the workstation, not with the logged user on this workstation !where and how can i handle this, where is this restricted?thanks a lot for help !tomes","solutions":["anyone from tech support around?thanks a lot for help!","another three days later and no sign of support.","i remember while writing the first post it showed me that it´s mostly about 3 minutes to get response  ;-))","3 weeks over...anyone from microsoft around?  ...too complicated my question?"]},{"symptom":"Copier for ARM Processor        Can someone recommend the correct driver for a copier? The driver must work with a ARM Processor that comes with a Surface Pro X.We currently have KYOCERA and we need color and black\/white.  The drivers we currently use will not work with the ARM processor.Thank you.","solutions":["Hi MIke Please provide the exact Model No. of that Kyocera Copier\/Printer . . .","Hi MIke Please provide the exact Model No. of that Kyocera Copier\/Printer . . . We have kyocera ecosys m6635cidn.The software and drivers we normally use for Windows 10 will not load on a Windows 10 machine that has the ARM processor, which the Surface Pro X have.Thank  you.","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. These are the Universal Drivers: https:\/\/cdn.kyostatics.net\/dlc\/be\/driver\/all\/kx...https:\/\/cdn.kyostatics.net\/dlc\/be\/driver\/all\/cl...","Thank you.","You're welcome.","Just a note that I tried both links you sent me and they do not work. It will not recognize the OEM file.","I found this Software CD from their website. Please try this one. https:\/\/cdn.kyostatics.net\/dlc\/be\/utility\/all\/n..."]},{"symptom":"External HDD Issues        I was given a 3TB hard drive that I am wanting to use for my son's PS4 as extra storage. In order to do so I need to format it to exFat. When I try to do that with my laptop it only shows 349GB as the size. I am trying to use Diskpart to determine if it is a \"read-only\" issue, or if I messed it up when I deleted the files that were on it, or if my laptop is unable to support that large of a HDD. I'm not sure. However, when I enter \"list disk\" in diskpart it shows the full capacity of the HDD (2794GB) and it shows how much is Free (1698GB). I select the disk and then enter \"list volume\" in diskpart and it shows the volume. It lists the size as 349GB the status as Healthy the File System as NTFS (which I need to format to exFat) and the type of volume as a Patition. I select the volume and enter \"detail disk\" in diskpart and it shows that it's not \"read-only\". So what gives? Will I be able to format this HDD or am I doing something wrong? Please Help! I'm running out of troubleshooting ideas. I'm kind of leaning toward the idea that maybe my PC can't support a 3TB HDD, so it is only showing what the system can support. All I want to do is format the drive to an exFat file system and have the full 3TB available for storage. Can someone please explain how I can do this in diskpart or using some other method?","solutions":["Hi Bonifus, seems your disk was initialized as MBR. Please check this using diskpart. Than convert it to GPT or clean it and reinitialize.","Or try to format it with PS4 = https:\/\/www.playstation.com\/ru-ru\/get-help\/help...","What you need to do is to partition the disk into a number of smaller drives.","What I ended up doing was using diskpart to delete the volume that I was seeing as a small portion of what was available on the drive. Then I deleted the rest of the drive including all partitions and volumes. Then I formatted the drive with a single volume and a single partition (formatting it with a fs exFat to be able to be used on a PS4 as an external drive). Thanks for your comment, but I was able to figure it out after a little research and now it shows the right amount of storage available, I currently have it fully operational as an external drive for the PS4","It was initialized as GPT but I was only seeing one volume. I completely formatted the disk after deleting the volume I was seeing and I set it up with one volume and one partition opening up the complete storage possibilities."]},{"symptom":"Performance Issue Windows 10 using Google Chrome        When I open SOME websites, the screen\/website will be working fine, then suddenly it gets a grey fog over it and nothing on that website will work. I tried hitting the RELOAD icon, and that clears it for a minute but then the fog rolls in.  I've run Full Virus Scans with McAffee and Defender, but nothing helps.  What's wrong & how do I fix it?I tried to access Chase Online Banking via Internet Explorer, but a banner popped up and said that either Chase would not be supporting IE, or IE would not be supporting Chase Bank, after a certain date.  But when I tried to sign into Chase, none of the data entry areas functioned properly.  What do I do?Duane Beach-Barrow*** Email address is removed for privacy ***","solutions":["Hi Duane. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.The problem could be McAfee which is the worst thing you can install to Windows and the cause of many problems we see in forums. I would uninstall any 3rd party antivirus in Settings > Apps > Apps & Features and try running only built-in Defender which gives adequate protection, best Windows performance, least issues, and is from Microsoft who knows how to protect their OS best.After uninstalling antivirus in Settings > Apps > Apps & Features, restart the PC, then type Security in Start Search, open Windows Defender Settings, there and in Windows Defender Security Center fix anything that's flagged.If you want the best on-demand scanner download and install Malwarebytes from https:\/\/www.malwarebytes.com\/mwb-download\/ In it's Settings > Protection > Scan Options enable Scan for Rootkits. Then on Scan tab choose Threat Scan and Run Scan. Clean up anything found, restart PC and then run again until it comes up clean. If you want to keep Malwarebytes as an on-demand scanner then you can disable its Real Time trial version in it's Settings > Accounts tab.Next check for damaged System Files: https:\/\/www.lifewire.com\/how-to-use-sfc-scannow... If it cannot repair them see Step 10 here to continue: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Try another browser. I would have several browsers on your task bar so there's always one that's best for the task. I use Firefox, Edge and Chrome in that order of preference. It's easy to share bookmarks between all of them in their settings under Import Favorites from another Browser. Set the preferred one as Default in Settings > Apps > Default Apps.Next reset the browser as shown here: https:\/\/www.howtogeek.com\/171924\/how-to-reset-y...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","The grey fog is actually part of an overlay.An overlay is additional content that is displayed on top of the web page you are viewing. In order to make the overlay stand out from the web page underneath - to force you to look at it - the overlay covers your screen with a 'grey fog.' It's not a virus - that's just how overlays work. It's actually part of the web page, part of the page's CSS code. The fog is called dimming.Overlays are frequently used when a website wants you to subscribe, or a retailer wants you to join its mailing list. They can be annoying, in my opinion, because they obstruct what you are trying to read and force you to click on an artfully hidden 'X' in order to dismiss them.In the case of a bank like Chase, the overlay will typically be some type of credit card offer or other 'special deal' that they're trying to sell you. I get the same thing from CitiBank and Bank of America.You probably have some type of pop-up blocker installed, because pop-up blockers are very common. There is a pop-up blocker in Chrome's settings, or you might have a browser extension like AdBlock Plus or uOrigin, or it might be a feature of your McAfee software (which has a good reputation among the organizations that test antivirus software professionally.) Your pop-up blocker is successfully blocking the overlay, but not the grey fog covering the web page. This too is common, because there are so many ways that an overlay can be implemented, all the more to compel you to look at it.Where you go from here depends on how you are blocking pop-ups. Here's a low-hanging-fruit solution you can try: pressing the ESC key will often return the normal web page. Ultimately, the solution is for your pop-up blocker to block the grey fog together with the overlay, but that's tricky to do in practice. Websites do their best to force us to interact with the overlay, and actively fight pop-up blockers. Ad blocking extensions and Chrome itself can be customized for individual websites, so you can explore that too.(Sorry, no vain boasts of expertise from me.)"]},{"symptom":"Surface Pro4 and downloads        My Surface Pro4 was substituted with a new one.  It prompted me to update Windows 10. The update took over 12 hours! Downloading Apps, video and photos also takes unusually long time. Is this something to do with my new device?  It was never a case with the previous one!","solutions":["Hi, Eugene My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps: Press the Start key and type the word CMD or Powershell, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanu p-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/929833...","Hi, Eugene My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps: Press the Start key and type the word CMD or Powershell, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanu p-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/929833...Dear Jeffrey,Thank you for help. Only the first and the last lines of commands worked. The first ont came with the result: \"No component store corruption detected. The operation completed successfully.\"Second and third commands had shown Error 87.The last one - sfc\/scannow:  ran 100% and informed that the corruped files were detected and successfully repaired.I hope that smth was still done and the sestem will work better.Kind regards,Eugene"]},{"symptom":"Xbox One controller not detected after restart        Hi,I started having problems with detecting my Xbox One controller connected via USB on Windows 10 after updating it to 4.8.1923.0 via the Xbox accessories application from 3 something (received upon purchase about 2 years ago). It started exactly after that and I tried resetting the application as described in https:\/\/answers.microsoft.com\/en-us\/xbox\/forum\/all\/solved-wired-xbox-one-controller-for-pc-wont-be\/c8c2bcf9-c458-4e89-86d4-62927ca2fc74?page=2. Does anyone have any other suggestions? Would uninstalling the application help? I installed it for the first time when I did the update.Br.Lukasz","solutions":["Hello LUCASSHARPMAN, I am Andrew an independent advisor. Yes you are spot on, uninstalling the application just might do the trick.Take it out and let us know how it goes.Take care","Hello LUCASSHARPMAN, I am Andrew an independent advisor. Yes you are spot on, uninstalling the application just might do the trick.Take it out and let us know how it goes.Take care Hi,Thank you for the advice, but it did not help. I have uninstalled the application and reconnected the controller so that it is active, but it also stayed inactive after restart. Maybe the firmware update requires it to be reconnected each time, but that would be very inconvenient ..","Are you seeing the controller in Settings>Devices?","Are you seeing the controller in Settings>Devices? Yes, but it is only visible as \"Controller\". I tried disabling the turn off this device to save power (or similar) settings in the device manager, but it did not help.","How about Windows. Are you updated to version 1909? You can type winver in the search bar to find out quickly. If not please update to that version.","How about Windows. Are you updated to version 1909? You can type winver in the search bar to find out quickly. If not please update to that version.I have an important update. After some testing I found out that after the firmware update the controller is just turned off, which is a new feature. After holding the big white X button it turned on. I tried it both with and without the Xbox accessories application and it worked in both cases. It would be goo to have it in the update log, but I did not get any information about the update. Either way the problem is solved.","Fantastic news Lucas. I did not know about this firmware update. Take care and happy gaming, Andrew"]},{"symptom":"I cant access device manager and i dont know why        I just get this whenever i try.","solutions":["Hi, Whangam My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps: Press the Start key and type the word CMD or Powershell, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanu p-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/929833...","Thank you for your help Jeff, anytime I try the first command, cmd stops working, it wont even let me type anything anymore. ","Here's how I get to Device Manager:Control Panel > Administrative Tools > Computer Management (double click) > Device Manager","What version of Windows do you have, I recommend updating Windows to version 1909https:\/\/support.microsoft.com\/en-us\/help\/402766..."]},{"symptom":"I cannot create a file folder anywhere        I lost the functionality to create a new folder.","solutions":["Hi Robert and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.1. Perform SFC & DISM Method. https:\/\/support.microsoft.com\/en-ph\/help\/929833...2. Other troubleshooting steps. https:\/\/www.thewindowsclub.com\/cannot-create-a-...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I lost the functionality to create a new folder. Can you create a folder inside this folder:C:\\Users\\your user account name\\Documents","An image of where you are unable to create a new folder would help. What program, app etc. will not allow you to create a new folder. I have Windows 10 with all updates and I don't have a problem creating new folders. See example image below."]},{"symptom":"No internet , secured but i have Internet. I can't update windows or download from microsoft store.        Happy New Year. Yesterday I was asked by pc to restore windows, from cd i reinstalled ipod 10, keeping my settings and files. It started normally but has the following problem: although I have internet e.g. from the edge and from chrome i see web pages or i can download some program, the taskbar indicator is no internet, secured. The result is that the pc doesn't update, I can't download anything from the microsoft store (it gets my pur-authenticationfailure), and while later I bought from microsoft the office 2019 pro which was installed properly, no applications open for me because it says you are not connected to the internet, which as i said i am normal e.g. i downloaded the office from microsoft site. In the windows mail client I set up my gmail but I could not set up my hotmail account. I've tried dozens of tricks I found online but nothing. I believe that there is a problem with my account and I warmly ask for help. Thanks.","solutions":["Hi, NikolaosKalliopitsas My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.If you have problems updating Windows, follow these steps: If you have a third-party antivirus, you must disable or uninstall it. Try reset Windows update components: Right click on the start button and select Powershell (admin) or Command Prompt (admin)Write the next hit enter after each line. net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Restart and try again. You can also download the Windows Error Solver: https:\/\/support.microsoft.com\/en-us\/help\/10164\/...https:\/\/aka.ms\/wudiag You can do it manually by downloading the Windows ISO. When updating with the ISO, disconnect the Internet. https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/answers.microsoft.com\/en-us\/windows\/for...","Hi,  JeffreyCloutierThank you for your immediate answer. I tried the cmd commands that you suggested  and then i tried the Windows Error Solver, but both with no result. I am not sure if the windows  let me do even a new clean installation. But this is what i have to do last, after trying to update to November update, again.If this succeeded i will let you know. Thanks for your try. ","Glad to Help!","Hi again Jeffrey Cloutier I try MediaCreationTool1909 but it seems that nothing is downloading, it is stacked to 0%.Everything that is about Microsoft and internet is not working, everything else does. except from a game launcher that also doesn't start. It seems that i am locked out for some reason from Microsoft account.Anyway thank you again. ","Try to follow these steps to repair your Internet connections: Enter the Start menu or by pressing the Win + I key combination, open the Settings and click on the Network and Internet option. Once there, we select the Status option from the menu on the left side and, within the configurations and options that are loaded in the right panel, we have to look for the restoration of the network. When you click on this option, it will show us a new window from where we can restore the network in Windows 10. In this way, all network adapters will be removed and reinstalled, and the original configuration of other network components will be restored. net. This implies that if we were using some software, such as a VPN client or virtual switches, we will have to reinstall them.A process that the system performs automatically by clicking on the Reset button that is now displayed in Network Reset in Windows 10 settings. It is normal for the process to not take long, although we must wait until the end completely and restart the computer to continue with the network configuration in Windows 10 as we have done so far.https:\/\/www.kapilarya.com\/how-to-reset-network-...https:\/\/support.microsoft.com\/en-us\/help\/10741\/...You can also check that your drivers are updated. https:\/\/support.microsoft.com\/en-us\/help\/402844...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi Jeffrey Cloutier I manage to solve the problem with a clean windows installation (the one that keeps my files didn't work).Thank you for your help.Nikos ","I'm glad you could solve the problem"]},{"symptom":"Auto backups in Word        Is there any option to specify where the backup is created? Thank you.","solutions":["Hi Adilel, my name is Martin and I'm an Independent Advisor. I'll try to help you here.I suggest that you refer to the link below. It provides information about automatically save Word documents. Written by Graham Mayorhttps:\/\/www.gmayor.com\/automatically_backup.htmNote: my post has a URL link to a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","File > Options > Save > Save documents > AutoRecover file location"]}]}