{"windows":[{"symptom":"Microsoft Account        HiI have a Microsoft account and there are apparently parental permissions on my account. This should not be. I have searched on how to remove the parental permission but have had no luck. I am setting up my new computer and am unable to access any of the programs\/apps that i need for my studies.","solutions":["Hi adventur711 This may be due to the age being set incorrectly on your Microsoft Account . . . https:\/\/support.microsoft.com\/en-us\/help\/12411\/...","In your Microsoft account what date of birth do you have, is it correct and does that make you an adult in your location. (you don't need to quote the D.O.B. just check make sure it's correct)"]},{"symptom":"scanner        I have the printer set-up but need the scanner component to work.  ","solutions":["Hi VickyRinehart and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.Could you provide some further detail such as the Printer Scanner model no? So you can be assisted further?Thank you!"]},{"symptom":"Why does my computer no longer connect to free wifi?        My computer used to automatically connect when I opened my wifi at participating Starbucks and other free WiFi spots. Now it will not. * Moved from IE (other)\/Windows (other)","solutions":["My computer used to automatically connect when I opened my wifi at participating Starbucks and other free WiFi spots. Now it will not. -  -Which version of Windows? Don","Windows 10","Windows 10- -OK. I've moved your thread to Windows 10. Don"]},{"symptom":"Panasonic Toughbook, Wi-Fi and Win10        I have the Panasonic CF-52 laptop that has the wifi switch.   When logging in from boot or sleep even though the Intel 6200 wifi card is on at the switch Win10 would show the wifi as off.  This required turning the switch off and then back to on to get the wifi up and running again.  I tried the numerous items people have listed on the Internet for the general problem of wifi not coming on in Win10.  However, these old Toughbook laptops came with a Panasonic Wireless Switch Utility.  It can be found on the Internet.  This was the solution to my problem.  Install in compatibility mode.  I don't know what setting the utility is changing.  I just know it works without any input except to install.  It starts at boot in the background.  At a minimum, the wifi switch itself is not compatible with Win10.","solutions":[]},{"symptom":"Laptop won't charge when Windows 10 is running.        It begins charging immediately when Windows is shut down.  This has been happening for several months now.  Suggestions found on Web don't help. New battery made no difference.  Wondering if caused by something in Windows update.","solutions":["Hi Shel488 Open Device Manager (accessible by right clicking your Start Button) Expand the Batteries section For each device in that section: Right click and choose Uninstall Shut your laptop down Disconnect the power adapter If you can, remove the battery from your laptop Press and hold the Power button on your laptop for 30 seconds Re-insert the battery, if you removed it Re-connect the power adapter Turn on your laptop Check if your battery is charging . .."]},{"symptom":"Nothing will install.                Whenever I download something, for example, Minecraft, it says, \"It looks like you don't have any applicable devices connected to your Microsoft account.  To install, sign in on a device with your Microsoft account.\" I did so. I tried to install again after and it still didn't work. What do I do? ","solutions":["Hi STRIKEAT5, Click your Start Button, type winver and hit Enter On the resulting dialog, what Version No. and build No. of Windows 10 are you running?","                  I dont know how to check.","Hi STRIKEAT5 Click your Start Button in Window Then without doing anything else, type winver and hit Enter On the resulting dialog you will see your version and build No. .","Version 1903, Build 18362.535","Click the link below, then click 'Update Now' on that page to immediately get 1909 and bring your PC right up to datehttps:\/\/www.microsoft.com\/en-us\/software-downlo..."," i tried twice and it says, lsomething went wrong\""]},{"symptom":"the Microsoft visual c++ is taking up 133,78 megabytes          the title speaks for itself the Microsoft visual c++ is taking up 133,78 megabytes of storage is there some way I could make it a bit less?","solutions":["Hello ErikBrownlie, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemHave you seen this in Windows Program and Feature? usually it consume around 20 mg,you can always uninstall and reinstall ms c++ last version from this link: https:\/\/support.microsoft.com\/en-us\/help\/2977003Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolvedCheers! Farah"]},{"symptom":"Black screen after lock screen        Turn on computer and the lock screen appears (random photos with trivia).  Any mouse click brings up a black screen with the mouse pointer, nothing else displayed.  The mouse pointer moves with the mouse, but the login screen never appears.  Tried ctrl-alt-del and ctrl-shift-esc with no change to the screen.  There is no power icon or anything else displayed on the black screen and only a network icon on the lock screen.  How do I get my computer back?","solutions":["Hi, Jkuas My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Windows Update Error 80092004        We had four severs running Server 2k8 SP2 that were all failing in installing Windows Update KB4512499, 4517301.  So we installed patch 4474419, 4490628.  This fixed two of the servers but the other 2 are still failing to install those updates with error code 80092004 which is the same error on all four servers.  Not sure what to do next.","solutions":["Hi,Server and IT Pro questions are best handled on our sister Site Technet as this is only a Windows consumer only forum:https:\/\/social.technet.microsoft.com\/ForumsPlease choose the most appropriate category on Technet forums from the left."]},{"symptom":"Photos App Skips Random Photos in Slideshow Mode        I have recently experienced a problem with Windows 10 Photos App skipping random photos, or groups of photos, when in Slideshow mode. The same photos are also skipped if you manually work your way through the folder photo by photo using the next\/previous arrows. If you open each of the offending photos individually in the app, you will note that they do not have next\/previous arrows, which suggests, maybe, that the app doesn't know they exist.In case anybody else has experienced this, after some experimentation, I have found that one fix (there may be others) is to cut and paste the offending photos from their folder to another location – the desktop for instance – and then cut and paste them back to their original folder. Next time you run the slideshow function or manually work your way through the folder photo by photo, the photos will not be skipped. Furthermore, opening each of the offending photos individually in the app, you will see that their next\/previous arrows have been restored.It's obviously a bug in the app and I have no idea why this fix works, and to be blunt, it's a pain in the butt, especially if you have a large number of photos which get skipped, but at least it may give the techies out there a clue as to what is going wrong in the first place. Let's hope for an app update soon.Mike","solutions":["When looking in Folders, Some pictures open and other are Mountains= do not open.Indeed Photos App Skips Randomly Photos inside folders.Solution: CUT Folder from Documents AND PASTE TO Pictures AND after a while,CUT from Pictures AND PASTE back to Documents."]},{"symptom":"Windows 10 PC Refuses to Enter Sleep Mode        When I try to put my computer into sleep mode it won't even be a second before it wakes right back up again. There is no issue shutting down.I had this problem earlier, it was caused by my Ethernet connection waking up my computer whenever there's an internet connection (which is all the time.) I fixed it and it worked...for a few days. Now the problem is back and I don't know what's wrong now. ","solutions":["Hello TallBoyOfGravy! My name is Marco, I am an Independent Advisor. I will do my best to help you.If you say your network card has already caused this problem, try this Right click on Start windows button Click on DEVICE MANAGER Find the name of your network card Double click on it and go on the \"power management \" tab. Then uncheck the boxes as in the photo below Tell me if it worked. Marco","I have followed your instructions, unfortunately the problem persists. ","Hi TBOG> I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I will give you all possible fixes for Sleep. If you need help performing any step just ask back:First confirm you have the Sleep options configured correctly as shown here: https:\/\/www.tenforums.com\/tutorials\/2843-change....You might want to try Hibernate to succeed Sleep, or use Hibernate in place of Sleep - it's just a deeper sleep that actually powers off because desktop stored in RAM during sleep is written to hard drive hiberfile then powered off.Most Sleep problems are caused by the Display driver, so try updating yours from the PC or Device maker's Support Downloads web page for your full model number, Serial Number or Dell Service tag. While there make sure you have the latest BIOS, Chipset, Network, Sound, USB and all other drivers by comparing those posted for download with the version and date of the corresponding ones in the Device Manager.If that doesn't help then in Device Manager on Display device Driver tab choose Roll back, Uninstall (then restart to reinstall) or try another one previously installed at Device Manager>Display adapter>Driver>Update Driver>Browse>Let me pick.In addition there are steps here to specifically troubleshoot Sleep mode problems:http:\/\/www.makeuseof.com\/tag\/fix-windows-10-sle... What I do is go into Advanced Power options and set Display and Sleep to 1 minutes, Hibernate to 2 minutes, then after completing each step restart the PC and observe what happens for 3 minutes.Also did it previously work? Do you have a System Restore point from when it did?http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t...This may have been caused by Windows Updates. Check which Updates were installed right before the problem began, and if necessary uninstall them from Settings > Update & Security > Windows Update > Installed Update History.You can also try to roll back using System Restore to a point before this began: http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... Then if an Update reinstalls and causes the same problem uninstall or roll it back again, then immediately hide it using the Hide Updates tool from Method Two here:https:\/\/www.askvg.com\/fixing-windows-10-automat... If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1903 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Gravy,Type in regedit on the Windows search bar to enter the registry editor:Go to HKEY_LOCAL_MACHINE\\System\\Currentcontrolset\\Session Manger\\Power\\AwayModeEnableChange the value of AwayModeEnable to 0Close the registry editor. See if your problem still exists? Alternatively, create a TXT file on the desktop.Open it and type:Windows Registry Editor Version 5.00[HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Session Manager\\Power]\"AwayModeEnabled\"=dword:00000000Save the txt file as XXX.Reg.Change the save file type to all types. Click saveOpen the newly created Reg file and click yes when it reminds you that the file will run as administrator.","I updated my graphic card's driver, but that didn't not help. ","Regarding HKEY_LOCAL_MACHINE\\System\\Currentcontrolset\\ I don't see the Session Manager listed under it. ","OK, then continue with the steps given including those in the tutorials. Please do not skip any steps. We often find out later that the fix was the skipped step. If you need help performing any step I will help.","Thanks for letting me know.HKEY_LOCAL_MACHINE\\System\\Currentcontrolset\\Control\\Session Manger\\Power\\AwayModeEnableI left out Control between Currentcontrolst and Session Manager.","There's no AwayModeEnable."]},{"symptom":"Surface Pro - Using Reset Option but Windows doesnt recognise the Admin password        Hi, My Surface Pro has been giving me a lot of problem. It has now stopped booting. I just get an error \"There was a problem starting windows and we will restart\" and then it doesn't even try to restart but shuts down. I am in to the recovery section, to use the recovery option, put in the bit-locker key and then select my admin account. Windows asks for password which i provide because that is exactly what i have used to get my bit-locker key and it says password is incorrect. It is mind boggling as i update my password every few months. I have used all the previous old passwords and i am stuck right now. I don't want to lose any data but i cant seem to get past the admin account password. I can get a USB windows installation to start but i don't want to use it in fear of losing the data. Any guidance would be appreciated. Thanks.","solutions":["Hi, H4S33B My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to enter the safe mode with the network function to repair, it may be that the network controller is outdated.Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. As soon as you see the Windows logo with the rotating dots, press and hold the power button until the computer turns off. Do this process twice..-Turn on your computer for the third time, and let it load. .-You should receive this message: Preparing Automatic Repair. After entering Mode Update the network driver may be outdated","HI Jeffery, Thank you for your response. I have tried this and it takes me back to the password scenario in each case. I tired booting in Safe Mode with Networking and it failed and tried all the other options as well. Reset options are what i need but in that case, i end up getting stuck on the password bit. ","You can change the password from another device, if it is a Microsoft account, click on the link below to reset your password and follow the instructions:https:\/\/account.live.com\/password\/reset","Thanks, Jeffery. I will try that and see how it goes. ","Glad to Help!","It didn't work. I still get the same message. The updated password has updated across all my devices but not surface restore settings.","I recommend you look for another computer to create a USB and repair Windowshttps:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Window 10 \"People App\" displays \"Call with your Phone\" option, but doesn't seem to work.        Window 10 \"People App\" displays \"Call with your Phone\" option next to a persons phone number, when selected, it takes me to \"Your Phone\" window, but doesn't dial or call the number on Android phone.  Is this a future feature not yet developed or am I missing some set up steps on my phone or in \"Your Phone\" settings?","solutions":["Hi, WRE_Surfin My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","the Get-AppXPackage -AllUsers returns an error \"is not recognized as the name of a cmdlet, function.... try again.","Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Administor Authority back        I signed in with a gmail user account and now can't sign back in as my microsoft user. I don't have administrator authorities and am very limited with what I can do without being told I don't have authority. I am a signal man an am the only one that uses my computer.  It is driving me nuts being told this. It's been since Nov that this happened.Anyone? Please help?","solutions":["Hey Mike, Evan here an independent adviser here to assist you... That's a bit of a pickle you're in. Is this a work computer? Is it possible to contact the admin for the password? If not, your only real option is to re-install windows 10 and I doubt that's an option at this time either.You can follow the info in this article here to create a new local admin account:https:\/\/www.howtogeek.com\/226540\/how-to-create-...But, if the permissions are very strict you may not be able to.","Thank you for getting back to me Evan.I am the owner of this computer and it is a home computer that only I use because I am a single man, live alone, and nobody else uses it but me.I do not wish to reset it. Can anybody help getting me back to my administrator profile please? Which password would you like? I have synced some, so if you could be a bit more specific it would be great.","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please perform the following steps: 1. Enable the Built in Admin Account: Press the Windows key to open the metro interface and then type Command Prompt in the search box.Right-click on command prompt and Run it as administrator. Copy the following code and paste it in the command prompt. Then, press Enter to enable your built-in administrator account.net user administrator \/active:yes 2. Log out of the current account and log in to the Administrator Account we have just enabled.3. Elevate the Account Privilege: Open Settings. Click on Accounts. Click on Family & other users. Select your Microsoft Account. Click the Change account type button. Select the Administrator. Click the OK button."]},{"symptom":"Windows activation on 1\/2 new pc        Hello, I recently updated my hardware (Motherboard & CPU) and now cannot activate my account (error code: 0xC004F213). When I try to do so\/troubleshoot my \"old\" pc is shown, yet when i click this is my account I get the message \"Unable to activate Windows\". The account is still linked to my current E-mail. Thanks in advance","solutions":["Hi ir_g. I'm Reinald, an Independent advisor and a Windows user like you. Thank you for providing information on your issue, we are are happy to assist you.Do you what type of Windows license do you have? Is it OEM, Retail or Volume? To better diagnose your issue, let see if we can retrieve your windows license type. Kindly try to follow the instructions below in identifying your Windows license type:1. Click Start > type CMD> Right click on \"Command Prompt\" and select Run as administrator > and type in the following command:slmgr.vbs \/dlv 2. A \"Windows Script Host\" box will pop-up Check \"Product Key Channel\". IT should tell you what type of license do you have Here's an information the different type of Windows license from Mauro Huculak: An OEM license refers to the license that a manufacturer installs on new devices. If this is your case, the product key isn't transferable, and you can't use it to activate another installation. (Unless you're re-activating a new installation on the same computer.)A Retail license refers to the license that you acquire when purchasing a copy of Windows 10 from your local store or an online retailer (such as from Microsoft or Amazon). If you have a Windows 10 Retail license, you can transfer the product key to another computer or upgrade major parts on your computer. A Volume license is designed for a large business, education, and government scenario. Usually, a Volume license allows organizations to use one master product key to activate any installation of Windows 10. Although you can use this license multiple times on different computers, you can't transfer it with the device when the system changes ownership, and you're not allowed to activate devices that aren't part of the organization.Source: https:\/\/www.windowscentral.com\/how-determine-if... Let us know how it goes and don't hesitate to ask if you have further questions. I will do my best to to assist you until your issue is resolved."]},{"symptom":"Can I disconnect an internal hard drive from a two-way mirror storage pool in Storage Spaces, and connect it to another pc to access(not modify) my data?        I have set up a pool of two identical HD's and copied all my files to it. This means my data should be written to both physical hard drives(right?). I'd like to remove my first HD from the pool and connect it to a different pc, confirm my data is present, then unplug it and plug the other in to confirm my data is present on both. Then return them both to their home and have them resume operating properly in the two-way mirror storage pool that I already set up.Will doing this cause any harm?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. If there is no changes made to the Hard Drive in terms of data Read\/Write, you can do that, however if you want to use one of the Hard Drive with another Computer you may not be able to access the data.This might be risky too. It is almost impossible that the other computer would not write any data to one of these Hard Drive when you connect it to the other computer. Once you connect one of the hard drive to the other computer some configuration data must be added which may corrupt the Hard Drive pool."]},{"symptom":"Create a System Image        I create a System Image (backup) weekly and save it to an external drive with 1.12 TB free space. The backup consists of System Reserved (System) - 37.20 MB and (C) (System) - 111.36 GB.I am getting a message that the backup failed. It says \"There is not enough disc space to create the volume shadow copy on the storage location. Make sure that, for all volumes to be backed up, the minimum required disk space for shadow creation is available. This applies to both the backup storage destination and volumes included in the backup. Minimum requirement: For volumes less than 500 MB, the minimum is 50 MB of free space. For volumes more than 500 MB, the minimum is 320 MB of free space. Recommended: At least 1 GB of free disk space on each volume if volume size is more than 1 GB.\" (0x80780119) This has never happened before. I don't know if it is coincidence, but yesterday I had a 250 GB SSD installed which is now my C-Drive and which has a free space of 121 GB. The former C-Drive which was cloned to the SSD now has a different Drive letter and is empty with free space of 931 GB. Is it possible that the system wants to put the shadow volume in my SSD and the size of the backup (148.56 GB) is greater than the free space (121 GB) on the SSD? If that is the case, is there a solution?Thank you. (Sorry for the length of the problem description.)","solutions":["It sounds as if you are using the native image creation tool. Microsoft is no longer supporting this tool. It has poor functionality and is temperamental and unreliable. I recommend you switch to the free version of Macrium Reflect. An excellent and very reliable tool!","Thank you for the quick response. I have downloaded the software and am running the backup now."]},{"symptom":"My Windows 10 will not activate with my Windows 7 Key        I have an older computer that was not functioning properly, partly from a failed upgrade to win 10 when they first offered it. So, in an attempt to rehab the computer I grabbed the window 7 Pro key from it (XXXXX-XXXXX-XXXXX-XXXXX-XXXXX format) then wiped the drives. I installed Windows 10 successively and tried to enter the Windows 7 Key from the previous install and it would not activate. I have read online that I can do it this way, am I wrong?","solutions":["Hi NonOfYourBeeswax Officially, the free upgrade period from Windows 7 and 8 ended 3 years ago, unofficially a lot (but not all) users are reporting they can still activate Windows 10 using a Windows 7 licence key . . .What Edition (Home, Pro ... etc.) of Windows 7 was previously installed on that PC - check the COA sticker on the casingWhat Edition of Windows 10 is installed now?","I have a key for Windows 7 home premium.  The computer came with it already installed I did get a disk but I don't know where the disk\/disk case is. I use a program to pull the key, and have confirmed with Microsoft that the key is valid.I think it is window 10 Pro, should I go with Home instead?","Yes, that is why you cannot activate Windows 10, you must install a matching edition, so the only option is to re-install the Home edition and your licence key should work with that edition . . ."]},{"symptom":"Windows 10 1909 update problems        Had to do a restore back to Windows 10 1903 after 1909 update. Start menu had disappeared, Edge had disappeared and lots more. Okay after restore. Now I'm prompted again for another 1909 update. What should I do?","solutions":["Hi heywoodg Yes, that would most likely have been caused by a corruption during that update and is unlikely to repeat . . .Click the link below, then click 'Update Now' on that page to immediately get 1909 and bring your PC right up to datehttps:\/\/www.microsoft.com\/en-us\/software-downlo...","on your head be it :-)","Cheers, updated to 1909 and all is okay","Hi heywoodg, glad to Help!"]},{"symptom":"What happened to timely Microsoft support??!!!        I have an existing ticket number and I've been on hold waiting for tier 2 support for an hour an 20 minutes now. I'm in too deep to try and call back now. The last time I was on hold for an hour and a half; someone finally answered and then hung up.  Madness!!!","solutions":[]}]}