{"windows":[{"symptom":"PC Rebuild and Windows 10        Hello-I have a 10+ year old PC that I had built originally with a retail version of Windows, I believe version 7. Back when the offer came to download and upgrade to Windows 10 I did so and have been running it since. I am in the process of building a new PC utilizing an SSD for the C: drive and would like to do a fresh install of Windows 10, then move my original C: drive from the old PC into the new one (as a D: or other named drive) and migrate files off of it. As I have not been able to locate the original disc for the previous version 7, I located the ProductId within Windows 10 but can't find a license or key. Any suggestions of how I can install Windows 10 on the new SSD while maintaining on my old C: drive or any other workarounds would be most appreciated.Thanks!","solutions":["Hi Chrisjs14 Without the Product Code, it will be very difficult to activate WIndows 10 on the new PC . . .Generally, you can install Windows 10 and then use your Windows 7 Product Code to activate WIndows 10, that works most of the time, and if it does not, then you need to contact Microsoft Support by Phone, however, they will insist on you having your Windows 7 product key . . .","Appreciate the quick reply. Been thinking back and I still have the Windows 7 OS on one of my secondary hard drives. When I built my old PC I did the same thing, installed a new C: drive and put Windows 10 on that while keeping the original C: drive as a backup and additional storage. Will dig a little deeper and see if I can locate there. Thanks","Booted off the old drive and found it wasn't Windows 7 but XP that I originally had. It was XP Pro Ver 2002 SP 3 and registered in my name with a 20 digit key. As everything I read is looking for a 25 product key, a little further research I found Belarc Advisor, free download and amazed at the detail it provided including decoding anything binary to actual info. Now that I have the 25 key, question is can I download and make a boot disk to setup the new SSD or are other steps involved? Also, is there someplace I can check on MS support that will verify the key I have is correctly registered? Thanks ","Hi Chrisjs14, In the process of installation you'll be asked for the 25 key and that's the time that you can verify if this key is legit.Most likely it will inform you if there's wrong with your key. For further clarification you may check this article: https:\/\/support.microsoft.com\/en-ph\/help\/10749\/...Please let us know if this is clarified. Thanks and regards,"]},{"symptom":"drive doesnt show up  windows 10        DVDs\/CDs wont play","solutions":["Hello SusanPernot1, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemIf you start your device with a dc in the dc room, do you hear it rolling? does it ejectas well? Did you check in device manager, if the DVD\/CD device is detected? can you please post a screen shot if possible? Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolvedCheers! Farah"]},{"symptom":"Unread Messages in Outlook        When I open my Office Outlook all of my messages show as already read.  It only started this about a month ago.  I have changed the settings numerous times just as the instructions say, but it just goes right back to showing all messages read.  I want my unread messages to show as unread until I read them.  What else can I change?","solutions":["Are you using MS Office's Outlook program to read mail and not Windows 10 Mail at Outlook.com? Windows 10 Outlook is better for free webmail and is not related to Office. It can retrieve MS Office mail but it is better to use MS Office's Outlook program instead of Mail. The name duplication is very confusing.You should post in the MS Office forum for help if that is your mail program. See this-- https:\/\/www.msoutlook.info\/question\/780","Hi SharonWoodard, Can you please specify if your Outlook is 2013\/2010? If yes, you can follow the instructions below: When Outlook opens, and the reading pane is showing, the most recent message is displayed in the preview. When you click onto another message, the previous one may change color and be marked as read. The same thing may happen if you preview any other message by clicking on it. To stop this happening in Outlook 2010 and Outlook 2013, follow these instructions:Open the File menu and select Options. Click on the Advanced menu item. In the Outlook Panes panel, click on the Reading pane... button. Deselect the Mark items as read when viewed in the Reading Pane and the Mark item as read when selection changes boxes (click to remove the tick).Click OK. Click OK again to close the Options dialogue box. Please let us know if this will help you out. Thanks and regards,"]},{"symptom":"where and how do i download visual basic for windows 10        I need to run a legacy app that has a vbrun300.dll. but my windows 10 computer has no Visual Basic. where can I find that app to download to my computer? your suggestions will be appreciated.Sadnewbie","solutions":["Hi sadnewbie, Visual basic was replaced by Visual Studio, for further clarification please refer to this article:https:\/\/docs.microsoft.com\/en-us\/visualstudio\/g...How to download: https:\/\/visualstudio.microsoft.com\/downloads\/Please let us know if you need further assistance. Thanks and regards,"]},{"symptom":"External disk HP PD1000A not recognized        Hi, i bought this HP PD1000A external disk some time ago, i used to save pictures, videos and many things, now i need space on my pc, so i connected it, and windows tried to install the drivers but failed, so i tried to find the drivers manually but could not find them anywhere i tried to install generic drivers but didn't worked neither. It shows up in the Device Manager like 'SYMWAVE SES USB Device' with a yellow sign. I've tried some CMD commands too but nothing. The disk is not damaged. Also when i touch the external disk is warm and working but the white light doesn't turn on. I'm on windows 7 64bits. Idk what else to do, i have important stuff in this disk, so formatting is not an option and i can't even do that cause my pc doesn't recognize it,  please help! This is the product,https:\/\/support.hp.com\/us-en\/product\/HP-SimpleSave-Portable-Hard-Drives\/4023081\/model\/5074611?jumpid=reg_r1002_usen_s-001_title_r0001","solutions":[]},{"symptom":"3D paint is automatically grouping everything after saving & re-opining, and I can't ungroup it        After I save and re-open, every object in the file is now fused together into one big object that I cannot UNgroup or un-fuse, and cannot individually select.  This is very frustrating.  I need to change something but now I can't (without rebuilding the whole project from scratch) because I cannot separate out the individual components.In general, I have found 3D paint to be frustrating and confusing.  There are number of glitches and strange behaviors having to do with the ctrl-Z\/undo functions, and other things including saving files.  However, this issue seems to tower above the others, and makes the application practically useless.","solutions":["Also just a clarification:  I'm fairly certain this doesn't have to do with the mode I'm in.  When I add new objects these are still recognized as individual objects which I can manipulate individually.  It's just anything from the re-opened file is now \"fused\" as a single object which I can't take apart.  What is going on, and how do I fix this?","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please try resetting the App and check. Go to Settings Click on Apps Select Apps and Features Select 3D Paint Click on Advanced Options Click on Reset","You should make every item 3D so that you can pop each element out individually.  Then you can move them around."]},{"symptom":"Can't get started on set up        Trying to get started but it tells us our pin is incorrect. Will not let us reset.","solutions":["Hi, Is this an organization’s PC? (School or Company) ? Info about \"PIN\". Fix problems with your PIN. Link: https:\/\/support.microsoft.com\/en-us\/help\/402619...","No it's a personal computer.","Hi Jeffrey, Are you able to login using different method such as password? If yes, and if you can still get through your desktop. Please check these suggested steps: https:\/\/windowsreport.com\/pin-windows-10\/Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"Incorrect password leaves me waiting for long periods of time        On occasion, I'll accidentally type in my password or pin incorrectly. Sometimes when this happens I'm left watching a wheel spin over and over again before it tells me that I've typed my password incorrectly.Why does this take so long to tell me my password is incorrect? Other times I'll type my password in incorrectly and it will tell me right away that it's wrong and then I can just put my correct password in.Can this be fixed?","solutions":["Hi TheGameGuyDude, It does not. Or rather, it does not take the computer any longer to determine that your password is incorrect compared to it being correct. The work involved for the computer is, ideally, exactly the same. Any password verification scheme that takes a different amount of time based on whether the password is correct or incorrect can be exploited to gain knowledge, however small, of the password in less time than would otherwise be the case.The delay is an artificial delay to make repeatedly trying to gain access by using different passwords infeasible, even if you have some idea of what the password is and automatic account lockout is disabled (which it should be in most scenarios as it would otherwise allow for a trivial denial of service against an arbitrary account). The general term for this behavior is tarpitting. A tarpit is a service on a computer system (usually a server) that purposely delays incoming connections. The technique was developed as a defense against a computer worm, and the idea is that network abuses such as spamming or broad scanning are less effective, and therefore less attractive, if they take too long. Most likely, this issue still depends on your Computer Cache, Processing, etc. You might improve this if the main system files are installed in SSD (as per number of users compared to HDD) Please let me know if this clarifies your concern. Thanks and regards,"]},{"symptom":"Windows 10 Anniversary Edition Update - How to get it now        Technical Level : Basic SummaryStill waiting for the Anniversary Edition update to be installed but no update as of yet. Here an easy way to install the update now.DetailsTwo important things to do before you start the update:A) Create an image backup of your current version of Windows 10. Should the update fail you can restore the image to your disk drive and try again.B) Disable your Anti-Virus software!How to install the update:1) Go to Windows Update, by opening the start menu, click on ‘Settings’ \/ Updates & security or in the ‘Search box’ type: update' and open ‘Check for Updates’.2) Now look down for 'Learn More' link and click on it, it should open a page on your default browser.3) Next click on 'Get the Anniversary Update now'.The File that is downloaded is named: Windows10Upgrade28084 4) Double click on this file Open it and make sure it starts downloading the upgrade file.Note: You also have the option if you see the message “Windows10Upgrade28084.exe finished downloading.” located at the bottom of the display; you can click on the ‘Run’ button to start downloading the upgrade file. Click ‘Yes’ when prompted. Then click on the ‘Update Now’ option.5) Next watch for ‘Downloading Windows 10 update’, which will be followed by 'Verifying Download'.6) Next it should start the upgrade (it may take few minutes to reach the 2% mark).7) The upgrade should continue and finally get beyond 2% in a short while (be patient).Note: If the upgrade remains stuck at 2% and you received an error code 0x80070057 then clickHERE and follow the instructs on resolving this issue.8) After the update is ready, you will need to restart the computer, click on the ‘Restart now’ button.9) After your computer restarts the update will finish installing and may reboot one or more times to complete the process.10) Check your activation status: Click on Start \/ Settings \/ Update & security \/ Activation11) Verify the Windows 10 version number is 1607 (As of August 2nd 2016): Start \/ Settings \/ System \/ AboutNote: Updates may change the OS Build number from time to time such as KB3176495 released on August 9th.That's it, you’re done!Reference material, Pagestart.com Additional Wiki articles you may want to read:After the Windows 10 Free Upgrade is over, what are my options. Note: The free upgrade is still active for users of assistive technologiesHow to use Microsoft's Download web site to download an official Windows 10 ISO file, create installation media and activate Windows 10How to re-install Windows 10 without a product key (Digitial License \/ Entitlement)Windows 10 - How to tell what type of Activation I have, Digitial Entitlement \/ Digital License or Product keyHow to extend the 30 day limit to go back to your previous version of Windows","solutions":["I want to say thank to you,but maybe the free ugrade offer from Microsoft has been ended.The error is still there no matter how I tried, including your guide. ","Thank you, this was very helpful, for upgrading from an earlier version of Windows 10 to the newest version, without waiting around for the update to download by itself.","I have gone through all these steps several times to update my machine, which operates underWin10 Pro #10586.545 to the latest Win 10 #14393 (1607) with zero success. Originally it told me to get rid of Canon Zoombrowser, etc which I did, but now it shows that I have another error, (White Sq 10mm x 10mm with Blue sq 5mm x 5mm inside) but no description whatever advising what the program is!Error code showing 0xc1900209, which according to Google could mean several different incompatibilities. I have disabled my virus checker for the procedure, but no luck!Can anyone enlighten me, please? All updates are in, with only one failure (KB3172985 July 21, 2016)","Contact Microsoft support: https:\/\/support.microsoft.com\/en-us\/contactus\/ Chat Support: http:\/\/www.groovypost.com\/howto\/activate-windows-10-license-microsoft-support\/","I'm seriously regretting ever hearing the words, phrase or topic \"Windows 10\". I also thank the Lord that I did not download it onto my *real* PC; The one on which I'm typing is my experimental\/Test PC and I've lost enough files and photos to last a lifetime. The only thing which apparently functions properly, are the beautiful new graphics and Cortana- useless bc I don't have the correct microphone anymore.  DVD - gone, CD player, gone, 20 pieces of installed software, gone, network printer-gone, Other that that things have gone well except for the unending bugs and MS fixes.  Now, I have been unsuccessful downloading updates and defender is defunct as of 8\/13\/16 and I've seen that more software programs and apps have also completely disappeared.  It only took me 35 minutes to reinstall a disappeared IE , huh ? in hopes of retraining my PC to automatically download and install Windows and other updates. I'm done. Free is not free if it cost me  so much downtime it would have been better to not have gotten involved in he first place.  I do have that one piece of good news, however, although I cannot get MS Edge,   I finally have a malware, spyware, phishing infested IE and Bing reinstalled on my PC.  Yay.  Done.  I'll use this PC to play solitaire and look at old photos of cats and birds transferred from Windows 7.   Good luck everyone. Toodles.","Am still not getting the update on my PC. The page that is mentioned in the guide does not have the \"Get the Anniversary Update Now\" button.So I though, maybe it's just Firefox. I opened in Edge, and there is only a completely empty page.So I opened in Internet Explorer, but it's missing the button as wellHow do I get that update? Windows update doesn't tell me anything, just \"up to date\", the update fixing tool does not help, etc...","Use the Media Creation Tool: http:\/\/www.windowscentral.com\/how-get-windows-10-anniversary-update#windowsupdateSuggest you create an image backup to an external USB drive should something go wrong you can always restore the backup and try again.EaseUS:Todo Backup Home V10.0 http:\/\/www.todo-backup.com\/home\/home-backup.htmUser friendly interface simplifies the backup process.Free version: http:\/\/www.todo-backup.com\/products\/home\/free-backup-software.htmVersion comparison chart: http:\/\/www.todo-backup.com\/products\/home\/comparison.htmIncludes: Incremental backup, Disk\/partition cloneUser's Guide: http:\/\/www.todo-backup.com\/download\/docs\/User_Guide.pdfNote: Install Todo and then create an \"Emergency Disk\" (WinPE option is the better of the two choices) before you start creating your first image backup.Version 10 supports XP, Vista, Windows 7, 8 \/ 8.1 and Windows 10　　Acronis: True Image 2017Has a 30 day trial version available, trial Key sent to your Email Address.User interface has become more complex and less obvious, be prepared to read the user's guide before you start. Pay special attention to the \"Options\" and don't exclude the \"System Volume Information\" folder from the backup.Note: Cloning and drive initialization (creating a MBR) are not supported in the trial version.Image Backups and restores are fully functional.For the trial version, recovery \/ restore image is available only when booting from an Acronis Bootable Media CD.Install Acronis and then create a bootable Restore\/Rescue Media CD (WinPE option is the better of the two choices) before you start creating your first image backup.http:\/\/www.acronis.com\/en-us\/　30 day trial: http:\/\/www.acronis.com\/en-sg\/homecomputing\/thanks\/ati-local\/　True Image User Guides and documentation: http:\/\/www.acronis.com\/en-us\/download\/docs\/ati2017\/userguide\/2017 supports XP, Windows 7, Windows 8 \/ 8.1 and Windows 10 (Note: Vista is not supported)There is also a \"Cloud\" backup version so you don't need to lug an external USB Drive around if you travel a lot:http:\/\/www.acronis.com\/en-us\/personal\/true-image-comparison\/　　Paragon:Free version 14: http:\/\/www.paragon-software.com\/home\/br-free\/User's Guide: http:\/\/download.paragon-software.com\/doc\/BR14Free_en_manual.pdfHome Version 16 $39.95: http:\/\/www.paragon-software.com\/home\/brh\/User's Guide: http:\/\/download.paragon-software.com\/doc\/Paragon-BR16-Manual.pdfSupport: http:\/\/www.paragon-software.com\/support\/supports XP, Vista, Windows 7, Windows 8 \/ 8.1, Windows 10　　Macrium Reflect:Free version: http:\/\/www.macrium.com\/reflectfree.aspx(No technical support available for the free version)Macrium Reflect Home Edition ($69.95)http:\/\/www.macrium.com\/personal.aspxSuport: http:\/\/www.macrium.com\/ticket.aspxVersion 6.3 supports XP, Vista, Windows 7, Windows 8 \/ 8.1 and Windows 10　","Thank you for the hint, I'll try that soon!","I tried all of this and there is not a button \"Get the anniversary edition now\"  What gives?","Hi, I Reset my laptop last night and it got set back to 1511 and I want it to be at 1607, the download page is not available anymore please help"]},{"symptom":"Renaming my surface pro aol account        Hello,I bought a new surface pro and set up my email.  For some reason, when I send an email, it says it is coming from \"Fred\" and then my email address at aol.comI don't want to be Fred.  How do I remove Fred?Thanks!","solutions":["Hi Alisa, The username you select when you initially create your AOL account is your primary master username and cannot be changed or deleted. However, if you no longer want to use one of the additional usernames connected to your primary account, you may delete it at any time and select a new one. This enables you to change the username you use for AOL services. In addition, you can change the display name for any account, which is the name people see when you send them an email.Please refer to this guide: https:\/\/www.techwalla.com\/articles\/how-to-chang...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"Windows Update breaks OpenGL support for SYSTEM-User        Hi, one of my applications is running as a service started from the SYSTEM-user and was using OpenGL before without any problems. No I have problems on machines that have Windows Version 1903 - A regular Deskop User gets an opengl-context without any problems, but the SYSTEM-user only gets opengl version 1.1.Is there any workaround for this problem?I already tried the following: Reinstall driversPurge and reinstall driverSet \"interactive\" flag for windows serviceMonitor is attached and a user is logged in.","solutions":["Hi Marco, Based on your concern, there's a lot of people experiencing this kind of issue as well.What I can suggest is to rollback the updates: https:\/\/lifehacker.com\/how-to-undo-and-prevent-...And disable your windows update for the mean time, please follow this link for detailed guide:https:\/\/www.cleverfiles.com\/howto\/disable-updat...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"New computer        Hi, I am trying to install my new computer. At setup, when I have entered my email account it tells me to create i pin. There is no option to skip this step and when I press the \"Create Pin\" button it says just a moment... it has been saying that for several hours now. Only option to get something to happen is to restart the computer - but it always end here. I can't get into the computer...","solutions":["forget to mention, To do this, temporary disconnect from the internet as wellhttps:\/\/www.howtogeek.com\/442792\/how-to-create-...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. This"]},{"symptom":"Snip and Sketch        Hi!  I have been happily using your snipping tool for years.  Snip and sketch is clunky and frankly not intuitive.  I try the logo+Shift+S to capture whole screen and it takes forever to never create anything but the address bar of the browser.Snipping opened it self and when invoked and as soon as you drew the box. the picture was there.I would appreciate some help with using this new tool that is clunky and non-intuitive and slow and since you are getting rid of the tool that is easy to use and fast.Allen","solutions":["I agree the old snipping tool was better. What I have done is added the snip & sketch icon to my toolbar (find this from start>all apps>windows tools iirc, right click & choose pin to taskbar) & open it from there.Then to screen capture I click on new where I receive the option to snip full screen, Windowed or a section of the screen. You can also set a time before the snip occurs in case you need to find the Windows to capture.","Do you still require help?","Time Lady,Thanks, I’ll try this mext time I need to snip.  I do not see how it will help the hang or non-completion issue.  I may try to find some relevant training videos in case I am doing something wrong.  I am just disappointed that Microsoft had added functionality in the redesign and made the tool slower and harder to use.Allen","If the app is slow then try uninstalling it & reinstalling from the store. I would send Microsoft feedback via Windows key + F to let them know you’re unhappy with the changes."]},{"symptom":"Windows shows full file size in destination while file is still copying        When copying a large file (say 8GB) the destination file immediately shows as 8GB while the file is still copying.I have a third party software polling the destination file to see when the whole file is in the destination. Because of this behavior, the third party software thinks the whole file has been copied to the destination right away, which causes problems.Is there any way to change this behavior so the file size shows incrementally during copies?Additional info:The cygwin cp command seems to fix this behavior, but I need a native Windows solution.This behavior is seen either when doing the copy from File Explorer or when running the \"copy\" command in the command prompt.Wind****d 18363.535)","solutions":[]},{"symptom":"PC screen remains blank. \"black\"        The computer got stuck like hanged remains till half an hour, and then i press the power button to switch off and when i again it switch on the screen remains black till now. it about 2 hr of the same screen.","solutions":["Hi, rashmiranjan1 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"This is the second time you've taken over my computer DEMANDING a new password. How often will BIG BROTHER continue?        This is the second time you've taken over my computer DEMANDING a new password. How often will BIG BROTHER continue?","solutions":["Your question is not clear, would you mind elaborate it in details and explain what happened?Who is asking for new password?What is the message?How this problem get started?Are you using Microsoft Account or Local Account?","Hi,My name is Will I'm an independent adviser.We haven't taken over your PC. This is the community support forum and questions are answered by other users. Not to mention this is an automatic process not one trigger by anyone manually.There are a number of reasons this can be triggered. Is this a personal device or one you use for work\/education? It's possible that your password did not meet the rules enforced by your organisation.This can also be triggered by suspicious activity on your account or it having been locked recently.I hope that helps"]},{"symptom":"Wireless Comfort Keyboard 5050\/ keys sticking\/lagging\/or not registering.        Im using the Wireless Comfort Keyboard 5050 and while typing it would randomly not register a key stroke. I repeatedly needed to go back and try th letter or number again. Sometimes it will add it or add 5 of them because it was lagging an I pressed the key multiple times?!?!. I thought that my keyboard was the only one with the issue however two other people in my office with the same keyboard is experiencing the same problem. The severity of the issue grows everyday, as in gets worse. The keyboard is malfunctioning, we have replaced batteries, re synced and changed USB location. I feel that this is a manufacturer default. There is something seriously wrong with this keyboard. What can be done  ","solutions":["Hello Leslieemerson! My name is Marco, I am an Independent Advisor. I will do my best to help you.Did you download the lastest drivers here ? https:\/\/www.microsoft.com\/accessories\/en-us\/pro...","Thank You For Posting in  Microsoft Community. Call ******************* Microsoft online support Between  10:00 A M t o 7:00 P M EST . We will Help you to fix your IssuesDon't call this number, it's spam."]},{"symptom":"Optical Drive Failed After One year on HP Running Windows 10        I recently learned that my Optical Drive ( came with this PC just over a year ago. :\/ ) had failed.  The Rep told me HP Laptops had issues with the pre-installed drives. ( Hp really has gone downhill since I purchased one in the early 2000's. Never again.)  I know some claim Optical Drives are obsolete... but I must have a CD Drive for accessing and storing documents..  So I purchased I disabled the Drive which has failed and purchased an External Drive which uses a USB port.  Now  I cannot copy files from my docx to the Cd when I push it in.  What is wrong here, please?? ","solutions":["Hi, What happens when you try to copy files? Do you get an error message?","When I try to copy files I get a message saying Windows Media is ready to burn them but it goes nowhere from that.","Try the following: In This PC highlight the drive > Drive tools > Finish burning","When I try to put a CD into the \"F\" drive ( the name assigned to the External drive I purchased...) the Drive is listed in Devices; but I keep getting a message, \"checking disc... There is no disc in the CD or DVD burner\". I am beginning to wonder if I was ill advised about my optical drive being defective.   For some reason the new External Drive is not able to burn, even when I go to \"Drive tools\" and click on the  tab to \"finish burning\" I am at my wits end with Windows 10.","What happens when you click the tab to \"finish burning\"? Does the same issue exist of you restart the computer in Safe Mode?"]},{"symptom":"Can’t proceed from Preparing auto repair” screen        Turned on my computer this morning and this is all I get and then it shuts down. I tried rebooting three times and then seven times as recommended but nothing. This is as far as I can get. Help!","solutions":["Hi, NICOLEDECEGLIE My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"uefi firmware settings windows 10 missing        Hi,I want to install windows 7 on my HP EliteBook 8560p. Now I have Windows 10.To install it I have to go on troubleshooting advanced options and press uefi firmware settings windows 10 which do not shows there,but I saw that my laptop supports UEFI.How can I find it and boot windows from CD (and also it do not shows boot devices when I press F9 in StartUp) ?","solutions":["Hi nobody2001,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Please remember Windows 7 goes out of support on January 14th this year. Secondly, you may only downgrade if the manufacturer provides driver for the same.To open UEFI firmware Settings, Press Esc key at startup and choose F10 to open Settings.Then disable quick boot and Secure boot and make necessary changes to the boot order to boot from USB.Hope that helps.","I am not able to see where I can disable that.Should I send you a picture what I see when I press that?","Yes, you may use your phone's camera to click a picture.","ESCf10","Did you check the system configuration tab?","Yes,should i take picture of it?","Yes, you may take so we can better guide you.","If you need more pictures just tell me!","Did you find any relevant option in Boot options or Device options?","Boot Options"]}]}