{"windows":[{"symptom":"I have no administrative permissions on any guest account, and the built in administrative account seems to not have any functions beyond file explorer.        Hi, a long story short I had unintentionally disabled admin permissions for all of my guest accounts. Using the command prompt \"net user administrator\/ active:yes\" in an effort to add the administrator account yields error 5, naturally as neither accounts have any admin permissions. I have tried opening the account from safe mode in order to give admin powers to my other accounts, but once there only file explorer exists when it is control panel I need. Is there a solution to this beyond resetting windows? Is there a way to give other accounts from command prompt? Thanks.","solutions":["Hi JoshuaSng, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.See if the instructions on the Windows MVP website, help you regain privilege on your guest accounts.https:\/\/www.thewindowsclub.com\/lost-administrat...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi, on the admin account, nothing beyond file explorer exists. Do you have any clue how to bring up control panel there?","Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.If you can press CTRL-ALT-DELETE to get the page of options including \"Task Manager\" - try clicking that.If you can get Task Manager to appear - go to the File menu choose \"Run new task\", and enter \"Control' in to the box and click ok. This should open Control Panel to allow you to follow the rest of the instructions.Regards, David"]},{"symptom":"all apps        Hi,Please assist(windows 10)when I push Windows symbol on lower left hand side of the screen,a new windows open,all the apps use to be there But now when I push Apps,they open in the middle of the screenHow can I revert them(change them) back to the left hand side of the screen when I open Windows symbolThank you Darryl","solutions":["Right click Start button to open Task Manager, show More Details, then choose Processes tab, scroll down to Windows Processes, then further down to Windows Explorer. Right click to Restart Explorer, then Restart PC.Fixes for duplicate drives in Explorer: https:\/\/www.tenforums.com\/tutorials\/4675-add-re...https:\/\/www.thewindowsclub.com\/remove-duplicae-...https:\/\/www.howtogeek.com\/335622\/how-to-fix-win...https:\/\/www.askvg.com\/fix-drives-appearing-twic..."]},{"symptom":"Laptop 5G Görmüyor            Merhaba, Yeni bir modem aldım. Modemim  bir normal isimde bir de 5G ifadesiyle belirtilelk iki şekilde görünüyor. Telefonomda 5G ye bağlanıyorum ama bilgisayarım 5G yi görmüyor. İkisi arasında ciddi bir hız farkı var. Bilgisayarımın 5G yi görmesi ve bağlanabilmesi için ne yapmam gerekiyor? Yardımcı olabilirseniz sevinirim. Bilgisayarım TOSHIBA P855 SATELLİTE serisi.","solutions":["Kullanıcılarımıza yardımcı olmak için çeviri hizmeti kullanmaktayız. Lütfen dil bilgisi hatalarını affedin.Merhaba Zeynep, Bildiğim kadarıyla manuel olarak görebiliyordu dizüstü bilgisayar hücresel modülü yok ve kendisi tarafından hücre ağına erişemez. Herhangi bir hücre modem kullanıyor musunuz? Tam model nedir?"]},{"symptom":"Buffalo External Hard drive        On my new computer, it does not see my external hard drive by buffalo on my network at home.please help.","solutions":["Hi, Please make sure the network is set to private under Settings > Network & Internet > Status > Change connection properties. And that discovery is enabled under Control Panel > Network and Internet > Network and Sharing Centre > Advanced sharing settings.If you are still experiencing issues afterwards please let me know so we can troubleshoot further.","If you want your external hard drive to function as a network drive, you must connect the drive to a USB port on the router."]},{"symptom":"Can't find Bluetooth on my computer        Can't find Bluetooth on my computer to connect my wireless keyboard and mouse. I have a AMD Ryzen Midi Tower Gaming PC. My wifi works perfectly it's just the issue with Bluetooth. ","solutions":["Hello Diamondsz! My name is Marco, I am an Independent Advisor. I will do my best to help you.Can you tell me the model of your motherboard? Because not all models accept bluetooth. To find the model, follow these steps. Click on the Windows start button, write \"cmd\" and click on \"command prompt\". Type: wmic Press enter, and then type this line: baseboard get product, manufacturer, version, serialnumber You now see the model, select the name and model and press CTRL + C to copy and give it to me here.Marco","I have the order info. The motherboard is:Gigabyte B450 AORUS ELITE (Socket AM4) DDR4 ATX Motherboard","Are you sure your computer has bluetooth? If you are not sure, right click on the start button and click on \"device manager\" .. in the list you should see the bluetooth device."]},{"symptom":"Windows 10 - Volume drops to Zero in Normal Mode and 100 in Tablet Mode        Hello All,Tried everything to fix this.  I have a 2-in-1 laptop.  Once you fold it over it turns from traditional laptop to Tablet.The volume on my laptop drops to zero.Have reset Windows, used the troubleshooter, tried all available 'fixes' posted online but to no avail.There must be someone out there who can fix.","solutions":[]},{"symptom":"windows in s mode        If I take my Windows out of S mode, will I be able to install software on it?","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.If you take your PC out of S mode you will be able to install software which isn’t available in the Microsoft store such as ‘desktop’ type apps.Regards, Ross"]},{"symptom":"Colors        Something happened to my colors....Everything is a gray hue....can I reset my colors somehow on Win10? Thank You.","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Most likely you've accidentally switched Windows in to \"grey\" mode which is an accessibility option.Try pressing CTRL + Windows + C keys together - that should toggle the mode off\/on.The options are explained a bit more here: https:\/\/www.laptopmag.com\/articles\/disable-enab... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Regards, David"]},{"symptom":"update        how can I upgrade from windows RT 8.1 to windows 10","solutions":["Nepaci sa mi","Nepaci sa mi"]},{"symptom":"Why does listening to a Youtube video cause my system interrupts to increase, and stay at, a high level?        HelloAs the subject states, listening to videos causes an instant rise of the interrupts from a seemingly normal level of about 0.5 to1% to 25% or so. When I pause the video. it drops instantly to the background level - is this normal?I ask because I am trying to find out why my system has started to have a very high level of interrupts at starting up, Monitiring it with Process Explorer shows a level of 45 to 50% long after the system seems to have settled down, and it drops back to 1% ten minutes after I can start to use the computer. This behaviour started abruptly about a month ago. Again are these levels to be expected?My system is Windows 10 fully updated, and please let me know if anyone would like a list of hardware, as this has been left off  to keep this post short.Thanks to anyone in advance who can help.John.","solutions":["Hi johnhawkins I'll try to help you out. The \"system interupts\" process is part of Windows. When you ask your computer to do a task, it runs the code as fast as possible, and when the task is done (or if you go in another window), it goes in this process.By the way, the percentage depens on your hardware (mostly CPU). But you shouldn't experience a 25 to 50% on this process. What you can test : 1. on the command line (type \"cmd\" on the start menu) type \"sfc \/scannow\" => it will scan the system files to check if something is corrupted. 2. run an offline windows defender scan https:\/\/support.microsoft.com\/en-us\/help\/17466\/...I'll wait for your news Regards","Sorry about the delay but work has got in the way of getting to my computer.I tried the two remedies you suggested; the scan for corrupted files returned a clean report, with no faults, whilst I used both Malwarebytes and Avast to do full scans, but they both reported no malware found.When I last started Windows there seemed to be no excessive interrupts as I mentioned in my first post, but having just started a Youtube video I see the interrupt level has jumped from c 1% to 25% as before.What could cause an excess of interrupts?ThanksJohn."]},{"symptom":"Desktop Window Manager High GPU Usage in Windows 10        why Desktop Window Manager (dwm.exe) make high usange gpu?when I play games or are designing 3D (all games)dwm.exe rises to 80% or more in the usange gpu column. and make extreme fps drop ...this strange usually dwm.exe just make ram or cpu usange to be high,but now they make my usange gpu high. but my CPU, RAM and DISK are normal.can you advise on this?windows and my n-vidia drivers are up to date.*Modified title for accuracy**Original title: Desktop Window Manager (dwm.exe) using high usage gpu?*","solutions":["Hi Iksan,Higher GPU usage is a good thing. It means nothings is stopping the GPU from performing at maximum level to give you the highest FPS it is capable of.If you have other concern, please don't hesitate to post back.","i mean is dwm.exe take 75% gpu usange... so... the render application or games only get less than 25% (cause all has taken by dwm.exe process)that make me get a low fps and lagging.","Let us run the System Maintenance troubleshooter on the computer and check if it helps. Follow the steps below:Press Windows and X key together and select Control Panel.Click on Troubleshooting.Click on View all option on the left side of the Windows.Click on System Maintenance option.Click on Next and follow the onscreen instructions.If the issue persists, run your PC in clean boot. This helps eliminate software conflicts that occur when you install\/run a program or an update.You may also try turning off the applications that run in the background. To do so, follow these:Go to Settings > Privacy > Background Apps and turn off \"Let apps run in the background\".Do update us with the results.","Hello Charalampos,Are you experiencing the same issue as IksanBayuaji? I'll need more information to properly address your concern about high CPU usage issue with theDesktop Windows Manager (DWM). Kindly verify the following:What is the make and model of your computer?Are you getting any error messages?Are you running a specific program when the issue occurs?Have you installed the latest updates for Windows 10?Can you tell me the current OS Build of your Windows 10 system? Click theStart button, type About your PC, press Enter, and then scroll down toWindows specifications to find this information.In the meantime, I advise updating your device drivers especially your display adapter driver. Your display adapter helps normalize the CPU usage of WDM. If Windows can't find a new driver for your display adapter, you can check the device manufacturer's support website and follow their instructions.We're looking forward to your response.","hmmm thanks Devlin Sco.but on the 3rd month after I asked this. (on march) I have justified the problem itself.(because of the suggested JR Julie Ram did not fully succeed) but I really appreciate it.I analyze what's happening to my device, basically it's like when windows updates, I'm at that time in aless stable version of Build OS... and have an impact on my gpu performance.the problem feels when I rendering pictures and videos or playing games.in the event of renewal again, and I think it's stable I disable service windows update.\"ok i'm relieved, my windows have returned to normal\",after 3 weeks the problem reappears. performance of gpu and cpu i back garbled.with the state of service windows update that I disablewindows can basically force download updates. (and restart itself)yes since then I enable windows update service and always update my windows, but sometimes still, crashes between windows version and my gpu driver.anyway thanks for your advice.","Same problem on my system since i have installed RS4 (Win10 1803) , DWM GPU usage is around 15% to 40% (main GPU1: GTX1080TI , GPU0 GTX1070 not used here).Task manager says the GPU is used in \"3D\" mode, even if i'm just displaying \"flat\" windows.","Same problem on my system since i have installed RS4 (Win10 1803) , DWM GPU usage is around 15% to 40% (main GPU1: GTX1080TI , GPU0 GTX1070 not used here).Task manager says the GPU is used in \"3D\" mode, even if i'm just displaying \"flat\" windows.Ive got exactly the same, but only since the last update i think. Now my ASUS STRIX 1070 OC (GPU0) got used by 30-80% in 3D mode by DWM ( Size 61,0 KB (62.464 Bytes) last changedate 12.04.2018 01:34; Version 10.0.17134.1)Ive got only taskmanager opened, tried with safe-mode startup and got the same result.Is there ANY MS supporter with knowledge about this out there?","i have also an Asus Strix 1070OC as GPU0 , but my monitor is on gpu1 and the GPU used is GPU1 (Gygabyte Aorus 1080TI).I'm almost happy to see someone else with the eaxct same issue, that means this is clearly related to RS4, and not a malware.","Same problem here... And I have a fricking Zotac 1080ti AMP extreme. The 3D usage is 100%. Not at all times but every 2-3 seconds. This happens whe im using youtube. And not only that... Search is not working... What a buggy update. ","Same problem here. Strix 1060 6GB. Did a fresh install of Windows 10 and it fixed the problem. Until I started Forza 7. After that DWM started using more GPU in the background. It really ruins the gaming experience when you don't get that stable 60FPS in a racing game. Which causes me to sometimes hit people in the corners. Still no fix for this bull**it? It mostly uses GPU when moving the mouse. Which is ridiculous."]},{"symptom":"excel        excel shows red x, not photo","solutions":["Hi PeterYetman, I'm Roshan V S, Independent advisor and a Windows user like you. Are you running the latest version of office? If not please update office and see if that resolves the issue.Check this page other workarounds can be found in this article. I hope this helps:https:\/\/support.office.com\/en-us\/article\/i-see-...","Hi PeterYetman, I'm Roshan V S, Independent advisor and a Windows user like you. Are you running the latest version of office? If not please update office and see if that resolves the issue.Check this page other workarounds can be found in this article. I hope this helps:https:\/\/support.office.com\/en-us\/article\/i-see-... Thank you.  Sorry it took so long to answer."]},{"symptom":"Windows10 Microsoft apps not updating        I have Tried multiple ways to fix this issue where none of my Microsoft store apps update they are either pending or downloading but doingnothing and i would like to download the xbox beta app so i can use my 3 month xbox game pass for pc. i have reset microsoft's cache i have made a new account and that account also needed to update all of it, i have signed out and back in i have troubleshooted but it didnt pick up anything and much more please help.  ","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,Method 1: Windows Store App Troubleshooter 1. Press Windows + I to open settings 2. click update & security, then troubleshoot 3. now on right-hand side look for Windows store app 4. Select and run the troubleshooter Method 2: Reset the application 1. Go to start menu and open settings (gear icon) 2. Open apps and features 3. Locate the Store app on the list and click on it 4. Choose advanced option and click on reset Method 3: Disable third party services and startup programs 1. Go to start menu\/search msconfig 2. On the system configuration window go to the services tab 3. Tick on hide all microsoft service so that this won't be affected 4. Choose to disable all services 5. Next, go to the startup tab and on the window choose to open task manager 6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok 8. A prompt to restart the computer will show up and try again Method 4: Create a new user profile 1. Search for netplwiz on the start menu 2. Click on Add 3. Choose to sign in without a Microsoft account 4. Fill up the form and choose finish\/done 5. Highlight the newly created user account from the user account\/netplwiz window6. Hit properties and set it as an administrator 7. Log in the new user account and test if it's working Method 5: In-place upgrade\/Repair install In the event that it still occurs, I would recommend a repair install\/in-place upgrade to override and fix system components while setting the system to the latest version of windows 101. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","none of those solutions worked, do you have any more options?","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please try the following steps: Press Start button Type PowerShell, when it appears right click on it and select Run as Administrator.Enter the following command (Copy the command) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register “$($_.InstallLocation)\\AppXManifest.xml”}","Then Restart the PC and go to Store and try to update the apps.","Still nothing","No problem, please perform the following steps: Open Start. Search for Command Prompt, right-click the top result, and select the Run as administrator option.Type the following command to perform a quick health check and press Enter: DISM \/Online \/Cleanup-Image \/RestoreHealth","still didnt work","Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.I would like to suggest some areas to check \/ try. 1. Internet Connection should be unmetered. (Set as metered connection should be turned off)https:\/\/support.microsoft.com\/help\/40284582. Sign out of Microsoft Store and sign in again to refresh the profile. 3. Issue the command \"wsreset.exe\" using Command Line as an administrator, wait for Microsoft Store to launch and sign in. Wait for about 5-10 mins to check if Apps are able to download.4. Try looking into Microsoft Store logs in Event Viewer: Launch Event Viewer (Win+R and execute \"eventvwr.msc\"), and then click on the arrows in the left column to navigate to Applications and Services > Microsoft > Windows > Store > Operational.","then what do i do when on the operational tab in event viewer","You can check for any messages that would suggest why Microsoft Store isn't downloading or updating the your applications. If you need help reading those, please export them and upload it into a cloud storage (e.g. OneDrive) and share a link for me to download it.Use Actions > Save All Events As... and save as an evtx file."]},{"symptom":"Download Mouse Without Borders for Windows 10\/8\/7        Mouse w\/o Borders (http:\/\/www.aka.ms\/mm) makes you the captain of your computer fleet by allowing you to control up to 4 computers from a single mouse and keyboard. This means that with Mouse w\/o Borders you can drag and drop or copy and paste text, screen capture and file across computers.Mouse Without Borders is available from Microsoft Download with millions of downloads as seen on Microsoft Garage Wall Of Fame, Google, Bing, Twitter, Seattle Times, CNet, TechNet, Channel 9, TechCrunch, Engadget, PCMag, YouTubeWould you want to have an incredible mouse that can seamlessly move from one machine to another?Would you want to get risk of the KVM and be more productive working with multiple machines?If you are new to the idea of using a single set of mouse and keyboard to work with multiple machines or if you are having more or less troubles while using other software\/hardware KVM then you really wanted to give Mouse Without Borders a try. The first impression of a new user is “It is incredible! It is impossible!”Mouse Without Borders runs on all versions of Windows (VISTA\/2K8\/WIN7\/WIN8\/WIN10\/2016, X86 or AMD64)SetupAfter install Mouse without Borders, you will see a Setup dialog. You can also bring up this dialog anytime by clicking on the Mouse without Borders system tray icon on the taskbar.In the first machine, click NO on the first dialog. It will bring you to the second dialog where you see the security code and computer name. Keep the dialog open and go to the second computer.In the second machine, click YES to the first dialog then enter the information that you got from the first computer.Click LINK to link the two computers, after the computers get connected you can simply move the mouse cursor from one machine to the other passing the screen edge, keyboard input follows your mouse cursor to the other computers as well.After setting up your computers, you can bring up the Settings form by clicking on Mouse without Borders system tray icon or using the hot key Ctrl+Alt+M. Here you can add more computers, drag\/drop computer thumbnails to setup their position and change other options.More information on setup\/configuration:https:\/\/www.youtube.com\/results?search_query=mouse+without+bordershttps:\/\/www.pcworld.com\/article\/3258833\/peripherals\/hands-on-how-one-mouse-can-control-multiple-pcs-with-microsofts-mouse-without-borders-app.htmlNote: If you have a previous version installed in your computer, you can upgrade to the latest version by running this command (instead of uninstalling\/reintalling):msiexec \/i \"full path to the downloaded MouseWithoutBordersSetup.msi\" REINSTALLMODE=vamus REINSTALL=ALLMain featuresControl multiple computers seamlessly using a single mouse and keyboardPeer-to-peer system: Any machine can be a master machineMultiple mode: Keyboard\/mouse repeat in all machinesShared clipboard: copy text\/image\/screenshot from one machine and paste to other machinesDrag\/drop file across machinesSelective screen capture (Ctrl+Shift+S)Support on logon\/UAC desktopPersonalize Logon Screen - a plus feature for Windows 7 and newer version of WindowsCustomize keyboard layoutWhat is new in the latest version (2.1.8.0105 released on 17 Jan 2018)(Compared to the previous version released in 2016)Fix a race condition causing a deadlock in the app.Fix a bug where keyboard may not work in the remote machine when there is a full-screen Remote Desktop running in the host machine.More stable clipboard sharing.Fix mouse-jump issue in machines with custom DPI (monitor scale and layout is greater than 100%).Fix a bug where clipboard may not work with machine with very long name.Support IPv6.Add few more options for Easy Mouse (Enable, Disable, Ctrl, Shift) as requests from gamers since the Ctrl key is often used in games.Few other minor bug fixes and improvements.Known issues\/limitationCopy\/Paste between machines only works with a single file and the size limit is 100MB.Drag\/Drop between machines works with single file only and it does not work with network file.Copy\/Paste, Drag\/Drop do not work with folder and multiple files, the workaround is to zip them first.If the host machine has a full-screen focused Remote Desktop\/virtual machine window (or some kind of simulator window), the keyboard might not follow the mouse to the slaver machine. The workaround is to enable the option \"Hide mouse at screen edge\" on the Settings form or switch the focus to another window first.In Windows 8 & up, the mouse pointer might be invisible if there is no physical mouse attached to the machine. Plug in an unused mouse or turn on Mouse Keys in Control Panel.Some users mentioned having the KeysNotMatched error when reinstalling the app in one machine even typing in the same key. Restarting the app in both machines would help.Tips, tricks and FAQsWhy there is no longer an option to bind to a specific networkIn the latest version released about a year ago, the option to bind to a specific network is removed. Instead, the app connects using the right network automatically. The concept of network interface\/adapter is too advanced to a normal user, so we keep changing to give the best experience as possible where an user would not have to do so many configurations.Advanced users who still want to block the app via a specific network can still do so by blocking the app in Windows firewall on a specific network, see the last note in \"Firewall Settings for Mouse Without Borders\" below.Lock\/Unlock all machines at onceHit Ctrl+Alt+L twice to lock all machines. NOTE: If you use a Polish keyboard, Alt+L (to show up the'ł' letter) would be eaten up in the remote machine so you would better change this hotkey to something else:)To unlock all machines, first switch to multiple mode (default hotkey is hitting Ctrl 3 times fast) then keyboard will repeat in all machines.Ctrl+Alt+Del in the remote machineThis is supported in Windows 7 and newer versions of Windows. Please follow these steps in every machine, this needs to be done once per machine: 1. Enable SAS to allow the Services: a. Run gpedit.msc (Edit group policy) b. Go to Computer Configuration > Administrative Templates > Windows Components > Windows Logon Options > Disable or enable software Secure Attention Sequence, select Services in the Dropdown box.From now on you can use Ctrl+Alt+End is to simulate the CAD in the slave machine.Full-screen app\/game: losing focus when switching machineIf you experience this issue. unchecking the option \"Hide mouse at screen edge\" would help.Keyboard does not work in the remote machine when using full-screen Remote Desktop client in the controller machineSome full-screen apps would eat all key strokes so the option \"Hide mouse at screen edge\" mentioned above should be checked to work around this scenario.Mouse LagIf you use the app with a wireless connection in a busy network, you may experience mouse lag. A wired connection is recommended.Mouse move speed in remote machine is faster or different between vertical and horizontal directionsThis may caused by having multiple monitors in the remote machine. Checking the option \"Move mouse relatively\" would help.Mouse button swap is not preserved in the remote machineIn case you change the primary mouse button in Windows Settings, mouse data sent over the network is already reverted. So you should not change the primary button in the remote machine. In case the Settings are sync'd, you may want to turn the \"Syncs your settings\" off in Windows Settings.Disable\/Enable startup with WindowsTo disable the app from automatic startup when Windows starts, run this in the command line window: sc config MouseWithoutBordersSvc start=demand(You can also do that in the Windows Service Manager (services.msc))To enable the app to startup automatically: sc config MouseWithoutBordersSvc start=autoAdd a hotkey to start\/stop the app (enable\/disable app)Windows does support this for any app, you just need to create a desktop shortcut to the app (\"C:\\Program Files (x86)\\Microsoft Garage\\Mouse without Borders\\MouseWithoutBorders.exe\") then you can configure a hotkey for the shortcut :In the shortcut Properties' dialog, go to the Shortcut tabSet focus on the Shortcut key value.Type any key to set a desired hotkey, for ex.: type M to set the hotkey to Ctrl+Alt+MClick OK or Apply.The default hotkey to exit the app is Ctrl+Alt+Shift+Q and you can change that in the app's Settings.You can now use Ctrl+Alt+Shift+Q to exit\/disable the app and Ctrl+Alt+M to start\/enable the app.Firewall Settings for Mouse Without Borders(optional: How to disable the app on a specific network).Mouse without Borders setup automatically adds itself to the Windows Firewall allowed program list. But few users found these steps helpful in some cases to allow and customize the tool through Windows Firewall:1. Click on the Start button then click on Control Panel. 2. Click on Administrative Tools. 3. Click on Windows Firewall with Advanced Security. 4. Select Inbound Rules on the right tree. 5. Click on the New Rule... in the Actions list on the left. 6. Select Program option and click next. 7. Browse to select Mouse without Borders application (%ProgramFiles%\\Microsoft Garage\\Mouse without Borders\\MouseWithoutBorders.exe) and click Next.(In X64 machine the path should be %ProgramFiles(X86)%\\Microsoft Garage\\Mouse without Borders\\MouseWithoutBorders.exe)8. Select Allow the connection and click Next. 9. Select all options for “When does this rule apply?” and click Next. 10. Enter the name for the rule and click Finish. 11. The rule should now show up in the list, you can double click on it to view details and make change.12. Restart Mouse without Borders. * If you have multiple network interfaces, wired and wireless, you can also customize to allow the application on the type of interface in step 11 above – In Advanced tab, click on Customize. Mostly you would always want to allow the application through the Local area network. You may need to create both Inbound and Outbound rules to block the app on a specific network interface (wireless for example).Skip .Net check when installing the app (or manually install the app)The installer checks your system to make sure you have a required .Net version 4 before installing. Few users have reported that the installation is blocked even the .Net version is already installed. Some registry key is probably corrupted in this case, to work around this you can run the installer without UI option: msiexec \/i MouseWithoutBordersSetup.msi \/qnYou can also manually install the app using these steps:Create a folder C:\\MM  Download the file MouseWithoutBordersSetup.msi to that folder.  In an elevated cmd windows (run as Admin), run the following commands: msiexec \/a \"C:\\MM\\MouseWithoutBordersSetup.msi\" \/qb TARGETDIR=\"C:\\MM\\Bin\" \/l*v \"C:\\MM\\Install.Log\" sc create MouseWithoutBordersSvc binPath= \"C:\\MM\\Bin\\Microsoft Garage\\Mouse without Borders\\MouseWithoutBordersSvc.exe\" start= auto DisplayName= \"Mouse Without Borders Service\" Manually add the program (C:\\MM\\Bin\\Microsoft Garage\\Mouse without Borders\\MouseWithoutBorders.exe) to the firewall exception list (allow it through firewall). You can now create a desktop shortcut to \"C:\\MM\\Bin\\Microsoft Garage\\Mouse without Borders\\MouseWithoutBorders.exe\"Troubleshooting share clipboard issue(Applicable to version 2.1.7.1212 and up)A good number of users have reported that clipboard sharing may stop at a time and they would need to do something to bring it back like restarting the app, reconnect (Ctrl+Alt+R), click Apply on the Settings form. Just in case you want to find out why it stops working in your environment, here is how it works and how to look at the local log:Clipboard monitoring is done by the helper process MouseWithoutBordersHelper.exe so you want to make sure this process is running and MouseWithoutBorders can talk to it (the mini log should has a line likeHelper:<APositiveNumber>, and a full log should have this line: Trace: Clipboard monitor method AddClipboardFormatListener is used.)When a text is copied, there should be a blinking blue dot on the app system tray icon: and looking at the full log you can find something like[258] = 12\/19 15:43:17.236(15)FROM HELPER: GetClipboardText:TXT = 79, RTF = 0, HTM = 0.[259] = 12\/19 15:43:17.236(15)CheckClipboardEx: ShareClipboard = True, data = String.[262] = 12\/19 15:43:17.236(15)Plain\/Zip = 240\/153[263] = 12\/19 15:43:17.236(15)SetToggleIcon: 2which tells that a text was placed into the system clipboard at 15:43:17 and the app's ShareClipboard option is On. (Btw you can get the full log by click on Generate log in the app's system tray context menu).The text is then sent to other machines and you would also see a blue blinking dot like above in other machines telling that they got the text. You would see some lines like this in the full log of the app running in other machines:[4007] = 12\/19 15:43:17.296(43)0.08KB of TXT <-[4008] = 12\/19 15:43:17.296(72)0.08KB of TXT <-[4009] = 12\/19 15:43:17.296(43)SetToggleIcon: 2The app uses the Clipboard.GetText and similar APIs to access the system clipboard which may also be used by other apps running in your machines. If multiple apps access the clipboard concurrently it may cause an error, we work around that by retrying for a few times. If a large image is in the clipboard, retrying may not help in a slow machine and you would see this line in the full log: Requested Clipboard operation did not succeed.Change the TCP port that the app listens onMouse Without Borders listens on ports 15100 and 15101 by default. If you get an error on port conflict. There is probably another app running in the machine using the same ports. To see which program is using those same ports, you can run these commands in the cmd window:netstat -nao | find \"15100\"netstat -nao | find \"15101\"The last column of the console output from the commands above are the process ids, you can then look up for the process name from Task Manager.To avoid the port conflict, you can either configure the other app or Mouse Without Borders to use different ports.To configure Mouse Without Borders to listen on different ports (for ex. port 12345), follow these steps in all machines:Download psexec and save it locally -https:\/\/docs.microsoft.com\/en-us\/sysinternals\/downloads\/psexecRun the following command in an Admin\/elevated cmd window: psexec -i -s reg add HKCU\\Software\\Microsoft\\MouseWithoutBorders \/v TcpPort \/t REG_DWORD \/d12345 \/fRestart Mouse Without BordersPersonalize logon screen using local pictures1. Create one folder named MouseWithoutBorders under \\Windows\\Web\\ directory. 2. Drop your photos there (jpg only). 3. In a cmd windows, run del \"%USERPROFILE%\\AppData\\Local\\Temp\\Low\\MM.Local.Indexer.txt\" then restart Mouse without Borders.Customize your keyboard layoutYou may want to play around with your keyboard layout by mapping a virtual key to another one, you can come up with a new layout you would invent:) This feature is for advanced users only.For example, if you want to convert your QWERTY keyboard to a DVORAK keyboard then these are steps: Run the following commands as Admin to set the virtual key mappings (you can also use Regedit to do this): reg add HKLM\\SOFTWARE\\Microsoft\\MouseWithoutBorders \/v VKFrom \/t REG_SZ \/d \"081,087,069,082,084,089,085,073,079,080,0219,0221,083,068,070,071,072,074,075,076,186,222,090,088,067,086,066,078,188,190,191,189,187\" \/f reg add HKLM\\SOFTWARE\\Microsoft\\MouseWithoutBorders \/v VKTo \/t REG_SZ \/d \"222,188,190,080,089,070,071,067,082,076,191,187,079,069,085,073,068,072,084,078,083,189,186,081,074,075,088,066,087,086,090,219,221\" \/f In the Settings form, check the option Use Key Mappings then you are good to go (default hotkey to toggle this option is Ctrl+Alt+Shift+K).This is just an example. FYI, Windows does support Dvorak layout, the difference here is that this app skips the mapping when Ctrl key is down so Ctrl+[X,C,V] work as original layout.Discussions\/Posts in other languagesマウス \/ キーボード を、複数のパソコン間で共有する!Mouse without Borders: Vier PCs, eine MausUtilize vários computadores com apenas um mouse e um teclado!Mouse Without Borders : une souris pour plusieurs PC讓滑鼠破「窗」而出的免費 Microsoft KVM 程式Un mouse una tastiera per 4 PC: ordine sulla scrivaniaMouse without Borders – управляем четырьмя ПК одной мышью и клавиатуройMicrosoft 복수의 PC의 마우스, 키보드를 LAN에서 공유가능하게 하는 Mouse without Borders 공개Mouse Without Borders, kendalikan banyak komputer dengan satu mouseĐiều khiển nhiều máy tính với 1 chuột 1 bàn phímUsers love Mouse Without BordersAs you are reading this far, you probably have good reasons to try out the app ^.^! And here is an additional reason: Can you name a piece of software that has a lot of love from users as radom expressions longing for years on twitter:Mouse Without Borders is why I believe software is made of miracles.Mouse without Borders has to be the most under appreciated, underrated app that has ever come from @microsoft.I've just discovered Mouse without Borders and it's everything I've ever dreamed of ^_^ Controlling two laptops with one mouse & keyboard!Mouse without Borders is definitely toward the top of my list of favorite software apps of the year. Very useful.Mouse Without Borders, \"That's weird. That's wrong.\"Dear lord this thing is amazing. Mouse Without Borders is a lot more stableMouse Without Borders: One of the best things i've seen in my entire life.Microsoft Garage, I draw my hat before you. MouseWithoutBorders is just one of the most awesomest things.Mouse without Borders - How did i not find this earlier...what a brilliant piece of kit!Wow! Life changing Microsoft download: Mouse Without Borders! Oh, little program, where've you been all my life?Mouse without Borders is such a great software, it's a shame too many don't know about it and how well it works.mouse without borders is finally giving my laptop purposeSeriously - why did I not install Mouse without Borders before now - it is amazing! 1 workstation + 2 laptops with 1 keyboard & mouse!Mouse without Borders is awesome! It should just be a native part of #WindowsMouse without borders is the most practical thing ive seenHow in the heck did no one tell me about Mouse without Borders before now??!?!?Mouse Without Borders by @Microsoft is the best thing that has happened to me now that I have 2 laptopsHow have I not heard of \"Microsoft Garage Mouse Without Borders\" before? Now I don't want to sell my @surface proMouse without borders. Fantastic idea amazing implementationLoving the Mouse without borders. I just felt free now I can fly. @Microsoft #microsoftGarage teamOMG!  Why am I only just now learning about Mouse without Borders. LOVING IT!!!!Mouse Without Borders is quite possibly the most amazing thing ever.I don't know how I lived before using \"Mouse Without Borders\" to get my mouse\/kybd to work across both my Surface Pro 2 & Lenovo X1 CarbonBest thing discovered today - Mouse without BordersMouse Without Borders is, by far, the best software product I have ever used.Mouse Without Borders has changed my life. Makes working from home 100 times better. Seamless switching from gaming rig to workstationLoving my mouse without borders! It's made my workflow so much smoother.So, Mouse Without Borders just completely changed my \"work life\"...! Check it out.Mouse Without Borders is a lifesaver when working from my home PC with my Surface next to it. SeriouslyMouse without Borders is amazing by the way. Can't believe it took me this long to start using it.Shout out to Mouse Without Borders. Working from home would be SO much more difficult without it. Allows me to use my primary mouse\/keyboard between my laptop and desktop seamlessly. Love it!Mouse without borders installed. What are you folks turning me into? Scary good. Catching up on technology clearly.I just showed WyldJr the awesomeness that is Mouse Without Borders and she now thinks I'm a cool wizard.My desktop, notebook and me are in love to mouse without borders.  Great piece of software.Have had multiple computers for a few years yet inexplicably had not ever looked into Microsoft Garage Mouse without Borders. Now I have and I really wish I had done it a long time ago...With mouse without borders my life is now complete. Freely use mice and keyboard between separate computersMagic Mouse fun factsThe original name of the app was Magic Mouse where I named it when starting this little project in Jun 2008. The beta version was created in probably a week with total of 34 downloads.According to statistics, the app has been downloaded by all 193 countries millions times. North Korea did make one completed download - guess who?:)Japanese likes to share information about the app as many posts on Twitter are in Japanese.Few users recognize that the app symbol (icon) does look like a mouse:) - Quite a few users do not know that keyboard works with the app too:) that keyboard does follow mouse to the remote machine. We probably got the name wrong.A good number of internal Microsoft folks thought the original developer of the project has gone from Microsoft as they checked the git history but I actually got my alias changed once. This is also my little longest project that I have been with.The project is user-driven, users use it and keep sending feedback and asking for little things. Some did provide idea and fixes. This was the UI of the first version in 2008, pretty empty but surprisingly it works now in Windows 10 without recompilation:And here is the current UIs: *Modified title for accuracy**Original title: Mouse Without Borders (#mousewithoutborders, http:\/\/www.aka.ms\/mm)*","solutions":["Very nice application, but it might need some optimizations.As it is now, unfortunately I can't use it. I have a 1000Hz gaming mouse, and that high update rate seems to cause a lot of lag after I move the cursor to the remote computer, a Surface Pro 3.","Once it works, the app should not depend on mouse\/keyboard hardware. Are your machines on wireless? A wired connection works better for this app.","Well, it actually seems to depend somewhat on the mouse hardware, because lowering the update speed on the mouse to 125Hz made the problem go away. Obviously I don't want to use the mouse at 125Hz when it supports 1000Hz, especially when gaming.But you are right, the Surface Pro is on a wireless connection, and unfortunately it seems Wi-Fi routers, no matter how expensive, still need periodic reboots to perform properly. That one reason I have my laptop connected to the router (an Asus RT-AC66U) with a long cable.When I did my initial tests the speeds were still over 20mbit over wireless, so I assumed it wasn't time yet for the periodic router reboot. But rebooting the router completely fixed the problem, now the mouse works properly even at 1000Hz.Thanks for pointing me in the right direction.","Please explain what \"Easy Mouse Mode\" is, I don't see an explanation in the documentation.","You can hover over the options to see what they do. Easy Mouse means you can just move your mouse cursor to the other computers freely.If you disable it, you will have to press the Control key when you want to move the mouse cursor to other computers.","I want to ask a question about Mouse w\/o Borders..Firstly, I have 1 computer with 2 mouses and 1 keyboard and another computer without any mouse and keyboard.How can i switch only 1 mouse and 1 keyboard? In other words how can i make 1 extra mouse to stay directing the primary computer when i switched to the other computer?If \"Mouse w\/o Borders is not capable of doing this do you know any solution in application level? Otherwise, i have to buy physical switches i guess.","Where is windows phone companion app?","Sorry, it has been gone for long. We no longer support Windows Phone.","This is unsupported and we have no plan to support this narrow scenario, we are sorry about that!","Is there a way to disable File Transfers? I don't see this option in settings or in the registry.Thanks."]},{"symptom":"But they didn't want to reactivate with their original keys        Split from this thread.So I have a similar problem, I have identical systems with dead HDs that because updates are a mess, a reinstall did not work (updates failed about halfway along and would not continue, yes I installed all the KBs associated with that problem). I have a healthy fully-updated system that I can clone to these other systems new HDs, but that mungs up activation. But they didn't want to reactivate with their original keys. Now what?No, I am not installing Windows 10. Win10 drove me to linux. At least once my eyes stopped bleeding.ETA: could not get through to phone activ. Chat support is just a bot, useless.","solutions":["I have many clients who are sticking with Windows 7.  I recommend you do as I have and do a complete re-install in the next few days.  Creating a system image that will allow you to recover a complete system regardless of Windows 7 \"support\".  You will find my detailed process that if you follow to the letter, I guarantee will work, presuming you are working with sound hardware.  I have followed this precise process more than a hundred times (literally).https:\/\/www.askwoody.com\/2019\/canadian-tech-how-to-rebuild-a-win7-system-with-minimal-snooping\/","Split from this thread.So I have a similar problem, I have identical systems with dead HDs that because updates are a mess, a reinstall did not work (updates failed about halfway along and would not continue, yes I installed all the KBs associated with that problem). I have a healthy fully-updated system that I can clone to these other systems new HDs, but that mungs up activation.But they didn't want to reactivate with their original keys. Now what?No, I am not installing Windows 10. Win10 drove me to linux. At least once my eyes stopped bleeding.ETA: could not get through to phone activ. Chat support is just a bot, useless.You don't have the same or similar problem as the other poster.And you start your own thread here.You are correct; you can't clone one computer's hard drive to othe other computers and expect then to then be activated.You are transferring licenses.We don't work for Microsoft and Microsoft are the ones who say yay or nay to activation problems.How to See Your Windows 7 Licence Informationhttps:\/\/www.sevenforums.com\/tutorials\/19921-license-information-windows-7-a.html____________________________________________________List of Activation error codes and what to do about them:Error message when you try to activate Windows 7 or Windows Vista: \"An error has occurred\" Contact Microsoft:The COA sticker, which has the Product Key on it, is either on the underside of the Laptop or in the Battery Compartment.With a Desktop it is either on the side, rear or top of the Computer Case.Activate Windows 7 or Windows 8.1 - Windows Help - Microsoft SupportWhen you begin activation, Windows will try to use your Internet connection to activate online. If you have problems activating online, you can activate using the phone.___________________________________________________If you have to use Phone Activation, read this detailed information about using that method:\"How to Activate Windows 7 by Phone\"http:\/\/www.sevenforums.com\/tutorials\/18715-activate-windows-7-phone.html_________________________________________________If you have problems using that method contact Microsoft Support:To contact Microsoft Support:Contact support         http:\/\/windows.microsoft.com\/en-us\/windows\/contact-supportAlso: https:\/\/partner.support.services.microsoft.com\/en-au\/contact\/menu\/software\/windows\/setup\/"]},{"symptom":"Shortcuts to one drive folders        Can I create a shortcut on my desktop to a one drive file folder?","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Yes you can. I'm assuming you are accessing OneDrive via the app and not the website - in which case you can make a shortcut the same way as any other folder:Right-click on the folder you want a shortcut for and choose \"Copy\", then go to your Desktop right-click in a space and choose \"Paste shortcut\" - that's it.Be sure to choose \"paste shortcut\" and not just \"paste\" - if you choose \"paste\" it will actually make a copy of all the files on your desktop and duplicate them.Regards, David"]},{"symptom":"Problemas con disco duro externo        Tengo un disco externo de 3 TB, el cual esta particiónado en Vol (E)de 2048, 00 GB NTFS,  partición primaria y el segundo sin letra y de 746,52 GB No asignado. Pero al darle botón derecho del ratón  pone propiedades y ayuda las demás cocciones cerrada.como puedo utilizar o reparar esa unidad","solutions":["Hola Jomahoto, mi nombre es Angelica, soy una asesora independiente y tratare de ayudarte el día de hoy.Lamento que tengas este inconveniente con tu disco, pero juntos lograremos resolverlo.Te comento que hay ciertas condiciones que aplican para el reconocimiento de almacenamiento en discos como el tuyo ( 3 Tb)En el siguiente enlace Julian G. 6678 explica cuales son estas condiciones que debe cumplir tu sistema y el tipo de tabla de particion que debe tener tu disco externohttps:\/\/answers.microsoft.com\/es-es\/windows\/for...Espero que esta información te sea de utilidad. Quedo atenta a tu respuesta Saludos, espero que tengas un excelente día. Angelica.","Gracias Angélica, veremos si lo puedo solucionar con vuestras ayudas. Ya os lo comentaré.","Excelente Jomahoto. Quedo atenta a tu respuesta","Gracias por todo, pero no entiendo del tema. He instalado varios programas para solucionarlo pero nada de nada. Estos son los programas hpusbdisk; EaseUS Partition Master 12.9 y Wondershare Recoverit.Lo dicho Gracias por todo.","Hola Jomahoto, si no conoces mucho el tema de particiones y tablas de particiones, te recomiendo llevar el disco a un tecnico especiaista que este al tanto de lo que se debe hacer.Por otra parte tu sistema es de 64 bits??? esto lo puedes verde la siguiente manera:Presiona la combinación de teclas Windows + S, en el cuadro de texto escribe “Panel de Control”, sin comillas, luego da click en “Sistema”, cambiara la ventana y en el apartado Sistema, podras ver Tipo de Sistema allí te indica si es de 32 bits (x86) o 64 bits (x64) Quedo atenta a tu respuesta Saludos Angelica","Este disco lo tenia en un W Vista 32 bits,  pero con este problema. Me dijeron muchas cosas sobre la perdida.Ahora tengo un W 10 64 bits y he querido aprovechar este disco externo y solucionar dicha perdida.Gracias ya te contare. ","Excelente, solo te hace falta es cambiar la tabla de particion de mbr a gpt en tu disco externoQuedo atenta a tu respuesta","Supongo que debo de unir las dos particiones.He estado viendo este:  video https:\/\/www.youtube.com\/watch?v=uEV1WiOUp-4Pero tengo el temor de estropear el volumen E .Yo solo lo quiero para guardar datos, no instalación de w. Muchisimas gracias y perdona las molestias.","Hola Jomahoto, si das click dercho o anticlick, en el area que te resalto en la imagen, te muestra la opcion de convertir a gpt???Recuerda respaldar los datos de tu disco externo antes de hacer el cambio. Quedo atenta a tu respuesta","Hola Angélica, esta opción esta capada. Gracias y perdona las molestias."]},{"symptom":"HTML and CSS files are being labelled as \"file\" under type, I don't understand why it's not registering as HTML or CSS        I'm working on a website and I can't seem to preview my code. It took me a while to realize, but none of my files are saving as HTML or CSS files, but instead just as \"File\". In case that's not a good description, under \"Type\" in the file explorer, it's just saying File. I've never had this issue before, I don't have a clue what's wrong. I've tried to fix it through my code editors, both Notepad++ and Brackets, but nothing seems to be working. Hopefully that screenshot clears things up a bit. Please send help, thnx","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.I think all that you need to do is add the file extension to the end of the file name e.g. .html or .cssThen file explorer will pickup up the correct file type. Regards, Ross"]},{"symptom":"\\typing a letter windows 8        I can type letter in windows 7 no problem, but when I send It to the printer, it splits the line and prints it I two parts with the second line below to the extreme left margin","solutions":["Do you have Windows 7 or Windows 8 (or Windows 8.1)?Regardless of what version of Windows you have, what program are you using to type and print your letter --NotepadWordPadMicrosoft Word (what version? For newer versions, click File > Account; otherwise, Help > About)?Some other program (please identify by name and version)?What is the make and model of your printer?Has this situation always been the case?  If no, what happened to your system shortly before this sort of behavior started?","Thanks for your help, but I tried again, out of desperation, as I needed the letter asap.  and it worked perfectly. I don't know what glitch was but it cured itself.  I'm off shortly to buy a new desk top with windows 10 , should avoid this reoccurring ."]},{"symptom":"Printer does not print anything        Hello. I am having printer issues. When I print from the first screen, a blank page is printed. However, when I print from the second screen, it works just fine. How can I make my computer either print properly from the first screen or print always from the second screen? I am 100% sure there are no ink issues. Test pages and images printed from the second screen print perfectly. Thanks!","solutions":["Hi Tasteylunch, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.As a first diagnosis, I recommend you follow and apply the steps of this official Microsoft link, can you start at points 4,5,6 and 3. Does it happen with all kinds of documents? In all formats? As Office applications, Pdf.Fix printer connection and printing problems in Windows 10 https:\/\/support.microsoft.com\/en-us\/help\/401540...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M."]}]}