{"windows":[{"symptom":"Windows Mail setup for Verizon (now AOL) account        I just got a new PC with Windows 10, and for some reason cannot get the Windows Mail app to sync with my Verizon \/ AOL email account.   (Verizon email was bought by AOL some time back; email address and server settings are still Verizon though).    I'm using all the same settings as my previous PC (Windows Live Mail) as well as several other devices (phones).   So I know the settings are correct, however the Mail client will not sync (retrieve email to Inbox).   Help please!Using:Incoming email server pop3.verizon.net:995Outgoing email server smtp.verizon.net:465Authentication on both incoming and outgoingOutgoing is POP3 serverThanks","solutions":["Hi Jas. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See here how to add a Verizon AOL Account to Windows 10 Mail: https:\/\/help.aol.com\/articles\/how-do-i-set-up-o...Keep me posted on your progress as I will be here to help until the case is resolved.","Thanks, but I have tried all that, and it does not seem to work.   Is there any way to diagnose what's going on under the hood (e.g. error code), short of using something like Wireshark?One thing to note is - Microsoft appears to have incorrect information or the POP and SMTP settings for AOL for the Verizon.net domain*.   These subscribers (including me) still use the pop.verizon.net and smtp.verizon.net addresses.  The aol.com addresses do not work for me; if I try to use these anywhere (e.g. on my phone, or old PC) they fail, and when I change then back to verizon.net they work again.(*referring to: https:\/\/support.office.com\/en-us\/article\/pop-and-imap-email-settings-for-outlook-8361e398-8af4-4e97-b147-6c6c4ac95353)Perhaps this is related to my problem?   I notice that when I first try to set up my Mail account, that it defaults to the aol.com addresses, based on my verizon.net email address.   I can change the outgoing and incoming server settings, to verizon.net, but it still doesn't work.   Perhaps the Email app is overriding my changed settings with its assumption (incorrect) that all verizon.net email addresses must use aol.com?Edit to add:Two new things:I see from dnschecker.org that pop.verizon.net and pop.aol.com both have two associated IP addresses, and they are the same.  (74.6.137.86 and 66.218.85.35)    So either should work theoretically; however in practice this seems to not be the case, since verizon.net is the only one that works on my devices.I did install Wireshark and run it.    When I look at the trace I do see it contacting pop.verizon.net at 66.218.85.35 and communicating with it.   Hard to tell what's going on though.Edit 2:Outgoing email does work.  I am able to send email from the Mail client successfully, and verify on other account (gmail) that it went through.   Only incoming is not working.Edit 3: One other thought \/ question.   I don't see any option in the client for when the emails on the server are to be deleted.  E.g. in Windows Live Mail has a \"Leave a copy of messages on server\" checkbox, and if that is checked there is a \"Remove from the server after NN days\" setting.   The lack of these settings in the Mail app makes me think there is a different sync mechanism in this app, and I'm wondering if this sync mechanism is what's blocking me from retrieving emails.  (?)  ","This reminds me of how Yahoo accounts get hijacked by ATT. After going through a year of trying to liberate my parent's Yahoo account from ATT they haven't had for years, I would recommend anyone who finds themselves in this situation not waste the hours I have trying sort it out with Support Levels 1-2-3 but instead simply start a perfect new Gmail, Outlook or Yahoo account to free yourself. Easily add it to Windows 10 Mail, transfer contacts into the new account,  forward your old mail to the new account and notify contacts - all easily searchable how-to via google. Otherwise I cannot assure you that it will ever end, only drive you crazy in a New Year you could instead liberate yourself from them.","Well that's not really helpful.   This *should* be an easy thing.   Email clients that use POP have been around for decades, of course, this isn't new.   Forwarding emails to another account isn't really a useful solution, since that breaks the \"reply\" functionality that you can't really live without.   We have probably hundreds of contacts that use this email address.","There is a solution reported here in Verizon forums to try: https:\/\/forums.verizon.com\/t5\/Verizon-net-Email...I also found this guide for problems with AOL mail: https:\/\/help.aol.com\/articles\/why-cant-i-access...","There is a solution reported here in Verizon forums to try: https:\/\/forums.verizon.com\/t5\/Verizon-net-Email...I also found this guide for problems with AOL mail: https:\/\/help.aol.com\/articles\/why-cant-i-access...Thanks.   I had seen that second link, but not the first.   Unfortunately that didn't help any - it still doesn't retrieve it whether the \"allow apps that use less secure login\" item is selected or not.   It appears that option is being removed in two months anyway; as a matter of fact in my case it was already set to \"less secure\"; I tried changing it to \"more secure\" and the option now no longer even shows up.   In fact that actually broke all my other email clients!   Argh.","Did you try IMAP Settings here: https:\/\/help.aol.com\/articles\/verizon-move-to-a...","Indeed yes I tried that.The Microsoft Mail app actually doesn't even ask for IMAP vs POP when the account is first created - it only prompts for email address, name, and password, and gives just the option to \"sign in\" or \"cancel\".   Then after clicking \"sign in\", it says \"All done! Your account was set up successfully\", but then about 5 seconds later a message pops up \"Your Verizon account settings are out-of-date\".    Then when I go to look in my still-empty Inbox, a yellow banner pops up across the top of the Mail screen \"We couldn't access this account: Verizon.  You might need to update your password or give the account permission to sync to this device\".   I'm 100% sure the password is correct.    (I can get using webmail just fine)Only then does it give me the option to change the server settings.   I guess the Mail app assumes a set of default server settings based on the email address that's input (?)Interestingly - it appears that just today the default settings have changed for verizon.net accounts.   Yesterday the default was: - pop.aol.com for incoming - smtp.aol.com for outgoingToday it is now: - imap.mail.yahoo.com for incoming - smtp.mail.yahoo.com for outgoingThough it doesn't seem to matter what server addresses I use - none of them work.Thanks for your help, by the way - it is appreciated.","Hi jagstock My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Try the following settingsIncoming Mail Server: imap.aol.com(Use port 143 for standard or 993 for SSL connections).SMTP Outgoing Server Address: smtp.aol.com.Set the port to 587.Hope this helps.","OK so here's an update.I did try the settings you mention JonBland - still did not work.   (I had tried them several times before, but tried again just to make sure).    One thing that's confusing in the MS Mail app is how\/where to enter the port number.   All the other apps I've seen have an explicit port entry field for that, but not MS Mail - all it has is a server field, and it appears you're supposed to use a colon to add the port number after the server name (right?).   E.g. I'm doing this for my attempts:Still not working though.I think the problem is this - AOL apparently has some uniqueness to the way they do IMAP protocol, that has to be accounted for in the email client.   Other email clients support this, but it appears MS Mail does not.I was able to get this working on Android, and iOS.   In both of those cases when setting up an email account on the client, there is an explicit entry for AOL.Android:iOS:However MS Mail has no such entry for AOL:Instead you have to use the generic \"Other account\" account type, but that's not working.  (I did try Yahoo, since I know there's some affiliation with AOL, but that didn't work either)I'd love to be able to get this working on my Windows 10 PC, but have yet to figure out a way to do it.   FWIW I'm trying other email clients, e.g. Thunderbird, but not able to get it working there yet either.   I'd like to be able to use MS Mail if possible still.Thanks."]},{"symptom":"Time zone of Find my Device        What's the timezone of the time stamp on Find my Device? GMT?  Desktop time? Thanks.","solutions":["Hi Gini The 'Find my Device' should report the location of your device using the time zone you are located in when you access that functionality, it is not fixed to GMT and does not use the timezone of your laptop, if that is different from your own time zone . . .","Thank you, Dave How certain are you about the time zone? I am working with the cops & looking at the CCTV recordings. Just so you know there are different time zones involved in my case. Time zone where the desktop was last found Time zone on my desktop Time zone of my Microsoft account Time zone of location where I am checking Find my device from now","Hi Gini I am positive, the time zone you see in the 'Find My Device' functionality is reported in relation to your current location where you are checking that from now . . ."]},{"symptom":"photos        How can I get rid of the blue around pictures and the little box with check mark. To move several pictures you have to click on each one!! Also do not like .jpg at end of each. This all started on Jan. 1 2020, what did you do?","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.For some reason a couple of your File Explorer options have changed - I'm not aware of any update which would have caused this... however it's pretty easy to adjust back the way you want it...Open a folder where you're seeing the checkboxes, etc, in the menu at the top click VIEW, then from that menu ribbon click \"Options\" and then \"Change folder and search options\"In the window which appears click the VIEW tab... then have a look in the list under Advanced Settings and find these items:\"Hide extensions for known file types\" - TICK this \"Use check boxes to select items\" - UN-TICK this Click Ok, and it should be back the way you want. Regards, David"]},{"symptom":"Canon Pro 100 Won't Print Photo        Just recently, my printer won't print photos.  So far, I've tried turning it on and off, all ink is full, Canon Photo paper in, and made sure it's the default printer, etc.  The printer will print a page from a random Word document and it prints a test page.  Yesterday, also had trouble getting it to print a whole page, kept leaving out the middle.","solutions":["Hello DEBRAHIGGINS, I am Andrew an independent advisor. Did Windows recently install an update? If so I recommend uninstalling it. To do this go to Settings>Security & Updates. Left column has an option to uninstall updates.If thats not the case youre best to remove thr printer software via Settings > Apps. Then remove the printer in Settings > Hardware.Once all this is removed reboot your computer. Download the latest software suite for your printer and reinstall everything.The problem you are describing sounds like a software error between your computer and printer. This should resolve the issue.Take Care,Andrew"]},{"symptom":"Windows 10 won't recognize headphones. Tried everything.        Hello! So about two weeks ago, my computer was working perfectly fine, but eventually it just stopped recognizing the headphones.I did a research on how to fix it, but I have tried everything and nothing has fixed it.I REALLY need this to work, please, help me.So, what I've tried so far:Reinstalling the driversUpdating the driversDowngrading the driversEntering Realtek audio manager, but it won't appear in my Control PanelReinstalling Realtek audio manager, still it won't appearI tried buying a USB adapter, still it won't recognize it (I thought it may have something to do with the headphones connector, but no)Updating Windows 10Changing the settings in the B&O play, but nothing changesSetting headphones as default, but they don't appear, it only appears Speaker\/Headphones and it is already set as default. When I change to a different audio manager, the headphones appear but I can't set them as default.Alright, that's everything I've tried so far. Honestly, I don't know what else to do so please, help me...My computer specifications:HP avilion-360Windows 10 64 bitsFor some reason, the troubleshooter says the connector for the headphones is on the left side, when is actually on the right side (could this be the source of the problem?)Anyway, thanks in advance.","solutions":["Hi RocioLinares, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.You can try the indications of these links, they are websites that share Windows MVP, so, it is verified information, the steps that you have previously executed, if you want to skip it and continue with the following, or you can apply it again.https:\/\/thegeekpage.com\/fix-headphones-not-show...https:\/\/www.lifewire.com\/fix-headphones-not-wor...If none of the indications gave the solution, you can start Windows through a clean boot, it is an error-proof process, so we can detect if it is any third-party program or driver that causes the problem.https:\/\/support.microsoft.com\/en-us\/help\/929135...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hello,First of all, thank you so much for answering my question.I tried the solutions on the first link, but I couldn't fix the problem. Reinstalling didn't work and I don't have the \"sound\" option on the volume icon so I couldn't do that one.I couldn't do the third one either, because the \"GlobalSettings\" part does not appear in my directory so I couldn't edit the registry.The last one didn't work.I followed every option on the second link and still nothing.I tried the clean boot as well, but didn't find anything. I even ran a full scan on my computer with an antivirus to see if it was a virus, but no.And I know it is not a hardware problem because those earphones and headphones work perfectly fine on my ipad and cellphone, and my computer doesn't recognize not the normal headphones nor the USB ones..."]},{"symptom":"add title to photo        I just cannot find where in edit I can add a title to a photo.","solutions":["Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.You may open the photo in Paint 3D and add a text as the title. For more detail on this solution, check out this video: https:\/\/youtu.be\/ysGpnmnDuUU Please let me know if I can help you further!"]},{"symptom":"windows live mail        windows live mail. When I try to send email ,error ,disconnect from sever. can't send email at all.","solutions":["speak with your email provider.  Chances are you have the wrong email settings.","I called provider they said settings ok , call MICROSOFT.","They gave you a bad answer to get rid of you.  What is the name of your internet mail provider???","They gave you a bad answer to get rid of you, who did that?COMCAST","Simply do a Google search and you will find your answers:https:\/\/247emailsupport.freshdesk.com\/support\/solutions\/articles\/30000031705-comcast-email-settings-how-to-configure-smtp-and-imap-email-setting-for-comcast-net"]},{"symptom":"Downgrade Windows 10 Pro to Home and Transfer Key        I bought a laptop and had Windows 10 Home on it. Later, I got a key for Windows 10 Pro, and upgraded my laptop. I recently got a new desktop, and would like to use that pro key on it rather than my laptop. I tried the downgrade steps in this articlehttps:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-windows_install\/downgrade-from-windows-10-pro-to-home\/345f5464-cb7a-44b3-8856-237cbec072c8 but they didn't work, it tried to reinstall Windows 10 Pro. Is there a way to do what I'm wanting to do, or will I just need to buy another copy?","solutions":["Hi sotaur The only real way to downgrade form the Pro to the Home edition of WIndows 10 is to backup your data, clean install Windows 10 Home, restore your data and then re-install all your 3rd party applications . . .With regards to moving your Windows 10 Pro licence to another PC, is that a Windows Pro upgrade licence you purchased or a full Windows 10 Pro licence?Also, was WIndows 10 Home originally pre-installed on both devices?","If I remember right, the laptop had Windows 10 Home pre-installed, the desktop did not. The key I had was a key I could use for any version of Windows 10, something I got as a student, so I think we can consider it a full license.","Hi sotaur Thank you fro that clarification . .. You will need to clean install WIndows 10 Home, on the laptop to downgrade that, then to upgrade the PC to the Pro edition, please follow these steps:Open the Settings App (Gear icon on your Starr Menu) Go to Update and Security - Activation Click Change Product key Enter this generic product key: VK7JG-NPHTM-C97JM-9MPGT-3V66T When prompted, click 'Activate Product' If the above does not work first time, temporarily disconnect from the Internet and click 'Activate' again . ..(Note the generic key will cause your system to upgrade to the Pro edition, then your own legal licence should activate automatically)If you do encounter ant activation problems with the Pro edition, your best option is to contact Microsoft Support and ask them to help you re-activate your Windows 10 Pro on the PC . . .Call\/Chat\/Schedule a Call https:\/\/partner.support.services.microsoft.com\/...Or choose a local Phone Number: https:\/\/support.microsoft.com\/en-us\/help\/13948\/...","Hi I sort of have the similar problem. M laptop is pre installed with Win10 Home but I upgrade it to Pro. And now I'm downgrading it to home because the Pro doesn't have activation code. Once I downgrade to home will it automatically activate?","If I remember right my laptop activated automatically after I reinstalled Windows 10 home."]},{"symptom":"Win Server 2019 Eval to Standard        Dears , I have installed win server 2019 Eval Edition on multiple servers and configured them , now I am trying to upgrade them to standard edition with no use I have a VLSC key Don't want to make all these configuration again if anyone can help Thanks","solutions":["Hi Ahmad, Server and IT Pro questions are best handled on our sister Site Technet as this is only a Windows consumer only forum:https:\/\/social.technet.microsoft.com\/ForumsPlease choose the most appropriate category on Technet forums from the left.","Thanks alot"]},{"symptom":"upgrade failures: Version 1809 didn't install error code 0xc190001e1 now 1903 is try to automatically install error code 0xc19000101        My version 1809 didn't install correctly and now the Version 1903 upgrade seems to be default so version 1809 can't install","solutions":["Hi Ken, Microsoft have released version 1909 of Windows 10, click the link below, then click 'Update Now' on that page to immediately get 1909 and bring your PC right up to datehttps:\/\/www.microsoft.com\/en-us\/software-downlo...If you have any difficulty with that 'Update Now' link, with these major upgrades, the most successful method is to upgrade from the Windows 10 ISO - you download the ISO and then perform an Offline UpgradePlease Note, if you follow these steps, this is just an update, not a clean install of Windows 10 and your files and apps will remain untouched . . .Click this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), then choose ISOWhen the ISO file completes downloading Disconnect from the Internet Temporarily disable any 3rd party Anti-virus you may have installed Then, double click the ISO and then run Setup.exe to begin the upgrade . . .","Hi, Try updating to 1909 using Media Creation tool and if it fails, share the logs.The fastest way to get the upgrade is through Media creation tool or ISO file.Please download Media Creation Tool from the link below and select Upgrade this PC at the first screen.https:\/\/go.microsoft.com\/fwlink\/?LinkId=691209All steps, including upgrading using ISO file and Media creation tool, are covered here:https:\/\/www.yourwindowsguide.com\/2019\/05\/update-windows-10-may-2019-update-manually.htmlContent on the above blog is written by a Microsoft MVP so it is safe.Meanwhile, if the update fails with MCT as well.Let us check the Installation log to find why the update failed. Please share the logs as mentioned in this article. You should use a File sharing service like Onedrive or Media Fire to upload files and share the link in the next reply.https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/troubleshoot-feature-update-install-failures\/eaf4ff24-64d6-4c72-824c-3ba3df716fc3The Panther logs. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\PantherThe Rollback logs: These usually are created if Windows Update rolls back. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\Rollback[Only if the error code is 0xC1900101-0x30018] The Device Install Log from C:\/$Windows.~bt\\Sources\\Rollback\\setupapi\\setupapi.dev.logAs the log size might be large consider zipping before uploading.","After ISO upgrade  I received another message after Windows reset to previous version installation  failed in the FIRSTBOOT phase with an error during SYSPREP_Specialize operation","Hi,Please share the logs as mentioned above."]},{"symptom":"How Can I create a system image on my SD card?        I have already formatted it to NTFS but it will not allow me to create a system image. Someone please explain how to create a system image on SD card.","solutions":["Hello AtomicBlastoid1, I'm Didi, an independent advisor. For this operation try to use Macrium Reflect (select \"Home use\") : https:\/\/www.macrium.com\/reflectfree Several well-known experts on this forum have vouched for it, for example Greg Carmack :https:\/\/answers.microsoft.com\/en-us\/windows\/for... Here is a guide on how to use Macrium Reflect : https:\/\/knowledgebase.macrium.com\/display\/KNOW7 Regards, Didi ------------ Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Also make sure that you have enough space on your SD card for the system image.","Will creating a system image save all my files such as downloads and documents?","Hi AtomicBlastoid1, Yes, you can backup everything with Macrium Reflect, please follow this guide : https:\/\/www.howtogeek.com\/howto\/7363\/macrium-re... Regards, Didi ------------------- Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Automatic Slideshow        I made a powerpoint presentation that need to be automatically played after every video and automatically proceed to the next slide. I changed the \"on click\" at the playback and put it on automatic, it works. Then i unchecked the on click at the transition and checked the \"after\" and put the duration of the video which is 10s. But it did not work. It just stop the video stuck in that slide. What should I do?","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Here is a previous thread from a user with the same issue, please see the accepted solution:https:\/\/answers.microsoft.com\/en-us\/msoffice\/fo...Regards, Ross"]},{"symptom":"Files and Folders are moving to recycle bin on click        I am using windows 10 along with Lenovo Yoga  , recently after update from windows  got installed there is strange behaviour happening.Any file or folder i click it goes to Recycle Bin  , Pop up appears saying file no longer exsist on this location .When i go to recycle bin and restore files \/folders goes back but again once i click it goes back to recycle bin .I have tried all antivirus , re installed windows  , removed windows patition ...nothing works to fix this problem Logged a case with Microsoft , they did remote , tried for few hours then gave up ....Any help deeply appreciated .","solutions":["Hi harshadraykothari Is this happening with all types of files? Open Notepad or any other app that you can type into, type some random text Then click into the middle of that text, does the text to the right of the cursor delete, or does it remain?","Its get deleted , any idea whats happening","All files and folders"]},{"symptom":"Trend Micro installation        Trend micro says its been installed, however I can't locate it on my laptop ?","solutions":["Hello MatthewLiessmann, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemRight click on start menu and choose from the top Apps and Features. There you can search for Trendmicro, if you found it in the installed application list. it means it is already installed.To double check if it's running, you should see its Icon next to the time and date in Taskbar.Also if you opened from start menu \"Windows security center\", and clicked on Virus and threat protection, It will report if Trend micro is running or not.Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolvedCheers! Farah","Thanks FarahI've located trendmicro, however the icon is not in the taskbar and I cannot find any mention of it when I click on Virus and threat protection.","Hi FarahI've reset the app and it appears to be working, thanks for your help.","no worries, glad it worked out for you :) Cheers!"]},{"symptom":"How can i remove these ''Folders'' in This PC        Hello, i try to find a way how can i remove these Folders (Foldere, my windows it's in Romanian language)","solutions":["Hi POMihai I am sorry, there is no setting in Windows 10 to remove those user library folders form the 'This PC' section in File Explorer . . .There is a Registry Hack on the page below which will remove those folders for you:https:\/\/www.howtogeek.com\/222057\/how-to-remove-...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]},{"symptom":"New SSD wont boot        I got a Kingston A400 SSD to use as the boot device along with my 1tb HDD. I plugged in only the SSD and used a usb with windows installation media to download windows onto it but no matter what it won't boot. If I leave the usb plugged in after windows installs it just restarts the install process when it reboots and if I take it out it goes straight to bios. I've spent hours searching and trying what people have been saying on other threads but nothing worked. I've changed the boot order and messed around with all the other basic bios settings. I just installed windows on my HDD a week ago and it worked right away so I don't know what's wrong. If I load my computer with my HDD it will show the SSD has windows installed on it. Also, both the drives are GPT. I have a gigabyte b450m ds3h. Please help, thanks.","solutions":["Hi John, You may need to format your SSD first before doing the process. Please follow this article: https:\/\/www.disk-partition.com\/articles\/format-...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","thanks for reply but it did not work","Hi there johncenafan, not really sure what you want to do installing Win 10 on a 1TB  HDD and now trying to install the same Win 10 ( I take it ) on the new A400 SSD. As already stated above, you need to initialize the new SSD before you  can install the same Win 10 into it as your boot drive.If you want the new SSD to be your new boot drive instead of the 1TB HDD, then format the 1TB HDD drive as well and use it as your storage drive?Once you have initialize your SSD drive, give it a name and will become your C-drive after you have successfully installed Win 10 to it?Go to your system BIOS and select the boot order placing the new SSD with Win 10 installed as your 1st Boot Drive. You need to select F8 on your keyboard to access the boot menu while in your BIOSAs a final safety check, right click the start button, bottom lower left, and select 'Disk Management' and if you have done everything right, then you should be able to see your new SSD drive there already partitioned by Windows ready to goHope this will help?CheersGeorge","Hi John Boot into BIOS, is SATA Mode set to AHCI to enable booting from an SSD drive? Is the SSD drive set a top of the Boot Priority list? Did you try connecting that SSD to the SATA Port normally used by your old HDD?"]},{"symptom":"Xbox Wireless Adapter for Windows - error code 10 and code 48        The device cannot startI've recently bought two xbox one controllers with cable and wireless adapter to use on my Windows 10 PC. The controllers work just fine with the USB cable, but the adapter for some reason doesn't turn on.The driver installs \"correctly\". I don't have my adapter stuck as \"XBOX ACC\" like many users have. Windows installs driver 10.46.1, but refuses to properly start the device, showing an exclamation mark in device manager.Sure, for some reason the event log says the driver is mt7612us_rl.inf_amd64_75ab4556628c9849 even if my processor is intel, but trying AMD64 , ARM , ARM64 , IA64 or X86 drivers from the update catalog just end up in the same error.Device manager gives me the error \"code 10\", saying that the device cannot be started. The event log tells me that the problem is: 0xAand the problem status is: 0xC0000001The full event log says: -System-Provider[ Name] Microsoft-Windows-Kernel-PnP[ Guid] {9c205a39-1250-487d-abd7-e831c6290539}EventID411Version0Level2Task0Opcode0Keywords0x4000000000000000-TimeCreated[ SystemTime] 2019-10-02T23:59:36.665845100ZEventRecordID235Correlation-Execution[ ProcessID] 4[ ThreadID] 8068ChannelMicrosoft-Windows-Kernel-PnP\/ConfigurationComputerDESKTOP-JUOSUAO-Security[ UserID] (redacted, not sure if this qualifies as personal info)-EventDataDeviceInstanceIdUSB\\VID_045E&PID_02FE\\243668DriverNameoem7.infClassGuid{4d36e972-e325-11ce-bfc1-08002be10318}ServiceNamemt7612USLowerFiltersUpperFiltersxboxgipProblem0xaStatus0xc0000001If I install the drivers on safe mode, the error code changes from 10 to 48. Which is beyond weird. Here is the log for the code 48, this time with problem 0x30 and status 0xc000036b:+System-Provider[ Name] Microsoft-Windows-Kernel-PnP[ Guid] {9c205a39-1250-487d-abd7-e831c6290539}EventID411Version0Level2Task0Opcode0Keywords0x4000000000000000-TimeCreated[ SystemTime] 2019-10-03T00:34:11.530916500ZEventRecordID247Correlation-Execution[ ProcessID] 4[ ThreadID] 424ChannelMicrosoft-Windows-Kernel-PnP\/ConfigurationComputerDESKTOP-JUOSUAO-Security[ UserID] S-1-5-18-EventDataDeviceInstanceIdUSB\\VID_045E&PID_02FE\\243668DriverNameoem7.infClassGuid{4d36e972-e325-11ce-bfc1-08002be10318}ServiceNamemt7612USLowerFiltersUpperFiltersxboxgipProblem0x30Status0xc000036bBefore cookie cutter answers, I cannot stress enough the fact that I've already tried the most \"popular\" solutions for this. Here's a list of answers that would be useless since I've tried them already:Tried installing drivers \"manually\" via device manager's own tool, resulting in windows saying that I already have the most recent drivers;That involved countless restarts especially because sometimes windows says I need to restart to complete the installation and sometimes it doesn't say that;Tried using all my USB 3.0 and 2.0 (front, rear, blue, etc.) ports, with and without the extension cable and nothing changed;Tried installing the controller drivers before installing the adapter and vice-versa, code 10 persisted on the adapter either wayr;Disabled all my USB 3.0 ports on mobo making them all 2.0 and nothing changed;Installed other chipset drivers from mobo website, nothing changed;Installed and re-installed all my USB controller drivers (which both 3.0 and 2.0 seems to be installed correcly anyway);Even tried using a \"driver manager software\" such as iobit driver booster to no avail;Tried installing drivers \"manually\" by choosing from the list of drivers already on my PC in device manager, that still results in code 10;Tried installing all the compatible different drivers manually from the microsoft update catalog and code 10 still persists;Tried installing drivers from other users' machines, most notably two drivers that circulate the internet as the most popular solutions on Youtube, so if the solution involves this video: https:\/\/www.youtube.com\/watch?v=8mHjN2M7uiU \/ this video: https:\/\/www.youtube.com\/watch?v=HBeMry0MmKE \/ or this steam post: https:\/\/steamcommunity.com\/discussions\/forum\/1\/490123938430246727\/?ctp=24 I have already tried that and nothing has changed;Wanted to try turning off the \"allow computer to disable this device to save energy\" solution, that exists in this post: https:\/\/windowsreport.com\/xbox-wireless-controller-error-code-10-windows-10\/ but that is impossible since when I click on the properties of the adapter in device manager THERE IS NO POWER MANAGEMENT tab. That tab exists in other devices such as USB ports and other network adaptors but not on the xbox adapter;The closest thing I could do, was find and disable that setting in the USB hub the adapter is connected in, as expected nothing changed;The second closest thing the selective suspending setting, which changes absolutely nothing regarding the error;Tried to mess with bios settings in order to see if the mobo didn't want me to manage the power settings of my USB ports, so I enabled wake on keyboard, mouse and LAN (there is no such setting as \"wake on USB\" on my gigabyte GA-B75M-D3H rev. 1.0, bios F15);To enable the power management tab I tried to change the CsEnabled registry entry in current control set \/ control \/ power (as instructed in another post in another community: https:\/\/answers.microsoft.com\/en-us\/surface\/forum\/all\/power-management-tab-is-missing-from-device\/0a3c563a-5ec7-4809-9609-4bc257444590) to 0 only to find out that the entry was already 0 (changing it to 1 does nothing apparently);Disabled selective usb suspension on my power plan settings;Checked for the existence of \"upperfilter\" registry entry on the current control \/ class registry entry, (apparently removing\/adding that entry solves the code 10 issue on some mouses and keyboards as this video states: https:\/\/www.youtube.com\/watch?v=Tw23bOto_Go) but the entry doesn't exist at all;So I tried the opposite of the last suggestion and added the registry entry, and as expected windows told me that the entry was invalid and would be removed;Despite already having Windows 10 version 1093, I tried updating to the last cumulative updates and nothing changed;Against my better judgement I decided to go for a fresh install of the 1093 windows (I have done it twice actually), last KB and all, still gives me the code 10 or code 48 when installed from safe mode;Tried running \"troubleshooter\" from the devices and printers section in control panel, and as expected the troubleshooter can't find a solution;Tried following the redundant advice from device manager that says \"you have already the most recent driver, try looking for updates in windows update\";Installed the xbox accessories app from windows store, but it can only update the controller firmware;Tried enabling the Xbox Accesories Manager service on services.msc, but nothing happened;Tried disabling all non Microsoft services and processes to see if anything was creating a conflict and nothing changed;Googled for 4 days for different solutions especially in this community only to find predictable answers like \"install driver\";Spent an ungodly amount of time using the \"troubleshooting\" instructions here: https:\/\/support.xbox.com\/pt-BR\/xbox-on-windows\/accessories\/troubleshoot-xbox-wireless-adapter-for-windows, but they are either things I've already done without success or they lead to a link saying \"your device might be broken, click here for replacement\", but the link is broken and it sends me to an error page;Tried following the support page here https:\/\/support.microsoft.com\/en-us\/help\/310123\/error-codes-in-device-manager-in-windows that supposedly explains what each error code is and what is the solution, but the \"explanation\" of the code 10 is \"driver error\" and the solution is \"reinstall drivers (*sigh*)\";Tried \"registering\" my product in xbox support channel, but apparently the site don't want me to do that, always returning an error.These are current my system specs in case the solution may involve any conflict(?). The specs are outdated, sure, but there is no reason for this machine to be incompatible with the adapter:CPU: Intel Core i7 2600Motherboard: Gigabyte GA-B75M-D3H (rev 1.0)Ram: 16 GB \/ 4x 4 GB Kingston 1333 mhz SSD\/HDD: Seagate ST1000DX001 Hybrid SSHD 3,5' (8GB SSD)1TB 7200RPM 64MB Cache Sata 6Gb\/sGPU: GALAX GeForce GTX 970 Gamer OC 4GB DDR5 256 bit PSU: Corsair Cx500 500wChassis: Cooler Master HAF 912OS: Windows 10 Pro 64 bit - Version 1093, OS compilation 18362.387 (KB4517211)Peripherals: USB Keyboard Tc196 Multilaser WarriorUSB Mouse Fortrek Spider Om-701No, I don't have bluetooth with this old mobo. So that is not an option either, I need the adapter for wireless use in any capacity.I still haven't tried connecting it to another computer, because I don't have any other computer here. I will have access to a Thinkpad laptop tomorrow to do another battery of tests, but I don't really think the adapter is broken because windows recognizes the adapter correctly, it just refuses to \"start\" the device. Also, if the solution is somehow \"rollback to a previous windows version\" I'll  be very very mad, because the only reason I updated to 1903 was to check the Xbox Game Pass beta, and it would be absurd to have to choose between playing games or using a controller.Also, if it helps in any way, before formatting my hard drive twice, I was using a xbox 360 wireless adapter, and it worked just fine. I'm only \"upgrading\" my peripherals because my old 360 controllers are broken.Even if the adapter is somehow broken, I would need to be redirected to replacement of the product in Brazil (REAL REPLACEMENT, please, because the link for product replacement in the brazillian website leads to an error screen as I've said before). I have bought the device from Amazon and retrieved it in Florida, but I cannot return the product to the US now, because I'm not there and shipping would involve absurd costs.  Also, I bought the controller and adapter on a bundle and I don't think I can return just the adapter. Right now, I'm very disappointed with this product and I'm pretty desperate for good, creative and effective solutions, especially because while browsing for solutions I've found other users in the same pickle as I am asking in reddit, steam forums, microsoft forums, tom's hardware etc. so this issue should've been fixed by now, it is unnaceptable for Microsoft to ship Microsoft hardware that has driver issues with Microsoft OS and Microsoft software.*****Moved to Windows 10 Devices & Drivers by moderator*****","solutions":["Hi Braescher,Thanks for reaching out to us in the Xbox Forums for this issue. As this seems to be more of an issue relating to the drivers for your adapter within the Windows 10 framework\/system, I'll be moving your thread to a more applicable forum within those parameters to help you out with those errors you're receiving in relation to gaming on a Windows 10 PC.Thanks again for posting and happy gaming!","Just tested the adapter on a Thinkpad notebook and indeed, the code 10 persisted. This is a brand new product that was shipped soft bricked. I bought it on the 14th of Setember.I need to be redirected to product replacement, actual product replacement, not the fake link that always returns me an error message. ","Wonderful to see how Microsoft cares about this error - having the same problem here.Mine worked from time to time (sometimes without a problem for weeks, sometimes refused to work for days straigt) - but this time it shows me the same information as it does for you, only with the driver named oem26.infSo far - most of the time it helped to change the USB plug, but now it seems to refuse at all..Did you find a solution\/return it? Mine's probably out of warranty, so hurts that it seems to be a software issue rather than a hardware one.","No solution found yet for the faulty adapter. However, my local support actually sent me a new one. But here's the deal. The new one still doesn't work on my desktop, still doesn't work on the thinkpad I mentioned, BUT, it works on an old Dell notebook with an old version of Win 10, that doesn't help me at all since that notebook can't run many games but know I cannot claim that the replacement one is faulty, because this one has chosen a random machine to start working. It is very hard for me to keep troubleshooting this. ","I am also having major issues with the Xbox wireless adapter for windows. Setup issues, connection & dropped connections and error 0x0. Event log is filled. I also have done every trouble shooting process available online. A complete coin toss if it will work at all or set itself up. I've made sure that everything is updated. This has been going on for months!!!The event viewer created 3 different event logs because I've tried so many times. I deleted the previous logs when I got the newest style adapter. It also appears to have issues after cumulative updates (which is almost weekly). These issues are happening to many users, and we have done our best to try on our own to get this working. Please Amber, escalate this to the powers that be for a real fix. We the community of users with these problems are at your mercy. I just want to play Halo on Steam..... Sad faceSean","Im not sure if this is still an issue for you, however when I came across this issue I right clicked on the adapter in device manager and uninstalled the device. Once that was done I simply unplugged the device and plugged it back in letting windows install the device a second time. This seems to have worked since I have not had any other issues with the device.","I have a feeling this is somehow related Win 10 using Win 7 drivers (e.g. lack of special USB functions implemented): I too have a relatively old Gigabyte desktop motherboard with drivers only up to Win 7, but otherwise running Win 10 just fine with them. There's a Gigabyte webpage listing Win10 supported motherboards here, where mine is not included, obviously.I have also used an USB sniffer and see initial traffic with the device, but at some point it gets bad data (maybe going to sleep?):deadf00ddeadf00d, request_type 0xc0, RequestType=2    bRequest    7, value, vb    { low=0; high=0 }Maybe someone knows if logging can be enabled for the driver, i.e. via WMI\\GlobalLogger? Tried it quickly, as detailedhere, but it didn't work for me. Maybe one needs to know the GUID for the driver to create a dedicated Registry key...My Xbox Wireless Adapter for Windows 10 works fine on two laptops though."]},{"symptom":"Can't find files after Windows 10 System Reset \"Keep My Files\"        My laptop wouldn't let me log in this morning, so after a variety of troublshooting methods, I decided to do a system reset. Of course I chose the \"Keep my files\" option as it was too late at this point to transfer them to an external hard drive as I would normally do before a factory restore.The reset went fine but when I logged in, my files were not present in their respective folders. All my music, pictures, documents, and videos are missing. My desktop background and lock screen image are the same as they were, and all the items in my recycle bin are still there, so I know they have to be around somewhere, but I can't find them. Where can I find them?My username is now different as well for some reason, could it be that everything is missing because I'm now technically logged into a different account? Even so, how could my desktop and lock screen images be saved, but nothing else was? Please help.","solutions":["Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.You can recover your files by following these steps. Open FILE EXPLORER Click on THIS PC Then LOCAL DISK C: Click on USERS Look for your old account name and you will find all your old files in the respective files.If you don't see your old user account, instead of going to \"users\", opening \"windows.old\" and the same thing, look for your old account.","Hi Marco,There is no \"Local Disc C:\" option in my \"This PC\" menu, and a search wielded no results, but under OS (C:), neither my old account name nor my files are present in the Users tab. They are also not present under 'windows.old'.","Ok, it's my fault, I took the name of my own hard drive as an example :) It was in the OS (C :) that you had to go and in the user folder. So even if you go there manually without the search tool you do not see your old user account?","Oh I see, all good :)Yes, that's correct. Under Users, there's a Public folder (which is also new after the reset), filled with folders titled Public Documents\/Public Pictures\/Public Videos\/etc (all of these are empty), and a folder with my new user name, also filled with empty folders. Under windows.old, there's a folder titled Users which is also empty.**Edit: I've also selected \"show hidden files\" and still nothing comes up.","Ok it's weird, if you reset by keeping the files, everything should be there unless something escapes me. Let's see what else will say.","Thanks for trying :\/ I downloaded a program to scan for lost files, and they're buried in there somewhere, but I just can't access them. Hopefully someone knows something :(","When you reset Windows your personal files should be under a folder named Windows.old within C drive. Is this not showing?The files will all be under their original folders, you just move the contents of each folder back to their respective folder under Documents etc.","Do you require any further help?"]},{"symptom":"Computer stuck in restarting after update        after updating my computer it did a restart and it has been stuck since that and wouldn’t stop.my computer is Acer Aspire 5 A515-51G-81KB and using Windows 10 Pro ","solutions":["Hi Light Start your PC, just as Windows attempts to load (spinning dots), press and hold Power Button for 5 - 10 seconds to perform a Hard Shut DownDo this twice On the third start Windows will boot into the Recovery Environment and from there you can access System Repair, Safe Mode, Command Prompt . . . etc.Please try each option one at a time, then see of Windows will boot . . . If the option is available to uninstall or roll back that update, then that would be the best option . . .Go to Troubleshoot - Advanced Option - Startup Repair See if Windows startup can repair itself Go to Troubleshoot - Advanced Option - System Restore Check to see if you have a restore point you can go back to If you do not have a Restore Point, go to Troubleshoot - Advanced Option - Startup Settings and click RestartUpon restart, press 4 to enter Safe Mode Once in Safe Mode, backup your data if you do not already have a backup Open Device Manager and check to make sure all your Drivers are up to date Reboot to see if Windows will start Normally If the above fails, go to Troubleshoot - Advanced Options - Reset this PC Choose to keep your files and apps, just your files or to keep nothing Then start the Reset"]},{"symptom":"\"Log in as administrator\"        I just upgraded to Windows 10.  I tried running an old game, which was doing OK on Windows 8.  I get \"access denied\" when I hit start, and a message telling me to log in as administrator and try again.I am the administrator. So what can I do?Thanks.","solutions":["Hi, Thank you for posting your query in Microsoft Community.I will be glad to assist you with the issue you are experiencing with the computer. I understand the difficulty when things won’t work the way they should.I would require some more information to help you better.What is the make & model of the computer?Do you sign in through Microsoft\/Local account on Windows 10?Do you get any error message while playing\/installing game?I suggest you to check the game compatibility with windows 10 compatibility center.http:\/\/www.microsoft.com\/en-us\/windows\/compatibility\/CompatCenter\/ProductViewerWithDefaultFilters?TempOsid=Windows%208.1&Locale=en-us&Architecture=X64&TextSearch=windows%2B10&Type=Both&CurrentPage=0&TotalPages=1&ShowCriteria=0&Compatibility=Unknown To enable built administrator account follow the below steps.If you are referring to the inbuilt administrator account, then follow the below steps.Note: To perform the below steps, you should be signed in to the Windows 10 using Admin account (Microsoft\/Loacl account you created to sign in to Windows 10).Sign in through your Admin account on Windows 10 (not in built administrator account).Press Windows + X keys on the keyboard and selectCommand prompt (Admin) and click on yes on the prompted window.Now enter the below command in the command prompt (Admin) window.  net user administrator \/active:yesClose the Command prompt and reboot the computer and check if it helps. Hope this helps in resolving the issue. If issue persists, do get back to us. We will be happy to assist you.Thank you. ","Hi, Thank you for posting your query in Microsoft Community.I will be glad to assist you with the issue you are experiencing with the computer. I understand the difficulty when things won’t work the way they should.I would require some more information to help you better.What is the make & model of the computer?Do you sign in through Microsoft\/Local account on Windows 10?Do you get any error message while playing\/installing game?I suggest you to check the game compatibility with windows 10 compatibility center.http:\/\/www.microsoft.com\/en-us\/windows\/compatibility\/CompatCenter\/ProductViewerWithDefaultFilters?TempOsid=Windows%208.1&Locale=en-us&Architecture=X64&TextSearch=windows%2B10&Type=Both&CurrentPage=0&TotalPages=1&ShowCriteria=0&Compatibility=UnknownTo enable built administrator account follow the below steps.If you are referring to the inbuilt administrator account, then follow the below steps.Note: To perform the below steps, you should be signed in to the Windows 10 using Admin account (Microsoft\/Loacl account you created to sign in to Windows 10).Sign in through your Admin account on Windows 10 (not in built administrator account).Press Windows + X keys on the keyboard and selectCommand prompt (Admin) and click on yes on the prompted window.Now enter the below command in the command prompt (Admin) window.  net user administrator \/active:yesClose the Command prompt and reboot the computer and check if it helps.Hope this helps in resolving the issue. If issue persists, do get back to us. We will be happy to assist you.Thank you.access was denied","I just did this. Let's hope I never see that ACCESS DENIED thing again. Thanks for your help.","HMMM. This will probably do it as something new showed up when I went to log in after restarting.I can't MARK AS ANSWER since I wasn't the original asker but Schreibp can do that. He probably should if he gets a notification of this Reply and if he hasn't already STOP EMAILS on it.It would also help others who are trying to fix their computers and come across this since this site give you related Questions that it finds after you type in your own new one if Schreibp would click EDIT at the bottom of his original Question andchange the title to Log in as administrator and ACCESS DENIED issue This was something that I'd never seen:","HELP! The problem with this whole Administrator deal is that if you accidentally click on that icon in the lower left that is the image in my last posting, you get signed in as some generic Administrator and then the mess starts. It sets up a new blank desktop and none of your personal stuff is there. AND you can't even log out. I mean even if you Restart the PC or I have a program called Process Explorer that I used to replace Task Manager with, and I go to File > Shutdown > Log Off, it does a Restart but then it opens with the Windows log-on page saying ADMINISTRATOR - WELCOME in the middle where it usually has my Name and wants my password and there is no way to change who you are.Luckily, I finally figured out a trick but it only worked since I use OmniPass password software which also pops a box on that same screen up at the top since it is designed to automatically log a user in to OmniPass when they log in to Windows each time. My trick was to fill in my User ID which is my outlook.com email address, hit tab and it put automatically added \"Microsoft Account\" into a box titled Domain, and then I typed in my outlook.com password. WHEW was I glad when that worked and suddenly it was finally loading my familiar Desktop icons and screen.I'd actually like to get rid of that icon that is in that image in my last posting but I've right clicked it, hoping that I could choose DELETE and that isn't an option in fact nothing appears when I right click either the blue box with my outlook.com address in it or on the item just below it with the icon and Administrator.So now I've got to remember how to get out of this mess if I ever get in it again? Perhaps if someone else in my family hits that icon? OUCH!Actually, now that I think about it, perhaps what I was told to change in the registry only made it so that a guest Administrator could login and not what I wanted which was that the Windows would recognize that I AM the Admin and quit asking me for Administrator Permission when I try to do certain things which was dumb since I'm the only User on this PC and I AM already the Administrator.","Does the registry setting that the Reply here had me make to alter a Value to 1 affect me in any way when I just log in normally? If it doesn't, then obviously this Question was the wrong one to follow originally and I should change the registry back to what it was set at since it isn't doing what I want and it is too risky to have the icon on the desktop prior to logging in as me that lets anyone who wants to, to log in to my computer as some generic Administrator and mess things up along with the fact that then I need to figure out later how to have it not automatically log me in as that generic Administrator everytime in the future until I take the steps that I listed in my last Reply and that's IF I remember what to do.The problem is though, I can't remember what the 10 digit number was that the Value had been set to and I thought that I'd written it in an earlier Reply of mine and maybe even added a PrintScreen image or photo but I don't find one here or anywhere. I really need to ask for some help to take it back to how it was. Can I have help please?","OOPS, I just noticed that this wasn't originally my Question and that I'd just joined in midway. I should have asked my own as \"Is it possible to have Windows always know that I am the Administrator when I log in as myself on a computer that I've been using for more than a year and have my own set-up in as far as Settings, Desktop, Outlook set-up etc?\"I'm in trouble though as far as resetting the registry unless there's a generic value to put back in that I'd changed to just '1\". I'd thought that I'd listed the 10 digit number but apparently I didn't.","Surely somebody must know registry settings well enough to be able to advise me on what I was convinced to alter the Value of to a 1 to make this icon show up down in the lower left corner of the screen before I log in to Windows every time that lets anyone who clicks it gain access to my computer as Administrator without even needing to enter a password.It's weird but even though my name and outlook.com email address is on that clickable icon, it doesn't log into my own Desktop and Start Menu or settings. It merely logs you in as a generic Admin. and I am the only user and so the Admin on this computer.HELP PLEASE?","Well I fixed myself today when I had to do a Clean Install start over of Windows with all of the ACER discs. I'm back to Windows 8.1 right now and there's NO admin login icon down in the lower left before I log in. HURRAH!","Hi, Thank you for posting your query in Microsoft Community.I will be glad to assist you with the issue you are experiencing with the computer. I understand the difficulty when things won’t work the way they should.I would require some more information to help you better.What is the make & model of the computer?Do you sign in through Microsoft\/Local account on Windows 10?Do you get any error message while playing\/installing game?I suggest you to check the game compatibility with windows 10 compatibility center.http:\/\/www.microsoft.com\/en-us\/windows\/compatibility\/CompatCenter\/ProductViewerWithDefaultFilters?TempOsid=Windows%208.1&Locale=en-us&Architecture=X64&TextSearch=windows%2B10&Type=Both&CurrentPage=0&TotalPages=1&ShowCriteria=0&Compatibility=UnknownTo enable built administrator account follow the below steps.If you are referring to the inbuilt administrator account, then follow the below steps.Note: To perform the below steps, you should be signed in to the Windows 10 using Admin account (Microsoft\/Loacl account you created to sign in to Windows 10).Sign in through your Admin account on Windows 10 (not in built administrator account).Press Windows + X keys on the keyboard and selectCommand prompt (Admin) and click on yes on the prompted window.Now enter the below command in the command prompt (Admin) window.  net user administrator \/active:yesClose the Command prompt and reboot the computer and check if it helps.Hope this helps in resolving the issue. If issue persists, do get back to us. We will be happy to assist you.Thank you.Dear Microsoft, I am not able to login as administrator above provided solution because I removed to administrator privilege to my user so then when I am trying to activate admin privilege after using as description to enable admin user like Press Windows + X keys on the keyboard and select Command prompt (Admin) and click on yes on the prompted window.Yes on prompted window is disabled. I am not able to work as administrator or I need to format system. Regards Prashansh "]}]}