{"windows":[{"symptom":"How to keep pc unlocked after closing remote desktop connection        I'm using remote desktop connection on windows 10 to connect to a pc on the same local network, but whenever I close the connection the remote pc locks itself. Love this, but i need to disable it for a few days.Is this possible?","solutions":["I'm glad to help, but wish I had better news. It's cases like these that caused me to switch to TeamViewer and AnyDesk (comparable, with AnyDesk less likely to flag use wrongly as commercial) years ago and never look back.A comparison here: https:\/\/www.gb-advisors.com\/teamviewer-vs-anyde..."]},{"symptom":"Random Blue Screens Of Death at startup        I've been getting random BSODs with what I believe was  0xc000021a as the stop code.I thought I had fixed this by doing a repair reinstall of windows which worked fine for a week until now, same error of this BSOD again.Here is updated minidump: https:\/\/1drv.ms\/u\/s!Av-FOtb1QkjGhAaBJOj_ASBZ3071?e=MKGxdQ ","solutions":["Hi, I'm an independent advisor and hope this will help in your issue. You are right about the error code. WINLOGON_FATAL_ERROR (c000021a) The Winlogon process terminated unexpectedly. Arguments: Arg1: ffffd987fcb70e80, String that identifies the problem. Arg2: ffffffffc0000428, Error Code. Arg3: 0000000000000000 Arg4: 000001c180010000 ERROR_CODE: (NTSTATUS) 0xc000021a - {Fatal System Error} The %hs system process terminated unexpectedly with a status of 0xEXCEPTION_CODE_STR: c000021a EXCEPTION_PARAMETER1: ffffd987fcb70e80 EXCEPTION_PARAMETER2: ffffffffc0000428 EXCEPTION_PARAMETER3: 0000000000000000 EXCEPTION_PARAMETER4: 1c180010000 BUGCHECK_CODE: c000021a BUGCHECK_P1: ffffd987fcb70e80 BUGCHECK_P2: ffffffffc0000428 BUGCHECK_P3: 0 BUGCHECK_P4: 1c180010000 PROCESS_NAME: smss.exe ADDITIONAL_DEBUG_TEXT: initial session process or IMAGE_NAME: ntkrnlmp.exe MODULE_NAME: nt Are you still able to boot into Windows normally or in Safe mode? I think you can try sfc \/scannow for a start.Let me know if I can help you further!","Check out this article too, it explains a bit more of your issue: https:\/\/kb.datto.com\/hc\/en-us\/articles\/20055753... I would also suggest running chkdsk \/r to check if any of your disk sectors is bad.Let me know if I can help you further! Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I am able to get into windows normally usually after a 3rd reboot when I get this BSOD. I just did the sfc \/scannow and it says it found corrupted files and was able to repair them successfully or something along those lines. I will report back any updates","I just had another one: https:\/\/1drv.ms\/u\/s!Av-FOtb1QkjGhAroP-ef2duWwN0G?e=ipfkAH"]},{"symptom":"editing photos        After the end of windows 7 can  or will I still be able to download and edit my photos  on windows 7 off line (not hooked up to the phone line?Resizing and all is simpler on windows 7 than it is on windows 10 for me that is. less steps and easier to locate.Thank you!  E.H","solutions":["After the end of windows 7 can  or will I still be able to download and edit my photos  on windows 7 off line (not hooked up to the phone line?Resizing and all is simpler on windows 7 than it is on windows 10 for me that is. less steps and easier to locate.Thank you!  E.HDepends on where you are downloading your photos from \" OR \" what device you are transferring your photos off to your computer.In short Yes if you are just transferring from a camera \/ mobile smart phone \/ Flash memory storage device \/ CD\/DVD \/ or other such device.Have you tried Paint.NET for editing photos ???Have a read and you may be pleasantly surprised.https:\/\/www.getpaint.net\/A very small easy to install program that is easy to use and edit photos in more ways than any of the Microsoft Software such as their basic paint.","Yes, but there are many editors for win10 that allow you to edit photos easily.  :]","I have been using Windows essentials photo gallery. Will I be able to download from my camera to the computer windows 7 edit,resize,crop off line after the end of windows 7","I have been using Windows essentials photo gallery. Will I be able to download from my camera to the computer windows 7 edit,resize,crop off line after the end of windows 7In short, yes.","You might want to ask yourself if you really need to replace your Windows 7 system.  A lot of people are going to continue to use it for a long time to come.  If you do that, there is no reason why you cannot continue doing what you are doing now.As long as you are a reasonable person who uses her computer with some caution and have a top-notch antivirus program installed, the risk is pretty limited.","YesMicrosoft ended general support for Windows 7 in 2015 and will end extended support in weeks. Thus just means your computer may easily get attacked by viruses and malware. And some programs in later versions may not go compatible with win7. But Photo Gallary, it also belongs to something from the past (discontinued by Microsoft years ago). Won't get affected. "]},{"symptom":"Start menu on strike        What has not been bugged up yet? The start menu? Since today it is. Does not work any more.As always I have tried the standard suggestions - and they are, as expected, useless - and I am not going to reset my PC. The PCs are meant for using, not for resetting, then running into another bug, then resetting again.","solutions":["Hi Baltais. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) The surest fix for Start menu (and task bar) is re-register via Command Prompt as shown here:https:\/\/www.kapilarya.com\/re-register-start-men...If necessary you can use the Command Prompt in Safe Mode with Networking (so you have internet), or Safe Mode, accessed by one of these methods:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... or the Repair Mode accessed by one of these methods:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... 2) If that doesn't help then (in Safe Mode if necessary) go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 3) Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.4) If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","When you say the start menu button, which start menu button are you talking about, the Windows icon on the taskbar or the Windows key on the keyboard?"]},{"symptom":"Storage cleanup        So whenever I try to clean up my storage space on my computer, certain apps display this message and so I cannot take them off the list.  Apps that I deleted all files of still say they're on my computer, and those are the ones I have the issue with.  Thanks.","solutions":["Hi Reece, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Try Uninstalling using Revo Uninstaller Free: Revo Uninstaller Free - Revo Uninstaller Pro https:\/\/www.revouninstaller.com\/products\/revo-u...Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"Blue Screen        I was gaming and my HP laptop froze and went to a blues screen saying a problem had occurred and a sad face. It came back up today and I did all the suggested maintenance. Later it did it again and now its working fine again. What should I do? I have Windows 10 and my laptop is only two years old its HP Pavilion.Thank You Anyone!","solutions":["Hi, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.I would not worry unless it happens again. We can however look for logs. We need log files(called dump files) that tell us what lead to crash. Please share them with us for a better analysis of the problem. Instructions can be found here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Please let us know if you need any assistance about posting dump files."]},{"symptom":"Do window 10 offer a clone image feature for backup system?        I use Ghost to clone image for window system back, which work fine on window 7, but not window 10, I would like to know on whether window 10 offer any clone image feature for backup system.Does anyone have any suggestions?Thanks in advance for any suggestions","solutions":["\"I only have 1 disk with 2 partitions (C: & D:), and would like to backup images from C: to D: partition and restore images from D: to C: partition within the same disk.\"For this purpose I would use some app with scheduled backups of your personal files (or just use explorer to copy those files), but I wouldn't do that to another partition on same physical disk!What about recovery in case of total disk failure??? Bye, bye all works, photos, memories...!We can se asked too many times in this forum 'How I can get my valuable data back after disaster'.Backups (only files or whole system) should be always take to external disk, that shouldn't be cost issue!"]},{"symptom":"how to stop sharing my docs how to disable read-only        I upgraded to MS 2019. I made a mistake and signed into the Microsoft account.I do not need to share I'm just starting a new career so I do not have any employees.Now every time I open a document it say read-only. I cannot edit nor can I save.Before a message would come up and say :cannot locate file it;s either deleted renamed or in a different location.\"Now the message reads they cannot find the file at  all. I cannot work. This has never happened to me before and it's a nightmare.I even contact Microsoft Live Call and they could not help me. They wanted to work for 15 mins then charge me $29 if they can't find the issue in that 15 mins. I asked where on your website can I find out this issue. Microsoft could not help. I've been working on this issue for days and I need help can someone tell me how to disable READ-ONLYI already went into options> save and there is no box to un tick read-only.","solutions":["Hi Renee. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Be careful who you call because half of the Google Search results for Microsoft or Office Support are impostors who can rip you off. Instead come here for us to help you for free.Here's a quick web tutorial for how to disable Read Only in Word 2019: https:\/\/www.youtube.com\/watch?v=E3PTiDRkFXkIf you'll now tell me exactly how OneDrive or other sharing is bugging you, I will show you how to disable it or stop it from interfering. You do not need to use OneDrive any more than you need or want it. You get 5gb of file storage for free, so if you want to save your Documents to OneDrive because that folder stays under 5gb I can show you how to do that easily. If you want any more from OneDrive just specify it and I'll show you how.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","This is Renee, hope you had great Holiday.Thank you for your response. I saw the link you sent me. Unfortunately, I'm still having problems.Sometimes I open my docs it will say starting 2016, sometimes it will say starting 2019 and sometimes it will saying starting 365!As I was cooking, it came to me when all of my problems started. it started when I accidentally sign up for MS Word.The top right hand side and that's when this nightmare started.I just deleted all of Microsoft from my laptop. I deleted Microsoft 365-en too! I'm want to re-install MS Word 2016; before I do that I want to know how to sign out, cancel, delete from the sharing. This my personal hell now, never had a problem like this with Word and I'm scared top open up my docs because they all turn to read-only.Then when I close the doc it's in a different location. I cannot no longer attach a doc to my email because the box says, File is in different location, renamed or deleted. ugh  Or it will say something like invalid file.So this is what I want.1.) Sign out of the sharing with the school and work. This is imperative. Git rid of that!2.) Starting a docx. I want to \"save as\" then name my doc & place in my document location and no where else.      So my documents will be docx.  Get RID of the UTC nightmare for me.    I do not want to upload (my one drive did not save my 10 pg doc) and I usually keep clicking on the save button.    I do not want file location and definitely not sharing! ugh  I'm starting a new business and this is reeeaaally messing me up. My 10 pg doc I work so hard on every one is telling me it's gone.Gone gone where? OMG.I realize it's the holidays, so I understand if you're not at work. But I'm not re-installing anything until this gets fix and that means my business suffers.In the mean while I will continue to try and find a way to get out of the sharing mode.Thank you Greg I hope you can help me with this. Please help and this goes for Excel tooSigned,Frustrated & Over it"]},{"symptom":"Window stuck at just a moment after resetting the windows 10.        Hello Everyone,I have a desktop all in one from DELL. My desktop was running slow because I installed too many software. Therefore, I decided to reset the windows. After Completing the reset and waiting 7 hours there was a menu options popped up where I had to select the Country, timezone, and keyboard once I hit the next button, it is keep displaying just a moment. I tried to restart the computer several times, but I am getting the same message again and again. JUST A MOMENT.Any help will be helpfulBest Regards,Muhammad Shakir.","solutions":["This is a holiday and there may not be anyone at the servers at this time.","I am not sure what it has to do with holidays. I am doing the resetting windows my self with just following the basic steps. If my desktop stuck displaying the message \"Just a moment\" then either I have done something wrong or I may lost the product key or something.","Hi Muhammad, This has been resolved in a previous thread here: https:\/\/answers.microsoft.com\/en-us\/windows\/for...What I suggest are either doing a Clean Install (found here): https:\/\/answers.microsoft.com\/en-us\/insider\/for...or...you can try an automatic repair as suggested in the answer above. Let me know if this helps."]},{"symptom":"Window liscencem        My Window liscence is about to expire and I'm unable to activate windows","solutions":["Hi Epitome Windows 10 does not expire, this generally indicates a problem with the Windows 10 licence . . .1 Do you know the history of your PC or version of Windows? Was your PC new or used when you purchased it or was Windows reinstalled by a PC Repair Shop?2 Click your Start Button, type cmd then right click Command Prompt and choose 'Run as Administrator'Run or paste this command and hit Enter: slmgr.vbs \/dlv Please post a screenshot of the resulting dialog . . .","You probably have a Volume licence installed, not correct for a personal user but a large business environment.Open a PowerShell and enter slmgr \/dlv and post a screenshot of the resulting window.","Hello,First, check the type of license installed on your system.1. Open administrative Command Prompt.2. Type slmgr \/dlv and press Enter key.3. Note the Product Key Channel section Windows Script Host box:If it mentions OEM <method>, you’ve OEM license installed.If it says Retail, you’ve retail license installed.If it mentions GVLK, VOLUME_<method> then you’ve volume license installed. Note that GVLK stands for Generic Volume License Key.---------In case if it reports that you've volume license installed, then it is not a valid license to be used by end users (correct me, if your system is part of organization). In this case, you need to buy genuine license for your Windows 10.Hope this helps!","1. My PC was new when purchased  Edition: Windows 10 Pro  Version: 17032. After 'Run as the Administor'  Should I click 'yes'?","Hi Epitome That is correct, click Yes and then run that command . . .","after clicking, it shows thiswhat should I do next","Paste this command into Command Prompt and hit Enter: slmgr.vbs \/dlv Then wait for a dialog to pop up, then please provide a screenshot of that dialog . . .","After I  paste this command and hit Enter: slmgr.vbs \/dlv Then it shows this and I clicked OKNothing show afterwardIs it done? ","Hi Epitome Thank you for that, the dialog reports you are somehow running the volume licence version of Windows 10 Pro, which will expect to contact a company server to re-arm that licence on a regular basis . . .Was your PC ever in a Repair shop or have Windows 10 re-installed, since you purchased that laptop and when you purchased that laptop, was that from a PC manufacturer or a 3rd party retailer online?","Ordnarily it came with window 10 When I start to use it after it was bought but I was told to change it to window 8(to reduce data consumption) the desktop became blank then, so window 10 was installed back and I continue usage with no problem occurrence and I do update it when due.It was purchased by my aunt when she traveled abroad. (not online)As for the liscence how can I stop it?will it affect my PC anyway if I stop it?"]},{"symptom":"No sound after Windows 10 Update June 2019        Just installed Windows 10 update, and now I have no sound on my PC. Not on iTunes, YouTube, videos, nowthing. I updated driver, all the usual fixes. I have speakers connected, volume on, the tests show sound but I do not here anything. I am so sick of this happening. Anyone have a solution that won't entail uninstalling and reinstalling drivers? Or should I just do reset to time before update?","solutions":["Hi, LindaVb1 My name is Smith and I am an Independent Advisor. I would be happy to help you today.1.- Press ‘Windows key + I’ together to open ‘Settings’. 2.- Click on ‘Update & Security’. 3.- Click on ‘Troubleshoot’. 4.- Click on ‘Playing audio’. 5.- Click on ‘Run the troubleshooter’. If this does not work you can update the Audio drivers. https:\/\/support.microsoft.com\/en-us\/help\/402844...Hope this helps. Keep us posted on the status for further assistance.","I did all that. Plus I got a Microsoft person on chat to try to fix it for me remotely. Lost that person when I had to reboot. But the problem is still there. There was an update on my Windows last night. It was FINE until then. Should I just reset to an earlier time?","If it does not work for you by updating the Sound driver, then try to go back to a previous point to repair it.Follow the steps below to restore your computer to a previous date using a restore point:1- Type recovery in the search box of the taskbar and choose Recovery (Control Panel).2.- Click on Open System Restore. 3.- Click on Next. 4.- Select your restore point, and click Next. 5.- Click on Finish. The computer will reboot and present a message on the desktop confirming that the restoration was successful.","I am not a believer is using some sort of reset or restore points until you have spent a few days actively trying to solve the issue.  If it was an Update, then the problem will probably return when it installs again.When you are playing iTunes, and I will assume the media is not being streamed, you might check the Sound control panel for the Playback devices.  You may see more than one and make sure you are seeing the entire list.  Is one of those playback devices showing sound level changes?Do you have a model number of your system and you are using external speakers?Have you checked the Task Manager startup tab for any sound drivers which may not be enabled?When I change Sound drivers, I always go offline to do so since Windows will install one of its drivers before I can get the correct one installed.","All tests that speakers are working and producing sound … but they aren't. It's not just iTunes, but You Tube, any video with audio, there is no sound.  I just got done with yet another massive update, and still no sound. I had a live agent check my computer remotely and supposedly fixed it but upon reboot, still no sound and no more agent. Now it says they have higher than normal wait times and I cannot get anyone. I have had this happen before but I've always been able to fix it. This time, no joy. If this does not get fixed soon, I'm going to go back to the previous build. This all began with the new one, which just installed itself last night. I realize it might come back but I can always delete that update. My sound is super important to me. ","Speakers are Bose computer speakers. My PC is a custom build with no internal audio system. ","I was trying to see if your system was producing sound through another device, such as an HDMI connection.  But you did not check what I asked you to check..","I have the same problem after a win10 update on 27th July 2019 (UK). I have checked cables, speakers status (enabled), device driver (told me latest driver is installed), hardware manufacturer for hardware updates, volume levels,run troubleshooter (no joy) etc. Where do I go now???.","So I have this same problem kind of. I have sound but its much much worse quality then it was before. Everything was fine until this update.","I have the same problem after update last night. No sound on video's, music, you tube etc. Ran troubleshooter and all okay.  I am a senior and can follow simple directions."]},{"symptom":"Can't activate Windows that I PAID FOR!!!        This is just messed up.  I paid for this copy of Windows - now I'm getting messages to go to the store and BUY ANOTHER COPY!  I can't activate the copy that I bought.   I've alreadypaid for this!   Why should I have to buy another copy?  I am really angry.  I'm going to file a complaint with the Better Business Bureau.  ","solutions":["Hi Lexi. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Did you want our help? If you want to complain to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. But Microsoft will not even see it here because this is a tech forums where we are mostly volunteers trying to help solve your problems. Where did you buy the key from? The only safe place to buy it is from a major retailer who back all sales or from Microsoft directly here:https:\/\/www.microsoft.com\/en-us\/p\/windows-10-ho...If you paid much less than that then you could have bought a bogus key. Can I see a link to the product page where you bought it from?What happens when you input the key into Settings > Update & Security > Activation > Change Product Key?What is the Activation Status and Edition showing at the top of the page at Settings > Update & Security > Activation?Run the Activation Troubleshooter in the same location and report back its findings","I bought this from a computer store - that has been in business for decades.   I called the number provided by Windows to activate.   My copy is activated.   Still though, this is just ridiculous.    Having to read extremely long digits (not the product key - just a really long set of numbers) over the phone to someone with an extremely thick accent (difficult to communicate) - then having a computer read off another set of long numbers that I need to enter.    So, is this nonsense required every single time I want to reinstall Windows?  What's wrong with just using the product key?What a massive hassle.  ","A PC with preinstalled Windows purchased from a store should have an embedded Product Key that reactivates itself when you reinstall or reset. You can check this by running ProducKey fromhttp:\/\/www.nirsoft.net\/utils\/produkey-x64.zip and look for the OEM-BIOS key. If it has that key then it should reactivate itself.If it doesn't then I'd ask the shop why you were sold a PC with preinstalled Windows that has no way to reactivate it which his illegal piracy. You can report piracy to Microsoft here:https:\/\/www.microsoft.com\/en-us\/howtotell\/cfr\/r.... Usually if they know you intend to do this they will make it good. Be polite but firm - no one will help anyone who is rude and abusive. Sometimes a shop that custom builds PC's will provide a key which you can input during reinstall. But this is very rare.","I purchased a Windows 10 Professional CD from a reputable store that has been in business for decades. The CD has a Product Key (you scratch off some material to reveal the Product Key).  I paid what appeared to be a normal price for the Windows 10 Professional CD.  I do not have the time to mess around with dodgy copies of Windows.  I see that as an utter waste of time.   I had this copy of Windows running as a VM.  Then, I decided to delete the VM and reinstall.  I had no issues reinstalling - upon installing you need to enter the Product Key.  Now, I have no idea why the machine needed to be activated a couple of weeks later - but it did - and then it wouldn't reactivate.  I ended up having to call Microsoft support.  Oh, the fun dealing with automated phone systems and speaking to people with massively heavy accents - making basic communication quite difficult.  Then, in order to get the copy of Windows I paid for working again I had to read off stupidly long numbers to this guy - THEN he connected me to another automated machine that read another set of ridiculously long number that I had to enter into my machine.  (Confirmation ID)Like I said before.  What the hell is wrong with just using the Product Key?   Is this what I need to do every time I reinstall Windows?   Massive hassle factor.  And, just inane.If it is just a matter of first deactivating then reactivating upon reinstalling - then that wouldn't be so bad.  Is that possible?  That would make it a lot easier.   This isn't something I ever had to do in the past though.    ","Hi again - That sounds like it was reactivated due to hardware change which has always involved jumping through hoops - although they've made it harder in Windows 10 since we can't help you do it easily in forums, or you can't do it directly on the phone. Anyway, what they're doing there is just assuring that it's only on one PC which involves changing the hardware signature it's associated with, and removing the old one which was your VM.I'm sorry about that. There are things made harder in Windows 10 that shouldn't be. We just try to do the best we can in forums with the tools we have, and they're not as many for activation as they were in Windows 7.Anyway I hope the explanation helps even if it's still a PITA. Happy New Year!","I'm not sure how that works in the context of a virtual machine - which is where this Windows 10 is running.   I am using the same hardware though - all I did was delete the VM and reinstall (recreated another VM using the same Windows CD).  But, yeah, looks like Windows 10 sees that as a hardware change or different machine.  I saved the confirmation ID - but I'm not sure if that same number I received over the phone would work again should I need to reinstall (the automated voice system told me to save that number).  Yeah, anyway, thanks for the help - and Happy New Year!-Lexi "]},{"symptom":"Group Policy Preferences Regional Settings - Regional format Unknown Locale        Hi all,We have a problem with GPO Regional settings, DC servers Windows Server 2016 standard, all workstation are Windows 10 Pro. We need to change Regional format, we make changes on GPO, force update policy, but on workstation side Regional Format is Unknown locale like on pictures.We have a Dynamic NAV, and need this setting. if we change manually, we dont have a problem,i see the problem is 'format', windows 10 need this one: sr-latn-RS, not sr-RS (maybe this problem...) how to resolve this?tnx","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as you are having difficulties in setting the regional format Windows 10 workstation through Group Policy Preferences Regional Settings. Let me point you in the right direction, where you would get the appropriate help for this issue. I would suggest you to post your query inTechNet forums, where we have experts and support professionals who are well equipped with the knowledge on Group Policy Regional Settings on Windows Server 2016 to assist you with the appropriate troubleshooting steps. Regards, Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"Is the AMD Radeon HD 8570D compatible with Windows 10?        Hi there I am just wondering if the Is the AMD Radeon HD 8570D compatible with Windows 10 because I am currently running a Windows 7 PC & I am thinking of upgrading to windows 10 but I am unsure as to if the AMD graphics card is fully compatible with it or not. Anyways I meet most of the system requirements for Windows 10 apart from the fact that I am unsure as to whether the graphic card listed above is fully compatible with Windows 10 or not. ","solutions":["Hi there I am just wondering if the Is the AMD Radeon HD 8570D compatible with Windows 10 because I am currently running a Windows 7 PC & I am thinking of upgrading to windows 10 but I am unsure as to if the AMD graphics card is fully compatible with it or not. Anyways I meet most of the system requirements for Windows 10 apart from the fact that I am unsure as to whether the graphic card listed above is fully compatible with Windows 10 or not. Easy way to find out.Head over to this link.https:\/\/www.amd.com\/en\/support\/apu\/amd-series-processors\/amd-a8-series-apu-for-desktops\/a8-6500-radeon-hd-8570dDo a search.Is this what you are after ???If it is then yes it is compatible."]},{"symptom":"Asus Laptop Wakes Without Input, Says \"Power Button\" Cause Of Wake        My new Asus K571GT wakes from sleep without being told, even with the lid open. Sometimes within minutes, sometimes within hours. I've had it for less than a month, and this issue has been occurring for at least two weeks.I have no peripherals plugged in.My computer is not connected to the internet when it wakes.powercfg \/lastwake returns \"power button\"powercfg \/devicequery wake_armed returns \"none\"powercfg \/waketimers returns this:Timer set by [SERVICE] \\Device\\HarddiskVolume4\\Windows\\System32\\svchost.exe (SystemEventsBroker) expires at 12:11:30 AM on 1\/2\/2020.  Reason: Windows will execute 'NT TASK\\Microsoft\\Windows\\UpdateOrchestrator\\Universal Orchestrator Start' scheduled task that requested waking the computer.Timer set by [PROCESS] \\Device\\HarddiskVolume4\\Windows\\SystemApps\\Microsoft.Windows.StartMenuExperienceHost_cw5n1h2txyewy\\StartMenuExperienceHost.exe expires at 8:48:05 PM on 1\/2\/2020.BIOS was updated to newest build (.305) last night.Nvidia driver was updated to newest version last night.Windows update has no updates listed.Lid close is set to \"do nothing.\"\"Allow wake timers\" in power options are set to \"disable.\"Hybrid sleep is disabled.Both network adapters are set to disallow waking.Both network adapters are also set to disable \"wake on magic packet.\"Nearly every low power state return listed in the Event Viewer says \"power button,\" except for a few that say \"Unknown.\"After one such wake with no input from me, I checked the Event Viewer, and it definitely said \"power button.\"\"Hibernate after\" is still active, so some of these unintentional wakeups may be attributable to this, but not all. (The Event Viewer also catalogs these as non-power button wakeups, so they're easy to pick out.)Asus is advising a System Restore or System Reset. If those don't work, they're saying it will have to be sent in, as it's likely a hardware issue.Can anyone think of something I haven't tried that I could do before trying to reset it or send it in?","solutions":["Hi Elizabeth. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.It's likely caused by Updates Orchestrator which they have made impossible to turn off and will wake from Sleep or Hibernation but not Shutdown.The issue is chronicled here: https:\/\/www.tenforums.com\/general-support\/13336...and here: https:\/\/answers.microsoft.com\/en-us\/windows\/for... If you want to express your opinion on this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems. If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Multi-Inbox Folders        So, I use four e-mail accounts:My main e-mail, a Microsoft Account. I keep it for important messages and some archiving.My secondary e-mail, a Google acount (email [at] gmail . com), that I use for Google related stuff, like Youtube subscriptions.My Academic e-mail, hosted by University and used mainly to general academic affairs like assignments and library borrowing.A Yahoo e-mail that mostly collects useless stuff like newsletters, and I plan to delete soon.I use joint inbox to have all messages from the four inboxes in just one. I tried to manage this joint inbox in a set of joint folders, but I couldn't make it properly.Is there a way to make folders that will encompass messages all of the inboxes?","solutions":["Hi blanchecroix Thanks for participating in Microsoft Community, I'm Skypper G. I'm Independent advisor, let me help you with thisI think you can done this creating inbox rule for all the accounts on the same Outlook Profile that will move incoming emails to the same Personal Folder.Check the link below to know how is the process: https:\/\/www.systoolsgroup.com\/updates\/merge-mul...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","As far as I can tell, you can link Inboxes only. All other folders will be specific tot eh individual accounts."]},{"symptom":"Second monitor gets grey tint        So I recently bought a second monitor and I have a very annoying problem. Whenever I view something in fullscreen on my second monitor (an AOC 2250WG5) the whole monitor gets a grey tint. When I set the AOC monitor to be the primary monitor the issue is still there, but when I disconnect my main monitor (an LG monitor) the AOC monitor works normally and the grey tint is not there when viewing, for example, videos in fullscreen.The AOC monitor is connected with HDMI and the LG monitor is connected with DP. I tried to switch the two cables to see what would happen and the issue was even worse. Instead of a grey tint on the AOC monitor while in fullscreen everything just went black. And to get it to work again I had to reconnect the monitor.My GPU at the moment is a RTX 2070 SUPER.Would appreciate any help if there is any solution to this problem.","solutions":["Hi TinyWizard, My name is Riccardo and I'd be happy to assist! You did some great troubleshooting so far, this rules out hardware; so now its up to your video card.I have a couple of things we can look at... Step 1 - Update your Drivers Go to Start > type in Device Manager > open the Device Manager icon Expand your Display Adapters Right-click your RTX and Update Drivers Alternatively, you can go here and download the drivers direct form the manufacturer:https:\/\/www.nvidia.com\/en-us\/geforce\/graphics-c...If this does not fix the issue, let's try a Clean Boot scenario... Step 2 - Clean Boot Follow the steps below and do a clean boot... https:\/\/support.microsoft.com\/en-ca\/help\/929135...Let me know if these solutions end up working."]},{"symptom":"Turn off Task Scheduler \"Universal Orchestrator Idle Start\" on Task Scheduler        Hi everyone,I have a problem to DISABLE some existing tasks on Tasks Scheduler.And I think, these tasks were added by Microsoft when I upgrade my windows 10 to version 1903.When I try to disable , I go the permission denied.I tried to use my account and my account got permission denied as well.Is there any one having same issue?I would like to appreciate if you could show me how to disable these unnecessary Tasks.","solutions":["Hi KT. I'm Greg, an installation specialist and 9 year Windows MVP here to help you.It's showing Disable so there's nothing to be concerned about. For more about what it does see here: https:\/\/www.thewindowsclub.com\/update-orchestra...I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","   Hi Grey,Thank you for your advise.the problem is, I don't want Windows Update to run on the background since I usually use \"Windows 10 Update Assistant\" to update the Windows in need.The orchestrator Service sometimes use CPU and DISK too high, I become crazy with it, I couldn't work since DISK is 100% usage in 5-10 minutes.It's terrible.To me, I feel that, I'm forced to update the windows which I don't want to.Anyway, thank for your help and I will try to find alternative way to stop Orchestrator service which is annoying to me too much.","It said it''s Disabled. Is that not sticking? Restart and check again. I know of know way to turn off Update Orchestrator or prevent it from waking the PC except to use Shutdown only, or turn off Updates by setting a Metered Connection:How, When, and Why to Set a Connection as Metered on Windows 10Then turn them back on periodically to get your important Updates and run Version Updates from Media Creation Tool which is the most stable way: Media Creation Tool","I don't think You get it. When he tries to disable it and save it, He get's the info to put credentials on for the S-1-5-18. Get psexec.exe, run:cmd (as administrator)get to the proper folder with psexecpsexec -s -i cmd.exe in the new window taskschd.msc Then You can disable or even remove that task.It was turning my computer every 15 minutes... crazy","Thank you very much for this answer... It is annoying the find out that the computer wakes up on its own anytime, or that it uses 100% disk or cpu when I'm working, and it gets really slow.","This task is definitely awaking my computer during the day and causing it to run idle all day long because it never goes back to sleep.I disabled the ability for it to wake the computer so it would only run when awake, and it re-enabled the checkbox to wake it from sleep.I've now disabled it and we'll see how long that lasts.This only began happening once I was forced into Version 1903; in 1803 prior it was working fine.","I don't think You get it. When he tries to disable it and save it, He get's the info to put credentials on for the S-1-5-18. Get psexec.exe, run:cmd (as administrator)get to the proper folder with psexecpsexec -s -i cmd.exe in the new window taskschd.msc Then You can disable or even remove that task.It was turning my computer every 15 minutes... crazyI have the same issue but can't figure out how to disable the task.  I downloaded the Tools but can't figure out how navigate to the folder to run the command.  Can you be more specific?And why the heck is this task only on some of my computers, it is waking all of them.  Fix this Microsoft, like everyone else says it started with 1903.","save the tools (probably the zip file) open the zip file and extract to some location (fe. c:\\temp\\pstools)cklik windows button and write cmd.exe (enter)Black window will appear.type cd \\cd c:\\temp\\pstools (or any other folder specified)Rest is in the previus post.I needed to delete those tasks, they enabled themself otherwise.","save the tools (probably the zip file) open the zip file and extract to some location (fe. c:\\temp\\pstools)cklik windows button and write cmd.exe (enter)Black window will appear.type cd \\cd c:\\temp\\pstools (or any other folder specified)Rest is in the previus post.I needed to delete those tasks, they enabled themself otherwise.I used the tool to change the conditions on the task that is causing the issue and it reverted back within hours.  I have done a workaround by disabling wake timers but this is inexcusable and of course MS is clueless.","I have no idea why it's coming back. I have deleted the task, and it reappeared.If it's on power, it just keeps turning on ...."]},{"symptom":"Why is Windows Store's download speed so slow?        I juts don't get it. I can stream Netflix, HBO and download games just fine with full speed (13-20 MB per sec) from Steam, Origin, GOG, Uplay and Battle.net. But with Win10 Store the speed is so damn slow that it takes FOREVER to download games. It's ridicules. Is there any fix for this or is the speed of the store just broken?","solutions":["Hi,We understand the issue you are facing and will assist you.I suggest you to follow the methods provided below and check if it helps.Method 1: Run the Windows Store Apps troubleshooter.Type “Troubleshooting” in search box and press Enter.Click on View all on top left pane.Select “Windows Store Apps” from the list and follow the prompts for troubleshooting.Method 2: Check for the issue in a Clean Boot state.A clean boot is performed to start Windows by using a minimal set of drivers and startup programs. This helps eliminate software conflicts that occur when you install a program or an update or when you run a program in Windows 10, Windows 8.1, Windows 8, Windows 7, or Windows Vista. You may also troubleshoot or determine what conflict is causing the problem by performing a clean boot.* Place the computer in a Clean Boot and check if the issue is occurring due to any third party programs.Follow the link to view the steps to perform Clean Boot:https:\/\/support.microsoft.com\/en-us\/kb\/929135 Disclaimer: Start the computer in normal mode refer the section, \"How to reset the computer to start normally after clean boot troubleshooting\"from the link above.Hope this helps. Keep us posted on the status for further assistance. ","I was getting HORRIBLE transfer rate (<8Mbps on 1Gbps fiber).  I tried the normal stuff, passing\/restarting, restarting OS, none of it worked.I've noticed that the Windows Store download was using Windows Update port (TCP 7680). I changed the Windows 10's Delivery Optimization settings under \"Allow downloads from other PCs\" to only \"PCs on my local network\" (was \"...and PCs on the Internet\").  As soon I flipped it, the transfer rate changed to 400 Mbps.In Windows 10 search bar (or Settings window), type:\"Delivery Optimization\"Select \"Delivery Optimization settings\"if Allow downloads from other PCs is On, Click PCs on my local network, if not already checkedClose windowIf it is already Off or set to PCs on my local network only already, then this isn't your issue."]},{"symptom":"Microphone doesn't work but audio does        I've had a Rode NT1 microphone (condenser) and a Rode AI-1 interface. The Rode AI-1 has a headphone jack which I use for my headphones and they work fine but just recently my microphone has stop being detected by my computer. The microphone still works because I can use the AI-1 to playback my voice and I can hear it but my computer doesn't detect it. I've tried to update drivers but I have all the most recent ones. I've tried setting it as default, enabling and disabling it, unplugging and re plugging but it doesn't work. ","solutions":["Hi Jack. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I will give you all possible Microphone fixes to try in sequence. Even if you've already tried one I'd do it in this order as one step may affect the next.Please run the Recording Sound troubleshooter at Start button > Settings>Update & Security>Troubleshoot.Try these fixes next: https:\/\/www.windowscentral.com\/setting-your-hea...https:\/\/win10faq.com\/fix-microphone-settings\/https:\/\/www.howtogeek.com\/395296\/fix-my-microph...http:\/\/maxedtech.com\/fix-microphone-not-working...https:\/\/www.makeuseof.com\/tag\/fix-microphone-pr...Some report that what worked is turning off Fast Startup at Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change Settings Currently Unavailable > uncheck the box for Fast Startup, Save Settings. Restart and then disable Hibernate file to clear it, restart PC again and enable Hibernate again:https:\/\/www.groovypost.com\/howto\/enable-hiberna... Right click the volume icon in System Tray at right end of task bar, open Recording Devices, see if the microphone is listed, set it as Default device.Type Microphone in Start Search, open Set up Microphone, scroll down to Microphone and choose Get started to set it up.Try rolling back the sound controller drivers in Device Manager reached by right clicking the Start Menu. Choose Sound controller device, then Driver tab, then Roll back if available.Update the Sound drivers from the PC's Support Downloads web page. While there make sure you also have the latest Chipset, Display, Network, USB and all other drivers, comparing with the version presently installed in Device Manager.If no newer driver then uninstall the ones presently installed in Device Manager, reached by right clicking the Start Button. Restart PC to reinstall.When did this behavior begin? If you have an idea you might be able to System Restore back to a point before it began:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... It's possible this was caused by a Windows Update so if nothing above works, go to Settings>Update & Security>Windows Update, check the Installed Updates list for Updates that might have been just installed, try uninstalling them using the Uninstall button present there. Then hide the Updates using the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... If this was caused by a Version update (which you can confirm at Settings > System > About) then for ten days you can roll back Version in Settings>Update & Security>Recovery and hide it until it matures using the Hide Updates Tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... If there are other performance problems then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. Others are fixing USB mic and headset issues with Step 16 to test a new Local Admin account, because the account is corrupted and this is the only fix.If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]}]}