{"windows":[{"symptom":"Task Bar Orientation        I was trying to print  a document and some how I can the orientation on my home screen instead and having trouble getting it to the correct orientation. My task bars are now on the right an left side of my home screen","solutions":["Great news Cyndy.","Hello Cyndy,The tutorial below can help show you how to move the taskbar back to the location you want instead.https:\/\/www.tenforums.com\/tutorials\/57280-change-taskbar-location-screen-windows-10-a.html"]},{"symptom":"can't buy anything due to pop-up        so apparently, when i go to buy some Robux with the money from my xbox gift card, it, instead of asking me if i'm sure i want to do it, tells me it had an errror on its end, and to wait a bit. well, i waited but it was STILL the same. after multiple trys, i searched up what to do in that situation in every way possible, but know i'm here. i also tested multiple times again on buying the Robux. so does anybody know what to do about this? this is what it looked like:","solutions":["Hi Zephryeum and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/windowsreport.com\/try-that-again-someth...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"program no long active         I purchased the program \" patient medical report and history \" sofware. the program was perfect with window 8 previous version.When i updated my pc,  the program is non long active( it does not open).","solutions":["Have you contacted that Program manufacturer?"]},{"symptom":"im having Video_tdr_failure (nvlddmkm.sys)        Hello i had a big problem the past 2 days , i've been playing a game normally, then my pc crashed  and i got ''video_tdr_faulure (Nvlddmkm.sys)'', then my nvidia stopped working and i had code (41 i think) i tried a lot of things from internet but nothing worked , so i restored my PC to factory settings , and i downloaded the latest nvidia driver (441.66) and everything was working fine until i tried to play a game , and i had the same problem over again , so im just wondering is my graphic card broken or is there some kind of problem with the new nvidia driver . cuz ive been playing with it for a couple of days without any problem . help me pls","solutions":["Hi zouhairED The newer Nvidia drivers do cause problems and especially Blue screens, you should go to the Nvidia website and look for older versions of that driver, which will hopefully be more compatible with your PCAlso go to the support page for your PC on the Manufacturers website, check the version of Nvidia driver they recommend, that would be the most compatible . . ."]},{"symptom":"Mid 2011 Imac audio driver problems        I have a mid 2011 imac. windows 10 is not officially supported on bootcamp so i decided on 8.1 instead. Everything worked in the end and once it was installed I manually went into my files and begin the driver setup. Every driver works perfectly except the sound drivers. I did some digging and some people are saying that i need to download windows 8 through legacy bios and not efi boot?? It took me a while to figure out how to do it normally and I know for a fact i probably wouldn't be able to figure out how to do it a different way entirely. i have attempted reinstalling the drivers, nothing. restarting my mac, nothing. The sound works perfectly on the mac os side of things so i know its a software problem rather than a hardware problem. I would really rather not uninstall windows and reinstall it but if thats the only way then i guess i have too. I have spoken to apple and Microsoft and apple have said that its not their issue and its on the windows side of things, and i phoned Microsoft and a guy fiddled about with it for 30 minutes and then told me to go back to apple?? Any help would be appreciated aha ","solutions":["We don't work for Microsoft.Microsoft does supply information about this up to Windows 7.But Windows, no matter what version, is basically the same and it comes back to Apple.Troubleshoot sound problems on Windows with Boot Camphttps:\/\/support.microsoft.com\/en-au\/help\/2622620\/troubleshoot-sound-problems-on-windows-with-boot-campSummaryAfter installing or updating Windows on a Mac using Boot Camp, you may notice that you no longer hear sound through the headset or internal or external speakers.CauseThis issue can be caused by outdated or corrupted drivers and other software.Method 1: Update to the latest version of Boot CampMethod 2: Install the latest version of your audio driversInstall the audio driver from your Mac OS disk or download the latest version of the audio driver from Apple."]},{"symptom":"download issues with wdws 10        After upgrading to windows 10, I have had to uninstall certain programs and reinstall them, in order to work correctly.  As I try to initiate the install, I get the Microsoft App store message and cannot install the correct program\/icon, etc.  I've been unable to establish any administrator status to the account users, which is usually prompted for permission to install the program\/app anyway.  Please advise.Jay","solutions":["Hi, JayHendrickson My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Sound Problems        I am experiencing a lot of distortion when I try to listen to music or watch videos while internet browsing","solutions":["Hi Rooster, please analyze the problem using third-party LatencyMon tool."]},{"symptom":"\"System\" process hogging cpu, traced to non existent driver        Hi all.  A few weeks ago I installed an audio recording software, but only used it once initially, and haven't used it since.  I noticed a little later on that a process called \"system\" was hogging 15-20% cpu when my games were running, and I had never seen this before.I did not make the connection until today.  I downloaded MS process viewer, and opened up the thread list, where it showed a driver as the cause, or at least it pointed to it as the \"start address\".  The driver name is \" stdriver64.sys \" and belongs to NCH software.This surprised me because when this is using cpu, I am not running the software, so It shouldn't be doing that.  I then went into MS services and looked for the running service related to it and found nothing.So then I tried uninstalling the software, and rebooted, but still, the thread shows the driver using cpu!   I searched my pc for the driver and it was gone from both the win folder and the app folder.So I'm stuck at this point.  The software and driver are gone, but this process thread is still referencing it for a \"start address\" and it's hogging my cpu, and I believe this is causing lots of stuttering and lag spikes in my game.So, I would appreciate some help on how to fix this, and am also curious how this problem could have occurred in the first place.  Thanks.","solutions":["Hi Joey. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.This fix for removing this strange ghost driver is from 2014 but may still work: http:\/\/nch.invisionzone.com\/topic\/21459-bsod-ca...Download site to reinstall software to then uninstall properly: https:\/\/www.nch.com.au\/soundtap\/index.htmlAlso shows up here: https:\/\/answers.microsoft.com\/en-us\/windows\/for...If it turns out to be a software your sound controller uses, then once you uninstall you can try reinstalling it in Compatibility Mode:https:\/\/www.groovypost.com\/howto\/run-old-softwa...https:\/\/social.technet.microsoft.com\/Forums\/win...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"PICTURES        My PICTURES file folder is empty.  The \"Picture file\" is still in tact.  But when clicked on it is empty.  I found these folders in FILE EXPLORER.  How to I move them back to \"PICTURES\" ?frustrated Cynde","solutions":["Hi Cynde,            You can move your Picture files to your \"Picture Folder\" simply by locating them, and dragging them to the folder in \"File Explorer\" ."]},{"symptom":"how to install maintenence scheduler        how do i install maintenence scheduler","solutions":["Control Panel > All control Panel Items > Action Center > Maintenance > Automatic Maintenance > Change Maintenance Settings.Cheers.","Unfortunately I already tried that there is a time of 9.00 daily but nothing happens then and a notice shows   maintenance schudular is not available Can I download scheduler,From Microsoft, ","done everything you suggested but still unable to download maintenence scheduler","It runs automatically in the background.And there is no where to download it from.It is part of the 8.1 operating system."]},{"symptom":"Automatic Updates        I have 250 updates and some are quite beeeg or very old. Can i uninstall old updates AND JUS LEAVE RELATIVELY NEW OR RECENT UPDATES and UNINSTALL OLD ONES . I am trying too get some space on my old laptop as i am always getting LOW DISK SPACE ,,,, FLASH UP,,, reads  U ARE RUNNING OUT DISK SPACE ON RECOVERY {D}. Click here to see if u can free space on this drive.... CAN ANYONE HELP. PLEEEZZEE???","solutions":["You can not uninstall most of your updates as they are for specific security and performance problems.Read this information from my reply:How to Use Windows Update Cleanup in Windows 8 and 8.1​https:\/\/www.eightforums.com\/threads\/windows-update-cleanup-in-windows-8.44274\/And if you make a mistake in that WinSxS folder you will make the operating system inoperable.@@@@@@@@@@@@@@@@@@@@@@@@@@How to free up hard drive space:Use this free Program to see what is taking up the space.http:\/\/www.jam-software.com\/treesize_free\/Here is how to understand Treesize Screenshots:http:\/\/www.jam-software.com\/treesize_free\/screenshots.shtml_________________________________________________Also check to see how much space System Restore is using and change if necessary:\"How to Change Maximum Disk Space Used by System Protection and System Images in Windows 8 and 8.1\"http:\/\/www.eightforums.com\/tutorials\/4691-system-protection-change-maximum-disk-space-usage-windows-8-a.html_________________________________________________Tips to free up drive space on your PC > Applies to: Windows 7\/Windows 8.1https:\/\/support.microsoft.com\/en-in\/help\/17421\/windows-free-up-drive-space________________________________________________You can clean up your Hard Drive using these methods.\"Delete files using Disk Cleanup\"http:\/\/windows.microsoft.com\/en-us\/windows\/delete-files-using-disk-cleanup#delete-files-using-disk-cleanup=windows-8How to Use Windows Update Cleanup in Windows 8 and 8.1​https:\/\/www.eightforums.com\/threads\/windows-update-cleanup-in-windows-8.44274\/Using the Free CCleaner Program:http:\/\/www.piriform.com\/ccleanerUnder NO condition use the Registry cleaning Option in CCleaner________________________________________________And download, install, update and scan your System with the free version of Malwarebytes AntiMalware:http:\/\/www.malwarebytes.org\/products\/malwarebytes_freeCheers."]},{"symptom":"Customer service run around        Having a problem with wireless keyword received as a Christmas gift Called to customer service The first time waited about 30 minutes and then on hold by the gentleman in Philipines the results were that they could not help me with the issue since I do not know where the gift was purchased from.  I called again and This conversation In total took about 2 hours between holds and transfers to 3 different departments. I love the tapes to be reviewed since you record conversations for training purposes. My whole purpose of calls was to either fix the bad USB dongle or how to buy one. and om the 3rd transfer the last guy hung up on me after wasting two hours of my time.  It is very strange that there is no leadership listed under customer service which probably shows why such poor and shameful customer service. This is not the end of the world but the end of me purchasing  Microsoft products. I certainly hope someone from Microsoft contacts me to change this bad taste in my mouth. ","solutions":[]},{"symptom":"Hi! I'm trying to launch a 2014 game, but it keeps telling me \"This system does not support Directx11\". Please help?        i'm trying to launch the 2014 title, \"danganronpa another episode ultra despair girls\", but it won't let me launch the game. every attempts ends in an error message reading: \"fatal error! this system does not support directx11.\" whenever i try to change the compatibility to an older version of windows, it tells me catastrophic error. i do not currently have the money to buy a psvita or the actual copy of ultra despair girls, and it was much cheaper to buy it via steam, thanks to the spike chunsoft winter sale. so, telling me to just buy the actual copy is not going to work. i want to figure out how to run this game on this computer. i've heard tom clancy's rainbow six siege has this exact same problem. both games launched before 2016, the launch date for windows 10 & directx11 (i believe), so could it be the fact that they are just 1-2 years behind? what's even stranger is that i can run the 2008 game \"spore\" with no issues whatsoever (besides the occasional crash, but that's to be expected with any game) and a 2012 game with slight 3d animation known as \"super danganronpa 2: goodbye despair\". so why can't i run a 2014 game? please respond.","solutions":[]},{"symptom":"Sonos Speakers        I have 2 Sonos Play1 speakers on my local network. Both are shown as available but when selected under \"Cast to device\" (when trying to play music stored on the hard drive) all I get is a \"Unexpected device error\" message. The speakers work fine through the Spotify app both on my laptop and phone. ","solutions":[]},{"symptom":"We can't tell if your PC has enough space to continue installing Windows 10 - what worked for me was that I increased my system reserve value to 600mb in Disk Management        We can't tell if your PC has enough space to continue installing Windows 10- what worked for me was that I increased my system reserve value to 600mb in Disk Management","solutions":[]},{"symptom":"Cannot install\/load Microsoft to PDF, cannot install a PDF printer. error 0x800F0922        hi, Getting error 0x800F0922 attempting to install the Microsoft print to PDF printer on a windows 10 station.  It used to work fine, then just stopped working a month or so ago. Microsoft print to PDF is not selected in the windows add-ons and attempting to add it gives the above listed error. I have also attempted reloading the .net framework, turning it on and off....nothing.I have tried many DISM commands that I have found online specifically to try and repair this. This is one of them, but there were a couple more as well. (dism \/Online \/Enable-Feature \/FeatureName:\"Printing-PrintToPDFServices-Features\" \/NoRestart).  I also tried a couple other of the \"repair\" commands.  The commands all seem to run fine with no issue, but it doesn't seem to actually correct anything and W10 still will not allow me to install this printer. I tried loading a third party print to PDF tool, actually a couple of different ones.  Guess what, I can install the printer software, but the printer section will not locate it to add it to an actual functioning printer.I read some people have had luck using running the creators update to correct the issue, does this option still exist?Re-installation of the OS is not really an option at this time.  Any suggestions are appreciated.  thank you.","solutions":["Hi dcook1313 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.Open a command prompt [admin] and run \"net stop spooler\". Restart the Print Spooler Service with \"net start spooler\" You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"Blue error screen        Hello,I keep getting a blue error screen that looks the the attached photo. It says that my PC ran into problems and needs to just collect some error info, and then restart.  -DRIVER POWER STATE FAILURE-VIDEO DXGKRNL FATAL ERROR","solutions":["Hi Marc, Open Windows File Explorer Navigate to C:\\Windows\\Minidump Copy any minidump files onto your Desktop, then zip those up Upload the zip file to the Cloud (OneDrive, DropBox . . . etc.), then choose to share those and get a share linkThen post the link here to the zip file, so we can take a look for you . . ."]},{"symptom":"Product keys saved with system restore        When a system restore USB is created, and a system image is used to restore the PC, is the product key kept with that PC or do you have to purchase another one? I'm currently using a PC running Ubuntu after Windows 10 crashed and died. Thanks for the help.","solutions":["Hi Aedan186 short answer, if windows 10 has been activated on the device you can reinstall windows 10 any time you want and it will activate when you go online.on a new pc the license key may be embedded in the bios, however a computer upgraded from a previous version of windows will have been given a digital entitlement, held on microsoft's servers.From a users point of view the result is the same for both - windows 10 will activate automatically when you go online.of course for this to work it must be the same edition (home, pro, etc) that was previously activated.hope that helps, please let me know if it is not clear.","Hi Aedan, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.As long as the motherboard isn't changed, you may reinstall Windows or use System Image restore for the lifetime of the device. Just skip entering the key if prompted and install the same version as was before."]},{"symptom":"windows 10 pro iso not given 32\/64 bit choice        Problem resolution division,    Purchased windows 10 pro from I.S. on 12\/31\/'19.  The digital download provided an iso file.The iso file did not provide me an option of 32 or 64 bit.  It just proceeded to install as the 64 bitversion which is useless to me.  The 64 bit version will not allow installation of a 16 bit programwhile the 32bit version will.  The vendor says they didn't know it was only 64 bit.  Will Microsoftprovide a 32 bit version to replace this vendor's misstep?  They still advertise 32\/64 bit WindowsPro 10.  Must the vendor issue a new iso, capable of loading a 32 bit version? Sincerely,Gene","solutions":["Hi Gene. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I dont' know what the vendor provided. But you can create the latest 32 bit media any time you want to reinstall. Install the Media Creation Tool from this linkhttp:\/\/windows.microsoft.com\/en-us\/windows-10\/m..., open Tool, choose Create installation Media, follow the steps in the middle of the download page to create bootable flash media or a DVD.You can install either 32 or 64 bit with each license. Then follow the illustrated steps in this link which compile the best possible Clean Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key for your PC maker given in this chart:https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, then on second screen choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, select the Unallocated Space, click Next to let it create and format the needed partitions and start install - this makes it foolproof.There is a step to rescue your files first using the booted media if you don't have them backed up:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC because you will learn everything that works best and how to apply it with your own hands.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Make One Drive go away        I just transferred all of my documents from my old computer to my new one.  For some reason it looks like they all went to One Drive.  I do not use One Drive as I spend half of my time in areas with no internet access.  I want to move all of my files to my computer and not have One Drive as the default.  Also, curious of what the red x's are next to all of my files in the One Drive?","solutions":["Hi Jaci. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.How did you transfer your files - using OneDrive? Move them into the User folders (Documents, Desktop, Pictures, Music, etc) and remove those from OneDrive as follows:OneDrive introduced some features recently that were set as default for some users without their knowledge, so be aware and adjust as necessary:If the new Backup\/Folder Protection is chosen in OneDrive Settings > Backup Tab, then Documents, Desktop and\/or Pictures folders will be moved into the OneDrive folder. See Folder Protection details here to change this or read more:https:\/\/www.tenforums.com\/tutorials\/116029-turn...Another setting designed for smaller hard drives removes files from the hard drive and stores them only in the cloud if Files On Demand is chosen in OneDrive Settings. This feature is described here:https:\/\/www.pcworld.com\/article\/3233488\/windows...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Go Settings, Apps, scroll down to Microsoft OneDrive, click on it, click on uninstall and when it is finished you will have no contact with OneDrive.","I just transferred all of my documents from my old computer to my new one.  For some reason it looks like they all went to One Drive. I do not use One Drive as I spend half of my time in areas with no internet access.  I want to move all of my files to my computer and not have One Drive as the default.  Also, curious of what the red x's are next to all of my files in the One Drive? Hello,See if this helps you:https:\/\/www.kapilarya.com\/how-to-sign-out-from-onedrive-in-windows-10Hope this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP. ","I found a possible fix by making some files not available to OneDrive.  But I am concerned because I got a message that all files in these files will be deleted and unavailable.  So how do I move them to my computer before disconnecting the folders from OneDrive?","have you looked in C:\\users\\your user name\\OneDrive?","It sounds like I did not make myself clear.  I moved my files from an old laptop that did not have OD.  I used EasySuite and cleaned up a few files in File Explorer.  I saw the OD listed and wanted to stay away from it so I created folders on my PC....but in its great wisdom, Microsoft decided it knew better tham me what I wanted and stuck these folders in the OD anyway.  So right now I am way over my limit and have 3700+ files that are not synced (but they still show up in the OD file folder with the red x).  Some files are synced and many are not - in the same folder.It scared the bejeebees out of me when I started to unlink OD and got the warning that the files would not be available.  So it sounds like I need to create safe \"Non-OD\" folders then move my files there BEFORE I unlink the folders from OD.  I don't necessarily want OD to go away - there are times it is useful when I am transferring files from home to work....but for the most part I don't use it, and I want to make that choice.  And I can't take a chance of losing any of the files that I just moved over from my dead laptop.","If your files are now stored on your PC 'safe' from OD then:To 'disable' OneDrive open right click OD icon in system tray, go to Account tab and unselect check box'Make all files available'.   Next go to Settings tab and unselect all check boxes and click OK.Finally right click OD icon again and select Close OneDrive. Now you can start OD from Start menu when you need it.","Oh my friend ... it's a lot less complicated than all that. May I help?First, by way of explanation, Microsoft is trying to convince Windows users to store their files in OneDrive ... to treat OneDrive as your 'hard drive in the cloud.' There are very good reasons for that, as there are very good reasons why Microsoft sets up Windows 10 by default to use OneDrive as much as possible, which many find sneaky. We can talk about those reasons in another post, if you're interested.For now, here's how to fix things so that files are only stored in OneDrive when you want them to be stored there. There are two parts to the process.The first part is to open the OneDrive app and go through its settings. This is something everyone should do, and for all their apps. Software developers routinely turn every feature 'on' so that users can see everything that the app can do. In the case of the OneDrive app, you can tell the app which folders will sync with OneDrive. You can choose any folder or folders, or none at all. You can turn off syncing altogether, if that's what you want. We can easily control what gets synced to OneDrive, if anything.The second part applies if you use Microsoft Office, which you probably do. Microsoft has set the default save location for all Office files - the place where files are saved by default - to OneDrive. You can easily change that, if you want. Just open any Office app and go through its settings until you find the setting where files get saved by default.Let's use Word 365 as an example. Open Word and go to File > Options > Save > Save Documents. That's where you tell Word where to save files.Going forward, you can control what gets saved to OneDrive by adjusting those settings, or by going directly to OneDrive. Just open any web browser and navigate tohttps:\/\/onedrive.live.com\/about\/en-us\/ (in the United States) and drag files onto the browser window.","You can have OneDrive online and all your files available locally as well for when there is no internet access by selecting \"Always keep on this device\".I subscribe to Office 365 Home which has a maximum of 6TB storage space for 6 family accounts, 1TB each.In case someday you may be interested here are the plans:  https:\/\/onedrive.live.com\/about\/en-US\/plans\/","ok guys, I understand how to keep OD from being default.  I've been changing \"file save\" location for years.My question is how do I set up new folders that are not defaulted to OD and THEN move my files to those folders. If I leave the files where they currently are and try to unlink OD I get the following message \"Your OneDrive files will stop syncing.  Locally available files will remain on this device WHILE ONLINE ONLY FILES WILL BE REMOVED\".Since everything was saved automatically on OD will I lose access to these files when I unlink?"]}]}