{"windows":[{"symptom":"External hard disk is not working in windowd 10 computer        I have my old laptop hard disk & that I am connecting to my new windows 10 hp laptop via sata cable. Even after connecting to laptop it does not recognizing. Same thing I did with another laptop over there its working fine.How can I fix this issue? I have updated drivers as well.","solutions":["Have you gone Disk Management (Win + X) and see if it shows up and has a letter?","Hi Kushal. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Sounds like an internally installed drive and not external, correct? Is it plugged in alone? Are you wanting to boot it or just access the data?Go into UEFI\/BIOS Setup by one of these methods: http:\/\/www.mydigitallife.info\/comprehensive-lis... to see if it shows up under Storage devices. You'll need to get it to show up there in order for it to work.Next go into Device Manager to see if it is showing up under Disk Drives, or there are any devices in error with a ? mark. If it's listed under Disk Drive (by it's model normally) then right click to Uninstall and restart PC to reinstall driver.Next go into Disk Management to look for the drive on the map at bottom. If necessary right click to assign a drive letter so it shows up in Disk Management.If it shows up but won't respond then Test the hard drive or SSD with diagnostics:https:\/\/www.lifewire.com\/free-hard-drive-testin...https:\/\/mashtips.com\/ssd-health-test-and-perfor...Best is to use the HDD\/SSD manufacturer's own if there is one, otherwise use Seatools bootable long test:http:\/\/blog.nowherelan.com\/2013\/04\/04\/boot-seat... Follow this up with a full Disk Check from the Command Prompt in Repair Mode or from bootable media:https:\/\/www.groovypost.com\/howto\/check-hard-dri... if necessary from the Command Prompt at boot:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","HI Greg,I am trying to connect my old laptop hard disk. Yes I just wanted to take my data from this device to my computer.I went through device management. Kindly have a look for the same.Thanks..","Have you gone Disk Management (Win + X) and see if it shows up and has a letter?@Lacrumb kindly have a look below screenshot..","You may need to set CSM or Legacy mode in Setup in addition to UEFI to get the device recognized.Look under Storage settings to see if the drive is detected in UEFI Setup. See how to access Setup on a UEFI system: http:\/\/www.isunshare.com\/windows-password\/four-...In addition to Setup, is the drive detected in Device Manager? Check under Disk Drives, right click the drive to uninstall, restart PC to reinstall it."]},{"symptom":"Windows could not configure one or more system components.        I can't update past the 1803 version of windows, It has been months now. I would like to update, I get an error at 60% that says  windows could not configure one or more system files.  error code in log 0x8007001F","solutions":["Hi, BryceMousseau My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.If you have problems updating Windows, follow these steps: If you have a third-party antivirus, you must disable or uninstall it. Try reset Windows update components: Right click on the start button and select Powershell (admin) or Command Prompt (admin)Write the next hit enter after each line. net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Restart and try again. You can also download the Windows Error Solver: https:\/\/support.microsoft.com\/en-us\/help\/10164\/...https:\/\/aka.ms\/wudiag You can do it manually by downloading the Windows ISO. When updating with the ISO, disconnect the Internet. https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/answers.microsoft.com\/en-us\/windows\/for...","Hello,See if this fix helps you:https:\/\/www.kapilarya.com\/windows-could-not-configure-one-or-more-system-components-windows-10Hope this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP. "]},{"symptom":"\"A great app is on it's way!\"        i noticed on my start menu a tile that just says \"A Great App is on its way!\", how do i know what app is downloading? its been stuck like that for a few hours now","solutions":["I would shutdown and restart.","i already did that, also tried the\"net stop wuauserv net stop cryptSvc net stop bits net stop msiserver ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old ren C:\\Windows\\System32\\catroot2 catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver\" option","Hello Joshirosama! My name is Marco, I am an Independent Advisor. I will do my best to help you.I have that too. It's probably for the launch of the new Microsoft Edge browser. He will end up leaving alone. Do not worry :)"]},{"symptom":"How to delete Microsoft Edge        I don't want to use Edge - how can I delete from notebook?  ","solutions":["Hi KC. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.They've made it extremely difficult to unisntall Edge now as it prepares to be replaced in the next few days with a brand new browser built on the Chrome chassis. So I'd wait to see if you want that browser before deciding.In addition due to unintended consequences of removing major system components it may be better to set your preferred browser and PDF reader as Default in Settings > Apps > Default Apps, and for PDF in Settings > Apps > Defaults Apps > Choose by App or File type. Then just ignore Edge or new Edge which shouldn't interfere. The days of using one browser are long gone. I would have several browsers on your task bar so there's always one that's best for the task. I use Firefox, Edge and Chrome in that order of preference. It's easy to share bookmarks between all of them in their settings under Import Favorites from another Browser, and Firefox and Chrome let you sign in to save and\/or sync your Favorites on any other device you sign into. Set the preferred browser as Default in Settings > Apps > Default Apps.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I don't want to use Edge - how can I delete from notebook?   Hello,AFAIK, it is not possible to completely uninstall Microsoft Edge as the browser is integrated with the operating system. Regards."]},{"symptom":"Laptop not playing music in stereo        I just got a new laptop to use in our church sound booth. I need it to play stereo audio files where the left channel is a click track (which only the musicians should hear) and the right channel is music which the congregation should hear through the loudspeakers. The sound only seems to be coming out in mono, though. I've gone into the Ease of Access audio settings and the button to \"turn on mono audio\" is off. I spent an hour on the phone with Dell customer support and he installed some updated drivers, but it's still not working. Any suggestions?","solutions":["Hello JosephChase1! My name is Marco, I am an Independent Advisor. I will do my best to help you.I put you the link of a video test for stereo sound. If the sound comes out well with this video, it means that your samples of its mono sound.https:\/\/www.youtube.com\/watch?v=6TWJaFD6R2sOtherwise we will test other solution. Marco _________________________________________________ Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Laptop does not boot        I have a Dell inspiron laptop with windows 10.  It had been working nearly 3 months without any trouble. Last week i installed Avastanti virus program ,  After finishing installation it does not restart. Tried several times result is the same.  Now when i switched on it asks mypassword and after giving it it does not boot but only an  arrow appears continuously,  When i press ctrl+alt+del keys i get on the screen lock switch user sign out change password task manager When i sign out and try to reboot something happens.Please help me to solve this problem.Thanks","solutions":["Hi, Davidweaver8 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Camera is not operational        The Windows store says the Camera is installed. on launching Camera App gives the error code 0X00F4244 the Camera is not installed. I can find no conflicts in device manager. Device manager does not show the camera s installed. I followed the steps posted to repair this. None have worked. How do i fix this? ","solutions":["Have you looked in your BIOS to see if turned on?","Hi MarianoBrowne My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.If you don’t have a webcam built-in or connected to the PC, you’ll see a simple black screen that gives the 0X00F424 ee can’t find your camera error.1] Check your webcam if it is installed correctly This is probably the first thing you need to check. Make sure your webcam’s USB port is working properly. Try changing the USB port of your computer and see if that helps.2] Update the webcam driver If you are setting up your webcam for the first time, you need to install a driver to run it properly. You should find the corresponding driver for your webcam. If you have already installed your webcam driver but still receive this issue, may be its time to update your driver using device manager as follows: Windows 10 users should press Win+X and click on Device Manager entry in the list. Locate the camera device next. It should be an Imaging Device. Right-click on that driver and click on Update driver option. Next, select the option that says Search automatically for updated driver software option. It should not take a lot of time after that to finish the whole process.3] Uninstall the webcam driver and reinstall it If you face any issue during the driver updating, you might need to uninstall the webcam driver. To do this, open Device Manager > right-click on the device > select Properties > switch to Driver tab > click on Uninstall Device button.Restart your computer and then open Device Manager again and click on Action > Scan for hardware changes.4] Roll back webcam driver If your webcam has stopped working after installing a new update, you should uninstall the update and roll back to the older version. You will have to open Device Manager > right-click on the device > select Properties > switch to Driver tab > click on Roll Back Driver button > select Yes on the next window. After that, you need to restart your PC to check whether it is working or not.5] Detect outdated webcam driver If your webcam is designed before Windows 7, it might not work with Windows 10. To find this out, follow these subsequent steps-Open Device Manager > select the device and Properties from the right-click context-menu > switch to Driver tab > select Driver details. You will find some Driver files on your screen. Now check whether you have any stream.sys file or not. If you see such a file in the list, your webcam may not work with Windows 10. In that case, you need to buy a new one.Hope this helps.","The Windows store says the Camera is installed. on launching Camera App gives the error code 0X00F4244 the Camera is not installed. I can find no conflicts in device manager. Device manager does not show the camera s installed. I followed the steps posted to repair this. None have worked. How do i fix this? Hello,See if this fix helps you:https:\/\/www.kapilarya.com\/fix-camera-not-working-in-windows-10Let us know if this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP. "]},{"symptom":"I have purchased a windows10 pc. I wish to keep my old windows7 pc. Can hackers access through my old windows7 pc?        I have purchased a windows10 pc. I wish to keep my old windows7 pc. Can hackers access through my old windows7 pc?","solutions":["I have purchased a windows10 pc. I wish to keep my old windows7 pc. Can hackers access through my old windows7 pc?Hackers can access through any OS.With Windows 7 will just be a bit easier as there will be no more security updates.Run a quality Anti Virus and complement it with a quality Anti Malware Product such as Malwarebytes.Be prudent as to the sites you visit.Don`t use the same Password for everything and make it a strong one.Change it over time but keep a log book of them so you don`t forget them.Be wary of Internet Banking and if you do make sure it has HTTPS beside it."]},{"symptom":"Device encryption with Windows 10 Home        I wanted to use device encryption on my Windows 10 Home PC.  64bit.  But it won't let me.When I got into System Information in the row Device Encryption Support slot it tell me:Reasons for failed automatic device encryption : Hardware security  test interface failed and device is not modern standbyWhen I went to check my TPM under Security processor details it tell me:SpecificationsManufacturer               INTELmanufacturer version  302.12.0.0Specification version    2.0PPI specification            1.3TPM spec sub-verison  1.16 (Weds, Sept 21, 2016)PC client version           1.0StatusAttestation  Readystorage      ReadySo my question is two fold. WHY doesn't my Windows allow for device encryption? Secondly HOW do I update\/upgrade my TPM(???) to be able to support Window's built in device encryption?Please help","solutions":["I wanted to use device encryption on my Windows 10 Home PC.  64bit.  But it won't let me.When I got into System Information in the row Device Encryption Support slot it tell me:Reasons for failed automatic device encryption : Hardware security  test interface failed and device is not modern standbyWhen I went to check my TPM under Security processor details it tell me:SpecificationsManufacturer               INTELmanufacturer version  302.12.0.0Specification version    2.0PPI specification            1.3TPM spec sub-verison  1.16 (Weds, Sept 21, 2016)PC client version           1.0StatusAttestation  Readystorage      ReadySo my question is two fold. WHY doesn't my Windows allow for device encryption? Secondly HOW do I update\/upgrade my TPM(???) to be able to support Window's built in device encryption?Please helpHello,AFAIK, Windows 10 Home doesn't have BitLocker and EFS support for encrypting contents. You need to upgrade to higher editions such as Pro, Enterprise to have device encryption available and working.Regards."]},{"symptom":"change my login pin.        My login PIN has possibly been compromised. For security\\ty sake id like to change it ","solutions":["Hi ColinDunphy, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.This is a very good security precaution that you are taking! In Windows 10, you can change your PIN by going to Settings > Accounts > Sign-in Options.Under the PIN heading, you can click the \"Change\" button. It will ask you for the current PIN, and you can then enter and confirm a new PIN.I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"My Microsoft Order is still Pending        So i ordered a Surface laptop 3 on December 1st, and I know that is black Friday so there were probably a lot of orders but i would love to have some sort of reassurance that my item will be delivered on time. It's been stuck in pending literally since i hit purchase and it says that the estimated delivery date is Dec 12, but that's in three days, and i highly doubt it'll get here by then if it still hasn't shipped. I have a trip to go on a few days after it's supposed to arrive and it would be nice to have my new laptop for it.Why doesn't Microsoft do better with the orders page? It should tell you if there's an issue or if it's sold out or if there's just a high volume of orders and that it may not arrive on time. I'd feel much better if it just gave me something, like Amazon does. Anyway, is there any way to find out the true status, more than just a lousy \"pending\"? And maybe a eay to ensure it gets here sooner, like pay a little extra?","solutions":["Hi Kort Thanks for participating in Microsoft Community, I'm Skypper G. I'm Independent advisor, let me help you with this.Is you already checked it in your order status following the steps below: https:\/\/support.microsoft.com\/en-us\/help\/402671...I would suggest to you try tomorrow or contact directly with Microsoft Commerce Support:https:\/\/support.microsoft.com\/en-us\/contactus\/","Same, its been pending for 3 days but it **** charged me i want my damn money back if your not going to ship my ****"]},{"symptom":"Windows 10 crashes on going to sleep        Windows 10 x64 ; older desktop with up-to-date patchesSince about mid Nov 2019 this system has been crashing on entering sleep mode. (Nice feature of upgrading to Windows 10 was \"sleep\" finally worked.  Until now.) I have about 10 minidumps starting from that time, altho there have been more crashes than that, & I finally turned sleep off. I'd like to get sleep working again because it noticeably saves electric rate $.I've looked thru various threads here & elsewhere & done some of the fiddling and checking with power, no joy. I tried the driver verify tool - that is hairy - wound up in a boot loop, so it may well be there is a non-MS driver cause (I had the MS drivers all turned off in verify, & as far as I can tell all of them are up to date.)I tried looking at a few of these minidumps with Windbg, here's a partial:0: kd> !analyze -vINTERNAL_POWER_ERROR (a0)The power policy manager experienced a fatal error.Arguments:Arg1: 000000000000000c, Dump stack failed to initialize.Arg2: ffffffffc0000001, Status codeArg3: ffff800ec37a82c0, Address of the dump stack contextArg4: 0000000000000000Debugging Details:------------------*** WARNING: Unable to verify timestamp for iaStorA.sys*** WARNING: Unable to verify timestamp for win32k.sys ...ERROR_CODE: (NTSTATUS) 0xc0000001 - {Operation Failed}  The requested operation was unsuccessful.IMAGE_NAME:  iaStorA.sysDEBUG_FLR_IMAGE_TIMESTAMP:  51fb0de8MODULE_NAME: iaStorAFAULTING_MODULE: fffff80416040000 iaStorA....Does this mean \"iaStorA\" is the problem, or just some event that failed while everything crashed?  This is where my limited knowledge of this architecture stops - I don't see how iaStorA is relevant to it & where it's being used.Any advice appreciated!  Regards, ==mwh","solutions":["Hi Michael Yes, that printout does indicate that iaStorA.sys is the main cause of that crash . . .That is the Intel RST (Rapid Storage Technology) driver, go to the support page for your PC on the manufacturers website, then from there, download and install the version of Intel RST they recommend for your PC . ..","> ERROR_CODE: (NTSTATUS) 0xc0000001 - {Operation Failed}  The requested operation was unsuccessful.> IMAGE_NAME:  iaStorA.sys> DEBUG_FLR_IMAGE_TIMESTAMP:  51fb0de8> MODULE_NAME: iaStorA> FAULTING_MODULE: fffff80416040000 iaStorA> ....> Does this mean \"iaStorA\" is the problem, or just some event that failed while everything crashed?  This is where my limited knowledge of this architecture stops - I don't see how iaStorA is relevant to it & where it's being used.Intel(R) Desktop\/Workstation\/Server Express Chipset SATA RAID Controller","Hi Michael Yes, that printout does indicate that iaStorA.sys is the main cause of that crash . . .That is the Intel RST (Rapid Storage Technology) driver, go to the support page for your PC on the manufacturers website, then from there, download and install the version of Intel RST they recommend for your PC . ..I have what they (HP) recommend.  I also ran Intel's extensive  diagnostics, & it didn't seem to come up with anything, althothere are certainly newer versions of RST.  I'm not sure why they wouldn't recommend it, perhaps the lack of BIOS updates?","Hi, Can you provide the following information which may help determine any issue(s): Windows Key + R > type msinfo32 in the \"Open\" box > OK > File > Save > then save as an .nfo fileThen make the resulting .nfo file available via a public folder on OneDrive or similar site.Also, can you do the following: Windows Key + R > type eventvwr in the \"Open\" box > OK > expand \"Custom Views\" and then right-click \"Administrative Events\" > select \"Save all events in Custom View As\" and save as an .evtx fileThen make the resulting .evtx file available via a public folder on OneDrive or similar site.Here's a link on using OneDrive: https:\/\/support.office.com\/en-us\/article\/share-...","https:\/\/onedrive.live.com\/?id=DD62296F10DB01BF%217314&cid=DD62296F10DB01BFAlso a complete minidump analysis run Thanks!","The link does not appear to work - can you make sure the files are in a folder shared with everyone.","It looks ok to me, let's try thishttp:\/\/tiny.cc\/fnnjizor a google drive shareable link if that just refuses to workhttp:\/\/tiny.cc\/t1njiz","That link worked. I might suggest to consider switching to the Microsoft built-in storage driver due to the age of the desktop:https:\/\/www.crucial.com\/usa\/en\/replacing-manufa...You may be able to install newer versions of the Intel RST driver but the Microsoft built-in driver may work better.As a general precaution create a System Restore Point beforehand. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I don't think that I'm using it, actually.  It was used in the Windows 7 era of this desktop & was required to boot fromthe mirror.   But later I got an SSD for the boot disk & then moved to Windows 10.Disk management reports the disk drives are using generic drivers (from 2006?  But Windowssays they are the best available).  There's probably some layering in the system architecture I don't understand.I did have some kind of problem with RST on the Windows 10 install & maybe it just got disabled?I am pretty sure I am using a Microsoft generic driver for the mirrored hard drives in this system, not the Intel mirroring stuff(which was nicer, but did not work).I don't see an IDE ATA\/ATAPI pick in device manager; I found the RST under \"Storage Controllers\".I'd like to clear this up, but I'm not really sure about an upgrade path since the vendors (HP, Intel) don't really seem to have anything.I am thinking I should mirror the SSD, park the original on the shelf, & then try various strategies with the mirror & see if the system can work - try updating the RST, try deleting it completely &c.  Any advice appreciated.I might suggest to consider switching to the Microsoft built-in storage driver due to the age of the desktop:https:\/\/www.crucial.com\/usa\/en\/replacing-manufa...You may be able to install newer versions of the Intel RST driver but the Microsoft built-in driver may work better.","The System Information file you provided shows the version of the Intel RST driver (IASTORA.SYS) is at version 12.8.0.1016 (from 2013).Perhaps try the latest version from Intel: https:\/\/downloadcenter.intel.com\/download\/29094...Again, create a System Restore Point beforehand. Alternatively, there is a driver link posted in the following topic from the HP Community forum (link is to sp97096.exe).https:\/\/h30434.www3.hp.com\/t5\/Notebook-Software...In both cases there appears to be a matching Hardware Id in the iaStorAC.inf so the drivers should install.Note: The above are non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Is there any way to install the Zune software on Windows 10 ?        Or does anyone know of any other device where the contents can be managed from a desktop and can play songs continuously ? Playing songs from dropbox on my tablet or phone plays one at a time and I have to tap on the next song after one ends. And on my phone, if you get off the dropbox screen, the music stops. Just a few reasons why I miss my Zune. ","solutions":["Hi Frank. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Zune is too old to install any longer. See the latest here: https:\/\/www.wired.com\/2015\/09\/what-to-do-with-y...ITunes can do what you want: https:\/\/www.imore.com\/how-install-itunes-12-win...You can also manage playlists on your phone and other devices using Windows Media Player:https:\/\/itstillworks.com\/12371039\/how-to-sync-a...https:\/\/www.dummies.com\/consumer-electronics\/sm...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"BSOD ACPI.SYS Reinstalled windows many time still not solve.        Dear Eveyone,I do need help as I am so hopeless elsewhere.My PC always stuck in BSOD randomly during the day.most of the time, it shows error as ACPI.SYS , Service_exception_error.My Spec - all news ( built on 19 JAN 2020 )Windows10 HomeCPU i5 9600KFBIOS Version 1401Mainboard Asus ROG Strix Z390-eRAM - 2RAM - 8x8 bus 3200 Thermaltake RGB https:\/\/www.thermaltake.com\/toughram-rgb-memoryddr4-3200mhz-16g-8g-x2.html(set XMP profile and set bus at 3200 in bios)2 SSD - Samsung 970 EvoVGA Asus ROG STRIX 2070 Super A8GPSU - Thermaltake 750W ToughPowerGrandRGBWatercooling set - Thermaltake Pacific CL360 Max D5 Hard Tube Water Cooling Kithttps:\/\/www.thermaltake.com\/thermaltake-pacific-cl360-max-d5-hard-tube-water-cooling-kit.htmlhere's memory.dmphttps:\/\/drive.google.com\/file\/d\/1nzZ8zZ9TOFuSxLTARBQFsef4Zzi7vaMB\/view?usp=sharingI really appreciate you guys help in advance, I feel so sad with my PC built having this issue.","solutions":["Hi Ayanami, to diagnose the underlying issue, I need to analyse your Mini-dump file(s):Open Windows File Explorer Navigate to C:\\Windows\\Minidump Zip up the contents of that folder If you have problems zipping those files, copy them out onto your Desktop and zip them from thereUpload the zip file to the Cloud (OneDrive, DropBox . . . etc.) Then post a link here to the zip file, so we can take a look for you . . .","Hello  Mr.Dave, Thank you very much for your reply, here's my minidump file. https:\/\/drive.google.com\/open?id=1VTrR-LaYQF2NVji9dkgT0ZpbgWjbJtAxWishing it not a hardware issue. (T T)","Hi Mr.Dave,just want to check if the file works for you?feel free to let me know if there any additional information you need. "]},{"symptom":"Can anyone tell me what this WinDbg error means for BSOD \"DPC_Watchdog Violation\" I get daily?        I get this error about once a day. I've done the following while troubleshooting:1 - Updated Nvidia P2000 Graphics card driver (Geforce Experience says up to date)2 - Updated NIC driver via Motherboard website3 - Disabled all audio drivers (don't need audio on this system)4 - I've run \"sfc \/scannow\" and it tells me \"did not find any integrity violations\"5 - Screenshot from BlueScreenView:   https:\/\/imgur.com\/a\/vh40O3X6 - Ran all current windows updates7 - Currently running Auslogics Driver Updater\" which is updating 12 drivers it found out of date, 110 up to date---Some updated drivers were: Disk Drive, PCI standard ISA brdige, Standard SATA AHCI Controller, USB Input device, PCI Express Root Complex, Audio Source, Generic PnP Monitor, Bluetooth Peripheral Device, etc).  Not sure if that will do anything, and question 3rd party driver updaters, but tried anyways since I'm already having problems.  Below iw from the WinDbg memory dump file: Microsoft (R) Windows Debugger Version 10.0.18362.1 AMD64Copyright (c) Microsoft Corporation. All rights reserved.Loading Dump File [C:\\Windows\\MEMORY.DMP]Kernel Bitmap Dump File: Kernel address space is available, User address space may not be available.Symbol search path is: srv*Executable search path is: Windows 10 Kernel Version 18362 MP (24 procs) Free x64Product: WinNt, suite: TerminalServer SingleUserTSBuilt by: 18362.1.amd64fre.19h1_release.190318-1202Machine Name:Kernel base = 0xfffff806`42400000 PsLoadedModuleList = 0xfffff806`42848130Debug session time: Fri Jan 10 23:08:38.379 2020 (UTC - 6:00)System Uptime: 0 days 6:14:42.031Loading Kernel Symbols..............................................................................................................................................................................................Loading User SymbolsPEB is paged out (Peb.Ldr = 00000000`020d1018).  Type \".hh dbgerr001\" for detailsLoading unloaded module list..........For analysis of this file, run !analyze -v6: kd> !analyze -v********************************************************************************                                                                             **                        Bugcheck Analysis                                    **                                                                             ********************************************************************************DPC_WATCHDOG_VIOLATION (133)The DPC watchdog detected a prolonged run time at an IRQL of DISPATCH_LEVELor above.Arguments:Arg1: 0000000000000000, A single DPC or ISR exceeded its time allotment. The offendingcomponent can usually be identified with a stack trace.Arg2: 0000000000000501, The DPC time count (in ticks).Arg3: 0000000000000500, The DPC time allotment (in ticks).Arg4: fffff80642973358, cast to nt!DPC_WATCHDOG_GLOBAL_TRIAGE_BLOCK, which containsadditional information regarding this single DPC timeoutDebugging Details:------------------****************************************************************************                                                                   ******                                                                   ******    Either you specified an unqualified symbol, or your debugger   ******    doesn't have full symbol information.  Unqualified symbol      ******    resolution is turned off by default. Please either specify a   ******    fully qualified symbol module!symbolname, or enable resolution ******    of unqualified symbols by typing \".symopt- 100\". Note that     ******    enabling unqualified symbol resolution with network symbol     ******    server shares in the symbol path may cause the debugger to     ******    appear to hang for long periods of time when an incorrect      ******    symbol name is typed or the network symbol server is down.     ******                                                                   ******    For some commands to work properly, your symbol path           ******    must point to .pdb files that have full type information.      ******                                                                   ******    Certain .pdb files (such as the public OS symbols) do not      ******    contain the required information.  Contact the group that      ******    provided you with these symbols if you need this command to    ******    work.                                                          ******                                                                   ******    Type referenced: TickPeriods                                   ******                                                                   ****************************************************************************KEY_VALUES_STRING: 1PROCESSES_ANALYSIS: 1SERVICE_ANALYSIS: 1STACKHASH_ANALYSIS: 1TIMELINE_ANALYSIS: 1DUMP_CLASS: 1DUMP_QUALIFIER: 401BUILD_VERSION_STRING:  18362.1.amd64fre.19h1_release.190318-1202SYSTEM_MANUFACTURER:  Gigabyte Technology Co., Ltd.SYSTEM_PRODUCT_NAME:  X570 UDSYSTEM_SKU:  Default stringSYSTEM_VERSION:  Default stringBIOS_VENDOR:  American Megatrends Inc.BIOS_VERSION:  F3BIOS_DATE:  09\/04\/2019BASEBOARD_MANUFACTURER:  Gigabyte Technology Co., Ltd.BASEBOARD_PRODUCT:  X570 UDBASEBOARD_VERSION:  x.xDUMP_TYPE:  1BUGCHECK_P1: 0BUGCHECK_P2: 501BUGCHECK_P3: 500BUGCHECK_P4: fffff80642973358DPC_TIMEOUT_TYPE:  SINGLE_DPC_TIMEOUT_EXCEEDEDCPU_COUNT: 18CPU_MHZ: ed1CPU_VENDOR:  AuthenticAMDCPU_FAMILY: 17CPU_MODEL: 71CPU_STEPPING: 0DEFAULT_BUCKET_ID:  WIN8_DRIVER_FAULTBUGCHECK_STR:  0x133PROCESS_NAME:  Plex Media Server.exeCURRENT_IRQL:  dANALYSIS_SESSION_HOST:  DESKTOP-0LCPO7PANALYSIS_SESSION_TIME:  01-10-2020 23:36:58.0187ANALYSIS_VERSION: 10.0.18362.1 amd64freLAST_CONTROL_TRANSFER:  from fffff806425eea3d to fffff806425c14e0STACK_TEXT:  ffffce01`0517cb08 fffff806`425eea3d : 00000000`00000133 00000000`00000000 00000000`00000501 00000000`00000500 : nt!KeBugCheckExffffce01`0517cb10 fffff806`4241f897 : 00004dc2`83b62c31 ffffce01`0515c180 00000000`00000286 ffffe685`fac76840 : nt!KeAccumulateTicks+0x1cbfddffffce01`0517cb70 fffff806`423601e1 : ffffa887`87b861a0 ffffa887`7dec9b00 ffffe685`fac768c0 ffffa887`7dec9bb0 : nt!KeClockInterruptNotify+0xc07ffffce01`0517cf30 fffff806`42402a25 : ffffa887`7dec9b00 00000000`00000000 00000000`00000000 ffff4fd7`01980de4 : hal!HalpTimerClockIpiRoutine+0x21ffffce01`0517cf60 fffff806`425c2f7a : ffffe685`fac768c0 ffffa887`7dec9b00 00000000`00000002 00000000`00000000 : nt!KiCallInterruptServiceRoutine+0xa5ffffce01`0517cfb0 fffff806`425c34e7 : 3fe30000`0000000a 0020b400`00000000 00000000`0000000a 00000002`0000000a : nt!KiInterruptSubDispatchNoLockNoEtw+0xfaffffe685`fac76840 fffff806`424a2320 : 00000000`00000003 ffffe685`0000000a 00000000`00000000 ffffe685`fac76ad8 : nt!KiInterruptDispatchNoLockNoEtw+0x37ffffe685`fac769d0 fffff806`426a808c : ffffce01`0515c180 00000000`00000000 00000000`00001fff ffffe685`fac76b39 : nt!KxWaitForSpinLockAndAcquire+0x30ffffe685`fac76a00 fffff806`4261fc7e : ffffa887`87b872f0 00000000`00000002 ffffe685`fac76b39 ffffa887`8973e000 : nt!KiAcquireSpinLockInstrumented+0xb4ffffe685`fac76a50 fffff806`4689ecf5 : ffffa887`87b861a0 ffffa887`87b861a0 ffffa887`907d6000 00001fff`03ffbfff : nt!KeAcquireSpinLockRaiseToDpc+0x17ddfeffffe685`fac76a80 fffff806`4689faea : ffffce01`0515c180 ffffa887`8973ef08 ffffa887`81b74350 00000000`00020000 : ndis!ndisQueuedMiniportDpcWorkItem+0x205ffffe685`fac76ba0 fffff806`4246ae95 : ffffce01`0515ef80 ffffa887`81b74350 ffffce01`0515c180 00000000`00000000 : ndis!ndisPeriodicReceivesTimer+0xeaffffe685`fac76c40 fffff806`4246a4ef : ffffce01`0515c180 798bd233`00000000 00000000`00000002 00000000`00000006 : nt!KiExecuteAllDpcs+0x305ffffe685`fac76d80 fffff806`425c8525 : 83484024`5c8b48c3 ffffce01`0515c180 00000000`00000000 00000000`0000007c : nt!KiRetireDpcList+0x1efffffe685`fac76fb0 fffff806`425c8310 : 00000000`180b8d01 00000000`00000000 00000000`00000000 00000000`00001dd8 : nt!KxRetireDpcList+0x5ffffe686`02a76ad0 fffff806`425c79e0 : 00000000`00000000 ffffe686`02a76b80 ffffa887`7dec9b00 00000000`00000001 : nt!KiDispatchInterruptContinueffffe686`02a76b00 00000000`008bb1f1 : 00000000`00000000 00000000`00000000 00000000`00000000 00000000`00000000 : nt!KiDpcInterrupt+0x2f000000000`180b87d8 00000000`00000000 : 00000000`00000000 00000000`00000000 00000000`00000000 00000000`00000000 : 0x8bb1f1THREAD_SHA1_HASH_MOD_FUNC:  3007274cee77e68fcb723cc089dc33aaa5222513THREAD_SHA1_HASH_MOD_FUNC_OFFSET:  1f7ddceeaee54f5d7ac407f4f1c8689a410fc901THREAD_SHA1_HASH_MOD:  26a778f0fd03891ad31c905da5c178ca4739a259FOLLOWUP_IP: ndis!ndisQueuedMiniportDpcWorkItem+205fffff806`4689ecf5 488b8b18130000  mov     rcx,qword ptr [rbx+1318h]FAULT_INSTR_CODE:  188b8b48SYMBOL_STACK_INDEX:  aSYMBOL_NAME:  ndis!ndisQueuedMiniportDpcWorkItem+205FOLLOWUP_NAME:  MachineOwnerMODULE_NAME: ndisIMAGE_NAME:  ndis.sysDEBUG_FLR_IMAGE_TIMESTAMP:  20136331STACK_COMMAND:  .thread ; .cxr ; kbBUCKET_ID_FUNC_OFFSET:  205FAILURE_BUCKET_ID:  0x133_DPC_ndis!ndisQueuedMiniportDpcWorkItemBUCKET_ID:  0x133_DPC_ndis!ndisQueuedMiniportDpcWorkItemPRIMARY_PROBLEM_CLASS:  0x133_DPC_ndis!ndisQueuedMiniportDpcWorkItemTARGET_TIME:  2020-01-11T05:08:38.000ZOSBUILD:  18362OSSERVICEPACK:  0SERVICEPACK_NUMBER: 0OS_REVISION: 0SUITE_MASK:  272PRODUCT_TYPE:  1OSPLATFORM_TYPE:  x64OSNAME:  Windows 10OSEDITION:  Windows 10 WinNt TerminalServer SingleUserTSOS_LOCALE:  USER_LCID:  0OSBUILD_TIMESTAMP:  1980-01-11 09:53:20BUILDDATESTAMP_STR:  190318-1202BUILDLAB_STR:  19h1_releaseBUILDOSVER_STR:  10.0.18362.1.amd64fre.19h1_release.190318-1202ANALYSIS_SESSION_ELAPSED_TIME:  2ab7ANALYSIS_SOURCE:  KMFAILURE_ID_HASH_STRING:  km:0x133_dpc_ndis!ndisqueuedminiportdpcworkitemFAILURE_ID_HASH:  {94235cf9-4baa-c0d7-f20b-c1d66e3d3670}Followup:     MachineOwner---------","solutions":["Hi Brian, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved. BIOS_DATE: 09\/04\/2019 The BIOS indicates that may be a fairly new motherboard\/system. Check with Gigabyte support, their on-line docs, and diagnostics.ndis.sys is a Windows component means something else drove it into Fault. Nothing in you post really makes definite guess possible. Please post the minidump for analysis as I might be able to glean more from it that way.Troubleshoot blue screen errors <-- read this link http:\/\/windows.microsoft.com\/en-us\/windows-10\/t...We can analyze the minidumps if you make them available from the OneDrive or other file sharing sites (such as MediaFire). If you have problems uploading the minidumps copy them to the Desktop or the Documents folder and upload them from there.One-Drive - Share files and folders and change permissions http:\/\/windows.microsoft.com\/en-us\/onedrive\/sha...Upload photos and files http:\/\/windows.microsoft.com\/en-us\/onedrive\/add...Zip or upload the contents of C:\\Windows\\minidump Use OneDrive to upload collected files http:\/\/social.technet.microsoft.com\/Forums\/en-U...================================================ Check these resources : BBCode: 133 0x00000133 <-- read this link http:\/\/www.faultwire.com\/solutions-fatal_error\/...*1340.html?order=date==================================================== Run checkdisk (chkdsk \/f \/r ) FIle Explorer - Right Click the drive - Properties - Tools - Error checking - Check - scan the drive OR From the Command Prompt of the Windows 10 disk (boot from it) : chkdsk \/f \/r (Space after k and before \/ and after f and before \/ ) REBOOT sfc \/scannow (Space after c and before \/ ) REBOOT ----------------------------------------------------------------------------------------This is my generic how to for proper driver updates : This utility makes it easy to see which versions are loaded : Run DriverView - set VIEW to Hide Microsoft drivers - update those without Dump in their names (and BIOS and chipset drivers).DriverView - Free - utility displays the list of all device drivers currently loaded on your system. For each driver in the list, additional useful information is displayed: load address of the driver, description, version, product name, company that created the driver, and more. http:\/\/www.nirsoft.net\/utils\/driverview.htmlFor Drivers check System Maker as fallbacks and Device Maker's which are the most current. Right Click the Start Button - Device Manager - Display Adapter - write down the make and complete model of your video adapter - double click - Driver's tab - write down the version info. Now click UPdate Driver (this may not do anything as MS is far behind certifying drivers) - then Right Click - Uninstall - REBOOT this will refresh the driver stack.Repeat that for Network - Network Card (NIC), Wifi, Sound, Mouse and Keyboard if 3rd party with their own software and drivers and any other major device drivers you have.Now go to System Maker's site (Dell, HP, Toshiba as examples) (as rollback) and then Device Maker's site (Realtek, Intel, Nvidia, ATI as examples) and get their latest versions. (Look for BIOS, Chipset and software updates at System Maker's site while there.)Download - SAVE - go to where you put them - Right Click - RUN AD ADMIN - REBOOT after each installation.Always check in Device Manager - Drivers tab to be sure the version you are installing actually shows up. This is because some drivers rollback before the latest is installed (sound drivers particularly do this) so install a driver - reboot - check to be sure it is installed and repeat as needed. Repeat at Device Makers - BTW at Device Makers DO NOT RUN THEIR SCANNER - check manually by model.Manually look at manufacturer's sites for drivers - and Device Maker's sites. http:\/\/pcsupport.about.com\/od\/driverssupport\/ht...____________________________________________________ After doing ALL the updates you can, and if the issue continues, then run Driver Verifier. Driver Verifier can help find some BSOD issues : Using Driver Verifier to identify issues with Windows drivers for advanced users http:\/\/support.microsoft.com\/kb\/244617How To Troubleshoot Driver Problems in Windows Vista or 7. (8\/8.1 and 10 are essentially the same).http:\/\/www.winvistaclub.com\/t79.htmlUsing Driver Verifier https:\/\/msdn.microsoft.com\/en-us\/library\/window...WINKEY + X - RUN - type in -> verifier \/reset hit enter to disable If Driver Verifier creates a minidump upload it and post the link here so we can analyze it.Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all."]},{"symptom":"6 pc network uodating to windows 10        Hello,I am wanting to upgrade 6 of my office computers which are networked and using windows 7 pro.  What I am most curious about is the users.  When you install 10 it wants to create or use a MS account.  I have 1 account for my self as a personal account.  I don't want to use this account for 6 pc that my employees are using, i also dont want to make a MS account for each employee either.So without buying a business account whats the best way to set up this network using 10 pro.  Along with this issue is when you backup windows 7 and load backup in 10 the file system is off because win7 had a users folder with a named user, the one pc i did so far with 10 and a ms account does not match the named folders from win7 for the backup. Same if I just upgrade 7 to 10.So should I setup up all the Pcs with a local account only, or use my one Ms Account as an admin then create a user like the win7 pcs had and then load the backup in the local user account.None of my employees use Office365 and email is all browser based.  So all the PCs need to do is browse and open pdfs and quickbooks shared off the server PC.","solutions":["Hi gregg1981, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.While the latest build of Windows 10 does want you to create a new Microsoft account, there is a workaround that will trick it into allowing the creation of a local account upon installation.You can do this by unplugging the network cable temporarily, or disabling the wifi (or putting it in airplane mode) before starting the setup process.I have had it where I connected the computer to wifi, and it forced a Microsoft account, and then even if I tried to back out, I could not disconnect it from wireless so had to start the whole installation process over again in order to get the local option back. This should also address your question about the backups as you can create the local account with the same name as the previous username, which will create a regular local directory under C:\\UsersI hope this has helped you. If you have any other questions, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","You can activate Windows using a product key on a local account. Windows 10 has a new feature with digital licenses, that associates the Windows activation to a Microsoft account, however it is not required you go this route.To learn more about activating Windows 10 and digital licenses, please see: https:\/\/support.microsoft.com\/en-ca\/help\/12440\/... Sorry to hear about the trouble you have been having. I have upgraded Windows 7 to 10 several times fairly seamlessly, however a clean install is not necessarily a bad thing to start the system from scratch. Hoping for a smoother upgrade process for you - please reach out if you have any further questions!"]},{"symptom":"Backup stops at 97%        Hi.  I am trying to back up my laptop and it stops at 97%.  I am running Windows 7.  Is there anyone that can give me some advice please.","solutions":["Sorry I am running windows 10"]},{"symptom":"Hello facial reconition,fingerprint reconition        Hello, my name is Kimberly and I would like to know how to use fingerprint and hello facial. I have a Dell Inspiron desktop Windows 10. Hope you can help. my email- *** Email address is removed for privacy ***Thank You","solutions":["Hello Kimberly, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.To use the fingerprint function of Windows Hello, you will need to have a fingerprint reader. It is a piece of hardware that desktop computers typically do not come with, so I just wanted to verify if you had this on your keyboard or another fingerprint reader.To set it up, you can go to Start > Settings > Accounts > then under Sign-in options, under Windows Hello, you should see a Fingerprint and\/or Face Recognition section with the \"Set up\" button. It will require you to set a PIN and will then bring you through the process to register your fingerprint. Note: You may need to set up a PIN before Windows Hello is avaialble. I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","Hello, Ashton W. I performed all the action and it said my pc isn't compatible.Thank You, you were very helpful. If you can suggest anything else please email me.","Hi Kimberly, Thank you for your response and I am glad you found the information helpful. In order to use these features, you would need to purchase a fingerprint reader and\/or a specialized webcam that supports Windows Hello for your desktop computer. Some laptops have these hardware items built-in.This website has some compatible webcams listed: https:\/\/lensxp.com\/best-windows-hello-compatibl...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Also, there are fingerprint readers such as this one that claim to be compatible:https:\/\/www.amazon.ca\/Fingerprint-PQI-Matching-...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Please let us know if you have any other questions! -Ashton"]},{"symptom":"My Desktop hard disk has crashed and i need to change it.        My Desktop hard disk has crashed and i need to change it. Will i be able to use the same Windows & office keys if i install new harddisk in the System ? what should i do plz suggest .","solutions":["Hi Neha. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.If the hard drive is failing I'd replace it with an SSD which is the best upgrade you can give your PC - lightning fast, better than a new higher end PC without one.Follow the included instructions or a video you find for your model via Google to install the SSD\/HDD.Then do the gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If Windows 10 came preinstalled on the PC then the Product Key is embedded in the UEFI firmware chip on the motherboard and will reactivate itself.If you upgraded the PC was assigned a permanent Digital License to reinstall Windows 10 as often as you want. Skip the Product Key during install and It will activate after connecting to the internet.If you have a retail Product Key then insert it during install and it will reactivate afterwards.To move Office see here: https:\/\/support.office.com\/en-us\/article\/downlo...https:\/\/support.office.com\/en-us\/article\/downlo...To create bootable Windows 10 Installation Media (on another PC if necessary) install Media Creation Tool and follow the directions in the middle of the download page here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key for your PC maker given in this chart:https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, then on second screen choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, select the Unallocated Space, click Next to let it create and format the needed partitions and start install - this makes it foolproof.You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC because you will learn everything that works best and how to apply it with your own hands.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved."]},{"symptom":"CAC Card reader not detecting the card        Hello, I've read several posts with the EXACT same question, but they're not resolved, so I'm starting my own. I'm in the military and use a CAC CARD reader to access websites. After a recent windows update, my computer no longer detects my CAC CARD. The card reader is fine, but the card itself isn't detecting. I REPEAT, the card reader is fine. (Also, its NOT an SD card. Its a CAC card. On an other post here, a fix was suggested for an SD card. Its not an SD card).The card reader is detected, I've updated and reinstalled the driver multiple times. I've tried rolling it back. The card reader shows on the computer under Device Manager, it shows on other computers too, and the CAC Card works on other computers. It is not a problem with the card reader, or the card, it is a problem with some settings in this computer. Internet explorer, google chrome, and firefox all fail to see the CAC Card on this computer. Can you please help fix how my computer will detect the card itself?The card reader i'm using is called \"Stanley Global Technologies\" and in Device Manager it shows as Smart Card Reader- \"Alcor Micro USB Smart Card Reader\".Thanks!","solutions":["Hi Adrianna, Thank you for writing to Microsoft Community Forums. I understand your query related to not being able to use CAC Card reader on your PC after updates. I certainly appreciate your efforts in trying to resolve the issue by performing certain troubleshooting steps. Which build version of Windows 10 are you using currently?Which updates were installed recently?What is the make and model of the PC? To check the installed updates go to Settings > Updates & Security > Windows updates > View installed update history. Refer the article Which version of Windows operating system am I running? As you have already mentioned that, you have tried updating the drivers and the issue persists. One of the things that you can try is downloading the drivers for Alcor Micro USB Smart Card Reader from theMicrosoft update catalog website, depending on the version of Windows that you are using. Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator","1. System type: 64-bit operating system, x64 based processorEdition: Windows 10 EnterpriseVersion: 1903Installed on: 10\/21\/2019OS Build 18362.4182.  Windows version 19033. Lenova Thinkpad P50","There is  a download for the Alcor Smart Card reader on the Microsoft udpate catalog website link that you provided: Windows 10, version 1903 and later, Servicing Drivers.Downloading it doens't seem to change anything. Noteable: the internet browers all crash every time I go to a website requiring the CAC Card. It will state: \"Please insert a CAC Card\" (even though one is already inserted). You can either click \"OK\" or \"cancel\", but the the browser will always stop responding and crash.","Hi Adrianna, Thank you for your reply, and I apologize for the delayed response. I have been researching on this issue, since you are using an Enterprise edition of Windows, I would suggest you to check with your IT admin to check if the card security settings can be reconfigured.Meanwhile, you may also post your query on TechNet forums, where we have expertise and support professionals who are well equipped with the knowledge to assist you with your query. Regards,Prakhar KhareMicrosoft Community – Moderator","I have the same issue and I have a home version of Windows 10. My CAC card reader was working fine until this last update to Windows 10. The issue is that whatever update to USB use was made, broke the USB port to identify that a CAC Card reader is plugged in. For example, I have my CAC Card reader plugged into the USB port. It lights up and receives power. Both led lights turn on. Yet with this status, my laptop still does not recognize that anything is plugged in. It doesn't even show up as an unidentified item that needs drivers.That is the issue that I will bet that many are having right now but it's not being explained correctly. I have an older computer with Windows 8.1 and the CAC Card reader works fine. This last update broke something. Please fix it as it has made a nightmare of me being able to do my job. (i.e. I can't do my job).","This is not the situation I was describing. The card reader is fine. It shows under the devices when it is plugged in and disappears when un-plugged. It automatically installs drivers. It lights up and shows power. Again, the issue is that the computer is not detecting that a card is inserted into it.","I have the same problem and it has been going on for months. I downloaded and tried everything. My computer sees the CAC reader, but not the CAC card. Now I have to drive to a military base to get on since my laptop isn't working. All because I took an update!! Never would of thought this would happen. Next time I am rethinking any update, if I can even get this fixed. I thought by taking the next couple of updates it would fix itself, but it hasn't!!","Thank you for this post!  I have exactly your situation - card reader (and new card reader) both detected, current drivers, uninstall\/reinstall.. everything was fine until around November.  \"Connect a smart card\" is the error.  DEERS checked my card then issued a new card just to be safe, same problem.  Did you ever find a fix?  I'm pulling for you!  lp","@laura.99 No, nothing has changed for me yet, unfortunately. I feel like I'm just waiting for the next Windows update later this year to hopefully fix the issue . Not sure why only some of us are having issues with this around the country...","Ironically, I live in England. I thought I’d solve it when I went home for Christmas. :) I’ve asked some folks at my unit (Ft Lee area) to share my issue and included the link to this thread in their networks to see if anyone’s heard anything. I will definitely let you know! Would be amazing if Microsoft found something. Fingers crossed!"]}]}