{"windows":[{"symptom":"Prints perfect from hard drive but not from email or internet!        Until recently, I could print from my emails on my desktop to my HP Officejet printer wirelessly. Now I can only print from my iPad, iPhone, or hard drive. Any suggestions?","solutions":[]},{"symptom":"issues with downloading update        On updates, screen say no updates available with green check-markI am having a issue with downloading any security updates, or driver updates.  For some reason Microsoft office 24 updates  works fine.I'm running win 10 build version 1909.I have used troubleshooter for updates.I have tried to download security patches manually, no luck.Would appreciate any help.","solutions":["Hi, ZZZEEE40 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.If you have problems updating Windows, follow these steps: If you have a third-party antivirus, you must disable or uninstall it. Try reset Windows update components: Right click on the start button and select Powershell (admin) or Command Prompt (admin)Write the next hit enter after each line. net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Restart and try again. You can also download the Windows Error Solver: https:\/\/support.microsoft.com\/en-us\/help\/10164\/...https:\/\/aka.ms\/wudiag","Hi Jeffrey,Thank you for you're help, as I was following you're steps, after restarting my computer, I checked for updates.  after about 5 min of checking all previous updates were gone. Also using Windows update 2 issues were present:1)  IsPostback_RC_PendingUpdates isPostback:False2) Problem with Bits service.I have been looking at more help NET MSG 2182Now I am getting the error message  Transfer Service is not started.  Message say type HELPMSG 3521Any suggestions????Don"]},{"symptom":"Changing Default Save Location        Just upgraded SSD and installed fresh version of Windows 10 version 1909.  My SSD is the (C:) drive.  Prior to the SSD upgrade, files such as Documents, Downloads, Music and Pictures were saved to my (D:) Hard Drive.     Example:  (D:) >Gagnon >DocumentsIn other words my D: drive was made the default location for Documents.My question is this:  How can I make the connection between my new SSD drive (C:) and my (D:) drive so that my Documents, Downloads, Music and Pictures are saved on D.Thank you for your time and response.Leon Gagnon","solutions":["Hi Leon Open Windows File Explorer On the left, click 'Quick Access' Right click the Documents folder in the right pane of File Explorer and choose PropertiesChoose the Location tab on the resulting dialog Click 'Move' then navigate to find the D:\\Dagnon\\Documents folder and select that.You ill be asked if you want to merge content, choose Yes Wait for that process to complete, then do the same for your other library foldersFor each folder, make sure you choose the exact folder you want to use on your D Drive . . ."]},{"symptom":"Windows 10 Pro Activation        I bought windows 10 pro in the Microsoft app store and got the confirmation email. In the confirmation email I do not see my activation code. I continued to the link to my Microsoft account and there is a link that does not work. ","solutions":["Hi Lu, Seems you did an upgrade Home to Pro thru Microsoft Store. In this case Pro license is tied to your hardware. Activation servers has this information so you are not provided with product key.","On my computer it asks to active windows in settings. The only way to do that is with an activation key.","Please use generic technical Pro key VK7JG-NPHTM-C97JM-9MPGT-3V66T"]},{"symptom":"add :WofCompressedData:$DATA at the end of a file name        Hi, I had to recover some data from a lost partition, however using 2 different programs gave 2 different results. One works fine but it doesn't keep folder structure and file names wich become hard to handle, and the other ones seems to not recover them correctly. Since the file size is different I belive that the second program doesn't recognize that the files are compressed. I have found the 2 versions of the same file and they show a small difference in size which is ok because of the compression, however the compressed one should end with :WofCompressedData:$DATA. What I would like to do is to add this string at the end of the recovered files to see if it might fix them, but windows won't let me add the \":\" character. There is any way I can avoid this block?Edit: files were compressed using LZX and compact command from cmd","solutions":[]},{"symptom":"the update deleted my sound        I had windows 10 and it did a preview update and removed everything i'm fine with that but I can't get my sound it does not even list a sound card so I can't update it , the speaker in the bottom right has a red x on it. I tried all the fixes that HP said but it doesn't help , how can I get it to see I have a sound card it is a HP Pavilion AMD, it was originally 8.1 windows ","solutions":["Hi Gary You need to go to the support page for your PC on the HP website, then from there, download and install the Audio device drivers they recommend for your PC . . .If you have any difficulty locating that support page, what is the exact Model No. of you PC - that will be printed on a sticker on the bottom casing . . .","Hi DaveM11Thanks for the reply my pavilion is a HP500-37cb , it is strange when I go to my devices it says there is no device listed at all on the drop down menu, and when you right click the speaker with the red X on it down on the right corner of the task bar it also says no device connected"]},{"symptom":"Problem opening Google Chrome on Dell lap top computer        Can no longer open Coogle Chrome, Google Word, Google Excel, Google Power Point on my desk top.","solutions":["Hi Marvin and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.Have you tried reinstalling Google Chrome? 1. Press the Windows key and type in \"Settings\" then press enter. 2. Click \"Apps & features. 3. search Google Chrome App. 4. Uninstall. 5 after uninstalling, download and reinstall it using Microsoft Edge. I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"Cortana suddenly can't be accessed in the Philippines using my Android smartphone        I'm an avid fan of Cortana and I've always been able to use it here in the Philippines because it's so helpful.  Today, I suddenly can't use it.  It doesn't respond to any typed or voice commands.  What the hell is wrong?!I can't even find it on the Google Play Store.  I tried Bing and it led me to the Cortana page on Google Play store but it says the app isn't available in my country!  What the **** is wrong?!I need Cortana because it's a big help in making me organize my life for Chrissake!","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.I understand you may have used this previously but Cortana is only supported in these regions:https:\/\/support.microsoft.com\/en-us\/help\/402694...Regards, Ross"]},{"symptom":"Cannot get my system to boot at all. \"Writing Segment Heap...Done\" & \"Preparing automatic repair\"        Hello, A few nights ago I turned on my desktop. The computer was on for several minutes, but it was not displaying anything on my monitor. I checked the connection between the two, unplugged and replugged the HDMI chords, but nothing worked. So I held the power button until my system turned off. Now every time I turn on my computer it says:\"The operating system did not shutdown cleanly.Reconstructing Cache Metadata.Please do not interrupt this process.Reading Packed Metadata into memory...DoneProcessing Delta Log record.....................0Writing updated Packed Metadata...........DoneCreating the Segment\/Index Pairs............100%Total number of Segment\/Index Pairs.......3126944Sorting Segment\/Index pairs phase 1.......100%Sorting Segment\/Index pairs phase 2.......100%Writing sorted Segment\/Index Pairs..........DoneTotal Heap Size..........................................12216Writing Segment Heap...............................Done\"I have left it alone for several hours at a time and nothing happens. The spinning circle at the bottom is there acting like it's loading but it never does anything. Sometimes it also says \"Preparing automatic repair\". I have let that run for several hours and nothing has come of that either. I have searched the internet and the Microsoft forums for solutions and have tried several of them but I cannot get any of them to work. I can't get to the login screen which several suggestions required. The first thing I tried was to start the Windows Recovery Environment. That has never loaded no matter what methods I attempt to get it to work. I have a Windows 10 Installation Media USB that I made with the Microsoft Media Creation Tool. Whenever I select to boot from my USB from the \"Boot Options\" menu it only shows the spinning circle for a few minutes and then shows the long message from above and preparing automatic repair. At this point I don't really know what else to try. I've been working on this for 5 days and have not been able to find any solutions that worked for me. Any help or suggestions would be amazing because I'm losing my mind here. ","solutions":["Hi CWU. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Try resetting the BIOS to defaults: https:\/\/www.groovypost.com\/howto\/reset-pc-bios-...https:\/\/www.maketecheasier.com\/how-to-reset-cmo...Confirm the media you made will boot in another working PC to know for sure it's good.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, then on second screen choose Repair Your Computer. If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first. There is always a way to get the media booted and I will guide you until it does, even if necessary to reset the BIOS to defaults via several methods.In the Advanced Troubleshooting options try to System Restore to a point before the problems began, try the new Uninstall Updates button, then Startup Repair, then if necessary from Startup Settings try to get into Safe Mode with Networking, or lastly Safe Mode. If Startup Settings aren't available you can force Safe Mode from the Command Prompt following Step 5 here:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf..., or using the command to unhide F8 Advanced Boot Options here:https:\/\/www.tenforums.com\/tutorials\/22455-enabl... where you can also try the old reliable Last Known Good Configuration.From Safe Mode w\/Networking work through the Windows 10 Install Integrity Checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... Update your drivers from the PC's Support Downloads web page. Compare the latest drivers with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.If Safe Mode doesn’t work or help stabilize things then return to Advanced Troubleshoot options. Next try Command Prompt to run through Windows 10 Install Integrity Checklist (above link) Step 10 repair commands including sfc \/scannow, DISM, a full Disk Check:https:\/\/www.groovypost.com\/howto\/check-hard-dri..., or return to Troubleshoot options to Reset Your Windows 10 PC.Better yet use the same booted media to do the vastly superior Clean Install following the steps in this link to delete all partitions down to Unallocated Space to get it cleanest:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... There is a step to Rescue Files from the booted media or Repair Mode Command Prompt first:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... These steps are excerpted from my tutorial that compiles everything possible for Troubleshooting Windows 10 Failure to Start:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... You can continue with the other steps there.To test hardware, Dell and HP have onboard diagnostics triggered by powering up and pressing the F12 and ESC key respectively.Test the RAM overnight to stress it with the best bootable test memtest86, following these steps which test both the sticks and the slots:https:\/\/www.wikihow.com\/Test-PC-RAM-with-MemTest86Test the hard drive with diagnostics: https:\/\/www.lifewire.com\/free-hard-drive-testin...Best is to use the manufacturer's own if there is one, otherwise use Seatools bootable long test:http:\/\/blog.nowherelan.com\/2013\/04\/04\/boot-seat... Follow this up with a full Disk Check: https:\/\/www.groovypost.com\/howto\/check-hard-dri... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer There are links to a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hello Greg,Thank you for your response. I want to try doing the usb installation media again. So, I don't know if it makes a difference but I have an Alienware desktop and when I pull up the setup utility with F2 it is the \"Aptio Setup Utility.\" For restoring the BIOS\/UEFI settings to default there is an option that says \"Restore Defaults\" on the Exit tab. Is that all I would need to do to restore all of the defaults, or is there another step?As far as the USB itself goes, I unfortunately don't have another computer that I could test it on and make sure it works. I used the Media Creation Tool to format it again this morning to make sure I was working with a fresh install. Whenever I have the USB plugged in and pull up the Boot Options menu with F12 it shows: \"Boot mode is set to: UEFI; Secure boot: ONUEFI OPTIONS:     HDD2 - Windows Boot Manager (Intel Data_Volume)     USB1 - UEFI OS(PNY USB Flash Drive 1100)      Onboard NIC (IPV4)     Onboard NIC (IPV6)OTHER OPTIONS:     BIOS Setup     Diagnostics     BIOS Flash Update     Device Configuration     Peripheral Device Setting (OPROM Setting)     Change Boot Mode Setting\"From here I have been selecting the USB1 option and pressing enter for it to boot from the USB. However, when I do that it does the exact same thing as when I just regularly boot from the hard drive (the long message that ends with writing segment heap and preparing automatic repair), and it sits there and does that until I turn it off. I have never been able to get to a second screen from the USB boot that shows options to repair my computer.  ","What that means is it's bypassing the media (which you appear to be booting correctly and is listed correctly as UEFI media) and attempting to start Windows which is why you're seeing the same thing as starting WIndows, so there must be something wrong with the media. Can you locate another 8gb+ flash stick or new DVD to try creating the media again to see if it works?Sometimes resetting the BIOS to defaults works too. You only need to find the choice to Reset to Defaults, then Save and Exit. Go back to check the Settings for UEFI, Secure Boot, and Fast boot are still enabled, and WIndows Boot Manager is still set first to boot in Boot Priority Order. If there is no WBM choice it will invoke itself during install so just keep the WIndows hard drive set first, trigger the media using BIOS Boot menu as you're correctly doing.","Unfortunately I don't have another USB that would work or a DVD drive to burn a DVD. I might try to use the Media Creation Tool with my USB again, maybe it didn't set it up quite right for some reason. I know there are different file formats and format types for USBs, does the Media Creation Tool automatically format the USB to what it needs to be? Hypothetically speaking, what would it look like if the boot from USB worked? Would it load for a second and then pull up a screen with install options or something similar? ","Try wiping the flash stick with Diskpart Clean Command: https:\/\/www.tenforums.com\/tutorials\/85819-erase... Then run the MCT again to create the bootable flash media. It will format the drive for you as part of the process of writing code to the stick to make it bootable.I hope this helps. Keep me posted on your progress as I will be here to help until the case is resolved.______________________________________________ Note: Linked tutorial is from Shawn Brink who is a trusted Microsoft MVP.","Ok, I wiped the USB and I am currently running the MCT now. When it finishes I will try to boot again, and let you know how it goes. ","I will give you all possible steps to troubleshoot installation failure which work in about 90% of cases. If not we'll go from there:Follow the illustrated Clean Install steps in this tutorial which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Make sure all other drives and peripherals are unplugged. Update the BIOS or UEFI firmware to latest, or reset to Defaults, making sure SATA controller is set to AHCI, UEFI is enabled, CSM or Legacy BIOS disabled, Windows Boot Manager set first to boot, if necessary disable Secure and Fast Boot until after install: https:\/\/www.mydigitallife.net\/comprehensive-lis... https:\/\/www.groovypost.com\/howto\/reset-pc-bios-...Create the latest new Windows 10 Installation Media by installing Media Creation Tool and following the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... If you're using another PC to do this then uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first. If you can start Windows enter UEFI firmware here:http:\/\/www.isunshare.com\/windows-password\/four-... Choose the boot device as a UEFI device if offered, on first screen press Shift + F10 to open a Command Prompt, type the following commands, each followed by Enter key:DISKPART LIST DISK SEL DIS # (replace # with the disk # of the Windows disk from list in previous command)CLEAN EXIT Close Command Box, on second screen choose Install Now, then Custom Install, then at the drive selection screen choose Unallocated Space, click Next to let it create needed partitions and start install - this makes it foolproof.Make sure to follow the setup steps in the first link tutorial to complete your install. Drivers are important enough that those steps are printed in red.You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the first linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC. If all else fails you can move the hard drive to another PC to do the install with it plugged in alone. Windows 10 is remarkably adaptive to new hardware without needing adaptive restore. If it will start it will swap out all drivers requiring several restarts. You can also try applying a same-version System Image to the intact SSD\/hard drive.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","So one of the things mentioned by you and in that first article is turning off Fast Boot so it doesn't bypass the installation media. Whenever I press F12 for the boot options or F2 for the BIOS Setup, I can't find an option to turn off fast boot. Am I missing something?","Not all BIOS have Fast Boot, you have to scour all tabs and settings including sub-settings in the BIOS\/UEFI setup.If you know the media is good because it will boot in another PC, then try resetting the BIOS to defaults as suggested earlier. Other methods here:https:\/\/www.groovypost.com\/howto\/reset-pc-bios-...https:\/\/www.maketecheasier.com\/how-to-reset-cmo...","I've tried everything and simply cannot get it to work. I am going to take my hard drive to get wiped and then do a fresh install of Windows 10. Thank you for your help Greg!"]},{"symptom":"Microsoft Edge - Browser History Retention Time        How long is the Browser History retained within Microsoft Edge and where is this information stored?A previous poster asked this in 2017 and was advised that \"Browsers keep all websites that you have accessed unless you delete the browsing history. Edge and Internet Explorer can keep the history of the accessed websites up to 999 days. To configure the settings, follow these steps:Click on Start.Type Internet Options then press Enter.Under Browsing history, click on Settings.Go to the History tab.Adjust the number of days if necessary.\"However this no longer appears to be the case. This value is set to 20 (confirmed within Internet Options and the Registry) but Microsoft Edge appears to be retaining the browsing history for 90 days. There does not appear to be anywhere within Microsoft Edge that this can be customised and I have been unable to locate a registry key that stores this information for Microsoft Edge. ","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Unfortunately there is no way to customise this setting, the only similar setting available is to clear the browsing data upon exit but I don't think this would suit your requirements.Although no value is able to be set you are correct in that data is stored for 90 days.You might wish to suggest this as a feature update using the feedback hub: https:\/\/support.microsoft.com\/en-gb\/help\/402156...Regards, Ross","Hi Ross,Thank you for your response, is there anywhere in the registry that this is stored? I've checked a few different Windows 10 machines, some have the \"DaysToKeep\" registry key within the \"HKCU\\Local Settings\\Software\\Microsoft\\Windows\\CurrentVersion\\AppContainer\\Storage\\microsoft.microsoftedge_8wekyb3d8bbwe\\MicrosoftEdge\\Internet Settings\\Url History\\\" key. However on other machines the \"Url History\" key is not present within the above structure and by virtue of this the \"DaysToKeep\" registry key is also not present. I've not yet managed to work out what (if anything) causes this key to be created or if it is created manually. Within the Internet Options for IE, the\"DaysToKeep\" registry key is only created when the days are adjusted within Internet Options > Browsing history > History but as you have previously stated there is no way of customising this setting with Microsoft Edge so the key is clearly not created in the same way. Thanks","Hi, I’ve certainly not seen anything reporting about a registry key available to modify this setting. However Edge does run using a completely separate set of parameters from IE so anything that previously worked, is unlikely to do so now.Regards, Ross"]},{"symptom":"Hardware upgrade, did not get key before changing the motherboard how to re-activate Windows ?        Hi,I've recently upgraded my hardware but I didn't think of getting my product key before changing the MotherBoard. I should have a digital key because I upgraded Windows from 7 to 10 (the free upgrade) but when I try the troubleshooting in the settings it can't find it or it says I need to connect to Internet which I obviously am because I have apps, that need connection themselves, running in background.If you ask any solution that'd be great !","solutions":["Hi Cédric Is your Windows 10 licence based on an OEM Windows 7 licence (came pre-installed on a PC) or Retail (purchased separately to a PC)If it is a Retail licence, then it will have transfer rights to a new Motherboard or PC, if it is OEM it will not . ..Is your Windows 10 based on a Retail licenced version of Windows 7?"]},{"symptom":"Surface Pro won't print in color        My surface Pro won't print in color. The printer prints fine from other devices so I know it is not the problem. This just started randomly about a week ago, it previously worked fine.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues while trying to print in color while using Surface Pro.​​ As you have mentioned that you are able to print in greyscale, it is possible that printer settings are set to print in greyscale. We will certainly assist you with this issue. However, we would like to know the details requested below: What is the make and model of the printer that you are using?Which application are you are using to print?Are you aware of any changes made to the computer recently? I would suggest you to check the printing preferences and check if the Print in Gray Scale option is enabled. Refer the steps mentioned below: Press Windows Logo key + R, to openRun dialog box.Type control printers and click onOK.Right click on the Printer that you are using, and selectPrinting Preferences.Navigate to the Color tab and select the optionPrint in color. (If you do not see Color tab, you may want to check theAdvanced options and check if Print in Grayscale isoff.)Click on OK and check if you are able to print in color. Let us know how it goes. Regards,Nikhar KhareMicrosoft Community - Moderator","Hi,The model is HP 3820 and the printer works fine when printing from my other computer. All the settings on my surface for the printer have colored enabled so that is not the problem. I am printing from word docs, excel , PDF's and pictures. I have not made any changes to the computer but updates are automatic."]},{"symptom":"Contact list for Windows 10 mail        I have just upgraded from Windows 7 to Windows 10.  I was using Windows Live Mail with my Windows 7 system but I want to use Windows 10 Mail from now on.  I have created an email account under Windows 10 Mail which works.  It is an IMAP account.  However this account does not yet recognize  the contact list I transferred from my Windows 7 system (nor does it seem to store any email addresses for people I have sent or received messages from under the new account). I understand that the People App includes contact information use by Windows 10 Mail.  When I go to the People App to import the contact information from my Windows 7 system, the People App asks me to create a new account, even though the account has already been created under Windows Mail and is recognized in my account list under Settings: i.e., it does not recognized my IMAP email account. Please tell me how I can import my contact list to the People App for my existing IMAP Mail account.Thank you.  ","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query related to importing contacts in People app on Windows 10. Let me help you with the article which provides the information on using the People app. Please refer the articlePeople app help and see if that helps. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"lock screen picture        The lock screen picture of the Lake within the mountains is depressing me as it looks cold and dangerous and i would hate to be near there , evry time i boot my pc this picture comes on and cannot be deleted, it is really depressing me now i should be able to have a blank screen or a picture of my choice . i have been in settings and changed pictures but every time i boot this depressing picture comes on . why cant i delete it it makes me ill. regards steven","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? Under lock screen there should be an option to choose a photo (or Spotlight or slideshow) if you choose your own photo does it remain or return to the default mountain view?You could use this fix from the tenforum to reset & re-register Spotlight: https:\/\/www.tenforums.com\/tutorials\/82156-reset...Please follow the instructions carefully & note than it can take 24 hours for the photo to change.Disclaimer - This post contains reference to non-Microsoft websites and there may be ads on the page for products & services including products frequently classified as a PUP (Potentially Unwanted Product). Please thoroughly research any product \/ service advertised on the page before you decide to use them. Your discretion is very much advised.","If you have a picture that you like and want to use it go Settings, Personalization, Lock screen, under the picture change to Picture, Browse, find your picture, double click on it, Upload.","Thanks for your rely , i will read this very carefully and try it , Thank You ","If you wish more detailed instructions &\/or screen caps let me know.","How are you getting on with the instructions? Do you require any help?","will do Virginia thank you , regards steve","I look forward to hearing good news on your problem."]},{"symptom":"Windows 7 and Living With It After 14 January        I want to keep my Win 7 64-bit office-situated pc. I now can't afford to supplement it with a new,Ethernet-sharing Win 10 laptop. Twice in the past I'veUpgraded existing O\/S [95 to XP and XP to 7] and ended up with disk corruption\/fail. Looking at all options, I'm now usingFIREFOX [have to use it on 10 anyway as the pages keep freezing up (\"not responding\") onIE11] and will switch to PROTON Email [THUNDERBIRDwouldn't create an account]. A lot of web pages won't supportIE11, so that's no loss. I'm going to use a new anti-virus to replace MSE. NB:365 is deleterious to any 64-bit system. Thankful I created aRestore Point before trying it. As to Microsoft Security Updates, there are many users out there who boast that they'venever downloaded them. And I must admit that they did not prevent my pc from beinghacked. There are many freeware solutions out there without paying for MS's 3-year extension plan. Fact is, I and a lot of users don't like much of Win 10. Perhaps when its time for retirement comes something more palatable will emerge.","solutions":["Ok. Thanks","Virtually all of my clients are on the same wave length as you.  Keeping windows 7 working for as long as their hardware continues to work acceptably and other software is available for it.  Key, of course, is top-end antivirus software.  The following link is for a detailed step by step to re-install Win7 now and create a system image that can be restored regardless of Microsoft \"support:.https:\/\/www.askwoody.com\/2019\/canadian-tech-how-to-rebuild-a-win7-system-with-minimal-snooping\/","A lot of what you write doesn't make a lot of sense.  You need to address each issue individually.  Instead you're lopping everything together and kind of giving up.  Not a solution if you want to be on top of your system. No, the world won't end on Jan 14 for Win7 users.  For security read\/write all email in Plain Text, easily done in Thunderbird.  Proton has many restrictions that Thunderbird doesn't have.  Opera Mail is another option though Thunderbird is far better.  Depends on how many email accounts you're managing.  So fix this account problem with Thunderbird by asking on Mozilla's support forum.  Its excellent. For Office try Libre Office.  Seems to work fine.  Free.  For webpage compatibility use both Chrome and Firefox.  Firefox gives the user far more options but is not always compatible with all websites so we need Chrome as a backup.  And if you're talking\/chatting online you need Chrome for Hangouts.Get a SSD drive for C drive if you're using older hardware.  You might want to mention your CPU type\/speed and ram for reference.  SSD's are incredibly cheap.  You can put almost all your programs on a cheap Sata 7200 rpm drive along with all your files\/data.  My 30gb SSD cost me $15 a couple of years ago.  They're cheaper now.  Go with a 60gb for about $20 used.  Just wipe it well before use in case there was some psycho using it before you.  Eraser is good for that.  Also KillDisk.  It can take hours to properly overwrite a hard drive.Meanwhile try OS X (it can run on many types of PC hardware) and Linux as a backup to Windows.  We'll almost always need Windows but it doesn't mean you have to use it all the time.  As SSD's are so cheap now its best to put another OS on a separate drive instead of partitioning a drive.  For Linux just use a 30gb.  Should be about $10 used.  For OS X you may be able to use the same size, not sure. For hardware upgrades look at midrange AMD Ryzen stuff as OS X is now far more compatible with that now that it used to be.  Get a CPU with built on video to save a lot.  Used prices:$50-70 ATX AM4 motherboard for Ryzen CPU's $50-70 Ryzen CPU with built in video$25-50 8-16gb DDR ram$20 Power supply$$10-20 Case$155-230 Total for great midrange performance.  Ebay is your source.  Amazon is a joke comparatively for used equipment.  Obviously get your case locally as shipping will be much higher because of its size.  Maybe the power supply too as they're kind of heavy.  24\" monitors should be $50-80 and 27\" ones about $70-100.  Compare that to the lunacy of an iMac! "]},{"symptom":"Delete File failed; code 5 Access Denied        trying to install a file on my new Dell Alienware PC I have full admin rights on the pc can anyone please point me in the right direction... it's driving me crazy ","solutions":["Hello j_k_nash, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemSorry but this was not clear, are you trying to delete something or install something?can you please provide more info? Cheers! Farah","Trying to install a program... it really should not be this hard I have followed ideas here https:\/\/windowsreport.com\/error-5-access-is-denied-fix\/ but I am admin on the account I tried all of these approaches...  ","Have you followed all the steps mentioned in this link? You should check the folder it needs to be installed on and then apply the following:- open cmd from start menu and run it as an adminisrator - type the following command to take ownership of the folder: takeown \/f \"C:\/folder\/file\" \/r \/d y replace \"C:\\folder\/file\" with your actual folder which you are installing to. - aterwards run this command: icacls \"C:\/folder\/file\" \/grant administrators:F \/T you should be able to install your program in the desired path. Let me know how it goes Farah","Why do I need to do this? I will try it now but I dont understand I. Ever needed to do this for other application ","Do you have a uk support number 0800 0260330 is it... ","My interpretation is: It could be that this application is not digitally signed, and it tries to write new data in Program files or in the Drive C. which only Windows trusted installer service can do,therefore, the installation is not allowed to proceed. I believe that it a program related in this case. and for further investigation you can contact the program manufacture or follow the workaround I posted.Please let me know if I can help more :) Cheers! Farah","Its going to create its own directory in programs so do I run on programs? ","I would not take the ownership from windows in Program files folder..this could lead to some issues with the system.another workaround is to open a CMD window and run it as an administrator, then drag the installation setup to this cmd window and run it from there.btw. can you share this program name?"]},{"symptom":"Windows Hello        Hello, my windows hello has been very weird lately. When I try to update my photo because I got new glasses, the windows hello scans my face in black and white. Can anyone help me?*****Moved to Windows*****","solutions":[]},{"symptom":"Will not allow DVDs to play        This unit will not play any type of DVD ??????","solutions":["Hi Robert, There's a lot of things to consider in regards to this issue. However, where are you playing your DVD's? Are you able to play them before with the same PC\/Laptop that you're using? We need more information in order to determine what would be the cause of this issue.Please provide necessary data that we need to further assist you. Thanks and regards,","Thanks for your response.I have recently purchased a refurbished Dell Optiflex 7010 USFF Desktop PC with Optical DVD Drive.I downloaded\/purchased the Microsoft DVD player but it will not play any sort of DVD.The DVD is accepted by the PC but does not play.Many thanks, Bob Wolstenholme","Since you have Windows 10 have you tried the Movies and TV app?  In Device Manager does it show your drive working properly? Be sure the correctDVD Region is set for your location.","Hi Bob, Most likely the codec of your player doesn't have the correct one to play the ones with the DVD.Since your DVD can be detected, can you confirm if you can open the files inside?Please also provide the file extension of this DVD content. I may suggest you to use VLC media player as it has more codecs that has compatibility with this kind of files in order for you to play.Please let me know if you'll be able to download this. Thanks and regards,","This unit will not play any type of DVD ?????? thank you","where are you playing your DVD's?"]},{"symptom":"I can't download Nvidia Control Panel on Microsoft Store        I recently got a bitcoin mining virus and it was impossible to delete it, my only option was to Reset factory my pc. Usually i will have Nvidia control panel installed automatically when i reset my pc But it was gone this time. So i tought it's because i haven't updated my gpu drivers after when i did that The application said You can download Nvidia Control panel on Microsoft. I couldn't download it.Is it because of the virus or i'm just having issues with my gpu. I've also tried to plug my hdmi cable on and off. it still didn't help.","solutions":["Is there any error message when you try to download? Is Windows fully. Up to date? When I clean installed Windows recently I couldn’t install iCloud due to requiring further updates.Have you tried downloading the drivers direct from nVidia? It may be due to the virus, you can check with these programs: Try running these programs: MBAM free: https:\/\/www.malwarebytes.com\/mwb-download\/Eset online scanner: http:\/\/www.eset.com\/us\/online-scanner\/ Adwcleaner: https:\/\/www.malwarebytes.com\/adwcleaner\/If these find one or more infections but do not fully remove them it will be wise to register with a malware removal site to receive dedicated malware removal instructions, an expert will remain with you throughout the process until confirmation that your PC is 100% clean. Malwarebytes virus\/malware removal forum: https:\/\/forums.malwarebytes.com\/forum\/7-windows...Bleeping computer malware\/virus removal forum: https:\/\/www.bleepingcomputer.com\/forums\/forum22...Disclaimer - This post contains reference to non-Microsoft websites and there may be ads on the page for products & services including products frequently classified as a PUP (Potentially Unwanted Product). Please thoroughly research any product \/ service advertised on the page before you decide to use them. Your discretion is very much advised.","When you download the GPU installation package from Nvidia it will install the Nvidia Control Panel. What graphics do you have and have you downloaded the latest driver from Nvidia.?","Hi Ainda,            Your best bet is to go to there web site and download it there. Link : https:\/\/www.nvidia.comI Hope I've Helped","I got a laptop from Dell, they came with RTX 2060 6gb, my computer was slow because apparently there is another graphic card. I tried to use the 2060 instead of the one that intel came with, so I tried to download the drivers. I thought it worked, it didn't. And when it finished the installation, there was a message popped up said \"Nvidia control panel is missing, click here to download from Microsoft Store\" I tried to download it from the site store. A message popped up \"Open URL:ms-windows-store?\" so I clicked open, but then nothing happened after that. :\/ I'm very frustrated, and I don't know what else should I do lol.","If you go to the Device Manager you can update your GPU Drivers, hopefully that can fix it and if it doesn't you can disable the other display adapter and try that1. Click the Windows Key 2. Type in Device Manager3. Locate Display Adapters and double click it.4.  Right click the Display Adapter.  (It'll probably show up as NVIDIA GeForce RTX 2060.)5. After that click update driver then Search automatically for updated driver software. After that you might see some flashing while it's installing which is normal.If this doesn't work you can try the disabling the secondary display adapter, just go through the same process but instead of updating you would click disable on the other adapter.","I also have this problem with missing control panel according to microsoft store","You need dhc drivers apparently: https:\/\/www.nvidia.co.uk\/Download\/index.aspx?lang=en-ukAnd windows update on automatic, so it can download control panel automatically through windows update. https:\/\/nvidia.custhelp.com\/app\/answers\/detail\/a_id\/4733\/~\/nvidia-control-panel-windows-store-app "]},{"symptom":"Problem CONNECTING to wireless Bluetooth Speakers        I have a Dell Windows 10 Inspiron 3668 (x64).I am unable to connect to wireless speakers (Creative T15) from my desktop.The wireless speakers work fine from my iPhone.The Dell has no problem connecting to an adjacent wireless printer.I have replaced and updated all the drivers, and checked Bluetooth services settings.I am able to PAIR the speakers, but cannot CONNECT.I think this problem recently occurred after installing a Windows update.","solutions":["Hi JAS. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give all possible steps for troubleshooting Bluetooth in order of priority, so even if you've tried them please do it over in sequence. Many problems right now are being solved by updating to the latest version so if you want to skip to that step see the Repair Install at bottom: Try Updating the Bluetooth driver from the Dell Support Downloads webpage here: http:\/\/www.dell.com\/support\/home\/us\/en\/19\/Produ... for your Service Tag on sticker on PC. Install it even if it's the same or newer than the one in Device Manager reached by right clicking the Start button.Right click Start button to access Device Manager, locate Bluetooth device (if necessary from View tab Show Hidden Devices), on Driver tab see if Roll Back is available, if not try Update Driver, first automatically, then Browse, then Let Me Pick to try all previously installed Drivers. If these fail Uninstall the Driver, restart PC to reinstall. If the BT driver is not there, access the View tab in Device Manager to \"Show Hidden Devices.\"Make sure you're pairing correctly as shown here: https:\/\/support.microsoft.com\/en-us\/help\/15290\/... See Fixes here which are all working: https:\/\/support.microsoft.com\/en-us\/help\/14169\/...https:\/\/superuser.com\/questions\/1017867\/make-wi...https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/www.lifewire.com\/fix-windows-10-bluetoo...Try the Bluetooth troubleshooter at Settings > Update & Security > Troubleshoot. Try turning off Fast Startup at Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change settings that are unavailable > uncheck Fast Startup.If this is a mic or headset right click Volume icon in System Tray to Open Sound Settings, make sure the correct device is selected for input or output in the dropdown menu.Then try pairing again, if necessary run the Bluetooth Troubleshooter again. If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....If you think the BT adapter has failed, you can replace it easily with a USB nano adapter like this one:https:\/\/www.amazon.com\/ZEXMTE-Bluetooth-Receive... Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1909 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Greg,Thanks so much for your detailed comments.  Since I had done most of your suggestions multiple times, I decided to reinstall windows which took about three hours.  After it successfully completed, I checked all the drivers with device manager and all were running properly.  I then went to services to verify that bluetooth services were running.  The BT audio gateway, bt driver management service, and bt support service were all running.  They were, but the bt user support service was not and after starting it, I was unable to APPLY the change.  I get a \"The parameter is incorrect\" message as I had previously.Bottom line:  the same problem exists.  The Creative T15 Wireless audio device shows up as paired, but when I attempt to CONNECT, I get \"That didn't work.  Make sure your Bluetooth device is still discoverable, then try again.\"It's pretty clear that the BT device works with my iPhone and my BT printer works from my desktop, so the problem seems unique to BT audio.Not sure where to go next!","If none of the troubleshooting steps I gave help then your BT adapter may be failing. I suggested an inexpensive nano adapter you can replace it with and be back up and running for about $12.","Greg,I'd be happy to do that, but my BT printer works fine.  Do you still recommend that?","Got it. See if any steps here for those speakers work: https:\/\/answers.microsoft.com\/en-us\/windows\/for...I'll give you all possible solutions for Sound problems in order of priority, so please try any you've already tried again in order. If you have any problems performing any steps I'll be standing by here to help you.1) Update the sound driver from the PC or device maker's Support Downloads webpage for your exact model, if it is newer than the one presently installed in Device Manager reached by right clicking the Start button. While there compare to make sure you also have the latest BIOS, Chipset, Display, Network and all other drivers. 2) Restore the Windows Audio Service which may have become disabled: https:\/\/www.tenforums.com\/tutorials\/57567-resto... 3) Next try these checklists: https:\/\/support.microsoft.com\/en-in\/help\/402699... https:\/\/www.howtogeek.com\/443702\/how-to-fix-sou...4) Right click Volume icon in System Tray, choose Sound Settings, from the Output and Input devices dropdown menus, choose then one(s) affected to see if that helps. If not use the Troubleshoot button nearby.5) Run the Playing Sound troubleshooter at Start button > Settings>Update & Security>Troubleshoot.6) Try rolling back the sound drivers in Device Manager reached by right clicking the Start button. Choose Sound controller and other audio devices, then Driver tab, then Roll back if available.7) If no newer sound drivers then uninstall the one presently installed in Device Manager, reached by right clicking the Start Button. Restart PC to reinstall.8) Try other and older drivers for your model Sound controller, too. For example, try the next oldest driver in the model's online Support Downloads list. To try all previous drivers installed on your system, in Device Manager choose Sound controller's Driver tab, then Update Driver, then Browse, then Let Me Pick. Finally, try installing the latest Sound driver in Compatibility Mode as shown here:https:\/\/social.technet.microsoft.com\/Forums\/win...________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Greg,Thanks again for your detailed reply.  After no luck with \"reconfigurations\" I ordered the Zexmte bluetooth USB Adapter.  After figuring out how to disable the internal Dell wireless adapter, I'm now able to access my wireless speaker.This was a weird problem all along.  I'm learning that wireless devices have a relatively short technical life.Thanks again for sharing your knowledge."]}]}