{"windows":[{"symptom":"I really don't want my computer to update again        Hello, I'm here with yet another problem with Windows update.I've had problems with \"How to update Windows 1803 to 1903?\" as you can see in my profile, it has been answered but it just made further problems for me.My computer is a low-end laptop and actually can't handle the Windows updates. Windows itself installs the drivers that are needed for the new Windows automatically but this is actually my exact problem! As my computer is a weak one, unfortunately (and surprisingly) it somehow can't handle the drivers for it's own graphic cards.I tried my best to install them from many ways: AMD driver installer, Device manager, Copying files into their destination (which was a stupid action to do), etc. but there's no way I can install drivers up to 2015. It doesn't install the Display driver and causes Win crash, overheating, glitches and I can't even lighten up or down my monitor or use night light!Anyways, as you know, the new Windows (1903 and up) needs 2019 or better drivers for the graphic cards, I can't install them and if I even stay on 2015, it causes Windows to crash.All I need now, is how to disable the automatic updates? I tried two ways that I found on internet, but I'm not sure if that's going to do any help. Now I just paused the updates but I'm running out of time...if anyone's here that can help me, I'd appreciate it!And oh, this is one of the two ways I tried:1- I edited my registry. I made a dword (in Windows update key) and named it \"NoAutomaticUpdate\" and I put it on true, if I'm guessing right.I can't remember the last one.I asked a friend about this, and he said that I have to change my graphic cards, but I can't do this because of two reasons, one is that graphic cards are very expensive in where I live, and the second one is that it's too risky to change a notebook's graphic cards. I just want the updates to stop, or at least only Windows update. I don't have any problems with other updates, only Windows update. Thank you.","solutions":["have you read the question carefully? I can't update, mate.","Hi Zhaviz, I'm afraid that there is no way to fully disable Windows Update on Windows 10. Can you give me the make and model of your laptop ? So I can check the specifications.As a workaround you can try to use a third-party firewall, that may allow you to block Windows Update connection to internet, and thus, downloading updates.But no guarantee that it will work. Regards Jay","oh dear god...this update is really going to damage my computer.sure thing!System Manufacture: ASUSTek COMPUTER INC.System Model: X550DPBios: 211Processor: AMD A6-5350M APU with Radeon HD Graphics (2 CPUs), ~2.9GHzMemory: 4096 MB RAManything else? or these are enough?","Ok, so I've checked the drivers available, and the latest are from 2016 (beta version) :https:\/\/www.amd.com\/fr\/support\/apu\/amd-series-p...The issue here comes from AMD that doesn't make updated software for the integrated graphics.","I knew that. as I said, I can't install drivers up to 2015, no matter what.I think there's no hope...Thank you for the help anyway :)","Yeah, unfortunately I think there isn't much we can do about that. You can try the \"firewall\" blocking technique, but results may vary. Have a nice day Regards Jay"]},{"symptom":"Error when trying to open Microsoft Store        Hi,I am having an error when i am trying to open the Microsoft Store.They say that,\"The server stumbled\".\"We all have bad days\".and they have given me a error code called 0*80072EE7.Please help me to this problem. This started from like 1 and half hour.Hope you will replay me soon.Thankful and grateful.Raihan Salavudeen.","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,Method 1: Change region for Microsoft store 1. Open start menu and open settings (gear icon) 2. Click on time and language and go to region 3. Change region to united states and re-open Microsoft store. Method 2: Windows Store App Troubleshooter 1. Press Windows + I to open settings 2. click update & security, then troubleshoot 3. now on right-hand side look for Windows store app 4. Select and run the troubleshooter Method 3: Disable third party services and startup programs 1. Go to start menu\/search msconfig 2. On the system configuration window go to the services tab 3. Tick on hide all microsoft service so that this won't be affected 4. Choose to disable all services 5. Next, go to the startup tab and on the window choose to open task manager 6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok 8. A prompt to restart the computer will show up and try again Method 4: Create a new user profile 1. Search for netplwiz on the start menu 2. Click on Add 3. Choose to sign in without a Microsoft account 4. Fill up the form and choose finish\/done 5. Highlight the newly created user account from the user account\/netplwiz window6. Hit properties and set it as an administrator 7. Log in the new user account and test if it's working Method 5: In-place upgrade\/Repair install In the event that it still occurs, I would recommend a repair install\/in-place upgrade to override and fix system components while setting the system to the latest version of windows 101. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","Hi Gary,When i did all this methods i didn't get the right solution for this problem Do you have any other solution for my problemThankful and grateful.Raihan Salavudeen.","Hi RaihanSalavudeen I'll try to help you out. Can you give me a screenshot of the error message ? Also, if the error is \"only\" a few hours old, maybe just waiting a little moment may solve the issue.Microsoft may be experiencing some issue on their end. Regards Jay"]},{"symptom":"Can't boot Windows from any source        I recently upgraded my pc with a new motherboard, processor and ram. Now when I insert the windows installation disk the windows logo appears and after 1 second of spinning dots the pic restarts. This happens over and over again. When I try to boot Windows from an SSD with Windows already installed the same thing happens. Do you guys have any idea what the cause of this issue might be? Thanks","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.It sounds like you have a hardware problem - is the CPU cooler correctly mounted? Have you tried swapping RAM modules to different slots and\/or using only 1 if you have multiple.Can you get the computer in to the BIOS set-up page - and if so can you check CPU temperature, any any other health information given? Will the computer continue to run if left on the BIOS screen, or does it reset in a similar timeframe?A very common reason for a repeated restart like you describe - particularly on new hardware - would be a RAM issue.Regards, David"]},{"symptom":"Have to keep re-pairing bluetooth devices        Hey guys, I would appreciate getting some help on this.After this last Windows update that messed up with the bluetooth functionality and this last one that tried to fix it I have to forget my devices and pair them again every single time I want to use them. I have already tried all the usually recommended solutions out there: running the troubleshooter, drivers are up to date, and so on. Could anybody please help me with this?","solutions":["Hi, it could be the driver installed through Windows Update isn't working. Have you tried downloading it directly from the manufacturers website and install it from there? I get this all the time from Lenovo laptops","Hi Mobyd33!Thanks a lot for the answer.Yeah, I have already tried looking for the most up to date driver from both ASUS website and SONY website (my most used bluetooth device). Neither of them has it available for download. At least not for my devices' models (ROG G56JK and DR-BTN200 respectively). Is there an alternative you can think of?"]},{"symptom":"What is this?        I noticed this program that appears sometimes when shutting down or rebooting, and since I've never seen something like this I thought I'd ask.Also worth noting that I've run The windows antivirus and Malaware bytes and the pc appears to be clean.","solutions":["Turns out it was the Adobe Creative Cloud.I'm gonna leave the post here since I saw other people with the same question."]},{"symptom":"SDHC drive slot corrupted        Hi I am trying to copy things to my sdhc drive slot but am unable to it says disk is write protected I've tried removing read only using disk part but dosent work , even in formatting it simply says disk is write protected, the only thing I can do is copy things from sdhc card to pc nothing else. Is there any way I can solve this?","solutions":["Hello Impo, I'm Didi, an independent advisor. Have you tried your SDHC drive on another computer ? If yes, do you have the same problem ?Also have you checked the write-protection button on the card, for example here is a picture of this button :https:\/\/filestore.community.support.microsoft.c... If this doesn't help try this : 1) Right-click on the SDHC drive in Explorer and select Properties; then, under Security, you’ll find your account name (You should be the administrator)2) Change the permission for the SD card to Read & Write, Read & Execute, or Full Control (This will remove the write protection as well)Regards, Didi","Is there a slider switch in the SD card that is set to locked."]},{"symptom":"IP address location wrong country        My browser shows that I'm in Canada and reroutes all my sites through Canada even though I'm in Michigan.   My settings in Chrome show I'm in the US. Despite that, all my sites, such as AOL and Amazon, locate me in Canada. It also registers I'm in  Canada on other browsers, such as Explorer and Safari. The problem is on this computer both in my office and at home when I bring it home.  I've rebooted by router with no improvement.  I've gone into Settings on Chrome and the Control Panel in Windows to make sure it says I'm in the USA, which it does.  I've spoken to AT&T, my service provider, which was no help.  Any suggestions??","solutions":["What do you see as location info if you use this website. https:\/\/www.iplocation.net\/","Hi Marc! I'm Steve, an Independent Advisor and a Windows user like you. I'm happy to help with your query.I've seen this before and it's very frustrating! However unfortunately there's nothing you can change within Windows that will help with this. When you browse to sites such as Amazon they do a lookup on the Public IP address you're connecting from and serve you content based on the geolocation that's returned for your IP address (and not your actual location).As the Public IP address is provided to your router by your ISP this is something they would need to resolve for you, as the address you're being issued is from a block of their addresses that's registered\/geolocated in Canada.My advice would be to persist with AT&T, try to get in contact with someone there in more of a tech support role rather than their customer service team as they are more likely to understand the issue!Please let me know if I can be of any further assistance!","Thank you!","Toronto Ontario","That's no problem, hopefully you can speak to the right person at AT&T to fix this!","That confirms it is your ISP that is using an IP registered in Canada. As said before you cannot change this only they can.as a side note you could try setting a default location for Windows 10 using Settings > Location and select Default location. But I suspect it won't override the IP address."]},{"symptom":"changing email        I just need to change my email. Is there not a way to change my email for my microsoft account?Is there really no body at microsoft that knows how to do this? They need me to post this to some fictional community.I'd love to hear how to do this, but my email address has changed....so I'll probably never hear back.","solutions":["Hi, This is a tricky one as there's not one way to change all email address associations on your account. Due to them being used for different services on one account. If you want to change your sign-in email address you can do so by logging into account.microsoft.com > more actions > edit profile > manage how you sign in to Microsoft. For more information on changing your email address please visit: https:\/\/support.microsoft.com\/help\/12407\/micros...I hope that helps","The email I had used doesn't exist anymore.  That link didn't help.Thanks","If you don't have access to the old email. You will have to contact account support directly then, we can't help with this on the community forum.","Hi, Rick,Click on Manage your security info button.https:\/\/support.microsoft.com\/en-us\/help\/12428\/microsoft-account-security-info-verification-codesType passwordClick Your Info tab to change email address.I'd advice checking all tabs to ensure all info is up to date."]},{"symptom":"Broadcast option has disappeared from Gamebar        I used to be able to broadcast on mixer using a broadcast button on the game bar capture window.  For a few weeks now that option has disappeared - I think coincidently with a windows update.Has the ability to stream via Mixer been removed from windows 10 game bar?","solutions":["Hi, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Yes, it has been removed. Why can’t I broadcast my game? Mixer broadcasting is no longer available on Xbox Game Bar as of October 2019. https:\/\/support.xbox.com\/en-IN\/xbox-on-windows\/...Hope that helps. Edit: Article with more information here: https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/games_windows_10\/subject\/c718123a-13af-4546-b6e4-d2a89d4253fc?tm=1577883477478"]},{"symptom":"%userprofile% is wrong        After changing my username from Jerol to Jerold (using netplwiz) on Windows 10, and frebooting, %username% is Jerold BUT other environment variables, like userprofile, still use Jerol. How do I fix this?","solutions":["Hi Jerold This is because one variable refers to your user profile and the other refers to the name on your user account . . .When you change your user name in Windows 10, that does not change the name on your user profile folder unlike previous versions of WIndows . . .Microsoft do not advise changing the name on that folder, it can cause difficulties with file paths in Windows, however, if you do want to change the name on that folder, then trusted MVP Shawn Brink has a step by step method on this page:https:\/\/www.tenforums.com\/tutorials\/89060-chang...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]},{"symptom":"I cant seem to install my vpn        ps help me because every time i want to run the program the web installer fals and it stops and my downloaded vpn cant be installed..pls help","solutions":["In general, when you have errors with a non-Microsoft program, you should ask the program's publisher for help.Perhaps if you supply the following information, someone here may be able to help.What is the name of the VPN you're trying to install?What is the complete name of the file you downloaded?What edition of Windows do you have and is it 32-bit or 64-bit?What is the complete text of the error message?","Thanks for your reply i use windows 7 64 bits.. The name of the two vpn is cyber ghost abd turnel bears..Cgsetup_en_  thts for cyberTunnelBear-Installer.Thanks."]},{"symptom":"Windows 10 Display issues        I have two quite annoying issues. I have a 4K SmartTv as a secondary monitor shared between 2 PCs. One has Intel UHD graphics 620 adapter another some Radeon card. 1. Even though the device manager shows the same generic PnP Monitor, for the Radeon card I was able to set up my monitor to 4K resolution and 60Hz refresh rate. For the Intel one all I can get is 30Hz. How can I change it to 60Hz? 2. Whenever I switch the video source on my monitor to the different HDMI input, all my screen setting i.e. windows size and location are changed and are moving to the laptop display. Is there any way to prevent this from happening? By the way, it happens not when I'm switching to the alternative input, but when I'm trying to switch it back.Of course, I did try to google those issues first but didn't find anything that helps. Thanks in advance and Happy New Year!My best, BR","solutions":["Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.1. You will want to check out the specifications for your Intel UHD Graphics 620. If you are using HDMI 1.4 connection (check your TV HDMI port and laptop's HDMI port specifications), the maximum you will get is 4096x2304@24Hz.https:\/\/www.intel.sg\/content\/www\/xa\/en\/support\/...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. 2. When you switch HDMI ports, your display gets detach on a physical level from the laptop. When you switch it back, it gets detected by Windows again. (You probably have heard Windows detected device audio alert?) Hence all the screen settings changes and application windows moves to the built-in display. Unfortunately, there isn't any hacks or workaround for your case.Please let me know if I can help you further!","1. The same HDMI does support 4k 60Hz for my other pc, so HDMI is fine and compatible. Intel site indeed says what you've mentioned, but yet again my refresh rate is higher than that i.e. 30 vs. 242. I understand but it doesn't apply to all windows. Some, like the device manager window stays where it was and doesn't move. Some, like Chrome browser - do move. That leads me to believe that there is something there related to windows settings.","1. Formats supported by HDMI 1.4 include: 3840 x 2160 pixels at 24Hz, 25Hz and 30Hz; and 4096 x 2160 pixels at 24Hz.Ref: https:\/\/www.techradar.com\/news\/television\/hdtv\/...You can check what is the resolution when 30Hz is working for you? And what is your laptop model?2. Which is your primary display when you extend them? Your extenal display or built-in display?Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","1. My SmartTV\/Monitor reports 4k\/30 Hz from one PC and 4k\/60Hz from another. I didn't find what version of HDMI my TV supports( it is WD43UB4530: its spec does not specify HDMI version, Westinghouse online support asks too many irrelevant questions instead of providing the answer on my direct question). The laptop is Yoga-730-15\" with Intel 620 video card as I was reporting in my first post.2. I tried both ways with the same result. Obviously, the better option is to have built-in display as the primary one.  ","1. You are limited by the laptop in terms of Hz.Max resolution: 3840x2160@30Hz (USB Type-C); 3840x2160@30Hz (HDMI)Ref: https:\/\/psref.lenovo.com\/syspool\/Sys\/PDF\/Yoga\/Y...TV Specifications (HDMI Support 3840 x 2160 60Hz) : https:\/\/westinghouseelectronics.com\/wp-content\/... (page 25)2. I'll try to run more tests.Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","2. I'll try to run more tests. Thanks. ","Sorry, I cannot replicate what you get for the #2. I think it would be equipment specific. My observation is Windows will always move opened windows back to the primary display during connect\/disconnect of external displays. I'll leave this for others who might be able to help you.","Thank you for your effort. I know for at least my equipment, Windows does ignore the disconnect but does it shuffling on connect."]},{"symptom":"Windows 10 Cannot Detect Logitec webcam pro C920 Despite Driver uninstall and reinstallation        Hi,I have tried everything prescribed so far on the Microsoft community to get my Windows 10 to recognize my Logitec webcam pro C920.So far, I have done the following:1.  Enabled my camera in Privacy settings;2.  Uninstall and reinstall drivers under Device Manager for my webcam;3.  Switch USB ports on my PC (64 bit); and4.  Gone int Logitech to download directly the drivers for the C920.The Logitec Webcam Software can detect my face and work, but not in the LogitecCapture App.  So, can any kind soul offer me a workable solution.  I refused to buy any of the software repair software because I have sourced the drivers from Windows and Logitech directly and they still don't work.  There is no guarantee that these 3rd party solution providers are of any help.Will appreciate receiving a solution since this same issue was raised in this community many months ago. Bob","solutions":["Do you still require help?","If you don’t have any further questions please feel free to mark one of the replies as the answer &\/or rate my help: 1 star means you are very unsatisfied with my help and 5 stars means you are very satisfied with the help I gave you."]},{"symptom":"Registering the VB6.0 executable(.exe) using Regsvr32        Registering the my application executable(.exe)  using command <FilePath> \/RegServer but its failing to register in windows 10 but able to register .exe file with Regsvr32 .is this correct way to do ?is there any impact to register .exe using Regsvr32 ?","solutions":["Hi SateeshP No there is no impact to registering your executable with Regsrv32, in fact that is the preferred method, to register your executable . . .","Hi SateeshP No there is no impact to registering your executable with Regsrv32, in fact that is the preferred method, to register your executable . . .Generally Regsrv32 is used to register DLL amd .OCX I am confusing on that  and surprise about why Executable not registered using \/RegServer. "]},{"symptom":"Windows 10 login problem        I have Windows 10 computer with 3 Microsoft Online accounts logged in. 2 of them are admin accounts and one is non admin. Last succesful logon was by non admin account. After last power on I have problem logging in as it states \"The User Profile Service service failes the sign-in\". I can't try login with any other account as for some reasone I cannot see list of other accounts in the bottom left corner. Also, I tried reenabling built-in admin but it made no change. Additionally, I tried enabling Ctrl-Alt-Del but also with no success. At the moment I cannot access my computer. What else can I do?","solutions":["Hi, BranimirKušanić Try to enter the safe mode with the network function to repair, it may be that the network controller is outdated.Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. As soon as you see the Windows logo with the rotating dots, press and hold the power button until the computer turns off. Do this process twice..-Turn on your computer for the third time, and let it load. .-You should receive this message: Preparing Automatic Repair. After entering Mode Update the network driver may be outdated","Thank you. However I cannot log in as safe mode with or without networking is also offering just non admin account for login while safe mode requires admin :(","I recommend you look for another computer to create a USB and repair Windowshttps:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"archiving e-mails in Windows 10        Hi, hope somebody can help. I have recently started using a ‘new’ Windows 10 laptop that I actually bought about 3 years ago – been in its box since then. I have had e-mail set up but am unable to organise mails into separate projectsas was possible with Windows 7. I have seen more recent versions which include an ‘archive’ button but this does not appear here. This was the subject of a mail I read on-line and there did not seem to be a solution to it. I also need to know how to move archived e-mails to a remote drive.  I don’t really want to have to start using Outlook or the Cloud if I can help it. Thanks in anticipation. Regards, Wayne Parr.","solutions":["Hi Wayne Parr,Thank you for writing to Microsoft Community Forums. I appreciate your interest in Windows 10. I understand that you want to Archive emails on your Windows 10 computer. I’ll help you with the steps. Windows 10 comes with its own email client called Windows Mail, which helps you access all your emails on the go. To archive your emails, open the Windows Mail app, right click on the email and select Archive. To check the emails that you have archived, on the left pane, click on More and select Archive, you will be able to see the emails. Refer the screenshot below:   If you do not find the option, please reply with the details requested below: What is the version of Mail app? To check open Mail app, click on Gear icon and select About.What is the build version of Windows that you are using currently? To check type:winver in the search bar on the Taskbar and hitEnter. We await your response. Regards,Nikhar KhareMicrosoft Community - Moderator","Hello Nikhar Thank you for taking the time to reply.  Unfortunately on my version there is no 'archive' option under 'All Folders' and this has been the issue from the start. As requested, the Mail Version is 16005.12228.20356.0 and the Windows Version is 1909 (OS build 18363.535). I did try looking for a Mail update but saw that Microsoft no longer support this product.  I can't make screen shots but under All Folders I only have - outbox, inbox, deleted, drafts, sent.Surely Microsoft didn't publish a mail software where mails could not be filed and archived. Kind regards, Wayne.","You have the latest mail app. If you select Folders and a pop-out appears showing All folders does it appear there.You need to remember that the Mail app is just reading what is on the Microsoft mail server so you should be able to Archive if the folder is available at www.outlook.com (if you use a Microsoft account) but you won't be able to more mail to an external drive.What is available using a web browser for your account."]},{"symptom":"Microsoft Word 365 Files All Changed to Notepad        Hi All,I am desperate to fix this problem.  I was opening Word documents.  One wouldn't open, so I clicked \"Open With\"....Notepad, just for that one file.  THEY ALL CHANGED to Notepad files.  How do I get all my Word documents back to Word files?  I've tried opening the files with Word and doing a Save As....does not work.  This is crazy!Anyone have the answer.  I am running on a Dell desktop, Windows 10, Office 365.Thanks for any help!!!PeggieMc","solutions":["Hello PeggieMc, I'm Didi, an independent advisor. In Explorer right-click on one of your Word documents, click on \"Open with\" > \"Choose another app\", check \"Always use this app to open...\" and select Word from the list.If you can't find Word right away click on \"More apps\" or \"Look for an app in the Microsoft Store\" and select Word.Regards, Didi"]},{"symptom":"Wallpaper not showing in tablet mode        Hello guy's I am able to see my background wallpaper in normal windows mode, but when i am switched in the tablet mode the background wallpaper not showing only showing blank colour in the background please help me to solve this issue, please check below screen short to understand the problem .Thank you","solutions":["Hi Manish Microsoft did change the transparency of the Start Menu in version 1903 of Windows 10, which may affect your ability to see your Desktop wallpaper through the Start Menu while in Table ModeOpen the Setting App (gear icon on your Start Menu) Go to Personalization - Colors Check there to see if Transparency is turned on If that is turned on, then sorry, that is how Microsoft have set things up in version 1903 upwards . . ."]},{"symptom":"Where is MDM Device ID is stored        I want to know where MDM Device ID is stored on my PC running Windows 10.ThanksMarius","solutions":["Hi Marius, my name is Andrew and I'm an Independent advisor here to help you.Please, look through the following articles: MDM enrollment of Windows-based devices https:\/\/docs.microsoft.com\/en-us\/windows\/client...Diagnose MDM failures in Windows 10 https:\/\/docs.microsoft.com\/en-us\/windows\/client...If the methods above don’t help, post your query in TechNet forums, where the experts can provide you with further assistancehttps:\/\/social.technet.microsoft.com\/forums\/en-...Thanks, Andrew N."]},{"symptom":"Win7 to Win10 update fails with black screen        I'm trying to update a win7 machine to win10. At a certain point the screen became black and nothing happen.The problem occurs when install is at \"Cortana choice page\", for a short time I can see a \"Disconnecting\" message and then the screen became black, still on but black (The rear illumination is on, keyboard backlight on, hdd light flashing).I've tried to wait (half a day) but nothing. The only option is to force restart, at boot I have 7b error and after third error I can rollback to win7 (with success).Tried both with iso image and update tool, with oem install and with separate win10 product key. Tried all the recover option in the rescue menu.Win7 is full updated, driver at latest version.How can I do? There's an installation log to see what happen?Thanks ","solutions":["@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@","As in https:\/\/www.asus.com\/support\/FAQ\/1035904\/NotebookBU201LAYthe notebook is supported. In the support pages win10 drivers are available.Thanks","Hi, Fraschizzato My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.If you have a third-party antivirus, you must disable or uninstall it. Try reset Windows update components: Right click on the start button and select Powershell (admin) or Command Prompt (admin)Write the next hit enter after each line. net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Restart and try again. You can also download the Windows Error Solver: https:\/\/support.microsoft.com\/en-us\/help\/10164\/...https:\/\/aka.ms\/wudiag You can do it manually by downloading the Windows ISO. When updating with the ISO, disconnect the Internet. https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/answers.microsoft.com\/en-us\/windows\/for...","Antivirus already uninstalled, tried but without success, same problem.The update procedure does not complete, I get:Login screen --> it autologins --> cortana settings prompt--> rapid \"disconnecting\" message --> black screenThanks","Try updating manually by downloading the Windows 10 ISO","Exactly same problem with iso on usb drive.At this point i've made a startup repair and i can reach the previous page. So: install stops after cortana settings prompt,i can see a disconnecting\/logout message for a while and then i get the black screen. Forcing shutdown i get a 7b error on reboot, startup repair solves the issues, windows starts, user logs, cortana settings appears and then disconnects and black screen. On a second try i've made a startup repair and then rebooted in safe mode with network, windows starts correctly in safe mode, but i didn't know what to check to repair loginSo, after about 5 seconds from login (automatic), the pc tries to logout\/disconnect and the black screen appearsThanks","Try to make a new installation from version 1909","Same problem, can start only in safe mode without issues. I've seen on event manager that there are some errors: \"software protection\" in \"system\"and \"slui.exe\" in \"application\"","I recommend that you repair Windows completely before you must make a backup of your personal files, third-party software will be removed. Here the link to download the Windows ISO.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]}]}