{"windows":[{"symptom":"Downloading Itunes trouble        Hello,      Sadly I am pretty illiterate when it comes to computers, software, updates, etc.  I purchased a 2nd hand Lenovo ThinkPad W530.  Hoping it will last me a long time.  I do not game or use it other than for school.  I am trying to download iTunes to reset my sons iPhone that is locked up.  I go to the Microsoft store, and select to download it.  My computer says, \"starting download...\"  and in the download queue.  nothing is happening.  I have tried this several times, restarted my computer, cannot get the download to engage. Please help.Emicabra","solutions":["Hi Emi. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Install the iTunes program which is more stable that the store app. Here's how: https:\/\/www.imore.com\/how-install-itunes-12-win...If problems follow these steps: https:\/\/support.apple.com\/lv-lv\/HT201668http:\/\/www.groovypost.com\/howto\/tips-install-it...https:\/\/support.apple.com\/en-us\/HT201413https:\/\/discussions.apple.com\/docs\/DOC-6562I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Once that's done then here's the steps for restoring an iDevice using Itunes on PC:https:\/\/support.apple.com\/guide\/itunes\/restore-...Keep me posted on your progress as I will be here to help until the case is resolved.","Hi Emicaibr,As it is a 2nd hand computer, it is more likely you can remove components left from a previous installation of iTunes and then reinstall to fix the problems.  If not work,  you should uninstall QuickTime, AppleSoftware Update, Apple Mobile Device Support, Bonjour, and Apple Application Support from the control panel.After that, you close and reopen your computer. Go to My Document ----> My Music, there you delete the folder of iTunes.Regards","I also received this advice.  Please tell me what you think.  This person did not say whether or not they were experienced or certified or anything. As it is a 2nd hand computer, it is more likely you can remove components left from a previous installation of iTunes and then reinstall to fix the problems.  If not work,  you should uninstall QuickTime, AppleSoftware Update, Apple Mobile Device Support, Bonjour, and Apple Application Support from the control panel.After that, you close and reopen your computer. Go to My Document ----> My Music, there you delete the folder of iTunes."]},{"symptom":"How do I see if my current PC will support Windows 10        I currently have Windows 7.   How can I see if my current PC will support Windows 10?  Is there a diagnostics I can run?","solutions":["Hi, Do you have the \"Get Windows 10\" option available in the system tray? The hamburger menu in that app had a \"Check your PC\" option. The same checks should run when upgrading with the Media Creation Tool from the Windows 10 download page.There isn't a big jump between Windows 7 and Windows 10's minimum specs. Windows 10 is currently:CPU: 1 gigahertz (GHz) or faster processor or SoC RAM: 1 gigabyte (GB) for 32-bit or 2 GB for 64-bit Hard disk space: 16 GB for 32-bit OS or 20 GB for 64-bit OS GPU: DirectX 9 or later Display Resolution: 800 x 600"]},{"symptom":"What is the entry \"FrightfulFlyBDAuthority\" in my Windows 10 Task Manager?        What is the entry \"FrightfulFlyBDAuthority\" in my Windows 10 Task Manager?","solutions":["Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.See if you have a virus or spyware. For spyware you can scan with these two free and powerful software. AdwCleaner : https:\/\/www.malwarebytes.com\/adwcleaner\/Malwarebytes : https:\/\/malwarebytes.com\/_________________________________________________ Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Virus Scan Failed ERROR!        Hi And I have this issue where it says \"virus scan failed\" every time I DOWNLOAD something I even tried using edge and even ie and it still doesn't work.And the regedit trick doesn't work And I uninstalled my antivirus Please help!Browser I am using: Google ChormeOS: Windows 10 (64 bit)","solutions":["Hi Retroguy. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) First see the posts by Neilpzzz and MVP LeBoule here: https:\/\/answers.microsoft.com\/en-us\/windows\/for...2) Download, install and run a full scan with the most powerful on-demand free scanner Malwarebytes:https:\/\/www.malwarebytes.com\/mwb-download\/.In the Scan Settings first set it to include scanning for Rootkits. If necessary run it in Safe Mode with Networking, or Safe Mode accessed by one of these methods:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... Clean up anything found, restart PC and then run again until it comes up clean. Check for any remainders in Settings > Apps > Apps & Features, and also in each of your browser's Extensions, Home Page settings, Search service or Add-On's as shown here:https:\/\/community.box.com\/t5\/How-to-Guides-for-... Then check for damaged System Files: https:\/\/www.lifewire.com\/how-to-use-sfc-scannow... If it cannot repair them see Step 10 here to continue: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If that doesn't fix it then try resetting Chrome: https:\/\/www.lifewire.com\/how-to-reset-google-ch...If that fails uninstall Chrome, restart PC, and reinstall from a fresh download: https:\/\/www.google.com\/chrome\/If you want to keep Malwarebytes as an on-demand scanner then you can turn off its Real Time trial version in it's Settings > Account Details tab.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","How did you uninstall the antivirus?  Did you go to the maker and get their removal software?","How did you uninstall the antivirus?  Did you go to the maker and get their removal software?No I just used control panel  ","Hi Retroguy. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) First see the posts by Neilpzzz and MVP LeBoule here: https:\/\/answers.microsoft.com\/en-us\/windows\/for...2) Download, install and run a full scan with the most powerful on-demand free scanner Malwarebytes:https:\/\/www.malwarebytes.com\/mwb-download\/.In the Scan Settings first set it to include scanning for Rootkits. If necessary run it in Safe Mode with Networking, or Safe Mode accessed by one of these methods:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... Clean up anything found, restart PC and then run again until it comes up clean. Check for any remainders in Settings > Apps > Apps & Features, and also in each of your browser's Extensions, Home Page settings, Search service or Add-On's as shown here:https:\/\/community.box.com\/t5\/How-to-Guides-for-... Then check for damaged System Files: https:\/\/www.lifewire.com\/how-to-use-sfc-scannow... If it cannot repair them see Step 10 here to continue: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If that doesn't fix it then try resetting Chrome: https:\/\/www.lifewire.com\/how-to-reset-google-ch...If that fails uninstall Chrome, restart PC, and reinstall from a fresh download: https:\/\/www.google.com\/chrome\/If you want to keep Malwarebytes as an on-demand scanner then you can turn off its Real Time trial version in it's Settings > Account Details tab.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.I can't download ANYTHING not even a jpeg file and I need this to be fixed I need to download a pdf of my high school homework that I need to finish can you help?btw thanks tho","Are you online at the network icon in System Tray at right end of task bar? Right click it to Troubleshoot.Try all other browsers. Try resetting the browsers: https:\/\/www.howtogeek.com\/171924\/how-to-reset-y...Report back results","Using the Control panel does not remove all the code and the cod that remains is what causes the problems."]},{"symptom":"best antivirus for internet banking        hi can anyone tell me the best antivirus and security for banking and shopping online its not for me but daughter just got a new laptop with bascic  security on but she tried to download fsecure her normal security but tells her to switch out of s mode on windows 10 s baffling us.","solutions":["Hi dwindle Windows 10 now contains a full security Suite, which includes Defender and many other components, it is on a par with all the paid for Security solutions and rated highly, there is no need for any other security softwareWith regards to installing F-Secure, it sounds like Windows 10 is in S Mode, that means only Apps form the Microsoft Store can be installed on that laptopThis is very limiting and you can switch Windows 10 out of S Mode to the normal Windows 10 Home version, it is free to do so and it is a one-way operation. Then you can install any software you need to on that laptop . . .Open the Settings App Go to Update and Security - Activation In the Switch to Windows 10 Home or Switch to Windows 10 Pro section, select Go to the Store. (If you also see an \"Upgrade your edition of Windows\" section, be careful not to click the \"Go to the Store\" link that appears there.)On the Switch out of S mode (or similar) page that appears in the Microsoft Store, select the Get button.After you see a confirmation message on the page, you'll be able to install apps from outside of the Microsoft Store.","FWIW:Microsoft created Windows 10 S mode for a reason: Security....> Windows 10 in S mode FAQ - Windows Help If you want to switch out of it: Since some weeks many users are not able to switch out of S mode. Seems that there are some problems on the Microsoft's servers side..Users are advised to try again in a few days or even weeks....","PS: In case that you do decide to switch out of S mode...Suggest reading Answers to common security questions - Best Practicesespecially Choosing an Anti-Virus ProgramSupplementing your Anti-Virus Program with Anti-Malware Tools","Microsoft OS comes with Windows Defender installed, and it's free and all its features. It provides full protection for free. Other antivirus softwares requires buying them or upgrading to premium to use full features. Microsoft Windows Defender provides all the features, for free.","Thank you very helpful","hank you very helpful","You're welcome."]},{"symptom":"Windows IO mail :-        Outbox not sendind my emails. Says sendin, the switches to \"working on it\" but never gets any further","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? Which account is affected? Are the settings correct?","Hi Virginia,I am up to date with version 1909. My Windows mail is now absolutely stuck. It is not receiving mail  as well as not sending. I am using webmail to send you this.Rodney","Which account is affected? Are you connected to the internet? Are you running any third party antivirus which may be affecting sending\/receiving of emails?","Do you still require help?","If you don’t have any further questions please feel free to mark one of the replies as the answer &\/or rate my help: 1 star means you are very unsatisfied with my help and 5 stars means you are very satisfied with the help I gave you.","I’m sorry to see that you marked my reply as not helpful without bothering to actually answer my questions.Good to hear you found the solution. corrected via community. "]},{"symptom":"Windows 10 email access on IPhone        Recently I began using Windows 10 on my new home PC.  Currently I import emails from my Comcast account into Gmail.  I then can access emails on my home PC browser (Chrome) or through the Gmail app on my iPhone 7.  Emails are also visible through the W10 Mail app.  If I wanted to discontinue Gmail, how would I import emails from Comcast into W10 mail?  How would I also see them on my iPhone?Currently I prefer not to access Comcast email through xfinity.com or use their iPhone app.thank you","solutions":["Hi Big Thanks for participating in Microsoft Community, I'm Skypper G. I'm Independent advisor, let me help you with thisSo, in this case you want to import emails from comcast account to Outlook account like Hotmail\/outlook.com?Then you can use this on Windows 10 mail app. Or Do you want to use your Comcast account in Windows 10 mail app? If it is the 2nd option you will need to add your comcast account into Windows 10 mail app, see the process here:https:\/\/www.xfinity.com\/support\/articles\/comcas...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hello. The Windows 10 email client is just software that gathers your email addresses in one place. You just add the email accounts. The iPhone also has a similar mail app. Just add your gmail and Comcast accounts per the link below:https:\/\/support.apple.com\/en-us\/HT201320"]},{"symptom":"Lost Office license after upgrading to SSD        I lost my Microsoft office license after upgrading my pc from HDD to SSD. The pc came with free Office.","solutions":["Hi Abhinav Please explain what you mean by the PC came with free Microsoft Office . . . In generally PC's do not come with Microsoft Office and Windows does not come with Microsoft Office, it is a separate software product and is not free . ..Most PC's come with a free trial of Office 365 that will run out in approx. one month, some PC Manufacturers do provide a one year subscription to Office 365What version of Microsoft Office was installed on your PC and was that ever registered on Office.com to your account?Go to http:\/\/www.office.com and if you're not already signed in, select Sign inOn that page, do you see your Microsoft Office licence listed there?"]},{"symptom":"Win 10 Pro issue        When I attempt to shutdown the PC by choosing 'shutdown' from the start menu it will appear to shutdown but then start again. I've tried many of the so called fixes and none correct the issue. Got frustrated and wiped my drives clean (all 4 of them) and guess what?The issue still persists even after a complete clean install of the OS.This wasn't an issue ever until I attempted to shutdown yesterday to install a new SSD. I installed a new PCI-e USB 3.0 card roughly a week ago and the desktop shutdown perfectly just before installing the card in an x1 slot. The PCI-e USB card I purchased is the following:https:\/\/www.amazon.com\/gp\/product\/B072LS4JH7\/ref=ppx_yo_dt_b_asin_title_o01_s00?ie=UTF8&psc=1Motherboard is a Gigabyte GA-Z68XP-UD3 rev 1.0 with the latest BIOS F-10(Rest of system)...Windows 10 Pro 1909 OS Build 18363.476 (clean install)Core i7 3770KG-Skill 32GB DDR3Asus RX 570 OCSound Blaster XFi Xtreme Gamer1TB Crucial MX500 SSD (OS drive)1TB Mushkin RAW SSD1TB Hitachi SATA 3 7200rpm1TB WD Black SATA3 7200rpmLG Blue Ray DLAntec 650w PSURosewill Mid tower Challenger","solutions":["Hi 72. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Have you tried removing the PCIe card to see if the problem goes away. If so examine the slot under a bright light to blow out any dust, reset card firmly and evenly. If the problem comes back RMA the card after discussing it with their included Support.If the card is absolved then try removing the SSD to test without it. If you don't have another hard drive you can create bootable Linux which is a great way to test hardware and absolve WIndows and the SSD\/hard drive:https:\/\/www.pcsuggest.com\/best-linux-live-distro\/https:\/\/itsfoss.com\/bootable-windows-usb-linux\/See also known fixes for restart at shutdown in Windows 10: https:\/\/blog.techinline.com\/2018\/09\/18\/windows-...https:\/\/www.thewindowsclub.com\/windows-10-resta...http:\/\/www.thewindowsclub.com\/windows-will-not-...Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I just finished wiping all the drives clean and re-partitioning them.No luck. Issue still persists. It existed before I attempted to shutdown and put in the new SSD. I ended up having to hold the power button down. However it was not an issue when I put the PCI-e USB 3.0 card in roughly a week ago. The desktop powered off without issue then. As for the BIOS (F10) it is the latest for my motherboard (GA-Z68XP-UD3 rev 1.0). I've tried all your other suggestions and no luck.The system is clean with no programs on it other than Windows 10 Pro 1909 OS Build 18363.476 (installed 12\/6\/2019)","Update:I removed the USB PCI-e 3.0 card and the issue vanished. I can now shutdown the system without issue.","I'm glad to hear that worked, Westy. You can try reseating the card to see if it comes back, or RMA it to the manufacturer.Let me know if there's anything else. Also when ready please mark the post which helped most as the Answer, to help others. A rating is also appreciated.","I emailed FebSmart and this was their response....Hello Jim Floyd,Sorry to hear that this usb card cased this restart issues.I just back from you mother baod data sheet,all the PCIE slot is a universal slot.Not yest defined by manufacture,and USB card hardware is working.But the restart issue alway make you unhappy then. I suggest you try to put it in other PCIE slot and check if it have same issue.At the same time , I suggest you reset PCIE slot to default setting.We can confirm that it is Windows10 system setting issue or BIOS setting issue. If you can try to restore windows it may helps also ,but this is the last option.  Kindly Try please. Louis.Z--------------------------Hello, Thanks for your message and updates.Actually you are the second users with this issue,after we test the same mother-board in our side in last case,all is normal in our side .So we think it is not a must problem,it have possibility.I am not sure if you want try to a USB card with a brige inside ,it may do not have this problems.The price is a little high Or I suggest you take a cheap USB card based on VL805 solution, seems like it can not works on your PC if using directly with RENSAS.Here is our suggestion:https:\/\/www.amazon.com\/dp\/B07NTZ84LD?ref=myi_title_dpIf you select our product,we can refund price gap for you.If you choose other sellers ,you may have to return this USB card ,or put it in other computers.https:\/\/www.amazon.com\/dp\/B07SRT4PLL\/ref=twister_B081FZ1567?_encoding=UTF8&psc=1 Again,we sorry about we can not guide you solve your problems.Kindly Regards.Louis.Z-----------------------","And also this....And we got the feedback from other customer, same board on same system do not have the issues,but I remember it is a Gigabyte board as well ,not this model on you. System issue, We do not think users have to get latest system,cause USB 3.0 standard come out almost ten years ago. Can you put this card on PC, in windows device manager select this RENSAS card -let windows update driver ? This is the last option now. We may can not handle your problem. Sorry.","I'm glad to hear that worked, Westy. You can try reseating the card to see if it comes back, or RMA it to the manufacturer.Let me know if there's anything else. Also when ready please mark the post which helped most as the Answer, to help others. A rating is also appreciated.Funny thing is the card in device manager showed as working no problems. The only issue was not allowing Windows to shutdown.","Did you try another slot, to Update driver from Device manager, and their other solutions to be sure?If it still doesn't work I'd ask for a manager to get a refund.","No I did not the next available slot is too close to the side of the GPU with the fans. As for drivers the card does not require any off a disk just the Win 10 drivers.","I understand. I was referring to their request that you update the driver from the device manager. Did you try that? First try Automatic choice, then try Browse and Let me pick to try all previous drivers that were installed for that card."]},{"symptom":"Shortcut key to change desktop background        There are a few threads about changing the desktop background. All of these claim there is no shortcut key. All the threads are locked, or I would add this query to an existing thread.Despite the claims to the contrary, I  have many times accidentally changed the desktop background when clicking on an image file (jpg, for example).  I don't know which keys I unintentionally hit. I would like to disable this feature, since accidentally changing the background is annoying.On a related note, I'd like to know where the background image is stored. That is, if I select an image to use for background, presumably Windows tucks away a copy of the file. Where is that copy?","solutions":["Hi, I'm not sure if this is the hotkey you are referring to but you can press Shift + F10 to skip to the next desktop background.As for the folder the current desktop background is stored in, it's a bit more complicated. %AppData%\\Microsoft\\Windows\\Themes\\CachedFiles contains a cached copy of the current background. But the file in use is in the parent directory %AppData%\\Microsoft\\Windows\\Themes, however this isn't a plain file it will just show as type \"File\" and needs decoding from binary to be opened."]},{"symptom":"Activation Error Code 0xC004F213 after upgrading windows through app store.        I paid for an upgrade to Windows 10 Pro through the app store and less than 24 hours later I'm being prompted to activate windows.There was no product key on the invoice emailed through and from what I've read it should have activated with a digital license. Interestingly, when I windows shows the edition as 'Windows 10 Enterprise', even though I only requested and paid for pro. The update was automatic through the app store so there is nothing that I could have done to influence the incorrect version being installed.Thanks in advance for any guidance.","solutions":["Hi Peter, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.This is a common problem while updating through Store. Please see the following steps to get activated:[Fix] Purchasing Windows 10 Pro from Microsoft Store results in Windows 10 Enterprisehttps:\/\/www.yourwindowsguide.com\/2019\/07\/fix-pu...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads.","Thanks Sumit, I'll follow the advice in the blog. ","Looking forward to the results, Peter.","I searched long and hard for a solution to this problem.  It has been haunting me for weeks.This solution worked!  Thank you so much!"]},{"symptom":"No log in screen and keyboard\/mouse not working        I have windows10. Problems started with no internet. Now there is no log in option on the screen, just shows the time. Wireless Keyboard and mouse stopped working too. From googling possible fixes ive done the following:-Unplugged the wireless adapter, changed batteries on keyboard, turned off pc and unplugged for 10 minstried turning pc on and off 3 times to get auto repair option up but nothingthink i’m at the limits of my capabilities here unless someone can help. ","solutions":["Hi, MakkiMM My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to enter the safe mode with the network function to repair, it may be that the network controller is outdated.Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. As soon as you see the Windows logo with the rotating dots, press and hold the power button until the computer turns off. Do this process twice..-Turn on your computer for the third time, and let it load. .-You should receive this message: Preparing Automatic Repair. After entering Mode Update the network driver may be outdated","Hi jeffrey,thanks, i have tried that and Dell Support Assist runs a system scan to detect any potential hardware problems. None are detected. I can’t cancel this as the keyboard and mouse don’t work. Can’t get it to show the automatic repair, keeps running the Dell Support Assist.","Try resetting the BIOS to its default values ​​and check that the BIOS is reading the Hard Disk","Thank you again for your advice jeffrey but i don’t know how to reset the BIOS without a working keyboard or mouse. ","Hi MakkiMM, I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.I like to establish the model of your computer first, can you provide that? I'm afriad there is nothing much you can do here if the keyboard and mouse aren't responding so you would also want to consider making a trip to the nearest service centre for your Dell computer.Let me know if I can help you further!","Thanks so much for your advice. Think i’ll be contacting Dell tomorrow after new year’s day.the pc is an inspiron 3668.","Oh, it's a desktop. If you can get your hands on a set of wired keyboard and mouse, they should work.","Thanks comnuts, will give it a go once a get my hands on the equipment. ","Thankfully with a wired keyboard and mouse my pc is working again. I wonder whether there was an update which affected it.  Thanks for your help and I’m glad it was a simple fix.","Glad it is fixed for you and you're welcome!"]},{"symptom":"Ink issues        The ink on my printouts is streaking  even though the printer has been calibrated. Help?","solutions":["Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.Your cartridges may be used up, the ink will dry. You can clean the cartridges where the ink flows with a cotton wool and rubbing alchool.Or it’s possible it’s running out of ink"]},{"symptom":"Windows 10 - RTX 2080 Ti - C49RG9x - NO SOUND via Displayport        HiI am currently running Windows 10 Education Build 18362.19h1_release.190318-1202. All drivers are properly installed and up-to-date.The problem is persisting for over 2 years now.Initially, I was running Windows 10 Pro with a GTX 1080 Ti on a Samsung CHG90 Display via Displayport, which means:Different Computer with ALL different Hardware, different Software, different Monitor, different Cable, but still the same problem!My Rear Panel 3.5mm Jack plays fine on any headphones. Also, my S\/PDIF is working without any issues at all.Please DON'T suggest changing the Bitrate - there is only 1 option and the field is greyed out!I offer 1 Ethereum to the first person who can solve the mystery. (Microsoft Associates are not eligible for any reward.)And I encourage anyone else to curse Microsoft for their failures.","solutions":["Have you ever heard back (no pun intended) from anyone?  I have the same problem.","Have you ever heard back (no pun intended) from anyone?  I have the same problem.Dear Kreigz. Apparently not. But 11 people do have the same issue.","How are you planning on hearing\/routing the audio? The gaming monitors you are using have no built-in speakers, like a TV would. No Microsoft OS software update can fix that. Connecting the rear headphone jack to 3.5mm (analog) speakers or sound bar would be the method of obtaining audio out on those models. Headphone and mic out are the only audio-related outputs. ","How are you planning on hearing\/routing the audio? The gaming monitors you are using have no built-in speakers, like a TV would. No Microsoft OS software update can fix that. Connecting the rear headphone jack to 3.5mm (analog) speakers or sound bar would be the method of obtaining audio out on those models. Headphone and mic out are the only audio-related outputs. Dear TechfreakThat is indeed a very good question. First of all, HDMI and DP do both contain Auxiliary Channels. However, if you plug in headphones you either get horrible noise together with no windows sound on audio output or it gives no sound at all on mic. Nice try though. I didn't tell you guys the display had no speakers. ;D"]},{"symptom":"REplacing motherboard with refurbished motherboard        Hello and thank you in advance.  I have a laptop that works fine, other than it cuts off randomly for no reason.  A repair tech said it was a glitch in the motherboard.  That being said I want to replace the motherboard but I'm concerned about getting my Windows 10 to be recognized by the new motherboard.  Can anyone kindly tell me how I would get Windows 10 on the new motherboard without having to purchase another version which I think would be totally unfair.  Thanks again in advance for any help","solutions":["Hi Keith, to keep license you need to replace motherboard by warranty. Sorry that are the license terms. If this will be warranty replacement please remember technician to do steps necessary for license keeping."]},{"symptom":"Windows hello 'couldn't turn camera on'        Having successfully updated win 10 and with windows hello working happily, this morning 16\/9 it stopped working. I now get a message 'couldn't turn camera on.I have checked and all the drivers for intel realtek 3d camera are up to date. Can anyone help please?","solutions":["Hello,Try to navigate as mentioned below and check if you're able to setup the Windows Hello.* Click Start* Select Settings and navigate to Accounts \/> Sing-In options \/> Windows Hello* Check whether you're able to make changes to the setting and setup Windows Hello there.If not, Use the System File Checker tool and DISM to repair missing or corrupted system files:Click Start.Type cmd, and then press CTRL+SHIFT+ENTER to open elevated command prompt(I.e. Command prompt with admin rights).If the User Account Control dialog box appears, confirm that the action it displays is what you want, and then clickContinue.Type or copy paste the below command lines into itwithout quotes:Reboot the system and check if problem resolved.“Sfc \/scannow”\"dism \/online \/cleanup-image \/restorehealth\"Let us know if problem still persist, we're glad to assist you. Hope this will address your query.","Thank you for your prompt reply and suggestion.I have run the routine as described in your response, the scan reported no integrity problems and the dism routine ran successfully but to no avail I am afraid following the restart.The only 2 events that could have impacted this situation that I am aware of are:a) A Windows security fix was downloaded yesterday morning before this problem ocurredb) Outlook would not start, so I contacted the MS HUP technical people and through a remote desktop connection they manually uninstalled Office and I reinstalled it with the result that Outlook is now working correctlyFurther advice gratefully received.","That's interesting.  I too had exactly the same problem with both windows hello and outlook. My techy guy resolved outlook by setting up a new profile.  WHat a pain the a*** to spend 2 days trying to open outlook.  Windows hello still not working but the camera opens fine with other programs.  There are loads of people with the same problem with a vast array of machines, many of them new and the most important thing THEY WORKED FINE BEFORE THE UPDATE.Please microsoft, stop telling people to check all their drivers, solve the problem.  It is well documented that new updates on Win10 often stop other things from working.  You never have this with apple. It is just not good enough.  My laptop is 2 weeks old and worked fine until yesterday. One of the reasons I bought it was for the windows hello facial recognition (sad I know but I thought it was cool) so for it to not work after 2 weeks is rubbish. WHAT IS THE FIX PLEASE?","After a morning spent with PC World and HP Tech Support I believe the issue to be as follows:1. Prior to AU (1607) my m\/c was at 1511 (Windows build 10.0.10586)2. AU arrived on my box overnight on 11 Oct and the following day I saw- on my initial WIN 10 screen -  \"Getting Started\" followed 30 secs later with \"Cannot start Camera. Please sign in with PIN\"3. Drivers and BIOS Checked and updated where appropriate BUT . . . . 4. Realtek IR driver under \"Device Manager\" - \"Imaging Devices\" - \"Properties\" - \"Driver\" is at10.0.10586.11211, For a 1607 AU OS it should be most likely 10.0.14393.xxxxx - to reflect the 1607 product number!!So, until Realtek update their driver to the 1607 level, we shall just have to live with the camera being defunct - or roll back to 1511. As there are no Restore Points set with AU this means a Factory Reset  and loss of my environment (again!!) - NO THANK YOU!!Hope this helps, Regards, Chris","I had the same problem earlier. The problem showed up after I installed the software called Duet, which can set my iPad as second monitor. After I uninstall the software, everything was back to normal. You can check whether the problem is caused by some other software. Hope this could help you. ","I also had the same problem after the latest Windows update on 7 August 2017. I did what ThosfikhAhamad suggested and it didn't work.Then I looked into Microsoft forum and found that maybe it's from the imaging driver.Click Start.Type Device Manager and select it.Look for Imaging Devices.Under Imaging Devices, you'll find your webcam device (mine isIntegrated Webcam)Right Click on the webcam device (Integrated Webcam), and clickUpdate Driver.If you're connected to the internet select \"Search automatically for updated driver software\". After that it will update and install the update for you.I hope this would work if other options didn't work.","please help me i have the same problem, i use surface book, and its address is on this link.thank you .https:\/\/answers.microsoft.com\/en-us\/surface\/forum\/surfbook-surfmusic\/windows-hello-cant-setup\/85b8a238-5085-4532-8d31-7fe2a76ff8aa","Hi rolid,I have found something that might work.All you need to do is roll back the Windows Hello Driver, under System Drivers to a previous version.Had the same problem with my Surface Pro 4. It was working alright and then stoped working just like you described (one day it just stopped working), and now I have figured it out.Just roll back that driver to a previous version, and it should be back up and running.Should work for anyone with a Microsoft Surface product with this problem,other windows 10 computer, not so sure but try it, maybe it might work.Have asked Microsoft to fix this several times, but no reply but this is a short term fix that could get it working.Hope this helps.","Sfc\/scannow was completed but dism etc etc returned Error 87 the command option is unknown.","I did remove the drivers for camera. I also tried rolling them back but neither worked.My surface pro 4 system at home updated the camera drivers and the Surface Embedded Controller Firmware, rebooted and my camera has not had any issues. However, I run Windows 10 OS Professional 1703 15063.674 at home where as at work - this is windows 10 OS Enterprise 1703 15063.674 if that makes any difference."]},{"symptom":"Safe Mode        Tell me please how is it possible that safe mode wont take my normal password for notebook and it wont take my microsoft account password at all.... Dont wanna be rude or somethin, but this is really terrible. Safe mode is the worst nightmare, that probably destroyed my exam period. I cant access anything from my pc right now, what is even worse is that my notebooks screen is not working aswell.... Just please microsoft fix your real problems, u probably destroyed my success, dont destroy other ones aswell....","solutions":["u probably destroyed my success, dont destroy other ones aswell.... You can reset your Microsoft password here:https:\/\/account.live.com\/resetpassword.aspxNow reboot the machine into Safe Mode with Networking.P.S. Remember that backing up important files regularly (e.g. weekly) is not an option but compulsory. Your success may depend on it . . .","At first, resetting pasword wont make difference at all. It just wont take any password u ever had or u have right now. Thats the problem I got all the time, and I could not fix it. Backing files is awesome, right? Via Microsoft OneDrive, right? Well guess what, that onedrive was totally not working at my pc and I was so done with trying to make it work that I just left it. Sooooo, another thing that microsoft done terrible job at :)","At first, resetting pasword wont make difference at all. It just wont take any password u ever had or u have right now. Thats the problem I got all the time, and I could not fix it. Backing files is awesome, right? Via Microsoft OneDrive, right? Well guess what, that onedrive was totally not working at my pc and I was so done with trying to make it work that I just left it. Sooooo, another thing that microsoft done terrible job at :)What did actually happen to your MS password? Did you (or someone else) change it, or forget it?When you reset it on the MS page, does it accept the new value? You can test this by logging off this page, then logging on again.Can you actually boot into Safe Mode with Networking?Do you have a local admin account with a known password?You do not need select OneDrive to back up your files. A local USB disk will do very nicely. This is what I do all the time. It makes me independent of Microsoft or the cloud.P.S. Let's leave the emotional stuff out of this thread, shall we? Respondents in this forum are not Microsoft employees, they are volunteers from the general Windows community.","Ok, I was lucky enough that my ssd still has few files.... I could not boot into safe mode with networking. My ms password was ok, I could log in in other pc, but not in safe mode at my pc. I am just very upset, cuz that safe mode, is far from safe and it did not help me at all. It is very stupidly done. Whatever I know now, that windows 10 is kinda sad. P.S. I am very emotional when this kinda stupid things happens to me. This is very unlucky, what happened to my 3 months old laptop. Thanks for replying though and your help. :)"]},{"symptom":"Taskbar on multiple monitors        My work computer was recently upgraded to windows 10.   On previous version I used a 3rd party software to extend the taskbar onto 2nd monitor.  I liked that ONLY those active tasks displayed on the 2nd monitor, since I do not want icons for tasks opened on primary monitor displaying on both monitors,  Is there some way to only have the active tasks display on the secondary monitor.   I do not need the start search and task view displayed in taskbar of each monitor nor do i need the tasks opened in  primary monitor displayed in taskbar of secondary monitor.   I generally have many apps running and it is helpful to only have the icons for open tasks displaying on secondary monitor.   ","solutions":["Hi MJ1223 right click on the taskbar and select taskbar settings under \"Multiple displays\", \"show taskbar buttons on\", select \"taskbar where window is open\"this will not give you everything you want, windows icon, task view, and the clock are still shown,The search icon is not needed on any monitor, just click start and type the search, you can turn that off, right click on taskbar and select search-> hidden"]},{"symptom":"disc space        I have an iso file thats too large for disc. I zipped it but it 33mb too small any ideas?","solutions":["I have an iso file thats too large for disc. I zipped it but it 33mb too small any ideas?33 MBytes is chicken feed. Could it be 33 GBytes?What do you intend to do with this file?","Its for a evaluation trial of windows 10 enterprise. I went and got a 16 gig flash drive and it says it too large for it???","Its for a evaluation trial of windows 10 enterprise. I went and got a 16 gig flash drive and it says it too large for it???Does this evaluation version run off an external USB device?What do you hope to get from the Enterprise version?Get a 500 GByte USB hard disk. It costs less than $50.0.","Make a bootable USB flash drive instead.Rufus - Create bootable USB drives the easy wayCheers.","im st trig to upload a 4.6 gig file. thats it. there has to be a way?","im st trig to upload a 4.6 gig file. thats it. there has to be a way?\"im st trig\" ???Upload from your PC to where`?"]},{"symptom":"I want to change the color of the highlighting when selecting text, etc.  I have glaucoma and I cannot see the blue very well.        I want to change the color of the highlighting when selecting text, etc.  I have glaucoma and I cannot see the blue very well.","solutions":["Hi, There's not currently a way to change this in the Windows settings. There are colour filters you can apply in the settings app under ease of access > Vision > Colour Filters.Alternatively you can do this with the registry editor. If open Regedit from the star menu and enter \"Computer\\HKEY_CURRENT_USER\\Control Panel\\Colors\" into the address bar. There are \"Highlight\" and \"Highlight Text\" entries for the blue highlight background and the text colour when highlighted respectively. These are RGB colour values, you should be able to customise these here. Though they won't apply until after a restart, or sign in and out.I hope that helps."]}]}