{"windows":[{"symptom":"Bluetooth adapter is not working        Hi,I followed all the advises given on how to get the Bluetooth working. Run the troubleshooter, update the driver, used the cmd to find the module (it can't find btmsehellx.dll anyway), turned on and off the computer 20 times, downloaded the driver for my adapter AC3168, 21. 50.0 version. What else should I do in order to get my bluetooth back? The motheboard is a B360M PRO-VDH, but that's pretty irrelevant given that almost all the motherboards have the same problem at some point when the windows is updated. In Bluetooth Settings it says Intel(R) Wireless Bluetooth (R) driver error. When I run the troubleshooter and trying to turn it on it says  Intel(R) Wireless Bluetooth (R) has a driver problem. In Bluetooth Properties window it says Code(10) STATUS_DEVICE_POWER_FAILURE. If I go cmd and run as an administrator trying  to uninstall regsvr32 \/u btmshellex.dll it says the module failed to load and the module cannot be found. Same if I want to install something that doesn't exist. What else should I try at this point? I even followed the advice to install IObit and uninstall the app, total fiasco same result. I get it that some computers just start working out of...whack overnight, but I just don't want to rely on fluke in this field. Does anybody has any idea what's going on because this is really frustrating? Are we really counting on accidental stroke of luck here? ","solutions":["Hello Randall_204, I am Andrew an independent advisor. Have you tried completely uninstalling all drivers for the bluetooth chip? Uninstall the driver, reboot the computer, reinstall with most recent driver provided by the manufacturer not Windows.","Well Andrew, I believe I installed and uninstalled the drivers and all remnants of them probably 20 times. Turned the computer on and off same amount. Tried everything logical. Here is what eventually worked, and if it's someone out there who is experiencing the same problem have a gander. First go in Device Manager -View- Show hidden items, identify Bluetooth right click and Uninstall. Check the box in the window that pops up \"Delete the driver for this device\".Second step, move down the list and identify Network Adapters, right click on it and uninstall it.  In my case was Intel (R) Dual Band Wireless AC-3168. Again don't forget to tic that box that says \"Delete the driver for this device\".Third step, turn off the computer and disconnect all the cables in back. Take it out lay it down on a table. Have proper lighting to see it clearly. Fourth step, Identify the Network Wireless Adapter and remove it from its socket. Have a screw driver handy to deal with the screws. Fifth step, dust it off gently make some prayers, chants, rituals you learned that bring good luck. Sixth step, put it back in its socket, don't forget the last prayer the most important one, secure everything with the screws. Reconnect the cables in the back and power on the computer .Voila","I'm happy to hear you found a fix. I'm sure anyone else experiencing this issue that finds this will thank you. Taking the module out and reseating it may have just been the problem all along.Thank you for providing info on the fix, we can pass it along. Take Care, Andrew"]},{"symptom":"windows 10 update 1909 internet problems        the update of windows 10 of November 1909 is a disaster that is the connection to internte is slow, intermittent and bounces the connection ....and do not send me update drivers or check my network card since I did all the tests and everything is optimal ....The problem started since I updated to 1909 on both my desktop and my surface pro","solutions":["I too am having the same issue as of the 28th of Novemeber.Steps done which have not fixed the issue- Update to the latest Intel driver (i219-v Network Card)- Uninstalled all netwok drivers, reinstalled latest Intel Driver- Uninstalled all netwok drivers, rebooted, reinstalled latest Intel Driver- Uninstalled all network drivers, used Windows Update- Uninstalled all network drivers, rebooted and used Windows Update- CHKDSK, which found no issues- SFC scan, which found no issuesNetwork is still dropping out.I have another Windows 10 1909 PC which has the i218-v network card and has no issuesEDIT: This has now been resolved. Turns out the Intel Pro Set Tools was still installed and caused the network issues. Once this was removed I uninstalled my network drivers again, rebooted and used the Windows Update driver. This has now been rock solid for the last day.","All of my network is gone, even using wifi usb or mobile phone tethering, nothing works.","I have a machine with three adapters - two Intel I211 adapters built into my Asus motherboard and one PCIe card from Realtek. After the 1909 update, the Realtek adapter was fine. The two Intel adapters were a complete failure - they did not recognize that the cord was plugged in. They kept saying \"Network Cable Unplugged\". I tried uninstalling the devices and drivers, no help. I tried Uninstalling the update, but that didn't work either. After the restart post-uninstall, the update manager still showed the 1909 update as installed and there was no \"Uninstall\" button to remove it.So, I had to reset the PC and re-install Windows. After that, my network adapters are fine again. It cost me hours worth of work to get my machine back up and running again. Microsoft needs to provide a mechanism to turn off auto-updates completely, not just pause them. My work was significantly impacted by this update.","I am having pretty much the same issue, my realtek ethernet adapter isn't recognized on the new 1909 update, hence no internet, hence, my inability to do literally anything online. When I revert it back, to the previous version, it works fine again. absolutely none of the solutions work that are on google, or other people suggestions. kind of annoying, especially since i think i heard it's going to be force upon us at some point whether we like it or not","In the Name Resolution Policy Table at the very bottom I noticed over a dozen unrecognized DNS entries. I deleted them all and my Internet connectivity was back! Something about Win 10 1909 must have messed up that part. I am not on a corporate network and have no idea where those IP addresses came from.Took me a while to figure this out. This solution is nowhere else to be found and it worked for me after trying EVERYTHING network related to no avail. I got wise to this because it was only name resolution that kept failing, but I could Ping, Trace, etc. Even when I rolled back to older Win 10 builds the problem persisted so it was something unrelated to the rollback. I had installed the latest Realtek Ethernet driver and everything else, but this did the trick.Run -> Edit Group Policy to get to this","I am having connection issues with new wifi networks where I cant add a network, it connects then disconnects. I have updated all the broadcom drivers to the latest. Very frustrating when on the move - Microsoft need to get your act togetherRunning a mac book pro os 18363.535 1909 installed 10\/6\/2019","I emailed, called, everything... Hopefully, they will help me one day. ","In the Name Resolution Policy Table at the very bottom I noticed over a dozen unrecognized DNS entries. I deleted them all and my Internet connectivity was back! Something about Win 10 1909 must have messed up that part. I am not on a corporate network and have no idea where those IP addresses came from.Took me a while to figure this out. This solution is nowhere else to be found and it worked for me after trying EVERYTHING network related to no avail. I got wise to this because it was only name resolution that kept failing, but I could Ping, Trace, etc. Even when I rolled back to older Win 10 builds the problem persisted so it was something unrelated to the rollback. I had installed the latest Realtek Ethernet driver and everything else, but this did the trick.Run -> Edit Group Policy to get to thisI don't have the group policy editor for some reason, so it won't let me do anything with that. Do I need to download one or is there something else I can\/should try?","It's might be because you are using home version ","It's might be because you are using home version  So does that mean I have to buy a whole new copy or what? That seems ridiculous"]},{"symptom":"Windows 10 update caused bad motherboard        Has anyone's pc motherboard gone bad after the windows 10 update? My laptop which is windows 8 forced an update to windows 10 causing a black screen. After my consultation with the geek squad at best buy, they said my motherboard is bad. My pc was working perfectly fine before a forced update in which my pc is not compatible. ","solutions":["Hi, If No Display, Looks like the built in graphics card is broken.","Thanks for the reply. I tried the graphics test by hooking my pc to my smart tv and nothing showed on my tv. ","Hi,Do you even see a Bios or manufacturer's screen when you boot ?I am aware of a number of articles that suggest overheating during an upgrade can damage a computer...Especially a Laptop\\Notebook as their cooling capacity is usually kind of limited..I know my Notebook gets quite warm under those conditions to the point that I need a external fan to help with the cooling..","Thanks for the reply. My pc does not go past the black screen. Sometimes the fan will come on then the caps lock will blink once ..stop...then blink again.","Hi MzVixzen When you start up your PC, do you see anything on the screen, do you even see the Manufacturers logo before Windows 10 tries to boot?If not, if you disconnect your hard drive, and start up your PC, do you then see the manufacturers logo screen?"]},{"symptom":"Xbox Game Bar stays on screen every time I start a game        Started happening about a week ago.As shown in the attached picture to this post, the Game Bar notification appears, but stays on screen rather than go away after a while.This issue is usually fixed by ending the task in Task Manager.Only small visual issue. I see there aren't any new updates for Game Bar in the Microsoft Store, any way of fixing this issue? I also don't want to disable Game Bar. ","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues with Xbox Game Bar on your PC. For further clarity on the issue, please respond to the questions below: Which build version of Windows 10 are you using currently?Are you aware of any changes made to the PC prior to which you weren’t facing this issue?Does this happen while playing games or while using any application? Refer the article Which version of Windows operating system am I running? Meanwhile, I would suggest you to refer the articles Fix problems with Xbox Game Bar on Windows 10 andTroubleshoot Xbox Game Bar on Windows 10 and see if that helps. Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator","1. I'm using the latest, 1909.2. I haven't made any changes prior to this issue. It came unexpectedly.3. Only occurs when a game is running.","Hi, Thank you for the reply.I would like to know if you were able to follow the steps mentioned in the above reply.Regards,Prakhar KhareMicrosoft Community - Moderator","All of these steps don't seem to resolve\/mention my issue.However it has stopped staying on my screen recently, it might have been solved but I don't know."]},{"symptom":"Double Google Chrome icon on the taskbar - Windows 10        I installed Google Chrome and then pinned it to the taskbar, and it looked like this:But everytime I click on that icon, a new one appears!I've tried to unpin the first one on the left, and then pin the new one on the right, but I can't pin that one because there is no option to pin it (I translated the options to english):I've tried using other methods that include going to C:\\Users\\(user name)\\AppData\\Roaming\\Microsoft\\Internet Explorer\\Quick Launch\\User Pinned\\TaskBar and C:\\Program Files (x86)\\Google\\Chrome\\Application but they don't work either. If you can, please help me! Thank you so much :)","solutions":["Hi,Thank you for posting your query on Microsoft Community.I would suggest you try the following steps and see if it helps:Method 1: Unpin Google chrome and end restart explorer.exe from task manager.1. Right click on the Taskbar and select Task Manager.2. Go to Processes Tab and find explorer.exe.3. Right-Click on Explorer.exe and selectEnd Task.  4. After some time, click on Windows key + R to go to the run command and type \"explorer.exe\" and click enter.Now try and pin the it again using Drag and Drop. Drag Google Chrome icon towards the taskbar and then drop it on taskbar.Method 2: If this doesn't help, I would suggest you run an SFC Scan and see if it helps.Follow the steps to run the System File CheckerOn the Search bar type “cmd” and clickctrl + shift + Enter to open the Elevated Command Prompt. (If prompted for a password, type the password and click Allow)Type “sfc \/scannow” and hit Enter.Exit Command Prompt.For more information about SFC Scan click on the link below:https:\/\/support.microsoft.com\/en-us\/kb\/929833 Hope this helps. Please reply if you have further related queries.Regards,Jesinta Rozario ","Thanks for your help, but neither of those methods worked :(","Close all you chrome sessions.Unpin Chrome.Open this in the FIle Manager (copy \/ paste in file explorer):%AppData%\\Microsoft\\Internet Explorer\\Quick Launch\\User Pinned\\ImplicitAppShortcutsInside there is a folder (mine is just one, yours... I don't know)You will see some folder that has a shortcut to chrome,Launch chrome from that shortcut.Pin that chrome.That should do it.","Hi,Follow these simple steps:1. Open Chrome 2. After having 2 Chrome icon, Unpin the icon that's not open3. Right click the other, choose pin from taskbarNext time you click Chrome it won't appear 2 icon on the taskbar.Hopefully it works for you.Dears","WORKED!!! Thanks a lot, it was driving me crazy.","Thanks, works like a charm!","Yes thank you it worked, share.","WOW - this was neat and simple. Worked for me!!!!.","its really very simple process. thanks alot ","I found yet another way, nice and simples...\"If chrome is on your taskbar unpin it and then open start menu and drag chrome to your desktop, then open chrome and it will place an icon on your taskbar, then pin that icon to your taskbar and then delete the icon on your desktop, problem solved for me.\""]},{"symptom":"Themes Problem in windows 10        Hello, I am having trouble with the personalized themes I create not retaining the selected cursors or Icons. It will keep the correct wallpaper settings, but does not change the cursors or icons to the ones I set for the theme in question. I have been trying to rebuild my personnel themes I have had since windows 98 onto windows 10. I am going in through the personalization section under settings and selecting the backgrounds, then I change the icons, and then I change the cursors. I then click the save theme and name it. When I go back to choose a different theme from the last one I worked on (which is the current theme showing) It changes the background but retains the icons and cursors from the last theme I created. If I go back through the list of themes I have created and check them they all use the last created icon and cursors. I have the box clicked allowing windows to change the icons and cursors. Is there a way for me to get windows to retain the icon and cursor choices for my themes or will I need to go with a third party app for that? If so this seems like a bit of laziness on microsoft's part since they have allowed users to change and retain these settings since windows 95 just using the windows app.Thanks for any help or suggestions,Stultis","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? Try saving the theme for sharing, then change the theme & delete the original, restart the pc then double-click on the theme you saved & see if this allow you to keep the icons & cursors.Also do you have sync themes turned on? https:\/\/support.microsoft.com\/en-gb\/help\/402610...This may also be why the themes are returning to default.","Hello Virginia,I'm running 1809. The cursors are now staying with the themes I have created, but the icons are not. The icons are saved as .ico files in a folder I created in the C:\\Windows\\System32\\001 Icons\\insert theme name here. There are sub folders past the 001 Icons to keep the different theme icons separated (insert theme name here, ex. BG2). This is also the way I have the cursors set up. C:\\Windows\\Cursors\\Cursors\\insert theme name hereWhy would I need to have the sync themes turned on? I have only one windows device.Thanks,Stultis","I’ve saved my themes under Documents within a ‘Themes’ folder, each theme then has folders within named cursors, icons & sounds, the theme itself is also saved within the Themes folder. This seems to work well & when creating a theme all the sounds, icons & cursors are easily found. Having them within the system32 folder may be the problem. Sync will save the settings to your Microsoft account in case you clean install Windows where it will recover these settings for you. If this is on then it will sync the old settings back to the PC.1809 is well out of date as the latest Windows version is 1909.","Hello Virginia,The way you describe how your themes are set up is how I had mine originally, just on D:\\Data\\Themes. My C drive is a ssd drive and d is a hdd. They were not working with that setup so I moved the cursors to the cursors folder and the icons into the system32 folder, since that is where the icons that come standard on the computer are located.So windows sync works for backing up settings only. I have a NAS system I use to back up all my important data.My computer has not prompted me to update anything in windows. It keeps having me update the video, sound card, and other divers, but not itself. Is there a way to get it to update, without turning on automatic updates. I like to review what is being updated on my computer before it does the updating. I bought this computer last year from Dell\/Alienware and cannot recall it ever asking me to update the windows software.Thanks,Stultis","Which desktop icons are you changing? Are they just returning to the default icon?You can manually upgrade via the media creation tool, double-click on this & choosing to upgrade this PC now:MCT\/USB: https:\/\/www.microsoft.com\/en-us\/software-downlo... .Iso: https:\/\/www.microsoft.com\/en-us\/software-downlo...","Hello Virginia, I’m just changing the “My Computer” and “Recycle bin empty and Full” icons. I try to keep the desktop empty of all icons except those and maybe 1 or 2 others. They are changing back to stock now. When I had the themes in a folder set similar to yours they were staying as the icons from the last theme I had created. The cursors were staying as the last themes cursors. Now with the cursors in the cursors folder they are changing with the themes.I’ll try the upgrade when I get home. Thanks for the links.Thanks,Stultis","Yes these are the ones I change. Previous Windows versions I changed Network neighbourhood & My Documents too.You may have to recreate the themes, if the icons, sounds & cursors are on another drive then save it as a new theme. If you’ve tried this & then problem remains & all worked when the themes were on the C drive then you may have to continue using the C\/Windows.","Do you still require help?","Hello Virginia,Sorry been busy with work and have not had a chance to update or try the suggestions yet. I will try them on the first and get back to you.Thanks,Stultis","Don’t worry. Thank for the update."]},{"symptom":"File Explorer - I don't understand it anymore        That's my File Explorer layout.This is a new computer (Dell XPS 8930). This machine has 2 drives: OS (C:) contains the operating system on a 256 GB SSD, and DATA (D:) is the 2TB harddrive.So far so good.Then there is something in File Explorer called \"This PC\" and it has directories underneath it, such as \"Documents\". P\"Pictures\", etc.When I tried to copy my data from my old machine, via external USB disks, to those directories under \"This PC\" , that didn't work.So I created my own directories under DATA (D:) and I transferred my data there.  I am ignoring the directories under \"This PC\".I can work this way, but it is obviously not the way Microsoft intended this to go.Any idea what I should have done, or can still do?","solutions":["Go C:\\users\\your user name.  There you see the different folders.","This PC is your computer. Under that you'll see shortcuts to the common folders on your PC. The Documents folder, for example is the library that points to C:\\Users\\yourusername\\Documents. Similarly tof the rest of the shortcuts. The C dribve and the D drive are the drives connected to This PC (your computer). Microsoft is just supplying you with shortcuts so you don't have to open the intervening folders to get to Documents, Music, and so in. Everything in your image looks format to me.","Doing as you suggest does show me \"Documents\", etc. folders, but there are no files showing in those folders.Also, the Microsoft pre-supplied folders, \"Documents\", etc. under \"This PC\" are empty.The only way in which I can see my folders and files is by going directly to the harddrive (DATA (D:)","Doing as you suggest does show me \"Documents\", etc. folders, but there are no files showing in those folders.Also, the Microsoft pre-supplied folders, \"Documents\", etc. under \"This PC\" are empty.The only way in which I can see my folders and files is by going directly to the harddrive (DATA (D:)","The Documents folder that shows in Quick Access is a copy of C:\\users\\your user name\\Documents.","That's correct because you put your documents in a non-standard location. It's possible to redirect those shortcuts, but it's not trivial.","Good evening Brian,Honestly, I put my documents, pictures, videos, music where I was allowed to put them - namely in the D: drive, my 2TB disk storage.Trying to put them anywhere else - for instance in the \"This PC\" area, where it appeared Microsoft wanted me to put them (because they had pre-created directories there), was not allowed by the system.This is an entirely non-conventional File Explorer - and I neither see the reason for it, nor do I understand it.So I now am sticking with \"what I know,\" namely: operating system on OS (C:) and data on DATA (D:)It's somewhat clumsy, but until anyone (or Microsoft) can explain what this new system intended to accomplish and how it is supposed to operate, I have no idea what else to do. I just wish that Microsoft hadn't made these changes - or if these changes were \"improvements,\" that they had explained them clearly, before just letting me guess what I should be doing.I am sure that now I am not utilizing the system as Microsoft intended me to use it, but nobody (including Microsoft) has explained what the heck is (or would have been) the \"correct\" approach.","It is totally a conventional Explorer image that you showed. You can't put them in the \"This PC\" folder. You should put them in the Documents or other appropriate folder.You can certainly continue using the D drive, but the default save location for documents will still be the Documents library on the C drive and you'll have to choose your new location every time, except for those applications that remember where you saved something last time. If you want to change just the location of Documents and not your entire user profile, the process is somewhat less complicated. Here's an article from Microsoft that explains what to do. Make sure you back up the registry and any data files prior to making any significant change to your PC. https:\/\/support.microsoft.com\/en-us\/help\/310746...","Thank you all for your responses, but I am still not clear on what I should have done, or should do now.Let me, if you don't mind, ask a few questions:Should I have copied, for instance, all files and directories that I have under \"Documents\" on my USB external drive to the \"Documents\" location that Microsoft created under \"This PC\"?If that is what I should have done, would all that information have been stored, physically, on my DATA (D:) drive?If the answer to both these questions is \"Yes,\" can I now do the following, in the indicated order:1. Copy all directories and files that I currently have stored on DATA (D:) under the by me created folder \"Documents\" to an external disk;2. Delete all data that currently resides in the by me created directory \"Documents\" from DATA (D:);3. Paste all directories and files from the external disk to \"Documents\" under \"This PC\"?If the answers to all of the above are \"Yes\" I need to clarify this:It was initially my intent to put all my documents (folders and files) at the Microsoft created location \"Documents\" under \"This PC\"  but when I tried to copy the folder \"Documents\" from the external disk to \"This PC\" (under which \"Documents\" resides on the computer), the system would not let me do so; I could not Paste (that option was not available).On any file explorer that I knew before, you could copy and paste to the folder one higher up from \"Documents\" and the folders and files from the external disk's \"Documents\" would be pasted to the existing \"Documents\" on the computer.So now, again if all the questions above have been answered with \"Yes\", it appears that I would have to copy from the external disk all individual folders and files that reside there under \"Documents\" and Paste those hundreds of folders and thousands of files directly to the Microsoft-created \"Documents\" under \"This PC\".One last question: is that correct?","This is how I do it using OneDrive and is probably Microsoft's preferred method:1.  Create an empty folder on Drive D and name it \"OneDrive\".2.  Create a new folder within the OneDrive folder and name it \"Documents\" (name it exactly that way without the quotes).3.  Sign into OneDrive from the cloud icon on the taskbar and select that new OneDrive folder on Drive D as your OneDrive location.4.  Then from the cloud icon on the taskbar > OneDrive Settings >Backup tab > Manage backup and select the \"start backup\" of your Documents.Now when you put files in your Documents folder on either your C or D drive then your documents will appear on both drives.  They will technically be on Drive D but will appear in the Documents folder on Drive C also.  The same goes for yourPictures and Desktop folders.Then of course you will eventually need to buy more space and Microsoft will be glad to sell you additional space.  My OneDrive storage space comes packaged with my Office 365 Home subscription.Here are the plans:  https:\/\/onedrive.live.com\/about\/en-us\/plans\/"]},{"symptom":"not activate windows        Split from this thread.Why am I being requested to Activate Windows again after I have been using Windows Pro 8.1 for 7 years on this computer?  I've gone to 'PC settings', but when I click on Activate nothing happens.   Now what?not activate windows","solutions":["Why am I being requested to Activate Windows again after I have been using Windows Pro 8.1 for 7 years on this computer?  I've gone to 'PC settings', but when I click on Activate nothing happens.   Now what?not activate windows You start your own thread here, not tack your problem on to someone else's computer problems.And you give much more information than you have."]},{"symptom":"how to install fresh windows 10        its windows old, programme file and programme data  nearly its occupies 30gb so kindly how to install fresh windows 10 restore with latest version and erase old version files everything","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,I would recommend creating a bootable drive using the latest installation files to reinstall windows. If possible, I'd suggest using another PC with enough space to create the bootable flash drive.Under this links are information on how to create a bootable flash drive and perform a clean installation of windows 10 using the latest 1909 version's installation files.https:\/\/www.tenforums.com\/tutorials\/1950-clean-...https:\/\/support.microsoft.com\/en-in\/help\/400073...Let me know how it goes. :)"]},{"symptom":"Texts on tasks are changing in Outlook        I use Outlook tasks. But as I see some changes sometimes occur, including deleting tables, changed font an so on.","solutions":["Hi Akrama, my name is Martin and I'm an Independent Advisor. I'll try to help you here.I suggest that you launch Outlook in the Safe Mode to isolate the issue https:\/\/support.office.com\/en-us\/article\/Open-O...If you find the same behavior in the Safe Mode, try to disable the active add-ins one by one to track which one causes this issuehttps:\/\/support.office.com\/en-us\/article\/View-m...Note: you should install the latest updates of Office and Windows 10 to make sure that everything is operating correctly."]},{"symptom":"Issues while connecting external monitor using USB        Hi AllPlease can you help me with the following issue:I have a dell laptop.I connect 2 screen monitors to me pc:Monitor 1 vga to hdmi connector plugged into the hdmi portMonitor 2 vga to usb connector plugged into the usb portMonitors both worked perfectly until I recently cleaned out my ssd drive and reinstalled drivers.The issue I have is the monitor connected to the usb port does not work, it notifies me I plugged the usb in and when I take it out.It shows the usb under USB video device and I cannot update the driver.Please see belowBelow is USB screengrab***Original title: 3rd Monitor issue***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues while connecting external monitors to your PC. For further clarity on the issue, please respond to the questions below: What is the exact model of the PC?Have you tried switching the USB ports?Do you receive any error message\/code when you try to update the drivers? Meanwhile, I would suggest you to follow the steps mentioned below and see if that helps. Method 1: Try updating the drivers by selecting the device manually.  Press Windows key + R. This will openRun. Alternatively, you can go to Start and search for Run.In Run dialog box, type devmgmt.msc and hitEnter.Expand CamerasRight click on USB Video Device and click onUpdate driverNow select Browse my computer for driver softwareClick on Let me pick from a list of available drivers on my computerSelect the drivers for monitor and click onNextRestart the PC. Method 2: Try uninstalling the drivers and see if the correct drivers are installed. Press Windows key + R. This will openRun. Alternatively, you can go to Start and search for Run.In Run dialog box, type devmgmt.msc and hitEnter.Expand CamerasRight click on USB Video Device and click onUninstall deviceCheck the box next to Delete the driver software for this deviceNow click on OKRestart the PC Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator","Hi PrakharThank you for helping.1. I have the Dell G3 3779 gaming pc2. I have tried all 3 usb portsMethod 1, got the error below:Method 2The It guys had a look and they cannot see any issues.I have run diagnostics and everything tells me I have the latest drivers installed already."]},{"symptom":"Browser windows and tabs open randomly  in Edge, Firefox and Chrome        Greetings, I started having this problem around the time I installed the Windows 10 Home 1909 version, build 18363.535. Web browser tabs are opening without user input.  e.g. if I'm working in Firefox, the tab I am in will open my home page.  Seemingly, in Edge, a new window opens.  As I am typing this, new Edge windows are opening.I have tried: Windows UpdateWindows Security full scanMalware Bytes full scansMalware Bytes ADW CleanerRemoving browser extensionsDisabling mouse and touchpad driversCleaning the registry (CCleaner)Where to next, please? Hardware:Acer Aspire A315-54Intel i5-10210U @ 1.60 GHz64 bit OS, x64-based processorNo pen or touch displayWindows:WIndows 10 HomeVersion 1909OS Build 18363.535Thanks in advance, Chris","solutions":["Hi Chris, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Is the keyboard in good condition? Windows might be opening due to unwanted key strokes as a result of bad hardware.Please tell us if the issue persists in a clean boot state. https:\/\/support.microsoft.com\/en-in\/help\/929135..."]},{"symptom":"Outlook express 6 suddenly stopped sending\/receving email        Getting the following error message:\"Your server has unexpectedly terminated the connection. Possible causes for this include server problems, network problems, or a long period of inactivity. Account: 'Hotmail', Server: 'pop3.live.com', Protocol: POP3, Port: 993, Secure(SSL): Yes, Error Number: 0x800CCC0F\"I've tried Port 995 also - same problem.Has anyone else experienced this problem?  Started within the last week.  I've also tried rebooting my cable modem and reloading Outlook express 6 (XP service pack 3).","solutions":["Hello, Traci-2005,Outlook Express, formerly known as Microsoft Internet Mail and News, is a discontinued email and news client included with Internet Explorer versions 3.0 through to 6.0. https:\/\/en.wikipedia.org\/wiki\/Outlook_ExpressWhich browser are you using?If you have a Hotmail account, I'd advise logging into Outlook.com using your User Name and Password to view emails.","Please disregard the Spam post. It is a scam so please do not call the number posted.","Hello, Traci-2005,Outlook Express, formerly known as Microsoft Internet Mail and News, is a discontinued email and news client included with Internet Explorer versions 3.0 through to 6.0. https:\/\/en.wikipedia.org\/wiki\/Outlook_ExpressWhich browser are you using?If you have a Hotmail account, I'd advise logging into Outlook.com using your User Name and Password to view emails.Yes, I'm aware that Outlook Express 6 is obsolete as of many years ago, but my wife doesn't want to give it up.It was working fine as of a few days ago.  Just wondering if anyone knew exactly why it quick working.  For example, did Microsoft finally pull the plug?  I don't see any news out there.","Please disregard the Spam post. It is a scam so please do not call the number posted.Yes, thanks.  I thought it was likely a scam.","FYI.Outlook Express is the built-in email program that is part of the XP operating system and worked\/works up toInternet Explorer 8 which is the last version of IE for XP.","I am having the same issue. Researched and tried different pop3 servers suggested in some posts but to no luck. I can access account through the web and on my tsblet with the Outlook app but getting the same error nessage as you using outlook express","Same Issue i am facing...Your server has unexpectedly terminated the connection. Possible causes for this include server problems, network problems, or a long period of inactivity. Account: 'Hotmail', Server: 'pop3.live.com', Protocol: POP3, Port: 995, Secure(SSL): Yes, Error Number: 0x800CCC0FI had tried Microsoft Outlook express with office 2007 but not able to download the mails.There i am getting this messageTask *** Email address is removed for privacy *** - Receiving' reported error (0x800CCC1A) : 'Your server does not support the connection encryption type you have specified. Try changing the encryption method. Contact your mail server administrator or Internet service provider (ISP) for additional assistance.'Anybody can help Please to resolve the issue.","Try the steps found here or here.","Thanks a lot for your help.","You're welcome."]},{"symptom":"my blue background is now black; icon text white. what happened?        my usual background of blue is now blackicon text whitehow do I restore blue background?tried restartingno changewindows 10 ","solutions":["Hi Joyscott, can you please provide a bit more detail, what icons are you referring to, is that try e icons on your Start Menu or somewhere else in Windows?If that is on your Start Menu, open the Settings App, go to personalization - Colors, then from there you can set your preferred color..."]},{"symptom":"Fixing external Disk is very slow!        Hi,I have Windows 10.I had a problem with my external hard drive (it said fatal hardware error) as it was not recognized by the system, though found as disk F:\\. I restarted as sometimes it fixes such bugs.right at the start of booting, windows started fixing my external hard drive, completing after an hour.At this point the explorer did not work properly, so I restarted it again. That was about 17 hours ago.The computer tried to fix my external again, and is stuck on stage 2 where it's progress in a very slow.write now the message I get is: Fixing (F:) Stage 2: 92% (372408 of 400908); Total 71% ETA 6:09:27..17 hours ago it was on 372108, so with this rate it will take months just to complete stage 2!what should I do??I would appreciate any help and\/or suggestions. I must add that loosing the files within the external hard drive is not an option, but not using the computer for about half a year is not desirable as well...My system is Windows 10Thank you in advance!","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as the external hard disk is very slow and it’s giving a fatal hardware error. As per the description of the issue, you have provided seems that the external hard drive has some corrupted\/bad sectors. Due to which the PC is running a check disk. Upon seeing the fixing report, seems that the corrupted region is getting fixed. At times it take longer duration than expected, we recommend users to complete the process without any hindrance. As you have mentioned in the post that you have restart the PC, in that case we would like to know the status of the external hard disk when it is connected on a different PC\/device. Does it gives the same error or it works fine on the other device, if it works fine as it should be then we would suggest you to back up the data from the drive to be on the safer side. If not, then run the check disk completely till the process ends. Let us know the status of the issue. Aditya RoyMicrosoft Community – Moderator","Dear Roy,Thank you for the answer. Yes, indeed the process is very slow: about 500 clusters\/sectors per day.it started in about 372108 42 hours ago and now stands on 372902.I must add that it is a ridiculously slow pace, which WINDOWS should have warned me about BEFORE starting.If this pace continues, it means that in the next 2 MONTHS(!!!!!) I will not be able to use my computerNOR my disk, all for the completion of a processwhich might not be successful at all! :-(I would love to check my disk on another computer, a linux computer, but WINDOWS took my diskAND my computer as hostages, and I cant stop its processing in the middle, as I fear that the files in the disk will not seen anymore.Really, what should I do??I can not wait for so long for the files in the disk and I need the computer. 40 hours, and most likely many more hours, is too long of an impossible to stop process!What other options are available for me?Thanks again,Guy"]},{"symptom":"Setting footer to full page width        Can I set an image as a footer to full page and won’t affect the document? Thank you.","solutions":["Hi Hetty, my name is Martin and I'm an Independent Advisor. I'll try to help you here.You can place the image anywhere you want. However, a lot of printers will not print the document from edge to edge. If you place the image in-line-with-text, you can adjust the left and right indent settings."]},{"symptom":"Windows 10 free upgrade        I had previously upgraded this computer to Windows 10 during the free period. However i had to format the hard drive due to malware from a game my daughter was playing. Is there any way to get 10 free again or am I screwed?","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.You will be able to upgrade again with no problems as you have previously activated.Regards, Ross","Where do I get the download on MS site?","Hi James, Here is a guide to the process: https:\/\/windowsreport.com\/windows-10-free-upgra...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"updated Windows 10 version but was left with problem if delay of getting the screen to connect\/        updated Windows 10 version but was left with problem if delay of getting the screen to connect\/.In fact, I think the the screen was causing problems before that and I tried updating to the higher version to correct it. Somewhere along the way I think I made changes to something in Apps or drivers. but am now wondering, if I do a systems Restore, willthe computer revert to the earlier version of Windows 10.   I don't see that going to the trouble of updating it did anything at all.  I can't keep waiting for the screen to show up on the monitor. There is something wrong with it.I don't know where BIOS is or even if it is the problem. So often on this forum people guess what the problem might be without really reading what i write.   the monitor screen flicks, now for 5 minutes or more, before connecting. After it connects, it is fine. Logic tells me this couldn't be a problem with BIOS. ","solutions":[]},{"symptom":"Iphone11 personal hotspot for Xbox one        My iphone11 has always ram perfect on my xbox using my personal hotspot. Im womder if there is anything that can help me get better connection","solutions":["Hi walkmanmoore,what do you mean by a better connection?Does the personal hotspot work or not work?Clarify better."]},{"symptom":"BSOD problems (IRQL_NOT_LESS_OR_EQUAL or DRIVER_CORRUPTED_EXPOOL) caused by ntoskrnl.exe        Hi,Problem description: sometimes (once a week) I get blue screen. This is already a long lasting issue (more than one year). There is no indication to any behaviour pattern. The BSOD comes suddenly without warning, no dependency to any application I am using (no games). Just only the feeling, that after wakeup from sleep mode, the probability of the event increases.Environment: Win7 64bit SP1 on HP Elitebook 8440pMeasures taken: from the beginning of the memory extension to 5GB I knew, that one of the RAM modules had a problem with one address - memtest failed. It seemed, that it had no effect on the functionality of the notebook. But, since the BSOD problem started, I exchanged my RAM module and memtest is OK now.Internet research: revealed, that Windows generates kernel memory dump, which can be analysed and used to identify the problem. Further research showed, that this kind of problem can be caused by obsolete drivers or broken USB devices attached to the notebook.Situation: I admit, that I don't care much about newest drivers, because in most cases I don't need the extra functionality, however I have no problem to update one, if I would know, which one.I am looking for: a help from a professional, who is able to interpret attached dumps and say, which one of the drivers is causing the problem, similar to this post(DRIVER_CORRUPTED_EXPOOL) BSOD caused by ntoskrnl.exeAttached evidence: kernel memory dumps with IRQL_NOT_LESS_OR_EQUAL or DRIVER_CORRUPTED_EXPOOL errors in ntoskrnl.exe and MSinfo32 reportLink to attached evidence","solutions":["As nobody helped here, I was forced to do it yourself method.Procedure:As I knew, I have some bad driver on my PC I investigated further the topic and foundDriver Verifier tool from Microsoft:https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-update\/driver-verifier-tracking-down-a-mis-behaving\/f5cb4faf-556b-4b6d-95b3-c48669e4c983https:\/\/mikemstech.blogspot.com\/2011\/12\/enable-driver-verifier-to-help-identify.htmlhttps:\/\/www.sevenforums.com\/tutorials\/101379-driver-verifier-enable-disable.htmlThis tool makes it possible to provide further details in case of ntoskrnl.exe failures. In particular it identifies in advance the driver causing the failure.In my case it was WinCDEmu and NetWorx. I uninstalled the software and since that my notebook works like a charm.I hope the information helps to others, who cope with BSOD problems caused by ntoskrnl.exe."]}]}