{"windows":[{"symptom":"File system error -2147163890        Trying to open photos in file explorer, using just plain old Photos.","solutions":["HiOpen the Settings App, go to Apps and find the Photos AppSelect that and choose Advanced Options then click ReaetWhen that completes check to see if you can view photos...","Tried, still didn't work.","Hi GinkoWeed, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Press Windows key + X >> PowerShell (Run as administrator) >> Copy and paste, using the mouse button >> Get-AppxPackage -allusers Microsoft.Windows.Photos | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register “$ ($ _. InstallLocation) \\ AppXManifest.xml” + Enter, restart the computer (Recommended), and check again. If the previous step does not work, start Windows with a clean boot, it is an error-proof process, because it isolates third-party programs, drivers, to detect if it is the cause of the problem.https:\/\/support.microsoft.com\/en-us\/help\/929135...To complement the previous step, we can scan the computer for corrupt files that interfere with Windows processes, if they are detected, they will be automatically repaired.https:\/\/support.microsoft.com\/en-us\/help\/402652...If the error persists, please share it exactly as you see it, in case you missed somethingLet me know if you have something else that I can help you with, I'd be happy to help.Happy New Year Regards, Marc M.","Neither of those worked. The only other information I can think to write down is that the photos app temporarily disappeared, but has now returned. However, opening any image still results in a quick flash of a new window, and then it closing and showing the error code, which has not changed."]},{"symptom":"Card Reader        Since an update on Windows 10 I can not get my card reader to work. It can't find the subsystem? Very frustrating as it is a work tool that needs to be used once a week. Any help ideas? I went to the software provider and they can't fix it and told me to seek help from Windows. UGh!","solutions":["Do you really expect us to know which card reader you have, or what you were trying to do with your card reader when you received an error message, or the complete wording of the message, or what software you are using? There are many good people here, but no wizards.","Cyndi, Evan here an independent adviser I hope I can help. Seems like the update uninstalled the drivers possibly.Please follow this link: https:\/\/www.gihosoft.com\/windows-tips\/sd-card-n... It involves several steps you can take to fix your SD reader issue. Please let me know if this helps!"]},{"symptom":"Hello, I allowed windows update to install the latest update back on 11\/20\/19, since the update,  I cannot get past the sign in page        Hello, I allowed windows update to install the latest update back on 11\/20\/19, since the update, I am unable to sign in to the computer, I cannot get past the sign in page which states that i have no internet, despite being connected via ethernet & wifi, all my other computers have internet connectivity, I am then asked to enter my password, or pin, which are rejected with a message telling me I have no internet, please sign in with other option, all of which are rejected, I enter \"last password used on this device\" as instructed, only to have that come back as incorrect.. Also, on the log in screen, on the lower right, I have 2 icons: internet and ease of access. there is no power switch iconI have tried every imaginable fix, to no avail, I do not want to reset the computer as I need my filesany advise would be greatly appreciated","solutions":["Hi Michael, Most likely, if the sign in is damaged. There's a high chance that you really need to Reset\/Refresh your PC. The best thing that I can suggest is to extract your HDD and export all your important files first before doing this procedure.Please let me know if I clarified your concern. Thanks and regards,","Hi Michael, Most likely, if the sign in is damaged. There's a high chance that you really need to Reset\/Refresh your PC. The best thing that I can suggest is to extract your HDD and export all your important files first before doing this procedure.Please let me know if I clarified your concern. Thanks and regards, Thanks for the quick advice, how exactly would I extract my HDD and export my files? My PC is  DEll  (2310 I believe) All In One unit","Hi Michael, Most likely, you need a hand over that from a friend that knows how to extract and convert it to an external hard drive or a local shop.This is the first step in order to you to have a successful system restoration. Thanks and regards,"]},{"symptom":"Recovering files from Word on lost device        Among other items, my Windows computer was stolen in a home burglary. Is there any way I can retrieve the documents from that computer, particularly in Word. They are not in the cloud or onedrive. I got the MS office as a student, if that helps","solutions":["Hi Byron. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.When you install Office it offers to place the files in Onedrive so they are always within reach via the internet in cases like these. But you said you didn't do that, correct? So what kind of backup do you have? If it's a System Image backup you can mount it to extract the files that were present when you made that image. But you really need a file backup, and another cloud backup like the one you were offered when you set up Office. In fact Office 365 includes 1tb of free OneDrive storage in addition to the 5gb which already comes free.","Sorry ... bad news: Unless you have a backup somewhere else, your personal files are wherever you were storing them. Microsoft doesn't make a second copy.More bad news ... As much as it burns to be robbed, you may have a bigger problem: the theft of your personal identity.By now, your computer is in the trash. The only part of it that's of any interest to a thief is your hard drive, and not even the hard drive itself but the information you had stored there. Please do this ASAP:Change all your online passwords. Change every one, but particularly for email and financial institutions.Be on the lookout for signs that your identity may be stolen. Work with your insurance company and the local police. Being robbed sucks big time - don't let it suck more than it already has. Best wishes to you.","Your question is like saying \"My briefcase was stolen. Is there any way I can get back the papers I had in it?\"No, of course not--not unless the thief is caught and what he stole returned to you.Or unless you have them backed up somewhere, but your question makes it sound like you don't. So for the future, let me give you my standard advice on backing up:Almost everyone should be backing up to external media regularly. It is always possible that a hard drive crash, user error, nearby lightning strike, virus attack, even theft of the computer, can cause the loss of everything on your drive. As has often been said, it's not a matter of whether you will have such a problem, but when."]},{"symptom":"Can't switch out of S Mode \/ Cant access Windows Store        So I was going nuts trying to figure out why I couldn't install anything, such as my printer drivers or various software and applications I normally use. I kept receiving the error, this cant be installed at this time contact your sys admin blah blah blah. I quickly found out its because of this stupid Windows 10 \"S-Mode\". I attempt to follow the easy step by step instructions to switch out of s-mode however I cant access the store. In fact I cant access the store from anywhere on the computer. Either the icon will do nothing or I get a message saying that icon to an app, but that's impossible because I somehow don't have the ability to make that happen - even though I am the admin. I cant even run commands in a terminal! I attempt to reg-edit and get the windows s-mode \"no, no\" screen again.To summarize: 1. Need to get out of S-Mode2. Im not able to access the store in order to get out of S-Mode3. Cant access reg-edit or run terminal commands 4. If you need to know its an HP Stream laptop","solutions":["Hi Joshua, You may want to follow the suggested steps in this article: https:\/\/support.microsoft.com\/en-us\/help\/445606...Or you may refer to this video: https:\/\/www.youtube.com\/watch?v=IwqqexPTRCQDisclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"windows 7 not genuine        Diagnostic Report (1.9.0027.0):-----------------------------------------Windows Validation Data-->Validation Code: 50Cached Online Validation Code: N\/A, hr = 0x80070422Windows Product Key: *****-*****-YG69F-9M66D-PMJBMWindows Product Key Hash: \/kehptF9HHVxM5d8dUnqgcfndXw=Windows Product ID: 00426-OEM-8992662-00497Windows Product ID Type: 2Windows License Type: OEM SLPWindows OS version: 6.1.7601.2.00010100.1.0.001ID: {DCD3D414-AFCA-4FB7-BFC9-504EF265265B}(1)Is Admin: YesTestCab: 0x0LegitcheckControl ActiveX: N\/A, hr = 0x80070002Signed By: N\/A, hr = 0x80070002Product Name: Windows 7 UltimateArchitecture: 0x00000000Build lab: 7601.win7sp1_ldr_escrow.191127-1706TTS Error: Validation Diagnostic: Resolution Status: N\/AVista WgaER Data-->ThreatID(s): N\/A, hr = 0x80070002Version: N\/A, hr = 0x80070002Windows XP Notifications Data-->Cached Result: N\/A, hr = 0x80070002File Exists: NoVersion: N\/A, hr = 0x80070002WgaTray.exe Signed By: N\/A, hr = 0x80070002WgaLogon.dll Signed By: N\/A, hr = 0x80070002OGA Notifications Data-->Cached Result: N\/A, hr = 0x80070002Version: N\/A, hr = 0x80070002OGAExec.exe Signed By: N\/A, hr = 0x80070002OGAAddin.dll Signed By: N\/A, hr = 0x80070002OGA Data-->Office Status: 100 GenuineMicrosoft Office Enterprise 2007 - 100 GenuineOGA Version: N\/A, 0x80070002Signed By: N\/A, hr = 0x80070002Office Diagnostics: 025D1FF3-364-80041010_025D1FF3-229-80041010_025D1FF3-230-1_025D1FF3-517-80040154_025D1FF3-237-80040154_025D1FF3-238-2_025D1FF3-244-80070002_025D1FF3-258-3_E2AD56EA-765-d003_E2AD56EA-766-0_E2AD56EA-134-80004005_E2AD56EA-765-8009_E2AD56EA-766-2f06_E2AD56EA-148-80004005_16E0B333-89-80004005_B4D0AA8B-1029-80004005Browser Data-->Proxy settings: N\/AUser Agent: Mozilla\/4.0 (compatible; MSIE 8.0; Win32)Default Browser: C:\\Program Files\\Google\\Chrome\\Application\\chrome.exeDownload signed ActiveX controls: PromptDownload unsigned ActiveX controls: DisabledRun ActiveX controls and plug-ins: AllowedInitialize and script ActiveX controls not marked as safe: DisabledAllow scripting of Internet Explorer Webbrowser control: DisabledActive scripting: AllowedScript ActiveX controls marked as safe for scripting: AllowedFile Scan Data-->File Mismatch: C:\\Windows\\system32\\wat\\watadminsvc.exe[Hr = 0x80070003]File Mismatch: C:\\Windows\\system32\\wat\\npwatweb.dll[Hr = 0x80070003]File Mismatch: C:\\Windows\\system32\\wat\\watux.exe[Hr = 0x80070003]File Mismatch: C:\\Windows\\system32\\wat\\watweb.dll[Hr = 0x80070003]Other data-->Office Details: <GenuineResults><MachineData><UGUID>{DCD3D414-AFCA-4FB7-BFC9-504EF265265B}<\/UGUID><Version>1.9.0027.0<\/Version><OS>6.1.7601.2.00010100.1.0.001<\/OS><Architecture>x32<\/Architecture><PKey>*****-*****-*****-*****-PMJBM<\/PKey><PID>00426-OEM-8992662-00497<\/PID><PIDType>2<\/PIDType><SID>S-1-5-21-2851732450-233693680-155418787<\/SID><SYSTEM><Manufacturer>Hewlett-Packard<\/Manufacturer><Model>HP G72 Notebook PC              <\/Model><\/SYSTEM><BIOS><Manufacturer>Hewlett-Packard<\/Manufacturer><Version>F.35                 <\/Version><SMBIOSVersion major=\"2\" minor=\"6\"\/><Date>20100906000000.000000+000<\/Date><\/BIOS><HWID>7EE83E07018400FC<\/HWID><UserLCID>0409<\/UserLCID><SystemLCID>0409<\/SystemLCID><TimeZone>Arabian Standard Time(GMT+04:00)<\/TimeZone><iJoin>0<\/iJoin><SBID><stat>3<\/stat><msppid><\/msppid><name><\/name><model><\/model><\/SBID><OEM><OEMID>HPQOEM<\/OEMID><OEMTableID>SLIC-MPC<\/OEMTableID><\/OEM><GANotification\/><\/MachineData><Software><Office><Result>100<\/Result><Products><Product GUID=\"{90120000-0030-0000-0000-0000000FF1CE}\"><LegitResult>100<\/LegitResult><Name>Microsoft Office Enterprise 2007<\/Name><Ver>12<\/Ver><Val>64BC76978749586<\/Val><Hash>GW6PzcEVEDTVKeO5Ym5UUm41dBk=<\/Hash><Pid>89388-707-0441865-65992<\/Pid><PidType>14<\/PidType><\/Product><\/Products><Applications><App Id=\"15\" Version=\"12\" Result=\"100\"\/><App Id=\"16\" Version=\"12\" Result=\"100\"\/><App Id=\"18\" Version=\"12\" Result=\"100\"\/><App Id=\"19\" Version=\"12\" Result=\"100\"\/><App Id=\"1A\" Version=\"12\" Result=\"100\"\/><App Id=\"1B\" Version=\"12\" Result=\"100\"\/><App Id=\"44\" Version=\"12\" Result=\"100\"\/><App Id=\"A1\" Version=\"12\" Result=\"100\"\/><App Id=\"BA\" Version=\"12\" Result=\"100\"\/><\/Applications><\/Office><\/Software><\/GenuineResults>  Spsys.log Content: 0x80070002Licensing Data-->On a computer running Microsoft Windows non-core edition, run 'slui.exe 0x2a 0x80070422' to display the error text.Error: 0x80070422 Windows Activation Technologies-->HrOffline: 0x00000000HrOnline: 0xC004C4A2HealthStatus: 0x0000000000000000Event Time Stamp: 12:21:2019 00:23ActiveX: Not Registered - 0x80040154Admin Service: Not Registered - 0x80040154HealthStatus Bitmask Output:HWID Data-->HWID Hash Current: MAAAAAEAAgABAAEAAAACAAAAAgABAAEAeqhOhlADRueaUcr1dFWKtQTW7nfia1xdOEM Activation 1.0 Data-->N\/AOEM Activation 2.0 Data-->BIOS valid for OA 2.0: yesWindows marker version: 0x20001OEMID and OEMTableID Consistent: yesBIOS Information:   ACPI Table Name OEMID Value OEMTableID Value  APIC HPQOEM SLIC-MPC  FACP HPQOEM SLIC-MPC  HPET HPQOEM SLIC-MPC  BOOT HPQOEM SLIC-MPC  MCFG HPQOEM SLIC-MPC  WDAT HPQOEM SLIC-MPC  ASF! HPQOEM SLIC-MPC  SLIC HPQOEM SLIC-MPC  ASPT HPQOEM SLIC-MPC  SSDT PmRef CpuPm","solutions":[]},{"symptom":"How to enable JavaScript in Microsoft Edge Windows 10 HOME edition?        According to a website I want to use, apparently JavaScript is not automatically enabled in Windows 10 Home for Microsoft Edge browser, installed in September 2019. And that website doesn't function properly. I've read the responses and advice, which do not appear to be up-to-date for current software versions. Duly noted that the old \"Internet Options\" function in Internet Explorer is not available in Edge - what a pity. However, there is no Group Policy Editor function. And the Registry Edit modifications suggested by one user don't match what I see in my version of the Registry. Thanks for the help.","solutions":["Hi Srr, You may follow this article: https:\/\/www.windowsdigitals.com\/how-to-enable-j...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"I purchased mine craft but it wont load its extremely leggy and in the Microsoft store it says i didn't purchase it but i did        OK so i purchased mine craft for windows 10 in 2015 and now and for while anytime i loaded my mine craft it was SUPER leggy so i stopped playing for awhile now every time i try to load up mine craft it either goes to a white screen or it just stays on the screen with the loading bars and it does freeze the bars are still moving but it doesn't display the play screen i waited to see if it would display the play screen but it didn't i waited for 6 hours for it to fully load and it wouldn't and i checked the Microsoft store to see if there was an update and there wasn't any updates for it it was still installed to my computer i logged into the account i play with on my phone but in the Microsoft store it says i haven't purchased the game when i did and i don't have any codes or anything and it was the full version of mine craft is there anyway i can fix my mine craft so i can finally play it please help!","solutions":["Hi Melissa, You may refer to this article for FAQ's about Game Purchases: https:\/\/help.mojang.com\/customer\/portal\/article...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"CORTANA         HEY, my name is SAYEED AJMAL. I buy the microsoft phone aund updated it to window  10, and synced the micorsoft  account with Pc and window Phone..but still no notification on PC about call and messeging.. and other notification..... how can i solve it....","solutions":["If you don’t have any further questions please feel free to mark one of the replies as the answer &\/or rate my help: 1 star means you are very unsatisfied with my help and 5 stars means you are very satisfied with the help I gave you.","... I buy the microsoft phone aund updated it to window  10 ... Microsoft stopped supporting Windows Phone on December 19, 2019.See this notice from Microsoft:\"Windows 10 Mobile, version 1709 (released October 2017) is the last release of Windows 10 Mobile and Microsoft will end support on December 10, 2019. The end of support date applies to all Windows 10 Mobile products, including Windows 10 Mobile and Windows 10 Mobile Enterprise.\""]},{"symptom":"Problem after changing motherboard        HelloI recently had to change my motherboard, as it got fried, because of a blackout in my house, and after changing, I couldn't reactivate my windows, please helpI got my windows 10 through the free update promotion, that was running a while back.","solutions":["Hi christerPA Yes, I am sorry, that licence is tied to the original Motherboard, you will need to purchase a new licence . . ."]},{"symptom":"Minecraft Windows 10 se cierra al intentar abrir mundo        Cuando me meto a minecraft windows 10 no pasa nada pero al intentar abrir un mundo se carga el mundo y luego instantaneamente se cierra el juego","solutions":["Hola, Jonathan. Mi nombre es Dante Martino, asesor de la Comunidad. Revisa esta conversación de la Comunidad que puede ayudarte en este problema: https:\/\/answers.microsoft.com\/es-es\/windows\/for...Para obtener una lista de las nuevas funciones, mejoras del juego y las soluciones de errores más recientes para Minecraft: Windows 10 Edition (incluido Oculus Rift), visita Mojang y ve a la sección Publicaciones recientes:https:\/\/minecraft.gamepedia.com\/Minecraft_Wiki(nota: este no es un sitio web de Microsoft; ten cuidado con los anuncios o productos del sitio web, y accede bajo tu responsabilidad)"]},{"symptom":"Audio jack doesnt detect my headphones?        I mainly use Bluetooth headphones or headphones that go into a usb port and it works perfectly . But I got a new pair of headphones and when I try to plug them into the audio jack in the front and back it does not work (these headphones also have a audio plugin for a microphone). I've tried looking at my drivers and it says they are all up to date but i'm still having problems.","solutions":["Hey there helena, Evan here an independent adviser here to assist you. It could be that your PC is still looking for your old headphones. Please right-click the speaker icon on your desktop.Let click sound settings and in the settings window that pops up please navigate to sound control panel. A second window will open and then please click Playback.When you have your headphones plugged in you should be able to select them via right-click and left-click the option to set as default audio device.Please let me know if this helps!"]},{"symptom":"Windows Hello \"This option is currently unavailable\"        Hello, my Windows Hello facial recognition has recently stopped recognizing me after I changed glasses. I went into the settings to improve the recognition but the options to improve recognition or remove it are grayed out and it says that this option is currently unavailable and that \"something went wrong, try again later.\" This is true for the options for the fingerprint scanner and PIN as well. The fingerprint scanner and PIN still work and the face scanner still tries to detect my face, it just doesn't recognize it. How do I resolve this issue? Thank you for any solutions.","solutions":["Hi HunterFails, I've checked and there's something similar with this thread: https:\/\/answers.microsoft.com\/en-us\/surface\/for...Kindly check and see if it will help you solve your current concern. Please let us know if it will work. Thanks and regards,","Thank you for your response. I followed the answer from that thread based on what I found on my laptop (which is not a surface as it was in the other thread) but it did not resolve the issue for me.","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. If the camera is not recognizing your face due to small changes, I would suggest you to kindly remove existing face ID and add your current face ID.","If you are referring to the remove option by going to settings > accounts > sign-in options, as you can see in the image I posted the option to do that is grayed out so I cannot do that. If you are referring to another method, could you please elaborate?","Alright, please try the following method: Open gpedit.msc Navigate to Policy > Administrative Templates > Windows Components > Windows Hello for BusinessSelect Use Windows Hello for Business Select the disable option Click Apply Click OK","Alright, please try the following method: Open gpedit.msc Navigate to Policy > Administrative Templates > Windows Components > Windows Hello for BusinessSelect Use Windows Hello for Business Select the disable option Click Apply Click OK ArifAhmed2,I've been having a similar issue with my computer and the 1909 update, but I can't use my fingerprint. I also can't add any other Windows Hello logins. Additionally, the gpedit.msc option you have listed is only available for business accounts, which mine is not. Is there another way to fix the issue?","Unfortunately this method did not work for me. Are there any other ways to fix this issue?","Okay, please create a Local Account and check if the Hello feature works or not.","I signed in with a local account and nothing has changed."]},{"symptom":"Maximized windows on left display has serious problems        Windows 10.  Two monitors.  The left (monitor 2) is set as \"main\".  In this display, windows that are maximized - with explorer or any other app - has the following \"features\":1) The top part of the window (about 1 cm) is black.  The top left corner is also a black rectangle about 2x2 cm.  The top right corner is a black rectangle about 2 cm high x 8 cm long:2) If you try to click or double click in the black area - for example, to close the window - or use the min max buttons or the upper left corner window menu system - the click(s) affect the underlying items.  (eg: if there is a desktop item there - like the trashcan - it will open on double-click.)  It behaves like the areas in black are \"transparent\" to the underling environment.3)  Therefore, you cannot min\/max via window buttons; only though the taskbar menu system: but only if it is available.4)  This problem does not occur in my right (monitor 1) window.I have tried restarting.  I have done a sfc \/scannow, as well as DISM CheckHealth\/ScanHealth\/RestoreHealth: no issues.  I have not installed any new software anytime recently.  The problem started yesterday.  It is a surprisingly debilitating issue:  I've had to resort to only using my right monitor. ","solutions":["If you physically swap the cables round for the monitors, does it do the same? Or does it happen on the monitor you swapped?","I'll try that next weekend - its a bit complicated as my dual-display is on a KVM shared with another workstation.  Are you suggesting a driver issue with the display?  A cabling issue would not create this problem.  Note that the black areas coincidentally relates to window specific client areas:  the menu areas, title bar, close\/min\/max buttons area.  All apps with the same behavior? - meh.  It must be related to Windows calls.  The confusing bit is only one display.I'm going to do a full shutdown as well.  I do not trust Windows \"restarts\" anymore... they cache a LOT of components these days.","Ah cool. Yes, Hybrid restarts do keep a lot of things still going. For us causes issues with security patching","Ah KVM does throw a spanner in the works. Try bypass it and see if it does the same. I've had issues with KVMs before","OK... a complete shutdown, 10 second \"rest\" - and then restart, did the trick.  This was obviously easier then mucking about with two PC's, and two displays\/cables.... and in the end made the most sense.  (ie: Windows software error that did not properly reset with a simple restart.)I think I cannot advise people to restart their machines on a problem anymore... the advice must be: complete shutdown and then try again.Thanks to those who responded!"]},{"symptom":"activation after manufacturer motherboard and operating system replaced        Confused purchased new Windows 10 All in One,  first day Blue Screen and \"said I had no operating system installed\"?  Happened twice both time send back to HPOn Activation screen says  \"Windows is activated with a digital license\"Half ways down screen under key icon  \"change product key\"   statesthe last product key (ID:00326-10000-00000-AA405) you entered can't be used on this copy of Windows.  (0x80070426)    I didn't enter any product key     can someone explain to me what this means???Also didn't understand with returned order stated   \"apps being used as programs\"?????    I don't sync or use programs on my phone except for emails????    Thanks in advance if you can explain or help with fixWhen I tried to restore it said do want to go back to Windows 7....Never had windows 7   ","solutions":["Did you replace the motherboard yourself or it has been done by the manufacturer?Pre-installed version of Windows is OEM and it means it only could be installed on the current PC and when you change motherboard it is like you have new PC and you will need new license.If motherboard has been changed by the manufacturer, contact them and tell them about the issue.","Hi LisaBarber4 I'll try to help you on this issue. There is a lot of different things happening here, so let's break it down : - The Windows licence shipped with a new computer is an \"OEM licence\" (original equipment manufacturer). It simply means that the licence key is linked to your specific computer, and can't be transfered.- A \"digital licence\" is a \"non physical licence\". So you don't have a sticker with the serial number on your computer. The licence is stored in the motherboard.Can you explain further what is the current issue ? I'm not 100% sure to understand.I'll wait for your news Regards"]},{"symptom":"Xbox One controller won't connect via Bluetooth but fine on USB        I can plug-in my controller to my PC to update it and it see's the controller just fine.  I go and try and connect via Bluetooth and it doesn't find it.  I went and found the latest drivers for my PC and made sure they were installed and I have made sure the latest drivers for the controller are installed as well.","solutions":["Hi James, I would request you to execute the hardware and devices troubleshooter. a. Type “Troubleshooting” without quotes in the Search box and hit enter.b. Select “Hardware and Sound” from the Troubleshooter Window.c. Select “Hardware and Devices” under Devices option.d. Follow the On Screen instructions.Thank you.","I have the same issue, but the steps didn't help it ;\/","Hi Saulo,What troubleshooting steps have you done so far?We suggest that you verify if the controller's device drivers are up to date. You should also download and install any critical or important Windows Updates.If the issue persists, try connecting the controller through a different USB port, preferably, powered ports found on the back of the PC.Regards.","Patricia,As James Couhig said, it works through usb port. After searching a lot I notice that Dusk Shadow Controller doesn't have bluetooth... and because of that I can't connect it to the windows.I thought that because it was more expensive - like Dawn Shadow - it would have bluetooth too.I bought it just for that. I don't even have a XBox :(","For further clarification regarding your Xbox controller, it would be best if you get in touch with our Xbox Support.  Clickhere.","Hey, I don't know if it is too late. I found a way that worked for me. Yes, Windows 10, that anniversary update,  the Xbox One Controller that has Bluetooth capacity.1. Go to \"Control Panel\".2. \"Add devices and printers\".The controller should show up. No PIN, No connecting but never connect.I have been using the add the device in Windows 10 settings that never worked.Hope that helps.Cheers,Kai","Wow,I bought the Xbox One Wireless Controller 4 weeks ago and have not had any success connecting to my Lenovo Y50 gaming laptop. I searched forever. All the forums and Microsoft instructions are wacked and did not help me connect with Bluetooth.You are right in that the Bluetooth settings did not work. It doesn't show up as an option to pair. Even after all my drivers are updated. I simply went into \"Add devices and printers\" and bam, weeks of frustration gone!!Thanks for this simple resolve!!!!","Ok I feel silly now. I have been trying and trying with this to no end. I have been following the \"Add Bluetooth Device\" instructions and they simply do not work with my ASUS BT400 dongle. I happened upon this forum by accident and PRESTO!  to the Microsoft Moderators.... Can we please have these steps added to the Basic XBOX One S Controller Forums?? Apparently not all BT Dongles are accessing the services the same way, and trying to add it as if it is a BT device is not working. However by going through Add Device it does work.... To Kai --- Thank you very much for sharing your knowledge and experience on this forum!","Hey, I don't know if it is too late. I found a way that worked for me. Yes, Windows 10, that anniversary update,  the Xbox One Controller that has Bluetooth capacity.1. Go to \"Control Panel\".2. \"Add devices and printers\".The controller should show up. No PIN, No connecting but never connect.I have been using the add the device in Windows 10 settings that never worked.Hope that helps.Cheers,KaiThis worked! After hours of searching on how to get my controller working without spending another $25 on an xbox adapter, you have provided the solution. Thank you! I can now connect my xbox one s controller via bluetooth to my PC. If its still not working for anybody, remember to update everything, and then restart your PC. Then do the instruction in this post, and viola. Flawless. This should really be a much simpler process though, what the heck, Microsoft? I think they just want you to spend money on their stupid adapter. Commenting to give this thread a bump in the hopes it shows up further up on the google search","Kai, you rock! Struggled with MS's instructions for adding \/ troubleshooting, but nothing worked. Your solution worked like a charm. Thank you for posting!"]},{"symptom":"new Iso windows 10 installation disc        Hi i have just had issues doing a fresh install of my windows 10 from my iso disc i made dated 2015 I did have a second copy dated 2017 and this has worked Now i would like to make a fresh installation disc and USB bootable drive but cant seem to find the thread or post from years ago Please can someone link me to; 1, Where to down load a windows 10 OS 2, How to make an ISO disc and USB driveAs i have forgotten how to do everything and all this will be for the next time i have to do a clean install on my PC Thanks  ","solutions":["Hi GT60 , you can reinstall Windows 10 at any time, you will not need a Product Key, activation will be automatic and it will not cost you anything !Click this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), you can create a bootable USB flash drive (min 8GB) using that toolThen, Boot your PC from the Installation Media you just created (change Boot Order in your BIOS) to begin installing Windows 10Since you previously had Windows 10 installed and activated on that PC during the installation process skip the steps which ask for a product key and select the option 'I am Reinstalling Windows 10 on this PC', and activation will not be an issue, your PC will have a digital entitlement stored on the Microsoft Activation Servers Make sure you install the same Edition of Windows 10 (Home, Pro . . . etc.) you previously had installed to avoid Activation issues"]},{"symptom":"Movies & TV downloads stuck at pending        I've been trying to download a movie all morning but it continues to say pending. I've tried updating all my apps as well as resetting the Windows App Store but nothing seems to work. ","solutions":["Hey there User1, Evan here an independent adviser hopefully I can assist you. First follow this link which will guide you on how to reset the Windows store cache:https:\/\/www.thewindowsclub.com\/reset-windows-st...If that above fix does not work you will attempt to reset the Microsoft Store. Via Settings>Apps>Microsoft Store> Advanced Settings> Reset store.Please let me know if this above fix works. If so I'd appreciate the question being marked as resolved if that's not too much trouble!"]},{"symptom":"windows 7 computer ignores LAN        My Dell laptop has run well for years, with the help of occasional help from this website.The latest issue prevents me from getting on the net from the den where I use the laptop.Click on \"Network\" and it says \"this computer is not connected to a network\".Try to connect shows the 5 vertical bars with a red X. \"No connections are available.\" Two othervisitor laptops have no problem using it. A related problem is that I can't use the USB 2.0 wire between the laptop and the desktop.Any help is appreciated.","solutions":[]},{"symptom":"Safely Remove Hardware icon        I cannot display Safely Remove icon on my taskbar. It is turned on in Settings\/Select which icons appear - but does not appear. It is not showing in Hidden Icons.??????","solutions":["Hi, What devices do you have connected? Safely remove hardware will only appear when you have a USB device mounted to access it's storage.","Apple iPhone","is the device is accessible in FIle Explorer when connected?","Apple iPhone 7","That doesn't answer the question, are you able to see files on the device when it's connected via usb in file explorer? You may only be able to see photos depending on the iPhone's software version.","Yes (via This PC)","Hi pictureattacher,Open Settings >> Personalization >> Taskbar >> under Notification area >> Click select which icons appear on the taskbar.In the below list, Kindly turned on for the Windows Explorer \"Safely Remove Hardware and Eject Media.Make sure to trust a computerConnect your iPhone, iPad, or iPod touch to your computer or another device.Enter your passcode, if you have one, to unlock your iPhone, iPad, or iPod touch.If you want to allow your computer to access information on your device, select your device in Finder and click Trust, or if you're using iTunes, click Continue.On your iPhone, iPad, or iPod touch, confirm that you allow your computer or other device to access your data. If you don't want to trust the computer or other connected device, tap Don't Trust on your device. If you want to trust your computer, tap Trust.Hope this helps you.Regards,","Thank you for your help.(No need to reply).","Hey PA. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Guardian Moderator here to help you.In Version 1809 they changed Safely Remove to no longer be the default for plugging in USB storage devices (phones never were). In order to change it back see the steps here:https:\/\/www.techspot.com\/news\/79551-windows-10-...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","this did not solve my problem.  I hit yes rather than reply. My device is accessible in File Exlporer"]}]}