{"windows":[{"symptom":"[0802\/092935.154:ERROR:crash_report_database_win.cc(469)] failed to stat report        [0802\/092935.154:ERROR:crash_report_database_win.cc(469)] failed to stat report","solutions":["Hi Chasity Does that text appear in a file called debug.log and if so, do you have the Chrome Browser installed on your PC?","the answer to both questions is yes","the answer to both questions is yes I also have both.  And I have uninstalled google chrome, restarted my computer, and then reinstalled chrome.  Still popping up","Hello. I am not seeing an answer to this problem. See quote from debug file[0826\/183226.436:ERROR:crash_report_database_win.cc(469)] failed to stat report","the answer to both questions is yes I also have both.  And I have uninstalled google chrome, restarted my computer, and then reinstalled chrome.  Still popping upI finally found an answer to this issue.  It involved totally removing all traces of Google Chrome from your system, including all files, folders, and registry entries and then reinstalling Chrome.  Once I did this, the issue was resolved and has not returned.If you go to this link:  https:\/\/www.totaluninstaller.com\/program-uninstall-center\/uninstall-google-chrome\/and follow the instructions under Way 2: Remove Google Chrome & Leftovers Manually, you will remove all traces of Chrome.Be forewarned, this method will involve having to edit your Windows 10 registry and is not for the faint of heart.  I would strongly advise that you back up the registry before doing this in case you have problems.  You may even want to create a system restore point first (just in case).  I trust this helps anyone still struggling to resolve this particular error.","You are right. This solution is not for the faint of heart or even for someone who is reasonably comfortable being their own IT. Is there really no other way? ","I hit the reply button too soon. What is the down side of leaving this issue alone. So far I am only getting the debug reports and operations are otherwise unaffected.  Is this just a matter of Microsoft not getting along with Google Chrome?","Downside is the irritation of seeing the error and the debug log file.  Doesn't seem to really interfere with performance, it's just that darn file appearing all the time.You could try downloading the Uninstaller program on the link that was provided, though I have not tried that, so can't affirm that it will really work.From the research I did at the time, this was the only way I could find that actually made the problem go away.Your call, good luck!","Another option that just occurred to me is to download an uninstaller program.  Do a search for free uninstaller and see what you can find.  I know there are a number of them out there.  Make sure it's free, and make sure it will remove all traces (files, folders, and registry entries) of the program in question, in this case Google Chrome.Good luck!","Ok thanks for the info! I'm going to think this through for a bit. Will report here if I am successful! :)"]},{"symptom":"Problems updating to 1909        I'm still having trouble trying to install this update.I tried the update thinking about the configuration (update and security), with the Windows 10 update wizard.Any help would be highly appreciated.","solutions":["Hi, Scottjones258 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.If you have problems updating Windows, follow these steps: If you have a third-party antivirus, you must disable or uninstall it. Try reset Windows update components: Right click on the start button and select Powershell (admin) or Command Prompt (admin)Write the next hit enter after each line. net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Restart and try again. You can also download the Windows Error Solver: https:\/\/support.microsoft.com\/en-us\/help\/10164\/...https:\/\/aka.ms\/wudiag You can do it manually by downloading the Windows ISO. When updating with the ISO, disconnect the Internet. https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"External Second Monitor not detected after Bios Update        Hello All!I have a new HP Spectre x360 convertible laptop and a Dell s 2740 external monitor.I restarted my machine and the bios updated happened automatically. Once it happened, I could not use my Dell monitor at all.It says \"there is no signal coming from your computer. Bla bla bla ………\"Steps taken- For now, I have uninstalled the display driver and reinstalled it after restarting. Changed HDMI cable and USB-c hub.Does anyone know the resolution? Please help!Gaurav","solutions":["Hi Gaurav. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.First let's try fixes for second monitor not detected: https:\/\/www.windowscentral.com\/how-fix-your-sec...https:\/\/www.kapilarya.com\/fix-windows-10-doesnt...https:\/\/www.thewindowsclub.com\/windows-10-canno...Are you sure this was a BIOS update as it would normally only come from HP and give you clear instructions because a power cut could brick the motherboard until the chip is reimaged at factory? The reason I ask is that if there were other drivers updated by HP, or Windows Updates, then we can roll them back or do a System Restore to a point before this, to normally solve the problem.If you'll reply back with more detail I can guide you further. I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"full screen | device | desplay adapters        hi so pls guys I really need your help first of all sry but my English isn't that good so i'm sorry now please u have to watch this video to understand my problem the video : https:\/\/www.youtube.com\/watch?v=8D4jULwdl_8&list=UU8r6TY8a5-c92lpohgubBSA&index=1also u should know that this problem happen to every game ( when I play a game in full screen mode )  another video about the problem https:\/\/www.youtube.com\/watch?v=H7ycglrTus0&list=UU8r6TY8a5-c92lpohgubBSA&index=2__________________so now after u see the problem I was searching about the problem and I've talked 2 a lot of people and I guess I know why it happen 2 me | the problem happen cuz of display adapter > my GC device  when I change it to disable every game works but the problem is that my fps drop to 10 and when I enable my GC device I get the problem again so what should I do ? I already uninstalled and installed my device but it didn't work pls any help >< ______________this pic will explain more ","solutions":["Hello NoorAldeen, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemSince you have only one display adapter, it won't help much if you disable it. once you disable the display adapter, you are using Microsoft basic display driver.To solve this issue, you should Upgrade your Intel driver to the last version. which can be auto detected and found in this link from Intel:https:\/\/www.intel.com\/content\/www\/us\/en\/support...download and install the last version, upgrade also Chipset drivers and other Intel drivers if found. then restart your PCDisclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let me know how it goes Farah","i already have the last version :( ","Hello NoorAldeen, Can you please type display settings in Startmenu and open it, scroll down to advance Display settings, then display adapter properties.There you can find in Monitor tab, a refresh rate. see whats is available and try to change it to another one as a test.","just 60HZ i think that i should talk 2 microsoft but the problem is that i cant find their e-mail so if u have microsoft e-mail please tell me and thx :) ","sorry but I don't have the Support contact information, I hope you cna find a suitable solution in your caseCheers!"]},{"symptom":"Why can't I delete Connect?        I scroll down Start Menu and come to a file named Connect.  I don't need it how can I delete it?","solutions":["Can you give us a screenshot of this?","Hello KCav45, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemThis app is installed per default, and can not be uninstalled. it is used to cast your PC screen to another wireless display or a TV that supports Miracast.Can you share why do you want to uninstall it? it doesn't take much of a space and does not work in background as well.Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolvedCheers! Farah","How can I uninstall Connect?","It's part of the build.  and don't worry it doesnt do anything unless you want to project your screen to a TV or Projector.  ANd then it is very useful","If you still want to remove it, there's a workaround to do so, but I must say it's not officialPlease check this link: https:\/\/winaero.com\/blog\/how-to-uninstall-and-r...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"On Screen Keyboard        On screen keyboard will not turn off. Toggle is set to off. ","solutions":["Hi Ken Do you use the on-screen keyboard? Do you just want that to hide when not in use or do you want to disable that permanently","No, I don't use it. Just want to hide it. "]},{"symptom":"Windows 10 upgrade problems        HiI have used MS OS's since 1980 and currently have 2 laptops, both Toshibas-my favourites, and I have upgraded 1 ofthem to Windows 10 from Windows 7 Pro with no problem (=a Toshiba TecraR700) but the other my trusty Toshiba A100 Satellite (PSAA8C-OFHOOE Intel Centrino Duo...originally running XP then upgraded to 4gb memory and a 100gb SSD andrunning Windows 7 Pro), for the past month I keep getting a critical errormsg and the upgrade does not complete and then reverts to former state ofWindows 7 Pro...)  This laptop has 3x or more of all of the minimum Win 10 specs. and passes all the Win 8 upgrade assistant report tests.I have emailed Toshiba reps and they have no updates or info on pre 2010 laptops...From my research on Windows 10 upgrade forums, it seems I need to upgradethe Bios and Drivers to the latest versions but when I go to the Toshibadynabook Canada support site for my model originally it lists updates forA105 but not A100 ?So my 4 -?'s are:1 -Which Bios update is correct and most current for my Toshiba A100PSAA8C-OFHOOE currently upgraded to-running Windows 7 Pro?2 -Should I download and run an XP version even though I am running Win 7(as no Win 7 versions listed ?) so which Bios version ?3 -Do I then later also need to again upgrade Bios and Drivers to Win 10versions once I get it installed and running ..?.4 -.or can I upgrade the bios and drivers to Win 10 bios & drivers firstand then do Win 10 OS upgrade ? (I don't think so???)Any advice ASAP would be much appreciated ...as you are probably awareWindows 7 support is ending shortly and I really need to keep both theseToshiba Laptops working as I use both these Toshiba Laptops to assist in at-riskyouth robotics programs with local schools since I retired from the Ontario Science Centre.Thanks and Best Regards for a Great Day !Blair ","solutions":["If you post cell numbers here, SCAMMERS may start ringing you.As it came out with XP, it may not be suitable to install 10 on.Any BIOS upgrades, any Windows 10 drivers; that all comes from Toshiba.If they don't support Windows 10 on that model...........................@@@@@@@@@@@@@@@@@@@@@@@https:\/\/support.dynabook.com\/driversFirst thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Toshiba - Models tested"]},{"symptom":"how to type command to cortana instead of speaking        Sometimes it is easier and faster by typing command but it seams Cortana will not respond my command.For example, if I type \"set a reminder at 11 am\" in the Cortana search, it will just bing search what I just typed instead of setting that command?Any idea how to solve this problem?Regards,Vricc","solutions":["Hi Vricc My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.Cortana is currently a digital vice assistant, so, keyboard commands are currently not supported.If you would like to see this improved: I would also recommend you submit a feature request; send me the short link so I can vote on it and bring it to the attention of the Windows engineers.https:\/\/windows10.help\/blogs\/entry\/54-how-to-su...Information in the above link is sourced from a trusted Microsoft MVP blog.","Same problem here. I used to be able to hit Winkey-S and type something like \"Remind me to head to the gym at 7 pm\" and Cortana would set the reminder. This recently stopped working, I just get a bing search suggestion. I did recently update to Win10 version 1903, but I'm not sure if this is exactly when things broke. Does typing reminders in the search box still work for any other people on 1903? ","Search and Cortana were separated in v1903. As a result, it looks like typing a command was removed since clicking the Cortana button jumps straight to microphone.","Search and Cortana were separated in v1903. As a result, it looks like typing a command was removed since clicking the Cortana button jumps straight to microphone.MS did indeed disable the Cortana search box altogether, only allowing speech interactions after pressing the Cortana button. But: iirc it still used to be possible to hit Winkey-S to bring up the search box, and type a reminder command. That no longer works for me. Personally I'd like to know if anyone on 1903 can still type a reminder to Cortana using the search box. To test (assuming you're on 1903), hit Winkey-S and type   remind me to answer forum post at 9 pm   and hit enter. Does it generate a reminder, or do a web search?","I cannot. I can still do stuff like quick calculations or currency exchange, but Cortana commands are completely gone from the search box.","I cannot. I can still do stuff like quick calculations or currency exchange, but Cortana commands are completely gone from the search box.Thanks for checking! Well that certainly sucks, assuming this is indeed gone for all 1903 users.. I used to type at least one reminder daily. Oddly on iOS you can still type to Cortana by hitting the six dots to the right of the record icon.I wonder how many cubicle workers enjoy speaking their reminders out loud! I'm guessing the use of Cortana for reminders is about to take a hit. ","I cannot. I can still do stuff like quick calculations or currency exchange, but Cortana commands are completely gone from the search box.Update, turns out at least one user was able to get Cortana to respond in the new standalone search box, see the screenshot inthis post on tenforums. So now I'm confused. That's exactly what I would want, but it stopped working for me. I guess Entegy and I are unlucky, anyone else here have more luck in getting Cortana to respond to typed queries?","   WHY have they stopped K-board commands to Cortana  in the 1903 update ?       I cant be talking aloud to it  in the music  studio  :-(","   WHY have they stopped K-board commands to Cortana  in the 1903 update ?       I cant be talking aloud to it  in the music  studio  :-(Interesting scenario, yup, in that case typing would definitely be better. As a side note, on another machine that's still on 1809 I _also_ cannot type to Cortana via the search box anymore, so maybe it's a recent back-end change rather than a 1903 change? ","many Tk's for Yr reply    :-) Ill not be using Cortana any more !    ;-("]},{"symptom":"Huge problem with Microsoft account and Microsoft store        My 11 year old son has autism.   He requires a laptop for school work We got him one at Christmas and set him up with a Microsoft account and email so he can email his work to school It's turning into a nightmare. It's requiring a password and pin to turn it on all the time something to do with Microsoft hello even though hello is not on laptop.  It just bluescreens until we set up a pin.  Secondly we purchased Minecraft as a Christmas present.  It won't let him play.  Kit states it is to do with his Microsoft account settings I have spent hours on the phone to them with them logged in remotely and they can find nothing in his settings to warrant the requirent of a password and pin to log in or anything in his account settings to prevent Minecraft working either.   They put through a refund request for the game but now I just got an email saying the refund was being refused with no reason.This is absolutely disgusting from them.   This is also a disabled child who can't use his stuffHe said to me mummy Steve Jobs has the same thing as me ADHD and ASD so why does he make things so difficult to me.  He should make things easier not harder  Moved from: Outlook.com \/ Personalization and ease of access \/ Other","solutions":[]},{"symptom":"New Laptop w\/Windows 10, Slow USB 3.0 Transfers to USB Drives        Hello,I have seen a number of similar posts over the past few years, but not a solution that I found that worked for me.  I have a brand new HP Probook and found that transferring data to USB 3.0 hard drive or even a memory stick is very slow to the point where the OS can freeze.  My backup software will not run a backup and I cannot copy large files TO USB media.  I can copy from USB drives to my computer without an issue.  I am seeing speeds like 5 MB\/s and time estimates of \"calculating\".Computer is brand new.  I downloaded the current BIOS and drivers.  I have removed the USB Root Hub and Controllers.  Also tried reinstalling the chipset drivers.  Disabling indexing doesn't seem to change anything.  Changing the drive policy from fast removal to performance did help, but it still has pauses in the file transfers and I shouldn't have to do this with every drive I ever connect.Drives work on other computers.  Not sure what else to try.  HP support tested the USB port in BIOS and said it was a software issue.","solutions":["Hi Mike. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.If you've uninstalled the external Disk drive and all USB controllers in Device Manager, then restarted to reinstall them, then what's left to try is to move the data off the drive to a folder on Desktop, confirm it all copied by size in Properties of source and copy, then wipe the drive with Diskpart Clean Command and reformat in Disk Mgmt following these guides:https:\/\/www.tenforums.com\/tutorials\/85819-erase...http:\/\/www.wikihow.com\/Format-an-External-Hard-...To be extra cautious I'd also run the manufacturer's diagnostics (or Seatools if none) on the drive after cleaning it, and run Disk Check after formatting it:http:\/\/www.tacktech.com\/display.cfm?ttid=287Disk Check: https:\/\/www.groovypost.com\/howto\/check-hard-dri... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","This is occurring with both my USB external hard drive and USB memory stick, both of which work on my previous computer so am confident there is not an issue with the external drives, cables, etc.","Update your drivers and BIOS\/UEFI firmware from the HP Downloads web page here:http:\/\/support.hp.com\/us-en\/drivers using the full model number on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.Did you move the data off to wipe and reformat the drives? This will often work if updating or reinstalling the drivers does not.If none of these work then it may be something more serious with the USB controllers. Did you try all ports and is the behavior the same with the USB2 and 3 ports?"]},{"symptom":"windows 10 System Startup record corruption        The last time I used my desktop pc the system hung during what I think was probably a system update in background. I couldn't get to the task manager to close it down and had to manually power it down.  When I rebooted it the System Startup record appears to have been damaged. None of the Windows recovery options will work including the system recovery. I am looking for options that won't destroy my data and backup files on the system.","solutions":["Hi, LutherWelch My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"My touchscreen        I have an EVOO computer the one that turns into a tablet and one section of my screen just randomly went black a week after I got it. I have no way of fixing it does my warranty cover it because nothing happened to it. ","solutions":["Hi Jorja. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Can you navigate to the Device Manager reached by right clicking the Start button, or typing in Search box, to right click Uninstall Display driver (not the software) then restart PC to reinstall it?If that isn't enough go to the PC maker's Support Downloads web page to update the Display driver. While there check that you also have the latest chipset, BIOS, display, network, bluetooth, USB and all other drivers, compared to the ones presently installed in Device Manager reached by right clicking the Start button. If those don't help then it's probably a hardware issue so use your one-year included warranty to contact their Support via the same website.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved."]},{"symptom":"volume control for dell desktop computer        How do I get my volume control to work again?","solutions":["Hi Kim. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Which Volume control is not working - Windows from the task bar, the keyboard volume control - please be specific.See various fixes for Dell volume control not working: https:\/\/www.dell.com\/community\/Laptops-General-...https:\/\/www.dell.com\/community\/Laptops-General-...https:\/\/www.dell.com\/community\/Optiplex-Desktop...https:\/\/www.techwalla.com\/articles\/how-to-turn-...https:\/\/www.youtube.com\/watch?v=FPWei0h6Y8MIf that's not enough I'll give you all possible solutions for Sound problems in order of priority, so please try any you've already tried again in order. If you have any problems performing any steps I'll be standing by here to help you.1) Update the sound driver from the PC or device maker's Support Downloads webpage for your exact model, if it is newer than the one presently installed in Device Manager reached by right clicking the Start button. While there compare to make sure you also have the latest BIOS, Chipset, Display, Network and all other drivers. 2) Restore the Windows Audio Service which may have become disabled: https:\/\/www.tenforums.com\/tutorials\/57567-resto... 3) Next try these checklists: https:\/\/support.microsoft.com\/en-in\/help\/402699... https:\/\/www.howtogeek.com\/443702\/how-to-fix-sou...4) Right click Volume icon in System Tray, choose Sound Settings, from the Output and Input devices dropdown menus, choose then one(s) affected to see if that helps. If not use the Troubleshoot button nearby.5) Run the Playing Sound troubleshooter at Start button > Settings>Update & Security>Troubleshoot.6) Try rolling back the sound drivers in Device Manager reached by right clicking the Start button. Choose Sound controller and other audio devices, then Driver tab, then Roll back if available.7) If no newer sound drivers then uninstall the one presently installed in Device Manager, reached by right clicking the Start Button. Restart PC to reinstall.8) Try other and older drivers for your model Sound controller, too. For example, try the next oldest driver in the model's online Support Downloads list. To try all previous drivers installed on your system, in Device Manager choose Sound controller's Driver tab, then Update Driver, then Browse, then Let Me Pick. Finally, try installing the latest Sound driver in Compatibility Mode as shown here:https:\/\/social.technet.microsoft.com\/Forums\/win...9) If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 10) If this was caused by a Version update (which you can confirm at Settings > System > About) then you can roll back the version in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 11) You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... 12) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. 13) If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Probably need more information, but try each of these in succession and check after each one 1. a full shut down and restart2. Check for updates (click on the windows Icon, the gear icon, update and security) install any pending updates3. right click on the sound icon and \"Troubleshoot sound problems\"4. Search \"Device Manage\" in Cortana  expand \"Sound, Video, and game controllers\" right click and uninstall the audio device and restart your computer (it will reinstall the driver when you restart)"]},{"symptom":"what does a product key look like        what does a product key look like","solutions":["Is it a Retail, OEM System Builders or OEM preinstalled (Dell, HP, etc.) license and is it still activated?@@@@@@@@@@@@@@@@@@@@@The Product Key consists of 25 digits, divided into 5 groups of 5 digits and the layout looks like this:xxxxx-xxxxx-xxxxx-xxxxx-xxxxxThe 24 used are:2346789BCDFGHJKMPQRTVWXYThe 12 unused are:015AEILNOSUZ@@@@@@@@@@@@@@@@@@@@@If installed and activated and a Retail or OEM system Builders license and you have lost the product key that came with the purchase use these free programs:http:\/\/www.belarc.com\/free_download.htmlhttps:\/\/www.magicaljellybean.com\/keyfinder\/@@@@@@@@@@@@@@@@@@@@@If you bought it from Microsoft:Find your downloads and product keysMost software you buy directly from Microsoft Store as a digital download, like Office, Windows, and Xbox games, can be downloaded, installed, or reinstalled inorder history. Find the software and then selectProduct key\/Install.@@@@@@@@@@@@@@@@@@@@@If OEM preinstalled (Dell, HP, etc.) license:The COA sticker, which has the Product Key on it, is either on the underside of the Laptop or in the Battery Compartment.With a Desktop it is either on the side, rear or top of the Computer Case.Product Key finder programs do NOT find a useable product key on OEM preinstalled operating systems (Dell, HP, etc.)Key Finder Programs used on preinstalled Operating Systems only find the Manufacturer's Product Key which was used on multiple machines during manufacture and what they find is not suitable to use for a reinstall or activation problems.Cheers."]},{"symptom":"Windows 10 Admin Account was Removed; Can’t Do Anything! Not even CMD!        Windows 10 has caused me nothing but headaches since i first got it. And now ALL ADMIN ACCESS IS GONE?! Here is the problem:when i click ANYTHING to “Run as Administrator” a prompt shows up asking me to use the sign-in info to allow access.1. I am THE ONLY USER2. THERE IS NO SIGN IN OPTIONMeaning that the only button i am even being showed is “No”. No other options. I will repeat myself so there isnt any confusion THERE ARE NO OPTIONS OTHER THAN THE “NO” BUTTON.when i run CMD to attempt the Hidden Admin usage, i am denied access. I cant do a single thing. I have no admin access, i have no authority on anything, nor even the option to attempt a change!Extremely infuriated and would like this suffering to end","solutions":["Hi Bodegon, You might want to check this on how you can restore your Administrator Rights. https:\/\/www.isumsoft.com\/windows-10\/lost-admini...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Windows 10 has caused me nothing but headaches since i first got it. And now ALL ADMIN ACCESS IS GONE?! Here is the problem:when i click ANYTHING to “Run as Administrator” a prompt shows up asking me to use the sign-in info to allow access.1. I am THE ONLY USER2. THERE IS NO SIGN IN OPTIONMeaning that the only button i am even being showed is “No”. No other options. I will repeat myself so there isnt any confusion THERE ARE NO OPTIONS OTHER THAN THE “NO” BUTTON.when i run CMD to attempt the Hidden Admin usage, i am denied access. I cant do a single thing. I have no admin access, i have no authority on anything, nor even the option to attempt a change!Extremely infuriated and would like this suffering to endI have the same exact situation, live alone, only one on the computer. The second time it's happened in the last 8 to 10 yrs. Absolutely no reply from anyone at Microsoft. I'm an Insider with promises of assistance whenever I need it. Never not even 1 time have they come to help me. Sure wish I could help you.","This link did not help. I still do not have admin access, and now im stuck with 2 profiles instead of one. Neither of which have admin access","This link did not help. I still do not have admin access, and now im stuck with 2 profiles instead of one. Neither of which have admin accessif i understand the issue properly, it sound like you UAC is set to high.In the search bar, type in \"UAC\" (without the quotes), Select \"Change User Account Control Setting\".  In the sliding bar drag the pivot to the bottom, to \"Never Notify\".You need to be aware doing so will put you computer more at risk.Let me know if this resolved you issue.Thanks","This link did not help. I still do not have admin access, and now im stuck with 2 profiles instead of one. Neither of which have admin accessif i understand the issue properly, it sound like you UAC is set to high.In the search bar, type in \"UAC\" (without the quotes), Select \"Change User Account Control Setting\".  In the sliding bar drag the pivot to the bottom, to \"Never Notify\".You need to be aware doing so will put you computer more at risk.Let me know if this resolved you issue.ThanksI typed in UAC and was met with the same Windows Prompt i have been getting since the problem began. “To continue, enter an admin user name and password” There is no option to “log in”, the only option it allows me is “No”","Hi Bodegon, You might want to check this on how you can restore your Administrator Rights. https:\/\/www.isumsoft.com\/windows-10\/lost-admini...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards, Unfortunately, none of these have worked in getting me Administrator access."]},{"symptom":"My pc isnt recognising my D:\\ Drive        I opened up my PC and i went onto steam and it said that all of my games needed reinstalling. Then i clicked on them and it said that it could find disk space. Then i opened file explorer and i saw that my D:\\ Drive had a blue question mark next to it and i wasnt able to open it .","solutions":["Hi Archie Open Disk Management (accessible by right clicking your Start Button) Right click the partition on that drive and choose to assign a drive letter, assign a letter that is not in use like F and apply thatRestart your PC, check to see if that question mark is gone, then go back in and assign the letter D to that drive, restart your PC and Steam should see the games again . . ."]},{"symptom":"intel core i5 4690 on windows xp        Hello! Works intel Core i5 4690 on Windows xp","solutions":["Check at Intel: https:\/\/downloadcenter.intel.com\/Cheers."]},{"symptom":"Sticky Notes stuck 'Loading'        Have starting getting the issue where when you launch Sticky Notes it starts to load and does not open the app, just stuck 'Loading'.This was an issue a while back but I think was resolved with a later version of the Sticky Notes app.It is only happening on  Windows 10 1803 pc's (doesn't matter who is logged on) and our Windows 10 1903 pcs seem to be ok.Have tried most of the previous solutions suggested on this site, but none of them have managed to resolve this issue","solutions":["Hello! I am an Independent Advisor, I would love to help you out! The first thing I would suggest to do is to reset the note app. The only issue with this is that the apps data will be deleted. So before doing this you should backup any sticky notes files. They should be located here, one for each user:C:\\Users\\%username%\\AppData\\Local\\Packages\\Microsoft.MicrosoftStickyNotes_8wekyb3d8bbwe\\LocalState\\plum.sqlite (on Windows 10 version 1607 & a newer version). And then copy the files to another folder.After the reset you can copy the folder back to the original directory. You can find more information and instructions on how to do the reset here: https:\/\/knowhowtechnology.wordpress.com\/2019\/09...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Sorry, as mentioned I have been following the suggestions already posted by other people who have had this issue.Have reset already, and uninstalled\/re-installed","Hi there, I'm from the Sticky Notes team. This is a known issue that affects some machines which we're investigating. So sorry you're experiencing it. One possible workaround we have is to try right clicking the app icon in the task bar and hitting \"notes list\" when it is in this state. -Allie","I'm having the same issue. When I click on \"notes list\" though, I get \"the item you selected is unavailable. It might have been....\" errorI use my notes as part of my daily workflow, I need to get this working. I am using 1903","So sorry you're continuing to experience this. Another workaround I can offer to get you unblocked is our web portal,https:\/\/www.onenote.com\/stickynotes. What version of Sticky Notes do you have? You can tell this in the App settings in Windows.","I have version 3.7.71.0. I created a note in the portal but my local client still won't load, let alone sync.Thanks","Actually, thank you for this...I thought I had lost all my notes...glad to see them in the cloud!!!However, I am with Chris on the results...same version, reset the app, uninstalled, reinstalled...it is stuck on the loading screen...won't sync anything down","Same problem here. I have the problem only on my pc, while my laptop is just working fine with the sticky notes.I tried to uninstall, reset and install sticky notes again. Turned off my Kaspersky Antivirus (because i dont have Kaspersky on my Laptop and i thought that might be the issue), but all didnt give any good result. Both my PC and Laptop have Windows 10 Version 1909 installed and are currentyl up-to-date.I only noticed that my microsoft university account for microsoft office was blocked recently, because the one year subscription expired. But that problem affects both my PC and Laptop, so I am no sure if that leads to sticky notes to bug. I will buy Microsoft Office soon and unlink my university account and see if its goning to fix anything.Edit: I bought Microsoft Office and removed the faulty\/bugged microsoft account, but the problem with sticky notes still persists.","Same issue. Sticky Notes is stuck on \"Loading Sticky Notes\" - ver. 3.7.71.0 - OS Win 10 1903 - Surface Pro 7. I have also tried all the solutions presented here to no successful conclusion.","Same issue. 3.7.71.0. Win 10 1909. Stuck on loading sticky notes. "]},{"symptom":"Bought HP Envy Win 10 Home, denied to install Win 10 Pro with Volume Licensing Key        Against my better judgment I bought 2 HP Envy desktops with Windows 10 Home thinking it would be easy to format and reinstall Windows 10 Pro on them both. Now after working all afternoon on trying to update the drive it still installs Windows 10 Home using the USB startup drive that has worked on every other computer I've updated recently from Win 7 Pro to Win 10 Pro.When I enter our Volume Licensing Key into \"Enter a product key,\" I get the error \"The product key you entered didn't work. Check the product key and try again, or enter a different one. (0xc004f050)If anybody can please help me with getting Win 10 Pro installed on this new HP Envy, I would sure appreciate it. I'm tired.","solutions":["It's sounding more and more that it's not allowing an upgrade from OEM Windows 10 Home to Pro using a volume licence.There are options available to create USB boot media and add a small text file to specify the edition to be installed. At the moment when you try a clean install using boot media the OEM licence key is being read and installing Home automatically.Searching the web there is info about this process using a text file ei.cfg. You can read this for yourself herehttps:\/\/www.intowindows.com\/how-to-select-pro-edition-while-installing-windows-10\/You may feel better contacting Tech Support to verifyhttp:\/\/partner.support.services.microsoft.com\/en-us\/contactus\/windows\/tech-services\/"]},{"symptom":"installing Windows on new hard drive        The hard drive  on my computer crashed. I have a new hard drive but I don't know how to install Windows 10 on it once I put it in as it will have no OS. I had windows 10 on drive that crashed. How can I get windows 10 on new drive without having to buy Windows 10 again. Have a new computer which also has windows 10.","solutions":["Hi Rick, you can reinstall Windows 10 at any time, you will not need a product key, activation will be automatic and it will not cost you anything !Since you previously had Windows 10 installed and activated on that PC during the installation process skip the steps which ask for a product key and select the option 'I am Reinstalling Windows 10 on this PC', and activation will not be an issue, your PC will have a digital entitlement stored on the Microsoft Activation Servers Make sure you install the same Edition of Windows 10 (Home, Pro . . . etc.) you previously had installed to avoid Activation issuesClick this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), you can create a bootable USB flash drive (min 8GB) using that toolThen, Boot your PC from the Installation Media you just created (change Boot Order in your BIOS) to begin installing Windows 10"]}]}