{"windows":[{"symptom":"Ignorant Questions about Device Drivers in Windows 10 Pro        I need to list missing \"device drivers\" for third-party \"recovery environment builder\" software (ShadowProtect) that is designed to produce a bootable recovery-environment CD or USB key for restoring whole-system backups (stored on an external USB HD) to a new target computer (Lenovo P1 Gen 2 running Windows 10 Pro vs. 1909) in the event of catastrophic failure or hard-drive replacement.I'm running this builder software on the target computer, but the builder itself is a few years old and requires an older version (1607) of the Windows 10 ADK to create the restore process in the Windows PE GUI.  The recovery environment that the builder has produced does boot correctly and brings up the WinPE GUI but doesn't run properly because (I am told by the manufacturer) it's missing some device drivers needed for this relatively new machine.ShadowProtect has sent me to Microsoft and\/or Lenovo for help with this problem, which I don't fully understand.1) I'm too ignorant about Windows hardware drivers and how they are managed to accomplish this task. Can you point me to the background material that I need to understand the specific problem?2) Points below are PURE SPECULATION on my part.  Can you please confirm or deny these GUESSES?     a) In order for a \"device driver\" (apparently often one or more SYS files, perhaps including DLLs and maybe EXEs, judging from Device Manger\/XXXDevice\/Properties\/Driver\/Details) to be picked up and installed from an INF file entered into the builder's \"Additional RE Drivers\" box (if that's really what the builder wants?!), that driver must already be installed on the target computer.     b) Since the target computer appears to run the GUI version of ShadowProtect (under Windows 10, not from the recovery environment) just fine, it must already have the needed drivers installed into Windows.     c) Therefore the task reduces to finding and entering paths to the INF files that are ALREADY ON THE MACHINE, or at least the \"relevant\" ones.      d) Therefore, search the target machine for *.INF files in the C:\/ drive (the drivers may appear in various sub-directories TBD), weed out any not obviously relevant to hardware drivers, and add their paths to the recovery environment builder's \"Additional RE Drivers\" box.     e) No reference to Lenovo's Drivers and Software database should be required UNLESS the relevant drivers have somehow been installed on the target machine by some other means (disk image?) without local use of their INF files. That case would seem more difficult, and I don't know how to accomplish it without RE-INSTALLING such drivers with installers from Lenovo's Web site and then HOPING to find the INF files this time around.Any guidance on how to accomplish this task (whether or not my guesses are correct) would be most appreciated.  I'm far from a newbie on Windows but have never really understood the whole device-driver issue. -- JCW2 ","solutions":["UPDATE:  In the target Windows 10 Pro machine there are too many *.INF files in C: and even C:\\Windows to examine.  (There is no C:\\Drivers nor C:\\Windows\\Drivers directory.)In C:\\Windows\\System32 there are 1312 *.INF files!!  Still way too many, although a few are seem to have recognizable names.  Is there a way to search for files named *.INF thatcontain the word Lenovo (not that that would necessarily cover everything)?In C:\\Windows\\SysWOW64 (whatever that is) there are only 4, but none is appears relevant.CONCLUSION:  It seems that the approach proposed in my (2.d) above is not viable.  Maybe it really is necessary to start with the Lenovo driver database (specific to the P1 Gen 2) and just install everything that looks relevantover top of what's already on the machine?  (There seem to be only 23 or fewer of these that could be relevant.)Advice please. -- JCW2"]},{"symptom":"needing a free upgrade to windows 10        how do I get a free upgrade to windows 10","solutions":["Hi Ronald The free upgrade period to Windows 10 from Windows 7 or 8 ended nearly 4 years ago . .Well, that is the official line, however, a lot of users are reporting they can still upgrade to Windows 10 using their Windows 7 and 8 licence keys,so that would definitely be worth a try . . .","Hello Ronald, :-)You can still unofficially upgrade from a legally activated Windows 7 or Windows 8.1 to Windows 10 for free.https:\/\/www.tenforums.com\/tutorials\/139745-upgrade-windows-10-windows-7-free.html"]},{"symptom":"what do i do if my computer has a black screen with blinking underscore?        hello everyone, i need help with my computer.so two days ago i did a driver update on my laptop and then my computer randomly turned black with a blinking underscore. i turned off my laptop and when i turned it back on windows started, the welcome screen showed up and then the screen turned black with the blinking underscore again. i am in safe mode writing this. i tried to recover to an earlier time but when i start recovering blue screen of death appears every time i try to recover my laptop. i did the tests and it says everything is fine. what should i do? thanks.","solutions":[]},{"symptom":"pc freeze when i try to install a program        My pc freeze when i try to install icmarketssc5","solutions":["Hi, What is your OS Build version? To find out, Go to CMD and type winver"]},{"symptom":"File Server Cluster for hosting Service files        <p>We have a 2 node general use&nbsp;File Server Cluster (herein known as the file server cluster and running Server 2012 R2) with a number of roles configured and shares on each node.&nbsp;<\/p><p>One of these shares on a particular role holds the application files for services installed on three other servers (app servers also running Server 2012 R2).&nbsp;<\/p><p>There is a symbolic link created in c:\\ for each of the app servers which points to the share hosted on the file server cluster.&nbsp;<\/p><p><\/p><p>We are seeing issues with the services at random times of the day where they lock up. There are no errors listed in the failover cluster manager and any errors in the app server event logs do not point to an issue with accessing files.<\/p><p><\/p><p>I am not convinced that running three sets of application services from a shared drive via a symbolic link is really a good idea, however clever the File Server Clustering is I cant see it being able to handle something like this.&nbsp;<\/p><p><\/p><p>Has anyone come across a deployment like this or is this a recommended \/ supported deployment? As far as I can tell through my research since discovering this, it isn't mentioned.&nbsp;<\/p>","solutions":["Your question seems out of scope for these consumer level forums. I think you'll get better results asking in the IT Professional forums on Technet. I'd start here:https:\/\/social.technet.microsoft.com\/forums\/en-..."]},{"symptom":"Aktualizacja funkcji dla systemu Windows 10, wersja 1903 — błąd 0x80070002 - Win update error        Hi,I have a problem with my Win10 update. My laptop cannot update to 1903 version (error 0x80070002). I tried follow available solutions but none was working (manually update, deactivated anti vir, an so on).Can somebody help me, please?Robert","solutions":["Hi Robert, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Let us check the Installation log to find why the update failed. Please share the logs as mentioned in this article. You should use a File sharing service like Onedrive or Media Fire to upload files and share the link in the next reply.https:\/\/answers.microsoft.com\/en-us\/windows\/for...The Panther logs. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\PantherThe Rollback logs: These usually are created if Windows Update rolls back. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\Rollback[Only if the error code is 0xC1900101-0x30018] The Device Install Log from C:\/$Windows.~bt\\Sources\\Rollback\\setupapi\\setupapi.dev.logAs the log size might be large consider zipping before uploading."]},{"symptom":"Microphone barely picking up any sound        I have a Lenovo Ideapad L340 and use the built in microphone which is a RealTek , never had an issue with it. Talked with people using my laptop this morning, all good. Went out for lunch, came back and now it barely picks up any sound, nothing changed as far as I know, didn't even turn off my laptop. When I use the \"test\" option on the mic and talk the bar goes to maybe 5% at most, no one can hear me. Apps like discord and OBS aren't picking up basically any sound, you hear a low whisper if you pay attention. The \"get help\" app suggested I update the drivers, I did and restarted laptop after but it's still the same, audio trouble shoot says everything is working.Why is my input so low all of a sudden and how do I fix it please?Thank you","solutions":[]},{"symptom":"Virus and Threat protection        NOTICE:  After, installing 1909 update, Windows Defender, Virus and Threat protection, is \/ was \"OFF\".  IS this common?  Is this a bug?  NO MESSAGE appeared in my Notification Area.. ONLY, by chance, did I notice, and turn it back on.  I'd suggest.. AT ALL TIMES.. 'WHENEVER' MY virus protection is turned off.. BY DEFAULT... I 'SHOULD' BE NOTIFIED!  YOUR thoughts on this?","solutions":["Any 3rd party anti virus, security, cleanup programs ever installed on the computer?"]},{"symptom":"No audio output device is installed        Hello!I have a common problem: my Windows 10 has No Audio Output Device.System configuration:Lenovo Legion Y520-15IKBN (laptop)Windows 10 Pro 1909 build 18363.535;Current updates;Device manager shows these audio devices:High Definition Audio Device (driver version 10.0.18362.356)Intel Display Audio (10.27.0.6)ASUS Xonar U3 (10.0.8.2164)i.e. the problem persists even with an external (USB) audio device, recognized by the system.Solutions that have not worked so far:Audio troubleshooter (issues found: check audio device, nothing else)Rolling back driversUninstalling audio devicesUninstalling any audio-related devices, incl. the likes of bluetooth speakersUpdating audio drivers (from both built-in drivers and from manufacturer's site)Installing a generic audio device (installing a generic USB audio device does not proceed at all, and installing a generic Realtek device causes a BSOD)Do you have any ideas for fixing this?UPDATE (01.01.2020):I performed a sanity check on this issue. Sound works when I boot into Ubuntu live. Therefore, it is not a hardware problem, but a confirmed Windows problem.","solutions":["So the trick that finally did it was to perform a repair install. Detailed instructions can be foundat tenforums.com"]},{"symptom":"New PC Product Key        I'm building a new PC in a couple days and would like to know if it's possible to transfer my current windows product key thats on my current pc to the new pc.Also,I'll be putting the SSD that has windows on it from my current PC into the new one, will I need to wipe it and install windows again via USB? or will it work fine if I try to boot off the SSD that has windows installed on it.Thanks.","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,First, you'd need to identify if the product key for the windows 10 computer is either a retail or an OEM key.Normally OEM keys are solely embedded to one motherboard as they do not have transfer rights for other hardware, unlike retail keys which has transfer rights.For free upgrade licenses, the condition for these are relevant to an OEM key as the license is then considered a digital license once you upgraded free to windows 10.Under this link are reference to activation after hardware change https:\/\/support.microsoft.com\/en-ph\/help\/20530\/...","Does this mean I'm able to transfer it to my new PC?","A full version retail key, is a unique key purchased solely from either the Microsoft store or a certified Microsoft retailer.As per checking the attachment you've provided, your device may have been issued with a digital license which is embedded to the device's hardware as the product key embedded to the system is a generic or a default product key of windows 10.Here's a reference in regards to it https:\/\/www.tenforums.com\/tutorials\/95922-gener... Where did you get your license if I may ask?","I bought my PC off a friend, so I have no idea where he got the license from","Normally, systems which has been embedded with a digital license comes from either getting an upgrade version of the license from the Microsoft store or when it has been acquired from free upgrade period which was available in the past.I'd recommend considering obtaining a full retail license as these are secured keys for whenever you plan on upgrading your device or plan to transfer your licenseon a different hardware."]},{"symptom":"Error 0x80070005 when trying to download anything from Microsoft Store        Hello, yesterday I attempted to download Sea of Thieves via Game Pass Ultimate from the Microsoft Store.However, the download would give an error, code 0x80070005, after a few seconds following the \"acquiring license\" stage of the download.I've retried downloading the game multiple times, attempted to download other apps like Xbox Beta, and have searched for a solution online for several hours, but nothing that others have suggested so far seems to work.In fact, I even tried to download Xbox Beta from the Xbox website, but I was given error 0x80070005.How can I fix this error?","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command prompt DISM \/Online \/Cleanup-Image \/RestoreHealth Run these commands on the command prompt to restart windows update services net stop bits net stop cryptsvc net stop wuauserv net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start bits net start cryptsvc net start wuauserv net start msiserver After successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig 2. On the system configuration window go to the services tab 3. Tick on hide all microsoft service so that this won't be affected 4. Choose to disable all services 5. Next, go to the startup tab and on the window choose to open task manager 6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok 8. A prompt to restart the computer will show up, choose to restart This should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to download from the store again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo... 2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept. 4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","Gary,The second solution you provided seems to have fixed the issue!Thanks for your quick and helpful reply!","My pleasure Jason! Happy to help. When ready please mark the post which helped most as the Answer, to help others. A rating is also appreciated. :)"]},{"symptom":"Inbox tab on internet explorer        how do I remove inbox tab on internet explorer or at least disable it so it does not show up when I open Internet Explorer","solutions":["Hi Dianne, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Assuming you are talking about Internet Explorer not Microsoft Edge, remove the address entry in Home Page.Change your home page for Internet Explorer 11 https:\/\/support.microsoft.com\/en-us\/help\/17426\/..."]},{"symptom":"Problem with accessing Windows Shop, using microsft account and EDGE        Hi,1. I have migrated to win10 from win7 (dec 2019)2. All was fine but after the process I was not able:Add MS account in Activation setting (dialogue try again etc etc),Migrate local account (Admin) to MS Account (dialogue try again etc etc),When I tried add account for testing Windows program, the error 0x80190001 occurred,When I tried to open Windows Show, the error 0x80131500 appeared,When I try to use account for office ( have paid time period license) I was not able to bound to a new created account neither to the the first one used during license ordering.In few places it was 404 error when connecting to login.microsoft.comthe edge is not able to open any internal IP nor DNS address, local addresses work fineI think there is the common problem of all those issues. I spent days to find the solution:edge is reinstslledwindow10 migrate is made againip6 is on I was using wifi and Ethernet cards, Ethernet card driver i reinstalled to newest versionI checked with two internet providers and modems with ip6 enableddns is set to 8.8.8.8 and 8.8.4.4I made clean restartI stopped third party firewall and ant virusI red tons if hints nothing made to it working. I cant make clean installation of window10 I have too much to be installed.Please help.Greetings,Krzys","solutions":["Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.Please make sure Windows Update Service is set as Automatic Startup.Go to services.mscLocate Windows UpdateDouble tap on it.Make sure the Startup of the service is Automatic.Restart the PC and check.","Hello Arif,Thank you for the reaction!!!I forgot to say that of course I have checked during my fight.  I would like to mention that Chrome, FF both works ok concerning internet.In my opinion the problem is that for some reason win10 is not able to connect to any external address (this is why edge doesn't work but IE works ok).  But there is  one funny issue: when I try to connect to MsOfffice and I give improper login there is the response (can't connect...), but when I give proper user name there is the error: \"try later\".I checked the log events and I see that there is error to connection to windows site ( no response ). When I use the same url in Chrome or in FF all is fine. This is url from store access:https:\/\/storeedgefd.dsx.mp.microsoft.com\/v8.0\/callerspecificdata\/?market=PL&locale=pl-PL&appversion=11912.1001.0.0&deviceFamily=Windows.Desktop&deviceFamilyVersion=2814750970478592&catalogLocales=pl1583Cen-US1583Cen-AU1583Cen-AG1583Cen-AI&oemId=Public&scmId=Public&moId=Public&hardware=arm01583Carm6401583Cble01583Ccmb01583Ccmf01583Ccmr11583Cdcb11583Cdcc11583Cdx911583Cdxa11583Cdxb01583Cgyr0Please help since otherwise I will have to migrate back to win7, which is bad as well.Kind regards,Krzys","Hello Krzys, I am Andrew an independent advisor. Please reset your DNS to Automatic, this may have been your problem all along. Be sure IP address is automatic as well. We're also going to flush your DNS. To do this type cmd in to the search, right click Command Prompt and open as administrator. To flush type \"ipconfig \/flushdns\" without quotations.Do this and get back to us what the result is. Andrew","Hi Andrew,Thank you for the answer:1) I set back DNS to automatic2) I flushed DNS using the command.I would like to add that EDGE doesn't work with external IP address as well with internal no problem.  So I think the problem is much more general, I'm not able to communicate to any external address using MS infrastructure. Since if DNS doesn't work I should be able open some web pages in EDGE using ip address. CHROME and FF both work fine. Any idea?Krzys","Lets test something. Open edge, in the address bar insert this IP address and see if google opens. 172.217.165.4Ping the address within the command prompt as well. \"ping 172.217.165.4\" is all you need to type.","In Egde no entering the page, error page, in cmd all works fine.C:\\WINDOWS\\system32>ping 172.217.165.4Pinging 172.217.165.4 with 32 bytes of data:Reply from 172.217.165.4: bytes=32 time=109ms TTL=50Reply from 172.217.165.4: bytes=32 time=109ms TTL=50Reply from 172.217.165.4: bytes=32 time=110ms TTL=50Reply from 172.217.165.4: bytes=32 time=109ms TTL=50Ping statistics for 172.217.165.4:    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),Approximate round trip times in milli-seconds:    Minimum = 109ms, Maximum = 110ms, Average = 109msC:\\WINDOWS\\system32>EDGE:Hmm... nie można nawiązać połączenia z tą stroną Sugerowane rozwiązanieUpewnij się, że używasz poprawnego adresu internetowego: http:\/\/www.google.comWyszukaj „http:\/\/www.google.com” w przeglądarce BingOdśwież stronęSzczegóły Zgłoś ten problem (in polish :) )Krzys","Can you download the new Edge Beta and use that, see if it gets around this perplexing issue. You can download it here:https:\/\/www.microsoftedgeinsider.com\/?form=MO12...It's quite stable for a beta. I want to see if it's Edge itself thats not working or something within Windows. FF and Chrome work you said, we can ping an outside source just fine. I don't think Windows has any issues.","Of course I will do it, but I think one of the windows layer doesnt work properly if all other tools works fine. Please notice that when I try log into office and I provide improper login (url) I have the message that login name is not found but when I provide a proper one after the while it is the same message like in Windows Shop or in changing local user to MS one. I will let you know how it a Beta of Edge works. But I think source of the problem is somewhere \"below\"Krzys","Funny A new Egde (beta) works fine. So it means A new Edge is on the higher level of system than the old one. But of course Edge is not the goal in this problem, since I'm not able to use my MS account and I'm not able to access Windows Shop (of course I can live without it if there is other way to access shop ;) ).Is there any idea how to solve problem of accessing windows account inside the Win10 after the migrate.. Please help me. And thx for the effort until now. Thank you.Krzys","When I try make synchronization of my data in new Edge I have the same error 0x80190001 like in shop.Krzys"]},{"symptom":"Resetting windows 10        Can anyone tell me how I can reset windows without going in settings... Cause I'm unable to open the settings and all other applications. I don't know what happened, may be a third party malware remover messed up my pc which I've installed earlier.","solutions":["Hello Tejasj142,If you like, you could use option one in the tutorial below to reset Windows 10 at boot instead of from Settings.https:\/\/www.tenforums.com\/tutorials\/4130-reset-windows-10-a.html","Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,I would recommend going into the windows recovery environment to process the reset of the systemYou may access the page by going to the sign in screen press and hold the shift key and press the on screen power button to choose the restart. It will then reboot and direct you to the windows recovery environment.Another alternative is, Start your computer, once the computer goes to the windows logo screen press and hold the power button for 5-10 seconds to shut it down completely. Do this for 3-5 times to force access the recovery environment.Upon successfully accessing the windows recovery environment go to, Troubleshoot - Advanced Option - Reset this PC Alternative to reinstalling windows https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/support.microsoft.com\/en-in\/help\/400073...Let me know how it goes. :)"]},{"symptom":"internet download manager             Hey...why is it when I try and download something of chrome or explore the laptop says idm not registered","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,I've had this issue before and it is most likely that the third party application (internet download manager) is looking for a way to be enabled on the browser.You may choose to enable the application from the browser's add ons or plug ins, otherwise you may choose to disable the third party application for you to download files\/programs normally as it should.Under this link are information on how to enable\/disable browsers from internet download managerhttps:\/\/www.internetdownloadmanager.com\/registe...Let me know how it goes. :) _______________________________ Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","thank you very much ...but the problem is that i do not have those options on the link  it says i have to enter my email, name , serieal number ..then it shows me a link that sends me to site where i have to buy some idm thing .","Thank you for the information. The pop up normally shows up if you are not currently on the software's subscription. Have you tried uninstalling internet download manager?"]},{"symptom":"Cant use offhand in minecraft.        I recently downloaded minecraft windows 10 edition and can't put any items, but shield in my offhand. Can you help, please?","solutions":["Hi TheGamerGo, How to equip something to your off-hand The off-hand slot is highlighted on the bottom-right corner of the player avatar.In the inventory, there is a slot on the bottom-right side of the player avatar that looks like an outline of a shield. This is called the off-hand slot. When you put something in it, you should see it being held on your off-hand (your left hand on default). Your other hand should also appear on the screen in first person view (you should see two hands on the screen). You should also see an extra slot with the off-hand item appear beside your HUD hotbar; this should be on the opposite side of your main hand.For easy equipping to the off-hand slot, press F by default. This is configurable in the Controls settings. Using this, you can quickly equip something into your off-hand slot in your inventory and switch between the items in your hotbar and off-hand. Practice using this key until you are able to fluently swap between items in your hotbar and your off-hand.Source: https:\/\/minecraft.gamepedia.com\/Tutorials\/Dual_... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"Where do i find the settings button        I need to change my pin and it directs me to settings\/ accounts\/ sign in options but I dont know where to look for this! help!","solutions":["Hello MaricruzGonzalez1, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemtype sign in option in start menu, and you'll get the direct sign in option window.regarding setting. you can right click on windows start menu and you'll see it. Cheers! Farah"]},{"symptom":"photos not opening        My photos are not opening. It keeps on displaying file system error -2147219196","solutions":["Hi, Chris025 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Best way to reinstall windows 10?        If this is the wrong forum, please direct me to the right one, thanks!Hello!A few months ago I discovered that my desktop PC hasn't been updated since October 12, windows update gives a 0x80080005 error, and windows defender is nowhere to be found (the security window in settings is blank)You can read all about it here: https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/update-error-0x80080005\/ecb78662-9653-41a9-8062-438c4bb3470f?page=1Anyway, back then I came to the conclusion (together with someone from tech support chat) that I should just reinstall windows, but back then I couldn't do it because I was in the middle of an important project.Now that i'm towards the end of it, I can do it soon.So, which way you think is the best way to reinstall windows? because I noticed there are several - I think there are 2 options from the settings menu? and more if I download the tool from microsoft's site? and I understood there is a way to do it that lets me keep all my programs and drivers? (reinstalling them all will take time so if there's an option for that, which works good, i'd rather choose that)Which way would you recommend to reinstall windows?Thanks!     ","solutions":["Hi, if you download that tool, you can create a Windows 10 ISO, then double click the ISO from inside File Explorer, and run setup.exe that will allow you to perform an in place upgrade, while keeping your files and apps, that would be the best method, because if you clean install Windows you would need to reinstall your applications","If you use the Media Creation Tool http:\/\/www.microsoft.com\/en-us\/software-download\/windows10 you can create boot media (8GB USB) but in this instance just run it from your current install using File Explorer. This should update you to the latest version, 1909 by opening the USB drive and running setup.All files and programs will be kept and you will get confirmation about this during the update.As a note you should have a backup of your personal files just to be sure.","Hi, if you download that tool, you can create a Windows 10 ISO, then double click the ISO from inside File Explorer, and run setup.exe that will allow you to perform an in place upgrade, while keeping your files and apps, that would be the best method, because if you clean install Windows you would need to reinstall your applicationsThanks! (and also thank you neilpzz, I couldn't quote you here for some reason)I was asking because I understood that some people actually recommend a clean install? that choosing to keep programs and files may cause problems? anyway if that's legit then great.And obviously, i'll backup the important things.","Hi ItayO To be honest, a clean install is the best option, but you implied in your original post that you did not want to have to re-install all your software, so an in-place upgrade would be the next best optionIf it was me, I would go for the full clean install, yes that will take more time and all software would need to be re-installed and all your personalized settings would be lost, but that would result in a really clean and responsive operating system . . .","Hi ItayO To be honest, a clean install is the best option, but you implied in your original post that you did not want to have to re-install all your software, so an in-place upgrade would be the next best optionIf it was me, I would go for the full clean install, yes that will take more time and all software would need to be re-installed and all your personalized settings would be lost, but that would result in a really clean and responsive operating system . . .Got it. Thanks!"]},{"symptom":"Slower performance after Win 10 Pro upgrade from Win 7 Pro        I recently upgraded from Win 7 Pro 32-bit version to Win 10 Pro 32-bit version.  My laptop feels a bit slower now than it did before.   I suspect it's because Win 10 needs more RAM than Win 7 did.  I have 8GB DDR3 RAM but since I'm running a 32-bit version of the OS, it only is using 4GB of the available RAM.    Memory usage is typically 2.5GB\/3.4GB available. Apparently I could run Win 7 Pro adequately in 4GB of RAM well enough, but now my laptop is noticeably less responsive.Does Win 10 Pro use more RAM than Win 7 Pro did?  Is there a way to somehow make use of all 8GB of the RAM?  I am running on an x-64-based processor. thanks in advance, ","solutions":["Hi PghPeterO Windows 10 is more resource intensive than Windows 7 in many ways, on your RAM, CPU, Disk . . etc.Before you upgraded, did you check to see if a full set of device drivers were available for your PC on the support page on the manufacturers website, not all Windows 7 PC's can handle Windows 10 . . .With regards to using the full 8GB of RAM, you would need to backup your data and clean install the 64bit version of Windows 10 on your PC . ..Click this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), you can create a bootable USB flash drive (min 8GB) using that toolThen, Boot your PC from the Installation Media you just created (change Boot Order in your BIOS) to begin installing Windows 10Since you previously had Windows 10 installed and activated on that PC during the installation process skip the steps which ask for a product key and select the option 'I am Reinstalling Windows 10 on this PC', and activation will not be an issue, your PC will have a digital entitlement stored on the Microsoft Activation Servers Make sure you install the same Edition of Windows 10 (Home, Pro . . . etc.) you previously had installed to avoid Activation issues"]}]}