{"windows":[{"symptom":"During upgrade to win10 used hard disk as the flash boot and 20 years of all my family movies and photos lost forever. Microsoft team, Please put a warning so it will not happen again.        You guys there, be aware, there is no warning that it will format the usb device.20 years of information deleted in seconds.Still can't forgive myself not uploading all information to a cloud.","solutions":["You guys there, be aware, there is no warning that it will format the usb device.20 years of information deleted in seconds.Still can't forgive myself not uploading all information to a cloud.Two points:If you were able to run your PC for 20 years without any backup to an independent medium then you were very, very lucky. Important data must at all times be stored on at least two independent media.The warning you mention was there all along:"]},{"symptom":"Correct Microsoft program for new IMac, for a large textand embedded photographs.        I am going to soon purchase a new iMac, and would like to ask what would be the proper Windows program. I am writing a length book (over 1,000 pages), with many high-resolution color images (currently about 600 images). My old Apple (2008) desktop MAC, running OS X, version 10.6.8 cannot handle this project, and I have to save it as multiple shorter items. I currently run Microsoft Word 2008 for Mac version 12.3.0 (110427) .  Clearly this is all out of date.I would like to be able to write and save the entire text, with the photographs embeeded in the text as one item. What Microsoft program would be best for this?ThanksRobert","solutions":[]},{"symptom":"Flashing DNS on WIndows 10        Flashing DNS on Windows 10, are there resulting problems for my computer?","solutions":["Hey RWA_821, nope, when you flash the DNS cache, requesting new websites might take a bit longer in theory, but it's unnoticeable..cache will be rebuilt automaticallySo in short, no harm will happen if you flush your dns cache."]},{"symptom":"I have to enter my PIN constantly ...any ideas ...i can't find this in settings        I can't stop my laptop from constantly asking for my PIN ...any ideas ...cant find anything in settings ","solutions":["Hi Cody. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.If you want to remove the PIN go to Settings > Accounts > Sign in Options, but it will still prompt for password.You can skip the Sign-in screen altogether following this: https:\/\/www.tekrevue.com\/tip\/skip-windows-10-lo...Then turn off prompt for PIN\/password after you've been away from PC and it sleeps or suspends in Settings > Accounts > Sign in Options.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hello,If you're comfortable using password, go to Settings > Accounts > Sign in Options and clickRemove under PIN. Regards.","that worked !! thanks so much. One other question. I have Microsoft Word stuck on open on the task bar.  It says there is a dialog box open ? I can't close it for anything. Any ideas?thanks very much "]},{"symptom":"Application Error 0xc0000005 for everything        Hi All,I am facing application error 0xc0000005 for everything on laptop. I saw some fixes which ask me to1. Open CMD. My CMD is not opening and giving me 'file system error (-1073741819)'2. Right click on 'This PC' and select Properties. Not workingNow, I have tried both the things but to no solution. Please help me.One more thing, my system sometimes goes to a blank screen after login.Sometimes, it brings me to home screen where I am able to connect to internet.Please help!!!!!!!!!","solutions":["Hi Sakshi, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.The fact that you are even not able to open Command prompt makes things a bit difficult.Can you try to put the computer in a clean boot state and see if it helps? https:\/\/support.microsoft.com\/en-in\/help\/929135...If not, I suppose a reinstallation of Windows might be necessary(we can, however, try to save everything by doing a repair install)"]},{"symptom":"Insuffcient memory and not enough memory        Running Windows 10 on both my desktop and laptop. On my desktop I got and error \"not enough memory\" while editing in Canon Digital Photo Professional. On my laptop I got the error \"insufficient memory\" while running Adobe Lightroom Classic. Is this Microsoft update related? I ran disk cleanup, disk defrag, deleted temporary internet files, cleared out more space on my hard drive even though it already had enough space and reinstalled Digital Photo Professional but it didn't help. Both my laptop and desktop are having problems. The memory diagnostic tool didn't find anything wrong. Is this update related? Help!","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.I believe this error will be relating to RAM rather than disk space. Using disk cleanup, etc. won’t help this.Your best solution would be to first of all close an many open applications as you can whilst running there that you have have an issue with. Alternative, if possible, you could try upgrade you PC\/laptop with more RAM.Regards, Ross","My desktop has 8 GB and my laptop has 12. This is a recent problem. I don't have too many programs running.","I am unsure of what would have changed recently, as there are a lot of variable which can affect the amount of memory available, including the actual images you are working on.I’ve located a thread where a user is having a similar issue and there are a number of suggestions relating to lightroom in particular here:https:\/\/community.adobe.com\/t5\/lightroom-classi...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I think the issue relates to virtual memory since I recently decreased it on both machines. I just increased it and will see how it goes. I wasn't having any issues before I decreased it. Since my last update was a few weeks ago I don't think that was the cause.","Hi Richard, That’s almost certainly the issue, I would recommend either keeping the setting at automatic, or if you still have issues manually increasing the size.Regards, Ross"]},{"symptom":"Shift key        Shift key held to long locks my further typing. Why","solutions":[]},{"symptom":"connection using HDMI cable        my windows 10 laptop doesn't connect to Sony Bravia tv using HDMI cable. I even duplicate the screen option yet it doesn't shows any change. tv screen still shows no signal. please tell solution for my problem as soon as possible.","solutions":["Hello Chahat! My name is Marco, I am an Independent Advisor. I will do my best to help you.Did you try all the hdmi sockets on your tv? And did you test on another television to locate the problem, if it comes from the computer or from the TV itself?"]},{"symptom":"CAPS LOCK only works when SHIFT \/ ALT \/ CTRL \/ WINDOW + CAPS LOCK.        Hello everyone! <3It really bothers me that i can't toggle my caps just by toggling caps. I have to do the above to activates it.Yesterday everything was fine, but today it started doing this. BUT when i restarted my laptop, it was fine for 1 minute and BOOM BACK TO ANNOYING. HELP!","solutions":["Hi Nelsonkth, my name is Jay. I'm an independent advisor. I'd be happy to help with your issue.Can you please check if your \"Sticky Keys\" Control Panel\\Ease of Access\\Ease of Access Center\\Set up Filter Keys\" is enabled?To do that please go to Control Panel> Ease of Access> Ease of Access Center> Make the keyboard easier to use and if the box beside Turn on Sticky Keys, Turn on Toggle Keys, and Turn on Filter Keys have a check mark? If yes, please try removing the check mark.Please let me know how it goes, thank you. Regards, Jay","Hello Jay,I have followed your instructions and un-checked all the check boxes below Sticky, Toggle and Filter keys.But my problem still persists. :(Warmest regards,Nelson.","Hi Nelsonkth, Apologies as my instruction was not complete, can you also check if there is a check mark in the box beside \"Turn on sticky keys\" that has \"Press keyboard shortcuts (such as CTRL+ALT+DEL) one key at a time\" in Set up Sticky Keys settings?To check it, please go to: Control Panel> Ease of Access> Ease of Access Center> Set up Sticky Keys Please make sure to save the changes. You may also send a screenshot of your current settings, thank you.Regards, Jay","Hello Jay,Enclosed below is the screenshot of my current settings. I also could not find \"Press keyboard shortcuts (such as CTRL+ALT+DEL) one key at a time\". HEEEEELP!Warmest regards,Nelson.","Hi Nelson, Can you try going to search and type in Sticky Keys> select \"Turn on easy access keys\" - from here you should be able to see \"Make it easier to type> \"Press keyboard shortcuts (such as CTRL+ALT+DEL) one key at a time\"> click on \"Set up Sticky Keys\" settings> uncheck box \"Press keyboard shortcuts (such as CTRL+ALT+DEL) one key at a time\" You may also check this article on ways to disable sticky keys, when using shift option, make sure to select no once the prompt appears for you to disable it. Please let me know of the results, thank you.https:\/\/www.isunshare.com\/windows-10\/3-ways-to-...Regards, Jay Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hello Jay,I have followed your instructions but it is still not working :(Warmest regards,Nelson.","Hi Nelson, Sorry to hear that, can you please check your language settings by going to Control Panel> Clock, Language, and Region> click Change Input Methods beside Language> on the left pane click on Advanced settings> see if Press the CAPS lock key is selected?If this doesn't work, please go to Search> type Troubleshoot> scroll down and select Keyboard> click Run Troubleshooter button underneath.Please let me know how it goes, we may need to update the drivers on the next procedure. I appreciate your patience on this, thank you.Regards, Jay","Hello Jay, Still not working. For the second method it says \"no changes or updates were necessary\".Warmest regards,Nelson.","Hello Jay,Just for your information, if i am at my user log in page, before logging into my computer, the Capslock works fine. It will only start giving problems after i log into my computer.Also, as I have said my Capslock is not responding, when I click click caps (and caps button in lighted up) and the stuffs I typed weren't in caps.So when the caps light is still on and nothing happens when i type.But when i switch tab caps works, and while i am on other documents its all caps and when i turn caps off its not responsing as usual. Then when i pressed caps and the lights go off, its not working as usual. And when i change tab again it works.Warmest regards,Nelson.","Hello Jay, I have fixed the problem. But i have another problem now.I found out once my anti virus starts running, my caps lock becomes weird. So once i quit my anti virus, my caps lock works. what can i do to my anti virus to prevents this? Or better to change to another anti virus?Warmest regards,Nelson."]},{"symptom":"full scree problem        my laptop is working on windows 10 operating system.i am faced problem my laptop screen is not adjusted full screen in different screen resolutions'it adjust full screen in 1900 X 1080 resolution. how to fix it.","solutions":["Hi nagendra Do you mean you have a black border around your screen, or the whole image does not fit on your screen?If so, this is not caused by resolution, this is caused by the aspect ratio setting . ..Right click your Desktop, on the resulting menu, you should see the control panel for your graphics card (Intel HD . . etc.) open thatOn that control Panel, look for an Aspect Ratio setting and try each option there to find the option that fits your screen . . .","Simply select the Settings and more menu and click the “Full screen” arrows icon, or press “F11” on your keyboard. Full screen mode hides things like the address bar and other items from view so you can focus on your content.To exit full screen mode, move your mouse near top of the screen or swipe down with your finger and select the “restore” icon in the top-right, or press “F11” again.Source: [link removed by moderator]"]},{"symptom":"How to find PIN for bluetooth?        Trying to pair PC and laptop","solutions":["Hi Mike,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.The PIN either is automatically shown on either one and you have to press yes or it is usually 12345 for most of the devices. Have you tried the same?","Hello,While you pair these devices, the PIN will be automatically displayed on screen. Keep both devices Bluetooth on and search for another from one. Repeat this from another device if that doesn't work. Once both devices detect each other, you may see PIN displayed on screen of either device.Regards. ","I tried 1234 but I will try 12345","No pin was displayed on either device. My win10 pc with bluetooth adapter showed bluetooth active but not pairing with laptop.","Also try 00000 and 123456 if it doesn't work.","Okay, will do."]},{"symptom":"I get this error 0x800706A how can I fix it?        I get this error 0x800706A how can I fix it?","solutions":["Hi Joe Where exactly in Windows are you seeing this error and what are you trying to do when that error shows, you posted to the drivers section of the forum, does this involve device drivers, if it does, what is the exact device you are having difficulty with . . .","I get this error message in my document files. When I tried to send it to my USB or just plain open it. I also get this message (the cloud file provider is not running). I don’t understand.Thank you for your help","Hi joe This seems to be caused by OneDrive, do you use Files On Demand, where your files are actually stored online, not on your PC?Please see the solution proposed on this thread . . . https:\/\/answers.microsoft.com\/en-us\/windows\/for...","I did have a service with frontier Phone Company (contents anywhere) I deleted.  I didn’t realize it was working. Now is there any way I can get that back?Thank you very much for your help.Joe"]},{"symptom":"App keeps reappearing after I permanently delete it        Hi people,I have a Bible app that keeps redownloading after I permanently delete all the relating files as well as the app. I feel like I've gotten rid of the entire app and the files, but after a short while, the app comes back and I have to keep re-deleting everything again, which is really time-consuming. I definitely know that the app was not preinstalled. Is there a quicker way I can permanently delete the app without it ever reappearing again or am I doing something wrong?Thanks for the help","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,Did you download the app from the Microsoft store? If so, 1. Open the start menu and locate powershell and run it with admin permisison 2. Execute this command to receive its package name Get-AppxPackage *Bible* Upon receiving its package name execute this command Get-AppxPackage *theapp'spackagename* | Remove-AppxPackageUpon successfully uninstalling the app, perform disable third party services or aps from startup that may be causing the issues1. Go to start menu\/search msconfig 2. On the system configuration window go to the services tab 3. Tick on hide all microsoft service so that this won't be affected 4. Choose to disable all services 5. Next, go to the startup tab and on the window choose to open task manager 6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok 8. A prompt to restart the computer will show up, choose to restart Let me know how it goes. :)","Hi Gary,I am able to receive the package name, but after I execute the second command and press enter, nothing happens and the app does not uninstall. I know I am typing it exactly as you've put it.Btw, thanks for responding:)","Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.I think the issue you are having with the second command is the name of the app retrieved from the first step.Can you substitute: *theapp'spackagename* With the exact spelling (case sensitive) of the app retrieved from step 1, enclosed in double quotes (\")Regards, Ross"]},{"symptom":"Two Driver folders        In my windows installed drive, there are two folders named \"DRIVER\" and \"Drivers\" respectively. They both seem to have similar files in it. Is it okay to delete one? I don't want to mess up my drivers but they seem to take some space. Here are some screenshots.\\","solutions":["Hi schan_lee Those are standard folders you will find on a PC like a HP system, you can safely delete the folder named DRIVER all the files you require are in the other folder . . ."]},{"symptom":"Dark green screen (no error code\/text)        So yesterday, whilst playing a game on steam my screen suddenly turned to green. Windows repair didnt fix it, couldn't reset my pc. So, i had to fresh install windows and it worked for a few hours until it did it again. I dont know why (its a brand new pc) and would appreciate any help. ","solutions":["Brand new computer, contact the computer manufacturer. You have a one year warranty. Use it before making any drastic changes or trying to fix it yourself. ","It wasnt prebuilt","Hi Tom, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.This looks to be a display issue - as you say it is a new PC, have you contacted the manufacturer?To narrow down the cause I would try to disable external graphics and use motherboard graphics(if present) or try the external card into another computer.Fresh Install has ruled out a driver issue."]},{"symptom":"RunDLL Error        I have an HP 7510 printer. Every time I open up my laptop  I get this message.(There was a problem starting C:\\Program Files\\HP\\HP Photosmart 7510 series\\bin\\HPStatusBL.dll The specific module could not be found) When I go to print it will only print one at a time and then it holds the file in print queue and does not let me print again. I have tried deleting and reloading still the same problem. I have to wait in between printing for the file name to drop off before doing another printing.","solutions":["Hello ElizN, I am Andrew an independent advisor. DLL errors are often associated within Windows. Did you delete and reload the printers programming or the file you were printing?If it was not the printers programming please delete and reinstall it using the latest software version found here.https:\/\/support.hp.com\/us-en\/drivers\/selfservic...If you've already tried this method we need to scan Windows for any errors using these,In the search bar, type cmd. Right-click on cmd.exe and select Run as Administrator. Type SFC \/scannow and press the Enter key. Re-enter Command Prompt as Administrator and run these: dism.exe \/online \/cleanup-image \/scanhealth dism.exe \/online \/cleanup-image \/restorehealth dism.exe \/online \/cleanup-image \/startcomponentcleanup Please try these suggestions and let us know they results. Andrew Disclaimer: Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"update windows 10 version 1903 installation failed error 0xc1900101        Installation failed! I have followed online advice to \"try again\" but still error 0xc1900101 I have tried restart but still installation failed error 0xc1900101 I have even tried shutting down my pc but I still get message installation failed error 0xc1900101So what is error 0xc1900101?How do I fix it?","solutions":["Unfortunately PCs have a finite lifespan. If the PC is still working then there’s no reason why you can’t keep using it. :)Happy New Year & have a wonderful 2020, from Manchester, U.K. If you don’t have any further questions please feel free to mark one of the replies as the answer &\/or rate my help: 1 star means you are very unsatisfied with my help and 5 stars means you are very satisfied with the help I gave you."]},{"symptom":"Creating Backup to an External drive issue        I received an error code 0x80070032 when setting up a backup file to an external hard drive. Could you help me?","solutions":["Hi, My name is Nick and I am an Independent Advisor. Check if the services related to Backup and Restore are up and running. Please find the instructions to follow below.1) Press Windows logo key + R and open Run dialog box 2) Type in services.msc and tap on OK 3) The following services should be running: Windows Event Log, Task Scheduler, Windows Backup.4) Double click on each service locate Automatic from the drop-down for Startup type and click on Start5) Once the service is started, click on OK Are you using Anti-virus software? If yes, try disabling it temporarily then check if Backup works."]},{"symptom":"tones play continuously        In Windows 10 the device connect tone, then the device disconnect tone, play continuously.  How can I find out what is causing them to do that?  How can I get them to stop?","solutions":["Hi Garvin, Let's try to fix this: I have 'fixed' the issue by disabling the USB selective suspend setting! Haven't heard any device connect\/disconnect sounds in a while.Go to Start > type in Edit Power Settings > Click the icon > go to Change Advanced Power Settings >Then under 'USB settings', under \"USB selective suspend setting' set it to 'Disabled' (for both if you have a laptop)Restart and try.","I set the USB selective suspend setting to Disabled.  The display went off after 10 minutes as I had set it before.  After the display went off the connect\/disconnect sounds began, as usual.  So this didn't work.  Nice try, though!  Thanks for the help.","OK let's check something else, go to Start > type in Device Manager > go to Device Manager > under Universal Serial Bus Controllers can you take a screenshot of that and send it to me? I want to see if there is an issue there...","OK let's check something else, go to Start > type in Device Manager > go to Device Manager > under Universal Serial Bus Controllers can you take a screenshot of that and send it to me? I want to see if there is an issue there...","Could you possibly uninstall all those USB devices, restart your computer and let Windows install the driver again - there may be an issue with them","Could you possibly uninstall all those USB devices, restart your computer and let Windows install the driver again - there may be an issue with themThe problem turned out to be completely uninvolved with USB ports.  My monitor was too old to be supported by Windows 10, and a generic driver was installed, but Windows 10 continued to poll all monitor ports continuously, thus the constant device connect\/disconnect sounds.  I updated to a more recent monitor and installed the correct driver for that monitor, and the problem was solved.  Thanks for your suggestions."]},{"symptom":"after a windows 10 update in september my operating system is gone        after a windows 10 update in september my operating system is gone, I tried talking to the service department at Microsoft and could not get someone who spoke good english and I could not understand them, the problem was never resolved and I still cannot use that computer, the usb that we made on one of the many calls does not work it says that there is an error code: OXC0000098, missing boot\\BCD\\. I have ordered a new hard drive. How can I get windows 10 without paying another $119.00 for it, to install on my new hard drive? Thank you for your help","solutions":["Hi Dianne. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.The license you have is good for the life of the motherboard. You can reinstall WIndows as often as you want.If the hard drive is failing I'd replace it with an SSD which is the best upgrade you can give your PC - lightning fast, better than a new higher end PC without one.Follow the included instructions or a video you find for your model via Google to swap it in and do this Clean Install which should get you past all difficulties as it has hundreds of thousands of others who have followed the steps in this link and never come back to report another problem: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... To create bootable Windows 10 Installation Media (on another PC if necessary) install Media Creation Tool and follow the directions in the middle of the download page here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key for your PC maker given in this chart:https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, then on second screen choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, select the Unallocated Space, click Next to let it create and format the needed partitions and start install - this makes it foolproof.You will get and keep the best possible install to the exact extent you stick with the steps, tools and methods in the linked tutorial. It's a better install than any amount of money could buy and a great learning experience that will make you the master of your PC because you will learn everything that works best and how to apply it with your own hands.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","If the computer was activated there is no longer a need for a key.If asked for a key just go to the bottom of the page and click on Skip, Do this later, or I do not have one. When you make the USB you need to use Rufus to make it bootable and then install Windows 10.If you used the media creation tool and downloaded to the computer click on Upgrade.","what is Rufus?","Rufus is an item that will make you USB bootabe.  Also make sure that the USB is at the top of the BIOS boot list.","I have installed the new hard drive and when I tried to install the windows 10 I get a message \"We couldn't find any drives. To get a storage drive, click load driver.\"  When I click on load driver I get a message \" to install the device driver for your drive, insert installation media containing device files and click OK . there was NO media that came with this new hard drive, so now what do I do?"]}]}