{"windows":[{"symptom":"Keyboard layout wrong name        I created a keyboard layout using Microsoft Keyboard Layout Creator and gave it a name. Let it be ONE. Then I created another keyboard layout and gave it a name TWO. But it is displayed under name ONE.I have two different keyboard layouts but they are shown under the same name ONE","solutions":["Hi Vadim, my name is Andrew and I'm an Independent advisor here to help you.Microsoft Keyboard Layout Creator is an old program designed for Windows XP. I am pleased to hear that it works with Windows 10.Guide 1. Try changing the description of the keyboard layout that you have created.Please follow this guideline: - Open Microsoft Keyboard Layout Creator to click on File - Load the keyboard layout. - Click on Project and Properties. - Change the Description of the keyboard layout. - Click on OK. Guide 2. If the method above doesn’t help, try rebuilding the DLL and Setup Package. Once done, go to Start - Settings - Time & Language - Language - Click on the language pack to select options.Click on the old keyboard layout and select Remove. Let me know the result for further assistance. Thanks, Andrew N."]},{"symptom":"Windows 7 upgrade to windows 10.        I am on Windows 7 and need to upgrade to windows 10.  Will all of my programs work on windows 10?","solutions":["I am on Windows 7 and need to upgrade to windows 10.  Will all of my programs work on windows 10?They should but there is no guarantee.","You should also check with the program manufacturer to see if programs are compatible with 10.If they aren't this may work:Make older apps or programs compatible with Windows 10https:\/\/support.microsoft.com\/en-au\/help\/15078\/windows-10-make-older-apps-or-programs-compatible_____________________________________You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700Cheers."]},{"symptom":"Screen brightness        Hi.I have a Surface Pro 7 and my screen brightness is too dark. The slider in the settings menu is not working. Auto dimming is off.","solutions":["Hi Tayles75 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.How to fix Windows 10 brightness control is not working. https:\/\/blog.pcrisk.com\/windows\/12682-how-to-fi...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"\"Your device needs the latest security update\" message on login screen, but my Windows 10 is up to date        Hello,I see this message every time I start up my laptop on the 1st screen before logging in. When hovering over the message, it states:\"Microsoft can't install important security updates on your PC until you install the most current version of Windows 10\"I then go to Windows Update, and check if I am up to date, and yes, I am. My current version is Windows 10, version 1909.I previously was on 1903 when I 1st starting seeing this message. So installed the optional update 1909. But I still get the message every time after reboot.Thanks for any info to get rid of this message.","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command promptDISM \/Online \/Cleanup-Image \/RestoreHealthRun these commands on the command prompt to restart windows update servicesnet stop bitsnet stop cryptsvcnet stop wuauservnet stop msiserverRen C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.old net start bitsnet start cryptsvcnet start wuauservnet start msiserverAfter successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartThis should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","Hi GaryS25Problem is solved, here is what I did:Took Windows 10 out of S mode (to be able to use cmd)DISM \/Online \/Cleanup-Image \/RestoreHealthnet stop bitsnet stop cryptsvcnet stop wuauservnet stop msiserverRen C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.oldnet start bitsnet start cryptsvcnet start wuauservnet start msiserverRegular restart of computer==>  Issue was not solved.Then  I stopped again the bits,cryptsvc,wuauserv,msiserver, removed new SoftwareDistribution and catroot2 folders, then renamed the .old directories back to the original name (basically undoing what I did before), restarted the services, rebooted the machine, and the message went away. Not sure I understand why, but seems solved now.Thanks for your help!"]},{"symptom":"Default \"fit picture to frame\"        This wacky default has been around since the days of Win XP.   It fits the picture you are printing from edge to edge one way, while cropping out the rest of the image.  I have Never wanted this setting and can't think of a time when it could be useful. How can the default setting be changed?  I run W10 and print, jpegs mostly, from various places but Windows is set to manage the printing.","solutions":["Hi JohnnyMy name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Are you using the Photos app for printing?Try using File Explorer. Find your image file, right-click on it, and select \"Print\" and go from there. Also, you might be having problems with aspect ratio.Hope this helps."]},{"symptom":"Old Games that used to work all of a sudden stopped\/        Hello i am having an issue running a couple of old games. I have Windows 10 Home and fully up to date with updates. These games are Blitzkrieg Rolling Thunder Gold Edition and Mission Kursk. I have the discs and dont need a code. They both downloaded with no problem and shortcut icons are on my desktop.I keep getting this message code everytime i go to start to play.This application can be launched with a release version of Microsoft Windows 95\/98\/ME NT 4.0\/2000\/XP\/ Server 2003 only.What does it mean? Is there any Hope? Help......","solutions":["Have you tried running the .exe in compatibility mode? Right click the .exe & choose the compatibility tab, run the compatibility troubleshooter.If so & it still doesn’t work then the games are just too old.","Do you require any further help?","Released in '04, so I reckon the game should run on Win10. You mention both downloaded and having the discs.When you said download did you mean installed from the disc ? If so...Apparently the disc based version of this game uses StarForce. A buggy copy protection system.Because of the error message referring to older versions of Windows, and because of the games release date I'll guess thegame is using a copy protection system that is not compatible with 64bit Windows.SecuROM and Tages also had issues with 64bit Windows on games released in the '04-'07 period.You may be able to find a 64bit update ? Tages put one out in...'07 ?  If there is no Starforce update and the DRM is the issueyou would need to use a noCD fix\\hack to run the games..","Do you require any further help? Thank you for trying to help! I am really not computer savvy at all. Is there anyway to run an external hard drive with the proper windows system so these games can run? Again thank you for your knowledge and time. ","Thank you for trying to help! I am really not computer savvy at all. Is there anyway to run an external hard drive with the proper windows system so these games can run? Again thank you for your knowledge and time. "]},{"symptom":"Windows 10 1909 Causes Secondary Hard Drive to not be Recognized        Installing the Windows 10 1909 Update causes my secondary hard drive to not be recognized.Steps to confirm issue:Secondary drive not visible in Windows ExplorerSecondary drive not visible in device managerSecondary drive not visible in disk managerSteps to replicate issue:Installing 1909 updateSteps to resolve issue:Uninstall 1909 updateSince updates can only be delayed for so long, an actual fix would be appreciated.","solutions":["I only had to reboot the system once more and then the shares on my local HD came back.","Thanks for the reply. Unfortunately this hasn't worked for me."]},{"symptom":"Two finger scrolling not working after windows 1903 update        I have a lenovo ideapad 510 with ELAN touchpad driver installed. Two finger scrolling doesn't work in the start menu but works everywhere else i.e. file explorer, various apps, control panel, etc.I have already tried installing the manufacturer provided pointing device driver but to no avail. I have also tried uninstalling and reinstalling driver. Updating driver. Even reinstalling 1903 update using media creation tool but to no avail. Please suggest some remedy. ","solutions":["Hi, Thank you for writing to Microsoft Community Forums.   1.    Are you aware of any recent changes, after which you are facing this issue?2.    May I know, if other gesture settings are working? You can try the suggestion from the manufacturer How to enable touchpad virtual scrolling (Mouse wheel) - idea laptops and check if this helps you. Please reply to this post with the results. Regards,Amit SunarMicrosoft Community – Moderator","I was having the same problem. Found this solution in another thread and it worked for me.","This regedit process did fix the scrolling in start menu but I noticed in the mean time that scroll was also not working while scrolling Task view history. Or in native photos app. This fix however failed to work inside it. For now I have switched to windows precision driver. I am waiting till ELAN provides an update for this fix or if you guys have some other solution it would be great. Thanks.","I had this fixed by going into the device manager, and under \"Mice and other pointing devices\" --> Synaptics, select \"install new driver\".The system will search online, download a new driver, then it's fixed.I think the issue was that Windows replaced it with a generic Synaptic driver by 1903's default. see my screenshot, once updated, it's called ELAN input Device for WDF not Synaptic anymore.","I was having the same problem. Found this solution in another thread and it worked for me.This worked for me however scrolling is still absent in Task View and Photos app and I’ve checked for every update available on windows update and device manager. Nothing comes up System info: Lenovo ideapad 15ISK","I have a similar problem with my synaptics trackpad.  gestures no longer work since recent windows update.  had a technician remote help me by reinstalling the driver but after a restart, the problem remains.","i have the same problem. my synaptics clickpad 2 finger scroll started behaving buggy after the latest win 10 update (june\/july 2019)","I got the solution and it's quite simple-Go to  Device Manager.Select \"Mice and other pointing devices\"Double click on ELAN pointing deviceChoose \"driver\" option.Select \"update driver\".select \"search automatically for updated driver software\"After this, the latest driver software will be automatically downloaded (make sure the  internet connection is on). You then have to restart your PC.And voila! The two finger gesture within the start menu is working as it should!","i have the same problem. my synaptics clickpad 2 finger scroll started behaving buggy after the latest win 10 update (june\/july 2019)I got the solution and it's quite simple-Go to  Device Manager.Select \"Mice and other pointing devices\"Double click on ELAN pointing deviceChoose \"driver\" option.Select \"update driver\".select \"search automatically for updated driver software\"After this, the latest driver software will be automatically downloaded (make sure the  internet connection is on). You then have to restart your PC.And voila! The two finger gesture within the start menu is working as it should","This worked for me to get Start Menu scrolling working again on my Lenovo IdeaPad 700-15ISK after I installed the Win10 1903 update last week.  I tried other suggestions, including uninstalling the existing ELAN drivers, rebooting and reinstalling, with no change.  And the \"scroll inactive window\" idea didn't work either.  That said, it definitely doesn't work in the Task View but I can live with that for now.  Hopefully a true fix will come soon but I kind of doubt it given how long 1903 has been available. "]},{"symptom":"Reset Dell Inspiron 17 windows 7        I bought a used Insprion 17 5000 series. They said it was restore to factory settings, its not. I've searched, tried everything. nothing works. Can't reset password, says need USB. I've watched video's using F8, F12, holding shift key and restarting computer. I can't get to the anything to get to the reset. Can anyone help?","solutions":["Seeing that support for Windows 7 is about to cease, you might go straight for Windows 10. With some luck it might even be free. You will find the download tool here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/media-creation-tool-install","I probably can help you IF you want Windows 7.  Please answer Fredrik's question (or suggestion) first.","I bought a used Insprion 17 5000 series. They said it was restore to factory settings, its not. I've searched, tried everything. nothing works.Can't reset password, says need USB. I've watched video's using F8, F12, holding shift key and restarting computer. I can't get to the anything to get to the reset. Can anyone help?You make a password reset disk before you forget the password, not afterwards.And seeing as it is a used computer and someone else's password, you clean install the operating system.That is the idea of a password; to keep people out.You say F8 does not work. is this how you used it?Dell – Press F8 which will bring up Advanced Boot OptionsHow to restore a Windows 7 Factory Image on your Dell PC | Dell US@@@@@@@@@@@@@@@@@@@@@@@@@These are your other choices to reinstall 7.You can borrow the exact same edition of Windows 7 Retail DVD and use your Product Key on the COA sticker to reinstall the operating system.@@@@@@@@@@@@@@@@@@@@@@@@@Or you can use this for preinstalled OEM or Retail Licenses. This is on a first come, first served monthly basis.Download the correct ISO file and make your own disk and use the Product Key that is on the COA Sticker. This is on a first come, first served weekly basis.https:\/\/www.heidoc.net\/joomla\/technology-science\/microsoft\/67-microsoft-windows-and-office-iso-download-toolDownload: Windows ISO Downloader.exeAnd here are instructions on how to burn ISO images to disk:http:\/\/www.snapfiles.com\/get\/ISORecorder.htmlYou change the Boot Order in the BIOS to be able to boot from your installation media:How to Boot Your Computer From a Disc or USB DriveHow to access Boot Menu:https:\/\/neosmart.net\/wiki\/boot-usb-drive\/Then do a clean install:http:\/\/www.sevenforums.com\/tutorials\/1649-clean-install-windows-7-a.htmlThe COA sticker is either on the underside of the Laptop or in the Battery Compartment.With a Desktop it is either on the side, rear or top of the Computer Case.Using the downloaded ISO file Method may require phone Activation.It may require that you use phone Activation.\"How to Activate Windows 7 by Phone\"http:\/\/www.sevenforums.com\/tutorials\/18715-activate-windows-7-phone.htmlThe above method also will require you to go to your Computer Manufacturer's website > Support and Downloads Section > locate your Model Number and Operating System > then download and install the latest Drivers for it. ________________________________________________Using the USB method in conjunction with the above Windows 7 download:http:\/\/www.sevenforums.com\/tutorials\/2432-usb-windows-7-installation-key-drive-create.html\"How to Get and Use the Windows 7 USB\/DVD Download Tool\"http:\/\/www.sevenforums.com\/tutorials\/31541-windows-7-usb-dvd-download-tool.html________________________________________________And this is very good and easy to use:Rufus - Create bootable USB drives the easy wayCheers."]},{"symptom":"installing internet explorer email        <My email service suddenly ceased and I got a Yahoo promotion to establish an I-cloud email service which would require me to establish a new email address.  I don't want a new email address. I would like to keep the email address that I have had for some 15 years.  Can I reestablish my old email account to both send and receive mail without having to change to a new address?","solutions":["Internet Explorer does not have email.You use IE, Firefox, whatever browser you choose to use to go to the webmail address that you have setup for your email account with them whether it be Yahoo, Gmail, Outlook.com (formerly Hotmail).We have nothing to do with Yahoo email accounts.Yahoo did recommend that you change browsers from Internet Explorer to Firefox, Chrome, etc. or you would be given a basic Yahoo mail account without the bells and whistles.If you have problems with Yahoo; contact Yahoo: https:\/\/au.help.yahoo.com\/kb\/account","Unfortunately, Yahoo mail is not a good place to be any longer.  I have moved all my clients away from it.  Yahoo has gone through some bad times.  It is now the property of Verizon who bought it and AOL and merged them into something it calls Oath.  Sort of two dying platforms merged into one that is not well supported.  Verizon has since written off its investment.  Yahoo mail has not got much of a future.  Most all of my clients have moved their primary mail to Gmail.","Yahoo mail is very good to use and I have used it for many years.Late 2019 they released a new format for their email, which I also use on Android. I find that the spam controls they have put in place work well compared to the old Yahoo days.And I use it in preference to the old Hotmail, now outlook.com.Actually I use it in preference to Gmail, which I also have.Regards."]},{"symptom":"Windows10 Reinstallation        I have a WIN10 Home retail box with flashdrive.  After 6 months the SSD I installed Win10 on has become flakey.  I have a new SSD.  All of my files are on other drives.  So, the only thing I need to do is reinstall Windows10 and a few programs.  What is the best way to completely rebuild the SSD?  What will happen when I try to use the original flashdrive?","solutions":["Hi Fred The best way is to boot from that flash drive to clean install Windows 10 . . . You can reinstall Windows 10 at any time, you will not need a product key, activation will be automatic and it will not cost you anything !Since you previously had Windows 10 installed and activated on that PC during the installation process skip the steps which ask for a product key and select the option 'I am Reinstalling Windows 10 on this PC', and activation will not be an issue, your PC will have a digital entitlement stored on the Microsoft Activation Servers Make sure you install the same Edition of Windows 10 (Home, Pro . . . etc.) you previously had installed to avoid Activation issues"]},{"symptom":"New PC Very Slow And 100% Disk Active Time        Hello as the title says, my brand new pc, is VERY slow with the red light on the case indicating hdd problem is on fully.  I have noticed very slow performance for restarts and startups.  ~~Thanks for any  help!","solutions":["Hi Derek 100% disk ativity will make your PC very slow, we need to find out what is causing that . . .Open Task Manager (Ctrl + Shift + Esc) Select the Processes Tab Click on the Disk Column Header, so that arrow faces down Please provide a screenshot of the resulting Task Manager window . . .","Hello, thanks for the fast reply.  The screenshot is attached.  For whatever reason I dont know its on my SeaGate Drive 7200rpm 2tb disk (Is C: drive).","Hi Derek This is a known issue, it is SysMain (formerly known as SuperFetch) that is causing a high disk read\/write on your hard drive . . .Click your Start Button, then just types services and hit Enter On the resulting window, scroll down the list to find SysMain Double click that process, and if it is started, click Stop Then set its Startup type to Disabled Save that setting, close the Services App and restart (not shut down) your PC . . .","I dont know, for the setup I currently have, it seems that I should be getting much better response from it however it seems to have worked. It just seems like my other computer is faster with only an I7, GTX 1060, and 32 gb of ram.  I've noticed that the red like is now flickering very fast as if its steadily on.","Hi Derek When you took that screenshot, were you using Skype and does Skype start up with Windows on your PC?","No, i currently dont have skype installed","Hi derek From your screenshot, the second process down is Skype which is running 3 instances in the background . . .However, that does not have the regular Skype icon and that makes me suspicious . . .Open Task Manager again On the Processes Tab, find that Microsoft Skype Process, right click that and choose 'Open File Location'What is the reported location of that executable? .","Oh my bad.  Didn't realize it came with Windows.  However, I uninstalled Skype before your response but I do not see that process no more which probably means it was with the original Skype but it is weird as you had said that it doesn't have the correct icon."]},{"symptom":"state of decay year one PC windows 10 missing        I had to reinstall my windows (buggy preview builts) and all of a sudden the game is missing why? where did it go? it was just there! ","solutions":[]},{"symptom":"Wrong sizes of window, Edge, and Excel after restore down        An error persists in this new Dell Windows 10 desktop.  The preferred sizes ofwindow ~ 7” wide x 10” long; i.e. full length of monitorEdge and Excel (Home and Student 2019) ~ 10” x 10” They should all anchor on the monitor’s top left corner.  However, after clicking Restore Down in Maximize, they arewindow ~ 7” x 8.5”, too shortEdge ~ 11” x 9”, too wide and shortExcel ~ 10” x 7”, too shortThey do NOT anchor on the top left corner.   Google Chrome does NOT have this problem, weird.  All Windows updates have been installed.   Two methods recommended by the following website don’t help. https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/windows-10-restore-down-bug\/936c2a15-5787-475a-960b-eff6d529d2cc?auth=1 1.      In (Tablet mode), (When I sign in) was changed to (Use the appropriate mode for my hardware) and rebooted numerous times.     2.      From Maximizea.       disable the navigation paneb.      restore down shrinks to smaller window, Edge, and Excelc.       resize them to the correct dimensionsd.      enable navigation panee.       maximizef.        restore down","solutions":["Can anyone help to fix the problem?","Hello anyone, please help."]},{"symptom":"Volume bar won't go away\/volume stuck at 100        For the past 6 days the volume bar has not gone away. I try to turn down the volume, but it gradually goes back to 100. The bar gets in the way, and the volume is way too loud. I've seen other people have had this same problem, but I haven't found a solution. I've restarted my computer, I've downloaded an updated audio driver, I've held down the audio buttons on my keyboard, but nothing helps.I have a Windows 10, Inspiron 15-7579, 64 bit.[Moved from: Windows \/ Windows 10 \/ Performance & system failures]","solutions":["I just searched the interned for hours only to discover that it's not a software issue, but that there is a volume button on the side of the computer next to the power that I never noticed and it was STUCK. That was definitely my problem. It's still kind of stuck for me, but at least the volume icon went away. Hope this helps.Ryan"]},{"symptom":"my computer says it is locked.        Trying to type up a letter but the computer says its locked","solutions":["Hi, LouiseMandelman My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.You could give more details about your problem."]},{"symptom":"Bluetooth appear and then the driver disappear and there is no Bluetooth botton        hello I have problem with Bluetooth when I start the device sometimes I didn't have problem suddenly the Bluetooth button disappears and I check the driver from device manager others no driver I tried to install the driver from my laptop company official website but the problem not solved I opened blutooth troupelshotit from win 10  it said there is no blutooth driver.  also, I tried to update win 10 to solve the problem but it didn't work when I restart the win10 the blutooth appears and the driver backs it's too weird I don't know whats the problem can anybody help me?Joseph Y. MarquezIndependent AdvisorHi moiadotoom and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!I was thinking that the problem solved but it's not I still have the same problem opened my laptop no blutooth no driver restart it the blutooth appear I follow the instruction on the first time there was corrupted file and successfully replaced I do it again it said there's no corrupted file please help me ","solutions":[]},{"symptom":"McAffee Anti-Virus Protection and Firewall        When I turn my computer on, a warning says McAfee Virus Protection & Firewall have been turned off. I turn them back on but something is turning them off again. What's causing this? ","solutions":["Hello Evelyn649, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemOpen Services.msc from start menu and search for a service called \"Security Center\"Check if the startup type is automatic. It could be that Windows Security center is not reporting McAfee as an installed Antivirus.If everything was ok, right click on Start menu and choose Apps and features, then search for mcafee and repair the installation, so it register it self again in windows, after this, restart windows again.Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolvedCheers! Farah","Thanks so much for your advice. I will try it out when I go back on my computer.Evelyn649","Sure no worries"]},{"symptom":"Old Windows 7 Ultimate laptop which I can't upgrade to Windows 10        I have an old Windows 7 Ultimate laptop which I can't upgrade to Windows 10 (spec is too low) but I want to keep going for a couple of legacy apps ...Can I upgrade to Windows 8\/8.1 for free?And if the answer is yes, where can I download 8\/8.1 from?Thanks ...","solutions":["You can't upgrade to 8\/8.1 for free.It depends on the hardware requirements of later operating systems and also whether the computer\/laptop manufacturer supports and supplies drivers for the later operating systems as to whether it is possible or feasible to upgrade or not.Windows 8 is no longer supported.@@@@@@@@@@@@@@@@@@@@@@@@Follow these steps before you buy  Windows 8.1; extended support ends January 10, 2023 .Check to see if your Computer\/Laptop Manufacturer has Windows 8.1 Drivers available for your Model.If not available, Windows 8.1 will not install and work correctly for you.\"Windows 8.1 system requirements\"http:\/\/windows.microsoft.com\/en-us\/windows-8\/system-requirementsWindows 8\/8.1 does not come for free; you have to buy itMicrosoft no longer sells 8\/8.1.Try amazon.com, etc.Warning:You do not buy a Product Key by itself, as they are normally stolen\/pirated, Volume Licenses which are not for private use, or MSDN keys which are not to be sold by the original subscription holder.Make sure that you buy the complete sealed package (DVD, license)https:\/\/www.microsoft.com\/en-us\/howtotell\/Shop.aspxRead Section: Beware of Product Keys sold separately.@@@@@@@@@@@@@@@@@@@@@@@"]},{"symptom":"Changing User Folder Name? (Windows 10)        Hey everyone! I'm writing this today because there's this VERY MINOR thing that's been bothering me. I recently upgraded my hard drive, and ever since redownloading windows, it didn't give me the option to name my user folder. Is it possible for me to change my user folder name, or will that mess things up? ","solutions":["Hi elkstra Windows 10 is very different to previous versions of Windows, the user profile folder will generally be named with the first 5 characters of your name and even if you rename your user account, the name on that folder will not change . . .Microsoft advise against renaming that folder, because that can cause issues at a later stage . . .if you do wish to change the name on that folder, trusted MVP Shawn Brink provides the steps to do so in a safe way on this page . . .https:\/\/www.tenforums.com\/tutorials\/89060-chang...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]}]}