{"windows":[{"symptom":"Emails wont send from live mail        I can receive emails , when I send emails they just go to the outbox. If I try and send again from the outbox they go back to the out box .This is the message I getThe message could not be sent because the server rejected the sender's email address. The sender's email address was ('myemailaddress……..\")Subject( 'test')Server Error: 530Server Response: 530 Authentication requiredServer: 'mail.aapt.net.au'Windows Live Mail Error ID: 0x800CCC78Protocol: SMTPPort: 25Secure(SSL): NoHoping someone can help. Thanks in advance","solutions":["Go to the Office forum.","Hi Catherine, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.In Windows Live Mail, please click on the Account tab, and then click on the email account on the left side of your screen, and then click Properties at the top.This should bring up the Properties window for your account. Click on the Servers tab, then at the bottom, find the section that says Outgoing Mail Server.Ensure that \"My server requires authentication\" is checked, and click the \"Settings...\" button, and you can choose the checkbox that says \"Use same settings as incoming mail server\".Press OK, and OK, and see if this error persists. If it does, you can follow the above instructions above to get to the Properties window for your account again, but this time go to the Advanced tab. For Outgoing Mail (SMTP) please try to use Server Port Numbers - Outgoing mail (SMTP): 587It likely will need to also select the \"This server requires a secure connection (SSL)\" checkbox as well.I hope this has helped you. If this does not work, please reply and let us know and we would be happy to look into providing some different suggestions! It is going to be a matter of finding the correct settings.Regards, -Ashton","Hi Ashton , Tried both didn't work . Any other suggestions ?","Hi Catherine, A few more steps to try: 1. Can you change the port number to 465, and leave the SSL checkbox checked. If that doesn't work, 2. Can you try to uncheck the \"This server requires a secure connection (SSL)\" checkbox and try again?If that doesn't work, 3. Please change the outgoing server port to 25, and leave the \"This server requires a secure connection (SSL)\" checkbox unchecked.Can you confirm that your internet service provider is iinet? I am using the following website as a reference for step 1:https:\/\/iihelp.iinet.net.au\/Email_SettingsNote: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Thanks, -Ashton"]},{"symptom":"printer        Win 10 update deleted my headers and footers, and margin sizes on print preview. How do I get them back?","solutions":["Hi Pam. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Are you referring to Office? If so see here how to set headers, footers and margins in Microsoft Office:https:\/\/wordribbon.tips.net\/T009080_Positioning... If not then please clarify where you are setting this so I can help you better. ______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Can a Vista 64 bit computer be transfered to a Windows 7 32 bit computer then upgraded to Windows 10?        I want to transfer my Vista 64 bit computer information to an updated 32 bit computer with Windows 7 then upgrade that computer to Windows 10. Can that be done and if so where can I go to get the instructions?","solutions":["I do not know why you would ever consider doing this.You are gaining nothing.You can't upgrade Vista to 10 wherever you put it.It is done by a clean install.And there was never a free upgrade from Vista to 10.You would have to check if the Windows 7 computer was capable of running 64bit Windows architecture.Transferring a hard drive to another machine and expecting it to Boot will not work, as the old hard drive with an installed operating system has the Drivers installed on it for the old Motherboard from the failed machine.It has to be done by a clean installThe Technical Problem: Device Drivershttps:\/\/www.howtogeek.com\/239815\/why-cant-you-move-a-windows-installation-to-another-computer\/The Licensing Problem: Windows Activation2. Now you also have to consider the legality of transferring an OEM License, which is not allowed.If the Laptop\/computer came with the Windows Operating System preinstalled (Dell, HP, Acer, etc) , that Product Key that came with the Laptop\/Computeris for the preinstalled OEM License and is non-transferable.The OEM License\/Product Key (preinstalled Operating Systems on Dell, HP, etc machines) is tied to the first machine it is installed onand dies when that machine dies.The above rule also applies to OEM System Builders Licenses.Retail Operating System License, that you buy and install yourself, are allowed to be transferred to another machine.But Retail Licenses can also only be installed on one machine at any particular time.Cheers.","Saya punya asus f6v Saya mau clean install Tolong minta link download Windows vista ","1. You start your own thread here; these are not chat rooms.2. There are no Indonesian language Windows  forums here.3. There no legal Vista downloads available."]},{"symptom":"Headphone Mic        I have a Dell Vostro 14-3468 model with Windows 10 Education version installed. it has single jack for audio input and output. the audio output is working fine but the audio input is not working. I have tried many ways to fix it (including uninstalling the audio drivers then reinstalling, changing my headphone) but all in vain. if someone knows how to fix this? ","solutions":["Hello HafizHaseeb, My name is Don and I am a Windows 10 Independent adviser. Let me try and help you out with this issue.Have you tried checking on the audio device settings to see if the preferred audio input\/output is selected properly for it to work?","Yes, I have. Now there is another problem (Headphone not detected) after I uninstalled and reinstalled the drivers again. ","Hello HafizHaseeb, Have you tried the headphones on another computer if you have one that is available?What audio driver is your computer using and have you tried to install the latest audio driver for your computer?Have you tried any of the solutions found on this article and see if they help resolve the issue:https:\/\/windowsreport.com\/windows-10-wont-recog...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"What is Windows 7 Display adapter?        Hi, what is Windows 7 Display adapter? Is it the same thing as Wireless adapter for Windows 7?Is it a Bluetooth speaker? Or a wireless USB adapter?Thanks","solutions":["comuter not work","comuter not work What? I do not understand. ","Read my reply to you in one on your other threads.You should do your Course Assignments yourself."]},{"symptom":"PIN number for new Microsoft account        I'm trying to log into my Xbox Live account but it's asking me for a PIN number I never set, and the account I am logged into while doing this is a different email. I even tried creating a new account to log into, but the same issue came up. How can I access and change my PIN from somewhere else?","solutions":["Hi PT. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Sounds like you're signed into the wrong account, one which has a PIN or it wouldn't ask for one. Do you see a Sign In Options link below or nearby the PIN box to change to password?Do you even recognize the account? Can you change it to your primary account? This is another reason why it's best to sign into Windows 10 with a MS Account? Then you don't have to sign into apps piecemeal, but if you want to change an individual App sign in your can.Usually these are registered at Settings > Accounts > Email & Accounts. So you might be able to remove the account there if nothing else helps. Then try signing in with your primary MS account.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Hi, what is Windows 7 DVD\/CD-Rom drive?        Hi, what is Windows 7 DVD\/CD-Rom drive?  For example, would it be like a Black 52x Sony CD-ROM, model CDU5211?Thanks.","solutions":["Hi, what is Windows 7 DVD\/CD-Rom drive?  For example, would it be like a Black 52x Sony CD-ROM, model CDU5211?Thanks.\"I am doing a Customer Service Course and we have to know computer stuff,\"Here are your other threads.https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/what-is-operating-system-tools-windows-7-cpu\/e84ec1cc-d90e-4c86-8700-bccd24ce2724https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/what-is-windows-7-display-adapter\/52a3f11c-b9c6-49bd-9707-02b70592d8adYou don't learn by someone else giving you the answers to your Course AssignmentsDo Google, Bing Searches and physically work on a computer as well."]},{"symptom":"Fortnite audio playing through microphone          So while playing fortnite, i'm in a party with others and the problem is they can hear my game audio. I've disabled all options besides microphone, and the issue persists. Any feedback would be appreciated, as this is driving me crazy.","solutions":["Hi Fiyz. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you all possible solutions for Sound problems in order of priority, so please try any you've already tried again in order. If you have any problems performing any steps I'll be standing by here to help you.1) Update the sound driver from the PC or device maker's Support Downloads webpage for your exact model, if it is newer than the one presently installed in Device Manager reached by right clicking the Start button. While there compare to make sure you also have the latest BIOS, Chipset, Display, Network and all other drivers. 2) Restore the Windows Audio Service which may have become disabled: https:\/\/www.tenforums.com\/tutorials\/57567-resto... 3) Next try these checklists: https:\/\/support.microsoft.com\/en-in\/help\/402699... https:\/\/www.howtogeek.com\/443702\/how-to-fix-sou...4) Right click Volume icon in System Tray, choose Sound Settings, from the Output and Input devices dropdown menus, choose then one(s) affected to see if that helps. If not use the Troubleshoot button nearby.5) Run the Playing Sound troubleshooter at Start button > Settings>Update & Security>Troubleshoot.6) Try rolling back the sound drivers in Device Manager reached by right clicking the Start button. Choose Sound controller and other audio devices, then Driver tab, then Roll back if available.7) If no newer sound drivers then uninstall the one presently installed in Device Manager, reached by right clicking the Start Button. Restart PC to reinstall.8) Try other and older drivers for your model Sound controller, too. For example, try the next oldest driver in the model's online Support Downloads list. To try all previous drivers installed on your system, in Device Manager choose Sound controller's Driver tab, then Update Driver, then Browse, then Let Me Pick. Finally, try installing the latest Sound driver in Compatibility Mode as shown here:https:\/\/social.technet.microsoft.com\/Forums\/win...9) If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 10) If this was caused by a Version update (which you can confirm at Settings > System > About) then you can roll back the version in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 11) You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... 12) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. 13) If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"never get return call        i have been trying for 3 days to get win 10 finally installed, and need MSN support, but promised phone calls never arrive","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand the situation as you are waiting for a call back. We as Microsoft community forum, are here to help you with any technical suggestion on Microsoft product. Since you mentioned that you need MSN support, we would suggest you to refer this article onHow to contact MSN Customer Support. Regards, Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"How Do I Find And Remove This Malicious Software From My Windows 10        * Locked. See this thread: How Do I Find And Remove This Malicious Software From My Windows 10 I'm having trouble downloading updates for Microsoft Windows Malicious Malware Removal Tool and Windows Defender.I do not do anything strange on my computer and problems with it has kept me busy always trying to find out the problem and staying secure on it.I would like to reset and reinstall, however I'm concern this hacker has more control to stop me.  So if I could find where the location of the software is on my computer, I'm hoping to uninstall or whatever would come next.There is Comodo Dragon, Cyberfox, 2-Foxit Phantom, Foxit Reader, Ice Dragon, Maxthon, I do not have Microsoft Office anymore, at least the paid version but  the App is apart of this.  I have some of these but not the weird named or game like app. VLC and Google, I use Palemoon on a Linux laptop which also has problems. This problem reoccurs after I reset my computer back to default...I'm doing less than what most people do on their computers.  I just have someone stalking\/hacking me etc.  So, I would like to be able to actually find out how they got on my computer, and find out who is involved in the malicious interactive user on my computer that has more computer programming, and rewrites the way a programs works on me as I am using it.  This is not in the app data, My Microsoft Windows Malicious Malware Removal Tool I downloaded and ran again tonight does not come up with anything.  Yet, I saw two different download screens.  And I could not find this running in the task manager on my computer when it was scanning.  However, I am not sure if that is because it is not considered a services at this time or not since it did not come from the Windows Update Settings download. I could not get the images in order, but these are the two different downloads, one is mine and the other the hackers.  I can find the one with only a few in it, and now I see why I have to download apps twice.  I have to sign in twice, I have to do everything twice like I'm doing it for the person hiding on my computer.  I've reset and reset and reset and that does not ever do any good.  This person has victimized me, stole my livelihood,  and has network work with people I will deal with in my future days.  And they seem to think it is okay.Oh, gee I have to post this twice, bc the first post is missing.Thanks,vickyl71","solutions":["I'm having trouble downloading updates for Microsoft Windows Malicious Malware Removal Tool and Windows Defender.I do not do anything strange on my computer and problems with it has kept me busy always trying to find out the problem and staying secure on it.I would like to reset and reinstall, however I'm concern this hacker has more control to stop me.  So if I could find where the location of the software is on my computer, I'm hoping to uninstall or whatever would come next.There is Comodo Dragon, Cyberfox, 2-Foxit Phantom, Foxit Reader, Ice Dragon, Maxthon, I do not have Microsoft Office anymore, at least the paid version but  the App is apart of this.  I have some of these but not the weird named or game like app. VLC and Google, I use Palemoon on a Linux laptop which also has problems. This problem reoccurs after I reset my computer back to default...I'm doing less than what most people do on their computers.  I just have someone stalking\/hacking me etc.  So, I would like to be able to actually find out how they got on my computer, and find out who is involved in the malicious interactive user on my computer that has more computer programming, and rewrites the way a programs works on me as I am using it.  This is not in the app data, My Microsoft Windows Malicious Malware Removal Tool I downloaded and ran again tonight does not come up with anything.  Yet, I saw two different download screens.  And I could not find this running in the task manager on my computer when it was scanning.  However, I am not sure if that is because it is not considered a services at this time or not since it did not come from the Windows Update Settings download.  Again I have had to upload on this after changing my password since last night.Thanks,vickyl71","I have combined your duplicate posts into a single thread. Updates to the Malicious Software Removal Tool are installed on your PC automatically every month. You do not have to download updates. That said, you can certainly download it whenever you want it fromhttps:\/\/www.microsoft.com\/en-us\/download\/details.aspx?id=9905. The current version is from December, 2019.Frankly, I don't see anything truly unusual with the images you've included and certainly no evidence one way or the other that your PC has been compromised. Only if you've never installed any of those products would there be a concern. Can you cite additional evidence that your PC has been compromised?","That software from Microsoft gets updated every 2nd Tuesday of the month,even though the number stays the same...Best bet,download from Windows Update Catalog,follow the link.http:\/\/catalog.update.microsoft.com\/v7\/site\/Search.aspx?q=890830Download\/Save as\/Save\/once thru,R.click run as Administrator.If it refuses,in cmd,type: services.mscIn msc,scroll to Windows Installer\/Double click\/set to: Auto start  start service.Exit,do same with Windows Modules.https:\/\/docs.microsoft.com\/en-us\/windows\/security\/threat-protection\/intelligence\/safety-scanner-downloadThe 2nd is also scanner,but it has Defender & kb890830The 2nd only last for 10 days...","Thank you Andrew E., I download MSERT and ran it on Friday, I felt like this was a waste of time.  I cannot find it running in the processes.  But, I ran it, and it found nothing.  And I have do idea why it was not running in the processes on my computer.I started to download it again, and it seems to open up to the file of sysinternals.  And today sysinternals found someone who has remote desktop to my computer and a whole bunch of things.  However, I do not have any access open to running remote desktop.  I have disable credential manager, removed the guest user, disabled all remote access I could find.Thank youvickyl71","I'm just wondering why I am running version 1909(2).  I do not understand why it has the two by it.  Usually that would mean to me that I have two different 1909 versions.  Let say mine and the hackers.  That is why I would like to know why there are is a (2) after it."]},{"symptom":"Out of Windows 10 Minecraft redeem codes?        So I'm trying to redeem Minecraft for Windows 10 (I purchased the game back in 2011) and I keep getting this error upon hitting the redeem button:Error! It looks like we've temporarily run out of gift codes for Minecraft for Windows 10. Don't worry though, more codes should be on their way. Please check back later!Are there really no codes available right now or is this a error on my end somehow?","solutions":["I am having the exact same issue, it's been about a week for me now and I can't even seem to reach Xbox support, I contacted Mojang but their support is on backlog so god knows how long they'll take to reply with \"contact xbox support\". From what it seemed everyone else in the past was getting a response to contact Xbox support. And all the official replies to these questions in the community are literally useless troubleshooting. I don't even think the people from 2017 got their codes!","I'm fairly certain the people back in 2017 got their codes eventually, somewhere around 2 weeks after they ran out it looks like.  There's no records of this happening any other time between then and now, which wouldn't make much sense, you'd figure one or two posts would have popped up somewhere in 2018 if that were the case.  I'm now seeing a bunch of posts popping up now across the Microsoft forums with people having the same issue so it looks like it's round 2 of being out of codes for a few weeks for Mojang.  Be persistent, send e-mails, and wait is all we can do now.","Just look for the minecraft game > click Buy Now > Click on Login > the system will detect that you already purchased it > click Download","we're trying to get windows 10 with the codes we got for free so we can't really do that.","did u solved that problem?Cause im having this problem right now ; ( ","No i didnt solve it, technically this is week 2 now lol ","thats sad :\/ i just send them an email askin if they can give me a code or something like that Dx","i tried that but got nothing back and its been at least a week since. In my opinion there is not excuse for this to go on this long, they told us if we had it before that they'll give us the windows 10 edition for free, yet they're not giving it to us now. All that has to be done is a code has to be run that generates random codes and then they have just have to be put in a database. this problem should not have existed for more than 2 days.","so u are saying that they wont give a new code for us anymore?","Has anyone recieved a reply from Minecraft Support yet?"]},{"symptom":"I need help.        Teredo is unable to qualify and server connectivity is blocked. I am pc, and I tried every method ( I think i'm extremely tired) If anyone could help i'd appreacite it.","solutions":["Hi Chara. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything that is working for Teredo tunneling problems. If these do not help then I'd go next to Xbox Support or Forums for specialists:https:\/\/support.xbox.com\/en-US\/xbox-on-windows\/...https:\/\/support.xbox.com\/en-US\/xbox-on-windows\/...https:\/\/appuals.com\/microsoft-teredo-tunneling-...https:\/\/www.wintips.org\/teredo-tunneling-adapte...https:\/\/support.xbox.com\/en-AU\/xbox-on-windows\/...If these do not work I would contact Xbox Support here: https:\/\/support.xbox.com\/en-US\/contact-us or ask in their forums: https:\/\/forums.xbox.com\/en-US\/home. An Xbox Ambassador will be the best to help with this as they are the MVP's of Xbox.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"WIndows activation        HelloI just upgraded my pc. I have a new motherboard, cpu and ram. I didn't install a new windows but instead I just downloaded new drivers. But now I have windows mark that I need to activate windows. Before I had an activated version of windows 10.","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,First, you'd need to identify if the product key for the windows 10 computer is either a retail or an OEM key.Normally OEM keys are solely embedded to one motherboard as they do not have transfer rights for other hardware, unlike retail keys which has transfer rights.For free upgrade licenses, the condition for these are relevant to an OEM key as the license is then considered a digital license once you upgraded free to windows 10.Under this link are reference to activation after hardware change https:\/\/support.microsoft.com\/en-ph\/help\/20530\/...For your windows 10 license, I'd recommend running the activation troubleshooter. Go to Settings>Update and security>Activation and run the troubleshooter. and select I recently changed hardware on this device.If the troubleshooter hasn't helped, you would have to call Microsoft during support hours to get more help.https:\/\/support.microsoft.com\/en-in\/help\/405170...","Hello,I bought a windows 10 pro standard edition retail key from cdkeysdeals.com.","We'd need to identify the state of your current license as of the moment. 1. Open start menu and locate command prompt, run it as admin 2. Execute this command in command prompt slmgr \/dlv Take a screenshot of the window that will pop up after the command executed then attach it to your next reply.","Hello!","As per checking, your license is retail therefore it should have transfer rights to the new motherboard. Please do run the activation troubleshooter.","Hello!","Go to Settings>Update and security>Activation and run the troubleshooter. and select I recently changed hardware on this device and check if it would generate an error message","This message showed up.","Hi Erlend, In that case, it'd be best to reach Microsoft for this matter https:\/\/support.microsoft.com\/en-in\/help\/405170...Let me know how it goes. :)"]},{"symptom":"how to recover accidental deleted file on local network on windows        I have accidentally deleted a file from the Local Area Network while browsing. Is there any way of recovering.  It is not found on the Desktop Recycled Bin where the Local Area Net was browsed.  Is it still on the Cache that can be recovered.   Does file in Network Folder deleted has another Recycled Bin","solutions":[]},{"symptom":"Asus error on startup        I have very recently upgraded my system from Windows 7 to Windows 10 via use of the Windows 10 Media Creation Tool.All went well and all seems to work ok apart from an error I get on startup, which is as follows:AsusSetupDoes not support this operating system: WNT_6.2H_64The error box pops up twice during startup. After pressing ok to both boxes, the system seems to work perfectly and as yet I have not come across anything that does not work the way it should....Does anyone know why this pops up or what effect it may have and how can it be resolved?Many Thanks","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,I would recommend re-installing the specific driver using the compatibility troubleshooterhttps:\/\/support.microsoft.com\/en-ph\/help\/15078\/...Other than that, I'd recommend disabling third party services\/startup applications that may be causing the pop up to appear1. Go to start menu\/search msconfig 2. On the system configuration window go to the services tab 3. Tick on hide all microsoft service so that this won't be affected 4. Choose to disable all services 5. Next, go to the startup tab and on the window choose to open task manager 6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok 8. A prompt to restart the computer will show up, choose to restart Let me know how it goes. :)","Thanks Gary for the suggestions.The issue seems to be with the motherboard. My desktop has an Asus motherboard (Asus P8H61-M LE\/USB3 Basic Micro ATX) and I am guessing that I need the latest drivers for Windows 10 - unfortunately the Asus website was not very helpful.I will dig around further tomorrow.Cheers,","Fingers crossed Ian! :)"]},{"symptom":"Update failure error Oxc1900101        On several occasions my computer has tried to update only to fail with the noted error.  I've tried several of the fixes shown on YouTube to no avail. What am I missing?","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command promptDISM \/Online \/Cleanup-Image \/RestoreHealthRun these commands on the command prompt to restart windows update servicesnet stop bitsnet stop cryptsvcnet stop wuauservnet stop msiserverRen C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.old net start bitsnet start cryptsvcnet start wuauservnet start msiserverAfter successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartThis should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","I already tried the first approach with no success.  Now I just tried your in-place upgrade, and my computer says its up to date so I'm hopeful.  Thanks for your help.BTW what kind of 3rd party background services would cause this error? I'm running Malwarbytes, IBM Security Trusteer Rapport, and Roboform.  Would either of these cause such an error?","Happy to help Jim! There are a lot of factors which could cause the errors such as third party anti virus or incompatible drivers."]},{"symptom":"Where do i find my downloaded games on my new pc        I bought a new hp computer with windows 8 I downloaded some games off the internet and now im so confused I can not find  the games I downloaded. Where do I go to find what I have downloaded***Post moved by the moderator to the appropriate forum category.***","solutions":["Hi Heather,  Thank you for contacting Microsoft Community and We will be glad to assist you with your concern. As per the description, you have trouble locating the downloaded games. 1. Did you download the games from Windows Store?2. Which website did you use to download the games? Check the location mentioned below for the downloaded games:C:\\Users\\{User Name}\\Downloads  Reply to us if you face any issues with locating the games  or any other Windows Issue, and we would be glad to assist you. Have a nice day!  Hope this information helps.        "]},{"symptom":"Regarding antivirus program        I also have a question about anti-virus software, I have been trying a program called Reason Antivirus on a trial basis but it seems that every time I start up the computer I get anywhere between 2-8 malware viruses that need to be removed yet when I use the windows security it doesn't show any of them on my laptop, can anyone tell me more about the Reason program and is it worth buying the full program and if not is there any programs at a reasonable price?","solutions":["All you need is Windows Defender and Malwarebytes.3rd party AV, Security, Cleanup programs cause problems with Windows Defender which is made by Microsoft people that know the program..The best security sits between the chair and the keyboard.  Watch what and where you click.  If you do not know what is there do not click on \"Click here\".  If you get an email that sates it is from your provider look at the address of the sender.  If it has a couple of letters at the end they are probably the foreign country and that is not where your provider is located.  When downloading programs do it from the maker not anyone else and do not allow any extra items to be included.","Hello Michael, My name is Don and I am a Windows 10 Independent adviser. Have you tried checking on online reviews about this anti-virus software? If not, here's a link to an article about a review on the product that you mentioned:https:\/\/betanews.com\/2019\/08\/05\/reason-antivirus\/There are plenty of helpful information here that can help you decide whether you should buy the full program or not.Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"System Unit will not function        Hey Folks,  I have a computer that i've had for a couple of years now and over a year go i tried turning on the system unit so the computer can turn on and once i did that it seemed as if the computer didn't get a signal or something so i once again presses the button and the button flash started to keep blinking and i couldn't make it stop and until this day the system unit's button still blinks today and i just dont know what to do. By the way i have a Gateway Windows 7 Home Prem OA system unit.Sincerely,Fellow Customer [Moderator Edit: Moved from Virus and Malware forum]","solutions":["Hey Folks,  I have a computer that i've had for a couple of years now and over a year go i tried turning on the system unit so the computer can turn on and once i didthat it seemed as if the computer didn't get a signal or something so i once again presses the button and the button flash started to keep blinking and i couldn't make it stop and until this day the system unit's button still blinks todayand i just dont know what to do. By the way i have a Gateway Windows 7 Home Prem OA system unit.Sincerely,Fellow Customer [Moderator Edit: Moved from Virus and Malware forum]By the sound of your problem it does not boot into Windows.that it seemed as if the computer didn't get a signal or something Either you get a message on the screen saying there is no signal, or you don't.so i once again presses the button and the button flash started to keep blinkingAnd I don't know how a button is flashing.If nothing comes on the screen when you power it on and the screen remains black, I would suggest that you take it to a local and reputable Computer Tech and get them to test the Hardware.Cheers.","Laptop or Desktop Gateway ???","Desktop Gateway"]},{"symptom":"Unable to activate key        I installed windows 10 yesterday, bought a key, installed it all,but when I try to personalise it tells me to activate key,i d it and it tells me,its already been used.Why?","solutions":["Hi Kerry, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Where did you buy the product key? Microsoft Store? Via https:\/\/www.microsoft.com\/en-us\/howtotell\/Shop.... Beware of Product Keys Sold Separately With the exception of Product Key Cards (PKC’s) distributed with COA’s, Microsoft does not distribute products keys as standalone products. If you see a listing on an auction site, online classified ad, or other online page advertising product keys for sale, it’s a good indication that the keys are likely stolen or counterfeit. If you were to purchase and use a stolen or counterfeit product key to activate Windows installed on your PC, the key may not work for activation, may already be in use on another PC, or it might be blocked from use later by Microsoft when the key is reported stolen.","It's all good now,thank you.Everything is working now, as it should be.Think it was just delayed.But all is good now.Again thank you","Great, thank you for letting us know."]}]}