{"windows":[{"symptom":"Reactivating Windows 10 after a software update        Recently did a software update on my laptop and it is telling me that I need to activate windows. This is a second hand laptop and I do not have the product key...I am unsure of what to do.Please help","solutions":["Hi Jonathen 1 Open the Settings App (gear icon on your Start Menu) Go to System - About What Edition (Home, Pro . . etc.) of Windows 10 is installed on your PC Then in the Settings App, go to Home - Update and Security - Activation What is the exact activation error printed there? 2 Click your Start Button, type cmd then right click Command Prompt and choose 'Run as Administrator'Run or paste this command and hit Enter: slmgr.vbs \/dlv Please post a screenshot of the resulting dialog . . .","Hi...thanks for replying...but I've managed to find a solution since through showkeyplus"]},{"symptom":"One Note        I recently completed a reset on my laptop.  Before doing this I copied One Note as well as other files to a flash drive.  I opened the One Note file on the flash drive before beginning the computer reset.  The information, including sections and pages of One Note for Windows 10 and all of my information appeared.  With the reset I was able to keep my files and was using the flash drive as a backup.  Then I reinstalled Windows 10.Once Windows 10 was reinstalled I inserted the flash drive- opened the One Note icon- upon opening One Note, all I have found is a NEW One Note.  How can I locate the OLD One Note version with all the tabs, sections, pages, and my information? ","solutions":["Hello rdb60, I am Andrew an independent advisor. One Note is an online stored notebook that can be read on any device when signed in to the proper account associated with it. To get your notes back open OneNote and find the sign in tab at the top. Once you sign in with the account previously used your notes should reappear. HAPPY NEW YEAR, Andrew","Thanks, but I have signed in, and the only One Note that shows is blank.  All other files, downloads, etc. have loaded.  One Note is the only item which did not load as other files- All files were saved with the reset.  I also had a second flash drive on which I saved One Note three weeks ago.  It will not bring up the version of One Note that is needed.","Ok, can you open One Drive, open the File>Info menu. Open the Backup dialog and search for your backups on the device you stored them.Click Open This should restore the files you backed up."]},{"symptom":"Unexpected message at bottom LEFT of welcome screen.        Today (Jan 1) at the bottom left of the welcome screen, before I logged on, I got this message \"Today is Jane Doe's birthday all day.\"  Words to that effect.  The name was my daughter's name.  I've never before seen anything in that location.  I get annoying \"notifications\" from Facebook and Outlook at the bottom right of the screen, on a small blue window.  I THINK they may be on the welcome screen, or they may only appear after I log on.  There was no background window on this message.  It was just words on the welcome screen.  Does anyone know what's going on???  My daughter's birthday is definitely not Jan 1.tialas","solutions":["Hi Ial Open the Settings App (gear icon on your Start Menu) Go to Personalization - Lock Screen On that page, you will see a list of Apps that are allowed to post a notification on your Start ScreenDoes that give you any indication of where that notification is coming form, if so, you can remove that app from there . . ."]},{"symptom":"Minecraft Windows 10 edition free download        I recently found out that I can redeem a code for the Windows 10 edition of Minecraft,  but was quickly disappointed to see that there are currently no codes. I have seen on other websites that people are saying that there are no more codes given out and if that is false, when will they be restocked?","solutions":["Hi Marcus, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Players who purchased Minecraft Java before October 2018 are eligible to get a free code for Windows 10.https:\/\/help.mojang.com\/customer\/en\/portal\/arti...Is Minecraft for Windows 10 included with the purchase of Minecraft: Java Edition?Players who have purchased Minecraft: Java Edition before October 19th, 2018 can get Minecraft for Windows 10 for free by visiting their Mojang account. Log into account.mojang.com, and under the “My Games” heading you will find a button to claim your gift code. If you purchased Minecraft: Java Edition after October 19th, 2018, the button will not be there, so if you’re unsure of when you purchased Minecraft: Java Edition, that’s a good way to check. Pressing the button will generate a token and send you to a Microsoft redemption page.","Hi Marcus, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Players who purchased Minecraft Java before October 2018 are eligible to get a free code for Windows 10.https:\/\/help.mojang.com\/customer\/en\/portal\/arti...Is Minecraft for Windows 10 included with the purchase of Minecraft: Java Edition?Players who have purchased Minecraft: Java Edition before October 19th, 2018 can get Minecraft for Windows 10 for free by visiting their Mojang account. Log into account.mojang.com, and under the “My Games” heading you will find a button to claim your gift code. If you purchased Minecraft: Java Edition after October 19th, 2018, the button will not be there, so if you’re unsure of when you purchased Minecraft: Java Edition, that’s a good way to check. Pressing the button will generate a token and send you to a Microsoft redemption page. That doesn't help at all. He knows how to redeem the code, he's asking when the codes will be \"restocked.\" How on earth do you run out of digital codes? You guys at Microsoft are just trying to get more money out of consumers by making them purchase the game instead of giving them their free copy. I've looked at other discussions and forums across the web on this same issue, and the replies extend up to current day. That's how bad of a problem this is, yet you guys do nothing.","Hello, I'd also like to inquire when the free claim copies of Windows 10 edition will be restocked? I'd imagine if this remains a consistent problem we will have a way to consistently report it as well, yes? We can do that for you, if it means it'll bump the priority of the problem to the top. I do hope to hear a speedy response from you at your earliest convenience - as that would be the appropriate way to tackle quality control for your product you are providing as well as customer service quality. Talk soon 🙏"]},{"symptom":"How to change my brightness settings?        Can anyone help me how to change my brightness because it seems like i couldn't find any brightness settings on my display settings. So i tried this method where I need to update the display adapters and yes I did try to update both of them but they are already been updated meaning there was no problem. I still can't find a way to change my brightness or or the brightness slider .","solutions":["Hello AimanRahman! My name is Marco, I am an Independent Advisor. I will do my best to help you.You can adjust it via your screen itself, with the physical adjustment button below or in front of your screen.Otherwise, if you have an nvidia video card you can go to the office, right click, and click on \"nvidia control panel\". In the display options you can change the brightness.Same thing if you have an ati radeon, the same steps except you click on AMD Radeon settings.Let me know if it worked.","Hello Aiman, Is this for a device (ex: laptop or tablet) with a built-in display?If so, then you might see if you may be able to use an option in the tutorial below to change your display brightness level.https:\/\/www.tenforums.com\/tutorials\/44213-adjust-screen-brightness-windows-10-a.html"]},{"symptom":"print queue        printed documents not deleting from queue","solutions":["Hi cageyvet Try manually clearing the Print Queue Click Start. Type cmd Right-click “Command Prompt” and select “Run as administrator“ Run the following commands and hit enter after each one: net stop spooler del %systemroot%\\System32\\spool\\printers\\* \/Q net start spooler The print queue on your Windows should now be cleared. Type exit and hit Enter to close Command Prompt It may also be beneficial to uninstall and then reinstall your printer, using the installer which would be available form the support page for your printer on the manufacturers website . . ."]},{"symptom":"error 0x8007000e        how to run troubleshooter","solutions":["Hello cbeskens Thanks for posting Microsoft Community. I'm Marcos Independent Advisor. If you're getting that error when you Windows update then run troubleshooter following these steps:press the Windows key + Q keyboard shortcut. Input the keyword ‘troubleshoot’ in the Type here to search box. Click Troubleshoot settings to open the Settings Select Windows Update and click Run the troubleshooter. The Windows Update might then automatically apply some fixes or suggest some resolutions. Go through any resolutions the troubleshooter provides.Let me know how it goes. Regards.","it did not work, the troubleshooter couldn't locate any problems.Thank you","Hi cbeskens and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that might help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"microsoft daily soliaire games        why did they quit loading a whole month of daily games on microsoft solitaire","solutions":["Hello BobNewgent, I am Andrew an independent advisor. Are you having an issue with the solitaire game, or not getting updated games? I suggest trying to repair the program incase you are not getting updates. To do this press Winkey+I to open Settings. Navigate to APPS, then find your solitaire game, right click it and chose to repair\/restore.If updated daily games were sent out and you did not receive them this should solve issue. If in turn none were sent out unfortunately this is all we can do to help you as we are Windows 10 hardware and software support and do not put out the daily games.Take Care, Andrew"]},{"symptom":"My windows 10 installation in stuck at 72%        i am upgrading my HP monitor from windows 7 to windows 10 and the installation is stuck at 72% for the past hour and i don't know what to do?should i leave my monitor switched on for over night?","solutions":["Hi snehatrihan An upgrade from Windows 7 to Windows 10 can take a long time, definitely the best and safest thing to do is to leave that to continue and hopefully complete, if there is a problem, that upgrade should roll back by itself . . ."]},{"symptom":"i can't use a usb microphone with a usb headset !        hello everyone! thanks for reading this.i bought a usb headset and a usb microphone but they can't work together every time i plugged the two devices in my computer the first one i plugged just works and the other doesn't work and it doesn't even show in my sound control panel.i contacted with the microphone company and they told me that the mic and headset have the same drivers.is there a way i can solve this issue ?","solutions":["Hi mohammadnawas and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.1. Right-click on the speaker icon on the taskbar. 2. Click \"Sound\". 3. Go to the \"Recording\" tab. 4. Click \"Microphone\". 5. Click \"Set as default\". 6. Click Ok. I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"Cant uninstall a program windows 10        Something happened after the last major windows update and something happened with iTunes and other apple windows programs.  and what ive done since has probably made it worse. after doing all of the following windows still thinks there is a version of iTunes installedI reset to the previous install and did a system restore. after this I had the previous version of iTunes but the icon was grey and I want sure it was working properly. When would attempt to reinstall iTunes I would get an error message that it cannot find some iTunes file.A month later (today) I tried again.  This tile I downloaded a third party uninstall program, IObit Uninstall and removed iTunes, but I still got an error message that I had to remove the old program, and when I said ok, it would send me to the control panel, where iTunes is no longer there.So I then went to regedit and removed all reference to apple or iTunes. I had previously removed ALL apple programs.  When I attempt to install iTunes through the MS store I get the following error, \"iTunes could not remove your previous installation. Please remove using Programs and features control panel.iTunes isn't listed in programs and features.Please help","solutions":["Hi Paul. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Guardian Moderator here to help you.Did you check the actual Uninstall location in Windows 10 which is now Windows Settings > Apps > Apps & Features? Control Panel is about to go away.Use iTunes program and not Store App. See troubleshooting steps here to get it installed:http:\/\/www.groovypost.com\/howto\/tips-install-it...https:\/\/support.apple.com\/en-us\/HT204275https:\/\/discussions.apple.com\/docs\/DOC-6562https:\/\/www.howtogeek.com\/howto\/23959\/completel...https:\/\/www.makeuseof.com\/tag\/10-top-itunes-tro...Try using a fresh iTunes download from here as it may be corrupted: https:\/\/discussions.apple.com\/thread\/7984284One of the above has always worked in several hundred cases I've seen in Windows 10 for iTunes install problems.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thanks greg. This sounds encouraging. ","Glad to help, Paul. Keep me posted on your progress as I will be here to help until the case is resolved.","Hi Greg,i tried everything you suggested including all the troubleshooting tutorials you posted and the ninite app.  I removed everything itunes or apple related and Im afraid nothing worked. The only thing i haven’t tried is editing the registry again to delete all itunes\/apple entries. Btw, you cannot download the current itunes.exe file from apple. They force you to install from ms store. When i finally did that i got the following. Your previous iTunes installation must be removed before continuing. Would you like to remove it now?i said yes, and then...iTunes could not remove your previous installation please remove it using the programs and features control panel(Of course its not there anymore)your thoughts? Paul","Hi Greg, What happened to you?  I tried everything (see above) but nothing worked.Please reply.Thanks,Paul","Happy New Year Greg...are you still around?Paul"]},{"symptom":"CONTINUED, AND NOT SOLVED   0x8007001F-0x20006, The installation failed in the SAFE_OS phase with an error during REPLICATE_OC operation        As I am being forced to move to Win 10 from my Win7, I have encountered the above error.I asked for help at https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_7-windows_install-wininstalls\/0x8007001f-0x20006-the-installation-failed-in-the\/a5cedbc9-9119-4798-a91b-a23a22d56275?tm=1576446716379&auth=1&rtAction=1576792306236&page=1And I received help, for which I am grateful,, but I think it was just too much of a problem.Since that post I ran sfc in hops that it would repair itI don't know if if all I need are the Features that are missing from my Turn Features On and OFF menu. Or can I repair win 7 with an old original installation disk. I have 3 hard drives plus a DVDRW, and I have the speakers plugged in and a USB wireless mouse. Is it worth my while to disconnect these?","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues with upgrading to Windows 10, and I certainly appreciate your efforts in trying to resolve the issue by following several troubleshooting steps. I would like to know the make and model of the PC on which you are trying to perform the upgrade. However, to identify the root cause of the issue, let’s try running Setup Diagnostic tool which will look for the exact reason of the error. Refer the articleSetupDiag and share the log files after running the tool. Regards,Prakhar KhareMicrosoft Community – Moderator","I built my computer on a Gigabyte P55-USB3 MotherboardI will download and run the SETUPDIAG momentarily","I updated windows NET to 4.7. That seemed to go quickly, and without a hitch.I ran SETUPDIAG. It did not like that I am still in Hard Boot mode. This is the LogMatching Profile found: SafeModeHardblock - 404D9523-B7A8-4203-90AF-5FBB05B6579BSetupDiag version: 1.6.0.0System Information:Machine Name = SECONDBUILDManufacturer = Gigabyte Technology Co., Ltd.Model = P55-USB3HostOSArchitecture = 1033FirmwareType = PCATBiosReleaseDate = 20100810000000.000000+000BiosVendor = Award Modular BIOS v6.00PGBiosVersion = F8HostOSVersion = 6.1.7601HostOSBuildString = 7601.24540.amd64fre.win7sp1_ldr_escrow.191127-1706TargetOSBuildString = 10.0.18362.418 (19h1_release_svc_prod1.191005-1654)HostOSLanguageId = HostOSEdition = HomePremiumRegisteredAV = Microsoft Security EssentialsFilterDrivers = FileInfoUpgradeStartTime = 12\/22\/2019 5:59:30 PMUpgradeEndTime = 12\/22\/2019 8:21:43 PMUpgradeElapsedTime = 02:22:13CV = ReportId = 9fdd37ce-5721-40c7-bc9b-71aab2ca1ba7Warning: Found Safe Mode Hard Block.The system you are attempting to update is currently booted into Safe Mode.Disable Safe Mode, reboot and try the update again.Last Setup Phase:Phase Name: Safe OSPhase Started: 12\/22\/2019 8:19:11 PMPhase Ended: 1\/1\/0001 12:00:00 AMPhase Time Delta: 00:00:00Completed Successfully? FalseLast Setup Operation:Operation Name: Gather Optional Component statusOperation Started: 12\/22\/2019 8:21:13 PMOperation Ended: 1\/1\/0001 12:00:00 AMOperation Time Delta: 0:00:00:00.0000000Completed Successfully? FalseIt found the Panter and Rollback Logs, and then there were more notes , but they disappeared too quickly. (SetupDiag will not run when I open a Command Prompt.)So do I undo everything that I was told to do for the Win10 Update (Start all services, enable drivers etc) in hopes that Setupdiag will run?","The log shows the upgrade failed because you were in Safe Mode...   Floppy disk controller -- disable in biosDVD drive, disconnect physically, both cables.Remove all non-essential drives, disconnect both cables.JBOD- can you disable it in the bios?Any chance of replacing the Nvidia 460 with a newer, inexpensive one for testing?The Board is suggested for use with Win XP through Win 7..  There is a possibility some component may not work with Win 10..","Hey Saltgrass. Thanks for taking a second look....I am in HARD BOOT because the upgrade did not work in normal mode. (I guess that is effectively Safe Mode). That was a standard suggestion to try if the update failed.I will adjust that before the next running the upgrade.The Floppy controller, I can do,As much as I dislike disconnecting items in the MB, I can do thatI had to look up JBOD. I can disable the secondary drives in BIOS, and\/or disconnect them.As for the video card, I will try to update the driver, but I do not wish to change the card. I just need this computer to keep running so that i can photo edit.I will let you know how things work out..... ","The JBOD, since it is a specialized controller, probably needs to be disabled in the Bios so the upgrade won't see it.The oldest system I have is a P61 motherboard and it is running OK but did fail the first two upgrade attempts.  It had a Firewire controller so I disabled that in the Bios.I had to get a new DVD drive for my 2 year old gaming system because it was having fits and locking up the system.  I got one that specifically stated it was for Win 10 but most of them do not indicate that in their specs.I will be waiting to see..","So, it has been a while....I updated drivers, deleted $windoe$-BS, AND BOOTED in Normal ModeThen I tried to install Win 10. It failed with the same error. I ran SetupDiag and the Log follows;tem Information:                Machine Name = SECONDBUILD                Manufacturer = Gigabyte Technology Co., Ltd.                Model = P55-USB3                HostOSArchitecture = 1033                FirmwareType = PCAT                BiosReleaseDate = 20100810000000.000000+000                BiosVendor = Award Modular BIOS v6.00PG                BiosVersion = F8                HostOSVersion = 6.1.7601                HostOSBuildString = 7601.24540.amd64fre.win7sp1_ldr_escrow.191127-1706                TargetOSBuildString = 10.0.18362.418 (19h1_release_svc_prod1.191005-1654)                HostOSLanguageId =                 HostOSEdition = HomePremium                RegisteredAV = Microsoft Security Essentials                FilterDrivers = FileInfo                UpgradeStartTime = 12\/30\/2019 12:37:47 PM                UpgradeEndTime = 12\/30\/2019 1:46:54 PM                UpgradeElapsedTime = 01:09:07                CV =                 ReportId = 9fdd37ce-5721-40c7-bc9b-71aab2ca1ba7  Warning: Found Dismissible Block for: \"Microsoft Security Essentials\".This is a dismissible message when not running setup.exe in \"\/quiet\" mode.Consider specifying \"\/compat \/ignore warning\" to ignore these dismissible warnings when running in \/quiet mode.For more information about Setup command line switches, see here:\"https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/manufacture\/desktop\/windows-setup-command-line-options\" Error: SetupDiag reports Optional Component installation failed to open OC Package.Last Phase: Safe OS Last Operation: Gather Optional Component statusPackage Name: FoundationError: 0x8007001F Refer to \"https:\/\/support.microsoft.com\/en-us\/help\/947821\/fix-windows-update-errors-by-using-the-dism-or-system-update-readiness\" for possible remediation information.You must manually uninstall \"Microsoft Security Essentials\" before continuing with the installation\/update, or change the command line parameters to ignore warnings if you are using the \"\/quiet\" parameter.Recommend you check the \"Windows Modules Installer\" service (Trusted Installer) is started on the system and set to automatic start, reboot and try the update again. Optionally, you can check the status of optional components on the system (search for Windows Features), uninstall any unneeded optional components, reboot and try the update again. Last Setup Phase:Phase Name: Safe OS                Phase Started: 12\/30\/2019 1:44:23 PM                Phase Ended: 1\/1\/0001 12:00:00 AM                Phase Time Delta: 00:00:00                Completed Successfully? FalseLast Setup Operation:Operation Name: Gather Optional Component status                Operation Started: 12\/30\/2019 1:46:25 PM                Operation Ended: 1\/1\/0001 12:00:00 AM                Operation Time Delta: 0:00:00:00.0000000                Completed Successfully? False I tried to run the Windows Standalone Installer, but it just hung It appears to me that MSE is the problem, so I uninstalled it. Windows Mod Installer Service keeps getting set to Manual after I change it to AutomaticI deleted $Windows$-BS again and tried to install Win 10. It failed and I ran the diagSetup to see what went wrong this time (I had the same Failure to Replicate error. ....and here is the SetupDiag log.... Last Setup Operation:Operation Name: Gather Optional Component status                Operation Started: 12\/30\/2019 1:46:25 PM                Operation Ended: 1\/1\/0001 12:00:00 AM                Operation Time Delta: 0:00:00:00.0000000                Completed Successfully? False  Matching Profile found: OptionalComponentOpenPackageFailed - 22952520-EC89-4FBD-94E0-B67DF88347F6SetupDiag version: 1.6.0.0System Information:                Machine Name = SECONDBUILD                Manufacturer = Gigabyte Technology Co., Ltd.                Model = P55-USB3                HostOSArchitecture = 1033                FirmwareType = PCAT                BiosReleaseDate = 20100810000000.000000+000                BiosVendor = Award Modular BIOS v6.00PG                BiosVersion = F8                HostOSVersion = 6.1.7601                HostOSBuildString = 7601.24540.amd64fre.win7sp1_ldr_escrow.191127-1706                TargetOSBuildString = 10.0.18362.418 (19h1_release_svc_prod1.191005-1654)                HostOSLanguageId =                 HostOSEdition = HomePremium                RegisteredAV =                 FilterDrivers = FileInfo                UpgradeStartTime = 12\/30\/2019 4:06:51 PM                UpgradeEndTime = 12\/30\/2019 5:10:56 PM                UpgradeElapsedTime = 01:04:05                CV =                 ReportId = 9fdd37ce-5721-40c7-bc9b-71aab2ca1ba7  Error: SetupDiag reports Optional Component installation failed to open OC Package.Last Phase: Safe OS Last Operation: Gather Optional Component statusPackage Name: FoundationError: 0x8007001F Refer to \"https:\/\/support.microsoft.com\/en-us\/help\/947821\/fix-windows-update-errors-by-using-the-dism-or-system-update-readiness\" for possible remediation information.Recommend you check the \"Windows Modules Installer\" service (Trusted Installer) is started on the system and set to automatic start, reboot and try the update again. Optionally, you can check the status of optional components on the system (search for Windows Features), uninstall any unneeded optional components, reboot and try the update again. Last Setup Phase:Phase Name: Safe OS                Phase Started: 12\/30\/2019 5:08:30 PM                Phase Ended: 1\/1\/0001 12:00:00 AM                Phase Time Delta: 00:00:00                Completed Successfully? False  Last Setup Operation:Operation Name: Gather Optional Component status                Operation Started: 12\/30\/2019 5:10:31 PM                Operation Ended: 1\/1\/0001 12:00:00 AM                Operation Time Delta: 0:00:00:00.0000000                Completed Successfully? False  Matching Profile found: OptionalComponentOpenPackageFailed - 22952520-EC89-4FBD-94E0-B67DF88347F6SetupDiag version: 1.6.0.0System Information:                Machine Name = SECONDBUILD                Manufacturer = Gigabyte Technology Co., Ltd.                Model = P55-USB3                HostOSArchitecture = 1033                FirmwareType = PCAT                BiosReleaseDate = 20100810000000.000000+000                BiosVendor = Award Modular BIOS v6.00PG                BiosVersion =                 HostOSVersion = 6.1.7601                HostOSBuildString = 7601.24540.amd64fre.win7sp1_ldr_escrow.191127-1706                TargetOSBuildString = 10.0.18362.418 (19h1_release_svc_prod1.191005-1654)                HostOSLanguageId =                 HostOSEdition = HomePremium                RegisteredAV =                 FilterDrivers = FileInfo                UpgradeStartTime = 1\/1\/2020 11:05:39 AM                UpgradeEndTime = 1\/1\/2020 12:04:49 PM                UpgradeElapsedTime = 00:59:10                CV =                 ReportId = 9fdd37ce-5721-40c7-bc9b-71aab2ca1ba7  Error: SetupDiag reports Optional Component installation failed to open OC Package.Last Phase: Safe OS Last Operation: Gather Optional Component statusPackage Name: FoundationError: 0x8007001F Refer to \"https:\/\/support.microsoft.com\/en-us\/help\/947821\/fix-windows-update-errors-by-using-the-dism-or-system-update-readiness\" for possible remediation information.Recommend you check the \"Windows Modules Installer\" service (Trusted Installer) is started on the system and set to automatic start, reboot and try the update again. Optionally, you can check the status of optional components on the system (search for Windows Features), uninstall any unneeded optional components, reboot and try the update again. Last Setup Phase:Phase Name: Safe OS                Phase Started: 1\/1\/2020 12:02:23 PM                Phase Ended: 1\/1\/0001 12:00:00 AM                Phase Time Delta: 00:00:00                Completed Successfully? False  Last Setup Operation:Operation Name: Gather Optional Component status                Operation Started: 1\/1\/2020 12:04:25 PM                Operation Ended: 1\/1\/0001 12:00:00 AM                Operation Time Delta: 0:00:00:00.0000000                Completed Successfully? False   There doesn't seem to be much useful here.Windows Module Installer had been set to Manual again sometime in the installation, so I again put it in automatic.It looks like I will have to get into the BIOS and SATA cables of my computer."]},{"symptom":"Emails from \"*** Email address is removed for privacy ***\" are coming in a different language        Hello,I recently started a family group and my first weekly activity report came in Spanish.Not sure why, all my settings for both Microsoft account and Outlokk are set to English with the correct time zone (EST)Can someone point in the right direction or help clear this issue?Thanks,Moved from:Outlook.com\/ Personalization and ease of access \/ Enabling other languages","solutions":[]},{"symptom":"Windows 10 Debugging Tools not installed        Hi,I've been trying to install debugging tools according to the official pages but there is no Debuggers folder created and I cannot find windbg.exe anywhere in the system.I tried installing through the winsdksetup.exe installer.Any help is appreciated.Thanks","solutions":["What official pages?","I was referring to the docs by Microsoft.https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/drivers\/debugger\/debugger-download-toolsHowever, I tried installing the WDK (Driver kit) and it seems to have worked. I can find the Debuggers folder under C:\/Program Files(x86)\/Windows Kits\/10\/Debuggers.Sorry for the false alarm and thank you for the quick response.Happy New Year!.Best regards,Sonny","Hi Sonny, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved. The default folder for Windows 64 bit systems is : C:\\Program Files (x86)\\Windows Kits\\10\\Debuggers There is both a x86 and x64 bit sub-folder in that folder. Use either. If your version of Windows is 32 bit (x86) it will be : C:\\Program Files\\Windows Kits\\10\\Debuggers ------ Debugging Tools for Windows (WinDbg, KD, CDB, NTSD) https:\/\/docs.microsoft.com\/en-us\/windows-hardwa...Download Debugging Tools for Windows https:\/\/docs.microsoft.com\/en-us\/windows-hardwa...Microsoft Official Support Forums for WinDBG - Free MSDN - Debuggers https:\/\/social.msdn.microsoft.com\/Forums\/window...TechNet - Windows 10 IT Pro https:\/\/social.technet.microsoft.com\/Forums\/en-...====== For developers : MSDN - Developers http:\/\/msdn.microsoft.com\/en-us\/dn308572.aspxMSDN - Developers - Community http:\/\/msdn.microsoft.com\/developer-communities...MSDN - Forums http:\/\/social.msdn.microsoft.com\/Forums\/en\/cate...MSDN - Where is the Forum For…? http:\/\/social.msdn.microsoft.com\/Forums\/en\/what...Another good resource is Microsoft's GitHub. Microsoft GitHub https:\/\/github.com\/microsoft\/Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all.","I got mine from the Microsoft store, as an app.."]},{"symptom":"Windows 10 black screen with cursor after login        Hi, I have been trying to login to my computer for two days but every time I enter my password a black screen with only a cursor appears. I am unable to access anything on my computer besides task manager. I tried to run explorer.exe which did not do anything, I also tried many different fixes which all did not work. Hope you can help.","solutions":["Hi Sean, Start your PC, just as Windows attempts to load (spinning dots), press and hold Power Button for 5 - 10 seconds to perform a Hard Shut DownDo this twice On the third start Windows will boot into the Recovery Environment and from there you can access System Repair, Safe Mode, Command Prompt . . . etc.Please try each option one at a time, then see of Windows will boot . . . Go to Troubleshoot - Advanced Option - Startup Repair See if Windows startup can repair itself Go to Troubleshoot - Advanced Option - System Restore Check to see if you have a restore point you can go back to If you do not have a Restore Point, go to Troubleshoot - Advanced Option - Startup Settings and click RestartUpon restart, press 4 to enter Safe Mode Once in Safe Mode, backup your data if you do not already have a backup Open Device Manager and check to make sure all your Drivers are up to date Reboot to see if Windows will start Normally If the above fails, go to Troubleshoot - Advanced Options - Reset this PC Choose to keep your files and apps, just your files or to keep nothing Then start the Reset","I hope, you might have resolved the issue.In case, if anyone out there has the same issue, you can try the following option to resolve the issue.Whenever you end up with 'Windows 10 blank screen with cursor after login' follow below solution.Step 1: on the blank screen with cursor, Click 'Ctrl+Alt+Del' it will bring you the option for \"Task Manager\" along with other options (You can also use the key combination CTRL+SHIFT+ESC to open the Task Manager directly.) Step 2: Click on Task manager 'File '-->New Task (run)Step 3: Type at Run 'services.msc' (without quotes), it will open windows services.Step 4: Under the services, look for the service name 'AppReadiness' and double click on the 'AppReadiness\" service.Step 5: It will open 'AppReadiness' properties. Click on startup type and select 'Disabled\", Click Apply and click ok.Restart the PC:Step 6: Click on Task Manager 'File' --> New Task (run)Step 7: type at Run 'CMD' (without quotes) -->It will open command promptStep 8: At the command prompt type 'shutdown \/s \/f', this will shutdown the system. Restart the system and you should be able to login without any issues. The above fix resolves what it says in the subject and could be a workaround solution only."]},{"symptom":"sm buss  driver        how do I install or update a sm buss driver controller on windows 10 ","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.If you download and install the latest SM Bus driver from Intel it should resolve the problem - you can get the driver here:https:\/\/www.intel.co.uk\/content\/www\/uk\/en\/suppo... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Regards, David","On the disk that came with the motherboard will be the driver.  It is likely the Intel Management controller or \"ME\" drivers.Regardless, there is no benefit to installing this driver, I've never seen the Intel Management do anything worthwhile."]},{"symptom":"Windows security after fresh install        Hi. I haven't installed windows 10 for a while and just ran through a fresh install from the boot menu.Once everything was set up I noticed that windows security was not active and I had to turn it on by hand. Doesn't seem correct to me?Txs in advance.","solutions":["Hi BigMac11 Yes, it is known after a refresh or Windows 10 Reset that some components in Windows do not start or even work, but that is generally the Windows Store or any of the UWP Apps . . .No harm done this time, because you knew enough to check that you were protected . . .Can you please open the Feedback Hub (Windows Key + F) and report this to the Windows Developers, so they are aware of this problem and can look into this . .."]},{"symptom":"Infini Support LLC        Infini Support LLC is claiming to be endorsed by Microsoft?","solutions":["Hi daledolezil almost certainly a scam. did they call you? if so, definitely a scam. Microsoft will not call you unless you have previously arranged it (eg callback) nor will any other legitimate tech company. the best thing to do with these scammers is to hang up. do not allow them to access your computer do not pay them any money. for more info and to report the scam. https:\/\/support.microsoft.com\/en-gb\/help\/401340..."]},{"symptom":"Trouble searching file explorer using number keys; duplicate numerals not accepted in sequence.        Our company uses numeric codes to identify projects.For example, a specific project, assigned the job number 111-44-23, will be found here:P:\\111\\44\\23When navigating File Explorer, I find it very helpful to use the number keys; for example I would enter: \"111\" <Enter> \"44\" <Enter> \"23\" <Enter> to navigate to this job folder. However, I've found that any time I enter two duplicate numerals in sequence (11 or 44 in this example) the second keystroke starts moving the selection down one folder as if I were pressing the down arrow key.For example; when I enter \"111\" in file explorer, the first stroke selects folder \"110\", the second stroke moves the selection down to \"111\" and the third moves the selection down to folder \"112\".Whereas; if I enter \"121\", the folder \"121\" is selected.","solutions":["Your keystrokes will look at the leftmost character in the file\/folder name only, from top to bottom. Characters other than the leftmost character are ignored."]},{"symptom":"Ghost Drive        A wireless network and a desktop(Dell 3847) with Windows 10 Pro and laptop(Asus) with Windows 10. Network in Explorer shows my desktop and my laptop. If I click on the laptop it shows a drive f: that doesn't exist on the laptop and appears to be a clone of drive d:. If I delete a file from f: it also deletes the same file on d:. How do I get rid of this Ghost drve?","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.What's happening here is that you have shared your drives on the network and the view you are looking at is the shared folders which are available. That's why these have the \"network\" style icon rather than the \"folder\" type you'd see if you were to click on \"This PC\" If you don't actually want to be sharing these folder go to This PC, right-click on the drive (so D: in this case), go to Properties, and then the Sharing tab - you should see an option to stop sharing. (You might also be able to access similar options to right-clicking the icon and going to a \"Give access to..\" option - it depends on your edition of Windows)Regards, David","Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.What's happening here is that you have shared your drives on the network and the view you are looking at is the shared folders which are available. That's why these have the \"network\" style icon rather than the \"folder\" type you'd see if you were to click on \"This PC\" If you don't actually want to be sharing these folder go to This PC, right-click on the drive (so D: in this case), go to Properties, and then the Sharing tab - you should see an option to stop sharing. (You might also be able to access similar options to right-clicking the icon and going to a \"Give access to..\" option - it depends on your edition of Windows)Regards, David Hi David!Perhaps I didn't make my problem perfectly clear!The problem I'm having is that the f: drive on the laptop, as seen from Explorer in Network from the desktop, doesn't exist on the laptop. There is no drive f: on the laptop.And, f: seems to be a clone of drive d: on the laptop.If I get on the laptop and un-share drive d:, will drives f: and d: on the desktop view of the laptop go away?","Hi David;It would appear that to stop sharing a folder is not as simple as sharing!One would think that right clicking the device would have a Stop Sharing option!But, instead, we have to bring up Computer Management as Administrator, click on Shared Folders, click on Shares and then right click on the device and choose Stop Sharing?When I bring up Computer Management\/Shared Folders\/Shares as Administrator on the laptop, it shows not only drive d:, but also drive f: with a folder path of D:\\.If I right click on f:, Stop Sharing is not listed as an option.Stop Sharing is not an option on any of the shared drives.How do I get Stop Sharing as a right click option in Computer Management?Or, how do I remove f:\\?","David;I have successfully removed the Share f:\\ by right clicking drive d, clicking on Properties, clicking on Advanced Sharing, clicking on the dropdown for Share Name, clicking on f, removed the checkmark on Share this folder which removed share f: and unshared drive d:I then went through the process of sharing drive d:After all of this, the desktop no longer shows a drive f: on the laptop.Hope this helps someone else.","Hi, well I'm glad you've managed to resolve the problem!"]}]}