{"windows":[{"symptom":"how to force readyboost in windows 10        i am not able to force ready boost using pendrive .its showing that     \"readyboost is not available as the computer is fast enough \"i would like to have a help from you guys .","solutions":["Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.As the message implies, your computer is fast enough that enabling ReadyBoost will not be beneficial. A common reason is you are already using an SSD as a boot device. Hence I would advise not to try forcing ReadyBoost for your computer.There are some good information about ReadyBoost in the following articles: https:\/\/en.wikipedia.org\/wiki\/ReadyBoosthttps:\/\/docs.microsoft.com\/en-us\/archive\/blogs\/...Please let me know if I can help you further! Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Even if you could run it, I would recommend against it. It was always useless and did nothing to speed up a computer."]},{"symptom":"SWD\\PRINTENUM\\ PDF printer        SWD\\PRINTENUM\\ PDF printer was automatically reinstalled after Windows 10 update, but does not offer \"SAVE AS\" dialogue box and now I cannot find where files are saved. Is there a way to reconfigure without going into .ini file? I am not a developer.","solutions":[]},{"symptom":"delete network fiels        I am on a network and need to delete file folder files from a folder.  It asks me if I want to permanently delete this file; I say yes.It says the action cannot be completed because the file is open in Windows Explorer.  How can I fix this?","solutions":["I Read this article.  https:\/\/www.howtogeek.com\/326462\/what-is-com-surrogate-dllhost.exe-and-why-is-it-running-on-my-pc\/I went to Task manager, deleted the dllhost.exe files (2).  Uploaded files to my software and came back to my folder and deleted them.Don't know if you can send this issue to the developers or not, but apparently there are more people than just little 'ol me that is having this problem.  Yes, I found this suggestion too when googling this error message for you. Glad to see that it solved your problem.You appear to think that respondents in this forum work for Microsoft. Not at all - we are volunteers with no links to MS at all."]},{"symptom":"why won,t aero index work. telling me wrong peramiters.        windows index telling me wrong peramiters can anyone explain.","solutions":[]},{"symptom":"PWP Internal links stopped working        Problem with hyperlink in PowerPoint presentation. I wanted that clicking Skip move forward my presentation.I made a Skip button using a text box with Inserted Hyperlink. But when I exported the presentation to PDF, this skip button proved not to function. It isMicrosoft Office Professional Plus 2013. Thank you in advance","solutions":["Hi Mike, My name is Nick and I am an Independent Advisor. Have you tried the Office Repair tool? 1) Close all the Office programs. 2) Go to the Start and click on it, go to the Settings, then Apps. 3) Locate Microsoft Office 2013 and then click on Modify. 4) Select Online Repair to click the Repair button. 5) Once the process is completed, reboot your computer and check if the issue is fixed. Let me know if the issue is resolved."]},{"symptom":"Power icon missing on laptop        I got a notification that my laptop battery was low, only to find that the normal battery icon is missing from the taskbar. In settings, the battery indicator is set to \"on\" but grayed out. Is this a matter of a weird update, and how do I resolve it?Thanks!","solutions":["Hi David This is a known issue in Windows, 10, this will generally fix that: Open Device Manager (accessible by right clicking your Start Button) Expand the Batteries section For each device in that section: Right click and choose Disable Then right click and choose Enable Close Device Manager","Resolved. Thank you!","Glad to Help!"]},{"symptom":"Realtek File & Sound Issues (Headset)        When I plug in any sort of headphones\/headset into my PC jack, it comes up with this error message (as shown in the images provided). My usual way of fixing this to allow myself to use the mic\/hear sound, I've had to restart my PC multiple times. Can sometimes take 10 restarts. I was wondering if anyone would be able to help me in finding a fix for this issue? It says something about the file not being names properly... I bought a new headset thinking my old ones were the issue, and they are not. Luckily the new ones are Bluetooth, so I can use it that way, however would like to get this way fixed..","solutions":["HiTom That file is part of the software element of the Realtek device driver installationThe best option is to go to the support page for your PC on the manufacturers website, then from there download and install the version they recommend for your PC, that will be more compatible than the version installed by Windows 10 updatesIf you have any difficulty locating that Support Page, what is the Make and exact Model No. of your PC - that will be printed on a sticker on the bottom casing of your PC . . ."]},{"symptom":"At one time, seeing what are inside ALL the selected folders        Simplified, any suggestions how I could see inside of Folder A, B, C at one timePresently, I can only see what is inside of each at a timeBackground: I have a iPod Nano to listen to only podcasts--no music or anything elseiTunes downloads new podcasts and updates into a Windows folder, which is fineHowever, within, each podcast subscription is a folderI have many folders, therefore, which I must checkI would find it easier copying and dropping from Windows into my iPodiTunes seems to be a weird mess on WindowsThings I am use to doing with Windows, Apple has locked out me doing via WindowsAny help or suggestions would be greatly appreciated","solutions":["My God, pay attnetion! That is just a dialog where you select folders to include in the Library!!! It is not an active Library!Here is a test Library created with those two folders. Note the path next to the files listed and the Library's Properties dialog."]},{"symptom":"Internet shutting down without warning- system drag        For the last 12+ hours my computer will suddenly and without notice disconnect from my Wi-Fi. When I try to reconnect, the internet settings will not pop up from the task bar (bottom right), the only option that shows up is the airplane mode. This has happened 3 times.When this happens I also cannot access Network and Internet Settings (cannot open with left click > Network and Internet Settings) (cannot open with right click > Open Network and Internet Settings) (cannot open from the Windows Menu\/search bar) - the window gets stuck in the loading option with the little cog but never opens. When this happens I also cannot do anything in Task Manager. I can open it but I cannot close anything that is open, it immediately goes to 'Not Responding'.When this happens and I try to shut down or restart the computer from the Windows Menu hangs up during restart and I have to do a hard shut down.When I do a hard shut down, upon restart I don't get any errors about closing unexpectedly.FYIOS: Windows 10Computer: Lenovo Flex 5-1570 Laptop.I ran disk checks in cmd and there were no known issues. I updated my hard disk using the Lenovo utility today. Any thoughts?","solutions":["Hi, JHildrich My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps to repair your Internet connections: Enter the Start menu or by pressing the Win + I key combination, open the Settings and click on the Network and Internet option. Once there, we select the Status option from the menu on the left side and, within the configurations and options that are loaded in the right panel, we have to look for the restoration of the network. When you click on this option, it will show us a new window from where we can restore the network in Windows 10. In this way, all network adapters will be removed and reinstalled, and the original configuration of other network components will be restored. net. This implies that if we were using some software, such as a VPN client or virtual switches, we will have to reinstall them.A process that the system performs automatically by clicking on the Reset button that is now displayed in Network Reset in Windows 10 settings. It is normal for the process to not take long, although we must wait until the end completely and restart the computer to continue with the network configuration in Windows 10 as we have done so far.https:\/\/www.kapilarya.com\/how-to-reset-network-...https:\/\/support.microsoft.com\/en-us\/help\/10741\/...You can also check that your drivers are updated. https:\/\/support.microsoft.com\/en-us\/help\/402844...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","\"Enter the Start menu or by pressing the Win + I key combination, open the Settings and click on the Network and Internet option. Once there, we select the Status option from the menu on the left side and, within the configurations and options that are loaded in the right panel, we have to look for the restoration of the network.\"I am not sure if you saw in my original post, but when this occurs I cannot open the Network and Internet Settings. At all, in any way. I can open the settings now, since I am not going through the issue, but when the issue pops up and my internet cuts off, I cannot access the settings menus and so cannot restore the network in that way.","I recommend that you repair Windows completely before you must make a backup of your personal files, third-party software will be removed. Here the link to download the Windows ISO.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Keyboard freezing from time to time        I am currently running Windows 10 v 1909 but with an Update that was installed two or three weeks ago my keyboard began to freeze. At first, it was very subtle, but now it freezes every two or three seconds and the characters I typed appear all at once after waiting for some time (four more seconds). The very same issue is described inhttps:\/\/www.bleepingcomputer.com\/forums\/t\/705896\/random-keyboard-freezing-stuttering-typing-and-typing-delays\/https:\/\/www.sevenforums.com\/hardware-devices\/418209-mouse-keyboard-freeze.htmlI tried to attach a second keyboard to see if it is the problem, but the other one freezes too. I wasn't yet able to find out whether they freeze simultaneously or not.My pc is rather old, but I bought a new SSD half a year ago (Crucial) and added some used 2 gb of RAM (maybe they're broken).In these posts I was told to performan sfc scan, which found some bad files but apparently everything is repaired nowa memory check (don't remember how), which didn't report anything bada checkdisk on my Windows disk, of which I didn't got any report at all (?)However the problem isn't really fixed by any of these steps. Can anyone help me on fixing this?","solutions":["Oh and also the number row just stops working from time to time and is broken until I reboot","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please reset the Keyboard driver and check if it is happening again. Go to Device Manager Locate and expand \"Keyboards\" Right click on the Keyboard driver and select Uninstall. Restart the PC. (The driver will reinstall)","Go to Device Manager Locate and expand \"Keyboards\" Right click on the Keyboard driver and select Uninstall. Restart the PC. (The driver will reinstall) I uninstalled 5 HID Keyboard Devices. My keyboard backlight did *not* switch off. All of them reappeared after a reboot. My problem isn't fixed, the keyboard is still freezing","Please try the following steps and disable the startup services. Then check if the keyboard is still getting stuck.Open msconfig Go to Services tab Click on the check box \"Hide all Microsoft services\" Click on Disable All. Apply > OK Restart the PC.","I restarted but some of the services started by using my pc. The issue was still there.After disabling every service I was able to via the Task Manager (Microsoft ones too) it's working fine for two minutes now. Will post if anything changes.","Alright","Okay since the issue was persisting I removed the old RAM stick that I got with the pc which now has something around 20k hours of usage time and am only using the newer one I bought. And for now it seems to be working fine."]},{"symptom":"Need help        Can you help me?","solutions":["Hi Jaisen, My name is Nick and I am an Independent Advisor. Could you please provide more details regarding the issue?","I am using HP 3830 printer and Windows 10 computer.The printer has stopped working with an error message that the \"drivers\" are not installed.Please help me to install the drivers","You may download and run the HP Print and Scan Doctor to check if it fixes the issuehttps:\/\/support.hp.com\/us-en\/topic\/printscandoctorTo know more about this visit HP Printers - Windows 10 Built-in Driver Failed to Installhttps:\/\/support.hp.com\/us-en\/document\/c04655208Disclaimer: you can find here links to a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"My Microsoft Account is compromised        My Microsoft Account is compromised. Recently I have found out that somebody is trying to access my data. This person created a Microsoft account on another computer and is tracking my moves using browsing history. Please suggest a way to delete all my accounts and log-ins","solutions":["Hi Mike, My name is Nick and I am an Independent Advisor. First you should check your Microsoft Account activity and change your account password. Then you should check your Security Information and two-step verification.You may refer to the links below to know more about this Keep your computer secure at home https:\/\/support.microsoft.com\/en-us\/help\/409206...How to help keep your Microsoft account safe and secure https:\/\/support.microsoft.com\/en-us\/help\/12410\/...How to recover a hacked or compromised Microsoft account https:\/\/support.microsoft.com\/en-us\/help\/10494\/...You should also keep your Security Application (Windows Defender or any third-party antivirus) updated and occasionally run a Full Scan on your computer to check that your device is not infected.https:\/\/support.microsoft.com\/en-us\/help\/401326...Please, let me know if the issue is resolved."]},{"symptom":"Windows update        Trying to update to the November update.I have tried a few times over the last few days.every time after a windows update my computer says troubleshoot or shutdownits seems to be on a loop keeps doing the same thing.","solutions":["Hi,My name is Will, I'm an independent adviser.Are you able to boot to your desktop? I would recommend running a system integrity check in case something is wrong with your Windows installation such as corrupt system files. You can run this from a command prompt with \"sfc \/scannow\".If this check doesn't find any errors then I would recommend trying to update using the media creation tool on the donwload page. This will use a new disk image to update rather than using some of your existing files. So it can often help with a problem like this. It's solved similar issues for me in the past.If you are still experiencing issues or are unable to boot to your desktop. I would recommend trying a repair with boot media. You can make a bootable USB from the media creation tool. We can troubleshoot this stage further if you stil experiencing issues please let me know.I hope that helps","Thanks for the reply.My PC is OK. it will run Windows 10.I only installed windows 10 at the beginning of December 2019.I ran \"sfc \/scannow\". no problems found.If I run the  media creation tool.Will that remove most of my apps and other software ","No if you download the tool and use that to \"update this PC now\" it will perform the update as normal. It just gets the files to perform the update from a different place.","I downloaded theMEDIA CREATION TOOL  DOWNLOADING WINDOWS 10 CREATING WINDOWS 10 MEDIA WINDOWS PREPARING GETTING UPDATES MAKING SURE YOUR READY TO INSTALL CHOOSE WHAT TO KEEPBut I wanted to keep all my programs etc.","I have now used the windows 10 upgrade 9562 and after doing every thing download windows installing windows asking me to restart the computer when it had restarted the onscreen message said trouble shoot or shutdown.This afternoon I have spent 3 hours and I still have not updated my computer.Any comments please.","all the program no work","I have had a similar problem for 3 days following an update.  I need resolution too.","I have spent over 3 hours today and every thing I have been told to do has not worked.This is not the first time I have tried to update windows and someone out there perhaps has the answer to my problem.I have got on my computer may 1903 update.Thanks for reading this.","HIAfter all my attempts to update my computer to the November update nothing worked.I keep getting the  error 08x0070424 some times when I try and update my computer.Any help would be appreciated.              "]},{"symptom":"Microsoft Wanting Access to my Google Account        When I try to sign in right after this screen pops up. Windows wants to access your Google Account *** Email address is removed for privacy *** This will allow Windows to: Read, compose, send, and permanently delete all your email from Gmail See, edit, download, and permanently delete your contacts See, edit, share, and permanently delete all the calendars you can access using Google Calendar Make sure you trust Windows You may be sharing sensitive info with this site or app. Learn about how Windows will handle your data by reviewing its terms of service and privacy policies. You can always see or remove access in your Google Account. Learn ab Cancel ‪I do not want to allow this, but when I deny access, then my emails no longer work.  How can I get rid of this?Jodi Milli","solutions":["Hi Jodi My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.Just for the initial setup, you can first let it access it, then click Stat > Settings > PrivacyChange the option to let Windows 10 access your Calendar and Contacts.","Where do I find the Stat > Settings >Privacy?","Hi Jodi My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.Just for the initial setup, you can first let it access it, then click Stat > Settings > PrivacyChange the option to let Windows 10 access your Calendar and Contacts.","What if I don't want microsoft to have access to anything, including calendars and contacts?  ","Again, where do I find the Stat > Settings >Privacy?  I do not see it in any of the account settings.","Follow the steps below. You can also launch each app, People and Calendar, launch Settings > Accounts then delete the account from there.","Andrea... your solution does not work.  Still getting pop-ups asking for access.  I have two outlook email accounts and accidentally gave microsoft app access to first account without realizing what I was doing.  This email acct worked fine all day until I removed access.    Once I removed access to this account, the pop-ups returned for both accounts.  The threat of having full access to my gmail account to do anything they want is BS.  Try again!","My privacy settings were already set that way.  I have the same problem with gmail on Outlook on 3 separate computers.  I get no new emails from gmail since this started on May 30.  I can't imagine that allowing Microsoft to delete all my gmails is a solution.  A Google and Microsoft fueding?  Gmail is free but I had to pay for Office 365.  It is not working for me now.","Andre - I have the same problem. Further, I am not using Windows 10, so your solution is not applicable to me. I am using Windows 7 Professional.Thank you for continuing to research this issue.Earl","Just out of curiosity how is it that this is happening?Windows has never asked for access to my Gmail account nor has Gmail asked for access to my Outlook account.Probably because I manage them separately.When I want to access my Gmail account I sign into it over at Gmail LoginNOT by trying to access it from Microsoft Mail or Microsoft Outlook.Keep them separate and they won't care about each other. It's only when people try to cut corners by adding accounts from different services so they can read them all in the same place that the other services want access."]},{"symptom":"I got an error that The icons service failed, please try again        I got an error message that The icons service failed, please try again. It happened when I was trying to load the icons in Powerpoint. I tried to restart the laptop but the issue is here","solutions":["Hi William, My name is Nick and I am an Independent Advisor. This issue is not caused by your Microsoft Office because icons are delivered by a Microsoft server. In case the server goes down, the users may get this error message. You may wait for a while and try again later. Please, let me know if the issue is resolved."]},{"symptom":"make Windows 10 automatically log in        How do I make my system automatically log on, not wait for me to type a password?","solutions":["Hi wmswaim to remove the need to enter the password on boot click start type netplwiz and press enter untick \"users must enter a username and password...\" click apply (if it is already unticked, tick the box and click apply then untick it again and click apply)you will be asked for a username and password (used to automatically log on). if you are using a Microsoft account enter the FULL email address. enter and verify your password and click ok next time you boot the computer it will automatically log on. NOTE - there is no need to switch to a local account, it WORKS perfectly well with a Microsoft account, as long as you enter the full email address in the username field.blank passwords are NOT a good idea. do not forget the password. to prevent it asking for a password when waking from sleep, go to settings -> accounts -> sign-in options under \"require sign-in\" select Never. hope that helps please let us know if you experience any problems.","Hello wmswaim,Option 1 in the tutorial below can help show you how to set up netplwiz to automatically sign in to an account at the startup of Windows 10.https:\/\/www.tenforums.com\/tutorials\/3539-sign-user-account-automatically-windows-10-startup.htmlIn addition, the tutorial below can show you how to turn off require sign-in on wakeup.https:\/\/www.tenforums.com\/tutorials\/11129-turn-off-require-sign-wakeup-windows-10-a.html"]},{"symptom":"Windows 10 - Removable Drive Icons do not work        I have several removable drives, USB sticks and SD cards, all of which have custom drive icons which load via a autorun.inf file. The autorun and drive icons are located on each drive.Recently, windows replaced these drive icons with a generic icon which looks like a gray box standing on end.There does not seem to be a way to get the system to recognize the custom icons. The drives all work normally in other computers, just not my computer.So far I have tried:- Restarting the computer,- The registry key fix:  HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\DriveIcons\\E\\DefaultIcon,- Updating the drivers,- Updating Windows 10 in general,- Removing and replacing drives (both with, and without ejecting them),- I have followed the suggestions on several websites, but nothing worksNothing seems to make any difference.Any ideas how to fix this? Computer data: Microsoft Surface Pro 7, Windows 10 Pro","solutions":["Hi JGreg7, I'm Roshan V S, Independent advisor and a Windows user like you. Since you tried various methods and it doesn't fix the issue. I suggest you to perform a repair upgrade of windows 10. It will fix issues with corrupted system files and problems like this. Check this article for a detailed reference:https:\/\/www.microsoft.com\/en-in\/software-downlo...https:\/\/www.groovypost.com\/howto\/perform-repair...Note: This is a non-Microsoft website. The page appears to be providing accurate,safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Do get back with the result. I will be glad to help if you need further assistance.","I just got back around to this.   I am unsure of how to do the repair installation.I purchased this computer a few months ago, and the only option was to include Windows 10 Home version.   I upgraded Windows 10 to Windows 10 Pro, version 1903.  Since I did this the day I brought this home, I do not know if windows Home version had the same problem.The question is; which version of windows would I download to do the repair installation?Re-install the Home version and upgrade again?  Install the pro upgrade version?I do not know if a upgrade is exactly the same as a complete installation.  I have a lot of configurations done, and programs installed, and I do not want to start over.Any ideas?"]},{"symptom":"Windows Spotlight lock screen picture won't change        Hello,I have an HP laptop running Windows 10, and usually when my laptop is locked, the picture changes every now and then on my lock screen and I really enjoyed that. But recently for the past month or two, it's been stuck on the same picture and it stopped changing to new pictures. I checked my settings and I still have \"Windows Spotlight\" set as my lock screen but still nothing happens. It just stopped working and changing pictures for some reason.If anyone can help, please do!","solutions":["Just follow these steps of Windows Central:How to fix Windows Spotlight Lock screen errors Is Windows Spotlight broken or stuck on the same image? If so, this guide details the steps to fix the issue.Windows Spotlight is a feature included with Windows 10 that uses Bing to automatically download and set new background images on the Lock screen, to keep your experience fresh every time you sign in.The only caveat with Windows Spotlight is that sometimes it will stop working, or you'll notice that it gets stuck on the same image. Unfortunately, Windows 10 doesn't include an option to reset this feature. However, it's possible to fix the Windows Spotlight settings with this simple workaround.In this Windows 10 guide, we show you the steps to fix Windows Spotlight on your computer and keep getting fresh images from Bing on your Lock screen.How to reset Windows SpotlightIf the Windows Spotlight feature is stuck on the same image, or it's not working at all, you can use the following steps to fix the issue:Open Settings.Click on Personalization.Click on Lock screen.Under \"Background,\" make sure Windows Spotlight is NOT selected and change the option toPicture or Slideshow.Use the Windows key + R keyboard shortcut to open the Run command.Type the following path and click OK.%USERPROFILE%\/AppData\\Local\\Packages\\Microsoft.Windows.ContentDeliveryManager_cw5n1h2txyewy\\LocalState\\AssetsSelect all the files (Ctrl + A) and hit the Delete key to clear all old images (if applicable).Use the Windows key + R keyboard shortcut to open the Run command again.Type the following path to where the Windows Spotlight settings are stored and clickOK.%USERPROFILE%\/AppData\\Local\\Packages\\Microsoft.Windows.ContentDeliveryManager_cw5n1h2txyewy\\SettingsRight-click settings.dat and roaming.lock individually, then clickRename and name them settings.dat.bak and roaming.lock.bak.Restart your computer.Open Settings.Click on Personalization.Click on Lock screen.Under \"Background,\" make sure to enable Windows Spotlight.Once you complete these steps, you can lock your PC (Windows key + L), and the Lock screen should show new Bing images.If everything worked as expected, remember to go back to the Settings folders where Windows Spotlight stores the settings and delete thesettings.dat.bak and roaming.lock.bak files.Alternative method to fix Windows SpotlightIf the steps mentioned above didn't fix Windows Spotlight, you can try to reset the settings using the following steps:Open Settings.Click on Personalization.Click on Lock screen.Under \"Background,\" make sure to enable Windows Spotlight. (If you don't enable the feature, you're likely to get an error while running the PowerShell command.)Open Start.Search for Windows PowerShell, right-click the result, and selectRun as administrator.Enter the following command and press Enter to reset the Windows Spotlight:Get-AppxPackage -allusers *ContentDeliveryManager* | foreach {Add-AppxPackage \"$($_.InstallLocation)\\appxmanifest.xml\" -DisableDevelopmentMode -register }Restart your computer.After completing these steps, you should be able to lock your PC (Windows key + L), and the Lock screen should show new Bing images.Source: https:\/\/www.windowscentral.com\/how-fix-windows-spotlight-stuck-same-image-windows-10?passport=1526946645"]},{"symptom":"Windows Photo Viewer (in windows 10) can view Webp file, but the image become dark        Hi allI use windows 10 and Windows Photo Viewer (WPV) as my photo viewer applicationThe WPV is working fine, but every webp image that I open become much darker than the original.In the desktop thumbnails, the image is showing true colors, but when opened in WPV is becoming dark (you can see the comparisons in picture below)(this is the thumbnails view)(this is when opened with WPV)I already tried to download webp codec (as many website recommended), but its not working at all. the image is still dark.Can everybody give me a suggestion? I really need help. Thanks! PS: I installed irfanviewer as photo viewer apps, and the webp file is showing fine, the image is not becoming darker.But I really comfortable with using WPV, so I hope to use WPV as my default apps to open webp file.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. I believe this is a photo rendering issue. If the webp images are rendered this way in WPV then there is little we can do. But I would suggest you to kindly open these webp images at another app save as another format which is perfectly rendered in WPV."]},{"symptom":"Cannot connect to organisation activation service when trying to activate windows 10        Hi, I've been trying to activate windows 10 after changing my motherboard, however, when I open the activation screen, then it says \"We can't activate Windows on this device as we can't connect to your organization's network. Error code: 0x8007232B\" I try troubleshooting it however it tells me to connect to the server in which I don't know-how.Is there a way to fix this as it was activated before my motherboard change?","solutions":["Hi mohanmehra 1 Are you seeing a 'Windows will Expire' notification or a Windows activation notification?2 Do you know the history of your PC or version of Windows? Was your PC new or used when you purchased it or was Windows reinstalled by a PC Repair Shop?3 Click your Start Button, type cmd then right click Command Prompt and choose 'Run as Administrator'Run or paste this command and hit Enter: slmgr.vbs \/dlv Please post a screenshot of the resulting dialog . . .","Hi Dave,I am not seeing any notifications with regarding expiry or activation. I had brought this 5 years ago, brand new and installed windows after buying it,I have attached the image of the dialogue below,Thank you,","Hi mohanmehra Thank you for that information . . . Is your Windows 10 licence based on an OEM licence (came pre-installed on a PC) or Retail (purchased separately to a PC)If it is a Retail licence, then it will have transfer rights to a new Motherboard or PC, if it is OEM it will not . ..If your Windows 10 licence is retail, then your best option is to contact Microsoft Support and ask them to help you re-activate your Windows 10Or choose a local Phone Number: https:\/\/support.microsoft.com\/en-us\/help\/13948\/..."]}]}