{"windows":[{"symptom":"photo settings in windows 10        when opening photos , then opening specific folders within photos , each photo only shows the icon not the actual photo, this is the same for every folder within the photos folder. How do I set the pc to show the photos not the icon","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.When you're looking at your Pictures folder click on the \"View\" ribbon along the top, then along at the end click \"Options\", and from that choose \"Change folder and search options\".In the \"Folder Options\" window which then appears go to the View tab and make sure the option \"Always show icons, never thumbnails\" is NOT ticked and then click OK at the bottom of that window,Regards, David"]},{"symptom":"Windows 10 Touchscreen Driver Errors        I bought an HP laptop a little while ago, and eventually the touchscreen stopped working.  Like Annisa- inthis thread, I followed some advice somewhere to uninstall the touch screen driver, and restart, but it never reinstalled. Again, like in that thread, one of the I2C HID drivers has an error (code 10).I tried reinstalling the Intel HID Event Filter, reinstalling the I2C HID Driver, etc, and none of them worked.  Any help is appreciated, thank you!","solutions":["Hi CHP. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) Try all fixes which are working for Touchscreen here: https:\/\/www.groovypost.com\/howto\/fix-unresponsi...https:\/\/www.makeuseof.com\/tag\/fix-touchscreen-w...http:\/\/www.dell.com\/support\/article\/us\/en\/04\/sl...https:\/\/support.hp.com\/lt-en\/document\/c034881482) If nothing above helps then Update the Display driver from the PC or Display adapter maker's Support Downloads web page for your exact model number, HP Serial Number or Dell Service Tag - from the sticker on the PC.While there check also for newer chipset, BIOS\/UEFI firmware (very important), network, sound, USB3 and other drivers, comparing to the ones presently installed in Device Manager reached by right clicking the Start Menu.Also find and install the latest touch drivers for your model, even if they are current. If that doesn't help then right click touch device to Uninstall, restart PC to reinstall. Each manufacturer has a different name for these touch drivers which are explained in the links at top, but also can be found for your model by googling the \"full make and model + Touchscreen driver\" or reporting it back here so I can find it for you.If this doesn't give you the latest or ideal driver for what you need, compare it to the driver offered by the Intel driver update Utility here:http:\/\/www.intel.com\/content\/www\/us\/en\/support\/... or the Nvidia Update utility here: http:\/\/www.nvidia.com\/Download\/Scan.aspx?lang=e... or the AMD autodect utility here: http:\/\/support.amd.com\/us\/gpudownload\/windows\/P... For Display issues one fix that is working is to Roll back or Uninstall the Driver on the Display Device > Driver tab, restart PC to reinstall driver.You can also try older drivers in Device Manager > Display device > Driver tab > Update Driver > Browse > Let Me Pick.Then you will know you've tried everything in addition to Windows Update drivers.3) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 4) If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Autocorrect        How do I stop Word in Windows 10 from capitalizing the first letter of a line of type?I want to corect my own mistakes, when they are mistakes.And where to I see an answer to my question?  I would love to get email at *** Email address is removed for privacy ***","solutions":["Hi Seth. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.You should get a notification email with my reply and a button to Reply in your thread. If not just go to Community, click on your Profile icon in top corner, then Profile, scroll down to your thread.See here how to turn off auto-capitalization in Microsoft Word: https:\/\/smallbusiness.chron.com\/turning-off-aut...https:\/\/www.technipages.com\/word-enable-disable...See here how to turn off auto-correct in Microsoft Word: https:\/\/www.computerhope.com\/issues\/ch000564.htmI hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Finding those Settings was not as easy as you made it sound, but I was finally able to find them - and I'm such a hard-head I UNCHECKED everything, one at a time.  I haven't tried typing yet, but I feel sure it will work.  ThanksPS - do you know how to get rid of that ugly \"Finger Pointer?\"","Let me know if it's works for you. What finger pointer? Can I see a screenshot following this guide to capture a screenshot and attach it using Attach Image button in reply box:http:\/\/windows.microsoft.com\/en-us\/windows-10\/o... ?"]},{"symptom":"OneDrive syncing issue        I set up OneDrive on my external hard disk (Seagate Backup Plus 4TB) to sync my music folder. It synced 522GB\/714GB. I am on Windows 10 Pro 1909. Since then it has beenstuck. I tried resetting OneDrive through %localappdata%\\Microsoft\\OneDrive\\onedrive.exe \/reset to no avail. I logged out my OneDrive and logged in again. I checked my folders' names' lengths. The largest was 174 characters. (If one folder's name is too big or the file size too large, OneDrive won't sync it in the first place, right? So those two things won't be the problem, right? Even if they were synced, the probematic files won't halt the entire synchronization, right?)","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as you are facing difficulties in uploading the data on to OneDrive as it has been stuck. We appreciate your effort in troubleshooting the issue. Let me help to point you in the right direction for support related to OneDrive issues. We do have dedicated support team for OneDrive and you can get in touch with them for further assistance. Follow the below steps to contact the OneDrive support team. Sign in to OneDrive.com from any browser or Open OneDrive App, click the ‘?’ help icon on the top banner of the page and selectEmail OneDrive support. Submit your question and follow the prompts to request support. Regards, Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"error 8024200D        The monthly security update has failed every time it's been tried since at least March 2019. The error code is 8024200D and when I click on Get help with this error code the list does not include this error code. Surely someone somewhere in Microsoft must know what causes this error code message. In case there was a problem with antivirus software preventing something from being installed, I uninstalled my Kaspersky Total Security AV software, but that changed nothing about the update failing with this error code.","solutions":[]},{"symptom":"Windows 10 update 1903 continued woes        My PC has been trying and failing to update from 1709 to 1903 all year (prior to that it would fail with earlier updates due to lack of disk space, but I subsequently did some housekeeping and this wasn't the cause of the 1903 failures, although nothing would really indicate its cause).  It was incessant in its attempts, popping up annoying dialog boxes on screen asking me if I want to update now and although it was usually inconvenient (and I know from bitter experience, futile), occasionally it caught me out when I was typing in another window and off it went an another doomed quest to install the latest update, leaving me without a PC for another 40 minutes.However, quite inexplicably, on 27th December 2019, an update was inadvertantly triggered and it worked!  Well, it took a round about route to \"working\", after this update attempt I was getting a BSOD (KMODE EXCEPTION NOT HANDLED) but with no details as to why, no driver name or anything to go on.  After a few failed attempts to auto repair and a trip via Safe Mode the PC decided it would boot up just fine.  Much to my amazement, it welcomed me to the latest version of Windows 10 and I was surprised to see it was now successfully running 1903!  After so long and so many failures, it had finally done it.  However, my celebrations were to be short-lived, for the next day, turning on the PC I got the BSOD again, and this time I couldn't shake it off.  Every reboot\/repair attempt resulted in another BSOD.  Safe Mode and various other recovery options to no avail, I relunctantly selected to restore to the previous Windows Update and here I am again, back at 1709 and typing into this form at answers.microsoft.com, facing another potential long road of update attempts\/failures.I have removed a bunch of old software that I don't use anymore, checked my drivers are all up-to-date, run a hardware test and checked again that disk space if all fine - which it is.  This should be a very healthy system.  I am now waiting for the new storm to arrive, as I dare not invite the Update I know is coming any earlier for fear of losing more days of productivity.I've long had the sneaky unsubstantiated suspicion that this may be related to my Sound Blaster Z-Series, although I'm on L13_1_01_06 which is the latest version.  The reason I have this feeling is because in the past I had problems with the driver and I had to uninstall\/reinstall it to get it working.  Twice.  Also, during my aforementioned BSOD boot loop problem, occasionally I'd start hearing static from the sound card, although all sound is working just fine again now back in 1709.If I get another BSOD in the days or weeks ahead, are there any tricks I am missing for determining the driver that caused it?  The boot log didn't help, and I noticed when it is reporting KMODE EXCEPTION NOT HANDLED that it seems to spend a short time recording some data.  Is that data all going into the event log, seems unlikely to me?  Or is there some other secret stash of information that might help me narrow down the cause?Also I have heard that 1903 was full of bugs and sounds like I've found a fair few of them myself.  1909 is out ... is it worth trying to go straight from 1709 to 1909, or is that just going to make my life ever more complicated?All I ask is for a PC that boots every day without issue.  A tall order, perhaps ... heaven knows, I've been in the PC business since Windows 3.1.  Perhaps I should bite the bullet, give Windows the final kick goodbye and install Linux instead.  At least when Linux goes wrong I have more than half a chance of debugging it and figuring out where the problem lies and fixing it.","solutions":["Hi C34. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.We are way past 1903 and now settled into 1909 which is relatively stable, probably because it's small without forcing a bunch of new features.So I would manually upgrade to the latest version 1909 by opening the Media Creation Tool from this link:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m..., choose Download Tool Now, then open the tool and choose Upgrade This PC Now. This saves your files, apps and most settings in place, is the most stable method to change versions, brings your Updates current, resolves most problems. If any problems report back the verbatim error and number, then continue with these steps for overcoming Version Upgrade problems:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If the Version has problems I will work with you to try to resolve them. If the problems are unfixable for now, you have ten days to roll it back in Recovery settings. You can then hide it so it doesn't try to reinstall following this same method:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... Most problems are resolved by doing this gold standard Clean Install which should get you past all difficulties as it has millions of others who have followed the steps in this link and never come back to report another problem:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... . So read it over and see if its something you want to learn to do.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to rate my post, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Drive corruption after swapping hardware - how did it happen?        My goose is already pretty much cooked through and through with this so I'm beyond the support stage. All the data was corrupted in this process and recovery software isn't helping, I'm just wondering what went so wrong.Earlier this month I decided to make the jump from Intel to AMD and I only recently put everything together. Windows is BSOD'ing like crazy and after confirming it wasn't my hardware that was the problem, I attempted to look through the software. The blue screens start happening quicker and quicker until I'm simply left pre-login screen with the loading indicator spinning.I jump into the recovery environment and working through CMD I discovery that my EFI partition is gone, that's why bootrec wasn't working. I mull over trying to fix the problem for a day and attempt to fix the EFI partition but CMD isn't giving me any success. Feeling royally screwed, I decided to reinstall windows, I could use a good spring cleaning anyways.After the reinstall, things seem stable so I install all the needed drivers and everything seems fine. A half-hour goes by and I'm setting up the new install when I get a driver power BSOD. I restart, uninstall, and reinstall the drivers figuring that something didn't install correctly. I've had this happen before so I wasn't unfamiliar with the issue. I work for an hour and things seem fine. I go to My Computer and notice that only the NVME I installed Windows on is showing up. Ah, that's right, I unplugged my hard drives before reinstalling Windows so I wouldn't accidentally format them in the install process. I shut down, plug them in, and restart.Disk Management is promptly brought up and all my hard drives are showing up as unallocated. With MiniTool Partition Wizzard, I recover the drives and assign them a letter. Everything is on them and seems fine so I restart the computer again, now everything is not fine again. The blue screens are back, my drives are unallocated again, and after some searching, I find out that it's the storage drivers that are the problem. I uninstall those and reinstall generics in their place and restart.I bring up My Computer again and my drives are missing once more. Disk Management shows the hard drives now as all RAW partitions. I do another partition recovery and while two of the three drives recover successfully, one wasn't so lucky. After attempting a data recovery with both MiniTool and EaseUS, I'm finding names and folders of what used to be on the drive, but the gigabytes of video recordings that used to be present on the drive, are now only megabytes of corrupt data.The same thing would also happen with a backup SSD but that only contained images of my previous Windows installation, no big loss since nothing important was on it.Between the three hard drives, two SSD's, and an NVME drive, I got seven terabytes of storage space for a reason, so stuff like this doesn't happen. Here I am though, wondering why this happened.I'd much rather not go the NAS route, but I think that's what I'll have to do from now on.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as you are having difficulties with the storage drive after swapping from Intel to AMD.  Let me point you in the right direction, where you would get the appropriate help for this issue. I would suggest you to post your query inTechNet forums, where we have experts and support professionals who are well equipped with the knowledge on such issue where you are having issues with SSD and NVME storage drive, you can also ask for NAS route to assist you with the appropriate troubleshooting steps. Regards, Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"Upgrade Windows 10 Home to Pro without fresh install        I have been trying to upgrade my machine from Windows 10 Home to Windows 10 Pro but nothing seems to work. I have the default Windows 10 Pro product key provided to me by a Microsoft support representative. I have also attempted with a couple other valid Windows 10 enterprise keys. I tried changing my product key to perform the upgrade but I get a message that says \"unable to upgrade your edition\". I also tried using the windows media creation tool but I am never asked what version I would like to install. Instead I go through all the steps and it says that I am about to install Windows 10 Home again. How can I make it not default to Windows 10 Home or accept my Windows 10 Pro product key? Also I really do not want to have to do a clean install.","solutions":["Hi Julian. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.It will no longer Upgrade to a higher version without an existing Digital License. You'll need to go offline to change to Pro, then once it's changed go back online to submit the retail Product Key.Did you copy and paste the Pro Generic Version Key VK7JG-NPHTM-C97JM-9MPGT-3V66T in Settings > Update & Security > Activation > Change Product Key? This should change the version to Pro. Then insert a retail Product Key in the same place to activate.But you said you have Enterprise keys which are used only by large organizations and business who activate via an on-site server, not retail customers. Do you have Enterprise version?","Hey Greg, thanks for the response. Yes I do have the generic Pro key. I also have enterprise keys from the company I work for but I was told that I would have to do a clean install from their volume license installation center. I will proceed with the Pro key so I can simply upgrade without deleting any apps or data. Now just to confirm, I should go offline and go about doing the install through the windows media creation tool again? Will it prompt me to choose a version this time or at least allow me to enter the Pro product key once it has reinstalled?","I didn't say anything about the Media Creation Tool. I said exactly what to do so please go back and follow the steps I gave which work for everyone else. If not then tell me exactly how it fails and any error message.","Try Microsoft\/TechNet answers for that upgrade.https:\/\/social.technet.microsoft.com\/Search\/en-US?query=windows%2010%20home%20edition%20to%20windows%2010%20professional&ac=5Don't forget all pc MB controllers must be reinstalled,go to youre pc mfg web\/downloads\/save assave to a cd.The Chipset software driver is 1st,then storage software,Intel uses Intel storage mgr."]},{"symptom":"Can't sign in into the Microsoft store app.        Recently I tried to download a game which requires me to sign into my account. After I hit continue I immediately get the message shown below. I've tried resetting the app and my windows is currently updated to the latest version.","solutions":["Hi PS. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything possible to repair the store. Even if you've tried a step please do it over in this sequence. If any steps cannot be performed then report it and move on to the next:1) Try updating Store apps: https:\/\/support.microsoft.com\/en-us\/help\/402625... 2) Make sure you have the latest Windows 10 version 1909 in Settings > System > About and if not skip to Step 10 to install it by the most stable method.3) See if the fixes here help: https:\/\/www.pcworld.com\/article\/3053099\/windows... 4) Try running the Windows Store apps Troubleshooter at Settings > Update & Security > Troubleshoot.5) Try resetting the Store cache: http:\/\/www.thewindowsclub.com\/reset-windows-sto... 6) If that fails go to Settings>Apps and highlight Microsoft Store, choose Advanced Settings, then Reset. After it resets, restart PC.7) If that fails then reinstall Store. Type CMD in Start Search, right click Command Prompt result to Run as Administrator, copy the following code and paste it into the box using the Edit tools from Box's top left dropdown menu, press Enter:PowerShell -ExecutionPolicy Unrestricted -Command \"& {$manifest = (Get-AppxPackage *WindowsStore*).InstallLocation + '\\AppxManifest.xml' ; Add-AppxPackage -DisableDevelopmentMode -Register $manifest}\"8) Clear the LocalCache Folder: Open Run by pressing the Windows key + R hotkey. Copy and paste %localappdata% in Run and click OK. Open Packages> Microsoft.WindowsStore_8wekyb3d8bbwe > LocalCache folder. Press the Ctrl + A hotkey to select all content within the LocalCache folder. Press the Delete button. 9) If these all fail then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account because of the serious and persistent problem with corrupted accounts. Then continue with the other steps to go over your install most thoroughly.10) If nothing else works then do a Repair Install, by installing Media Creation Tool and then choosing to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Window10 cannot login with correct password after changing Boot to \"Safe boot\" mode        My mother has been using her windows 10 PC for a long time with everything normal. Recently to speed up the OS reboot, I helped to change Startup options (disable unnecessary apps at startup) and also changed the Boot-up option to “Safe boot” mode, like the following:  Somehow after these changes, we could not login to windows 10 anymore with correct password (confirmed the password is correct with the eye icon at the right side of the login block). I also tried different input language options, but all failed. Another abnormality is the internet connection at the login page – no internet connection and no way to choose internet setting although the WIFI at my home is normal. I also tried to plug in internet wire cable directly to the laptop, still no internet connection. The login page is like the following: The password my mother has been using to login to windows 10 is the same as her Microsoft account PS. I tried the same PS on her Microsoft account, and indeed it works normal. Now my suspicion is 1) the “safe boot” mode prevents internet connection at the login page, 2) internet connection is a must for login to windows 10 with Microsoft account. Is this true? If so, how could I fix the issue? Could anybody please help?(It is urgent since I have to fix the issue before she leaves US in a couple of days. Appreciate your help.)PS. I tried to login with safe mode, but it still asks for password which I failed to move further.   ","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.By enabling Safe Mode you've disabled all network drivers which is why it can't get online from the login page. Having said that the last Microsoft account password that the computer knew about would usually work anyway.However as you can't get the password to work you need to try and restart to \"Safe Mode with Networking\". You can do that from the login page you are currently seeing by holding down the SHIFT key and then choose the power button symbol and then Restart - keep the SHIFT key held down until you see the recovery options screen. The instructions at the following link explain how to get to the option you need (Solution 2):https:\/\/windowsreport.com\/safe-mode-password\/Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Regards, David"]},{"symptom":"something interrupted our troubleshooting. make sure you;re connected to the internet, wait for a few minutes and try again error code: 0X80004005        Hi,I have been having trouble with windows activation for the past few days. I reset my laptop which is an Asus GX501. This deleted all files and reinstalled windows 10. Windows 10 has been successfully updated with a digital license however after a day it says the status becomes \"Windows is not activated\" with the following error message: something interrupted our troubleshooting. make sure you're connected to the internet, wait for a few minutes and try again error code: 0X80004005I have tried clicking the \"Troubleshoot\" link but only to get the following error:So I tried to reset my laptop again to get a clean installation of Windows 10. It has been activated with digital license successfully but after a day, a prompt showed up upon log in asking to have my windows to get activated again. It showed the same above-mentioned problem in the \"Windows Activation\" panel. For what its worth, I checked if there are integrity violations but there were none:Also, I live in the Philippines so I wouldn't be able to chat with a human support using a US number to have this activated.","solutions":["Hi Asus. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.A Reset is never a Clean Install which requires wiping all partitions off the hard drive which is what defines \"clean\" in an install. A Clean Install is here:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...How was Windows 10 originally Activated on the PC? Did it come preinstalled from Factory, was it Upgraded with free or paid Upgrade, or was it a retail copy and license?For Upgrade, when you first upgraded and it activated it assigned a permanent Digital License to the PC in Microsoft Activation Servers so you can reinstall any time and in any way you want as long as you reinstall the licensed version. It should reactivate soon after going online. More about Digital LIcenses vs. Product Keys here: https:\/\/support.microsoft.com\/en-us\/help\/12440\/...You can move the Digital License to new hardware following this procedure: https:\/\/support.microsoft.com\/en-us\/help\/20530\/... Factory installed WIndows 10 has the Product Key embedded in BIOS or UEFI firmware and should activate itself, but you can check for the key by installing ProducKey:http:\/\/www.nirsoft.net\/utils\/produkey-x64.zip to copy and paste the OEM-BIOS key into Settings > Update & Security > Activation > Change Product Key.Retail keys must be reinserted for reinstalls during install or in Settings. What is the Status and Edition shown at the top of the page at Settings > Update & Security > Activation?Run the Activation Troubleshooter at Settings > Update & Security > Activation. If it says you have a Digital License then no matter what method above only the Generic Version Key can be inserted to reactivate:http:\/\/winaero.com\/blog\/generic-key-to-install-... If this fails you can contact Microsoft Support by one of these phone numbers: https:\/\/support.microsoft.com\/en-us\/help\/405170...You can also go here: https:\/\/partner.support.services.microsoft.com\/... choose the link for Browser help, interact briefly about your exact problem until it connects with an agent.I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"I can't activate windwos because it says it cannot connect to Organization servers but I'm not in an organization.        So I recently switched a bunch of parts for my pc like motherboard and cpu and now windows doesn't work because it says It cannot connect to organizations servers but I am not in any organization. Error code: 0x8007232B","solutions":["Hi FelixEriksson1, My name is Riccardo and I'd be happy to assist... The error you are receiving is because it can't reach a KMS Server. You are probably asking what a KMS is - it's a Key Management Server. This is generally used for organizations.Do you happen to Have Windows 10 Enterprise installed? Can you do the following and post back a screenshot? Go to Start > type in cmd and press enter Type in: slmgr \/dlv Post back the screenshot for this."," Sorry my windows is in Swedish hope it works","The license if showing GVLK which is a Generic Volume License Key - do you have a copy of your Windows 10? What version do you have? Did you happen to purchase this computer used and just had the copy of Windows?","I bought my original computer about 3 years ago and it had windows in it, Right now I have windows 10.","Do you have the disc \/ media that you obtained from the company you purchased this from?","I did not get one.","You may have to go back to the original manufacturer of this computer - if you did not receive an OEM copy of the media or have some sort of sticker or proof of purchase this may have been licensed incorrectly and you may have to purchase a retail copy.","The PC is from Acer but I bought it at a Retailer.","On the bottom or anywhere on the computer do you see a Windows sticker? In any of your documentation do you see this?","No sticker and I don't have any documentation."]},{"symptom":"Texting multiple recipients in Your Phone app        Hi,I just downloaded and started using the Your Phone App.  So far I like it, however, I can't figure out how to text multiple recipients on the same text.  Am I missing something?Thanks!","solutions":["Hi Eleni My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.When you click on New Messsage, then click in the 'To' field, you should be able to type in the contacts name separated by a semi colon then followed by the other contacts name.Here is a tutorial: https:\/\/www.tenforums.com\/tutorials\/119892-send...Information in the above link is sourced from a trusted Microsoft MVP blog.","Hi EleniBraley, I'm Charles, an Independent advisor trying to help. When adding a user, usually to the right or left depends on the application is the + button to continue adding? You do not appear?Go to Messaging >> Click on sign (+) >> Search \/ write the name of the first contact, then >> Search \/ write the name of the second, by clicking >> Sign (+) again >> Define the content> Send the SMS.All related information is in this article, which does not have a section for sending SMS to multiple peoplehttps:\/\/support.microsoft.com\/en-nz\/help\/445935...I hope these steps also work for you Attentive to any comments Have a happy day Best Regards, Charles.","Hi, To complement, however, I have verified and it does not show me the option because I have slow synchronization, try to apply these steps, if they are not available, it is likely that the option is not currently available, after the steps I add an article that informs everything related to the subject, where this option is not mentioned. Regards.","Your tutorial link only shows one contact, the question relates to multiple contacts, easy on the phone impossible it would seem on the Microsoft App. Just the sort of reason you might want to use a PC app for messaging??","Anybody have a solution for this?Once I enter a single recipient on the To line and resolve it, I can no longer edit the To line. If I include multiple, semi-colon delineated recipients by name, they will not resolve. I can \"Reply All\" to an existing text message and it will be sent to all recipients.Please do not reply with links to tutorials that do not specifically cover this topic. Thanks.","This does not work. Once you have added a recipient you can no longer type in the field to type a semicolon, additional name, or anything else.","There simply is no plus sign. If you can make a quick video of you adding multiple recipients, I would love to see it.","You say you are an independent advisor but you clearly haven't grasped the problem, please don't reply to something if you don't have a valid solution. \"Should\" do something is not advice it's speculation. It doesn't work and takes away from the value of having a desktop based app. I will be deleting it!","So why post if you haven't a solution, just wasting users time to try to advertise other products.","Has anyone found a solution yet?   "]},{"symptom":"Microsoft Jigsaw        I can't get into Microsoft Jigsaw at all.  I can't even get into Microsoft store.  What is causing this and can it be corrected?","solutions":["Hi AliceMy name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.What error message do you receive?Hope this helps."]},{"symptom":"Can't play DVDs        I have a Dell Inspiron 3670\/Windows 10 desktop computer.  I cannot play DVDs with the Windows Media Player.  No problem playing CDs.  I don't get any error message.  There is a small arrow at the bottom of the page with the message \"retrieving media info\" but the DVD never plays.  I've tried several DVDs, both commercial and homemade - same result..","solutions":["Hi Harold, Windows Media Player does not offer the ability for DVD playback. You can get Windows DVD Player here: https:\/\/support.microsoft.com\/en-ca\/help\/10771\/...Let me know if you need further assistance."]},{"symptom":"2desktops        why do i have 2 desktops also why does my system take so long all the time to connect almost all the time","solutions":["Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.The other desktop with the folder icon is your frequently visited folder that shows in your Quick access. You can disable it so it won't display by going to File> Options> Under Privacy in General tab, Uncheck \" Show frequently used folders in Quick access\" > Apply then OK With regards to your other concern, have you tried using another browser when browsing the web? If this happens on all browsers, you can check this video for troubleshooting steps:https:\/\/www.youtube.com\/watch?v=RBwtQEWt6L0(Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.)I hope this helps with your concern! Please let me know if you have further questions."]},{"symptom":"windows 10 saving a file.        so my laptop is having trouble with saving files to 'this pc', I would like to know why is it saying that I can't save a file and how to fix it please?","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.\"This PC\" isn't actually a location you can save to, it's a collection of other locations where you can save... you need to select another folder below that such as \"Documents\", \"Desktop\", \"Pictures\", etc, and save your file there.Regards, David"]},{"symptom":"Windows 10, version 1909 - Error 0x80070005        MS WIN 10 team,I am unable to get Feature update to Windows 10, version 1909 - Error 0x80070005keeps failing.  Please advise.","solutions":["Hi,I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Try updating to 1909 using Media Creation tool and if it fails let us know.The fastest way to get the upgrade is through Media creation tool or ISO file.Please download Media Creation Tool from the link below and select Upgrade this PC at the first screen.https:\/\/go.microsoft.com\/fwlink\/?LinkId=691209All steps, including upgrading using ISO file and Media creation tool, are covered here:https:\/\/www.yourwindowsguide.com\/2019\/11\/update...Content on the above blog is written by a Microsoft MVP so it is safe.","l have been having the same problem.No matter what l do and\/or try, NOTHING works, and l still can not get my PC to update.The biggest problem l am having with this update, and any updates, is that it cause my PC the completely freeze or be completely unresponsive - one example - it can take up to 30 mins or more just to shut down, or you click on an app. and the PC takes forever to do it.The only solution l have found to fix this is to restart PC three or four times - and that can take ages.l believe the main reason for my PC to act like this is WINDOWS UPDATE.","Went through the MCT step and the History shows that there have been multiple failures to install 1903 and 1909 over the last months.  The steps I took in your installation did not end up with a successful installation.  I did turn off my VPN but not the MS Defender tool.  The web shows that many people have this issue and there are some pretty complicated suggestions, and not sure that any work. I am sure this is only a MS issue and that Apple would not have this problem.  Any link to advice that will get me on the right road.thanks,Stan","Why do we install win10 again and a lot of some other programs? Is this windows bug?","20 minutes of \"Windows 10 Setup\" getting ready, going around in circles and no sign of progress.  nasty memories of a similar update problem a few years ago that the PC never recovered from.....  Sorry but I have to bail on this!","And now more than an hour of \"Setup is cleaning up before it closes\"  - not a good sign......","I can not install anything or update anything on my pc running windows 10, I keep getting error issues everytime i go to update a app or try searching something in the search area","I solved my problem with installing win10 again. Or try windows recovery."]},{"symptom":"windows 7 can not see windows 10        I got a new computer with Windows 10 18363. how can i get my windows 7 computers see it in the network","solutions":["Hi Steve My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Network discovery requires that the DNS Client, Function Discovery Resource Publication, SSDP Discovery, and UPnP Device Host services are started, you may check this on both sides to make sure they are started by pressing the windows key and type services, click on the result and checking the services above are set to automatic and started.Hope this helps.","Hi Steve My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Network discovery requires that the DNS Client, Function Discovery Resource Publication, SSDP Discovery, and UPnP Device Host services are started, you may check this on both sides to make sure they are started by pressing the windows key and type services, click on the result and checking the services above are set to automatic and started.Hope this helps. All set to automatic and started. Restarted both PCs and still the same Win7 can not see Win10","Hi Steve1. Make sure file sharing is switched on the windows 10 computer.Open Control Panel.Choose View network status and tasks under Network and Internet.Select Change advanced sharing settings in Network and Sharing Center.Choose Turn on file and printer sharing or Turn off file and printer sharing, and tap Save changes.2. Enable file sharing through the firewall on the windows 10 pcClick Start, and then click Control Panel.In Control Panel, click Windows Firewall.In the Windows Firewall dialog box, click the Exceptions tab.On the Exceptions tab, select the File and Printer Sharing check box, and then click OK."]},{"symptom":"Meus jogos não rodam mais no Windows 10 [Translation - My games no longer run on Windows 10]        Já faz praticamente um mês que venho tendo dificuldades e muitos inconvenientes com alguns jogos específicos quando tento executá-los no meu computador. Os que apresentaram problemas até o momento são estes:Conan Exiles, Crash Bandicoot N'Sane Trilogy,Spyro Reignited Trilogy e League Of Legends. Também estou tendo problemas com o aplicativo daBlizzard Battle.Net.Todos os jogos são originais, comprados e instalados pelo aplicativo da Steam da Valve, porém mesmo fazendo todos os procedimentos possíveis, não consigo mais jogá-los.  Já tentei diversas alternativas como reinstalar os jogos, verificar a integridade dos arquivos, atualizar o Direct X, atualizar o Visual Basic c++, rodar com compatibilidade, atualizar todos os drives do pc, incluindo o da placa Nvidia, voltar atualização do Windows e da placa Nvidia para a versão anterior e outras coisas mais, porém os mesmos erros ainda persistem.Antes quando instalei a versão pirateada dos mesmos jogos, baixada por Torrent, estavam rodando perfeitamente sem qualquer problema, erro, falha, bug, lag ou delay, consegui até fazer algumas lives pelo Mixer, porém quando tentei reinstalá-las de novo para comparar os arquivos, elas começaram a dar o mesmo problema que os originais. Ou seja, acredito que a questão não é o jogo em si, mas de algo no computador.Eu já não sei mais o que fazer para arrumar ou para o que apelar. São apenas estes jogos que apresentam problemas. Outros que tenho instalados no pc sãoMonster Hunter World, The Witcher 3: Wild Hunt, The Elder Scrolls V: Skyrim - Special Edition, The Elder Scrolls Online, Okami HD entre outros e nenhum deles apresenta qualquer erro ou problema para ser executado.Estas são as especificações do notebook gamer que uso:- Marca: Acer- Modelo: AN515-51-50U2 Sistema Operacional:- Windows 10 Home 64-bitCPU e Chipset:- Intel® Core™ i5-7300HQ- 7ª geração – Quad Core- 2.5 GHz - 3.5 GHz com Turbo Boost- 6 MB SmartCache- Chipset Intel® HM175Memória RAM:- 8 GB tipo DDRPlaca de vídeo:- NVIDIA® GeForce® GTX 1050 com 4 GB de memória dedicada GDDR5Armazenamento:- Disco rígido de 2.5” com capacidade de 1 TB- SATA III (6 GB\/s) – 5.400 RPMO aplicativo da Blizzard Battle.Net não se maximiza na tela, embora eu consiga executar os jogos que tenho (World Of Warcrafte Overwatch) pelos atalhos na tela inicial do pc, porém não posso mais acessar a loja ou mesmo instalar novos jogos já que a janela não se mostra.No caso de League Of Legends, o jogo não abre na tela, embora apareça o ícone na barra de tarefas e a musica da tela de login comece a tocar. Fica apenas um pequeno retângulo branco na tela e que não ajuda em nada.Com Crash Bandicoot N'Sane Trilogy não funciona quando a placa Nvidia é ativada para processas os gráficos do jogo, ele só responde se for deixado para rodar na placa daIntel HD Graphics e que não tem capacidade de suportar e rodar bem o jogo, deixando ele de10 até no máximo 15 fps, isso quando não trava.Já Conan Exiles e Spyro Reignited Trilogy  apresentam os seguintes erros:Conan Exiles:Fatal error:[File:E:\\B\\branch_exiles-stable\\code\\Engine\\Source\\Runtime\\Windows\\D3D11RHI\\Private\\D3D11RHUntil.cpp][Line: 232]Result failedat[File:E:\\B\\branch_exiles-stable\\code\\Engine\\Source\\Runtime\\Windows\\D3D11RHI\\Private\\D3D11Viewport.cpp:289with error 8876017cSpyro Reignited Trilogy:LowLevelFatalError[File:D:\\Bamboo\\buildbot-package\\Engine\\Source\\Runtime\\Windows\\D3D11RHI\\Private\\D3D11Util.cpp] [Line: 233]Result failedat D:\\Bamboo\\buildbot-package\\Engine\\Source\\Runtime\\Windows\\D3D11RHI\\Private\\D3D11Viewport.cpp:303with error 8876017C0x0000000030F89129 KERNELBASE.dll!UnknownFunction []0x000000005D4AE87B Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005D45BB88 Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005D8E9D0E Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005D8DABEA Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005D8E19F1 Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005DCD661A Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005DCD43F1 Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005DE19CE9 Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005DE1A465 Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005D776EA2 Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005D7885DC Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005D78809C Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005E25EC17 Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005E011A40 Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005D0D47EB Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005D0D017C Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005D0D037A Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005D0D6D20 Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005EF880C7 Spyro-Win64-Shipping.exe!UnknownFunction []0x0000000033B77974 KERNEL32.DLL!UnknownFunction []0x000000003456A271 ntdll.dll!UnknownFunction []0x000000003456A271 ntdll.dll!UnknownFunction []Translation: It's been almost a month now that I've been having difficulties and many drawbacks with some specific games when I try to play them on my computer. The ones that have had problems so far are these:Conan Exiles, Crash Bandicoot N'Sane Trilogy, Spyro Reignited Trilogy and League Of Legends. I am also having problems with the Blizzard Battle.Net application.All games are original, purchased and installed by Valve's Steam app, but even though I do everything possible, I can no longer play them. I've tried several alternatives like reinstalling games, checking file integrity, updating Direct X, upgrading Visual Basic c ++, running with compatibility, upgrading all pc drives, including Nvidia card, back windows and card upgrade Nvidia for the previous version and other things, but the same errors still persist.Before when I installed the pirated version of the same games, downloaded by Torrent, they were running perfectly without any problems, errors, crashes, bugs, lags or delays, I even managed to make some lives for Mixer, but when I tried to reinstall them again to compare the ones. files, they started to give the same problem as the originals. That is, I believe the issue is not the game itself, but something on the computer.I no longer know what to do to fix or what to appeal to. It is only these games that have problems. Others I have installed on the pc are Monster Hunter World, The Witcher 3: Wild Hunt, The Elder Scrolls V: Skyrim - Special Edition, The Elder Scrolls Online, Okami HD among others and none of them have any errors or problems to run.These are the specifications of the notebook gamer I use:- Brand: Acer- Model: AN515-51-50U2Operational system:- Windows 10 Home 64-bitCPU and Chipset:- Intel® Core ™ i5-7300HQ- 7th generation - Quad Core- 2.5 GHz - 3.5 GHz with Turbo Boost- 6 MB SmartCache- Intel® HM175 ChipsetRAM memory:- 8 GB DDR typeVideo card:- NVIDIA® GeForce® GTX 1050 with 4 GB of dedicated GDDR5 memoryStorage:- 2.5 ”hard drive with 1TB capacity- SATA III (6 GB \/ s) - 5,400 RPMThe Blizzard Battle.Net app doesn't maximize on the screen, although I can run the games I have (World Of Warcraft and Overwatch) by the shortcuts on the pc home screen, but I can no longer access the store or even install new games since the window is not shown.In the case of League Of Legends, the game does not open on the screen, although the taskbar icon appears and the login screen music starts playing. There is only a small white rectangle on the screen and it doesn't help at all.With Crash Bandicoot N'Sane Trilogy not working when the Nvidia card is enabled to process game graphics, it only responds if it is left to run on the Intel HD Graphics card and is unable to support and run the game well, leaving he from 10 up to a maximum of 15 fps, when not locking.Already Conan Exiles and Spyro Reignited Trilogy have the following errors:Conan Exiles:Fatal error:[File: E: \\ B \\ branch_exiles-stable \\ code \\ Engine \\ Source \\ Runtime \\ Windows \\ D3D11RHI \\ Private \\ D3D11RHUntil.cpp] [Line: 232]Result failedat[File: E: \\ B \\ branch_exiles-stable \\ code \\ Engine \\ Source \\ Runtime \\ Windows \\ D3D11RHI \\ Private \\ D3D11Viewport.cpp: 289with error 8876017cSpyro Reignited Trilogy:LowLevelFatalError[File: D: \\ Bamboo \\ buildbot-package \\ Engine \\ Source \\ Runtime \\ Windows \\ D3D11RHI \\ Private \\ D3D11Util.cpp] [Line: 233]Result failedat D: \\ Bamboo \\ buildbot-package \\ Engine \\ Source \\ Runtime \\ Windows \\ D3D11RHI \\ Private \\ D3D11Viewport.cpp: 303with error 8876017C0x0000000030F89129 KERNELBASE.dll! UnknownFunction []0x000000005D4AE87B Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005D45BB88 Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005D8E9D0E Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005D8DABEA Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005D8E19F1 Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005DCD661A Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005DCD43F1 Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005DE19CE9 Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005DE1A465 Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005D776EA2 Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005D7885DC Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005D78809C Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005E25EC17 Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005E011A40 Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005D0D47EB Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005D0D017C Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005D0D037A Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005D0D6D20 Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005EF880C7 Spyro-Win64-Shipping.exe! UnknownFunction []0x0000000033B77974 KERNEL32.DLL! UnknownFunction []0x000000003456A271 ntdll.dll! Unk","solutions":["Salve Amigo tudo bem? Você por um Acaso tentou após utilizar versões piratas, reinstalar o Windows? Outra questão é, o windows é legitimo? Por isso que versões piratas não são recomendados. mas Pelo que eu vi os jogos com problemas estão em plataformas proprietárias que não são do Windows (como é as plataformas Blizzard e Steam e Riots) sugiro você Reportar para o Windows a Ultima Atualizações mas mais ainda Reportar erro na Steam, no Battle.net e na Riots do LoL","o meu também nao roda mais LoL e hoje baixei conan,rage 2, também nao vai... ja fiz de tudo...depois que atualizei a placa Nvidia gtx 1050 não funciona ,dai voltei p atualização anterior da placa e também nao resolveu... csgo,the witcher 3 ate rodou...se alguém puder ajudar agradeço."]}]}