{"windows":[{"symptom":"All feature update failed, still on 1709        Okay, time to ask the community....I really am stuck to Windows 10 1709 x64Last update was;Feature update to Windows 10, version 1803 x64 2019-08CFailed to install on ‎26\/‎08\/‎2019 - 0x8024200dI always get black screen after login.I know this is a hot topic but none of the solutions is working for me.For example I cannot run the task manager ... it just doesn't response.Sometimes I get the message window about Personalized Settings...After this I am NOT able to go back to previous version ... always get the message that something went wrong.The only thing is to do is a total restore of the disc ....As I am stuck I only can do these regedit, sfc and DMIS things before upgrade ... but doesn't help at all.Why is this happening I why all these strange error codes?More importantly, why is this still not fixed by MS?Any advise would be welcome.","solutions":["Hi Matthijs I am Vijay, an Independent Advisor. 1903 is the latest feature upgrade and you should try to upgrade to 1903. You should upgrade to 1903 through Media creation tool to have a successful upgrade.. Execute the below steps to go to 19031. Windows Key+X > Windows Powershell (Admin) Type following (or copy and paste following) one by one and Enter net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver 2. Type following in Windows Start Search box (Cortana) and hit Enter %systemroot%\\Logs\\CBS > Rename CBS.Log to something else.If it doesn't allow you to rename - Type services in Windows Start Search box > Click Services > Scroll down to find the Windows Modules Installer service and double-click on it > Set its startup type to Manual > Reboot your computerGo to C:\\Windows\\Logs\\CBS > Rename CBS.Log > Reboot your computer > Then go back into the Services App and set Windows Modules Installer Service back to Automatic Startup (Note CBS log files contain information about windows update, SFC etc)(Source - https:\/\/partnersupport.microsoft.com\/en-us\/par_...) 3. A. Optional but recommended step - Take a backup of your computer before you proceed.B. Disable any third party Antivirus (After update is successful, you can enable it again)C. You can go to https:\/\/www.microsoft.com\/en-us\/software-downlo... You can download the latest Windows 10 package from this link (media creation tool) and follow the instructions there to upgrade. Use the very simple instructions given under Using this tool to upgrade this PC to Windows 10D. Before update, remove all USB devices & SD card except mouse. Do let me know if you have any more question or require further help.","Hi MatthijsLet us check the Installation log to find why the update failed. Please share the logs as mentioned in this article.https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/troubleshoot-feature-update-install-failures\/eaf4ff24-64d6-4c72-824c-3ba3df716fc3The Panther logs. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\PantherThe Rollback logs: These usually are created if Windows Update rolls back.  Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\Rollback[Only if the error code is 0xC1900101-0x30018] The Device Install Log from C:\/$Windows.~bt\\Sources\\Rollback\\setupapi\\setupapi.dev.logAs the log size might be large consider zipping before uploading.","I have no clue how to include the Setupact.log and Setuperr.log in this post .. but I check and they just do not make any sense to me.There are no rollback logs as I did a restore to get access to my PC again ... sorry.However I did do the rename of the C:\\Windows\\SoftwareDistribution which at least given me the change to pause updates.I am really not looking forward to any feature update but also would like to keep up-to-date WITHOUT loosing all settings and applications. Because if I need to re-install windows it means I have to do it all again ....","Hi,To upload files, you need to use a file sharing service like Onedrive or Google Drive. Just upload Panther logs if you do not have rollback ones.","Okay, time to ask the community....I really am stuck to Windows 10 1709 x64Last update was;Feature update to Windows 10, version 1803 x64 2019-08CFailed to install on ‎26\/‎08\/‎2019 - 0x8024200dI always get black screen after login.I know this is a hot topic but none of the solutions is working for me.For example I cannot run the task manager ... it just doesn't response.Sometimes I get the message window about Personalized Settings...After this I am NOT able to go back to previous version ... always get the message that something went wrong.The only thing is to do is a total restore of the disc ....As I am stuck I only can do these regedit, sfc and DMIS things before upgrade ... but doesn't help at all.Why is this happening I why all these strange error codes?More importantly, why is this still not fixed by MS?Any advise would be welcome.Have a look at DuncanBushaw1's reply in this thread: https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-performance\/windows-10-black-screen-with-cursor-after-login\/1d471d5f-c88e-4f0a-b69f-1676b369f2dc?page=2&rtAction=1567349959295Unbelieveably, nuking these 6 files from command prompt fixed this issue for me!:cd \"ProgramData\\Microsoft\\Windows\\AppRepository\"ren \"StateRepository-Deployment.srd\" \"StateRepository-Deployment-Corrupted.srd\"ren \"StateRepository-Deployment.srd-shm\" \"StateRepository-Deployment-Corrupted.srd-shm\"ren \"StateRepository-Deployment.srd-wal\" \"StateRepository-Deployment-Corrupted.srd-wal\"ren \"StateRepository-Machine.srd\" \"StateRepository-Machine-Corrupted.srd\"ren \"StateRepository-Machine.srd-shm\" \"StateRepository-Machine-Corrupted.srd-shm\"ren \"StateRepository-Machine.srd-wal\" \"StateRepository-Machine-Corrupted.srd-wal\"","For the past year: Feature update to Windows 10, version 1803 x64 2019-08C will not install and the only option offered by windows 10 is to start another install cycle, which with the same problem.I wish someone would get off his high Ross and come up with a solution. The solutions offered by geeks are for geeks and not the common users of windows and Microsoft.Windows only help is to set another time for automatic restart, limited to 7 days.","I managed to put it on pause again for 30 days .... though not ideal as NO updates are installed.I still need to try the solution by rickwookie though you really need to get into recovery mode as you do not have permission to change these files. I also consider to wait for the 1909 (November 2019) update and hope for the best....I agree, Microsoft should do a better job with these kind of updates which are stucked...Or at least give a better error message which gives you an indication of the \"real\" problem...","Bearing in mind that no one (a person) at Microsoft knows you are having the problem only the system is trying to get you up to date and failing.This could be down to your hardware, or drivers and if it fails to give you version 1803 in theory it has been a problem since April 2018.It may help if you can give the full spec of your device or the make and model if it is made by a known supplier. (HP, Acer, Asus etc) See if there website offers any support for Windows 10 editions or makes available an update path for 1803, 1809 or 1903.Support for 1709 finished in April 2019 but this doesn't mean you cannot update to a more recent version. Sometimes (and relating to black screens support is lacking for older Intel or AMD graphics) so if your graphics are out of support by Intel or AMD then this could be the problem and updating could be a fudge.Another option could be to download a Microsoft ISO image from TechNet and manually try the update. The image files are available at https:\/\/tb.rg-adguard.net\/public.php once downloaded open File Explorer and double click the image to mount it and run the setup file. If you have downloaded the matching ISO for you current system it will check and offer to keep all personal files, Apps and Programs. If not you have selected the wrong options and got the wrong image.If downloading 1809 then go for the later build.","Okay, want to give an update.I tried the 1909 and again failed. But I really got the feeling the upgrade itself was OK.But when you login the first time, something is happening which fails (upgrade personal folder or something?).This is strange as I create a new (clean default) admin account which I also cannot use to get in.So I did aa roll-back again as that seems the only solution to get back into the system.I found the SetupDiag tool from MS at this page:https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/setupdiagAnd after running the tool it reports:SetupDiag reports successful upgrade found.This appears to be a successful update as the last operation was: OOBEBoot and the result was: successNow I wonder how to obtain the log which tells me why the blank screen and not able to run Task Manager.Found this tread as well, which show exactly the problem;Personalized Settings Unresponsive (task manager won't open)Any ideas about how the get around the Personalized Settings?"]},{"symptom":"Connection to network failed after Windows (10) update        Internet was working okay. Windows 10 updated. Now no internet connection. The network adapters all say they are working properly. I have downloaded the latest driver (using another Computer) but this has not solved the problem.Looking in the 'Events' tab there is a message:(Please note I cannot print the other slash key to '\/' as I am using a UK set up on a US keyboard. I will use '#' in its place).Message: PCI#VEN_10EC&DEV_8168&SUBSYS_05921025&REV_06#4&edb6346&0&00AA requires further installation.How do I proceed?","solutions":["Go Settings, Network & Internet, Troubleshoot.","As I expected this says ' a network cable is not properly plugged in or may be broken'.I use the same cable on another computer and it works okay.What I want to know is what does the message in my original query need m,e to do? What requires further installation is stated but how do I do it?","Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues with network connection after updating Windows 10. For further clarity on the issue, please respond to the questions below: Which build version of Windows 10 is installed on the PC?Which updates were installed currently on the PC?What is the make and model of the PC?What happens when you try to install drivers? Refer the article Which version of Windows operating system am I running? To check which updates were installed recently go to Settings >Update & Security > Windows Update >View installed update history Meanwhile, I would suggest you to refer the article Fix network connection issues in Windows and see if that helps. Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator","Previously to posting the problem I carried out the following:1. Windows Recovery2. Network ResetNeither made any difference. (Except to 'lose' all my apps)I followed the 'Fix Network Connection Issues in Windows' but again this did not help.I ran the wlan report in command prompt but the information it gave is beyond my ability to act on it. I would have attached the file generated to this report but I don't know how!I downloaded the latest drivers for the Radeon Family(on another computer obviously) and installed them. No difference.In answer to your request for information about the computer:Gateway with AMD E1-1500 APU with Radeon (tm) HD 7310 Graphics 1.48 GHzWindows Version 1803Installed 29\/12\/19 (this is as a result of using the 'Recovery' mentioned above).OS Build 17134.885Update History has nothing! Presumably because I did the 'Recovery' option.So I am stuck.An aside: I use this Computer for specific tasks and do not browse the internet except to VIEW financial sites. Some time ago my PC was running extremely slowly which puzzled me as I had not installed any programmes after the initial few weeks and I save very small files each month - about 500k.  So I completely reinstalled Windows 10 and this 'solved' that problem. I think, from my poor memory, it took about 48 hours to completely get back to a fully operational setting. So............................... should I reinstall Windows 10 yet again? Would that clear the problem?I would still like to know what the message I originally reported '............... requires further installation' wants. Who or what or what programme does the further installation?"]},{"symptom":"Can Cortana Recognize more than one voice (computer bought 2018. Cortana reinstalled Nov 2019)?        Can Cortana Recognize more than one voice (computer bought 2018. Cortana reinstalled Nov 2019)?","solutions":["Hey donworybhapy, Evan here an Independent Adviser here to assist you... There's currently no multi-user support at this time unfortunately for voice recognition. Sorry to be the bringer of bad news.You may be able to create additional accounts tied to each specific voice but that may be not the solution you are looking for."]},{"symptom":"I accidently switched out of s mode from my new laptop(win10). Is it ok or have i done some crime? Please assist me guys.        I accidently switched out of s mode from my new laptop(win10). Is it ok or have i done some crime? Please assist me guys.","solutions":["Hi Vishnu it is certainly not a crime, nor is it against any license rules, it is entirely your choice, although once you have switched out you cannot go back.all it really means is that you can now install apps from any source and not just the store, you can use any browser and search engine, you are no longer restricted to Edge and Bing.you can restrict installs to the microsoft store yourself if you wish settings -> apps -> apps & features under \"choose where to get apps\" select \"the microsoft store only\""]},{"symptom":"view windows 10 version number?        How do I find wIndows 10 version number?","solutions":["Hello Stevezv, I'm Didi, an independent advisor. To view your Windows 10 version number and other useful information about your system click on Start, type \"settings\", click on \"Settings\", click on \"System\" and on the left pane click on \"About\".You should be able to see your version number under \"Windows specifications\". Regards, Didi"]},{"symptom":"USB flash drive issue        Why Windows 10 laptop does not recognize USB flash driver when there is a file with password on it? Windows 7 does not have this issue?","solutions":["Glad to hear it Amilin3. Let me know if there's anything else. Also when ready please mark the post which helped most as the Answer, to help others. A rating is also appreciated.Happy New Year!"]},{"symptom":"Resizing a display in the layout        I need help resizing the screen. My main Laptop is 4k and the screen attached is 1650 x 1050. Is there any way to, while maintaining their current resolutions, make it so the second monitor is as big as the first in the layout so that when I move my mouse through say the top of the screen , it still progresses to the second screen?","solutions":["Hey Mitch, Evan here, an Independent Adviser here to assist you. I feel a video would be most useful for this explanation...https:\/\/www.google.com\/search?q=move+cursor+up+...I hope the clip helps you and I haven't misread your question. Please let me know if this works and accept the answer I would appreciate it."]},{"symptom":"Window media player, is it required to be installed in computer?        Safe to remove?","solutions":["Hi Bairn_966 If you do not use or need Windows Media Player, it is absolutely safe to remove, no other components or functionality on your PC relies on Windows Media Player to be installed . . .You can remove that from the Settings App 0 Apps - Optional Features . . ."]},{"symptom":"Cannot retrieve Word document        I have lost a previously saved Word document that I was in the middle of editing. I have tried to restore a previous version but cannot find it, and it is not in the Recycle Bin.What else can I try?","solutions":["Hi Fulford, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.This official link has all the recovery options, consult the information and verify which alternative works for you.https:\/\/docs.microsoft.com\/en-us\/office\/trouble...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M."]},{"symptom":"My Bluetooth device is enabled and shows as “Paired”, but isn’t working        My Bluetooth device is enabled and shows as “Paired”, but it isn’t working. How do I resolve this?","solutions":["Hello,Windows 10 changed the status text in the Settings app for Bluetooth devices. Bluetooth devices will only show as “Connected” when the device is actually in use and transferring data. When the device is not active, the status will show as “Paired”.Make sure Discovery is enabled for your Bluetooth devices. (Go to Settings > Devices > Bluetooth> More Bluetooth options.  Then make sure “Allow Bluetooth devices to find this PC” is enabled.) Then try removing and then re-pairing the Bluetooth device.If the issue persists, please reply back to this thread. In order for us to best understand how to resolve your problem, please make sure to provide:The make and model of your computerThe type of Bluetooth device, and it’s driver, version, and date of the driver versionAny details you have regarding the symptoms, such as the error code or message you encounterAny workarounds that you’ve already attempted outside of the steps listed above."]},{"symptom":"Microsoft Store won't download and all fixes I've found won't work either        I've been having trouble with the Microsoft store, all downloads stay stuck as pending. I have followed many bits of advice I've found both here and in other places and they all also stay stuck and never solve anything.I've tried resetting in apps & features, it just stays stuck and the process never completes.I've tried using the command prompt and windows powershell solutions and the same, either nothing happens or it stays stuck mid process.Hope someone can helpThank you <3","solutions":["Hi PsychoDeschain and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/www.kapilarya.com\/how-to-repair-windows...I hope this helps. Feel free to ask back any questions and let me know how it goesThank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Noise wont play from laptop        My laptop wont make any noise unless i use bluetooth headphones, the only noise it makes otherwise is when im in the settings configuring my normal headphones, then it makes noise, but it switches left and right. ","solutions":["Hi Andyman6745, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.As a first diagnosis, I suggest you consult the indications that I share with you of these links, one of them is an official Microsoft, and the other is a website shared by some Windows MVPs.https:\/\/support.microsoft.com\/en-us\/help\/452028...https:\/\/helpdeskgeek.com\/help-desk\/audio-not-wo...If none of the previous steps gave the solution, start Windows through a clean boot, it is an error-proof process, which allows us to detect if any third-party program or driver is generating the problem. Check if the behavior persists or if it is resolved, if it does not happen go to the section >> How to determine what is causing the problem after you do a clean boothttps:\/\/support.microsoft.com\/en-us\/help\/929135...Let me know if you have something else that I can help you with, I'd be happy to help.Happy nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"reset phone number        hello; and thank you for your support; I tried to set my new phone number but, it did not sent me the code vis text messages, though what can I do, please ","solutions":["HI Oop. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Did you enter it here: https:\/\/support.microsoft.com\/en-us\/help\/12428\/... ?Try that first. Report back results.","Hello, Greg Carmack thank you for your support, but unfortunately I lost my way in the rabbit hole. why this is so simple to do with my amazon account and not with my windows account ?","Set my new nuber 8505808572 itdid not send me the cod vis taxt messages thought what can i do please  my email *** Email address is removed for privacy ***update this no 8505808572 so please agens send cod me this number so please ","Go the Security Basics page here: https:\/\/account.microsoft.com\/security Under Security Contact Info, choose Update My Info. If desired remove the phone number shown using the Remove button. Then choose Add Security Info, add your Phone Number, choose if you want verification to come to phone or an alternate email address which you can also add on that page.If you have any problems please explain where."]},{"symptom":"Video Driver Error: 0x887A0005        Using Video Editor to export a project I get this error. I need to know exactly what driver needs updating. I  am running Windows 10 on an HP Laptop product # X7T78UA#ABA, serial # CND6413THR. Any and all help will be appreciated.","solutions":["Hello Bill. I am Andrew an independent advisor. I can say the drivers for your video card most likely need updating in this case.Go to HPs website and find the most up to date driver for your specific video card.It should come as a .exe file, download and execute the file, this will update it.Once done reboot and try exporting the file again.Take Care,Andrew"]},{"symptom":"Windows Edge        I am trying to stop windows edge running, have tried task manager, and turning it off in the privacy apps but when trying to run anotber programme it says it is still running? Any ideas?","solutions":["Hi KB_61 see if the following helps settings -> apps -> apps & features click on microsoft edge click advanced options turn off background apps"]},{"symptom":"Windows Update--Files missing        My computer was recently updated with Windows 10 and now I can't find my files or downloads.  How do I get them back?? I have the message that I can't go back to previous Windows 10 because the updated happened more than 10 days ago.  However, I only saw this new Windows 10 screen last night.  I hope this makes sense.","solutions":["Hi Brendiab Its a bit unclear from your question, did you already have Windows 10 installed and that updated, or have you just upgraded form a previous version of Windows to Windows 10?When you say you have a new Windows 10 screen, please either describe that or if possible a screenshot would help us to understand this better . . .In the meantime: Before you do anything or move any files around Restart (not shut down) your PC 4 times, each time let your PC get to the Desktop before the next restart, this will fix this issue a lot of the time . ..Otherwise: Please open Windows File Explorer Navigate to C:\\Users Do you see two user folders that look like yours? Open those folders and check inside Pictures, Documents . . . etc. and see if your files are thereIf your files are there: Create a new user profile with Admin privileges Log into the new user profile Copy all your data from the old profile to the new profile (Documents Library, Pictures Library . . . etc.)If you still have not found your files, look for a Windows.old folder on your C Drive, expand that to open the users folder contained inside - check there for your files, icons . . .etc.If you do find your files . . . etc. there, copy them out as soon as possible as Windows will remove the Windows.old folder in timeNOTE VERY IMPORTANT: Do Not copy your files into the Temporary profile you are currently in, when the situation is corrected, your files will be deleted with the Temporary Profile and will not be recoverable !!"]},{"symptom":"slow start up        Hi, I am on windows 10 and i have two accounts on my PC computer..mine and my wifes. When I start up the computer my account loads in about 30 secs....but when I then log into my wifes account it takes 5 or 6 mins...even when I disable all the start up programs hers still takes 5 or 6 mins to load. I have run all my virus programs ...CC cleaner, advanced care and avast but to no avail...her account still stakes 5 or 6 mins to load....... if any account should be slow I would expect mine to be the culprit...amd suggestions why hers is so slow and mine isnt.Phil","solutions":["When you sign-in to her account do you switch accounts or do you sign out your account and sign-in to your wife's account.I would suggest being cautious when using CCleaner especially if you let it clean the registry, it can cause more problems that it solves.Windows takes care of registry programs and cleaners are not necessary.","Hi, karateiceman My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps: Press the Start key and type the word CMD or Powershell, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanu p-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/929833...","Hi NeilpzzIf I log out of her acct it takes again a few minutes to log back in. If I don't log out and say switch accounts to mine and then switch back to her account it only takes a few seconds to get back in. It only takes 5 minutes if it is the first time or we have logged back out of her acct. It must be something happening when logging in...Ps... I don't use CC cleaner very often.... In fact rarelyPhil","So just to confirm if you start the PC and sign-in to her account first is it slower than signing-in to your account first or about the same.","Hi Jeffrey,   done the four steps you said and they went through no problem, but the sign in problem still persists...if I 1st sign in it takes 5 mins on the wifes acct, if I dont sign out of my wifes acct and go into mine it only takes a few seconds to get into mine. When i go back into my wifes acct it only takes a few seconds because I didnt sign out, Its only when I have actually signed out or sign in for the first time that it takes 5 minutes....Phil","Hi neil, thats correct, if I sign into her acct first it still takes around 5 minutes to sign in, and my account just a few seconds. If I sign into her acct and then sign into my acct without signing out of hers, when i go back to log into her acct it only takes just a few seconds because I didnt originally sign out. Its only after I have signed out of her acct and then sign back in that it takes 5 minutes to get in.Hope that makes sense.Phil","Configure a clean Windows startup and then check if your PC is still slow and you can add the programs in parts to see what is causing problems.https:\/\/support.microsoft.com\/en-us\/help\/929135...","I've disabled all the start up programs in task manager and it is still slow signing in to her acct...","And you followed the instructions only signing in to your wife's account and not yours. Then checking just her account.","Try creating a new local user https:\/\/support.microsoft.com\/en-us\/help\/402692..."]},{"symptom":"fax & scan        I had windows fax & scan in windows 7.   I put in windows 10 and now I can't find win fax & scan to download.","solutions":["Hi Lynn Fax and Scan should be in Windows 10 by default . . . Click your Start Button, then just type fax Do you see the Fax and Scan App in the resulting list? If not: Open the Settings App (gear icon on your Start Menu) Go to Apps - Manage Optional Features Click the + Button, is Fax and Scan listed there, so you can install it?"]},{"symptom":"\"Your Windows License Will Expire Soon\" in Windows 10 Pro        Hi, I keep getting this message on my screen that my license is about to expire soon and it's annoying. I couldn't get my work done without even interrupting. In my activation setting, it says that \"Windows is activated using your organization's activation service.\"Does anyone here know how to fix the problem? I have tried some solutions but it didn't seem to work. Please help! Thank you.","solutions":["Hi Denisse. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.That message normally means that someone has activated Windows with a Volume License Key meant only for business or organizations that activate a large number of PC's, which need to check in with the organization's server regularly to reactivate.Sometimes this is done by shops or others reinstalling Windows unnecessarily because the PC either came with a Windows Product Key embedded in the BIOS\/UEFI firmware, or it was already activated by free Upgrade or a retail Product Key, and would have reactivated after a reinstall had they given it the chance and not interrupted this by installing the illegal key.If you know Windows was originally activated legitimately by one of these methods then to fix the problem what I would do is go offline to remove the Volume License key and then restore the Generic Product Key that is used to activate with the Digital License issued by Upgrade or Factory install, the factory key embedded in the UEFI\/BIOS firmware chip, or the retail key you used. Then we'll see if it activates:1) Go offline by opening Action center at the right end of Task Bar, then clicking on Airplane mode to turn off internet.2) Next type CMD in Start Search, right click to Run as Administrator, then right click to copy and paste this command in and press Enter: slmgr -upk3) Restart PC and then insert Generic Product Key for your licensed version from here:http:\/\/winaero.com\/blog\/generic-key-to-install-...This sets everything back to default so that if there is a Digital License issued during a proper Upgrade it should reactivate within a few days. If not we will need to try something else:If it doesn't activate after going online and you originally had factory installed Windows, read the Product Key embedded in the UEFI firmware chip at the factory by running ProducKey:http:\/\/www.nirsoft.net\/utils\/produkey-x64.zip, copy and paste the OEM-BIOS key (only) into Settings> Update & Security > Activation.If you were sold a Volume license product key or the PC came from seller activated with one, then It is piracy when someone resells Windows with no way to legally activate it. You can report this to Microsoft here:https:\/\/www.microsoft.com\/en-us\/howtotell\/cfr\/r.... In the past when victims cooperated with an investigation they would sometimes give them a free copy as thanks.You can also contact the seller and let him\/her know you are taking these actions and that they need to make the activation good. Many will comply rather than risk investigation or prosecution.For further assistance restoring the original legal activation you can contact Microsoft Support phone or chat options here:https:\/\/partner.support.services.microsoft.com\/... I hope having all possible options helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thank You! But how will I know if the PC either came with a Windows Product Key embedded in the BIOS\/UEFI firmware, or it was already activated by free Upgrade or a retail Product Key? ","If you don't know that information then what is the full make and model number so I can look up what Windows edition it came with? Check on the sticker on the PC, or by typing System Information in Search box, open SysInfo, scroll down to System Model.So we google the full model + Specs and see what OS it shipped with. Install ProducKey from http:\/\/www.nirsoft.net\/utils\/produkey-x64.zip and look for the OEM-BIOS key. This confirms it came from factory with Windows installed.You said it has Pro.  This might mean it actually had Home (most embedded Product Keys are Home) but they wanted to upgrade and used the illegal key to do so.  So we can try both, and if neither works try to activate with the OEM-BIOS key.  But you have to remove the Volume License key first which I explain how to do in detail in the first post.","The System Info says. \"to be filled by O.E.M\" ","Here's the specs:","There's no OEM data filled in. Is it a branded PC or a self-build? What brand? Can you examine the stickers on board to see if there's a make and model number?Do you have any paperwork that came with it so you can look for the model, or if a built PC if it came with an OS?If it's a self-build then it wont' be searchable for the OS it shipped with.","Hi! Yes, I purchased it on a store and the PC was actually assembled. All computer parts were just put together. So, there is no way I can have it fixed? ","What Windows edition came with it? Windows 7, 8, 8.1 or 10? Home or Pro? If you are in doubt and cannot find the paperwork I'd contact the store to ask them. It is a serious crime of felony piracy to sell a PC with preinstalled WIndows that cannot be activated, or uses an illegal Volume License Key. They need to make it good or have a really good explanation. If not you can Report Piracy to Microsoft Usually if you let a senior manager know you are going to do this, they will quickly make it good. ","It came with Windows 10 and was then upgraded to 10 Pro. I have no idea about licenses and activation. Just today, I have been receiving a message \"license will expire soon.\" I just want it fixed because it's causing me delays of work. ","Who upgraded it to Windows 10 Pro? A shop?"]},{"symptom":"subliminal program        who shut off the subliminal program on my computer?","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.It sounds like you need to enter the license key which you would have received on the receipt from your original purchase of the app.It’s likely disabled itself until you enter this, so you can provide you have purchased it.Regards, Ross"]}]}