{"windows":[{"symptom":"Destiny 2 transfering game content        Stuck. How to get past this","solutions":[]},{"symptom":"Cannot Turn on Windows Defender Firewall        Happy New Year,Re:  Windows Defender Firewall, Windows 10, Dell DesktopThis evening I noticed the Windows Defender icon had a red X.  I tried to open the Security Dashboard but nothing happened.  I then opened Windows Security but it was completely blank.  Firewall & Network Protection indicates:  \"Windows Defender Firewall is using settings that may make your device unsafe.\"  Domain, Private and Public network firewall settings were all off but with green check marks.  I clicked Restore Settings only to have it run on and on and on...until I finally closed it down.I tried several suggestions found in this community such as: checking Services to ensure the Firewall and Baseline settings were started and on Automatic; restoring to an earlier point and  accessing the Firewall through the Control Panel but to no avail. Each time I clicked on the Firewall in the Control Panel, the blue circle would twirl and twirl until the panel grayed out and finally closed.Needless to say not having a Firewall concerns me but I am afraid I will cause more damage if I install another security app. One last thought, the automatic scans which runs daily by Windows Defender and Malwarebytes found nothing unusual.Thank you in advance for your assistance.","solutions":["Do you have a 3rd party Antivirus? Try uninstalling it to see if Security Center comes back to life.See also Glen Prouty's posts here which can all apply: https:\/\/answers.microsoft.com\/en-us\/protect\/for... What is the Malwarebytes scan result? Be sure to do those steps first as you want to rule out infection."]},{"symptom":"cannot make computer a hotspt        when I try to turn on it tell me can't make hotspot","solutions":["Hi lloydheisler Did the Hotspot functionality previously work on your PC? Open Device Manager (accessible by right clicking your Start Button) Expand the Network Adapters section What is the model of WiFi (WLAN) device you see in that section?"]},{"symptom":"Locked out of Administrator Account login        Hi,  I hope someone here can help me.After a Windows 10 update a few months ago I have been unable to log in as administrator on my PC.I have tried dozens of websites, including this one and tried as many \"solutions\", all to no avail.Every solution or workaround involves entering an Administrator Password.MS Refresh tool will not work...password needed...Updating Malwarebytes...password required.everything I have tried either does not work or requires ...you guessed, Administrator Password.I cannot even wipe the hard drive and do a fresh install because ....Administrator Password is needed. So basically my PC is now vulnerable because I cannot update or download any security programmes or apps.I feel that Windows 10 is the worst operating system that I have encountered in 40 years of working with computers! I need to be able to do any or all of the following;Be able to reset Administrator Account and or its password.Delete ALL user accounts and start again as from scratch.Refresh Windows 10.Reinstall Windows 10.or do anything that will allow me to take control of MY PC that I paid for...including the operating system. ALL OF THIS NEEDS TO BE ABLE TO BE DONE WITHOUT ENTERING AN ADMINISTRATOR PASSWORD....because since the offending update I cannot enter an Administrator Password. Also, I don't understand why MS suddenly started demanding that Admin Password is needed to be able to do some very basic and routine things... like updating standard everyday programmes. Please help me,Phil","solutions":["I feel that Windows 10 is the worst operating system that I have encountered in 40 years of working with computers!My exposure to PCs is much the same as yours but IMHO, Win10 is the best of all versions of DOS and Windows that was ever produced.Your can easily solve your problem by logging on under your spare admin account."]},{"symptom":"Black or White bars at top or bottom of screen        Hi all, I am technician at an IT company and we are pulling out our hair over an issue with one of our clients using Google Calendar. They are 2 users, both using different computers, both running the latest version of Windows 10 and Chrome.The symptoms happen at different times on both machines. The symptoms can vary but are generally a form of bar on the top or bottom of the browser. They have to restart the computer for the issue to disappear. They can work around it by reducing the screen size from full screen, to something slightly smaller. We have tried Firefox, Edge and Chrome Canary with same symptoms, updating all drivers, BIOS, re installation of the OS and still issues are occurring. We originally thought the issues were graphics related, but they seem to only be happening when in Google Calendar. Seems like an OS bug? We have also turns hardware acceleration off in the browsers. I have included some screenshots as well. The black bars at the top began in Firefox on Google Calendar and have penetrated other windows that have been placed on top (Acrobat in this example). We are using an Intel NUC and a Laptop. Any advise would be most appreciated. Regards, Sam ","solutions":["Sorry, it's not apparent to me from the picture what the problem is.If it's of any help to you, here is the official Google Calendar Help Forum.You know the first things they'll ask you ...... update to the newest version of Chrome... disable all extensions... clear the cache","I have already posted in the Google Calendar forums and they have said it isn't an issue with Google Calendar. And yes, I have disabled all extensions, cleared cache, and used 3 other browsers all with same symptoms. To clarify the problem. Basically a white or black bar will suddenly appear in the top or bottom of the browser which then imposes itself onto other tabs and windows. The first example was taken in Google Maps, but you can see the Google Calendar tab\/white bar cutting off the bottom of the screen. The second example is taken in Adobe Reader, but you can see that Firefox black bar has imposed itself in both left and right section of the screen and parts of the Adobe application are not visible. ","Does anyone else have any suggestions or has experienced similar issues? ","I have the exact same problem.","Same problem here. It happens with Chrome, Firefox. Next time it happens I will try other applications. Very annoying and the only solution for me is to reboot.","I've been getting this on Chrome, Microsoft word and Whatsapp Web recently.","I have been following this issue in the Google Forum which has been getting much more attention. https:\/\/productforums.google.com\/forum\/#!topic\/chrome\/kztvALbicwE","Does anyone else have any suggestions or has experienced similar issues? I have experience similar issues when I work in \"maximized\" view - both with internet browsers (Chrome, Internet Explorer, Edge) as well as with File Explorer. Hasn't occurred with MS Office or Adobeproducts.  Below are screenshots of both a \"maximized\" and \"restore down\" view.  If I go to Display Settings, reset the resolution, then revert back, the issue goes away for a while, but has always returned.","I have found that this isn't a webbrowser related issue. Opening a folder has the same effect.I believe it's Windows-related, more speficif Outlook-related! It often occurs right after sending an e-mail (at least in my case) and opening a new e-mail doesn't seem to be effected by the bar. Still no solution though...","In an effort to diagnose the issue I uninstalled Chrome and reinstalled (after saving the bookmarks of course) and the issue returned almost immediately.  Then noticed the issue in IE too (yes just doing diagnostics).Once I rebooted we tested the same sites again and discovered that the horizontal black (or sometimes white) bars were the same size as bars that were popping up.  So our description of the problem became \"popup bars are invisible\".Hope this helps (disabling hardware acceleration didn't, and neither did maximizing or restoring with the squre in the underline, square, x, on the top right of the window.  We'll try F11 next time)."]},{"symptom":"I have all my Microsoft configuration in Spanish, but I receive family reports in Basque\/Euskera.        Hi. I have all my Microsoft configuration in Spanish, but I receive family reports in Basque\/Euskera. When I click the blue button in the body of the email, my Microsoft family account opens, in Spanish. Only the Microsoft Family reports come in Basque. What is happening?","solutions":[]},{"symptom":"Windows Updater error 8007000E after reinstalling Windows 8.1        I recently reinstalled Windows 8.1 on my PC using my original installation disc.Now when I try to check for Windows updates, I receive the error message \"Windows could not search for new updates\", code 8007000E.I have followed all the steps in the relevant Microsoft support article (https:\/\/support.microsoft.com\/en-us\/help\/10164\/fix-windows-update-errors) up to downloading KB4524445 manually from the Microsoft Update Catalogue. When I download that update and try to install it, I receive the error message \"The update is not applicable to your computer\". I am certain I have downloaded the correct version appropriate to my operating system (32-bit). The update history states no updates are currently installed on my computer.Does anyone know how to get past this issue and get a freshly re-installed Windows 8.1 up to date?","solutions":["This is the Microsoft advice:Fix Windows Update issuesWhat does this guided walk-through do?This guided walk-through provides steps to fix problems with Windows Updates, such as taking a long time to scan, or error codes while installing updates.Common error codesThe steps in this guided walk-through should help with all Windows Update errors and other issues. As an example, here are some commonly seen error codes: 0x80073712, 0x800705B4, 0x80004005, 0x8024402F, 0x80070002, 0x80070643, 0x80070003, 0x8024200B, 0x80070422, 0x80070020.How does it work?We’ll walk you through a series of troubleshooting steps to get your Windows up to date. Be sure to follow the steps in order.1. Run the network troubleshooter2. Run the Windows Update troubleshooter3. Rename software distribution backup folders4. Download the most recent Servicing Stack Update (SSU)5. Fix Windows file corruption6. Reset or reinstall Windows@@@@@@@@@@@@@@@@@@@@@@@@@@But after a Reset this poster TwoPuddies  found a way to solve the unable to update problem.https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/updating-win81-after-reset-and-installing-office\/6018eb0e-f9c0-4340-9f9d-20dd8a97bb63?page=2Hey Mr Bill Smithers,Juts to give an update: I didn't actually try to reinstall Windows. Instead I procrastinated for a while then decided to go looking for a solution again that didn't involve reinstalling Windows, prior to giving up and then reinstalling. Ha!I'm not sure how I found it but I found someone else having the same problem with a Lenovo laptop who had found a solution after posting on another forum (I posted here and Lenovo forums). I hope I'm not breaking rules by posting links to external websites (my apologies if I am) but here goes:-https:\/\/www.bleepingcomputer.com\/forums\/t\/635451\/win-81-reinstalled-now-have-problems\/The link says if KB3173424 doesn't solve the problem (this is the KB file the link you posted to the Fix Windows Update issues tells people to download as part of the troubleshooting process) then download the July 2016 rollup which is KB3172614 - which is dependent upon having KB2919355 and KB3021910 installed. The machine I was having trouble with had only KB2919355 installed but I thought I'd try installing KB3173424 anyway, and as soon as it had installed and rebooted the machine I had 227 updates waiting for me. Woo!!!@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Also read how Æþelleo  solved their Windows Update problem after a reinstall:https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/manual-updates-to-make-windows-81-update-service\/4104307f-0277-4cb9-b866-2bf053c60352"]},{"symptom":"Windows 10 Feature Update        I am testing feature updates from 1803\/1809 to 1909. (Dell Latitude 5400 and similar devices)The product we use is Ivanti security controls which involves us having to download the ISO and place it in the software patches folder. The devices we use are built with Win 10 Pro licences then through Azure are jumped up to Enterprise.  The Ivanti console specifies the 1909 enterprise ISO is required. I have tested this but it does fail, the same result with the 1903 ISO.I have also done this manually using the setup.exe from the ISO. Ran this command and no issues reportedSETUP.EXE \/Auto Upgrade \/NoReboot \/DynamicUpdate Disable \/Compat ScanOnly Ran setup from ISO, gets to 100%, reboots and then once rebooted I am prompted with the select a language screen 0xC1900101 – 0x20017- The installation failed in the SAFE_OS phase with an error during BOOT operation- Tried with and without SEP installed- Fully updated all driver and BIOSRan setupdiag:SetupDiag was unable to match to any known failure signaturesScan report:<?xml version=\"1.0\" encoding=\"UTF-8\"?>-<CompatReport MigXmlFile=\"psR13OPt80WIPDft.3.8.0.0_APPRAISER_Migration.xml\"><System X64Running=\"True\" X64Capable=\"True\"\/>-<Hardware>-<HardwareItem HardwareType=\"Setup_BitlockerNoTargetSupport\"><CompatibilityInfo BlockingType=\"None\"\/><\/HardwareItem>-<HardwareItem HardwareType=\"Setup_TargetIsNonStagedBuild\"><CompatibilityInfo BlockingType=\"None\"\/><\/HardwareItem>-<HardwareItem HardwareType=\"Setup_LanguagePackDetected\"><CompatibilityInfo BlockingType=\"None\"\/><\/HardwareItem>-<HardwareItem HardwareType=\"Setup_LicenseActivation\"><CompatibilityInfo BlockingType=\"None\"\/><\/HardwareItem>-<HardwareItem HardwareType=\"Setup_FeaturesOnDemandDetected\"><CompatibilityInfo BlockingType=\"None\"\/><\/HardwareItem>-<HardwareItem HardwareType=\"Setup_PendingFirmwareUpdateWithPower\"><CompatibilityInfo BlockingType=\"None\"\/><\/HardwareItem>-<HardwareItem HardwareType=\"Setup_FlightSigningEnabled\"><CompatibilityInfo BlockingType=\"None\"\/><\/HardwareItem>-<HardwareItem HardwareType=\"Setup_SecureBoot\"><CompatibilityInfo BlockingType=\"None\"\/><\/HardwareItem><\/Hardware><SystemInfo OSMinorVersion=\"0\" OSMajorVersion=\"10\" UplevelEdition=\"Windows 10\"\/><Devices\/>-<DriverPackages><DriverPackage HasSignedBinaries=\"True\" BlockMigration=\"False\" Inf=\"oem50.inf\"\/><DriverPackage HasSignedBinaries=\"True\" BlockMigration=\"False\" Inf=\"oem128.inf\"\/><DriverPackage HasSignedBinaries=\"False\" BlockMigration=\"True\" Inf=\"oem136.inf\"\/><DriverPackage HasSignedBinaries=\"True\" BlockMigration=\"False\" Inf=\"oem100.inf\"\/><DriverPackage HasSignedBinaries=\"True\" BlockMigration=\"False\" Inf=\"oem192.inf\"\/><DriverPackage HasSignedBinaries=\"True\" BlockMigration=\"False\" Inf=\"oem193.inf\"\/><DriverPackage HasSignedBinaries=\"True\" BlockMigration=\"False\" Inf=\"oem87.inf\"\/><DriverPackage HasSignedBinaries=\"True\" BlockMigration=\"False\" Inf=\"oem63.inf\"\/><DriverPackage HasSignedBinaries=\"True\" BlockMigration=\"False\" Inf=\"oem194.inf\"\/><DriverPackage HasSignedBinaries=\"True\" BlockMigration=\"False\" Inf=\"oem52.inf\"\/><DriverPackage HasSignedBinaries=\"True\" BlockMigration=\"False\" Inf=\"oem195.inf\"\/><DriverPackage HasSignedBinaries=\"True\" BlockMigration=\"False\" Inf=\"oem197.inf\"\/><DriverPackage HasSignedBinaries=\"True\" BlockMigration=\"False\" Inf=\"oem103.inf\"\/><DriverPackage HasSignedBinaries=\"True\" BlockMigration=\"False\" Inf=\"oem4.inf\"\/><DriverPackage HasSignedBinaries=\"True\" BlockMigration=\"False\" Inf=\"oem106.inf\"\/><DriverPackage HasSignedBinaries=\"True\" BlockMigration=\"False\" Inf=\"oem189.inf\"\/><DriverPackage HasSignedBinaries=\"True\" BlockMigration=\"False\" Inf=\"oem71.inf\"\/><DriverPackage HasSignedBinaries=\"True\" BlockMigration=\"False\" Inf=\"oem191.inf\"\/><DriverPackage HasSignedBinaries=\"True\" BlockMigration=\"False\" Inf=\"oem95.inf\"\/><DriverPackage HasSignedBinaries=\"False\" BlockMigration=\"True\" Inf=\"oem214.inf\"\/><DriverPackage HasSignedBinaries=\"False\" BlockMigration=\"True\" Inf=\"oem213.inf\"\/><DriverPackage HasSignedBinaries=\"True\" BlockMigration=\"False\" Inf=\"oem85.inf\"\/><DriverPackage HasSignedBinaries=\"True\" BlockMigration=\"False\" Inf=\"oem203.inf\"\/><DriverPackage HasSignedBinaries=\"True\" BlockMigration=\"False\" Inf=\"oem217.inf\"\/><DriverPackage HasSignedBinaries=\"True\" BlockMigration=\"False\" Inf=\"oem218.inf\"\/><DriverPackage HasSignedBinaries=\"True\" BlockMigration=\"False\" Inf=\"oem221.inf\"\/><DriverPackage HasSignedBinaries=\"True\" BlockMigration=\"False\" Inf=\"oem114.inf\"\/><\/DriverPackages><Programs\/><\/CompatReport> Will it be these drivers in bold be stopping the feature upgrade? If so is there a command that will tell me what these drivers are without having to go through device manager? I did google a bit on 136 and it came up as USB2 stack, EHCI eUSB Miniport Driver. If they are stopping it should they be disabled or uninstalled?Any other tools available to give me a better idea of where it is failing? ","solutions":[]},{"symptom":"Microsoft Ultimate Word Games        I love playing this game.  I am wondering if and when new maps will be available in Wordament?","solutions":["Hi,Unfortunately we aren't able to help with this on the community forum. It doesn't look like Microsoft publish information about updates or a roadmap until they have been released.They are activate on social media and may post updates on the games pages. Other than that the only thing I can recommend is trying to get in touch through the support channels for more information.https:\/\/microsoftcasualgames.com\/casualsuite\/su...I hope that helps"]},{"symptom":"Brightness        I have searched for an answer to no avail.  My Vaio Windows 10 computer keeps reverting to low level brightness on the display  There is no Enable Adaptive bBrightness switch (that everybody seems to refer to) in the system settings page or in device manager.  It doesn't matter if I have the night light set to on or off.  I slide brightness to 100% and 5 min later or sooner is back down to minimum.  Does anybody have a solution that I haven't tried","solutions":["Hi,If this isn't being controlled by a Windows setting it's likely a program\/driver installed by your device's manufacturer. Have you got the specific model of laptop so we can troubleshoot further?","Sony VAIO Series SVS15113FXBWindows 10 HomeV 0.0.18362 Build 18362Installed Display DriverNVIDIA GeForce GT 640M LEV 22.21.13.8205Intel(R) HD Graphics 4000V 10.18.10.4252","I received this email.  They person answering wants to access my computer remotely.  Is this a legit email? And if so is there someone I should talk to specifically?Hi JoeVario,Tim Watson75 has replied to your question Brightness in Microsoft Community.Thank You For Posting in  Microsoft Community. Call  I  -  8    8    8  -   5   O   7 -  O    I   O   5  Microsoft online support Between  10:00 A M t o 7:00 P M EST . We will Help you to fix your Issues","Don't call that number it's a scammer they will be blocked shortly. As for the brightness issue. According to the manual for your laptop, there is a program installed called VAIO control centre? This has it's own automatic brightness control under display settings that will override that of Windows.","You're a freaking computer God dude.  So far that's working.  THANK YOU!","Happy to help :)"]},{"symptom":"BitLocker Recovery key not found        Hi all,I have a Dell XPS 13 9360 running Windows 10.1 Home. Here's what happened:I was using Spotify one day and my computer started hanging. So I restarted the computer via the Start menu.The computer went into automatic repair and then automatic repair failed. I disabled automatic repair using bcdedit and rebooted.Then the computer went into Windows recovery. When I was exploring the different options on recovery, I noticed that some of them requested for the Bitlocker recovery key before I could proceed.This was the first time I knew of BitLocker’s existence, so I definitely did not activate BitLocker manually. I’m not sure how my internal SSD contents got encrypted on their own.I tried solutions like secure boot in BIOS, resetting BIOS settings to their defaults, all with no luck. At one point I also re-enabled Automatic repair.Now, when the affected computer is booted up, I am brought to the BitLocker recovery screen.Based on my reading and conversations with Microsoft Tech Support, when a Windows 10 Home computer is purchased, and the user signs in to a Microsoft account on first startup, BitLocker is setup automatically. So I went to that same Microsoft account that I used to setup the affected computer.Sure enough, my device was listed there:It even told me BitLocker was ON when I clicked “Manage”.However when I clicked “Manage recovery key” and I got past the 2 factor authentication, I got this…? It seems that no recovery key is associated with my account. But how is that possible given that this was the correct account that was used to setup the device, the device is listed in the account, and it even tells me BitLocker ON?Regarding the other possibilities where BitLocker recovery keys may be found:The hyperlinks https:\/\/onedrive.live.com\/recoverykey, aka.ms\/recoverykey also don't work.This is a home computer, so the recovery key cannot be on Azure Active Directory services.Since BitLocker was activated by itself, there’s also no way the recovery key could be on a printout.I’ve already checked all my USB drives and no recovery key was present. The data in my computer is valuable so I can't afford to format the disk.Could someone help? Thanks.Moved from: Outlook.com \/ Security, privacy, accounts \/ Other***Original Title: BitLocker locked my drive by itself after failed automatic repair and recovery key is missing***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as you are unable to get the BitLocker recovery key to unlock your PC from BitLocker encryption. We appreciate your effort in troubleshooting the issue and providing us a detailed information with screenshot. We checked this for you and ideally, in Windows 10 Home BitLocker doesn’t come by default. It could be possible that the BitLocker got enabled during some updates, either Windows update or PC manufacturer update. We were researching on this and the recovery key will be saved either on Microsoft account or in OneDrive location. Upon checking the screenshots and the details that you have provided, it’s really strange that the recovery key is not showing up in the Microsoft account even it shows ON. Meanwhile, we would suggest you to disable the secure boot from the BIOS and check if you are able to bypass the BitLocker. Please refer the steps in this article:Disabling Secure Boot Let us know how it goes, we are also investigating this issue on our end. Aditya RoyMicrosoft Community – Moderator","Hi Aditya, Sorry for the late response. I have only been able to access the affected computer today.When I went to the Secure Boot menu in BIOS, I realized it had already been disabled. This was probably the result of my experimentation with the computer prior to asking for help on this forum.Upon re-enabling Secure Boot, the computer displays the Dell splash screen, and then it gets stuck at this loading interface:The wheel just keeps on spinning...If I disable Secure Boot again, I get to the blue screen that asks me to input the BitLocker recovery key.Thanks.","Hi clarethebear, could I check if you managed to resolve this issue while keeping your data? I just had the same issue with my XPS 9570, which only occurred after a change of motherboard during repairs. I too am using Windows Home, and am also suffering from an encrypted hard drive without ever being given a key.Thanks!","Hi ladulateef, nope I haven't been able to solve the issue. I'm currently using an older backup computer. I suggest working on an older computer if you have one, or booting a different OS from an SD card in the meantime. My guess is even Microsoft is stumped by cases such as ours, which explains the dead silence in this thread... ","Hi Aditya, It's been a month now, may I know if there has been any news from your side?More poeple are also experiencing this error where BitLocker recovery keys are not being saved to the account. Would really appreciate a follow up. Thanks."]},{"symptom":"Microsoft hijacking my computer with UpdateOrchestrator        This is completely unacceptable. Microsoft should compensate for wasted electricity. Not only the computer is running but the screens are forced to stay on too (which normally turn off after 30 minutes of inactivity). I have wasted 24+ hours on this nonsense. Some of the questions online about the SAME problem with the SAME solutions date back to 2015. I regret paying for this product.Poweshell reveals the culprits:Get-ScheduledTask | where {$_.settings.waketorun}UpdateOrchestrator\\ Backup ScanandUpdateOrchestrator\\ Universal Orchestrator Startfyi Command Prompt does not reveal any information through \"powercfg \/lastwake\":Wake History Count - 1Wake History [0]  Wake Source Count - 0Things done:Power options all set to disable wake timers (persistent)Network card disabled from waking up the computer (never was anyway). Other hardware not indicated either (never was).Never used teamviewer. Never had mediacenter.Only Powershell shows the offending tasks (Get-ScheduledTask | where {$_.settings.waketorun})Need PSTools to launch Task Scheduler or I cannot do anything.Have tried: deleting disabling \"wake computer to run this task\"disable altogetherTaken ownership of the taskAll of these get reset latest next day.Set up a task to disable them every hour: Run PowerShell.exe with the arguments -Command \"C:\\Windows\\Manual Override\\disable_wakejobs.ps1\"The content of \"disable_wakejobs.ps1\": Get-ScheduledTask | ? {$_.Settings.WakeToRun -eq $true -and $_.State -ne \"Disabled\"} | % {$_.Settings.WakeToRun = $false; Set-ScheduledTask $_}Also ran in powershell admin: \"Set-ExecutionPolicy RemoteSigned\" firstThis worked for like 2 days and never again. The task has System ownership and runs with highest privileges.Changed Group Policy: Computer Configuration \/ Administrative Templates \/ Windows Components \/ Windows UpdateEnabling Windows Update Power Management to automatically wake up the system to install scheduled updatesto DisabledModified the RegistryHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Schedule\\TaskCache\\Tree\\Microsoft\\Windows\\UpdateOrchestratorDeleting contents, but just gets reset in a day or two.DO NOT waste my time with arrogant \"are your drivers up to date\" or safe or recovery mode or whatever you call it nowadays.5 year old problem ruining computers and wasting energy. I've had malware less damaging than this operating system.","solutions":[]},{"symptom":"Bing in Start Search in Windows 10        I want to remove or disable Bing in the Start Search in Windows 10. The common advice in the Internet is the following: in Cortana & Search Settings - Click the switch beneath Cortana can give you suggestions, reminders, alerts, and more at the top of the menu so that it turns off.- Click the switch beneath Search online and include web results so that it turns off.My issue is I cannot locate the Cortana & Search Settings. I’ve switched off Cortana in all the options presented in Permissions. I’ve looked everywhere. I have Windows 10 Home Version 1903 OS Build 18362.535.I do not want to deal with this by fiddling with the registry.","solutions":["Hi, The two settings you have mentioned are the only ways to change this behaviour officially. If include web results is off then it shouldn't be showing them. The only other way to disable this behaviour currently is by editing the registry.This is done by opening HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Search in regedit. And creating two new DWORD values in the right click contest menu. \"BingSearchEnabled\" and \"CortanaConsent\" and setting them both to 0.I hope that helps","I think there is a bug in Windows 10. I’d love to get access to the Cortana Search setting as shown in the images below. But those are not available. I keep on clicking (left click, right click, double click) the notebook as shown in the image but I do not get the same screen as below. Instead I get two buttons, i.e., Sign in button and May be later button. I wish someone will report this issue to Microsoft. I will submit it in the Feedback Hub but I am hoping someone in this community knows how to get around the bug without fiddling with the registry.","Are they visible in the Settings app itself? They are normally visible there rather than a tab fom the cortana panel."]},{"symptom":"Windows Update problem        2019-12 Cumulative Update for Windows 10 Version 1903 for x64-based Systems (KB4530684) - Error 0x80070002","solutions":["Hi Vaidish. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you everything possible for fixing failed Windows Updates, so that at least something will work before you work through them all:Some Updates will sort themselves out in a few days so I'd wait to see. If not or they are bothering you then here are steps you can take:1) There is a new guided walk-through from Microsoft for repairing Windows Update that leads up to resetting components if necessary:https:\/\/support.microsoft.com\/en-us\/help\/10164\/.... Try running that first. 2) If that fails try manually resetting Windows Update Service: Open administrative Command Prompt and type following commands one-by-one followed by Enter key.net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Close Command Prompt and see if Windows Updates works then 3) You can also install the Updates manually that fail to install which are logged at Settings > Update & Security > Windows Update > Installed Update History, and then search for those to download and install from this Catalog:http:\/\/test.catalog.update.microsoft.com\/v7\/sit... 4) If they continue to fail and interfere, then you can block them using one of these methods:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... 5) If problems with Updates have become chronic and especially if you have other performance problems, go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 6) If nothing else works then do a Repair Install, by installing Media Creation Tool, open installed Tool and choose to Upgrade the PC Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version 1909. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... _____________________ Good news! There are major changes in Version 1903 giving back control over Updates to the consumer. Microsoft has heard us at the highest level who announced this here:https:\/\/blogs.windows.com\/windowsexperience\/201..._____________________ I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","2019-12 Cumulative Update for Windows 10 Version 1903 for x64-based Systems (KB4530684) - Error 0x80070002","2019-12 Cumulative Update for Windows 10 Version 1903 for x64-based Systems (KB4530684) - Error 0x80070002","2019-12 Cumulative Update for Windows 10 Version 1903 for x64-based Systems (KB4530684) - Error 0x80070002I have tried many, but not all of the solutions that you have suggested. Specifically, I skipped #4, because I don't want to block the updates that didn't work. Maybe I don't fully understand how the update process works, but why would anyone want to skip an update, especially a major one, that could potentially leave a security hole in their operating system? This is not a criticism; this is just my train of thought, and my nervousness about doing something that sounds (to me) very serious.I am in the process of using the Media Creation Tool to upgrade my computer. By the way, just FYI, here are my system specs:ASUS  ROG STRIXModel G531GT-BI7N6Intel Model 9462NGW (9th Gen Intel Core i7-9750H mobile processor @ 2.6 Ghz)16.0 GB RAM (According to Amazon, original model came with 8 GB, but I have confirmed that mine is 16 GB.)NVIDIA GeForce GTX 1650 graphics w\/ 4GB GDDR5 dedicated video memory Windows 10 Home Version 1903 Build 18362.30It's basically a brand new computer; it was a Christmas gift. It works fine, but I worry that it's not up to date, especially since my son also has the exact same computer (also a Christmas gift), and his has already downloaded and installed the update.","UPDATE: Tried the tool, it worked. When tool was finished, my version was 1909 build 18363.418.Then I ran update again, to check for updates, and it found two, one of which was the update that caused this ticket in the first place (2019-12 Cumulative Update for Windows 10 Version 1903 for x64-based Systems (KB4530684) )I downloaded and installed both updates successfully, and it now says that my system is up-to-date.Currently, I am at: Version 1909 Build 18363.535.I am a very happy camper now. The media tool solved my problem, and kept all of my custom apps and settings in place. I highly recommend this option to anyone else having the same issue.Cheers!","Hi, having looked at community stuff I am afraid that you all seem to think that every one with problems is a smart and tech savy as you obviously are.  Could I request with all sincerity that you direct me to somewhere where people like me with absolutely NO  IT skills what so ever can look for help with problems. I have tried to keep my pc safe and working properly  but for months 2019-12 Cumulative Update for Windows 10 Version 1903 for x64-based Systems has failed  - apparently  my device is missing important security and quality fixes. I has tried to look up solutions on the internet  but the cures(!) might as well be written in Chinese  composed by  an Eskimo ( no insults intended).Where do dummies like me go for help? ","Look at the original post above, by Vaidish. Option #6 was the one that worked for me, and it's very non-technical; you literally just download the program, run it, and choose \"Upgrade this machine.\" You don't have to configure anything or change any settings. It keeps all your settings, apps, and preferences as they were. I was very impressed with how well it worked.Barring that, show this thread to a family member or trusted, close friend who has computer knowledge, and let them help you go through the steps.As a last resort, you could take your machine to a local computer shop in your area, but be aware, there is often a large disparity in the knowledge level of shop owners. Some of those guys are true technicians with deep knowledge of their subject area; however, some of them are just proficient computer users with research skills, who are going to Google the problem, find this thread or a similar one, and go through the listed steps. Be sure the shop you go to has an actual, licensed technician on staff.Hope this helped!","Hey Greg!I've tried all the above options and yet no working solution... tried to use the media installer and at the very end it said the installation failed. "]},{"symptom":"When will there be a new activation code for win10 bedrock version？        See the exchange button but no activation code","solutions":["Hi,Please can you provide more information about the issue. Where are you seeing this?","Minecraft Official website","There's been an ongoing issue for a couple of weeks now where the system used to generate codes hasn't been working. The Mojang team will be updating this page when there's more news to sharehttps:\/\/help.minecraft.net\/hc\/en-us\/articles\/36...As this is the community forum we can't provide specific dates. I would suggest contacting Mojang directly for a specific timeline if they have one."]},{"symptom":"Bluetooth keyboard pairing but not functionning        Hi everyone ! Just bought a BT Keyboard for my Lenovo ideapad 100, running on Windows 10. While the keyboard works fine on my friend MAC (connected, paired, a verification windows shows up, asks me to hit the good buttons on the keyboard, and I m on), I m experiencing problems when I try to connect it to my PC.The PC Bluetooth sees the keyboard, connects, tell me it s on and ready to go, paired and all, but no verification windows shows up ! And while my pc seems convinced that the keyboard is paired, the keyboard light indicates it s still searching for a device to pair to...Does someone have any idea how to make this verification window appear, to pair the keyboard with my PC ?Thanks !","solutions":["Hi, Try to run the system File checker, Run CMD as Administrator, then type sfc \/scannow You can also try this, Go to Device Manager, then Expand the \"Keyboards\" then right click the drivers, then click \"Uninstall\" to uninstall the Keyboard drivers, then Restart your Computer.","Try to run the Troubleshooter. 1. Go to settings 2.Choose the Update & Security, 3. Then click \"Troubleshoot\" then > \"Find and fix other problems\" > Select the Bluetooth.","Thank you for your answers, jhestech. Unfortunately, I tried all three methods, but the problem remains.A technician from the company which made the keyboard told me perhaps my computer doesn't have the necessary drivers. But it's a window 10... Any other ideas ?"]},{"symptom":"Keyboard layout issue in Remote Desktop        I use W10 Remote Desktop to connect to a Windows 7 Professional (SP1) external computer.Before that I used W7, Dutch language, American international keyboard and never had problems with these keyboard settings on my external computer (with the same language and keyboard settings).The use of W10 with the same settings as the old W7 did not work. A lot of special characters did not meet the layout of the keyboard. It appears that the Dutch keyboard layout overrides the American international layout while typing in the external desk top.I found the solution in a question on this site from 2017 and it seems that Microsoft has still not solved the problem:  https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/keyboard-layout-remote-desktop-app-store\/98daedc2-497b-4386-93b0-6aafbee2d844So please solve this. It took me two days and a lot of anger before I finally found out that this wasn't my fault.***Original Title: W10 wrong Keyboard layout in Remote Desktop***","solutions":["Hi,Thank you for writing to Microsoft Community ForumsWe understand your concern as you are having difficulties in keyboard setting for the other PC through Remote Desktop connection.Let me point you in the right direction, where you would get the appropriate help for this issue. I would suggest you to post your query inTechNet forums, where we have experts and support professionals who are well equipped with the knowledge on Remote Desktop input language to assist you with the appropriate troubleshooting steps.Also suggest you to refer the sections that says “Why do incorrect characters appear in the session?”From this article: Frequently asked questions about the Remote Desktop clients and check if that helps.Regards,Aditya RoyMicrosoft Community – Moderator","Thanks for these suggestions but I tried all of them. Most curious is that I used exactly the same settings as I use for my other laptop (W7 pro Dutch language US international keyboard ), wich couses no problems at all. The only thing that works is changing the language to the same as that form the keyboard. English UK language combined with US keyboard also gives (bit less) conflicting keys."]},{"symptom":"Windows 10 - wifi status is \"Connected, secured\" but I'm unable to  access any website        I have an HP Envy laptop running on Windows 10. I started it with no issues today and used it for about an hour. Suddenly, I could no longer open websites. I cleared my cache and switched browsers - no luck. My wifi status says \"Connected, secured\". Network status is \"You're connected to the internet\". Running the the troubleshooter gives me this message - \"Troubleshooting couldn't identify the problem\".I am able to connect to my  wifi on other devices. ","solutions":["Hi kwasi001,try to restore the network:Settings> Network and Internet> Status.Click Network Reset on the right side, follow the instructions and read the notes.Otherwise follow all the steps here:https:\/\/support.microsoft.com\/en-us\/help\/10741\/windows-fix-network-connection-issues","Hi there! I'm Steve, an Independent Advisor and a Windows user like you. I'm happy to help with your query.Losing internet access definitely isn't ideal. Based on the scenario you describe the first thing I would recommend to try is restarting (powering off\/on) your router. While your WiFi is connected successfully if your router isn't passing traffic correctly then it can cause this issue. Failing that there are some additional steps you can try in this support guide: https:\/\/support.microsoft.com\/en-us\/help\/10741\/... Please let me know if I can be of any further assistance!","Hi Steve,I tried the steps in the link you provided without any luck, but it appears the router is the issue. The red \"no internet\" light is now on, and my other devices have no wifi, so I am contacting my ISP. Why it took several hours for the light to reflect what was actually happening is a mystery to me. Much appreciate your help","Thanks, Franco. It seems to be an ISP issue","That's no problem, I hope your ISP can resolve your router issue for you soon!Steve"]},{"symptom":"My dvd\/cd drive has stopped working even when it tells me my drive is up to date, how do i fix this        My dvd\/cd drive has stopped working even when it tells me my drive is up to date, how do i fix this","solutions":["Hi, In the Device Manager double-click the dvd\/cd drive. Under the \"General\" tab what is the \"Device status\" ?","Hi, In the Device Manager double-click the dvd\/cd drive. Under the \"General\" tab what is the \"Device status\" ? I also have the same problem.  I have tried everything.This is what my computer says under DVD\/CD rom drives:TSSTCorpCDDVDWSU-208FB","I have the same problem..it ejects and accepts the disc but that's it ...no sound","I have the same problem..it ejects and accepts the disc but that's it ...no soundThat is the same for me, did you resolve this and how did you do it?"]},{"symptom":"Emails disappearing when moved to folder Windows mail app        Emails are vanishing when moved to folders which I created but others move to the same folders without problem. Both the missing emails contained attachments. How can I see why this is happening? ","solutions":["Emails are vanishing when moved to folders which I created but others move to the same folders without problem. Both the missing emails contained attachments. How can I see why this is happening? I have the same problem with my old emails not showing in the folders that I saved them in.  What should I do so that they show?  I am using Kaspersky as anti-virus programme."]}]}