{"windows":[{"symptom":"music        How you put music in your phone or fitbit?","solutions":["Hi Edward The best way is the manual approach Connect your Phone to your PC, if necessary, on your Phone, set USB to file transfer or MTP, depending on the modelThen open Windows File Explorer and navigate to your Phone and find the Music FolderOpen another File Explorer Window (Windows Key + E) In that window, navigate to the music folder in the left pane Then simply drag music files or folders form that folder into the music folder on your PhoneThe process will be the same for your Fitbit"]},{"symptom":"i'm using a custom kms server and everytime I try to activate it gives me an error (0xC004F074) although the server is working fine on other machines        i'm using a custom kms server and everytime I try to activate it gives me an error (0xC004F074) although the server is working fine on other machines","solutions":["Hello HossamHossamTheMLG, thank you for providing this question. I am a seasoned Windows expert with almost a decade in usage and support experience and hope to resolve your problems quickly.This is usually caused by connection problems or differences between server and client.Please check if you could ping server IP address through command line on this client to make sure they could communicate with each other.Make sure client and server have same time (time is coordinated between the KMS host and the client computer in Coordinated Universal Time (UTC) as the issue would occur when a time difference between the KMS client and KMS host machine.)Also you could run w32tm \/resync as administrator to Resync the time on the Client. From this technet post: https:\/\/social.technet.microsoft.com\/Forums\/en-...If you consider your problem solved it would be very good if you marked the answer which helped you so others can find and use this thread.If this didn't solve your problem or you need further assistance please answer in this thread and i would be happy to help.kind regards F. Grobusch","it still gave me the error i mentioned :(","Check the Event Logs of the Server Application Logs -> Key Management Service. Does the Server get the request from the Client? In case it did what error has there been?","ok i'll ask the server owner","Alright."]},{"symptom":"Can't use Bluetooth        Hi, I have a problem with connecting Bluetooth since I got SCPToolkit! I think I may have uninstalled the drivers. I tried fixing it by uninstalling them all and making windows reinstall them but it didn't reinstall! when I tried to run the troubleshooter it now says that the device isn't Bluetooth capable but it worked the other day! I have been trying to solve this for many days and nothing seems to work! Please help I have the Cintiq Companion 1 with an intel core i7 CPU and 8GB of ram.Sincerely, Evan.","solutions":["Hi, EvanSass My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to return to a previous point. 1.- Open Start. 2.- Search for Create a restore point, and click the top result to open the System Properties experience.3.- Click the System Restore button. 4.- Click the Next button. 5.- Select the restore point that you want to use on your computer. 6.- Click the Scan for affected programs button to understand the apps that will no longer be available because they're added after the creation of the restore point.7.- Click the Close button. 8.- Click the Next button. 9.- Click the Finish button. https:\/\/support.microsoft.com\/en-us\/help\/12415\/...https:\/\/forums.tomshardware.com\/faq\/how-to-rest...https:\/\/www.isunshare.com\/windows-10\/7-ways-to-...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Sorry for the late response! It Worked thank you so much! I lost a few apps but I can get them back! So worth it!Thanks, Evan."]},{"symptom":"Rundll        hello,i am facing this every time o start my PC since i update itwhat i have to do to fix that?","solutions":["Hi, Abdenour My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps: Press the Start key and type the word CMD or Powershell, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanu p-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/929833...","Hi, Jeffreyi do all what you said and nothing change it still show up when i restart ","Register the .dill file. 1.-Press Windows key on your keyboard and type Command prompt. 2.-Right click and Run as administrator. 3.-Type regsvr32 Run.dll 4.-Restart the computer and check.","that what happen","I recommend that you repair Windows completely before you must make a backup of your personal files, third-party software will be removed. Here the link to download the Windows ISO.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Ok and thanks for help","Glad to Help!"]},{"symptom":"update to Windows version 1909 connecting to external display        has the update for windows version 1909 been resolved to allow the connectivity to mirror display onto smart? I could not mirror my display to smart tv after installing the 4570 update. Has this been resolved yet???","solutions":["Hi,Thank you for writing to Microsoft Community Forums.We understand you as you are having difficulties in projecting your PC to an external drive. In order to get clarity and to assist you accordingly, please reply with the answers to the questions below.What is the Windows 10 version and Build currently installed? (Typewinver in Windows search\/Run command)What is the make and model of the PC?What is the make and model of the Smart TV?How are you projecting the PC to the external display? (Extended\/duplicate)Are you using Miracast app to mirror the display?What is the error message\/code you are getting while mirroring the display?We await your response.Aditya RoyMicrosoft Community – Moderator","its is a microsoft surface book 2 (2018) trying to project to a samsung 2019 qled smart TV which does have miracast in its operating system.  It has wifi and bluetooth cap. computer is operating on intel core I7 6600U 2.60 GHZ 2.81GHZ,  windows 10 pro version 1903 right now , but when I downloaded the 1909 version it wouldn't project duplicate, but it would play music from the laptop. both the laptop and the tv support miracast but it didnt run correctly when 1909 was installed , so with the help from microsoft had to reinstall version 1903 , and it worked just fine as it did before I installed 1909.  There is something wrong with the version 1909 not allowing the projection to the tv duplicate within the 1909 version. I dont want to install the new version because , I don't want to lose the projection ability. I use it several times a week..  with the 1909 version the error message on the tv , would show could not connect, try connecting to mobile phone.. 1909 just didn't work at all for me.....  ","Dear Team, I am facing any issue while doing the screen mirroring with the Samsung Tv 65 inch.I thought this is a TV issue initially, but I am able connect my friend's laptop to this TV.From one of your previous thread, I tried the below steps but nothing worked1) Uninstalled the Intel display drivers and re-installed them2) Network - Status and reset the networkBelow are the software details1) Windows 10 HOME 64 Bit2)  Version 19093) Build 18363.535","Dear Team, I am facing any issue while doing the screen mirroring with the Samsung Tv 65 inch.I thought this is a TV issue initially, but I am able connect my friend's laptop to this TV.From one of your previous thread, I tried the below steps but nothing worked1) Uninstalled the Intel display drivers and re-installed them2) Network - Status and reset the networkBelow are the software details1) Windows 10 HOME2) 1909"]},{"symptom":"Rolling back a windows 10 update has additionally rolled back local game saves.        Windows 10 had recently force-updated to the latest build, as it tends to do, and I noticed that my desktop was running significantly slower as a result of the latest installation. I decided to wait a few days, because I wasn't really keen on rolling back the update. Turns out nothing changed speed-wise, so I decided to use the windows 10 feature that allows you to roll back the latest update. I was assured, during the process, that local files wouldn't be affected. Unfortunately, I've discovered that local game saves for the game Minecraft were rolled back in addition.I'm not sure if I misread something but, like I said, I was under the impression that local files weren't supposed to be affected. Additionally, the rollback on the game save seems to be mush further than the point at which the update was installed. More specifically, the save file was rolled back to a point in time that notably predates the installation of the problematic update.Aside from having a recovery point, because I didn't make one before I rolled back the update, is there any way to remedy this situation? Can I undo the undo, so to speak?","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Yes you can certainly undo the restore, please see this article for the steps: https:\/\/www.tenforums.com\/tutorials\/94694-undo-...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Windows 10 randomly freezes for about 10 seconds, UI continues to work, probably a disk issue        When the freeze happens, mouse still can move, and moving the mouse over things like icons on desktop slightly highlights it, but nothing works(clicking on stuff, right clicking, trying to open task manager etc)Looking at Resource Monitor while this happens shows that Disk activity completely falls to 0.After the freeze ends, any actions I attempted are extremely quickly done, seemingly in order I did them.Some context:For several months I've had an unstable disk, and my boot partition was installed on it.My computer would freeze randomly. Today I reinstalled my Windows, and finally disconnected the faulty disk, and hoped that the issue would be fixed, however it was not.My Windows are installed on a SSD, I also have another disk for my personal data that is a HDD.","solutions":["Hi Zobody, if there are disk's problem likely there will be error events in system journal (Event Viewer). Please check.Disk health can be checked with thierd-party tool for reading SMART, e.g. CrystalDiskInfo.","Only relevant things I see are:10 warnings from \"disk\": An error was detected on device \\Device\\Harddisk1\\DR1 during a paging operation.Disk 1 has been surprise removed. (this one is 1 second later)","Checking Disk Health with CrystalDiskInfo reports no issues, so doesn't really give any leads :\/","HardDisk1 is a second disk, HDD. Please check C7 attribute (UltraDMA CRC errors) in SMART. Problem may be in cable, controller of inaccurate disk partitioning.Did you use any third-party utilities for partitioning or changing partition size?Try to connect drive to another USB port on motherboard.","C7 attribute of the HDD reports 200I've never used any third-party utilitiesI will try changing the SATA port in the motherboard","C7 attribute shows bad SATA connection. Try to replace data cable or at least reconnect it with contacts cleaning."]},{"symptom":"My McAfee security scan will not complete due to C:\\Windows\\System32?        My McAfee security scan will not complete due to C:\\Windows\\System32? I believe part of it lost during Windows 10 upload or update","solutions":["Hello! I am an Independent Advisor, I would love to help you out! Try closing out of mcafee entirely. Then open mcafee by right clicking and select \"run as administrator\". Then run a scan. Will that let you complete the scan entirely?"]},{"symptom":"suddenly Fonts wrong in destop and office        Turned notebook on and suddenly fonts all faded in desktop browser and Office programs making it very hard to read. This is mighty easy even with glasses to miss important mail. Any ideas how to rectify the issues ?","solutions":["Hi, richWalters My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to return to a previous point. 1.- Open Start. 2.- Search for Create a restore point, and click the top result to open the System Properties experience.3.- Click the System Restore button. 4.- Click the Next button. 5.- Select the restore point that you want to use on your computer. 6.- Click the Scan for affected programs button to understand the apps that will no longer be available because they're added after the creation of the restore point.7.- Click the Close button. 8.- Click the Next button. 9.- Click the Finish button. https:\/\/support.microsoft.com\/en-us\/help\/12415\/...https:\/\/forums.tomshardware.com\/faq\/how-to-rest...https:\/\/www.isunshare.com\/windows-10\/7-ways-to-...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Clearing cach  -  windows 10        How do I clear cache?","solutions":["Hello! I am an Independent Advisor, I would love to help you out! I would advise opening disk cleanup. You can search for disk cleanup from the start menu. Open it and put a checkbox next to all files\/folders you are okay with windows deleting. This by default may include the downloads folder, but you can uncheck this if you wish. Then run the tool. It should clean all temporary files it can from your system. If you want to clear the cache from a web browser the process would be slightly different for each browser and I would need to know which browsers cache you wish to clear.Hope this helps!"]},{"symptom":"Microsoft wireless 900 keyboard        How do i activate the numbers pad ","solutions":["Hi Alda At the top left of the number pad there is a NumLk key, press that and if that does not work fro you try the Fn Key + the NumLk keys together . .."]},{"symptom":"\"App volume and device preferences\" menu is not working properly        I have two audio output devices, Logitech speakers connected via 3.5 jack, and USB headphones.I have the speakers set as default, and I use some applications with the headphones.I'm experiencing 2 issues:1. Many times some apps that have the audio directed to the headphones by the settings, but suddenly they start being heard through the speakers.When I open the \"App volume and device preferences\" menu, I see them assigned to the headphones as expected, but still the sound comes off the speakers.The issue resolves if I change the setting back to the default and then to the headphones again, then it works.But that is a terrible solution and is very annoying, especially since I have kids and other people who are not tech savvy, and don't know how to deal with this when I'm not around.2. Some apps cannot be redirected to the headphones at all, no matter the settings, it always output to the default setting.Please help.Thanks.","solutions":[]},{"symptom":"Can't boot my laptop\/ boot manager missing or not fount, Black screen after booting from USB        Hi guys and gals,I desperately need someones help.One day my laptop won't boot anymore, saying that \"boot failed\/boot manager not found or missing\" something like this.I have an acer Aspire ES1-731, This is what I already tried to solve the issue, but unsuccessful. I changed boot priority order to USB and enabled F12 boot menu to boot from the USB drive.-I made a boot-able USB with windows media creation tool on a 64GB usb (lots of space) after formatting it as default and the 2nd time as NTFS.-I changed my bios settings to LEGACY (and later tried with UFEI) black screen is all I got after rebooting,-I made a boot-able USB with Rufus and formatted my USB drive as default, disabled secure booting. Black screen again after booting-I changed Bios setting to LEGACY, disabled secure booting, black screen again after booting.-Tried to create a new boot-able usb formatting my usb as NTFS, and tried to boot with UFEi and Legacy options, still black screen.In all above cases I see a small windows logo and the white dots circling before I enter the \"Black screen\"I'm losing my mind here. I have very important documents on my HDD drive that I can't afford to loose.A kind of similar discussion on this forum didn't help me coz I already tried those suggestions.Can someone pls help.Thanks in advance.","solutions":["If you have another PC then download Macrium Reflect free & create their boot drive on USB. Insert this into the problem PC & use this to boot it to Macrium, there choose to repair boot files & see if this fixes things.If not then you can use Macrium to create a system image on an external hard drive in case of requiring a new hard drive.https:\/\/www.macrium.com\/reflectfreeNote: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Please do not download any repair tool which is offered by this site other than the ones I mention\/recommend..Thoroughly research any product which is mentioned here before you decide to download and install it.","Thank you for your reply. However, I can't run the application. This is what I see.I don't understand. Usually I can download and install anything.","Are you connected to the internet via Ethernet or wifi? Are you running any third party antivirus software? If so try disabling it.","I'm connected to the internet via Wifi and no third party antivirus running.","Can you try via Ethernet? Can you download other applications OK?","It's not possible to connect via Ethernet. But other applications download correctly. No problems at all.","I've took the liberty of downloading & unzipping the MR free .exe file for you & have uploaded it to my MediaFire page:https:\/\/www.mediafire.com\/file\/qmnpeknmbg8f91q\/... I would give it about 5 minutes to finish uploading.Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Please do not download any repair tool which is offered by this site other than the ones I mention\/recommend..Thoroughly research any product which is mentioned here before you decide to download and install it.","Thank you so much for getting back to me. I will sure give it a try and let you know of the results.","Yes keep me posted."]},{"symptom":"0xC004F025 Error Windows 10 Pro Activation        Hi, I have an HP laptop with Windows 10 Home.  On Decemer 31, 2019 I purchased Windows 10 Pro from the Microsoft Store.  I downloaded the upgrade, installed it, and it was working fine.  Now I'm am getting a message to activate Windows.  I noticed that under Settings, the windows says it is Enterprise edition NOT pro. I cannot activate and keep getting 0xC004F025 Error Windows 10 Pro Activation. I noticed some people had similar issue and reported that they used a generic Key to activate their windows... Can somebody help me by sharing this generic key? or what I should do please...Thanks so muchMaged Soliman","solutions":["Hello MagedSoliman48, I'm Didi, an independent advisor. Please check this answer provided by DaveM121, independent advisor, to someone who had the same problem as you (I paste his answer here because there is many answers in the thread, it can be hard to find it) :\"This is a known bug in the Home to Pro upgrade process, use this fix: Open the Settings App (Gear icon on your Start Menu) Go to Update and Security - Activation Click Change Product key Enter this generic product key: VK7JG-NPHTM-C97JM-9MPGT-3V66T When prompted, click 'Activate Product' If the above does not work first time, temporarily disconnect from the Internet and click 'Activate' again . ..(Note the generic key will cause Enterprise to downgrade to the Pro edition, then your own legal licence will activate automatically)\"Source : DaveM121 on https:\/\/answers.microsoft.com\/en-us\/windows\/for... Regards, Didi"]},{"symptom":"Wireless Printer not found        After a reboot windows 10 can not find my printer, please help.","solutions":["Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.Let's start with the simplest, disconnect the power cable from your printer for at least 30 seconds, reconnect it, and see if it works again.Otherwise here you have steps to follow to find the problem https:\/\/support.microsoft.com\/en-us\/help\/401540..."]},{"symptom":"Unable to create any file        Hi, I am using Windows 10 on my Haier Y11C laptop. One day out of no where every file that I open or access deletes on its own. And not even once, it tries to delete it multiple times throwing unable to delete missing file exception. The solutions I have tried so far are. At first I thought it was because of some Malware or Virus so I scannned the whole system with Mccafe LiveSafe. Which flagged some files as malware and removed them. But it didn't solve the issue. Then I tried reinstalling Windows 10 via USB after cleaning up my whole hard drive. After the install I downloaded all the updates and it still did not solved the issue. I have been looking around for quite some time now and have not been able find anything usefull. I'm not sure as to where to look further so in my last desperate attempt I am asking here. Do let me know if I need to provide any kind of logs.","solutions":[]},{"symptom":"Desktop icon after installation\/update        Is there a way to prevent programs to add their shortcut to the desktop after installing\/updating (when you cant untick the option)?","solutions":["Hi Andri I presume you are installing 3rd party software, there is no way to prevent software installers from creating Desktop shortcuts, that is coded into the installer by the software developer and Windows would have no control over that, there is not even a registry hack that would work to stop this behavior . . ."]},{"symptom":"Windows 10 Home.        I recently completely resetted my pc, and changed some hardware things.And now it shows that i dont have my windows 10 key activated and there is a watermark and the bottom right where it says: 'activate windows.'I dont have the activation key, i threw it out.","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Try the steps in this troubleshoot guide: https:\/\/support.microsoft.com\/en-gb\/help\/20530\/...Regards, Ross","problem: 0xc0000022i tried to troubleshoot, and it said that i need to buy a new key.","Did you purchase a key originally or did it come with the PC?","it came with the pc","Hi kārliskazāks When you say you changed some hardware 'things' did you replace the motherboard on your system?"]},{"symptom":"Windows 10 lid problem        When I close and open my laptop lid. Display is off but windows is still active. I cannot able to solve this problem.Can I get help in this issue.Thank you  ","solutions":["Hi, CharanSainatahTry shut down you're PC from start menu or from shut down buttonand your PC is enter only in SLEEP mode when you close it shut it down from start menu or buttonif you want set your PC shut down when you close your PC follow the next steps1. Open control panel2. Hardware and sound3. Power options4. Left menu with small characters select \"Choose what closing the lid does\"5. then select preffered things there if youre done press apply then okHope this Helped.","Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Here is an article which gives a guide on how to change what happens when you close your laptop lid.https:\/\/www.itsupportguides.com\/knowledge-base\/...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Slide scanners for Windows 10        Any suggestions for a slide scanner to transfer old photo slides to Windows 10 please?","solutions":["Hi David, You would be better off reading some of the review sites for product comparisons.such as https:\/\/www.digitalcameraworld.com\/buying-guide...https:\/\/artfixed.com\/best-slide-scanner\/some other information that might be of interest https:\/\/www.bhphotovideo.com\/explora\/photograph...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Very many thanks for your prompt advice.David","you're welcome, good luck with it."]}]}