{"windows":[{"symptom":"Windows 10 - Cannot access login screen        When Windows 10 boots up, and I'm at the welcome screen (where the time is displayed), I have press a key or click to have the user password screen appear. This doesn't happen now, but the screen will begin the transition to the login screen, but then go right back to the welcome screen. I've tried repairing and restoring to a previous restore point, neither have worked.  Heres a video I captured in my phone of me pressing enter on my keyboard to try and reach the login screen:https:\/\/photos.app.goo.gl\/fRbBeJoGscAYTpwP9","solutions":["Hi TurdSy My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Try disabling the Fast Startup feature Fast Startup is a useful Windows 10 feature because it saves your data once you shut down your PC allowing it to start faster. This is a useful feature, but it can cause your PC to become stuck at the Welcome screen.To fix the issue, you need to enter Safe Mode and disable Fast Startup feature. To enter Safe Mode, follow the steps from the previous solution. Once you enter Safe Mode, you need to do the following:Press Windows Key + S and enter control panel. Select Control Panel from the list of results.When Control Panel opens, select Power Options. Select Choose what the power button does from the menu on the left. Click on Change settings that are currently unavailable. Uncheck Turn on fast startup (recommended) option and click on Save changes. After you disable Fast Startup feature, your PC might start a bit slower but the problem with the Welcome screen should be fixed.Hope this helps."]},{"symptom":"Purchased wrong upgrade version of Windows 10, can I return for right version?        I purchased and have a product key for Windows 10 Home upgrade but then noticed I have Windows 7 Professional, and the Media Creation Tool downloaded Windows 10 Pro upgrade. How can I return my Home upgrade version for a Pro upgrade version?","solutions":["Hi Laurie This does happen a lot, your best option is to contact Microsoft Support directly, they will most likely upgrade that licence key for you and you will only have to pay the difference between the to licences . . .Choose a local Phone Number: https:\/\/support.microsoft.com\/en-us\/help\/13948\/..."]},{"symptom":"Onedrive Issue in Windows 10        Hi all, I just recently upgraded to Windows 10 from Windows 7, after Sony pulled its support from Win7. I used to have a working Onedrive and Google's Backup & Sync to sync my files from my PC to Onedrive and Google's Drive app. However, both stopped working after I upgraded my PC to Win10. I kept getting this message (attached) whenever I tried to start the service, for both Onedrive and GDrive on my PC. What seems to be the problem here? I'm at loss here. I have moderate knowledge of computing so I can find my way around but I've hit a roadblock here. Any help is appreciated. Thanks.P\/S: Sorry for my sentence structure. English is not my native language.","solutions":["Hi AminS87 My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Try downloading and installing the latest version of Onedrive. https:\/\/onedrive.live.com\/about\/en-US\/download\/Hope this helps."]},{"symptom":"I cannot install literally anything from Microsoft Store        Hello there,Can anyone help me bc I can't install anything from MS. When I try to it says \"You own this game\". I tried other games to install and the same problem. I also tried installing apps except games and I can't install them too. Now it says You own this for every app.I'd love if anyone helps me.","solutions":["Hi AltritGallapeni, I would suggest doing a repair using the in-place upgrade. https:\/\/www.kapilarya.com\/how-to-repair-windows...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thanks. Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Search box locked throughout Windows        This concerns the following system:Dell Precision T1700 Xeon E3-1220 3.10 GHz 32 GB RAMWindows 10 Pro Version 1909 Build 18363.535 installed on 12\/22\/2019The problem is that the search box  is not accepting typed input in various places in the Windows 10 Pro OS:  e.g. on the left of the taskbar, throughout Settings.  Textboxes in other apps work properly.  E.g. Notepad works.  Filename field in Save As dialog box accepts typed input everywhere.  It's just that the Windows search boxes do not accept input.Tried the following:sfc found no errorsdism restore completed successfullysearch and indexing troubleshooter found no errorschkdsk \/F found and fixed one error successfullyEnding the Cortana task in the Task Manager had no effectGot a \"blue screen\" SYSTEM_SERVICE_EXCEPTION just prior to this problem appearing, which I photographed with my smartphone.  Another side-effect was that the Windows Audio service would not start because of an access denied error, so sound currently on the PC.  Added permissions to the registry key for the service.  Changed the service login account from Local Service to Local System.  That allowed the audio service to start but it didn't fix the problem. In other respects, Windows is working properly.  What can I do to fix these problems?","solutions":["I had to do a clean install of windows 10, which fixed the problem.I believe what happened was that key system accounts were corrupted by a corruption of the drive the operating system was installed on.  For whatever reason, the corruption of these accounts manifested in two areas that were visible to me (the Windows Audio service not being able to start because the Local Service account was corrupted and the Windows search box being locked).  Probably over time other symptoms would also have appeared.I believe the reason the drive windows 10 was installed on got corrupted was that it was coexisting on the same machine with another drive that still hosted Windows 7, and the machine was not set up in a dual-boot configuration.  In anticipation of the end of support for Windows 7 on January 14, I decided to migrate the machine to Windows 10 in a way that would allow me to continue to use the Windows 7 installation until I got everything configured the way I needed it on the Windows 10.  I anticipated the period of overlap when both operating systems would coexist on the machine to be about a week.  So I purchased a new solid-state drive SSD, installed it on the PC, disconnected the original hard drive (hosting Windows 7), and installed Windows 10 on the new SSD using a DVD created using the Windows 10 Media Creation Tool.  After the Windows 10 installation completed, I reconnected the original hard drive.I opted against a traditional dual-boot configuration, because I had read that such a configuration would require me to keep the original hard drive in order for Windows 10 to boot, since the boot loader for both operating systems would be located on the original hard drive.  My plan was to re-partition and reformat the original hard drive after the migration to Windows 10 was complete, so I didn't want the new operating system to have any dependencies to that drive after the period of overlap had ended.  I didn't mind going into the BIOS to switch the boot order every time I needed to switch operating systems for the week that I expected the two operating systems to coexist on the machine.(See https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-hardware\/how-do-i-set-my-new-ssd-as-the-only-bootsystem\/5fb0725d-1117-4623-aba4-96a72c4a6b12?auth=1).After the upgrade, the original hard drive was assigned the drive letter C: in Windows 7 as it always was and the new SSD was assigned the drive letter E:  When I booted to Windows 10, by contrast, the new SSD was assigned the drive letter C: and the original hard drive was assigned the drive letter F:Initially everything was fine.  But after several switches between the two operating systems, I began to get messages on boot-up saying that inconsistencies had been detected and CHKDSK needed to run in order to fix them.  When I booted to Windows 10 (installed on the SSD), it automatically ran CHKDSK to fix inconsistencies on the original hard drive (that hosted Windows 7).  When I booted to Windows 7, it automatically ran CHKDSK to fix problems on the new SSD (where Windows 10 was installed).These \"fixes\" actually turned out to be very damaging.  Though the Windows 7 installation on the original hard drive did not appear to be affected by the action of the Windows 10 CHKDSK, the Windows 10 installation on the new SSD apparently was affected in an adverse manner by the action of the Windows 7 CHKDSK.  I believe it was this corruption of the Windows 10 drive that caused the security accounts inside Windows 10 to be corrupted, which in turn led to the symptoms of the search box lockup and Windows Audio service being unable to boot.Once I realized what had probably happened, I abandoned all hopes of trying to fix the problem and opted instead for clean install of Windows 10.  Since I had documented all the configuration steps I had taken, I was confident that I would have no further need for the Windows 7 installation.  So before beginning the windows 10 clean install, I went into the BIOS and removed the original hard drive from the boot sequence altogether.  As part of the Windows 10 reinstall, I re-partitioned and reformatted the SSD to make sure the new installation was built on a solid foundation.  The first time I rebooted into Windows 10, it noticed some errors on the original hard drive and ran CHKDSK to fix them.  It hardly matters, since that drive will no longer be used in its current format, but will be re-partitioned and reformatted from within Windows 10.  The new installation has been up and running now for a number of days and everything seems to be working fine.Apparently, Windows 7 CHKDSK is capable of producing unwanted side-effects when it is run on a drive hosting Windows 10 (though Windows 10 CHKDSK appears to be benign with respect to a Windows 7 installation)."]},{"symptom":"2 Microsoft accounts  on same La[p top        I got my new HP Laptop But had trouble signing in My Microsoft account Tried several times but could not So Created another account and was able to set up my new laptop But i now have the option to sing in on two accounts My Main account and the other one I created due to the first problem Both accounts are working fine and i can sign into both of them from my laptopIs it ok to have 2 Account to sign into on the same laptop Will this damage  laptop and affect how it works ","solutions":["Hi DanielJermy, there is nothing at all wrong with having two accounts on the one laptop, windows will simply see it as two users.they can both be microsoft accounts or both local accounts or one of each. At least one needs to be an administrator (both can be).","ThanksA great help ","You're welcome,"]},{"symptom":"where can i download a free word lease template        download a word rental lease template","solutions":["Hi JohnCarrigan1, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.Depending on the type of lease, you can find some online. I would recommend getting this reviewed by a lawyer or other leasing professional if it is this type of lease, as regulations vary by area.Here are some for a residential rental lease: https:\/\/eforms.com\/rental\/(allows you to choose by state and fills in some fields for you) https:\/\/www.vertex42.com\/WordTemplates\/lease-ag...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. If you are looking for something else like a vehicle or commercial lease, we could try to help find some for you too.I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","[where can I] download a word rental lease template From the internet. Google is my search engine of choice."]},{"symptom":"3D Applications\/Games Crashing 3 Different Systems?        Hello, everyone.Allow me to attempt to detail the last few days.I have 3 PC's in my possession currently.  Here are the specs for all 3:WORKSTATION:AMD Ryzen 5 2600x @4.0 GHzCooler Master Hyper 212 EVO (Arctic MX-4 applied)EVGA Geforce GTX 970 4 GB SCASUS WiFi CardElgato HD60 Pro Capture CardMSI X470 GAMING PRO MBCorsair Vengeance DDR4-3000 16 GB500 GB Samsung 860 EVO SATA SSD1 TB WD Blue 7200 RPM HDD8 TB Seagate Barracuda Compute HDD500w Corsair 80+ PSU (Non-Modular)Fractal Focus G Case (w\/1 extra Noctua 12 Fan)Total Wattage (via PCPP)- ~389 WGAMING:Intel i7-9700K OC @ 4.9 GHzNoctua NH-D15 CHROMAX Black (Arctic MX-4 applied)EVGA Geforce GTX 1070 Ti SC 8 GB BLACK MSI Z390 GAMING EDGE AC MBCorsair Vengeance DDR4-3600 16 GB500 GB Samsung 970 EVO M.2 NVME SSD1 TB Samsung 860 EVO SATA SSD650w EVGA G5 SuperNOVA 80+ Gold Modular PSUFractal Meshify C Case (w\/1 extra Noctua 12 Fan)Total Wattage (via PCPP)- ~425 WMOBILE:MAINGEAR VECTORIntel i7-9750h @ 4 GHz (-120 Undervolt)Repasted with Arctic MX-4EVGA Geforce GTX 1660 Ti SC BLACKVECTOR Stock MBVECTOR Stock DDR4-2666 16 GB1 TB Samsung 970 EVO M.2 NVME SSD100-250w Power Brick @ 19.5 V(For reference, the Gaming Machine is plugged into its own socket, while the Workstation is plugged into the dedicated plug on a high-end GE Power Strip that currently only powers an LED light for my desk and my 24 inch monitor).Every single one of these machines has been crashing in 3D applications over the past two weeks.It started on my workstation, when I ran a casual UserBenchMark and noticed that my GTX 970, once running in the 85th percentile, was now failing multiple GPU benches and straight up giving me an error on the \"Sphere\" benchmark.  Following this, I ran a 3DMark Firestrike, but the result was excellent (almost 12000, IIRC).  Playing Rocket League and MCC over the next few days, however, would yield multiple Gray Screen crashes, which I understand to be a Graphics Driver failure.  I also crashed, without fail, whenever I attempted to change any Graphics settings in-game.  Anti-Aliasing, shadows, you name it.  Crash.  I wondered for a bit if the PSU was supplying enough power, as well, but again, there's about a 100w overhead of the system (despite the Ryzen being a power hog) and the EVGA Power Supply is not cheaply made and worked without issue for the 6 months that I've owned it.  Naturally, I was resigned that either my card or my PSU was on the way out, despite showing zero signs of degradation previously.Until the exact same processes started with my 1070 Ti.  UserBenchMark failed the exact same multiple tests, games began to crash, and I can't change major settings without a crash.  With this, I could almost certainly rule out power, as the two machines are on two different circuits within my house and the 650w Modular has a 33+% wattage overhead for my system at max load.  Which was a relief, I suppose.  It also almost certainly ruled out Card failure, as well, as the likelihood of both cards failing in the exact same way is infinitesimal.    The Laptop fails similarly, for what it's worth, except for giving me a complete failure for some of the tests in UBM it just gives me something like 0.2 FPS in Sphere.  Games still crash if settings are attempted to be changed, most recently NFS Hot Pursuit with Shadow Detail.  This leads me to believe this is a massive driver\/OS problem.  All of my machines are (obsessively and unhealthily) updated to the latest drivers and OS revisions.  I read somewhere that the nVidia CP was recently transferred away from its own application and now, for some godforsaken reason, runs through the Windows Store.  At surface level, that seems like a massive change, so perhaps that's the culprit.  Troubleshooting steps ran:Removed Overclocks on all CPUs and GPUs, no effect.Removed all Overclocking Software from all PCs via clean uninstall, no effect.Removed nVidia Drivers via Clean DDU uninstall through Safe Mode, no effect.  Changed the \"Ultimate Performance\" preset in Windows CP to Performance and Balanced power modes, no effect.My current suspicion is it's the latest revision of Windows. Perhaps I'll try rolling it back sometime in the next few days.  Any help or commiseration about this issue would be greatly appreciated.  I can post nVidia CP settings if need be.Thanks.X","solutions":[]},{"symptom":"Cortana can't connect to Xbox in Notebook        Under connected home I can't connect my xbox. Doesn't work on PC or Mobile.PCMobile","solutions":[]},{"symptom":"Line wrap in Windows 10 Mail reading pane        The original post was raised five years ago on https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/line-wrap-in-windows-10-mail-reading-pane\/8d4be53b-8348-4184-85cc-341470e4de26.That post has been locked but this email issue is still not resolved. As such, I am copied the text and re-posting it. I hope it could bring this issue to the attention of Windows developers.\" I'm running Win 10 on a 15\" laptop. The text in all the email messages won't wrap in the reading pane, and extend to the right of the screen. To read the messages, I have to side-scroll. This is ridiculous. Is there really no text wrap setting for this app? \"","solutions":[]},{"symptom":"Handle is Invalid message on Startup        On Restart, I am getting a screen on the computer which gives my name and then the message \"Handle is invalid\" . When I press the \"OK\" button, the screen displays my login and asks for password. When I put in my Microsoft password, I get the same screen \"Handle is Invalid\". I can't get any further with the logon. I am running Windows 10 and have recently completed scans with McAfee and Webroot with no issues. Any suggestions?","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,I would recommend going into the windows recovery environment to use access multiple troubleshooting options.Start your computer, once the computer goes to the windows logo screen press and hold the power button for 5-10 seconds to shut it down completely. Do this for 3-5 times to force access the recovery environment.a) Startup repair Go to troubleshoot, advanced options, startup repair (This would attempt to repair the system)b) System Restore Go to Troubleshoot, advanced option, system restore (This would roll back the system's configuration to a specific time and date)c) Safe mode Go to Troubleshoot, advanced option, startup setting, click on restart and this would provide you multiple options in terms of booting up the computer.Choose to boot into safe mode, once accessed you could either uninstall the update or check if all your drivers are up to date. A clean boot under safe mode would also help to make sure no softwares are affecting the system1. Go to start menu\/search msconfig 2. On the system configuration window go to the services tab 3. Tick on hide all microsoft service so that this won't be affected 4. Choose to disable all services 5. Next, go to the startup tab and on the window choose to open task manager 6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok 8. A prompt to restart the computer will show up, choose to restart d) Reset this PC In the event that it still fails, I would recommend reinstalling the operating system. The option enables you to keep your files although uninstall programs that did not came with the system.Troubleshoot - Advanced Option - Reset this PC Alternative to reinstalling windows https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/support.microsoft.com\/en-in\/help\/400073...Let me know how it goes. :)","We have tried all of the options listed. All end up with a black screen and no progress toward restoring Windows. We are giving up on the computer since it is unusable and 9 years old. I have purchased a new computer rather than investing money in having an outside group (such as Geek Squad) try to fix it. I am highly disappointed in Microsoft for its failure to provide better solutions such as the old F8 or F2 on startup to allow users to bypass the Shft Restart when those solutions do not work. "]},{"symptom":"WIndows 10 for  windows 7                        Hi  how  I can instal  for free windows 10 in  my computer windows  7, thank you ?","solutions":["You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700Cheers."]},{"symptom":"windows 10 s mode        new computer here,,,windows 10 with s mode. How do I get out of s mode?","solutions":["Hi George. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Guardian Moderator here to help you.See here how to switch out of S mode: https:\/\/support.microsoft.com\/en-us\/help\/445606...We see reports here of delays, likely due to overloaded servers so it may take a day or two of trying, and if it persists you can contact Microsoft Support by one of these methods:https:\/\/partner.support.services.microsoft.com\/... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi,What's the benefit (or lack thereof) of using \"s\"???  I think it is LIMITING my ability to use Microsoft OneNote and OneDrive from my other devices. :("]},{"symptom":"Connecting iTunes on Windows 10 PC with iPad        Hello, since a few weeks I have the problem that I can’t connect iTunes running on  Windows 10 notebook with my iPad, which worked well the last 2 years. The device manager on the PC shows that the iPad is connected, and shows also up the USB entries, and according to Windows checks, also the USB controller should be ok (just has no “Apple” in the driver name.Same iPad works well with my desktop PC. What could be wrong. Has anyone else similar problems","solutions":["Have you already tried with with the \"standalone version\" of itunes ? You can download it from https:\/\/www.apple.com\/itunes\/scroll down past the laptop, then select : \"Looking for another OS ? => Windows Then you'll be able to download the Windows version of iTunes. Looks like the itunes store app is having some issues."]},{"symptom":"Can't find task view in windows 8.1        I have to be able to create virtual desktops for a job from home and I am running windows 8.1. I cannot find task view when I right click taskbar it is not in the  menu.","solutions":["These are Windows 8.1 forums.Task View is in Windows 10.https:\/\/www.computerhope.com\/jargon\/t\/task-view.htm"]},{"symptom":"Lost documents        Can't find document anywhere.  In middle of working on a 7 page document  a Microsoft  notice popped  up on OneNote asking for my password.   I gave it and  tried to go back to my document.   Only 4 paragraphs  of the 7 pages were there.  I had been saving after  every page  and now can't find anything more than the 4 paragraphs.  Any suggestions? ","solutions":[]},{"symptom":"Installation from usb        My desktop had its operating system deleted somehow. Now I get a black screen saying no operating system detected. So I got a windows 8 usb, how do I install it?","solutions":["An operating system can't be accidently deleted.If you have an operating system can't be found message you may have a failed hard drive.I don't know where you got a Windows 8 USB from as there are no official 8 ISO downloads available from Microsoft; only 8.1.And I don't know how your USB was made Bootable.\"How to Create a Bootable USB or DVD with a Windows 8 or 8.1 ISO\"http:\/\/www.eightforums.com\/tutorials\/2227-create-bootable-usb-dvd-windows-8-iso.html   WarningThis will not work to install Windows 8 or 8.1 for UEFI. For that, see this tutorial below instead.UEFI Bootable USB Flash Drive - Create in Windows_____________________________________To access BIOS\/UEFI - UEFI\/EFI configuration:https:\/\/neosmart.net\/wiki\/boot-usb-drive\/_____________________________________How to clean install:\"How to Do a Clean Install of Windows 8 or Windows 8.1\"http:\/\/www.eightforums.com\/tutorials\/2299-clean-install-windows-8-a.html_____________________________________"]},{"symptom":"Windows 10 Scan & Repair Turned Music Files into \"Other\" on iPod Nano        Recently, I connected my iPod Nano 4th Gen to my Windows 10 laptop. I got a message saying there were some errors on my device and asking to scan and repair the files. Naively, I clicked yes. This seemingly wiped all 2,000+ audio and video files off my iPod. However, I later realized that those files are still on the iPod.When I open iTunes, the files are displayed as \"Other\" instead of as audio and video files as they were before and iTunes can't read the files. Also, when I eject the iPod from my laptop, no audio or video files are shown on the device.However, the music and video files play just fine with the Groove Music app. Despite that, I can't seem to find the location of the files on the iPod through \"Computer\" when it's plugged into my laptop. Since Windows screwed up the files, surely there's some way to use Windows to make the files readable as audio and video files again, correct?","solutions":[]},{"symptom":"Windows will not go to sleep (I've tried everything)        Headline:  my windows 10 PC will not automatically go to sleep based on the sleep timers for either \"Screen\" or \"Sleep.\"  It will try (screen goes black for a second) but then goes bask to my desktop.  If I manually click the start icon and go to power\/sleep, the computer will go to sleep.  However it will wake itself up randomly to the login screen.I'm hoping there is someone who can help read a log file to determine if there is anything in there that is causing this issue.  I suspect it may be hardware related as I seem to have exhausted every software related fix.Things I have tried:Powercfg -requests shows nothing (because it actually doesn't go to sleep, it just tries, but never makes it)Powercfg -lastawake shows nothingPowercfg \/waketimers will just show updateorchestrator I have disabled my ethernet device from waking up the computer including magic packetI have disabled my wireless mouse and wireless keyboard from waking up the computerI have turned off the windows updateorchestrator to wake the computerI've tried turning hybrid sleep on and offI spit out a log from powercfg and all of the items said \"this will not prevent your computer from sleeping\"Probably several other that I can't rememberAny experts out there?","solutions":[]},{"symptom":"Forza Horizon Pc doesnt recognize Lego Speed Champions        I just bought the expansion for my husband, and he aint find a way  to play it ingame. He goes to the location in Forza and still asks him to install te game, sends him to the microsoft store which prompts that its already installed. We have been trying to solve it, restarting the game, the CPU, but nothing works. Any response?","solutions":[]}]}