{"windows":[{"symptom":"Combat Flight Simulator 3        Does this game require an install key to run?","solutions":["[EDIT:  oops - Yes,I believe you do need the key code to install, but if you were able to install the game without a key codethe following will also apply ]This game requires a noCD fix\\hack to run on Win10, assuming you are using the disc based version of the game.More details on MS's DRM Blocking in my post at  ---this thread---Once you have that the game will run fine [EDIT:  I have CFS2 which is pretty much the same game with different maps\\scenario, but my current install goes back to 2010, Win7so I don't recall if I had to use the code, but I expect I did ].","Thank you.Interestingly, the product I bought has no install key on any of the packaging and it installs ok.  I am selling it so wanted to be sure the buyer wouldn't have a problem.","Hi ,bjonson my name is Dennis, I'm an independent advisor and I'll do my best to help today. If the game does not ask to enter a key, it means that you do not need it. Regards, Dennis."]},{"symptom":"Static sound when I connect my bluetooth headphone and play games        Hi there. I have been facing this issue from a few days. A few days back, I wanted to play an online game with voice chat enabled with my friend so I connected my heaphones. The thing that happened with me was when I connected my headphones and turned on the game, i i w getting weird static noises and unable to hear anything. I tried disabling my mic and I was able to hear sounds now but cannot voice chat. Then again enabled mic and still got static sounds. Is there any fix that I can do to use both of em together?Btw, I tested in on my phone and it was all fine. Its just windows 10 I think so..","solutions":["Hi, LBPaswan My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps. - Press ‘Windows key + I’ together to open ‘Settings’. - Click on ‘Update & Security’. - Click on ‘Troubleshoot’. - Click on ‘Playing audio’. - Click on ‘Run the troubleshooter’. You can also update the audio drivers. https:\/\/support.microsoft.com\/en-us\/help\/402844...Try to run the troubleshooter for Bluetooth. Go to Settings - Updates & Security - Troubleshoot. Click on Bluetooth under Find and fix other problems. Follow the on-screen instructions.https:\/\/support.microsoft.com\/en-ca\/help\/402622...https:\/\/support.microsoft.com\/en-ca\/help\/15290\/...Try to update the Bluetooth drivers https:\/\/support.microsoft.com\/en-us\/help\/402844...","I have already tried that before and again now but it doesnt work. I think its impossible to fix this :(","I recommend that you repair Windows completely before you must make a backup of your personal files, third-party software will be removed. Here the link to download the Windows ISO.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"windows resize        HelloI bought a new 2K monitor so i use 2560x1440 resolution now. After hibernation or anything that shuts down my monitor, all my open windows always resizes to what looks like 1080p size. I tried updating nvidia drivers. ","solutions":["Being able to display that kind of resolution requires a video capability in the computer to generate it.  It is likely your video circuitry is not capable of it."]},{"symptom":"BitLocker without TPM but using a flash drive - doesn't need flash to boot.        I'm trying to understand how full-disk bitlocker works as I intend deploying it on a number of PCs, not all of which have a TPM. I enabled bitlocker on a windows 10 laptop which does have a TPM but I elected not to use it. Instead, I saved the key to a USB flash drive. My expectation was that if I attempted to reboot the laptop without the flash drive, it would fail but in fact, it boots as normal. I've tried several times, even removing the battery. So does bitlocker give any protection if there is no TPM?","solutions":["Hello Robert, Do you remember if you chose  to \"Insert a USB flash drive\" for how to unlock your drive at startup like at step 10 in option 1 of the tutorial below?https:\/\/www.tenforums.com\/tutorials\/37060-turn-off-bitlocker-operating-system-drive-windows-10-a.htmlIf you didn't, then you can turn off BitLocker for you OS drive using option 2 above, and start over using option 1 above being sure to choose a USB at step 10.","Hi Shawn,Thanks for your reply. I don't actually recall any options being presented before I chose to save the key to the USB drive. I certainly don't remember specifically choosing to have the USB plugged in to unlock the disk. I kind of assumed that as I had saved the key to a USB drive, it would know where to look for it, or at least ask.Remember that I do have a TPM on this PC, I'm just choosing not to use it to see how it works in this situation. So is it possible it has detected the TPM and chosen the 'automatic unlock' option perhaps? What I'd really like to understand is the protection the current situation is giving. If the drive is 'automatically unlocked', what is the point of having it encrypted in the first place? I'm sure there is a simple answer to this but trying to find it described anywhere is proving very difficult.Rob.","It is possible. If your PC also has the Device Encryption feature, it would have been used by default.Do you have Windows 10 Home or Pro installed? BitLocker will not be available with Home, but Device Encryption may.If you like, you could turn off BitLocker encryption for the drive, disable the TPM in BIOS, and try encrypting the OS drive again using the steps in the tutorial I posted above to see if you are able to select to unlock at startup with a USB.","The system in question is windows Pro. I will certainly try your suggestions. Thanks.I noticed in 'Device Security' it says \"Standard hardware security not supported\". Yet I have the ability to reset and manage the TPM.I'm still struggling to understand the basics. For example, if I have a PC with a TPM but someone steals the module (they are very easy to install and remove) does that mean they will have access to any disk in the system? I'm assume yes and I guess that's the point of having the PIN. Or does the TPM store information about the system that's difficult or impossible to replicate?I'm also rather concerned that I have a system where the bitlocker manager clearly shows bitlocker is enabled but it appears to offer no protection.Rob. ","The \"Standard hardware security not supported\" message could indicate that not all requirements are met. For example, at least TPM 2.0 version.https:\/\/www.tenforums.com\/tutorials\/36454-verify-trusted-platform-module-tpm-chip-windows-pc.htmlThe TPM is usually soldered to the motherboard, so they would need to steal the whole computer.I don't like to use \"Let BitLocker automatically unlock my drive\" with TPM, but use a PIN or USB to unlock along with TPM. This way if they steal the PC, they still can't unlock it with the TPM alone.","The TPM is usually soldered to the motherboard, so they would need to steal the whole computer.For laptops yes, but it seems many (most?) motherboards don't come with it as standard and you have to buy the module separately e.g.https:\/\/www.asus.com\/Motherboard-Accessories\/TPM-M-R2-0\/Yes, very worrying that there are so many options for bitlocker with many not providing useful protection, not helped by inadequate documentation.Rob."]},{"symptom":"Windows 10 update November 2019 1909 - Printer issue still not resolved        My printers stopped working after the last Windows 10 update in October 2019. Unfortunately I was not able to remove the specific KB update which created the issue because it was not listed anymore after the version update...I just installed the last 1909 release hoping that the printer issue would have been fixed but still nothing works.I have fixed printer spooler but not even Microsoft Print to PDF works...Any suggestion?","solutions":["Hello , thank you for providing this question. I am a seasoned Windows expert with almost a decade in usage and support experience and hope to resolve your problems quickly.I assume by saying you fixed printer spooler you mean you cleared and reset Windows Print Spooler exactly as described in point 6 of this guide:https:\/\/support.microsoft.com\/en-us\/help\/401540...Please execute step 5 and then maybe step 6 if you are unsure you fully reset spooler services.Since you cannot print to pdf i assume the problem is not with a single printer but with the system.Therefor If the above procedure doesn't get it to work, you made sure you have no antivirus installed blocking part of the process i suggest we start scanning for corruption of system files next. I can guide you through the process, just answer here.If you consider your problem solved it would be very good if you marked the answer which helped you so others can find and use this thread.kind regards F. Grobusch","Hi,I've seen those posts and these solutions but they just don't work. That update screwed up everything and Microsoft is not fixing it.The last resort would be to re-install or reinitialize Windows, a thing that I would like to avoid...Thanks for your help.","Lets try to scan for system file corruption. Then we look to clean up the image then scan again just in case.For starters press Start and enter cmd then start it with rightclick as administrator.In the cmd pls enter each of the following command lines as a whole as one command. Copy them with CRTL + C and paste them into the cmd with CRTL + V or rightclick to avoid spelling mistakes. Each of those might take a while. If they throw you an error kindly report it back to me in your next mesage. sfc \/scannow Dism \/Online \/Cleanup-Image \/ScanHealth Dism \/Online \/Cleanup-Image \/CheckHealth Dism \/Online \/Cleanup-Image \/RestoreHealth sfc \/scannow","Done.Everything run smoothly and no errors whatsoever where found.","Please make sure you have installed KB4524147. Requirement for this is KB4515383This fixes a bug in the printer spooler introduced in September Update. https:\/\/support.microsoft.com\/en-us\/help\/452414...https:\/\/support.microsoft.com\/en-us\/help\/4515383","I successfully installed the update KB4515383 but when trying to install the update KB4524147 I get the error 'The update is not applicable to your computer'","With the new servicing stack installed search and install all updates first. Then we continue. This problem should have been fixed in 1903 with said KB but there does not exist an according KB in 1909 yet. Maybe Microsoft is not yet aware the problem is not fully resolved. Before we give this to the feedback hub please first try to install updates and reboot.","I tried already to search for new updates before and after rebooting but there are none.","Then my best guess would be that the supposedly fixed bug with the printer spooler introduced in the september security patch for ie 11 components still persists in a 1909 enviroment which did not install the fix prior to the update and now can not install the fix (KB4515383) meant for 1903. Please report this information to Microsoft using the Feedback-Hub so this can be fixed.I'll be searching for a workaround and in the meantime release the question in case another expert found one already.I'm sorry i could not solve your problem immediately.","Done.Thanks again for the help. Let's hope they will fix this annoying glitch."]},{"symptom":"Windows Media Center guide data        Windows Media Center has started annoying me today with a popup (text to follow) about it retiring the free guide data.  I've seen the message a couple of times before, but now it is notifying me every time I hit the guide page or the main page in Windows Media Center.  I've literally seen the message hundreds of times today.  I'm WELL aware of the this fact and don't need to be notified, especially via constant harassment .  How do I stop it?  I've already switched to a different guide data provider and I don't need the Microsoft data anymore.  What I really want it for them to stop the annoying popup.SWITCH TO AN ALTERNATE TV PROGRAM GUIDE PROVIDERStarting in January 2020, Microsoft is retiring its Electronic Program Guide service.  To continue receiving TV Program Guide information on your Windows Media Center, you may configure an alternative TV listing provider.","solutions":["Microsoft needs to fix i.e., stop this pop up if you have subscribed to a different source.  It seems to me that if you rejected the guide eula it should not happen in the first place.","May I request a link posted for any alternative TV listing providers? Been unable to get answers from Microsoft.Thank you.............","http:\/\/epg123.garyan2.net\/Is a nice alternative if you are sticking with WMC.","Thank you...........prompt reply!","So when can we expect a fix?","There won't be a fix. You have to purchase a third party service.  Microsoft has shut down their service.","There won't be a fix. You have to purchase a third party service.  Microsoft has shut down their service.This is terribly useless reply.  The only thing I want them to do is to STOP HARASSING ME about their guide data going away when I'm not using it anyway.  The other replies in here are just fluff and are only loosely related to the real problem which is the constant harassing message."]},{"symptom":"NO IDEA WHAT TO DO NOW!!!        I am sure I am not the only person out here who, cannot afford a new computer or even buy Windows 10 to download. I did the free thing but grandson crashed that computer and I couldn't reinstall it for some reason.Yes I am actually THAT broke, I have Triple Negative Breast Cancer (the incurable one) and went on a new trial, not so much for me, but it could either improve future sufferers treatment or save them some heartache, because I truly did not expect to still be here a year later, nor did my oncologist, it was so aggressive.  Then that trial decided my good organs, specifically my heart was the enemy and gave me a heart attack.I just cannot see a new computer or even the Windows 10 download in my future, or what's left of it my computer is now my lifeline to my friends and lifts to doctors appointments, which since my heart attack have doubled in frequency.So what is someone like supposed to at end of support of windows 7?","solutions":["I am sure I am not the only person out here who, cannot afford a new computer or even buy Windows 10 to download.I did the free thing but grandson crashed that computer and I couldn't reinstall it for some reason.Yes I am actually THAT broke, I have Triple Negative Breast Cancer (the incurable one) and went on a new trial, not so much for me, but it could either improve future sufferers treatment or save them some heartache, because I truly did not expect to still be here a year later, nor did my oncologist, it was so aggressive.  Then that trial decided my good organs, specifically my heart was the enemy and gave me a heart attack.I just cannot see a new computer or even the Windows 10 download in my future, or what's left of it my computer is now my lifeline to my friends and lifts to doctors appointments, which since my heart attack have doubled in frequency.So what is someone like supposed to at end of support of windows 7?The free upgrade to 10 is yours for the life of that device that you had the free upgrade installed and activated on.The best method to upgrade back to 10 is to clean install it.Use the Windows 10 media creation tool on the Software download page \"Start fresh with a clean installation of Windows 10\"https:\/\/www.microsoft.com\/en-us\/software-download\/windows10startfreshReinstall Windows 10:https:\/\/support.microsoft.com\/en-us\/help\/4000735\/windows-10-reinstall\"How to Clean Install Windows 10\"http:\/\/www.tenforums.com\/tutorials\/1950-windows-10-clean-install.html_______________________________________________How to Create Bootable USB Flash Drive to Install Windows 10 fromThis tutorial will show you how to create a bootable USB flash drive that can be used to installWindows 10 with or without UEFI.________________________________________________To access BIOS\/UEFI - UEFI\/EFI configuration:https:\/\/neosmart.net\/wiki\/boot-usb-drive\/_____________________________________When your free upgrade to 10 was  originally activated Microsoft will have kept the Hardware Configuration details of your device on their Servers for recognition purposes if you have to reinstall 10.\"Activation in Windows 10\" (Digital entitlement)https:\/\/support.microsoft.com\/en-au\/help\/12440\/windows-10-activation@@@@@@@@@@@@@@@@@@@@@@@@@Or stay with 7:If you're looking for information for home users, see Windows 7 support will end on January 14, 2020.With end of support Microsoft is not telling you that your operating systems won't work.What they are saying is that after a certain date they will no longer support them.Whether they still work or not with particular programs is up to the particular program manufacturers.Example: Google Chrome is no longer supported for security updates in XP or Vista by Google and Mozilla Firefox is following the same path.What this basically means with Microsoft no longer supporting an operating system is that even though hackers may find \"holes\" and vulnerabilities to be able to access the operating systems and cause security problems, Microsoft will no longer be monitoring or rectifying those problems by way of Security Updates each month.You are on your own in regards to maintaining the Security of your operating systems.What does it mean if Windows isn't supported?____________________________________________________This will show you when support (Mainstream and Extended Support) for the various operating systems ends.Windows lifecycle fact sheet - Windows Help - Microsoft SupportAnd these FAQs show you how Microsoft arrived at the Support Lifecycle Policy:Microsoft Lifecycle Policy FAQhttps:\/\/support.microsoft.com\/en-au\/help\/17140\/lifecycle-faq-general-policy-questions@@@@@@@@@@@@@@@@@@@@@@@","I have 120 Windows 7 clients who plan to continue to use Windows 7 for years to come.  We stopped all Microsoft updates 32 months ago and there has not been a single instance of any kind of a problem.  Mind you please, these are NOT enterprise installations.You can find pretty detailed instructions on how to get ready to do this here:https:\/\/www.askwoody.com\/2019\/canadian-tech-how-to-rebuild-a-win7-system-with-minimal-snooping\/If you have further questions, please do not hesitate to ask."]},{"symptom":"Windows 10 + RDP + login delay        Seems when RDP begins the process to login\/logon to a RDP client\/session, it posts a full screen windows security windows until it times out approximately 30 - 60 seconds later and allows you to enter a password for that RDP client\/session.  This is sooooooo frustrating!!!Please help to resolve this.LB","solutions":["Hi, Thank you for writing to Microsoft Community Forums I understand that you are facing issues with authentication delay while using Remote Desktop. However, for issues related to Remote Desktop, let me help to point you in the right direction. I would suggest you to post your query inTechNet Forums where you will find professionals with expertise on RDP for Windows 10 and that would be the appropriate forum. However, you may want to check some of the General Remote Desktop connection troubleshootingUser can't authenticate or must authenticate twice Regards, Aditya RoyMicrosoft Community – Moderator","Thank you for responding, I'll re-post as suggested.LB"]},{"symptom":"Windows 10 won't boot passed startup screen.        2 nights ago my wife finished using our desktop and shut it down as normal. She said it took a little longer than normal to shut down.Now it wont boot passed the windows icon, it just goes to a black screen (with cursor). Ive tried booting in safe mode with the same problem. I've tried using a windows recoceey tool on a usb and i get the same problem however after an \"American Megatrends\" screen. Finally I used the windows 10 tool and tried to boot from that. This time I get a purple screen with cursor.There is no error message, nothing. Just a quick flash of what looks like a command box (could be something similar) and then a black ir purple screen.Using a genuine copy of Windows.Anybody have any idea what's going on? Or solved a similar problem in the past?Thanks.","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,I would recommend going into the windows recovery environment to access multiple troubleshooting options.Start your computer, once the computer goes to the windows logo screen press and hold the power button for 5-10 seconds to shut it down completely. Do this for 3-5 times to force access the recovery environment.a) Startup repairGo to troubleshoot, advanced options, startup repair (This would attempt to repair the system)b) System RestoreGo to Troubleshoot, advanced option, system restore (This would roll back the system's configuration to a specific time and date)c) Safe modeGo to Troubleshoot, advanced option, startup setting, click on restart and this would provide you multiple options in terms of booting up the computer.Choose to boot into safe mode, once accessed you could either uninstall the update or check if all your drivers are up to date. A clean boot under safe mode would also help to make sure no softwares are affecting the system1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartd) Reset this PCIn the event that it still fails, I would recommend reinstalling the operating system. The option enables you to keep your files although uninstall programs that did not came with the system.Troubleshoot - Advanced Option - Reset this PCAlternative to reinstalling windowshttps:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/support.microsoft.com\/en-in\/help\/400073...Let me know how it goes. :)","Hi Gary,Thanks for the reply but unfortunately it hasn't worked.After following your steps I get the screen attached in the first photo below. The options you have stated don't appear. After pressing \"F8\" on the below screen it gives me a list of around 10-12 options. Some of them being \"Safe Mode\", \"Safe Mode with networking\" and \"Safe Mode with Command Prompt\". I've tried all three with no success, just goes straight back to the black screen after the windows logo.Pressing \"F9\" leads to a screen that allows me to run the tool seen in the second photo, however after that finishes I'm back at the first photo again."]},{"symptom":"Hang on Android phone in new laptop setup        Trying to setup my new Surface Pro 3, I'm totally stopped at the Android Phone step. My phone tells me to open the app on my PC to give some sort of permission, the PC will not allow me to skip or bypass the step at all no matter what, clicking on those selections is useless as it is on every other form of the setup process, and since I am in setup I cannot get to any application yet to open it to send anything anywhere. What should I do?","solutions":["Hi Starr. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.DIsconnect from the internet to force Setup to bypass that step. If it still will not budge, then press and hold the power button in until the power cuts off. Wait 5 minutes and then turn it back on to see if it will proceed. Make sure the internet is disconnected until setup completes, then connect to your network. I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","I am unable to achieve Setup without an Internet connection. It forces me to choose either to plug in a cable (doesnt exist on a laptop), or it picks the first available network on the list and forces me to enter security information. So I tried waiting a half hour then running setup again with my own connection but I am still stuck in the same place, on the Android Phone form. It just keeps sending me the text with the link for the app. What does it want? How can I move on past this step?","This is a Surface Pro 7 right out of the box.","When I disconnect the Internet right on the Android Phone form, it displays \"something went wrong, try again later\", and I am still trapped on the form. Is my Setup software corrupt? "]},{"symptom":"Bluetooth and Hotspot        Good dayWhen I try to connect to bluetooth it says it cant and when I try to turn on Mobile Hotspot it says that it cant set it up right now.I have tried to update my drivers and all of the above on the discussion you gave other people, but with no luck.Please assist.","solutions":["Hi, John-ToitReinders My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to run the troubleshooter for Bluetooth. Go to Settings - Updates & Security - Troubleshoot. Click on Bluetooth under Find and fix other problems. Follow the on-screen instructions.https:\/\/support.microsoft.com\/en-ca\/help\/402622...https:\/\/support.microsoft.com\/en-ca\/help\/15290\/...Try to update the Bluetooth drivers https:\/\/support.microsoft.com\/en-us\/help\/402844...","Hi John-ToitReinders,Did the mobile hotspot on your pc work or did it never work? What is the error message you receive when you enable Mobile Hotspot?If you prefer, post the screenshot.Also, go to Device Management> network adapters, post the screenshot.","Hi Franco.Yes it did work before.And then one day it just stopped workingAttached is the error it gives me and the screenshot of the Device manager","Hi JeffreyI have tried all this before as well.Still no luck.it does not want to connect or show that I have bluetooth on the PCThe error says","Hi John-ToitReinders,for what concerns the mobile hotspot, try to follow this procedure: Enable \/ disable ICS. Try to follow this procedure: Go to network connections, access the properties of the network adapter connected to the internet> Sharing tab, enable Connection Sharing Internet (ICS) by selecting the checkbox: Allow other users on the network ... and confirm by pressing OK.(Skip this step if ICS is already enabled.) Return to the Sharing tab, disable ICS and confirm by pressing OK.Then go to Settings> Network and Internet and enable the mobile hotspot.Note: When using the Windows Integrated Hotspot Mobile feature, the check boxes on the Sharing tab must remain unchecked, otherwise the Mobile Hotspot will not work. If it does not solve, try to restore the network: Settings> Network and internet> Status.Click on Network recovery on the side and follow the instructions.Try temporarily uninstalling any third-party firewall \/ antivirus software or VPN software and try again.As for Bluetooth, there is no Bluetooth network card in Device Manager.Previously did bluetooth work on your pc? Check if Bluetooth is present in hidden devices: click on View> Show hidden devices at the top.","Hi FrancoI tried all that for the hotspot and it still did not work.For the Blutooth, yes it did work before and now all of a sudden it does not work as well.I have a VPN installed for my work that I do, called FortiClient. Can that perhaps be the cause as well?","Hi John-ToitReinders,regarding the mobile hotspot, as I already told you in my previous post, you must try to temporarily uninstall the third-party firewall \/ antivirus and the VPN software because these could be the cause, then try again.As for Bluetooth, I repeat that it is not present in the Device Manager, so its driver was probably uninstalled incorrectly.Go to Device Manager> network adapters, click on the top on View> Show hidden devices, post the screenshot."]},{"symptom":"Microsoft Edge Access to Saved Passwords        These are the hoops one goes through to view saved passwords using Edge: Settings>Passwords and Autofill>Manage Passwords>Select website. To see what's hidden by dots, go to Control Panel>User Accounts>Manage Web Credentials. Then select the same website and to view the password, you must verify your own credentials by entering a password. What password? Microsoft Account? Device password? I am set up without a device password since it's a hassle and not required in my own home and the Microsoft Account password does not work.  ","solutions":["Hi Clipperflyer you can bypass some of those clicks by clicking start and typing credentials manager (or enough of it for it to appear in the results).the password you need is the password you use to log into windows, this is to make sure it is you and not somebody else that has got access to the credentials manager.there are a number of places that blank passwords are not acceptable. it is better to set a password then set a default account to log in automatically, bypassing the need to enter a username and password.the following will work with either a local or microsoft account to remove the need to enter the password on boot click start type netplwiz and press enter untick \"users must enter a username and password...\" click apply (if it is already unticked, tick the box and click apply then untick it again and click apply)you will be asked for a username and password (used to automatically log on). if you are using a Microsoft account enter the FULL email address. enter and verify your password and click ok next time you boot the computer it will automatically log on. NOTE - there is no need to switch to a local account, it WORKS perfectly well with a Microsoft account, as long as you enter the full email address in the username field.blank passwords are NOT a good idea. do not forget the password. to prevent it asking for a password when waking from sleep, go to settings -> accounts -> sign-in optionsunder \"require sign-in\" select Never. hope that helps please let us know if you experience any problems."]},{"symptom":"computer slow after upgrade to Windows 10        After upgrade computer works strange. User applications generally start relatively fast. System apps start extremely slow. If I type something in search line it give me black window and responses after couple of minutes. During this time \"Host Process for Windows Tasks\" start to use 15% of processor time and all time communicates to SSD with 48 Mb\/s.Windows 10 home, ver. 1909, build 18363.535","solutions":["If this is from the first start do not worry, restart a couple times and it gets better.","After restart it even worse. I restarted twice. Any time after I insert password it makes black screen for minute or more.Search line the same slow.","Problem solved. Logs show multiple error 447 for file in web browser cash. After I remove this file all work properly.Interesting, user applications worked fast and system tools slowdown because web cash file, despite no browser worked."]},{"symptom":"0x80004005 on Mail & Calendar        I am trying to update my mail settings in Mail & Calendar, but every time I do I get the following error message: \"Something went wrong.  Error code 0x80004005.\"  I reset my Mail & Calendar app, and am still getting this message.  Please help.","solutions":["Mail & Calendars were updated today in Store.Go to the Store, Click on the 3 dots ( . . . ) to the right of your picture, click on Downloads and updated, Get updates..When done Click on the 3 dots ( . . . ) to the right of your picture, My library, Scroll down to the app and install or Launch.","Sorry, I am still getting the error message.","I just ran the System File Checker tool to see if that might fix the problem.  Unfortunately it is still persisting.","A System Restore seems to have resolved the issue, but now there's a new problem.  For some reason the Live Tiles on the Start menu do not depict the Mail & Calendar apps as \"Mail\" & \"Calendar.\"  Instead, they're showing a line of text beginning with \"ms-resource\" and they have been shuffled to an \"Other\" section as such.  Is there any way to rename these tiles?","See if anything here helpshttps:\/\/windowsreport.com\/fix-windows-10-start-menu-tiles-wont-show\/be careful not to select any advertising links, just read the text.","I am trying to update my mail settings in Mail & Calendar, but every time I do I get the following error message: \"Something went wrong.  Error code 0x80004005.\"  I reset my Mail & Calendar app, and am still getting this message.  Please help.Hello, Try re-registering Mail & Calendar app. Perform these steps: 1. Search for Windows PowerShell using Cortana or Windows Search. 2. From results, right click on Windows PowerShell and select Run as administrator. 3. Then type following command and press Enter key: Get-AppXPackage -AllUsers -Name microsoft.windowscommunicationsapps | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register “$($_.InstallLocation)\\AppXManifest.xml” -Verbose} Let the command complete. 4. Close Windows PowerShell and see if the issue is resolved now. Let us know if this helps!","Restarting Windows Explorer from the Task Manager cleared things up.  Thank you very much."]},{"symptom":"Remove OneDrive access from old computer        I'm selling my old laptop and can't seem to be able to remove OneDrive access from it.  I don't want the buyer to be able to access my OneDrive obviously.PLease advise how I remove access to OneDrive from my old laptop.","solutions":["Have you done a right click on the One Drive icon and then clicked on Settings>Unlink this PC?"]},{"symptom":"Can't login to microsoft account on minecraft: windows 10 edition        I just got minecraft for windows 10 yesterday, and i try to log in to collect the items in my starter pack. Every time i click to log in though, there's an error message that pops up saying \"Failed to login. We tried to sign you into your microsoft account, but something went wrong.\" and there's a \"close\" button at the bottom. I just want a way to sign in so that i can get my stuff. Also, would i be able to sign in with an account that didn't buy the game? Or is it mine now and i can sign in with whatever account? Thank you for your help :))","solutions":["Hi Trash-Fire, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Try the following, these steps have helped other users with this same problem, I hope they work for you too.1.- Uninstall the game 2.- Reset the Microsoft Store application Press the Windows key + I >> Settings >> Applications >> Microsoft Store >> Advanced options >> Reset3.- Restart the computer, then reinstall the game, and try the session again, if it does not work check the steps of the following link.Fix problems with apps from Microsoft Store https:\/\/support.microsoft.com\/en-us\/help\/402749...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M.","Thank you for the tip, Marc! I have one extra question, though, would i be able to sign in with my personal microsoft\/xbox account (my mom bought the game and used her email)? You have a nice day too! :)","Hey again, Marc.. I followed your steps to a T and the result is actually worse than before? Like I lost all my worlds and things and I still can't log in\/the same error message pops up. Losing worlds is to be expected when uninstalling and not having anything saved though, so I can't go saying it's all your fault. I looked at the instructions on the link you sent me, but they didn't make much sense in the way of just being able to sign in to my microsoft account from minecraft. If you can supply any other help, that would be fantastic! Thanks","Hi, I regret to read that, can you share exactly the error you see? Normally, these steps have previously solved these types of problems to other users, for that reason I shared them. Have a great dayRegards","I can take a few screenshots, if you'd like! here:This is what appears when i load up the app, then i click sign in for free. Everything seems normal, my screen shows like thisThen of course, i notice that it's still telling me i have to sign inSo I click the button, and this error message pops up. And this happens pretty much any time i click sign in anywhere within the app. I try to go on servers and it tells me to log in, i click log in and that error message pops up. Any idea what i could do to actually be able to sign in? Thank you again for your patience!","Hi, Excuse me, I couldn't answer before, try the following: 1.- Clear the store cache https:\/\/www.thewindowsclub.com\/reset-windows-st...2.- Reinstall the Microsoft Store Press the Windows key + X >> PowerShell (Run as Administrator), copy and paste the command using the mouse button: PowerShell -ExecutionPolicy Unrestricted -Command \"& {$ manifest = (Get-AppxPackage * WindowsStore *). InstallLocation + ' \\ AppxManifest.xml '; Add-AppxPackage -DisableDevelopmentMode -Register $ manifest} \"+ Enter, wait for the process to finish, restart the computer.Regards Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I did what you said up to restarting the computer, is this supposed to happen?Doesn't look the part since there's a bunch of red text i dunno","Hi, Those red lines are part of the same process, none of the 2 options had the expected effect?Regards"]},{"symptom":"seagate external hard disk not showing up        Hi,Device manager indicates Unknown  USB Device (device descriptor request failed),Under Mass Storage - Properties - Error Code 45Other HD and SDs are working good.Can someone help............................","solutions":["Hi,I often find that my Seagate external drive does not show up in Windows Explorer. This is usually because a drive letter has not been assigned. You can check if this is the problem by going Right-click Start>Disk Management. If your disk is there, you can assign a drive letter which will make it visible.The Windows Insider Program forum is just for discussions about preview builds of Windows 10, so I have moved your post to the public forum."]},{"symptom":"Can't change pin        I still has my pin on my laptop but when i went to change my pin this happen and i don't know how to fix this please help!My windows version is 1909","solutions":["Hello,See if this fix helps you:https:\/\/www.kapilarya.com\/fix-pin-not-working-in-windows-10Hope this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP. "]},{"symptom":"problem after installation of 2019-12 cumulative update (KB4530684)        Hello,I have BSOD \"kernel_security_check failure\", \"system_service_exception (vhdmp.sys)\", \"system_service_exception (storvsp.sys)\" after installation of 2019-12 cumulative update (KB4530684).The laptop is Toshiba Tecra (processor i3-330M).The BSOD is displayed immediately after login. So it is not possible to do anything. Anyway I successfully investigate the problem and figure out that HyperV is generating it. I disabled HyperV in BIOS and everything is working smothly. I deinstastalled the HyperV manager from Windows 10 Pro and enabled the HyperV in BIOS, but the problem still exists.I had no problem with HyperV before update to 2019-12 cumulative update (KB4530684).Could you please provide me help how to use HyperV in Windows 2019-12 cumulative update (KB4530684)?ThanksBest Regardstony","solutions":["Hi Tony, Thank you for writing to Microsoft Community Forums. We understand your concern as you are getting Blue screen of Death while login to the PC. We appreciate your effort in researching and providing us the information about the issue. In order to get clarity and to assist you accordingly, please reply with the answers to the questions below.What is the Windows 10 version and Build (1903\/1909) installed? (Typewinver in Windows search\/Run command)What is the make and model of the PC?Did you uninstall this update and checked, whether you are getting the BSOD? Please provide us a recent mini dump file, which will help us for further investigation. We await your response. Aditya RoyMicrosoft Community – Moderator","Hi Aditya,Thank you for your reply.The Windows version of BSOD is 1909 (OS Build 18363.535)The laptop is old (last possible BIOS version installed). The model is - Toshiba Tecra M11-103http:\/\/il.dynabook.com\/en\/discontinued-products\/tecra-m11-103\/After uninstall of 2019-12 cumulative update (KB4530684) to Windows version 1909 (OS Build 18363.476), I have no problems, even HyperV is working well.I can provide you minidump (less than 1MB), but I do not know how to send you the file.Thank you for your supportBest Regardstony"]},{"symptom":"What is going on with my search box?        I have just bought a brand new Surface Laptop 3, foolishly thinking that a move to a true Microsoft product may just result in a more satisfying  Windows experience.Alas, so far my experience is marred by the search function not working properly (not that it has even been perfect).The problem is that I can do only one search at a time and as soon as I have found some files, the search block turns grey, preventing further searching or editing of the search string as I was used to doing. I've first go to close the file browser and reopen explorer to try another search. Even then re-opening is no guarantee that I can use it immediately as often the search block is completely inactive, even if no more greyed out.The only remedy to get it active again is to reboot.... Very, very annoying for someone used to searching files instead of browsing.Please help!!!","solutions":["There seem to be issues with File Explorer Search experienced by some users on version 1909. What version and build of Windows 10 do you have currently.Open Settings > System and scroll down to select About. Post a screenshot of the details for you version and build.","64-bit op system","As I say there are other users having problems with 1909. This is one thread https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/windows-10-1909-cant-type-in-search-bar-in-windows\/5fb7fae4-73d6-4c37-95ee-38bc7a5d408cTry running Troubleshoot Search and Indexing. Try system file scansMethod 1: Run DISM tool and check the issue. Please follow these steps:a. Press Windows + X keys and click command prompt (admin). Or PowerShell (Admin).b. Type the following command in command prompt and press Enter.DISM.exe \/Online \/Cleanup-image \/Scanhealthafter the scan is complete type the following and press EnterDISM.exe \/Online \/Cleanup-image \/Restorehealththen use method 2.Method 2: System file checker is a utility in Windows that allows users to scan for corruptions in Windows system files and restore corrupted files.Run system file checker (SFC) and see if it helps. Please follow these steps:a. Press Windows + X keys and click command prompt (admin). Or PowerShell (Admin).b. Type the following command in command prompt and press Enter.sfc \/scannowAfter completing the scans restart using Start > Power > Restart.Other than that the only other option could be a Reset. All none Windows 10 native programs and apps will be removed but you can keep your personal files.I can't guarantee any of these will fix it and you may have to wait for Microsoft to provide a fix via windows update.","Thanks neilpzzI did DISM and then SFC and I was told that some files had been repaired.Initially it seemed that Explorer search was working fine but soon the search block greyed out again....I don't feel like doing a reset. I don't believe it will help until Microsoft comes to the rescue with a windows update... I just wonder what else will then suffer..."]}]}