{"windows":[{"symptom":"sound loss        Why couldn't I find my solution on Microsoft? I found it on https:\/\/www.****\/knowledge\/how-to-fix-idt-high-definition-audio-codec-driver-problem\/so easy and I struugled for days between Microsoft and HP and couldn't get the simple answer. You should be ashamed.","solutions":["Hi acrc1969, What was the issue you were having? We're here to help. Let me know as we are here to assist.","Morning,Using Sony headphones on my Dell laptop and the headphones quit picking up sound a couple weeks ago. Is there a driver fix?"]},{"symptom":"loss of address book in Outlook        I have Windows 10.  The icon to access 'People' has disappeared in Outlook.  how do I access my address book and when will you stop messing about altering things?","solutions":["Hi ChristineKemzura, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.This error is related to the mobile application. Which version are you using? Outlook App, Outlook.com?Have a nice day Regards, Marc M."]},{"symptom":"minecraft servers        need to change settings to play server on Minecraft,unable to do so","solutions":["Hi Rhodriwilliams1 I'll try to help you on this issue. You will find all the informations you're asking in this page here : https:\/\/minecraft.gamepedia.com\/Server.propertiesI hope this helps Regards Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi Rhodriwilliams1 I'll try to help you on this issue. You will find all the informations you're asking in this page here : https:\/\/minecraft.gamepedia.com\/Server.propertiesI hope this helps Regards Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. THANKS for your recent E-mail,it is much appreciated,apologies for taking so long to replyYour advice is invaluable,I will try your suggestion(link).sincearly Rod(-:.","You're welcome. Feel free to come back if you need further help. Regards"]},{"symptom":"windows 7 upgrade to windows 10 is stuck at \"Getting Updates\" at 46% for last few hours....        Hi,I am upgrading my laptop from Windows 7 home basic version to windows 10.  everything was getting downloaded until it got stuck at \"Getting Updates\" at 46% for last 7 hours now.....Last night same thing happened and I had to close it, which rolled back the installation to previous windows 7 and windows 10 was not installed... Please suggest what is the solution to this problem.","solutions":["I have the same problem and tried several times. As part of my attempts, I tried doing it using the Media creation tool. That yields the same hang-up at 46%. It's not a space issue for me  - there should be loads of room. "]},{"symptom":"sound in window 10 has quit working after the compter was re-set        The sound in my computer has stop working back when I reset it. Everything was working fine before that and I reset it earlier in 2019. this system is built all in one flat touch screen.","solutions":["H Carrie After you reset Windows 10, did you manually install any device drivers? If not, go to the support page for your PC on the manufacturers website, then from there, download and install the Audio device drivers recommended for you PCAlso while you are on that page, open Device Manager (Accessible by right clicking your Start Button), check for any devices with an exclamation marks beside them and download the drivers for those devices if there are exclamation marks . . ."]},{"symptom":"Autofill Tags in Windows Explorer Only come from one source        I am wanting to tag JPEG images that are not in the built-in pictures folder, instead, they are on a secondary hard drive built into my laptop. I really like the autofill feature where as I start typing it gives me tags in a dropdown menu that I have used in the past to choose from. However, the only tags that appear are from my pictures folder, not from anywhere else on my computer. How do I get tags from images not in the pictures folder to appear in the autofill box on other pictures not in the pictures folder? ","solutions":[]},{"symptom":"Synaptics Fingerprint Device Cannot Start        Hi,Posting this for the year 2020It's been a week now that my fingerprint sensor is not working and when I checked it at the device manager, it says \"This device cannot start. (Code 10)\"Here are the workarounds I have already tried upon searching, and these did not work:1. Update to latest driver using automatic updateDriver Date: 3\/28\/2019Driver Version: 5.2.3536.262. Rolled back to older version of DriverDriver Date: 10\/28\/2017Driver Version: 5.2.311.263. Edited group policies and registry4. Updated BIOS thru Lenovo System Update5. Reset fingerprint data in BIOS6. Downloaded driver from lenovo website (Date is I think 2018)7. Uninstall and disable and then installing driversHere are some additional info of my system:Lenovo T470Windows version 1909Any help would be much appreciated","solutions":["Hi Pao. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See fixes for fingerprint reader: https:\/\/www.technorms.com\/43772\/troubleshoot-fi...https:\/\/pureinfotech.com\/fix-windows-hello-fing...https:\/\/www.thewindowsclub.com\/fingerprint-read...See fixes here for Windows Hello: https:\/\/windows10skill.com\/windows-hello-not-wo...1) Turn off Fast Startup: Go to Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change settings that are unavailable > uncheck Fast Startup.2) Reset Facial Recognition and\/or Fingerprint Options https:\/\/blog.goptg.com\/how-to-reset-windows-hel...3) Modify Group Policy Settings (for Pro version only) Updates might have modified some of the crucial settings of Group Policy. Therefore, we would recommend to launch the Group Policy Editor and check\/edit the settings related to Windows Hello functionality.Pres Windows key, type gpedit, and press Enter. Click on Computer Configuration and open Administrative Templates. Select Windows Components and open Biometrics. Click on Facial Features and right-click on Configure enhanced anti-spoofing option.Select Edit and disable the Configure enhanced anti-spoofing feature. Reboot your PC. 4) Update drivers from the PC maker's Support Downloads webpage only. The most basic thing we need to learn to maintain a PC is how to keep the latest manufacturer's drivers current. Windows Update drivers are never enough.If some of the system drivers, most probably webcam and fingerprint reader drivers, were corrupted during the version upgrade process, Windows Hello may fail to perform. To fix that, try to update the corresponding drivers:Right-click on Windows key and select Device Manager. Locate the Hello, webcam, and fingerprint drivers individually and right-click on each of them.Select Remove driver software and wait for the removal to be finished. Repeat the removal with all Windows Hello related drivers and then reboot your PC.Once done, open Device Manager, click Action -> Scan for hardware changes. The system should automatically detect and reinstall the drivers. 5) If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool as shown here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... 6) If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....7) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 8) Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.9) If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... -------------------------------------------- But remember that in Windows 10 everything depends upon the quality of the install, and Factory or Upgrade installs are inferior installs which most enthusiasts won't even run because they'd expect endless issues. Consider now or later doing the Clean Install in this link which compiles the best possible install that will stay that way as long as you stick with the tools and methods given:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... There is also an automated Fresh Start that reinstalls WIndows while shedding corrupting factory bloatware, saves your files, but doesn't clear the drive to get it cleanest:https:\/\/www.howtogeek.com\/265054\/how-to-easily-... I hope this helps. Feel free to ask back any questions and let us know how it goes. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"WINDOW PRODUCT KEY        HOW TO FIND WINDOW PRODUCT KEY FOR ACTIVATION","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.If your PC came with Windows 10 installed you won’t have a product key, it will be digitally activated. If you purchased it elsewhere you would need to check the order receipt from that supplier.Regards, Ross"]},{"symptom":"windows.microsoft.com\/recoverykey        windows.microsoft.com\/recoverykey I got key id just trying to find the place I type it in to get the recovery key","solutions":["Hi Chuck. I'm Greg, an installation specialist and 9 year Windows MVP here to help you.Are you referring to Bitlocker Recovery Key? This is the only Recovery key I know of for Windows 10. It's very important to understand this fully because it can mean you have no access to anything on the drive if you ever have to recover WIndows if you have it enable and don't have the key. Read more about it here: https:\/\/support.microsoft.com\/en-us\/help\/292148...https:\/\/www.groovypost.com\/howto\/use-bitlocker-...To disable Bitlocker: https:\/\/www.tenforums.com\/tutorials\/37060-turn-...I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","A668FB68","安全密钥忘了怎么办","ID 5B2DF730","457ASF44","I need to reset my tablet to factory settings.  Its RT.  Thx!","2097A96A","2097A96A","my Surface one needs to start over . I don't have my password from 2014. What can I do?"]},{"symptom":"WIndows 10 install        I just finished installing windows onto a new SSD.  The goal is to keep this new drive dedicated to running windows and my old drive for all my files.  I installed it onto the new drive, but strangely all of my files disappeared from the original (old) drive.  That old drive was renamed \"OS(E:)\" and my new SSD drive renamed \"New Volume C\"  This is not what I named the drives prior to the Windows install.  It seems the window install created these drive names for me.  Need help getting all the files viewable from my old hard drive which is still connected to my computer. Mike","solutions":["Hi Mike Open Disk Management (accessible by right clicking your Start Button) Please provide a screenshot of that Disk Management window . . ."]},{"symptom":"Transfer of Windows 10 license to a new PC        Dear community,In brief, previously I purchased a retail Windows 8.1 Home (64-bit), which I have, subsequently, upgraded to Windows 10.Recently, the HDD on my PC broke down beyond repair. I am planning to fix the old PC sometime in the future by buying a SSD, but for the time being I bought a new PC, to which I want to transfer my license.I was made aware that I am entitled to transfer my license once and that first I need to deactivate the license on my old PC. However, as the old PC cannot load Windows anymore, I was not able to do it. Further, I was able to reach the command prompt through the repair tool and used the command slmgr.vbs \/upk, however it returns an error Code: 0x80041010, Description: Invalid class.Please advise how to proceed, in order to deactivate the license on my old PC and to transfer it to my new PC (as in the future, I am afraid, when I start the old PC, it will create a conflict with the version installed on the new PC).Thank you in advance.","solutions":["Hi PZHK Windows 10 uses digital licencing, linked to your Microsoft Account, so deactivating Windows 10 on the old PC is unnecessary and would serve no purpose, so when you install Windows 10 on the new PC and activate that, the old PC will self re-activate.. .Since your licence is a retail licence, that may activate automatically, if not, run the Activation troubleshooter a couple of times . . .","Thank you for the reply, DaveM121.I will follow your advice and will write later how it went.Best regards.","Hi PZHK, okay, please let me know how you get on . .."]},{"symptom":"Will I keep my data if I download games on another windows 10 computer with my account?        I'm switching to another computer. A laptop. I have a good quantity of games on the previous laptop and I just wanted to know if I could download them on the new PC and still have my data in it. For example my accounts and especially for games like Hill Climb racing, where no login is required. Will I keep my in-game data? ","solutions":["Hi, This is dependant on each specific game and whether that title supports cloud saves or manually copying your save data. But this will vary by title and the store it's on.In the case of Hill Climb Racing according the the game's subreddit user progress can be synced by logging in with Facebook:https:\/\/www.reddit.com\/r\/HillClimbRacing\/wiki\/h.... I hope that helps."]},{"symptom":"Не открывается папка AppData через команду %appdata%        При вводе команды %appdata% выдаёт ошибку отказано в доступе, а если заходить в папку вручную то папка открывается. Как решить?","solutions":["Добрый день. Покажите пожалуйста проблему картинкой.","Вот скриншот","У вас ошибка в пути переменной среды Должна быть эта папка. .","Проверьте переменные среды. .","А что мне там искать?","Application Data","В реестре то же это поищите.","Нет такой переменной среды в переменных средах","Значит надо искать неправильное значение в реестре системных правил. Вообще, расскажите о проблеме. Когда и после чего она появилась. Использовали ли какие ни будь программы \"оптимизации\" системы?","Вводил одну команду которая должна была решить ошибку \"Microsoft Visual C++\", но потом поломались так же значения других папок. Те папки уже починил, а вот эту нет ещё. Ошибка та \"Microsoft Visual C++\" осталась."]},{"symptom":"Pictures        what does it mean when i am trying to open a file folder of pictures and each one has an image of a blue mountain wirh an x on the bottom left corner of the icon?","solutions":["It just means that your computer is in the process of creating those \"thumbnail\" views of those files and has not yet finished that task.  Be patient, and you will eventually see what you expect."]},{"symptom":"1909 update I cant log in to my pc        Since the 2019 November update my acer has not allowed access to my computer at all and I don't know what to do.","solutions":["Hi, Pc My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to enter the safe mode with the network function to repair, it may be that the network controller is outdated.Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. As soon as you see the Windows logo with the rotating dots, press and hold the power button until the computer turns off. Do this process twice..-Turn on your computer for the third time, and let it load. .-You should receive this message: Preparing Automatic Repair. After entering Mode Update the network driver may be outdated"]},{"symptom":"How do I crate an image of my system?        I have looked on the info about it but my windows 10 dos not seem to have a control panel which would allow me to define an image backup?What's the reason?ThanksSerge","solutions":["Hi sergec10 windows image backup is being deprecated and Microsoft recommend using third party software for backups.the free version of Macrium reflect is popular and reliable. can be downloaded from https:\/\/www.macrium.com\/reflectfree have a look at the user guide for instructions. https:\/\/knowledgebase.macrium.com\/display\/KNOW7...and\/or the quick start guide https:\/\/knowledgebase.macrium.com\/display\/KNOW\/...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Microsoft hasn't said exactly why it no longer supports an image backup utility. I'll take my best guess:Backing up is an entire industry by itself, and there are many software developers that specialize in that technology. Of those, many have created image backup applications for consumers that are much more capable and convenient than what Windows has\/had, and some of those applications are even free.Since Windows is, and has always been, an operating system first and foremost, Microsoft may have simply said: why continue to compete in a technology that's not our focus or specialty?","Thanks.I was already trying to use a third party but I encountered a problem in trying to change the bios boot up.For some reasons when I reach the display where I could choose the repair type , I cannot move down the menu as the arrow keys do not seem to work at all. (Neither does the CR, nor the esc).I first thought it was a keyboard problem but I used another one and get the same result.Any clues on how to get around that problem?ThanksSerge","Is this in the windows recovery environment or in the BIOS? have you tried using a wired keyboard and\/or mouse? if this is in the bios, what is the make and model of the device?","No it's in the recovery window.I have to look if I have a wired keyboard somewhere. For now they are usb.Does that help?BestSerge","Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.Please try the following steps.Open Settings.Click on Update & Security.Click on Backup.Under the \"Looking for an older backup?\" section, click the Go to Backup and Restore (Windows 7) option.On the left pane, click the Create a system image link."]},{"symptom":"Loading up my Windows 10 computer takes forever        When I turn the computer on, I might as well walk away for 5 or more minutes.  I hear the beep, and know it's on, but nothing comes up on the monitor at that time.  I can see a little flickering now and again on the screen, but it is mainly just black, until it is ready to show the first screen for me to click on and log into at. I thought it might be because I am using an older version of Windows 10 so updated it to 1909 version, as offered to me in Settings.  I didn't do a repair because i thought that should solve any problems there. And I tightened the connections on the monitor. What could be causing this and how can I fix it?","solutions":["Hi suemcp001 5 minutes startup is excessive fro Windows 10, which prides itself on its fast startup . . .I need to check the specs of your PC, what is the Make and exact Model No. of your PC - that will be printed on a sticker on the bottom casingHave you checked the support page for your PC on the manufacturers website to see if there is a BIOS update available that needs to be installed?In the meantime: Turn off all unnecessary startup applications and processes: Press Ctrl + Shift + Esc to open Task Manager Click on the Startup Tab See any non-essential items are listed there If so, select and click 'Disable' Close Task Manager Click your Start Button, type msconfig and hit Enter When the System Configuration dialog opens, click on the Services Tab Check the box marked 'Hide Microsoft Services' In the remaining list, see any non-essential items are listed there, uncheck any you findClick Apply and OK Turn off all unnecessary Background Apps Open the Settings App Go to Privacy - Background Apps Turn off any App you do not need running in the background Restart your PC","DaveAcer AXC-704-ES62I doubt that this has anything to do with an update. I have just updated Windows 10. If Windows cannot infomr me, personally, that I required a BIS update then they would clearly be out of line\/.I recently had a different modum installed and so on and the tech went through and got rid of uneccesssary junk so I don't imagine I have to do that again.Is there something else that could be the problem?","Nothing else is wrong with the computer - nothing is working extra slowly, only the monitor is very,m very slow at loading up the Windows 10 page. Once it gets on there everything is fine - no more flickers, no more tkaing time to transtiion. ","Hello suemcp001, I am Andrew an independent advisor. Am I correct in understanding that from the time you press the power button to the time your Windows login screen appears you see nothing at all on your monitor? This then is not necessarily a Windows issue, it's probably an issue with your BIOS and default graphics output driver. Do you have a 2nd monitor to try? How about a different output on your PC? Say if you're using an extra GPU can you plug it in directly to the video attached to the motherboard and see if that gets the picture on your screen. Try a different output first, if that shows your picture then enter the BIOS and reset the default settings.If you cannot do this let Windows load, go to Acers web site and get their most recent GPU driver for your computer.Do these and let me know what's happened. Take Care, Andrew","Hello suemcp001, I am Andrew an independent advisor. Am I correct in understanding that from the time you press the power button to the time your Windows login screen appears you see nothing at all on your monitor? This then is not necessarily a Windows issue, it's probably an issue with your BIOS and default graphics output driver.No, the screen flickers - from Black to a brief flicker and back to black.  I see now that it flicks in sequence with the flashing light on the lower right side of the monitor.  The monitor is one again now so that light is not flashing it is solid.  I tried disconnecting the plug that goes into the back of the monitor - a usb type, and as I recall, when I plugged it back in the computer came on-screen right away. I can't be certain, and am not going to exitthe computer now it's on and usable.  The other end of the cord goes into the back of the computer. Could it be something that simple?  I have had this computer for only a few years. 3 or 4. Do you have a 2nd monitor to try? How about a different output on your PC? Say if you're using an extra GPU can you plug it in directly to the video attached to the motherboard and see if that gets the picture on your screen.No I don't have another monitor. I have another tv screen i'm not using.  But I don't know about hooking it up. and it's not a good time. All these things - like changes made when I upgraded to a different modem wonder if that could have caused a problem?   I don't have smart tv and don't have Edge or Drive or anything if I can avoid it.  I have had problems with that too, recently, as Windows 10 like s to control EVERYTHING so maybe it is taking revenge. Try a different output first, if that shows your picture then enter the BIOS and reset the default settings.I don't understand that logic. If the computer works with one thing (monitir) it should work with another. Why would I need to alter a BIOS setting. I could probably check it but it seems to me its way down on the list - nothing to do with Jan 1 just happening.  I had this probably in December.   You make it sound as though \"entgring BIOS\" is easy. \"r most recent GPU driver for your computer. I don't know what a GPU druver us\/Do these and let me know what's happened. Take Care, Andrew"]},{"symptom":"Creating Windows 10 Local Account - Problem = 'Something Went Wrong'        I'm trying to create a local account which I've done successfully before but everytime I try to do it now I hit the same problem.  At the point where I select 'I don't have this person's sign in information', an error message appears & it suggests I cancel\/retry - neither allow me to proceed.  The error message reads (vaguely) 'Something Went Wrong'.Just before this started I created a new local account but accidentally made it an administrator account (only one).  Now I can't adjust the latter (I wouldn't have any adminsitrator account id I made it non-adminstrator).  I can't make a new adminstrator account because of the above error.All Help would be appreciated as I'm really stuck & feel the system is very exposed as a result.  Thanks.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.Please log in to the new Administrator Account and try to adjust the Account privilege of other accounts."]},{"symptom":"windows 10 upgrade        I recently bought windows 10 from a retail store. when I install the drive it goes through the motions of looking for updates and then installing the program, but at the end it reverts back to windows 7 with an error of OX8\/007001F-Ox20006. it also says Safe OS phase with error during Replicate_OC operation","solutions":["Hi, CHARLES My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.If you have problems updating Windows, follow these steps: If you have a third-party antivirus, you must disable or uninstall it. Try reset Windows update components: Right click on the start button and select Powershell (admin) or Command Prompt (admin)Write the next hit enter after each line. net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Restart and try again. You can also download the Windows Error Solver: https:\/\/support.microsoft.com\/en-us\/help\/10164\/...https:\/\/aka.ms\/wudiag You can do it manually by downloading the Windows ISO. When updating with the ISO, disconnect the Internet. https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"Como puedo mejorar la calidad de imagen de una segunda pantalla Philips modelo 32pfl3000\/f8 por HDMI de una laptop hp cpn AMD Radeon R5?        Compre una tv con HDMI, la conecto a mi lap top y la imagen no se ve bien, al parecer es la resolucion pero ninguna de las opciones en mi pc da buenos resultados, alguien sabe como podria resolverlo?","solutions":["Hola jxtech, mi nombre es Angelica, soy una asesora independiente y tratare de ayudarte el día de hoy.Lamento que tengas este inconveniente con tu pantalla, pero juntos lograremos resolverlo.Has probado cambiar la resolucion en tu pantalla y no desde la pc? Estas pantallas tienen la opcion de calibrar o ajustar la resolucion de acuerdo a tus preferencias.Esta informacion la puedes obtener del manual de usuario o visitando la web del fabricantehttps:\/\/www.philips.es\/c-m\/atencion-al-consumidorNota: Este link no es un Website de Microsoft. Parece contener información correcta y segura. Por favor tener cuidado con publicidades en el sitio que puedan estar promocionando productos clasificados como PUP por su significado en inglés (Potentially Unwanted Products). Por favor no descargar nada desde dicho sitio. Espero que esta información te sea de utilidad. Quedo atenta a tu respuesta Saludos, espero que tengas un excelente día. Angelica."]}]}