{"windows":[{"symptom":"log-on        My computer repeatedly tells me I have entered the wrong password before I touch a key or mouse or anything after a reboot or anything","solutions":["Hi milopierce, If you recently upgraded to Windows 10 newer version, you might be facing a very annoying problem. If you restart your machine, after boot screen an error message is shown \"The user name or password is incorrect. Try again.\". The strange thing is that the error message is shown before Login Screen (also known as Sign-in Screen or Welcome Screen). So even if you didn't enter any username or password, you get this error message first. Once you click on OK button, you get the Login Screen to enter correct user name and password and then Windows allows you to sign-in successfully. Please check this article for full guide on how to fix it: https:\/\/www.askvg.com\/windows-10-fix-the-user-n...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"All my files are locked and they won't open in excel nor word. it says its the wrong file type. But they are correct file type.        When I try to open my excel or word files it say it's an invalid extension. but these are excel and word files, all the files appear to be kidnapped by OneDrive and it won't release them to me. ","solutions":["Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.Right click on your excel or word file, go \" properties \" and look on \"open with\" what software it uses and if it's not MS word or excel, go to the list and change it for that.Give me news","It says open with Excel. I think I might have turned off a service or something with one drive. All the files have a different looking icon in front of them. tiny.","Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.Right click on your excel or word file, go \" properties \" and look on \"open with\" what software it uses and if it's not MS word or excel, go to the list and change it for that.Give me news Is it because my license with office 360 is out of date or something? I also get this bit defender thing sometimes when I turn it on, and I have to boot with regular windows.","Have you looked in the Office forum?","I will look there, but it seems like a security lock problem on all my files, nothing to do with office.","No, even if your office is not activated, the file would not display this error.You said \" All the files have a different looking icon in front of them. tiny. \" Can you send me a screenshot of this please ? It will help me understand;)"]},{"symptom":"Frequent Restart and BSOD Issue        Hello,  It is kind of weird but my system keep restarting at random interval , before I manually restart, it show BSOD Error having some error text:Your PC ran into as problem and needs to restart. We’re just collecting some error info, and then we’ll restart for you . $$% completeFor more information about this issue and possible fixes, visit https:\/\/www.windows.com\/stopcodeIf you call a support person, give them this info:Stop code: PAGE_FAULT_IN_NONPAGED_AREAWhat failed: WinCSdrv.sysSumit - IndiaIn this system, Windows Operating System is installed  on SSD Drive ( system Drive).===========================================So far i have tried  Following Things:1) cleaning RAM slot on Motherboard, Swapped the RAM module to Isolate Hardware related issue - Didn't worked for me.2) While Performing System Reset, Same Error (BSPD)come up so it doesn't allow me to wipe SSD drive.3) Performed Start-up Repair and it throws an following error:      SMART Hard Disk Error   The SMART Hard Disk check has detected an Imminent failure. To ensure no data loss, please backup the content immediately and run the hard disk test inh system diagnostics.    NVMe SSD (313)    NVMe SSD (313)     F2 system Diagnostics, Enter - Continue Startup Now, Pressing F2 for System Diagnostics - doesn't produce any error. And PressingEnter - bring up the OS and turns in BSOD at random interval.4)  Further more, While Booting Windows 10 Image from External source (USB Drive) for OS installation, System doesn't display SSD storage drive.Looking for any help.Thanks","solutions":["Hi Sumit,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.First, your hard drive is on a verge of a failure. It is likely that due to hard drive you are hitting crashes. Let us check crash dump first.We need log files(called dump files) that tell us what lead to crash.Please share them with us for a better analysis of the problem. Instructions can be found here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Please let us know if you need any assistance about posting dump files.","all right, I will share it, can you tell me how can i find log file location. Thank you.","Hi SumitPlease see my article above. You need to use a File sharing service like Onedrive to share files.","Kindly find below given url to access dump file.https:\/\/1drv.ms\/u\/s!Ag0xjGE2IXyqjEY_MR_blrF8enac?e=NpNQDe","Hi Sumit, Related to WinCSdrv.sys which is associated with Newsoftwares.net, Inc SDN BHD Do you have folder lock installed or any software from Newssoftwares.net? If so, I would uninstall it and check if it resolves the same.","Hi, I have Cloud Secure software installed which i uninstalled but it didn't worked out for me though.","Hi Sumit, Please share the new crash dump after you uninstalled the same."]},{"symptom":"Administrator Password required to uninstall        This is a friends WIN10 PC upgraded from WIN 7.  When ever he tries to uninstall a program from the Apps tab under Settings he get a requirement to enter a password.  The user name is already in place as 'admin'.How can I find this password since it is not the login password.  I have tried using Blank but that did not work.This also happens when I try and open a command prompt and run as administrator.  It again asks for a password.Searching the web does not show solutions for the latest version of WIN10.  The User Account functions have changed since many of the solutions have been posted.  I see there is a way to decrease the User Account Settings under the Control Panel but I am not sure if this is the method that should be used.Regards,Dan Kahn ","solutions":["Hi Dan, If your friend is logged in as an Admin and associated with Microsoft account. He needs to use the Microsoft account credentials instead in order to allow that function.Please let me know if this clarified your concern. Thanks and regards,","I received some more information after doing some troubleshooting.  The owner is not the administrator, his son-in-law is.  At this time his son-in-law does not remember the administrator login password.  Without this password I am thinking he can not continue to uninstall or do anything associated with the administrator functions.  This is a Local Account only, he does not have a Microsoft Account.  If he were to create a MS account, could he become the Administrator on this account and solve all the problems?  Creating an MS account should not be that difficult unless it needs Administrator privilege's.\\ and we are back to the original problem.My suggestion is, if he can not recover the password, I would re-install WIN 10 with him as the Administrator and solve all the problems he is up against.  I have a 1903 version iso on a USB stick that I can load from.  After the reload I would go through the normal updates to get to 1909.I think this may be the only solution without a brain recall.  I am thinking I would reload with the option that Windows is already installed.  Does that entry point allow the user to be defined as Administrator or do I need to do a clean install from boot?  The owner question the reload and wanted to know if all the icons and programs would be retained.  I am pretty sure if you do a reload with an existing OS, the apps and desktop are retained.  Am I correct?Thanks for the reply.Regards,Dan Kahn","Hi Daniel, Most likely you are pertaining to \"Refresh\" the Operating System. Which can actually retain the apps and personal data. You can give it a shot as well. Please give us a feedback on what will happen if ever you will do this. Thanks and regards,"]},{"symptom":"audio and video out of sync and stutters        audio and video out of sync and stutters, most noticeable on youtube","solutions":["Hello RWelton! My name is Marco, I am an Independent Advisor. I will do my best to help you.Does it only do that on the internet? or your local video from your pc? I would go to the side of audio and video drivers but it would surprise me that it happens for both at the same time. But you can still try to update.For updates, right click on the start button of windows and go to \"device manager\" ... search for your audio and video driver and right click on the driver and do \"update\".Try to pass an antispyware scan in your computer with these 2 free and powerful software.AdwCleaner : https:\/\/www.malwarebytes.com\/adwcleaner\/Malwarebytes : https:\/\/malwarebytes.com\/Give me news. _________________________________________________ Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","thanks for the reply..i already did as you suggested,but i fixed the problem by turning off the hardware acceleration in the youtube settings","Ah ok nice, I will put the statutes settled like that, others will be able to see your solution. Thank you ;)"]},{"symptom":"Rep FROM 2012r2        I try to rdp over a VPN from a server 2012r2 and get an error (computer limited by admin). The same connection works fine from a Windows 7 box. Thx","solutions":["Hi, Server and IT Pro questions are best handled on our sister Site Technet as this is only a Windows consumer only forum:https:\/\/social.technet.microsoft.com\/ForumsPlease choose the most appropriate category on Technet forums from the left."]},{"symptom":"How to Create the bootable “Recovery” media.        How to Create the bootable “Recovery” media. ","solutions":["Hi Norton, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Instead of Recovery media, create an Installation media that serves as a purpose of Recovery drive too.https:\/\/www.tenforums.com\/tutorials\/2376-create...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads."]},{"symptom":"Proactively remove a folder and all files under from quick access        Hello -I want to proactively not have quick access show files\/folders from a specific folder.  As it stands now, I have to flag each file after the fact.  Can I do this in one proactive step?","solutions":["Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.Here's a way on how you can disable files\/folders from being shown under Quick Access.https:\/\/windowsreport.com\/remove-file-folder-qu...(Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.)I hope this helps with your concern! Please let me know if you have further questions.","These seem to be solutions that:1- turns quick access off entirely; or2- turns it off after the fact what i want is for quick access to not use files from one specific folder and its sub items. ","Hi, For now, the only way to exclude a specific folder is by right clicking it and choose Remove from Quick Access when that folder was shown under Quick Access. When choosing Remove from Quick Access, it will not be shown the next time you go into that folder unless you Clear it from File Explorer Options. See detailed info here: https:\/\/helpdeskgeek.com\/windows-10\/exclude-fil...(Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.)"]},{"symptom":"Screen flickering        I tried a few things but the result is the same help :(","solutions":["Hi ,DH1978 my name is Dennis, I'm an independent advisor and I'll do my best to help today. Here I leave 2 guides to fix that problem https:\/\/support.microsoft.com\/en-us\/help\/402616...https:\/\/windowsreport.com\/fix-laptop-screen-fli...hope this help you Regards, Dennis. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Relation between the Three CPU\/RAM\/Disk Space        Query Are: 1. What is the significance\/working between CPU usage\/RAM\/Disk (Memory management) in Win-10 (64 bit)why Disk Usage (C,D,E) shows full and practically its almost  free in GB  Eg: 300-400 GB2. Please explain the significance of disk usage with CPU.3. Please explain RAM usage or behaviour of RAM if CPU usage is Full.Like if CPU memory is full then it tries to load on RAM or disk ... How win-10 manage it.. ","solutions":["Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your questions.I'm assuming you are referring to the metrics being display under Performance Tab of Task Manager.1. These usages and graphs are pertaining to current utilization level of those resources.CPU: Based on % utilization, it means how much processing power of CPU is being consumed by one or more active processes to run instructions.RAM: The same applies here (utlization level) and it means the more processes are running on the system, more memory is consumed. When there is insufficient hardware memory, Windows will temporarily page data to Paging pool (Paging file is stored on disk) from memory. Disk: This section refers to the Active Time of the disk, not free disk space. So when this is high or full, it means the disk is actively reading from and\/or writing to.In terms of relationship, when a process is launch or working, it may Read\/Write to the disk, temporary store working data on the RAM and instructions runs on CPU (for example to process data).I would suggest reading these post for further details\/information: https:\/\/techcommunity.microsoft.com\/t5\/ask-the-...https:\/\/support.microsoft.com\/help\/2160852\/2. Basically CPU would be used to run instructions (like process data) and such data is primarily stored on your hard disks. Depending on how the program is written, it might directly process the data in CPU from Disk hence you will see utilization levels of both CPU and Disk to be high. If the program will read the data from Disk to Memory before processing in CPU, then you will see CPU\/RAM\/Disk to have higher utilization levels.3. RAM usage is dependent on the process(es) and what kind of instructions are being executed. For example, a game requires 1 GB of memory to run, then it would take up at least 1 GB of memory, as more memory will be required to act as temporary storage. Since CPU is used to run instructions so a game will require the CPU to process these data in RAM\/Disk. Together, you can expect all of usage to be increased. If CPU is full, then you can be sure that RAM usage and Disk utilization are probably higher. However, the ratio of increase won't always be the same. I would also suggest reading this article to know more about the relationship between memory and CPU:https:\/\/www.intel.com\/content\/www\/us\/en\/busines... I hope these answers you questions. Please let me know if I can help you further!Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Dell OPTIPLEX GX620  UPGRADED WINDOWS 10        Hello friend,I upgraded the processor to D3.40 Ghz 4mb from 2.8 GHz , Increased Ram from 2GB to 4 GB.Installed Legal Windows 10 64 bits. All working fine except the multi media audio drivers. No help from Dell, they said buy new PC.Any one, who can help me in this regard. I will really appreciate it. I'm not a computer wizard... but understand some...should I buy a new card and install... that might fix the problem. what to buy...? help needed.Thanks and regardsGurdeep Singh","solutions":["Hi Gurdeep. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.If you have the same Sound controller will the driver downloaded from Dell work, using your Service Tag number here:http:\/\/www.dell.com\/support\/home\/us\/en\/19\/Produ... ? If not try the controller manufacturer's Downloads page for the make\/model controller to make sure you've tried them all.You can trace the hardware to be sure you have it correct: http:\/\/www.sevenforums.com\/tutorials\/73420-hard...As a last resort I sometimes install Driver Max for it's two free drivers a day, then uninstall it afterwards. It's the best at doing no harm.Then you'll have tried everything and can decide to replace the sound controller.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thank you Mr. Greg Carmack,No drivers available at the Dell support site with my service Tag. Only Bios update available. Which I had.Just please advise me of the new sound card that will do \"plug and play\" than I don't have to do any thing.Thanks and regardsMay God bless us all.Gudeep Singh","May I ask why there is no driver for your Sound controller on the Dell site? This is the most basic driver they should have drivers for. If you only changed the CPU and RAM I'm not sure why the sound card didn't load up as before unless the CPU affects it. I don't know your motherboard's capability and power supply so can't begin to advise you on a Sound card. What I would do is take it to a shop like MicroCenter we have here that has a part desk, and ask them to advise you. They will look at the slots you have available and the PSU capabilities to suggest a card. This is strictly hardware and not something Windows or Microsoft will advise upon at all.There's a good guide here for buying a sound card for your self-build: https:\/\/www.techspot.com\/article\/751-should-you...","Dell site used to have All drivers were available in past, but no more. Only Bios update is available at this time.This is the answer I got when I asked Dell to help me. I'm sorry to bother you.Technical Support Follow-upService Tag 886K6B1Service Request Number 1009421218Please note that the system age is more than 13 years and has reached end of life. Also be informed that Microsoft technical assistance for Windows XP\/Vista\/7 is no longer available including automatic updates that help protect the PC. To align with this change, Dell has also ended support for Windows XP\/Vista\/7. Dell will no longer provide email, chat or phone support for this legacy operating system. Thank you for choosing Dell.There is no Micro Center near me. There is Best Buy though..!Microsoft sound drivers are missing in device manager.","Geek Squad might help. What I do is call them and ask if you can bring it by for someone to look it over with you and suggest a sound card to install. If they are interested they will probably help. It's not quite as much of an enthusiast shop as Micro Center, maybe you have another shop there that is. If not you can ask at Tom's Hardware forums which is good for hardware questions.That is very old. I'm taking it you are doing this as a project since you can get fast new PC's for $400."]},{"symptom":"Red lines and dots appearing on screen - Surface Laptop 3 13\"        So, recently I started seeing these red dots and lines on the lock screen of my black 13\" i5-256GB-8GB Laptop 3. They've started to appear on my desktop and in apps, as well.However, when screenshotted, they disappear, so I had to take photos of it on my phone.Excuse the awful moirè effect.Is it possibly due to the fact that I downloaded the Intel Graphics Command Centre so I could disable power saving mode to fix the 'low brightness shutoff' issue, mentioned in another thread?I'd love to hear your thoughts.","solutions":["Hi selfcasualty, There's a chance that you are using a wrong color depth. Can you try adjusting the Color Depth in Windows 10 Close all open programs. You can either right click Start, and then click Control Panel or click on start and type Control Panel and click the icon that appears.In the Control Panel window, click System, and then click Display. Select the monitor you want to change, if more than one is connected to your PC. Click the Display Adapter Properties link. Select List All Modes. Choose your resolution, color depth and refresh rate from the list and click on OKClick OK again to exit the properties window. Please let me know if this will help you. Thanks and regards,","Hi Richard,Thanks for your help. However, something which I failed to mention was that I had the program f.lux installed on my computer. Apparently, there is a bug in this software which is known to cause screen artifacts on newer Microsoft Surface devices. I've uninstalled the program, which fixed my issue.If they come back, I'll try the colour depth settings.Thanks!","Hi selfcasualty, That's cool. We're glad that you're able to find the culprit. Please let us know if you need further assistance in the future. Thank you and have a good day!"]},{"symptom":"Public WiFi login page not showing in Windows 10        I am using a new Asus laptop that came installed with Windows 10, and currently I can find no redeeming features for this operating system whatsoever. The OS takes up over 15GB of a 30GB HDD, I have barely used the thing and its running out of space. It is choc full of \"apps\" that are of zero use and interest to me. But this latest problem is so frustrating that I would sell my organs to return to Windows 7 or XP or 98 or 95...Basically I cannot use public WiFi anywhere because the login\/confirmation screens won't load in any browser, the system just hijacks the browser with some security nonsense. I've turned off the firewall, made sure to allow everything I need to within the browser settings, and still nothing works. This sort of problem, if it happens on any other platform, is usually a simple fix. But nothing I do seems to make any difference in Windows 10. I don't have any third party security software installed, so there really is no obvious cause of this problem. But its a serious problem because my Windows 10 computer is frankly useless to me until this is sorted out.Also, the computer keeps asking me to check my security settings ahead of some \"creators update\". Dear Microsoft, I want my computer working the way I need to use it, and unless that is what your update plans to allow me to do I am going to start learning everything I can about Linux.*Modified title for accuracy**Original title: Public WiFi login screens won't load on Windows 10 laptop.*","solutions":["I am at a hotel, I had the same issue and after trying and trying the thing that fixed it was plain and simple: I would suggest you to update the latest driver for network adapter under Device Manager.1. Press Windows Key + R Key.2. Then type “devmgmt.msc” without the quotes and hit on Enter Key.3. Expand Network Adapter.4. Right click on the wireless driver and click on Uninstall. 5. Then restart your computer and it will reinstall the wireless network driver.","Hi,I had the same problem.I solved it using http:\/\/fixwifi.it\/ It's a page that triggers the login page and forces it to appear. Hope it works for you!M."]},{"symptom":"windows\\system32\\advpack.dll        I think Windows defender has blocked some needed apps on my Dell laptop during a BIOS update and I can't install programs\/apps I trust even though I say run anyway.  I get \"error creating process<C;Users\\….>Reason C:\\Windows\\system32\\advpack.dll","solutions":["Hi Mary. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.First let's try to repair the file at issue and if that fails let's try replacing it.To repair run System File Checker from Step 10 in this checklist: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...If it finds and cannot fix files, continue with the same step to use DISM to check the integrity of the image by which it compares and replaces the files.If these fail then you can try to replace the file using the one provided at this reliable site:https:\/\/linustechtips.com\/main\/topic\/1030398-di.... You will need to take Ownership of the broken file first to delete and replace it. Use this shortcut to take ownership:https:\/\/www.askvg.com\/add-take-ownership-option... If those all fail then run a Repair Install by installing the Media Creation Tool from this linkhttp:\/\/windows.microsoft.com\/en-us\/windows-10\/m... choosing Download Tool Now, install the tool, open it and choose Upgrade this PC Now. This reinstalls WIndows while saving your files and apps in place; takes about an hour, resolves most problems. It also brings it to the latest version by the most stable method. I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Laptop stuck in tablet mode        I purchased a Lenovo Yoga 720-13KB in 2017, with Windows 10It just started automatically going into tablet mode and not allowing me to change it back to desktop\/keyboard mode, even though I have the setup parameter set to always open in desktop mode. I have also changed the registry keys, to open in desktop mode and have set the tablet mode key to ‘0’. All to no avail. (When I re-open the registry key it has set itself back to ‘1’.Finally, I found that by elevating the rear of the keyboard so it sits at a 45-degree angle, the computer will go back into desktop mode. Occasionally a slide-in box will ask if I want to switch to tablet-mode. But I ignore it, and after a second, the message slides out of sighI would like to fix the source of this problem as I use the machine 3 -5 hours daily, and the “work-around” is inconvenient and hard on my wrists.Does the source of the problem sound like: Hardware? Software? A Virus?Is it something I can address, or will it require professional repair?Any advice is much appreciated. Thank you.","solutions":["At the right end of the taskbar is an icon to the right of the time.  This gets you the Notification pop out and at the bottom is the Action Center with a bunch of tiles."]},{"symptom":"BenQ GW2283 21.5\" Monitor Black Out when Playing Games        Hi All,My BenQ GW2283 21.5\" NEW MonitorBlack Out when Playing Games. This happen only when playing games. Using Youtube, Watching movies. Office applications no issues at all. It is a new PC(AMD Ryzen 5, 8GB RAM,250GB SSD). Only Graphics Card is used(ASUS GTX750).So far I have tested with Dota and CS Go using STEAM. If i choose minimal graphics option it will black out intermittently after few minutes and continuously after 5-10 minutes. If I choose high graphics settings, it will black out continuously until I use Ctrl+Alt+Del to open Task Manager to End Task the game.What I have done to fix the issue?I have tried update,clean install graphics card drivers, monitor drivers etc based on articles at Google. When i brought my PC to my friend house and used his BenQ 24inch monitor the both games runs well in high graphics settings without any issue. What I have concluded?So, I guess the issue with monitor settings or something I oversee. I tried changed the resolution, used recommended settings, nothing works. Only thing I have changed in the monitor settings wasTURN OFF THE PURPLE LOGO when ON the monitor.Will be there any issue with my HDMI or Monitor power cables? Please assist.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.Please check the refresh rate of the monitor. If it is 144hz, reduce it to 60hz.Try another HDMI cable.If there is a VGA port available, try to connect the Monitor using VGA cable.Update BIOS."]},{"symptom":"Wireless keyboard connection to laptop        I don't have the CD to connect the keyboard to the laptop that I need it for and I am also not able to download anything onto this laptop as it is a work computer.What can I do? I need it tomorrow to be able to do my job from home.mmonahan2016","solutions":["Hi MM. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.You should not need to load a special driver for a wireless keyboard, as it should have those drivers in Windows 10 already, or quickly delivered by Windows Update.What is the keyboard make and model? What happens when you plug in the wireless adapter via USB port? If it doesn't respond then try another USB port.Then go to Settings > Devices > Bluetooth and other devices to see if it registers there and if there's any additional installation required. Also in Device Manager under Keyboards or Other Devices is there a device in error with a ? mark? If so right click to Update Driver > Automatically. If that fails try Update Driver > Browse > Let Me Pick to try all previous drivers.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","It is an HP and the model number is KG-1061","I was actually able to figure it out with the information that you have given me already.Thank you Greg!","Glad to hear it. Can you say for sure what fixed it, to help others? Let me know if there's anything else. Also when ready please mark the post which helped most as the Answer, to help others. A rating is also appreciated."]},{"symptom":"Opening PDF files with adobe not in html        Somehow on my ASUS all pdf files are stored only in html; I want then in a keyword searchable format.How to reset this on my ASUS?* Moved from Community Participation Center","solutions":["Hi- Not sure, if you are asking how to change the default app for .pdfs. I have included a link on how to change it within Settings > Apps. https:\/\/pattersonsupport.custhelp.com\/app\/answers\/detail\/a_id\/22765\/~\/make-adobe-acrobat-reader-the-default-pdf-viewer"]},{"symptom":"M2 druive not recognized        installed another m2 drive same as the original ,windows  dose not recognize the new drive. it is in the device manager but say it is not initiated.have spent  a few hours reading useless crapp what happened to the good old hardware trouble shooter.Why doe Microsoft need to make problems harder to solve by sending you around in circleskeep it simple .is there a human out there that can fi my simple problemIan B","solutions":["Hi Ian,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.What happens when you try to initialize the disk? Do you get an error message? https:\/\/docs.microsoft.com\/en-us\/windows-server...","Have you tried to clone the old drive to the new one?External USB container for M2 drive is under $20 at Amazon.","hi there is no old drive is new system first drive when syst built  same brand and size added today"]},{"symptom":"Start, taskbar and action centre greyed out in Windows 10 Colours Settings        Start, taskbar and action centre greyed out in Windows 10 Colours Settings","solutions":["Hi, GarinasRogers My name is Maritza and I am an Independent Advisor. I would be happy to help you today.Perform the procedure to repair the system files: Follow these instructions: press the Windows + X keys and select Command Prompt (Administrator) or Windows PowerShell (Administrator), in the window that will open, you must type the commands in their respective order:• DISM.exe \/Online \/Cleanup-image \/Scanhealth • DISM.exe \/Online \/Cleanup-image \/Restorehealth • DISM.exe \/online \/cleanup-image \/startcomponentcleanup • sfc \/scannow Each of these actions can take a few minutes, so it is important to execute one at a time. When finished, you must restart the PC.Let us know if these steps help you to resolve the issue.","Hi GarinasRogers I am Vijay, an Independent Advisor. I am here to work with you on this problem. Please try these options one by one and check after each option. 1. Run Built-in & Guided Walk through Windows Update troubleshooter Built-in : Windows Key+X > Click Settings > Click Update & security > Click Troubleshoot > Click Windows Update > Click Run the TroubleshooterGuided Walk though - https:\/\/support.microsoft.com\/en-us\/help\/10164\/... 2. I would recommend that you perform a Windows 10 repair upgrade. Repair upgrade fixes all Windows errors and retains all files, applications and settings. (You will not lose any data while backup is a good idea) Below is a good guide to perform repair upgradehttps:\/\/www.tenforums.com\/tutorials\/16397-repai...Do let me know if you require any further help on this. Will be glad to help you.Disclaimer - This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hello, I'm Independent Advisor and Microsoft MVP, here to help you with your question. Suggest you to run System File Checker scan: 1. Search for 'command prompt' using Cortana or Windows Search. 2. From results, right click on Command Prompt and select Run as administrator. 3. Type sfc \/scannow command and press Enter key. 4. Let the command complete and then reboot the machine. If issue still persists, perform clean boot: https:\/\/support.microsoft.com\/en-in\/help\/929135...Let us know if this helps!","Thanks but no change.Sounds like a Registry Key is incorrectly set?GR","Try going back to a previous Windows point to repair. Follow the steps below to restore your computer to a previous date using a restore point:1- Type recovery in the search box of the taskbar and choose Recovery (Control Panel).2.- Click on Open System Restore. 3.- Click on Next. 4.- Select your restore point, and click Next. 5.- Click on Finish. The computer will reboot and present a message on the desktop confirming that the restoration was successful.","Thanks for that.I used Recovery in Settings which followed a similar route.So 1903 did not work and back to 1809 until the new full version of 1903 comes out in April.GR","Glad to Help!","None of the Above Answers seems to be relevant , there is a very simle solution , here is how to https:\/\/www.ceofix.net\/750\/start-taskbar-and-action-center-greyed-out\/I Tested itself and worked.","This is due to a personalization of the default Windows Theme - if you change back to Windows Theme you'll notice that it cunningly lets you use this option - I'm guessing the next update will have a fix for this because enough people will dislike it (like all of us on this page I'm guessing) but up until then if you choose to personalise your theme (like literally everyone I know) then you won't be able to use this feature.","Hi, GarinasRogers My name is Maritza and I am an Independent Advisor. I would be happy to help you today.Perform the procedure to repair the system files: Follow these instructions: press the Windows + X keys and select Command Prompt (Administrator) or Windows PowerShell (Administrator), in the window that will open, you must type the commands in their respective order:• DISM.exe \/Online \/Cleanup-image \/Scanhealth • DISM.exe \/Online \/Cleanup-image \/Restorehealth • DISM.exe \/online \/cleanup-image \/startcomponentcleanup • sfc \/scannow Each of these actions can take a few minutes, so it is important to execute one at a time. When finished, you must restart the PC.Let us know if these steps help you to resolve the issue. https:\/\/www.youtube.com\/watch?v=KzwoLocequM < watch this video, i followed the steps and it worked."]}]}