{"windows":[{"symptom":"Upgrading from W7 to W10        I am planning to move up to W10. On my PC I have circa 25 applications that I use regularly - things such as Corel Video Studio a video editor, and many others.I really do not want to face having to re-install all of the existing solutions.Am I able to install W10 as a true UPGRADE where all my software applications should run as before when the upgrade completes.I understand the need to backup all my personal files just in case something goes wrong during thw W10 upgrade - but I am hoping that all current solutions will continue to work.Any guidance\/advice very welcome.RegardsJohn","solutions":["Most updates to Win10 work flawlessly but some fail. I am currently dealing with one that is quite recalcitrant. Fortunately the roll-back to Win7 works as it should. My fail-safe upgrade method works like this:Create an image of the current installation, using the free version of Macrium Reflect. Park the image on an external 500 GByte USB disk.Perform the upgrade.If the upgrade fails and does not roll back by itself, restore the image.If a clean Win10 installation is required, restore your data from the image.","Most updates to Win10 work flawlessly but some fail. I am currently dealing with one that is quite recalcitrant. Fortunately the roll-back to Win7 works as it should. My fail-safe upgrade method works like this:Create an image of the current installation, using the free version of Macrium Reflect. Park the image on an external 500 GByte USB disk.Perform the upgrade.If the upgrade fails and does not roll back by itself, restore the image.If a clean Win10 installation is required, restore your data from the image.Frederik thank you. Can I clarify your advice.You discuss \"Most updates ...\" above - I am specifically discussing going from W7 to W10 which I regard as an UPGRADE and not an update.At 3 in your response you suggest the recovery action if the upgrade fails. My question here is that if the upgrade doesn't fail, it does succeed, will my installed applications and software continue to work ?Finally can you clarify what you mean at 4 above \"If a clean Win10 installation is required ...\"  .  I would expect an upgrade to either work and complete in full OR it would fail in possibly one of several ways. In which case I understand I would need to restore from backup and start again - in restoring my system it would operate as Win7 and all would be OK except NOT upgraded to Win10. Is this correct ? I am concerned about \"restore your data\" which reflects a partial restore from backup - but what about System Registry info and files - won't there be all sorts of potential clashes that accompany a partial restore of \"data\".Sorry if this seems niaive - I don't do upgrades very often and just want to know what I am facing. Might I be better getting a Computer Biz to do it for me and pay up ?","You discuss \"Most updates ...\" above - I am specifically discussing going from W7 to W10 which I regard as an UPGRADE and not an update.-> Agreed.My question here is that if the upgrade doesn't fail, it does succeed, will my installed applications and software continue to work ?-> Yes, they will, unless you receive a specific warning during the upgrade process.Finally can you clarify what you mean at 4 above \"If a clean Win10 installation is required ...\"  .  I would expect an upgrade to either work and complete in full OR it would fail in possibly one of several ways. In which case I understand I would need to restore from backup and start again - in restoring my system it would operate as Win7 and all would be OK except NOT upgraded to Win10.-> If an upgrade fails then a rollback to Win7 will occur. You then have the option of leaving things as they are or trying a clean installation of Win10, which would wipe everything you have.I am concerned about \"restore your data\" which reflects a partial restore from backup - but what about System Registry info and files - won't there be all sorts of potential clashes that accompany a partial restore of \"data\".-> The restore process would apply in case of a clean Win10 installation. You could only restore your data.Might I be better getting a Computer Biz to do it for me and pay up ?-> Last week I had a 72 year old lady with no experience in computer maintenance doing an upgrade all by herself. She never bothered with things like images. I do because my clients take a very dim view on me doing an upgrade that fails catastrophically. If you want to play it safe, create an image, then do the upgrade. You have nothing to lose."]},{"symptom":"Error Code 0x87E00005 Windows 10 Store Games Do Not Install        I am unable to install any games (and I just bought one) off the Windows Store on ONE of my PCs. I am able to install apps like Amazon Music, Audible, Xbox Game Bar, Angry Birds 2, and others. However the triple A type games like Age of Empires Definitive and Outer Worlds I am not.The game tries to download, goes from pending to download and just sits the for about 15 minutes before kicking up this error code. All searches say this error code pertains to Xbox consoles but this is a Windows 10 machine running windows store.My steps:- WSRESET about a million times- Fully removed Windows Store using PowerShell Admin- Reinstalled Windows Store using PowerShellRun back and select to install The Outer Worlds, download now went from Pending to Acquiring License to Downloading.. got to 4% stops and kicks up this error code. Anytime I try to restart this download I have the same problem, Error Code 0x87E00005.I do not know if this is related to ALL of this but my Office 365 on this machine ALSO refuses to update. Just spins endlessly, if I try to download it again from Office site it kicks back a different error and doesn't download. There is also one KB that refuses to install (all others do) SQL 2014 Server cumulative (I run SQL express here for UPS Worldship). I really never have issues with this machine and updates -- I have ALWAYS had intermittent issues with this machine and Windows Store albeit its been 2 years since I last full removed\/full installed the Windows Store and its been magic since and now this.","solutions":["So I have tried to install a couple of other games and they did work, it seems I only have TWO titles that refuse to download with this error on this computer: Age of Empires Definitive and The Outer Worlds.","Hi, Dvlos My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Follow these steps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Regards, Marc M.","Just to verify when I run Set-ExecutionPolicy Unrestricted - it asks what to change it to Yes .. Yes to All (it's set to No currently) and another option, which should I choose?","Did this and now I don't have a windows store icon, its called ms-resource:storeTitle and it doesn't run. Running it again before I just run the commands to kill the store and all its apps again.","(Yes to All)","i ran those steps and it keeps giving me the same mistakesame thing happens if i try to download games from the xbox app"]},{"symptom":"microsoft project        HelloI have purchased Microsoft Project.I can not find where this is, so that I can access it from my new computer","solutions":["Hi Paul Did you download and install Project, if not, go to http:\/\/www.office.com and if you're not already signed in, select Sign in On that pager, you should see your Microsoft Project Licence, select that and click Install . . ."]},{"symptom":"how to fix - 0xc1900101 - 0x30018 windows 7?        I have a lenovo W520 thinkpad - it has a pre-installed windows 7.In order to make a clean update. I re-install my windows 7, formatted the disk,and after the installation I make updates for  all drivers with the manufacturer's tool, and also the windows-7-updates.I make use with the media-creation tool. When installing with the media-creation tool I got 0xc1900101 - 0x30018 error.I tried several attempt as follows but it still couldn't install Windows 10:1) make a clean boot.2) disconnecting the internet.3) use installation with ISO. 4) Re-install windows 7 again and then immediately install windows 10 without updates. It still gives the same error.How I can fix the problem? How I can get the logs of error and understand the cause for it?Thx!   ","solutions":["Hi sasrol, you can reinstall Windows 10 at any time and it will not cost you anything !You should just clean install Windows 10 rather than upgrading from Windows 7. This will have 2 benefits, if you have to reset, it will reset to Windows 10, not 7 and your system will be more responsive and reliable . . .Since you previously had Windows 10 installed and activated on that PC during the installation process skip the steps which ask for a product key and select the option 'I am Reinstalling Windows 10 on this PC', and activation will not be an issue, your PC will have a digital entitlement stored on the Microsoft Activation Servers Make sure you install the same Edition of Windows 10 (Home, Pro . . . etc.) you previously had installed to avoid Activation issuesClick this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), you can create a bootable USB flash drive (min 8GB) using that toolThen, Boot your PC from the Installation Media you just created (change Boot Order in your BIOS) to begin installing Windows 10","Hi Dave,Thank you very much for taking the time to help me!I made upgrade from Windows 7 because I had windows 7 on it not windows 10.If I will install Windows 10 directly I would not be able to activate it. Hi sasrol, you can reinstall Windows 10 at any time and it will not cost you anything !You should just clean install Windows 10 rather than upgrading from Windows 7. This will have 2 benefits, if you have to reset, it will reset to Windows 10, not 7 and your system will be more responsive and reliable . . .Since you previously had Windows 10 installed and activated on that PC during the installation process skip the steps which ask for a product key and select the option 'I am Reinstalling Windows 10 on this PC', and activation will not be an issue, your PC will have a digital entitlement stored on the Microsoft Activation Servers Make sure you install the same Edition of Windows 10 (Home, Pro . . . etc.) you previously had installed to avoid Activation issuesClick this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), you can create a bootable USB flash drive (min 8GB) using that toolThen, Boot your PC from the Installation Media you just created (change Boot Order in your BIOS) to begin installing Windows 10","Hi sasrol Yes, you should be able to activate Windows 10 with your WIndows 7 licence key . . .During the installation process skip the steps which ask for a product key and select the option 'I am Reinstalling Windows 10 on this PC'Then when WIndows 10 is installed, go to Settings - Update and Security - Activation and enter your Windows 7 Product key from there . . .","Looking at the spec for the Lenovo it could be Windows 10 is incompatible with Intel HD 3000 graphics. Can you confirm what you have, I see there are Nvidia options too but they may not have up to date drivers.Have you ever had Windows 10 running on this device or are you just trying to upgrade.","Looking at the spec for the Lenovo it could be Windows 10 is incompatible with Intel HD 3000 graphics. Can you confirm what you have, I see there are Nvidia options too but they may not have up to date drivers.Have you ever had Windows 10 running on this device or are you just trying to upgrade.hi, I have not Windows 10 on it before.This is it's spes: https:\/\/support.lenovo.com\/il\/en\/solutions\/pd015362 My option is the nvidia quardo 1000m. I found a compatible driver for windows 10, https:\/\/www.nvidia.com\/Download\/driverResults.aspx\/130177\/en-usDo u think it could work? ","The Nvidia graphics drivers are a year old and no recent releases. This means it may not be compatible with the recent release version 1909 of Windows 10, which I assume is the one you are trying to use as the current release.You could try an earlier ISO image from here https:\/\/tb.rg-adguard.net\/public.php still Microsoft ISO provided by TechNet.You will also need a licence key as the free upgrade period was 2015 to 2016. Although having said that some users have found that the upgrade still activates. Microsoft may change that though."]},{"symptom":"What are the security risks of leaked GUIDs from Windows Terminal(Preview)  settings(JSON) file? Should I be worried?        I was configuring Windows Terminal(Preview) JSON file, but I encountered an error in JSON formatting So I posted it on online JSON validator. After that I realized that It contained some GUID's from Powershell, cmd, bash, Azure cloud shell. After some research I found that GUIDs are unique to every person in the world and it is just a unique identifier. So can any sensitive information can be extracted from leaked GUID? I also tried to regenerate GUIDs in powershell and replaced all old GUIDs with new one but everytime I restart the Windows Terminal(Preview) app it just automatically regenerate same old GUIDs. So what is the solution now?PS: My main concern here is just Security and PrivacySample config. file from random internet source(See the GUIDs)\"profiles\": [{\"acrylicOpacity\":0.75,\"closeOnExit\": false,\"colorScheme\": \"Campbell\",\"commandline\": \"cmd.exe \/k \\\"C:\\\\Users\\\\CharlieInc\\\\Desktop\\\\Prompts\\\\BuildEnv\\\\vcpkg-env.bat\\\"\",\"cursorColor\": \"#FFFFFF\",\"cursorShape\": \"bar\",\"fontFace\": \"Consolas\",\"fontSize\": 12,\"guid\": \"{f39b6ee5-a01c-41e3-a652-b95a5f3de9ad}\",\"historySize\": 9001,\"icon\": \"ms-appdata:\/\/\/roaming\/vs-32.png\",\"name\": \"VS2019 VCPKG \\ud83d\\udc96\",\"padding\": \"0, 0, 0, 0\",\"snapOnInput\": true,\"startingDirectory\":\"E:\\\\vcpkg\",\"useAcrylic\": true},{\"acrylicOpacity\":0.75,\"closeOnExit\": false,\"colorScheme\": \"Campbell\",\"commandline\": \"\\\"C:\\\\Program Files\\\\PowerShell\\\\7-preview\\\\pwsh.exe\\\" -NoExit -Command\\\"$Host.UI.RawUI.WindowTitle=\\\\\\\"Windows Pwsh \\ud83d\\udc99 (7 Preview)\\\\\\\";Write-Host\\\"\",\"cursorColor\": \"#FFFFFF\",\"cursorShape\": \"bar\",\"fontFace\": \"Consolas\",\"fontSize\": 12,\"guid\": \"{08a0be98-ff68-4e3a-a054-0fbd3969d3bb}\",\"historySize\": 9001,\"icon\": \"ms-appdata:\/\/\/roaming\/pwsh-32.png\",\"name\": \"Windows Pwsh \\ud83d\\udc99 (7 Preview)\",\"padding\": \"0, 0, 0, 0\",\"snapOnInput\": true,\"startingDirectory\":\"C:\\\\Users\\\\CharlieInc\",\"useAcrylic\": true},","solutions":[]},{"symptom":"Cortana        So I was going to ask Cortana how will the weather be when it wrote:  \"I can learn to understand you much better if I can get familiar with the way you talk. I need your permission to help\". But when I clicked \"Sure\" it wrote: \"I'm sorry, something went wrong. Try again in a little bit.\". How can I fix that, maybe a setting error... or an installation error... idk, can you help me?","solutions":[]},{"symptom":"Forza horizon 4 ultimate edition not loading        I recently purchased Forza horizon 4 ultimate edition only to find it doesn't load??? Or should I say I get the splash screen but that's about it all three or four seconds of it. My PC should be capable of running it 16 GB ddr4 ram Radeon RX 580 strix 8GB gaming graphics card,  RM750 PSU, AMD A10 9700 Radeon R7 10 compute cores? Any clue as to what the issue could be, I've tried uninstalling and reinstalling the game but still nothing, Windows Defender is off, I don't seem to have any overclocking software running either. I know how capable my PC is because I have been playing Battlefield V on it I bought it from Microsoft store","solutions":["Log Name: ApplicationSource: Application HangDate: 07\/01\/2020 15:16:27Event ID: 1002Task Category: (101)Level: ErrorKeywords: ClassicUser: N\/AComputer: DESKTOP-49K2K6UDescription:The program ForzaHorizon4.exe version 0.0.0.0 stopped interacting with Windows and was closed. To see if more information about the problem is available, check the problem history in the Security and Maintenance control panel.Process ID: 2c6cStart Time: 01d5c56d4994ec0aTermination Time: 4294967295Application Path: C:\\Program Files\\WindowsApps\\Microsoft.SunriseBaseGame_1.380.112.2_x64__8wekyb3d8bbwe\\ForzaHorizon4.exeReport Id: bc9e2b93-70fa-47a7-abb8-2882f192395cFaulting package full name: Microsoft.SunriseBaseGame_1.380.112.2_x64__8wekyb3d8bbweFaulting package-relative application ID: SunriseReleaseFinalHang type: ActivationEvent Xml:<Event xmlns=\"http:\/\/schemas.microsoft.com\/win\/2004\/08\/events\/event\"><System><Provider Name=\"Application Hang\" \/><EventID Qualifiers=\"0\">1002<\/EventID><Level>2<\/Level><Task>101<\/Task><Keywords>0x80000000000000<\/Keywords><TimeCreated SystemTime=\"2020-01-07T15:16:27.190195800Z\" \/><EventRecordID>8140<\/EventRecordID><Channel>Application<\/Channel><Computer>DESKTOP-49K2K6U<\/Computer><Security \/><\/System><EventData><Data>ForzaHorizon4.exe<\/Data><Data>0.0.0.0<\/Data><Data>2c6c<\/Data><Data>01d5c56d4994ec0a<\/Data><Data>4294967295<\/Data><Data>C:\\Program Files\\WindowsApps\\Microsoft.SunriseBaseGame_1.380.112.2_x64__8wekyb3d8bbwe\\ForzaHorizon4.exe<\/Data><Data>bc9e2b93-70fa-47a7-abb8-2882f192395c<\/Data><Data>Microsoft.SunriseBaseGame_1.380.112.2_x64__8wekyb3d8bbwe<\/Data><Data>SunriseReleaseFinal<\/Data><Data>Activation<\/Data><Binary>410063007400690076006100740069006F006E0000000000<\/Binary><\/EventData><\/Event>","Under the Consumer Rights Act 2015, digital content should be of a satisfactory quality, fit for purpose and as described.My rights have been breached because the digital content you sold me is faulty. I would like you to fix it within a reasonable time."]},{"symptom":"I Dont undestand  how to change the letters on my keyboard like y & z!!        Also, my signs are all mixed up and, I dont know how to fix it. Someone please help me.","solutions":[]},{"symptom":"files moving on their own        I was moving music files and some files i did not click on moved with them. i have norton 360 but norton said its not their fought i was off line doing  this at the time. It was if some one was controlling my computer remotely","solutions":[]},{"symptom":"windows 10 update   screen fuzzy cant see the disply properly        just updated with windows update ( windows10)  on JAn 9th 2020. Now after boot ( i can see the boot display fine)  but as soon as the sign in screen comes on the screen goes completely fuzzy, i can just make out the text blocks but cant read them....  tried to sign in but now I am blocked as I tried too many times! Now I cant even get to any menus to try and fix !!!!!!!!!!!!!!!!!!!!How am I supposed to access the drivers menu now!!!    This is crazy.....  Now I am locked out and I cant even get on the internet!   so my laptop is now bricked!!!!!!!!!!!!!!!!!Please advise asap!!!Thank you","solutions":[]},{"symptom":"Focus Assistant (settings) does not react        So i noticed i do not recieve any Notifications anymore, a quick look into my Quick Settings i realize Focus Assitant is set toAlarms Only a click on it to deactivate it did nothing. Accessing Focus Assistant Settings yielded the same result none of the settings in the window are possible to change.Thanks to ClickmHighlighter i do know with certainty that the click Input is there, it just doesnt change anything.This is happening on an Fully Updated Surface Pro 5 with the i5 configuration.PS: You can keep my typos, but take the message","solutions":[]},{"symptom":"Remote desktop multiple monitors        HiI have windows 10 installed on two PCs. One is my \"demo\" pc and the other my work pc. Sometimes I want to remotely access my work pc from demo pc. The issue is that I use 3 multiple monitors on work pc but when I remotely access it only one screen is accessed. Is there any way to access all the screens and use some keyboard command, like \"shift\"+\"windows button\" + \"right\" or \"left\" to change the remote monitors.Thanks!","solutions":["Hi there, Yes, from your demo PC (laptop), please try to check off that box to see if this helps you.I've attached Figure B from the following website to this post, it is not my screenshot but shows where to check it off.Though this is for Windows 7, the same principles generally apply to Windows 10: https:\/\/www.techrepublic.com\/blog\/windows-and-o...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. If it does not work as you expect, if you scroll down further on that article, it shows how to set up a monitor-spanning connection. There are some caveats on this working, and you requires a launch from command line in order to use the commandMstsc \/span Again, if this is not accomplish what you are looking for, there are some other methods that could work, including third party applications such as TeamViewer:https:\/\/community.teamviewer.com\/t5\/Knowledge-B... Regards, -Ashton"]},{"symptom":"Enable Telnet on Windows        HelloI am having trouble starting telnet from a command prompt on Windows 7 and Windows 10.I have ensured that Telnet is installed using Programs and Features. I have used services.msc to automatically start the telnet service. On Windows 7 I have added the local user to the Telnet security group (which does not exist on Windows 10).When I start a command prompt using cmd.exe and either running as administrator, or logging in as the local administrator and running cmd, when I type telnet I receive an 'Access denied' response:Microsoft Windows [Version 10.0.18362.267](c) 2019 Microsoft Corporation. All rights reserved.C:\\Users\\Administrator.D800857>telnetAccess is denied.C:\\Users\\Administrator.D800857>Can anyone assist me with this, please?Thank you.","solutions":[]},{"symptom":"Connecting to duel monitors        I'm trying to connect my work laptop (at home) to duel monitors. I have an hdmi cable from the laptop to a splitter, then two hdmi cables from the splitter into each of the monitors. However the monitors are both showing the same image, whereas I wanted this to be extended. It is identifying screen one as the laptop, and the monitors are showing as screen two. I have to have the laptop open for this to happen, if I close the laptop it only detects one screen. How can I change this so the monitors are showing as screen one and two?","solutions":["Hi Colly I am sorry, this is not possible . . . To have two different Desktops showing on those monitors, you would need two video outputs on your laptop, because a splitter basically splits the same output signal into two identical signals . . .What is the Make and exact Model no. of your laptop - that will be printed on a sticker on the bottom underneath casing, and I will check the specs of your system to see if this is possible on that . ..","Hi, thank you for your reply. It is a Dell Latitude 5300. I'm really just wanting the two screens to act as one big screen,  so that's not possible? Thanks","Hi Colly173 The good news is you also have a USB Type C Port (Display Port) on that laptop and you can use that along with the HDMI port to connect those two monitorsYou just need to use one cable from the HDMI to one Monitor and a separate cable form the Display Port to the other monitor, that will give you and extended Desktop across those two monitors . . .","Thanks Dave, I'll give that a go! "]},{"symptom":"KERNELBASE.dll error causes program to CTD        Hi,Currently I am using a program, flight simulator program P3D v4.5, which works excellent for the first 3 hours of flight. However, when doing a long-haul flight, like London - San Francisco, I get a crash to desktop. I am wondering how this is possible, and therefore I asked the P3D support team, since it is their program and not Microsoft's. They told me to go find a log in a Windows program, where it shows the errors. I did so, and the following came out:Faulting application name: Prepar3D.exe, versie: 4.5.13.32097, time stamp: 0x5d8abf93Faulting module name: KERNELBASE.dll, versie: 10.0.18362.535, time stamp: 0x50cc8d5aException code: 0xc0000002Fault offset: 0x000000000003a839Faulting process id: 0x214cFaulting application start time: 0x01d5c7276540edfeFaulting application path: C:\\Program Files\\Lockheed Martin\\Prepar3D v4\\Prepar3D.exeFaulting module path: C:\\WINDOWS\\System32\\KERNELBASE.dllReport id: 11bd28a8-0036-4cfc-afb5-52e278bc606bI saw that the fault was located in the KERNELBASE.dll, and although I tried solutions on other questions asked here, like https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/windows-10-application-crash-kernelbasedll\/effd2d14-3a80-4962-9aed-3166d41e1b9b it did not work.My pc specs:- Intel i7-8750H 2.2-4.1 GHz- GeForce GTX 1050 (4GB GDDR5 VRAM)- 16 GB DDR4 RAM- 256GB NVMe SSD with 73 GB free disk spaceIt would be appriciated if someone could help to fix the issue. Thanks in advance.","solutions":[]},{"symptom":"XCShInfo.dll seems to be causing explorer to crash        Hi there,Some time ago, there was a post about explorer crashing, and someone posted the following question:\"There are some third party extensions that could be problematic such as this one:LoadedModule[282]=C:\\Program Files\\Tracker Software\\Shell Extensions\\XCShInfo.dllIs that Tracker Software installed on all computers?\"I am experiencing the same problem. My explorer is crashing when i search in file explorer. In the crash dumps i find the following info:FAILURE_MODULE_NAME:  XCShInfoWe have PDF Viewer installed from Tracker Software. Does anyone know what i can do to stop explorer from crashing?The operating system is Windows 2012 R2. Kind regards,Johan Mol","solutions":["Hi Johan I am sorry, Community is just a consumer forum, due to the scope of your question (Server 2012) can you please post this question to our sister forum on TechNet in the Server 2012 section (linked below)Over there you will have access to a host of Server 2012 experts and will get a knowledgeable and quick answer to this question . ..https:\/\/social.technet.microsoft.com\/Forums\/en-..."]},{"symptom":"Start menu, advanced using !! Why some shortcuts in it don't appear ? ;-(        Hello everyone!Happy New Year 2020I'm looking for info or rules about Windows 10 start menus below :1) C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs2) C:\\Users\\%users%\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\ProgramsThey react in a strange way, some shortcuts that are there don't appear (see my screenshots... in french ;-) )Is there any documentation on the subject?Example, in the Windows administration tools menu.The shortcut \"Task Scheduler\" which is in the folder \"C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\"...Folder Start Menu of ProgramDataBut does not appear in the menu and the other shortcuts are there !!!Start Menu - WrongIf i put the shortcut \"Task Scheduler\" in the folder \"C:\\Users\\%users%\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\"Folder Start Menu off User\"Task Scheduler\" appears in the start menu !!!Start Menu - GoodIt's very curious, why him and not the others...Of course it's not a problem of shortcut properties !Thank you for your collaborationA+Jean-Claude","solutions":[]},{"symptom":"Unable to set location of temporary internet files to correct default        I have been getting error messages on my newly installed Win10 (64 bit) machine regarding the location of temporary files, on one of my logins.  If I go to Internet Options -> General -> Browsing history -> Settings, the location of temporary internet files is reported as: C:\\Users\\<user>\\AppData\\Local\\Microsoft\\Windows\\Temporary Internet Files\\.Every other machine of mine reports this as being C:\\Users\\<user>\\AppData\\Local\\Microsoft\\Windows\\INetCache\\If I try to change the location, the INetCache folder isn't visible in the folder picker, even though I can navigate to it using the file explorer.  I have \"Hidden files\" ticked in my file explorer options.Is this \"incorrect\" location of temporary files likely to cause problems or is it a harmless thing that can be ignored?","solutions":["Hi Robert Rest assured, you can ignore this inconsistency, that 'Temporary Internet Files' is a legacy folder form WIndows 7 and honestly it does not make any difference if Windows is using wither of those two folders to store the temp Internet cache, this will not affect the good running of your PC in any way . . ."]},{"symptom":"Download multiple files from Sharepoint or OneDrive.        Here's a simple things which should exist in any half decent cloud storage service.How do I download multiple files which are shared in the organization?Now before you jump to 'just press the download button', see screen shots below because it isn't there when you look at shared files. Only when you're in your OneDrive.","solutions":[]},{"symptom":"Windows Security Smart Card popup        When starting my computer I get the popup attached below, it comes up and has to be dismissed a total of four times. This happens on two different Windows 10 devices I use. I use a smart card to access enterprise webmail on occasion and that works without issue. I do not use the smart card to log into my personal devices. The popups did not start on my new device until the first time I used the USB smart card reader. I have not found anything that I am unable to do without hooking up the card and have no issues accessing the website that require the smart card so this is an annoyance not a capability breaking issue. I have seen similar questions asked multiple times without a clear resolution. I'm guessing that there is a setting somewhere that gets turned on when a smart card is introduced and I would like to disable it upon login.","solutions":["Hi Hoarder, Disable Smart Card Plug and Play Service Step 1 Hold down the \"Windows\" key and press \"R\" to open the Run dialog. Type \"gpedit.msc\" at the prompt and press \"Enter\" to open the Local Group Policy Editor.Step 2 Expand \"Computer Configuration,\" \"Administrative Templates\" and \"Windows Components\" in the tree browser. Double-click the \"Smart Card\" folder in the main window.Step 3 Right-click \"Turn On Smart Card Plug and Play Service\" and select \"Edit.\" In the Properties dialog, select \"Disabled\" to turn off this service and remove the smart card option from the login screen. Click \"Apply\" and \"OK\" to save your changes.Step 4 Close Local Group Policy Editor and restart Windows to finalize the changes. Let me know if this will work. Thanks and regards,","Unfortunately this solution doesn't work as both my devices run Windows 10 Home and Group Policy Editor is a feature of Windows 10 Pro.","Hi Richard, Hoarder,I have the exact same problem, the pop-up widows is shown randomly, so not linked to opening any application or file.To remove it, you have to cancel 4x.I do have Win10 Pro and have set the parameter to disabled in the gpedit.msc.Unfortunately that did not solve the issue, the pop-up keeps coming back.Any other suggestion?Thanks."]}]}