{"windows":[{"symptom":"Screen Flickering while playing videos and touchpad issues        Hello recently i have bought brand new asus vivobook 512-FB  i have been having problems while using windows with the display screen is flickering sometimes when i run 4k videos especially i have nividia mx110 and inter graphics uhd 620. i have tried the fix that Microsoft suggested to uninstall drivers and check for updates yet i am having the problem i spoke with asus and they said it must be an OS problem . i have also a problem with the touch-pad the mouse sometimes gets slow suddenly and it clicks randomly , it binds a click for few seconds then it gets backs to normal i cannot find a solution for that also  i started suspecting the laptop it self having electricity problem a help would be nice ...!***Original title: Windows 10 touchpad and display issue***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query related to playing 4K videos on your PC and touchpad not responding properly. For further clarity on the issue, please respond to the questions below: What is the exact model number of the PC?Do you face the same flickering issue if you play a full HD video? Concerning towards the screen flickering query, it could be possible that the PC screen doesn’t support 4K and that might be the reason you are facing the flickering. One of the things that I suggest is to try playing a 1080p (full HD) video and see if the same issue occurs. However, you can also try changing some settings in NVidia Control Panel and see if that helps. Right click on Desktop and click on NVidia Control PanelNow click on Display > Advanced Desktop color settings.Now, set the content type to this display as Desktop Programs or Full Screen Video.Click on Apply. Regarding the touchpad issue, you may want to refer the article Fix touchpad problems in Windows 10 and see if that helps. Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Windows Mixed Reality        I’m getting a new PC and I’m Going to Get a Windows Mixed Reality HeadsetI Just want to ask If I have the right specshere are the specs:Technology : Intel® Core™ i7-9750H Processor, NVIDIA GeForce® GTX1650 Tech Specs (CHIP,Memory,Storage) : 8GB Memory (RAM) , 512GB Hard DriveOperating System : Windows 10 HomeBy the way it does have USB 3.0.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. It appears that you have correct hardware for Windows Mixed Reality and Windows Mixed Reality Ultra.However, here are the detailed hardware guidelines you can go through: https:\/\/support.microsoft.com\/en-in\/help\/403926..."]},{"symptom":"if i leave s mode,which antivirus is best used for windows 10 home        if i leave s mode,which antivirus is best used for windows 10 home","solutions":["Hello debra1711, I'm Didi, an independent advisor. The Windows built-in antivirus (Defender) is sufficient and has a good performance.If you want to scan your computer you can also occasionally use Malwarebytes : https:\/\/www.malwarebytes.com\/mwb-download\/thank... Someone has asked the same question as yours and multiple well-known experts on the Windows Community forums (Kapil Arya, Greg Carmack, DaveM121, Andre...) have vouched for Windows Defender, see this thread for more information :https:\/\/answers.microsoft.com\/en-us\/protect\/for...Also make sure that when you open a downloaded or received file it is from a 100% trusted source.Regards, Didi","Also;The best security sits between the chair and the keyboard.  Watch what and where you click.  If you do not know what is there do not click on \"Click here\".  If you get an email that sates it is from your provider look at the address of the sender.  If it has a couple of letters at the end they are probably the foreign country and that is not where your provider is located.  When downloading programs do it from the maker not anyone else and do not allow any extra items to be included.","if i leave s mode,which antivirus is best used for windows 10 home ___________________________________________________Hi Debra,          The Built In Windows 10 Defender. (IMO) is the Only Security Suit you will need.","FWIW:Microsoft created Windows 10 S mode for a reason: Security....> Windows 10 in S mode FAQ - Windows Help If you want to switch out of it: Since some weeks many users are not able to switch out of S mode. Seems that there are some problems on the Microsoft's servers side..Users are advised to try again in a few days or even weeks.... === In case you decide (and have been successful in) switching out of S mode: Windows 10 comes with in-built AV Windows Defender.Whether you want to use Windows Defender or want to install another AV: that depends on your own preferences and habits.No matter which AV you want to use, there might be situations in which you want to use other Anti-Malware programs for occasional, on-demand scans.Suggestion to read:Choosing an Anti-Virus ProgramSafe Steps for Replacing your Anti-virus - Why should you use Antivirus software?Supplementing your Anti-Virus Program with Anti-Malware Tools"]},{"symptom":"can not login the APP store        Hi, the problem is: 0x80131500","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you receive an error, ‘0x80131500’ when you try to login to Microsoft Store. I’ll help you with this issue. However, please let us know: Are you aware of any changes made to the computer prior to this issue?Which build version of Windows 10 are you using currently? Meanwhile, you may try the steps mentioned below: Method 1: Try resetting Microsoft Store cache and see if that helps. Press the Windows Logo Key + R to open theRun dialog box Type wsreset.exe, and then select OK Note: A blank Command Prompt window will open, and after about ten seconds the window will close and Microsoft Store will open automatically. Method 2: Re-register Store Try re-registering Store using PowerShell command. Press Windows + X keys together and click onWindows PowerShell (Admin) Now type in the following command and hit Enter to re-register Start Menu: Get-AppXPackage *Microsoft.WindowsStore* | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register “$($_.InstallLocation)\\AppXManifest.xml”}Restart the PC.  Method 3: Assign DNS We can try assigning a Global DNS and see if that helps. Refer the steps mentioned below: Press Windows key + R, to open Run dialog box.Type ncpa.cpl and click on OK.Now, right click on the connection that you are using and click onProperties.Double click on Internet Protocol Version 4 (TCP\/IPv4).Click on Use the following DNS server addresses, and enter8.8.8.8 and 8.8.4.4. Method 4: New User account Create a new user account and check if the Store app is working fine. Refer the articleCreate a local user or administrator account in Windows 10 Let us know the results. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"I am still using Windows 8.1 Pro. And I want to upgrade, what can I do without paying.,        I am still using Windows 8.1 Pro. And I want to upgrade, what can I do without paying","solutions":["I am still using Windows 8.1 Pro. And I want to upgrade, what can I do without payingYou may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700Cheers."]},{"symptom":"I deleted Desktop from OneDrive in my browser, need help        I accidentally deleted my Desktop from OneDrive in my browser and now I cannot see my desktop in file explorer. I can still see the shortcuts on my desktop but not in my desktop folder under my user profile folder. I also deleted my documents, do I need to reinstall Windows 10? My PC does not show up in my browser when viewing my OneDrive account as well. I just started installing my OS and apps so I do not have a restore point that goes to before this happened. Please help.","solutions":["You can go back to OneDrive Settings, Manage Backups and Stop Backup for Desktop, Documents and Photos. That will stop the synchonization of those files\/folders.If you want to decide on other settings, go to Settings > Accounts > Sync Your Settings.https:\/\/support.microsoft.com\/help\/4026102"]},{"symptom":"Pop-up 'suggestions' always in the way        How do I turn off the pop-up suggestions that always get in the way when I move the mouse, or pass over anything on the screen? It is really annoying. I don't need this thing trying to tell me what I'm looking at, or constantly making suggestions (that are always WHAT I am typing anyway!).","solutions":["Hi GeraldGarnto, My name is Riccardo and I'd be happy to assist... Go to Start > type in Notifications and then click the Notifications & action settings iconSet the Get tips, tricks and suggestions as you use Windows to off (as seen in the screenshot) Let me know if you need anything else.","Went there, did that. All set to \"Off\". That did not stop what I am experiencing. I guess I don't know the proper terminology. These little pop-up windows show up as you pass over any link in e-mails or on web-pages. And, if I am scrolling the mouse on a web page, a small window opens as though to suggest I might want to \"Print\" \"Copy\" or \"Search\"; usually in the margins of the page, but sometimes over paragraphs too.It must be tied to the mouse pointer?I included a screen capture.","Here's the other one that stops everything until I click the mouse somewhere else on the page.","Is this only happening in Edge not in Windows 10 in some other application?","I'm only running Edge right now on this new machine. IE is still part of the platform, but not used yet. ","Let's try this...go to Start > type in Apps & Features > click the Apps & Features icon > go down the list to Microsoft EdgeClick Advanced Options Scroll down to Reset and see if that fixes the issue Alternatively if that does not fix it, you can do the same thing: Start > type in Apps & Features > click the Apps & Features icon > go down the list to Microsoft EdgeClick Advanced Options This time click Repair.","Turned off background apps after repair, but still that did not stop the \"helpful\" popups.I looked in 'Mouse Settings', but did not see anything that is \"On\" that isn't supposed to be.It's most aggravating in E-mails, but annoying also on Webpages. I don't know why there isn't other posts about this . . . ","It's most aggravating in E-mails, but annoying also on Webpages. I don't know why there isn't other posts about this . . . -If the email account is outlook.com change this setting. Cog > View all outlook settings > Compose & reply > uncheck Preview links in email.Don't have a solution yet for the pop-ups on webpages. Don","Using Window-10 'New' Mail with no address book, or spam filter (thankyou Microsoft). I had Windows Live Mail, but it's \"no longer supported\". I guess the 'Cloud' got to be too much of a hassle.Some popups have web address code so long, it covers the page. I can scroll over my own name on this page, and the popup tells me it's me.Why they thought this would be helpful is a wonder to me. It's like everything needs to be interpreted because you're too stupid to operate the machine . . .","The address book for contacts is the People app. You should see that in your Start menu next to Mail."]},{"symptom":"Win 10 fails to boot        The other day the PC crashed. It restarted on its own and went to the recovery screen, but nothing has worked. I've done ever imaginable step. System Restore wouldn't start. Removing the last update didn't start. I tried bootrec, but that removed Windows 10 from the \"exit and use Windows...\" screen option. Hilariously I follwed the offered Microsoft steps and used the Win 10 install on a USB. It clearly stated on the screen involving \"bootmgr is missing\" to boot from the USB since none of the repairs have worked I tried to install and it says since I have Windows I can't install I have to open Windows and run from there...WHICH I CAN'T DO!!!!I ran chkdsk which said it finished successfully but with an unspecified error {75736e.....} so the hard drove may be failing so if I get a new hard drive how can I install Windows 10??? I had the free upgrade or is that the trick? The latest update kills the free upgrade so that you have to now buy windows, well played.If I get a new drive and clone my old one and every event repeats then obviously I have to buy Windows which should not be the sole solution. I should be able to do a repair install without opening Windows. From what I remember that used to be a thing. I clearly remember doing that with XP so has that feature been removed? Not really a question.The real question is where is the repair install on Win 10 without having to open Windows which I cannot do.","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.You aren't going to need to buy new license. Provided you had an activated version of Windows previously and install again with the same version (ie. Home or Pro) Windows will automatically re-activate as you are installing on the same hardware (even if you need to change the hard disc it still counts as the same hardware as the activation is tied to the mainboard).In order to get a reinstall going without loading Windows you need to boot the computer from your USB drive. Firstly, make sure you have the most recent Windows install media by visiting the official download website and building a new USB drive - hopefully you have another computer which this can be done with. The site is here: https:\/\/www.microsoft.com\/en-gb\/software-downlo... In order to boot from the USB drive you can either press a key while the computer is preparing to load (the screen might prompt something like \"Press F12 to choose boot device\" or \"Press ESC for start-up options\", or similar) OR if you can still access the recovery options go to Troubleshoot section and choose to start the computer from a USB device.The aim here is to get the computer loading Windows set from the USB drive... doing it this way it doesn't matter if the HDD is corrupt, or even blank, set-up will load so you can make some progress.Once you get that going - I'd suggest trying the repair options first - as they might be able to recover your existing install however failing that you'll need to do a reinstall - this will move your files to c:\\windows.old (so you won't lose anything), but does mean you need to reinstall apps, etc, assuming you can get in to set-up choose a \"Custom\" install... if you're asked for a product key just SKIP that step, but be sure to choose either Home or Pro Windows the same as you had previously.Regards, David"]},{"symptom":"windows 10        Thank you to all who responded.i heard there is a free upgrade from Microsoft for Windows 10.  is this true, if so how does one go about taking advantage of that freebie?","solutions":["i heard there is a free upgrade from Microsoft for Windows 10.  is this true, if so how does one go about taking advantage of that freebie?Feature update to Windows 10 VersionMicrosoft  .Net Framework 4.8 for Windows 10 Version 1809 for x64 (kb4486153)","Hi 99 The free upgrade period from Windows 7 and 8 to Windows 10 ended 3 years ago . . .That is the official word, however, a lot of users report they can download the Windows 10 ISO from the link below and that can be used to upgrade for free to Windows 10 still . . .https:\/\/www.microsoft.com\/en-us\/software-downlo..."]},{"symptom":"Update Issues After Installing Version 1903        After version 1903 finished installing(I put off updating for a long time), I went to see if there were more updates that I should install. I tried downloading and installing them, but that failed.I then went to the Troubleshoot menu and selected the Windows Update option.What should I do? Thanks in advance!","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Can you try the steps in this article and see it resolves the issue: https:\/\/windowsreport.com\/windows-10-error-0x80...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Solution 1 from the article was to run SFC and DISM.Results from SFC:Results from DISM:Trying to update afterwards:Running the troubleshooter for Windows Update afterwards:Solution 2 from that article said to use the Windows Update Troubleshooter. I tried, and you can see what happened in the image above.Solution 3 said to enable critical windows update services. I could not run services.msc and this is what I saw upon trying:(I couldn't use the snipping tool while that pop up was there, so I found a similar image online. The only difference being that instead of the file path being C:\\WINDOWS\\system32\\compmgmt.msc I had the file path end in services.msc). I'm using an administrator account, so I don't know what's going on.Solution 4 suggested downloading the update manually, but I'm not quite sure how that applies to my case, so I need clarification on that.Solution 5 suggested resetting the Windows Update components. I followed the instructions. Putting Ren C:WindowsSoftwareDistribution SoftwareDistribution.oldand Ren C:WindowsSystem32catroot2 Catroot2.old in the command line did nothing, and the only thing I learned is that Cryptographic Services terminates unexpectedly no matter how many times I try to run it.So, I still need help. ","Run the following in this order:Method 1: Run DISM tool and check the issue. Please follow these steps:a. Press Windows + X keys and click command prompt (admin). Or PowerShell (Admin).b. Type the following command in command prompt and press Enter.DISM.exe \/Online \/Cleanup-image \/Scanhealthafter the scan is complete type the following and press EnterDISM.exe \/Online \/Cleanup-image \/Restorehealththen use method 2.Method 2: System file checker is a utility in Windows that allows users to scan for corruptions in Windows system files and restore corrupted files.Run system file checker (SFC) and see if it helps. Please follow these steps:a. Press Windows + X keys and click command prompt (admin). Or PowerShell (Admin).b. Type the following command in command prompt and press Enter.sfc \/scannowAfter completing the scans restart using Start > Power > Restart.After the restart run the windows update Troubleshooter again and restart as above no matter what the outcome.Does that help.","Hi, ZulepTheCat My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.If you have a third-party antivirus, you must disable or uninstall it. Try reset Windows update components: Right click on the start button and select Powershell (admin) or Command Prompt (admin)Write the next hit enter after each line. net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Restart and try again. You can also download the Windows Error Solver: https:\/\/support.microsoft.com\/en-us\/help\/10164\/...https:\/\/aka.ms\/wudiag You can do it manually by downloading the Windows ISO. When updating with the ISO, disconnect the Internet. https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/answers.microsoft.com\/en-us\/windows\/for...","Did method 1.Ran the SFC.Restarted my laptop then tried running the Windows Update troubleshooter.Started the entire process again.Restarted, then tried running the Windows Update troubleshooter. Same thing happened, unfortunately.","Generally if the system file scans do not fix errors then the next step is a repair install.http:\/\/www.tenforums.com\/tutorials\/16397-repair-install-windows-10-place-upgrade.htmlBecause you have just updated to 1903 then you should use an ISO image from the TechNet site to download the correct version from Microsoft servers. https:\/\/tb.rg-adguard.net\/public.php it sound like your version update hasn't installed correctly and the repair is the only way to fix it.Basically you download the ISO and double click the file to mount it then open the new drive letter and run setup. You will get the option to keep personal files, apps and programs."]},{"symptom":"Trouble downloading Minecraft Win10 Edition        I have Windows 10 Pro and I can't download Minecraft Win10 which I already own because Error 0x8000FFFF shows up and can't even get into the page.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.Please try the following steps and let me know the status.1. Press Windows+R keys together to open Run.2. Enter the following command:wsreset.exe3. Close the black Window.4. Open Store and try to download Minecraft."]},{"symptom":"Windows 10 is not connecting the internet where chrome is working fine on the same PC        Hi - since defragmenting my system disk, Windows 10 is not connecting the internet although Chrome is working fine on the same machine.Since a week my windows 10 is not connecting through net therefore I am totally unable for any updates of windows apps.Chrome is working fine. Edge is working fine although it doesn't connect to internet unless I connect to the web through Chrome first. Please help.I'm also not able to see my wifi connectionhere is my ipconfig \/all Configuration IP de Windows   Nom de l’hôte . . . . . . . . . . : NAMECHANGED   Suffixe DNS principal . . . . . . :   Type de noeud. . . . . . . . . .  : Hybride   Routage IP activé . . . . . . . . : Non   Proxy WINS activé . . . . . . . . : Non   Liste de recherche du suffixe DNS.: homeCarte Ethernet Ethernet :   Suffixe DNS propre à la connexion. . . : home   Description. . . . . . . . . . . . . . : Realtek PCIe GBE Family Controller   Adresse physique . . . . . . . . . . . : 44-87-FC-F2-A2-3D   DHCP activé. . . . . . . . . . . . . . : Oui   Configuration automatique activée. . . : Oui   Adresse IPv6. . . . . . . . . . . . . .: 2a01:cb04:a60:6b00:8825:2525:8f3e:5473(préféré)   Adresse IPv6 temporaire . . . . . . . .: 2a01:cb04:a60:6b00:1c1c:c95c:b8c2:fd05(préféré)   Adresse IPv6 de liaison locale. . . . .: fe80::8825:2525:8f3e:5473%20(préféré)   Adresse IPv4. . . . . . . . . . . . . .: 192.168.1.23(préféré)   Masque de sous-réseau. . . . . . . . . : 255.255.255.0   Bail obtenu. . . . . . . . . . . . . . : vendredi 3 janvier 2020 08:43:56   Bail expirant. . . . . . . . . . . . . : samedi 4 janvier 2020 08:43:57   Passerelle par défaut. . . . . . . . . : fe80::267f:20ff:fe28:5280%20                                       192.168.1.1   Serveur DHCP . . . . . . . . . . . . . : 192.168.1.1   IAID DHCPv6 . . . . . . . . . . . : 340035580   DUID de client DHCPv6. . . . . . . . : 00-01-00-01-25-9E-9D-ED-44-87-FC-F2-A2-3D   Serveurs DNS. . .  . . . . . . . . . . : fe80::267f:20ff:fe28:5280%20                                       192.168.1.1                                       2a01:cb04:a60:6b00:267f:20ff:fe28:5280   NetBIOS sur Tcpip. . . . . . . . . . . : Activé   Liste de recherche de suffixes DNS propres à la connexion :                                       home                                       home","solutions":["Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.Please perform the following steps and check.Run command prompt as Administrator.Enter the following commands one by one and restart the computer.ipconfig \/flushdnsnetsh winsock reset"]},{"symptom":"Mobile Broadband Capability is turned off        Hi,I am currently using a desktop PC with Windows 10 Pro 1903 OS Build 18362.295I'm trying to use a Mobile Broadband Adapter with my desktop (specifically a Sierra Wireless MC7430 Mini-PCIe Modem) plugged into a Mini-PCIe to USB adapter.The modem is installed correctly, with the correct drivers and appears in the Modems and Network Adapters in device manager. In the Mobile settings of Windows 10 I can see the Modem is there and connected to the Network (with a SIM card plugged in), but underneath the network name it is \"Turned Off\".I have tried clicking \"Cellular\" to \"turn on\" the modem and this does nothing.I have tried disabling the modem, re-enabling it, uninstalling it, reinstalling it. Nothing works - I am unable to get the Modem to \"turn on\".I have tried taking the modem and plugging it into a PC nearby that is still currently running Windows 10 Pro 1809 - and it works perfectly.I have also tried plugging this into 2 other PC's all running 1903 and they have the same issue. The modem is turned \"off\" and unable to turn on.Additionally, I have tried replacing the Sierra Wireless modem with one from another manufacturer, and I have the exact same issue. I cannot turn the modem on, yet I plug it into a PC running 1809 and everything is fine.I have tried running the network diagnostics, only to be told to use the function keys (they do not exist - this is a desktop PC and this is effectively a USB modem) - or to use a switch on my PC to turn it on (again, it does not exist).I would appreciate some help with this - google is failing me, and the closest I could find is someone having the exact same issue with an insider build: https:\/\/answers.microsoft.com\/en-us\/insider\/forum\/all\/mobile-broadband-capability-turned-off-and-there\/e695db5b-39a9-449a-a53b-ca3b1748d936 though this appeared to be fixed with a newer version?Thank you in advance for your help.","solutions":["I've seen this \"turn off\" thing. In my case, the Sierra drivers were not properly installed. And this was because at my work, we block executables running from the Temp folder.When we installed the driver package, it was done in two steps. First was the normal installer we're all used to. Then, a smaller, yellow rectangle popped up in the corner of the screen to \"configure\" the modem. If this yellow configuration box didn't pop up, the modem could not be turned on. When it did work, Windows changed \"turned off\" to \"Insert SIM\" or the carrier's name if we had a SIM in.I would also eliminate the adapter and connect the card to your motherboard, then reinstall the driver package.","Hi Liam My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.Are you able to browse the datacard on the modem? If so, you could right click setup then try installing compatibility mode to see if it works.Here is an example, this was on Windows 8.1 when I was using an older Huawei Mobile 3G modem.https:\/\/techingiteasy.wordpress.com\/2013\/07\/08\/...In the case of Windows 10: - Right click the setup file for your modem. - Click Troubleshoot compatibility - Wait while it detects any problems - Click Troubleshoot program - Check the box 'The program worked in earlier versions of Windows but won't install or run now'- Check the box for Windows 7 then click Next Information in the above link is sourced from a trusted Microsoft MVP blog.","HI Entegy,Thanks for the reply.One of my colleagues unfortunately has the same issue on a fresh install of Windows 10 from USB Media that was generated last week, and using a Quectel EC20EA Mini-PCIe Modem via a USB adapter.I'm not sure it's specific to any particular manufacturer or their driver.I don't think we have any machines that have Mini-PCIe on their motherboards to test this with, but what I can say is that the majority of Mini-PCIe to USB adapters, are simply that; they pass through the USB header to the USB lanes on the PCIe card, which should be connected directly to the USB port of the modem. There should be no real difference between plugging it in via an adapter or plugging it into a Mini-PCIe port.I will try re-installing the sierra wireless drivers to see if I can see the yellow rectangle you mention and also try and use another adapter.It's odd that it works correctly with the exact same drivers on 1809, but not on any of our 1903 installs.Thanks for your help.","Hi,Thanks for the suggestion, unfortunately this did not work.I removed the drivers then installed with the compatibility settings for Windows 8, then Windows 7.","I have an update:We're now able to get the Sierra Wireless modem to turn on by enabling Flight Mode, waiting until it is fully on (the icon is displayed and the tile has changed colour), then disabling Flight Mode, then clicking on the Mobile Tile. The downside of this is that even with an antenna connected and SIM card, the modem reports \"No Service\", even though moments before toggling Flight Mode, we were at full signal.There's not an issue with the SIM card. It has since been tested in other devices.We were also able to turn the modem \"on\" using Sierra's Skylight tool.However, we're unable to replicate the same workaround to get the modem to turn on when using the Quectel modem.I'm convinced this is an issue with Windows 10 1903 rather than driver-specific issues.Thanks","I would also recommend you file a bug report; send me the short link so I can vote on it and bring it to the attention of the Windows engineers in my capacity as a Windows Insider MVP.https:\/\/windows10.help\/blogs\/entry\/54-how-to-su...The only likely option would be downgrade to a previous version such as Windows 10 1809.You can download it at: https:\/\/uupdump.ml\/selectedition.php?id=48dd563...Step 2: create a bootable copy https:\/\/answers.microsoft.com\/en-us\/windows\/wik...Step 3: perform a custom install http:\/\/answers.microsoft.com\/en-us\/insider\/wiki...Step 4: how to recover your files from Windows.old: https:\/\/answers.microsoft.com\/en-us\/windows\/for...Windows Update might attempt to upgrade to Windows 10 1903 again. See instructions how to block it:https:\/\/www.groovypost.com\/howto\/block-windows-...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Information in the above link is sourced from a trusted Microsoft MVP blog. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Same issue for me. All our Panasonic Toughpads have Mobile\/Cellular turned off when booting up by default. Only way to turn it on is enabling Flight-Mode, then turning it off. After that the Mobile tile turns on. Really annoying and it is only with Windows 1903 update. Rolling back to 1809, it works fine. Definitely a Microsoft update issue.","It's definitely a Windows issue, we're seeing the same issue with both Sierra Wireless modules and Quectel.We're in a bit of a panic mode at the moment, as I read a news article yesterday that Microsoft are forcing 1903 at minimum on all users at the end of this month, leap-frogging 1809, which is what we are currently using to get around this problem.Ideally we would be using an up-to-date version of windows, but compatibility is proving to be a huge issue with USB Modems at this point.","Hi Andre,Thanks for your post, apologies for taking so long to get back to you.I did submit a bug report within Windows itself, but no URL was offered to me. Is there another way of doing this?For now, we've had to keep with our 1809 install, but we've recently read that Microsoft are planning to force 1903 on all users due to 1803 being end-of-life and choosing to leap-frog 1809.This is a massive problem for us.Is there anyway to contact Microsoft directly for support with this issue?","This is a definite bug.  We are having it with anything we update past 1809  wich is sad."]},{"symptom":"Windows apps not working;: edge, wifi list, start menu, settings won't open        after the last update released in November. I downloaded The media creation tool and I made a flash drive installer with this version.  I have witnessed certain problems It has already happened to me in 4 Laptops that after installing the windows, connecting it to the Internet and checking for updates. Windows apps stop working: Start menu does not open Wifi list does not open Microsoft edge does not open Microsoft store does not open Settings does not open I already tried some repair methods through Power Shell but it still doesn't work. The most curious thing is that after what I do a clean installation (deleting partitions).  Just before connecting to the Internet and checking for updates everything works perfectly and after performing updates and restarting they stop working. This happened to me on an HP Elitbook i5 6th Gen, 8GB RAM, 250GB SSD. Dell latitude e5470 and e5490. With the same problem. I went to several restore points before the updates and they still don't work. I do not know what to do. Also try to make a new flash drive installer and the same thing happens","solutions":["Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.Please try the following steps.1. Launch Task Manager by pressing Ctrl+Shift+Esc on your keyboard.2. Click File, then select Run New Task from the drop-down list.3. In the dialog box, type “powershell” (no quotes), then click OK.4. On the taskbar, right-click PowerShell, then choose Run as Administrator.5. Inside the Command Prompt, paste the following text:Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register “$($_.InstallLocation)\\AppXManifest.xml”}6. Hit Enter, then wait for the command to complete.7. Restart your computer."]},{"symptom":"What is the difference between Hotmail account and Microsoft account in People App on Windows 10?        My PC runs Windows Pro 10 v. 1909. The People App is configured with two email accounts:My Hotmail email address.A Gmail address.I synchronize it with my smartphone (running Android 9) without a problem.I noticed yesterday the following problem: a contact I had added on my PC didn't show on my smartphone in spite of the synch between the devices working fine. I looked at that contact (on the PC) and it showed that it was recorded in my \"Microsoft account\", while the other contacts are in my \"Hotmail account\" (and\/or Gmail one). But when I look at the parameters of the People app, it just shows two: one labelled Hotmail, the other labelled Gmail. On the other hand, I just noticed that when I am about to add a contact to the People's app, it offers three possible accounts: Microsoft, Hotmail and Gmail.What is this \"Microsoft Account\"? I looked in the Parameters of the PC, and it indeed mentions a \"Microsoft account\". When I click on it, it opens a Web page (https:\/\/account.microsoft.com\/?ref=settings&Platform=Windows10) showing... my Hotmail account. Yet when I look at the contacts of my Hotmail box (via the Web), that contact added to the \"Microsoft account\" doesn't show up.As far as I can see, both the Hotmail and Microsoft accounts have the same email address, yet they are different. How do I get rid of this problem - moving the contacts that may have entered the People app through the Microsoft account to the Hotmail ones, and stop having this Microsoft account be the default?Thanks!","solutions":[]},{"symptom":"My screen brightness slightly dims when I unplug the charger.        I have the HP Pavilion Laptop and I have gone through all the settings and tried to find a way to change the setting to 100% brightness while plugged in and unplugged. Nothing new has been put up about it since 2018, which was said then to go into 'enable adaptive brightness settings', but there is no longer that option. I have turned power saver on and off and still nothing.I have gone into regular battery settings, control panel power plans and still can't figure out if I am able to change it or it is just supposed to be like this.The laptop is fully updated.","solutions":["Hi Tiana-Shae There are only two settings in Windows that affect brightness on battery Power: Disconnect your laptop from the mains Click the Notification icon at the bottom right of your screen, then make sure Brightness is set to your preferred settingClick the Battery icon on your Taskbar, set Power Mode to Best Performance Those are the only two settings that should be causing dimming when you are on battery power . . ."]},{"symptom":"Can we install Windows 7 dual boot on Windows 10 laptop with GPT partition        Can we install Windows 7 dual boot on Windows 10 laptop with GPT partition","solutions":["Hi Aakash The 64bit version of Windows 7 does support booting on a GPT disk, the 32bit version of Windows 7 does not, so yes you can dual boot Windows 10 and Windows 7 on a GPT disk . . ."]},{"symptom":"CD'S AND DVD'S        MY COMPUTER CAN    NO LONGER PLAY DVD' OR CD'.  WINDOWS 10, 64 BIT","solutions":["Hi Frank, does your CD\/DVD presented in Device Manager? In Disk management? How long ago you could play disks? What happened in last days? Is your CD\/DVD drive internal or external?","WELCOME TO THE CLUB.","I SEE DISK DRIVES ,NOT CD OR DVD'S. it's BEEN LIKE THIS FOR MONTHS","INTERNAL DRIVE","Please try factory made CD and factory made DVD - will you see their content in explorer?Can you try drive on another PC? These symptoms may mean drive is faulty unfortunately.","I have the same problem. I went as far as to purchase an external DVD player, but it is doing the same exact thing. It just sits and spins but will not load\/play.","GREAT HELP"]},{"symptom":"Updates         I can not get my new computer to update, I've tried restarting it, I've tried typing in this (2019-12 Cumulative Update for Windows 10 Version 1803 for x64-based Systems (KB4530717)) with no luck after following the information on that, and I need it updated to do anything other then the internet. All advice I'm great full for. ","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command promptDISM \/Online \/Cleanup-Image \/RestoreHealthRun these commands on the command prompt to restart windows update servicesnet stop bitsnet stop cryptsvcnet stop wuauservnet stop msiserverRen C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.old net start bitsnet start cryptsvcnet start wuauservnet start msiserverAfter successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartThis should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","Alright ill give that a try thank you!","Fingers crossed!","The first way didn't work so I'm now trying the 2md way.","Alright. Please do keep me posted."," I can not get my new computer to update, I've tried restarting it, I've tried typing in this (2019-12 Cumulative Update for Windows 10 Version 1803 for x64-based Systems (KB4530717)) with no luck after following the information on that, and I need it updated to do anything other then the internet. All advice I'm great full for. "," I can not get my new computer to update, I've tried restarting it, I've tried typing in this (2019-12 Cumulative Update for Windows 10 Version 1803 for x64-based Systems (KB4530717)) with no luck after following the information on that, and I need it updated to do anything other then the internet. All advice I'm great full for. updates windows 10"]},{"symptom":"Upgrade or new install - windows 7 pro to windows 10 pro        I have several work computers that have windows 7 pro.  Should I do a full version install or just upgrade?  They are mainly used for our electronic medical records that we access through a vpn.   I'm trying to go the cheaper route however I don't want to regret it down the road.  Purchasing 1 full license for each of the computers would be a hefty expense.  Thoughts or suggestions?Matt","solutions":["Hi Matt, Thank you for writing to Microsoft Community Forums. I understand your query related to upgrading work PC’s to Windows 10 Pro. One of the most common methods to move from one version of Windows to another is by doing an upgrade. The major advantage of doing an upgrade is that you don't have to format your hard drive. The new operating system will simply replace your previous installation, and you'll be able to keep all of your files and programs. This process takes the least amount of time.By performing a clean install of Windows, there are many advantages. Clean install is an opportunity to start fresh from scratch without any trial software that might have come preinstalled with your system. You will also regain control over your apps, as you can now install only the applications you need. However, since you are connected to an organizational network, you can get in touch with one of a trusted Microsoft Solution provider for better assistance in upgrading from Windows 7 to Windows 10. You can find a solution provider fromhere Regards,Prakhar KhareMicrosoft Community – Moderator"]}]}