{"windows":[{"symptom":"Minecraft problems        I bought 2 Minecraft accounts for my daughters on my Microsoft account. The girls are now having problems. How can we fix this please","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.To help with your issue could you give a little more detail on what problems you are encountering?Regards, Ross"]},{"symptom":"USB 3 ports no longer support external hard drives after upgrading from Win 7 to Windows 10        I used the free upgrade tool yesterday.I can use the drives in USB 2 ports, but nothing is recognized in USB 3. Theres nothing showing anywhere, 'MyPC' 'Device Manager' or even 'Disk Manager'.My keyboard and mouse can run from the USB 3 ports but not the drives? I've tried every tutorial i could find for 8 hours yesterday trying to rectify the situation. Last night i read that if the devices are plugged in during the upgrade then they wont be recognised. So i rolled back to Windows 7, where their still recognised, unplugged the usb external drives and upgraded again.Still the same problem. So whats going on?? The drives work in the USB 2 drives, and the keyboard and mouse work in the USB 2 and 3 drives? Anyone got any ideas on what to do, as the only option i see after today is a permanent rollback to win7 as i wouldn't want to risk a fresh clean install.My specs are:Asus P9X79 Pro motherboardIntel i7 3860 @ 3600ghz2047MB NVIDIA GeForce GTX 670 (EVGA)16gb DDR3 ram","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.It sounds like it may be a driver issue, the USB controller is likely embedded onto your motherboard. I would suggest checking the Asus support site for update drivers for your motherboard model.Regards, Ross"]},{"symptom":"How To Remove Old Unwanted E-mail Contacts             .  I have a few old unwanted e-mail contacts in Windows 10 Peoples app. I also get the same Contacts addresses showing in the drop down menu in the Mail app when typing in a name.  I can find no way to delete the contact in either app.I get the following message when I click to edit.You can*t change recent contacts on your device.But you can add details on their contact card.I have never used this e-mail address in years.","solutions":["Both Mail and People only read the data from the respective email accounts depending on which account is set in the app.Open People and select Settings (the gear at the top of the app window) under Accounts which account is shown. Is it the one you expect, is there more that one. Which ever account it is will be the account it reads from the contacts from. The same applies to the mail app.If you are using a Microsoft account in Mail then you should see the same info in a web browser as you see in the app.You can also go to Apps and Features and reset People. Right click Start and select Apps and Features scroll down to People and select Advanced. Scroll down again and select Reset, all the data will be removed from the People app and will be read in again from the account. Perhaps the database in the app has become corrupt and it need to fresh read what is on you account."]},{"symptom":"Upgrade from Window 7 to Window 10        Sir\/Mam,I want to switch from window 7 to window 10. I have key for window 10 but I dont know froom where i can download window 10 online & install on my PC. Please guide & share link to download window 10.Regards,Manish Kumar","solutions":["my sister says some iso media windows 10 on the internet are not fully secure is this true and that it is best to buy a license of win 10 to install ?????? ...answer this question for us all that ponder microsoft ! .. of the online security .... your thoughts ?from philipp.s manish try youtube ! theres plenty on there .","You don't say where you bought it from.https:\/\/www.microsoft.com\/en-us\/howtotell\/Shop.aspx Read Section: Beware of Product Keys sold separately.  @@@@@@@@@@@@@@@@@@@@@@@@@@@@@Use the Windows 10 media creation tool on the Software download page \"Start fresh with a clean installation of Windows 10\"https:\/\/www.microsoft.com\/en-us\/software-download\/windows10startfresh\"How to Clean Install Windows 10\"http:\/\/www.tenforums.com\/tutorials\/1950-windows-10-clean-install.html_______________________________________________How to Create Bootable USB Flash Drive to Install Windows 10 fromThis tutorial will show you how to create a bootable USB flash drive that can be used to installWindows 10 with or without UEFI.________________________________________________To access BIOS\/UEFI - UEFI\/EFI configuration:https:\/\/neosmart.net\/wiki\/boot-usb-drive\/_____________________________________\"Activation in Windows 10\" (Digital entitlement)https:\/\/support.microsoft.com\/en-au\/help\/12440\/windows-10-activationCheers.","Firstly I dont know what type of win 10 the free download is  .. ? The win 7 ultimate,  It was put on my machine when specifically built ..This win 10 could clash with a photography software that I own lightroom and photoshopIf I may pay monthly in the future for both so I get a different lightroom.. and pshttps:\/\/helpx.adobe.com\/uk\/photoshop\/system-requirements.htmlhttps:\/\/helpx.adobe.com\/lightroom-classic\/system-requirements.htmlEarlier version will have specific requirements also.Ive had some great discussion in lightroom groups , Helps give some thoughts I've done some thinkingMy computer specs meet the running of win 10 pro .. so should I just jump in ahead and be safe,   research..   lightroom and photoshop at adobe ..If needs be .. or online, YouTube. Specs .. my computer has high specification because of my editing and photography","These are not chat rooms.You start your own thread here.","My computer specs are : Intel core r5.9 tm I5-2500Cpu@3.30ghz- 3.60ghz16ram64-bitramService pack 12Tb hd 2tb internal backup"]},{"symptom":"Emoji popup stopped working        Ctrl+; no longer works. Ctrl+< also no longer works. Just simply nothing happens, no matter how many times it hit it. And no matter where the caret is.This problem has occurred intermittendly months ago as well, and has been reported. Why is it not yet fixed?It doesn't seem like rocket science to popup a bloody emoji menu.Also why is there never a suitable \"Windows topic\" on this forum.","solutions":["Hi Thanatica and thanks for reaching out. My name is Joseph. I'm an independent adviser. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by a Windows Support, so it is safehttps:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this helps. Feel free to ask back any questions and let me know how it goes. I will keep working with you until it's resolved.Thank you!","One of your other threads on same topic:Emoji popup stopped working Last reply June 6, 2019 byTheLegs |Created May 17, 2019 by Thanatica ","Joseph, thanks for lookup that up for me.Honestly though, I don't want to juggle around with registry entries just to get something to work, that should have worked in the first place. Microsoft should fix this, it's their software and their feature. How hard can it be??"]},{"symptom":"Activation issue on Windows 10        My PC recently started asking me to activate windows, I have already had this computer for a few years and windows has always been activated. When I do end up clicking \"go to settings\" to activate windows the settings app opens then crashes.I have tried Win+pause-break to activate windows but it says that it is already activated.How do I fix this problem?***Original title:Windows activation error***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues with Activation issues on your PC. For further clarity on the issue, please respond to the questions below: Are you aware of any changes made to the PC prior to which you weren’t facing this issue?How did you obtain the License of Windows 10?When do you receive the popup to activate Windows?Do you see any error code\/message related to activation? Concerning towards your query related to Settings app crashing, let’s try re-registering the Settings App using PowerShell command and see if that helps. Press Windows + X key together and selectWindows PowerShell (Admin).Accept the UAC prompts.Now type in the following command and hit Enter: Get-AppXPackage -AllUsers -Name windows.immersivecontrolpanel | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register “$($_.InstallLocation)\\AppXManifest.xml” -Verbose}Restart the PC. Once you re-register Settings app, you should be able to access it. In case, it is still crashing try creating a new user account and see if you are able to access Settings. Refer the articleCreate a local user or administrator account in Windows 10 In addition, you may want to refer the article Get help with Windows activation errors Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Not received download email for Minecraft Java Edition        Hello, buy the Minecraft Java Edition on December 24, and I haven't been sent the download email, which is what puts it to help.I wanted to know if it's a failure because of party inges or because the page is failing because I've been waiting 2 days for the mail.A greeting***Moved from: ES-ES******Modified title from: Minecraft***","solutions":["Hello, Elsa,Check Order history to see if the order went through. If it did and you still can't find your item, contact Microsoft Store support.","Hi,Thank you for writing to Microsoft Community Forums.I understand that you have not received the download email for Minecraft Java Edition. Adding toSmittychat.’s suggestions, if you have purchased the game from Mojang, I would suggest you to contact the Minecraft team bysubmitting a request.For more information, see Minecraft TroubleshootingRegards,Nikhar KhareMicrosoft Community - Moderator","Hi, one question, could you pass me Mojang's email? I can't find it anywhere and I would like to contact you.regards","Hi,Thank you for replying.You have reached the Windows Technical Support forums, where we provide assistance for Technical issues related to Windows. However, for any queries related to purchase and orders you can get in touch with the Microsoft Store support team. Alternatively, you can get in touch with the Minecraft expert by submitting a request using the link that I have provided in my earlier response.Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Microphone on headset not being used on PC while webcam microphone is being used instead.        I can plug in my headset in and out now fine, but the microphone is not working. If I plug in the headset into another device, the headset works perfectly fine. When plugging in my PC, the headphones on the headset work, but the microphone is not being used. Instead, the integrated webcam microphone is being used. This is really troublesome and my webcam microphone is very quiet and I would much rather use my headset microphone. When going into recording devices, it only says there is one microphone(I'm not too sure what Stereo Mix is, but it didn't fix it when I enabled it so don't worry about that.)I am not sure why only my webcam microphone is being used, if anyone knows how to help me, please do. Thank you!","solutions":["Did you try all the steps I gave as they address your exact issue. To get the Prompt if you plugged in a headset, it should come when you Update or reinstall the Audio controller and headset drivers in Device manager. Did you perform all steps I gave for Updating, reinstalling and trying older drivers?There are other steps here to get that essential popup back: https:\/\/h30434.www3.hp.com\/t5\/Notebook-Audio\/En...https:\/\/www.dell.com\/community\/Windows-10\/How-g...https:\/\/www.addictivetips.com\/windows-tips\/conf...https:\/\/superuser.com\/questions\/1312119\/enable-..."]},{"symptom":"Windows 10 not detecting HDD but Bios is.        I had 2 HDDs (1st one is - 1TB and 2nd one is - 500 ) installed in my CPUs and wanted to install another one when I plugged the third HDD on my PC, the system didn't detect the new one but also didn't detect my 2nd HDD (500GB), and now I'm left off with my 1st 1TB HDD. I removed the 3rd HDD which I was trying to install... I thought it was some hardware issue, but when I booted into the Bios system, I saw Both of my HDDs, the 1TB and 500GB one, So there is some Windows Software issue it seems, they Disk is not being detected even in Disk Manager. Please provide a solution!","solutions":["The Disk is not being detected even in Disk Manager. Please provide a solution!To illustrate your problem, please open the Disk Manager (diskmgmt.msc), then use snippingtool.exe to take a snapshot of the Disk Manager frame. Save the snapshot to your desktop, then attach it to your reply.","(I:) Is my Flash Drive btw","Could it be that the missing disk is visible in the area right at the bottom of the Disk Manager frame? If not, please poste snapshots of DiskPart and the BIOS display.c:\\>diskpartDISKPART> list disk  Disk ###  Status         Size     Free     Dyn  Gpt  --------  -------------  -------  -------  ---  ---  Disk 0    Online          476 GB  1024 KB  Disk 1    Online         7545 MB  7544 MBDISKPART> exit","Nothing But empty space.Diskpart","I cannot see the BIOS snapshot.","Yes about that, I'm going for my dinner so BRB 😅","Sorry for late reply","Here is what I would do in order to explore the cause of this problem:Open the Device Manager via the Control Panel, then open Disk Drives. You should see all disk drives that are currently connected.Use a Windows USB Repair Disk to boot the machine into Repair Mode. Open a Command Prompt, then run diskpart.exe as before. The command List Disk should list all disk drives.Use the command RecoveryDrive.exe to create a Repair Disk. Do not copy the system files."]},{"symptom":"Windows 10 Update 1909 - after update shutdown extremly slow down        Hi,after the windows 10 update 1909 the shutdown is extremly slow.\/dehade","solutions":["Hi, dehade My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps: Press the Start key and type the word CMD or Powershell, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanup-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/947821...","Hi Jeffrey,i executed the statements. They did not solve the problem.\/Detlev","Check this link, I hope it helps. https:\/\/support.microsoft.com\/en-us\/help\/929135...","With the clean boot option the shutdown is fast again.Is there an option to find out which application\/ service is causing the issue ?\/Detlev","I recommend you log in to Windows 10 again with a user who has administrator permissions and go back to System Settings. Within the Services tab, select the Hide all Microsoft services check box and continue to select the first half of services from the list, click Accept and continue Restart. If after the restart the problem persists, we must repeat the steps with the second half of the services listed. If the problem does not reproduce again, then we must limit the services and repeat these steps until we find the service that generates the conflict.Once detected, we will deactivate the checkbox for the element that causes us the problem so that it is deactivated and does not start automatically with the start of the system and then we can contact the manufacturer of the program to determine if it can solve the problem In this way, once we restart the computer in normal mode, we will be able to detect the original problem, it will no longer reproduce and we can install, uninstall, update or run the program with the service or program deactivated, it would conflict.","I have the same problem, intrduced with 1909.However I have noticed that the problem seems to happen when the computer is shutdown a short time after startup. If it has been allowed to run for some time, shutdown is normal.It is as if there is some Windows process which runs at startup and takes several minutes, and which has to be allowed to finish before Windows will shut down.","I have the exact same problem, a lot of users have the same problem, fortunately i thought i was the only one.","Hi,the shutdown was for me always slow, even after running 30 minutes or an hour.I did a clean install with windows 1909. With this the shutdown is fast again.\/Detlev","I never understood why \"independent advisor\" or \"trusted consultants\" always revert to L1 answers, especially this one.  It is unhelpful and waste of our time.  Clearly, you do not know what you are doing if this is your immediate response to the OP question.","I fixed the problem on my laptop(Asus K501UX).What happened:After updating to 1909, everything began to slow down. Installing the old version of windows, on which everything worked fine before, did not help.Solution:In BIOS reset to default settings."]},{"symptom":"No \"Reset This PC\" option        Reset this PC option missing after replacing hard disk with a Samsung SSD and using Samsung Data Migration software to clone the existing drive.Analysis: using Control Panel -> Computer Management -> Disk ManagementOn original hard disk the WinRE recovery partition was last partition. On new hard disk that partition had moved to first position.Solution:https:\/\/www.tenforums.com\/tutorials\/127060-enable-disable-windows-recovery-environment-windows-10-a.htmlDisplay windows recovery environment information:reagentc \/infoI had to set path to WinRE partition using the command (change harddisk# and partition# to suit your situation):reagentc \/setreimage \\\\?\\GLOBALROOT\\device\\harddisk0\\partition1\\Recovery\\WindowsREThen enable (this automatically sets the identifier):reagentc \/enable","solutions":["Did you go Settings, U[dates, Recovery?  There you should find Reset this PC.","Hi, Thank you for writing to Microsoft Community Forums. For better clarity, it would be great if you can help us with the details requested below: Where exactly are you looking for the Reset this PC option?Were you able to successfully clone the drive?Could you please provide more clarity on, “On original hard disk the WinRE recovery partition was last partition. On new hard disk that partition had moved to first position”?Were you able to get the Reset this PC option by following the steps mentioned in the article provided by you? If you wish to reset the PC, there are multiple ways to do it. You may want to refer the steps mentioned in the articleReset or reinstall Windows 10. However, please reply with the details requested above to help you with the appropriate details. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"How Robocopy copy the folder start with A?        Hi Recently i want to migrate my laptop to my desktop data, and i want to do it batch by batch So it is the below command is the correct command to copy the folder name start with Arobocopy C:\\Users\\xxx\\ a*.* \/S ?MIR Z:\\Users\\xxx\\ \/COPY:DT \/DCOPY:TThank You","solutions":["Hi there! I'm Steve, an Independent Advisor and a Windows user like you. I'm happy to help with your query.Based on the options you've defined the command you'll need will be: robocopy C:\\Users\\xxx\\ Z:\\Users\\xxx\\ a* \/s \/mir \/copy:DT \/dcopy:T Before starting the robocopy I would recommend to take a look at the following support article to confirm the options you want to use are correct:https:\/\/docs.microsoft.com\/en-us\/windows-server... Please let me know if I can be of any further assistance!"]},{"symptom":"Upgrade from Windows 7 to 10        Need a procedure for updating my home PC from Windows 7 to Windows 10. E-mail app to use? Using Windows Live Mail. How to migrate and not lose retained E-mails. Browser bookmarks migration? Should I migrate E-mail to Outlook before I upgrade Windows?***Modified title from: Windows 10 upgrade***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I appreciate your interest in Windows 10. I understand that you want to upgrade your computer from Windows 7 to 10 and want to keep all your data. I’ll help you with all the details. Before upgrading the computer to Windows 10, we need a valid license and computer running with Windows 7 Service Pack 1. For more information, seeWindows 10 system requirements. We would also like to know the make and model of the computer.  To upgrade to Windows 10 you can use the Media Creation tool. Visit the websitehttps:\/\/www.microsoft.com\/en-in\/software-download\/windows10 and click on Download tool now. Once the tool is downloaded, refer the steps mentioned in the articleHow to perform an In-place Upgrade with Windows 10 Step-by-Step Guide byPaulSey… Doing an in place upgrade with Keep files and apps option will not remove any data or applications from the computer. However, you can still take a backup of your favorites\/bookmarks. Refer the steps mentioned in the articleMove Internet Explorer favorites to a new PC. Ideally, the email account syncs all the emails to the server and you can access them from anywhere. Windows 10 comes with an inbuilt email client named Windows Mail app. To setup email in Windows Mail app, refer the article onSet up email in the Mail app for Windows 10. For additional information, see Upgrade to Windows 10: FAQ. Let us know if you need any further assistance, we will be glad to help you further. Regards,Nikhar KhareMicrosoft Community - Moderator","You may find Windows Live Mail doesn't work in Windows 10, it is not supported.When the upgrade has completed if WLM is still working all your emails will be in place as they were in Windows 7. Windows 10 Mail app is the default for reading mail in Windows 10.As with any upgrade you need a backup of your personal files, this includes all Documents, Pictures etc. to be sure you can recover if something goes wrong. As far as WLM is concerned there should be and option to export all mail and contacts in the File menu. Be aware these cannot be imported into the Mail app, that function does not exist, however your mail should still be available from your mail provider via their website. Are you using a Microsoft account for mail or another.You might want to consider Thunderbird Mail which can import files from the WLM backup file.Also be aware you officially need a new licence for Windows 10 as the free upgrade period was only 2015 to 2016, but other users have found Windows 10 will activate automatically after the upgrade. If this is the case you need to keep your Windows 7 licence key for the future.","Hi,Thank you for writing to Microsoft Community Forums.I appreciate your interest in Windows 10. I understand that you want to upgrade your computer from Windows 7 to 10 and want to keep all your data. I’ll help you with all the details.Before upgrading the computer to Windows 10, we need a valid license and computer running with Windows 7 Service Pack 1. For more information, seeWindows 10 system requirements. We would also like to know the make and model of the computer. To upgrade to Windows 10 you can use the Media Creation tool. Visit the websitehttps:\/\/www.microsoft.com\/en-in\/software-download\/windows10 and click on Download tool now. Once the tool is downloaded, refer the steps mentioned in the articleHow to perform an In-place Upgrade with Windows 10 Step-by-Step Guide byPaulSey…Doing an in place upgrade with Keep files and apps option will not remove any data or applications from the computer. However, you can still take a backup of your favorites\/bookmarks. Refer the steps mentioned in the articleMove Internet Explorer favorites to a new PC.Ideally, the email account syncs all the emails to the server and you can access them from anywhere. Windows 10 comes with an inbuilt email client named Windows Mail app. To setup email in Windows Mail app, refer the article onSet up email in the Mail app for Windows 10.For additional information, see Upgrade to Windows 10: FAQ.Let us know if you need any further assistance, we will be glad to help you further.Regards,Nikhar KhareMicrosoft Community - Moderator I've done exactly this and my USB 3 ports no longer support USB 3 external hard drives, but still support USB 2 kindle, keyboard and mouse. Would you have a clue whats going on?"]},{"symptom":"Windows 10 BSOD \"ntoskrnl.wrong.symbols.exe\"        Hello there,I am getting this failure partially 3 times a day. I don't know how to fix this issue.https:\/\/1drv.ms\/u\/s!AptZ5XGyMi5NatRicpGcxDkd61I?e=8MHFaK","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing Blue Screen of Death on your PC. For further clarity on the issue, please respond to the questions below: Which build version of Windows 10 are you using currently?Are you aware of any changes made to the PC prior to which you weren’t facing this issue?What is the make and model of the PC? Refer the article Which version of Windows operating system am I running? Based on the dump files that you have shared the issue seems to be with RAM. However, I would suggest you to follow the suggestions mentioned below and see if that helps. Method 1: Try booting the PC in Safe Mode and see if the PC crashes. Refer the articleStart your PC in safe mode in Windows 10 In case the PC is not crashing in Safe Mode then try booting the PC in Clean Boot and see if everything works fine. Refer the articleHow to perform a clean boot in Windows Performing a clean boot will start the computer with minimal set of drivers and programs, to determine whether a background program is causing the issue. Some of the Startup programs will not load after performing a clean boot on the computer. However, that functionality will return when you reset the computer to start normally after finishing the troubleshooting. If the PC doesn’t crash after performing Clean Boot, then please refer the sectionHow to determine what is causing the problem after you do a clean boot to identify the root cause of the issue. Note: Please refer the section Reset the computer to start normally after clean boot troubleshooting to boot the computer in to normal mode after troubleshooting Method 2: Run the Windows Memory Diagnostic tool to check for RAM issues.  Press Windows + S keys together to openSearch.Now type Memory and click on Windows Memory Diagnostic.Click on Restart now and check for problems.Follow the on screen instructions Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Cannot Update Windows 10 1903 Because Of Realtek Driver        Hi! I've been trying to update my windows 10 for a while since its reached end of service (and I can no longer stream with audio to my friends on discord)It goes almost completely through the process and then says I need to fix the Realtek Bluetooth Driver. However, it doesn't appear in my device manager, I've tried multiple times to find it, I tried installing a new driver that never popped up. When I go to uninstall things, the only things that are there are \"Realtek Card Reader\", \"Realtek Ethernet Controller Driver\", & \"Realtek PCI-E Wireless Lan Driver\".I have tried previous posts' (that are closed) solution to install two new drivers but Nothing happened and Realtek still isn't in my device manager.I'm on a Lenovo Thinkpad laptop, but I couldn't tell you which one off the top of my head (I received it in 2017 for my HS graduation, but it was kinda older then too)Please help ;A;","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues while installing Windows 10 1903 on your PC. For further clarity on the issue, please respond to the questions below: What is the exact model of the PC?Which additional drivers have you tried installing on your PC? Meanwhile, I would suggest you to refer the article Updating to a new version of Windows 10 on devices with some driver versions for Realtek Bluetooth radios and see if that helps. Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"chyba stavu 0xc000012f\"        Odstránenie chyba stavu 0xc000012f\"","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I see that you are looking for Slovakian language support. I would like to inform that you have reached the English support forum. For better clarity, we would appreciate if you could post your query in English. However, upon translating your query, I see that you are receiving an error 0xc000012f. For better clarity, please let us know: When are you receiving this error?Which build version of Windows 10 are you using currently? To check type:winver in the search bar on the Taskbar and hitEnter. You may also want to get in touch with our Live Technical Support team by calling them. Please refer the articleGlobal Customer Service phone numbers to get the Customer support number as per your country. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Issue regarding Taskbar icons        I have been having a problem with my taskbar icons recently. Whenever I right click on things like file explorer, it will show File explorer, unpin from taskbar, and my the recent 20 files I opened. It wont show the files and will instead show file explorer and unpin from taskbar. Under that it blank and shows a part of the screen which would be covered if my recent 20 files showing up. I dont know if this is a glitch or virus or anything of the sort and I need help with it.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query related to Taskbar icons not showing properly on your PC. For further clarity on the issue, please respond to the questions below: Which build version of Windows 10 are you using currently?Are you aware of any changes made to the PC prior to which you weren’t facing this issue?Does this happens only with File Explorer or any other icon on Taskbar? Refer the article Which version of Windows operating system am I running? Meanwhile, I would suggest you to follow the suggestions mentioned below and see if that helps. Method1: Try re-registering Taskbar using PowerShell command and see if that helps. Press Windows + X keys together and click onWindows PowerShell (Admin).Now type in the command and hit Enter:Get-AppxPackage -AllUsers Microsoft.Windows.ShellExperienceHost | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart the PC. Method 2: Try changing the Settings for Recently opened items. Press Windows + I to openSettingsNow click on Personalization and click onStart.Under Show recently opened items in Jump Lists on Start or the taskbar and in File Explorer Quick Access. In case the problem persists, try creating a new user account and check. Refer the articleCreate a local user or administrator account in Windows 10. Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Upgraded to Windows 10 from 8.1 & can't login        I just finished installing Windows 10 from 8.1. The install was successful with no errors.I am on the login screen, I input the correct password, it says Welcome like it is starting to open, then goes back to the login screen. This loop repeats itself indefinitely.I tried the troubleshoot, advanced options, startup repair, and it did it's thing and went right back to the login loop.What can i do? Please help!Update:  I rebooted in safe mode and it did some updates for 15 minutes or so, then safe mode booted up.  I backed up a few important files, then restarted in normal mode and everything went fine.  Weird.  Guess those were some important updates.  Just thought I'd update in case anyone else ever has this problem.","solutions":["Are you using a MS account or a local user account. It does sound like the upgrade didn't quite go right.At the sign-in screen in the bottom right hand corner you should see a power icon. Select that and hold down Shift and select Restart. You should go to a Diagnostic mode that shows the Troubleshoot menu.At the Troubleshoot menu select Advanced options and then see if you can enter Safe Mode via the Start-up Settings item.","That's exactly what I ended up doing.","Does your normal account sign-in okay now, do you still have problems.?"]},{"symptom":"Windows 10 CAPS lock function only changes if changing application focus        We have a new Dell Laptop; Windows 10. I am not sure when this issue started (out of the box or after 3rd party apps installed).There is an issue with changing between upper and lower case using the CAPS lock key. The key works, in that the light comes on, but in whatever application is focused at the time, the text does not change to upper case. If you click focus away and then back to the application, the text is now uppercase. This is the same if typing in uppercase and then changing to lower case.Some testing done;Bought up on-screen keyboard. Pressing the physical CAPS lock key (cycling) has the on screen keyboard correctly toggle the caps lock state.If you were in lower case and changed to upper case, typing on the hardware keyboard remains in lower case, however type by using the on screen keyboard has text in uppercase.The shift button has text displayed correctly as upper case.Plugging in an external USB keyboard results in the same, incorrect behavior.It clearly appears to not be a hardware issue, but something software related. Has anyone any idea why the change in CAPS lock state only registers if you focus away from and then back to the application being used? This is the same for Windows search box, notepad, and command line.","solutions":["Unable to find a reason for the issue we reset the laptop back to factory which resolved the issue. As we now set about re-installing the apps, we continually check to see if the issue occurs again. We will post further if it happens again and thus can isolate the reason"]},{"symptom":"Windows 10 repair mode password reset        I turned on my computer and it got stuck on windows loading so I went to the windows repair mode and entered my password (Microsoft linked account), it said it is incorrect. I went to my account and changed it from my phone (since my computer is not loading) and tried again and it's still not working. I am assuming my computer doest update the password changes if it is not fully \"up\"? I can't load my computer or reset my windows now since I can't change my password. Is there anything I can do now? ","solutions":[" Hi, Thank you for writing to Microsoft Community Forums. In order to get clarity and to assist you accordingly, please reply with the answers to the questions below. What is the Windows 10 version and Build installed? (Type winver in Windows search\/Run command)How did you go to windows repair mode?Are you able to go to the Windows login screen? Create a bootable USB using another PC and perform a startup repair on the computer. Refer the articleCreate a bootable media to create a bootable USB. You need to change the first boot device in the BIOS. Boot the computer using bootable USB.On the Install Windows screen, select Next >Repair your computer. On the System Recovery Options screen, select Troubleshoot> Advanced options > Startup Repair.Restart the PC. Note:Modifying BIOS\/ complementary metal oxide semiconductor (CMOS) settings incorrectly can cause serious problems that may prevent your computer from booting properly. Microsoft cannot guarantee that any problems resulting from the configuring of BIOS\/CMOS settings can be solved. Modifications of the settings are at your own risk.   To address your query, yes you need to load the PC to the Windows login screen and need to be connected to internet. Then the password will update on the PC. Regards, Aditya RoyMicrosoft Community – Moderator"]}]}