{"windows":[{"symptom":"Change Window Explorer Font Size        Hi I want to change the font size of Windows Explorer without changing System font size. I googled it and the only solution I got is To Go to Ease Access=> Make Text Bigger. The problem is, this makes every font size[System Font Size] big and I don't want that. I just want Windows Explorer font bigger. Is there any solution?","solutions":["Hello, Vien11,Method 1:View the steps in this tutorial for changing the default System Fonthttps:\/\/www.windowscentral.com\/how-change-default-system-font-windows-10Method 2: Settings > Ease of Access > Vision > Display > Make text biggerSettings > System > Display > Change the size of text, apps and other items (adjust text size).","Hello vien11, I am Matt, an Independent Adviser and a specialist technician. I would like to assist you with this and hopefully I can help you to resolve this issue promptly.Unfortunately windows explorer does not have font size settings built in that allow you to adjust the size of fonts inside it. You can use system scaling in display properties which you already know changes more than just explorer.It may be possible to change this via a registry setting however that would not be advisable.You could also look into some 3rd party software such as \"Alternate Font\" that allows you to customize certain areas of windows with different fonts etc. I am unsure if it will do exactly what you require though.https:\/\/www.ghacks.net\/2018\/06\/23\/customize-fon...I know this isn't the answer you was looking for unfortunately. Best of luck finding a solution. I personally find the windows scaling feature great and easy to turn on and off when required. I run my Surface Book at 125% mostly but sometimes up it to 150% when using some software. I know you mentioned you have tried this but for others that may read this you just...Right click on desktop and select \"Display Settings\" then change the Scale setting as required. And doing this is much more advisable over 3rd party software or modifying registry or system files.Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.Kind Regards, Matt Horsley","Hi I want to change the font size of Windows Explorer without changing System font size. I googled it and the only solution I got is To Go to Ease Access=> Make Text Bigger. The problem is, this makes every font size[System Font Size] big and I don't want that. I just want Windows Explorer font bigger. Is there any solution?I use a downloadable program called A+ Font Size Changer.  It's limited, only 6 selections, but it's changed settings for me that are similar to what you're describing.Marymack23","Hi Vien11 My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help answer your question.Matt's repsonse is correct and you will need a 3rd party tool to do this such as \"System Font Size Changer\" by WinTools which can be found herehttps:\/\/www.wintools.info\/index.php\/system-font... or this can be achieved by editing the registry.https:\/\/www.tenforums.com\/tutorials\/19768-chang...There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it. Hope this helps."]},{"symptom":"Surface Laptop 3 Screen Randomly turns black        The screen randomly turns black, though the back lit keyboard remains on. To fix this issue i must force shut down the laptop, though the moment it turns off it makes a pop sound. This happens every few hours and i have noticed no trend\/trigger to this issue.  Really inconvenient as it closes all apps, especially frustrating when using word and all progress is lost.  Any solutions or similar problems please let me know ASAP.Thanks","solutions":["Hi, Driver_J My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps: Press the Start key and type the word CMD or Powershell, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanu p-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/929833..."]},{"symptom":"Not Able to Install Windows Updates        Since end of October, I have not been able to install updates.  I have experienced IE not opening.  WIndows Store and other apps not opening (have tried reset.  Cant download Office 2019 (wont finish gets to 56%.).  THe biggest thing is it will not update with latest updates.  I have tried resetting my computing (no go).  Tried the SFC scan now.  It would not scan.  The Updates will download but will not install.  I have tried resetting the windows components, running the trouble shooter.  Sounds like something is missing.  Not sure what to try next.  THanks for any help.  I have compact Presario envy computer.  Latest build I am on is 1903.  Would not upgrade to the latest build 1909.  Laura","solutions":["Hi, LCraft1055 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.If you have problems updating Windows, follow these steps: If you have a third-party antivirus, you must disable or uninstall it. Try reset Windows update components: Right click on the start button and select Powershell (admin) or Command Prompt (admin)Write the next hit enter after each line. net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Restart and try again. You can also download the Windows Error Solver: https:\/\/support.microsoft.com\/en-us\/help\/10164\/...https:\/\/aka.ms\/wudiag You can do it manually by downloading the Windows ISO. When updating with the ISO, disconnect the Internet. https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"slow pc but only on one user        so for the last few months i haven't been using my admin account on my pc because everytime i log into it i can't do anything on it, the user is extremely slow and all of the programs too so i can't anyone of them, so i have been using a limited user account since last summer, the problem now is i don't have anymore space on my hard drive and my admin account occupies at least half of it (500gb), so i wanna get read of the account or at least, not make it slow anymore so i can uninstall the unwanted programs. so please how can i fix this issue ?(sorry if there is any errors, english is my 3rd language)","solutions":["Hi Jo2uke7651 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.A possible reason for the User setting is taking longer to get to the Desktop, which could be due to the number of programs that they have to get started during startup.1. Open \"Task Manager\", click the \"Startup\" tab and see how many items are listed there. Generally, you can disable all.2. You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...3. Press the Windows key, type in MRT and press enter. [Opens Microsoft Windows Malicious Software Removal Tool] and do a quick scan. 4. Check for an update. https:\/\/support.microsoft.com\/en-us\/help\/402766...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!"]},{"symptom":"bluetooth not working        On booting system I get error message  BT TrayERROR: Unable to start the Bluetooth stack serviceMy Bluetooth headphones are paired but will not connect.  They were working fine a week ago.  I have updated drivers but maybe I have wrong Bluetooth driver?  Any help appreciated","solutions":["Hi, ReallyClang My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to run the troubleshooter for Bluetooth. Go to Settings - Updates & Security - Troubleshoot. Click on Bluetooth under Find and fix other problems. Follow the on-screen instructions.https:\/\/support.microsoft.com\/en-ca\/help\/402622...https:\/\/support.microsoft.com\/en-ca\/help\/15290\/...Try to update the Bluetooth drivers https:\/\/support.microsoft.com\/en-us\/help\/402844...","Did you remove the pair and try it again ?","I unpaired, rebooted and repaired my headphones.  I was able to connect.  Thanks for the help.","Troubleshooter did correct an error and I am now able to connect my headphones.  Thanks for the help.","I'm glad you could solve the problem"]},{"symptom":"How can i activate S mode on Windows 10        Hello, do someone know how can i activate S mode on Windows 10?","solutions":["Hi ARTURO, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Did the computer come with S mode enabled? If so, a Factory reset would bring you back to S mode. If not, I am afraid you can not.However, In apps and features select Just install apps from Windows Store only which technically behave as S mode.","Install Windows 10 in S Mode on a Windows 10 PC | Tutorials How to Enable S mode in Windows 10 | Tutorials"]},{"symptom":"cannot find window media player on my computer.  Search reveals nothing        Tried various search means but nothing comes up","solutions":["Hi STANKENSIC check that it is turned on on in windows features click start and type turn windows features on or off and select it from the results click the + next to Media Features select Windows Media Player click Ok click start type wmp and look for windows media player in the results"]},{"symptom":"Media Centre in Win10        I'm a long time Win7 user but seems I need to upgrade. One of my W7 machines is used purely for Media Centre and I want to maintain this.What's the current status on WMC working with W10 ?Thank you","solutions":["Suggest reading:https:\/\/www.ghacks.net\/2018\/10\/08\/windows-media-center-for-windows-10\/Install Windows Media Center on Windows 10, the big recap","Thank you","You're welcome."]},{"symptom":"I can’t fix my PC        Hi im DuoAbout three weeks ago, my PC get crash and I can’t get access into my home screen. Then i download setup program of win10 but i can’t run and I need help!Thanks!Duo","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,What file are you trying to run? Normally the pop up shows up if the application is not compatible with the system architecture\/system type of the system. Make sure that the application has the same architecture as your windows 10 (32 bit or 64 bit).Let me know how it goes. :)","Hi GaryIm trying to run setup.exe ( window 10 setup), i think i downloaded wrong type, i mean my PC run as 32bit but i download the setup is for 64bit so is it the problem?ThanksDuo","That's correct. If your system's type is 32 bit then you'll need the 32 bit of the application as well. :)","Hi GaryThank for your help, im repairing my PC now. My problem SOLVED.Thank you!Duo","My pleasure Duo! Happy to help. When ready please mark the post which helped most as the Answer, to help others. A rating is also appreciated."]},{"symptom":"Desktop freezing        When i start my laptop and the desktop is start after one or two refreshing laptop takes loading but 8-10 min. Or when i chack in task meneger ther is no problem show or heavy application. After 8-10 min laptop run smuthly but in 8-10 min its desktop is not working and mouse courser show loading circle and no application open. It happens every time when i start my laptop. So please anyone can give me solutions.","solutions":["Hi rahullakshkar and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. FIX: Windows 10 Freezes Randomly https:\/\/appuals.com\/fix-windows-10-freezes-rand...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Administrator Email Correction        We are setting up our new computer.  By mistake we entered an email that isn't ours but appears to be owned by someone else.  How can we reset our administrator account with our actual email. Please Help! ","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.You should make a new administrator account, and then from that delete the incorrect one.From the current (incorrect) account go to START > Settings (the cog) > Accounts > Other users. Follow through the prompts to add a new account using your correct email address.Once the account is added select it from the list, choose \"Change Account Type\" and set it as \"Administrator\".Having done that you can sign-out of the incorrect account (Click START > click the profile icon (about 4 icons up directly above START) and choose sign-out. Once back at the Welcome screen choose the newly added account (you may need to click \"Other Account\" at the bottom-left) and sign in to your correct account. Once you are satisfied that's all working you can return to Account > Other users and delete the original wrong account completely.Regards, David","Thank you for response!  We were able to do that. However, the new account has been stuck on pending that change to administrator.  I have to wonder if the email associated with the current administrator account is holding an approval for this change.  ","The setting should change immediately. Try logging in with the new account and check whether it's become an administrator?If not, try restarting the computer (START > power symbol > Restart) and then try changing the new account to an administrator type again.","Thank you so much, David. That seems to have worked!","You're welcome! Let us know if there's anything else. If you don't have any more questions, feel free to choose a rating. Thanks!"]},{"symptom":"Bluetooth Audio issues in Windows 10 using Bootcamp        I Recently installed Windows 10 1909 via Bootcamp on my 2018 MacBook Pro. There is issues with the Bluetooth Audio stuttering. When I open Device Manager it shows the following drivers. I updated Windows fully and also the Bootcamp Drivers. When I try to install the Apple Bluetooth Driver i get a error code 52 saying that the driver isn't digitally signed. Is there a different way I can install the Apple Bluetooth driver. ","solutions":["Hi HF. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See here how to disable Driver Signature Enforcement so you can install an unsigned driver you have other reason to trust:https:\/\/www.howtogeek.com\/167723\/how-to-disable...Set a System Restore point first so you can go back if necessary: http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","After i did that i get a code 10 error after i rebooted. How do i get rid of this error","That can mean the driver is not working. See here: https:\/\/www.lifewire.com\/how-to-fix-code-10-err...","Helloso once i restarted my computer it resorted back to the microsoft drivers. The audio is finally working via bluetooth when just my headset is paired. If i also add my keyboard and mouse via bluetooth with the headset is connected the sound is so choppy its unbearable. Is there any way to fix this issue","If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....If that doesn't work you can also Go Back in Repair Mode as shown here: https:\/\/www.tenforums.com\/tutorials\/2294-advanc...","Good luck on that issue.. I've the same problem on all of my Mac's for over 5 years..Apple will blame Microsoft, Microsoft will blame Apple.. The problem is related to Windows's super ugly bluetooth system and the crappy Broadcomm drivers Apple supplied.. (I've experience on it becauseunfortunately I've been developing bluetooth devices) The solution: Stop using Windows or buy a Windows laptop and have other bag of issues as well, use a wired headphones.. I could not decide which one is better.."]},{"symptom":"Blue screen errors being caused by hal.dll & ntoskrnl.exe        I have been getting countless blue screen errors and from using bluescreenview it is pointing me to hal.dll & ntoskrnl.exe as the causes. I have looked all of the internet for a solution and used all the software i know to fix the issue and even reinstalled windows but i am still getting the same issues. Every test I have tried has said there are no problems with my hardware. So I am hoping someone is able to read the crash dump and help me figure out what the issue is. Thank you in advance for any help.I do have a crash dump which you can find here: https:\/\/1drv.ms\/f\/s!AomEZQHXrPVKlRAIMbMF2beexb6ZWhat bluescreenview has said for my last two blue screens.Dump File: 011120-14187-01.dmpCrash Time: 11\/01\/2020 01:37:24Bug Check String: IRQL_NOT_LESS_OR_EQUALBug Check Code: 0x0000000aParameter 1: 0000000f`ffffffffParameter 2: 00000000`00000002Parameter 3: 00000000`00000001Parameter 4: fffff804`7c205e4eCaused By Driver: ntoskrnl.exeCaused By Address: ntoskrnl.exe+1c14e0File Description: NT Kernel & SystemProduct Name: Microsoft® Windows® Operating SystemCompany: Microsoft CorporationFile Version: 10.0.18362.535 (WinBuild.160101.0800)Processor: x64Crash Address: ntoskrnl.exe+1c14e0Full Path: C:\\Windows\\Minidump\\011120-14187-01.dmpProcessor Count: 16Major Version: 15Minor Version: 18362Dump File Size: 1,039,308Dump File Time: 11\/01\/2020 01:38:53Dump File: 011020-13937-01.dmpCrash Time: 10\/01\/2020 18:49:45Bug Check String: Bug Check Code: 0x00000133Parameter 1: 00000000`00000001Parameter 2: 00000000`00001e00Parameter 3: fffff800`6f973358Parameter 4: 00000000`00000000Caused By Driver: hal.dllCaused By Address: hal.dll+4e70File Description: Hardware Abstraction Layer DLLProduct Name: Microsoft® Windows® Operating SystemCompany: Microsoft CorporationFile Version: 10.0.18362.387 (WinBuild.160101.0800)Processor: x64Crash Address: ntoskrnl.exe+1c14e0Full Path: C:\\Windows\\Minidump\\011020-13937-01.dmpProcessor Count: 16Major Version: 15Minor Version: 18362Dump File Size: 5,447,300Dump File Time: 10\/01\/2020 18:50:56My PC Components:CPU: AMD Ryzen 7  3700XRAM; 4X 8GB DDR4 2400mhz Corsair GPU: Gigabyte Nvidia Geforce 1660 TIMotherboard: Gigabyte GA-AB350-GAMING-3Storage: 1TB Samsung 860 EVO SSD, 2TB Seagate barracuda  HD, 1TB Toshiba HD","solutions":["Hi Luke Can you please check to see if your PC has generated any Minidump files, and if so, upload those as a separate download so we can analyze those for you . ..Open Windows File Explorer Navigate to C:\\Windows\\Minidump Zip up the contents of that folder If you have problems zipping those files, copy them out onto your Desktop and zip them from thereUpload the zip file to the Cloud (OneDrive, DropBox . . . etc.) Then post a link here to the zip file, so we can take a look for you . . .","Hi, DaveI have zipped up two of my most recent minidumps and the link to onedrive will be below. Thank you :)Minidumps link: https:\/\/1drv.ms\/u\/s!AomEZQHXrPVKlRXg15OGjGm5sifE?e=ewqBux","Hi, Today I have had two more blue screens and the minidumps will be linked below. Thank you for your help :)Minidumps link: https:\/\/1drv.ms\/u\/s!AomEZQHXrPVKlRZBIPf-ObsaVELs?e=Yxd9tj"]},{"symptom":"screen saver not working and screen not skeeping after 15 minute time set        screen saver not working and screen not skeeping after 15 minute time set, settings to put the computer to shut off at certain time not working ","solutions":["I also have gone through all the possible settings and it is not working ","Hi techchic008 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Hi techchic008, 1. Press the Windows key, type-in \"Settings\" and click Personalization. 2. Click on the Lock screen and click on the \"Screen saver settings\". 3. Select your preferred screensaver. 4. Check the \"On resume, display logon screen\". 5. Click on Apply. 6. Click \"Change power settings\". 7. Click the \"Balance Recommended\" button, click on \"Change Plan Settings\". 8. Power Options dialog box will appear, click on \"Restore Plan Defaults\". 9. Click on \"Apply\" & \"OK\". 10. Then set Turn off display time in the control panel window. (Note: Set the turn-off display time longer than the Wait time for Screen saver).Thank you!"]},{"symptom":"How to Prepare Bootable Install Media for Windows 10 - DVD, USB or SD Card        NOTE: These instructions reference Windows 10, but they work just as well if you want to create a bootable copy of Windows 7 or Windows 8.Technical Level : Basic SummaryIf you performing a new installation of Windows 10, you might need to prepare bootable install media. The Media you choose to install from will depend on certain factors, such as the Boot Scheme used by your computer (BIOS, UEFI) in addition to the storage device (hard disk partitioning layout). Examples of partitioning layout include MBR (BIOS) and GPT (UEFI). In this article, we show you several ways to create a bootable copy of Windows 10 from an ISO file. An ISO file is a digital replica of a virtual disc, which users will have to make bootable on a blank DVD, USB thumb drive or SD card.DetailsBefore we begin, you need to have a copy of Windows 10 ISO file. See the following article for instructions how to download a ISO image for Windows 10 using the Media Creation Tool:How to download official Windows 10 ISO files NOTE: Microsoft no longer provides direct access to Windows 10 ISO images from the Microsoft Techbench website for computers running Windows 7, Windows 8.0, Windows 8.1 and Windows 10. You can still download the ISO image from computers running earlier versions of Windows such as Windows XP, Windows Vista or alternative operating systems such as Linux or macOS.Learn more: Microsoft Removes Access to Windows 10 ISO for Windows 7 or LaterResources: Download Windows 10 ISO Files Directly Using Your Web BrowserAfter downloading the Windows 10 ISO, you need prepare it, this is especially important for Windows 7 and earlier versions of Windows.You can use the built in Disc Image burning tool or Microsoft .iso to USB\/DVD tool to create a bootable DVD or USB (requires a blank DVD) or Rufus, a third party program that can create a bootable USB flash stick (requires at least 8 GBs).After downloading the .ISO file, right click it and click Burn disc imageInsert a blank DVDClick BurnWindows 8\/8.1 users can mount the .ISO file then start the upgrade automatically. Learn morehereImportant:If you are creating a bootable USB thumb drive, make sure the thumb drive is first formatted as FAT32.Connect the thumb driveOpen ComputerRight click thumbdriveClick FormatMake sure FAT32 is selected as the file system.For UEFI based systemsIf your computer is UEFI based, these are normally systems that come pre-loaded with Windows 8 or later, you will need to prepare the ISO file for such a configuration or you will receive an error message during setup. The thumb drive needs to be formatted as FAT32. If you are installing on a hard disks that is 4 TBs or more in size, you need to format the disk using the GPT partitioning scheme. Rufus ensures your copy of Windows 10 is properly prepared to support it. You can download Rufus, for free.After downloading Rufus, connect your thumb drive, launch Rufus application, click in the Device list box then choose your thumb drive.Click in the list box then choose your partition scheme. If you select the ISO, Rufus will automatically select the appropriate options for you. Next, click in the File system list box, then choose FAT32. If your thumb drive is larger than 32 GBs, choose exFAT. Leave the default Cluster size then enter a label for your thumb drive. Click the choose disk image icon, browse to where the ISO file is located, select it then click Open.Click Start to copy the files to the thumb drive. If you have any files on the thumb drive, they will be deleted. Wait while the files are copied to your thumb drive. Close when complete Open File Explorer, then launch setup to begin the installation. If you are performing a clean install see instructions how to configure your BIOS or UEFI firmware:BIOS\/UEFI Setup Guide: Boot from a CD, DVD, USB Drive or SD Card","solutions":["I made the CD\/DVD drive bootable. I have the OEM disc from Microsoft. I should be able to install right from the disk as the instructions imply.","Hello! regarding to the rufus part when I chose the FAT32 on the file system options and after I click start an error would appear with a \"Unsupported  filesystem\" as its name saying The file system currently selected can not be used with this type of ISO. Please select a different file system or use a different ISO.though if its on NTFS, it was able to start","Hey Scynthe,I've have the same thing the last couple days. If I restarted my system and then tried again it would work correctly.Hope it helps.Chris","I can't select the image location described in step \"Click the choose disk image icon, browse to where the ISO file is located, select it then click Open.\"!The Icon is not enabled!How I can choose an ISO File from the File system?","I can't select the image location described in step \"Click the choose disk image icon, browse to where the ISO file is located, select it then click Open.\"!The Icon is not enabled!How I can choose an ISO File from the File system?","Nice! And bootle xD","When I purchased my Acer Aspire | X, I received it with Windows 8.x operating system. I took the opportunity of the free upgrade to Windows X. Just as the 1803 rollback was only available 10 days, I learned after the 30 window that I could have returned to my Windows 8 version. Did the upgrade to over write the system restore files? I am hoping that Windows 8 is still there in the shadows along with the applications and drivers when I received my computer.","I have a Toshiba Satellite laptop with windows 10. I am getting a no bootable device error.I use both the 64 bit and the 32 bit DVD and still says the same thing. I also tried to get tothe BIOS menu and can't get it to come up. Any ideas on how I can get this thing to boot oreven access to something. (BIOS menu or any menu) Not sure why this has happened. Just did a normal restart and this happened. I would be happy to hear any suggestions. ","The described procedure is no longer valid.Windows 10 ISO image inside contains single file larger than 4GB which cannot be copied to FAT32 partition.","I am using Windows 10 64 bit computer (Lenovo)I used to burned iso to an USB drive for reinstall a new system ,so cool (I have never burned CD\/DVD). From : https:\/\/www.iseepassword.com\/how-to-burn-iso-to-usb-drive.html"]},{"symptom":"Account Error When Opening Minecraft: Windows 10 Edition        Hi there, I have been playing Minecraft: Windows 10 Edition, and it has started to act up. I logged in yesterday and was greeted with an account error. I am not able to use the marketplace or play with friends. I am pretty sure this issue is associated with my Microsoft account, but I may be wrong.  Here are the details:Any help would be appreciated! Thanks in advance.","solutions":["My issue has been resolved.","How was it resolved?  I'm getting Error Number 0 now, and I don't know how to fix it.  I can't access the Marketplace until the Account Error goes away.  What did you do to get it resolved?","I've had this happening because of my rubbish internet connection. For some reason the ID isn't there though and the error number is 0. Is there anything that I could do to resolve it because it won't load my account settings so I can't play multiplayer games, chat and sign out."]},{"symptom":"windows 10 pro product key        I have a product key for windows 10 home but need a product key for windows 10 pro, how can I aquire one?","solutions":["Hi Richard The only real option you would have is to install Windows 10 Home, then go to the Settings App - Update and Security - ActivationThen click 'Go to the Store' to purchase an upgrade licence to Windows 10 Pro . ..","I have a product key for windows 10 home but need a product key for windows 10 pro, how can I aquire one?Hello,You need to purchase Windows 10 Pro upgrade via Store:https:\/\/www.kapilarya.com\/how-to-buy-windows-10-pro-upgrade-via-microsoft-storeHope this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP. ","Go straight to Microsoft:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700Cheers."]},{"symptom":"Trying to upgrade from Windows 7 Pro to Windows 10 Pro        When I download to creat the ISO to install windows 10 pro, it will not give me the option to select Window 10 Pro only Windows 10.  When I try to upgrade my Windows 7 Pro, it will only let me upgrade to Windows 10 Home.  I don't want home.  How can I get Windows 10 Pro installed?","solutions":["When I download to creat the ISO to install windows 10 pro, it will not give me the option to select Window 10 Pro only Windows 10.  When I try to upgrade my Windows 7 Pro, it will only let me upgrade to Windows 10 Home.  I don't want home.  How can I get Windows 10 Pro installed? Hello,What Windows 7 you have right now? If it is Windows 7 Home, you can upgrade to Windows 10 Home. Then you need to purchase Windows 10 Pro upgrade via Store:https:\/\/www.kapilarya.com\/how-to-buy-windows-10-pro-upgrade-via-microsoft-storeHope this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP. ","You stated that you are trying to upgrade from 7 PRO:Trying to upgrade from Windows 7 Pro to Windows 10 Pro"]},{"symptom":"Windows 10 Pro        I am trying to activate my windows 10 pro.  I have the product code but don't know where to go to do it.  Currently using windows 8.1 but wanting to upgrade.Thank you.","solutions":["Use the Windows 10 media creation tool on the Software download page \"Activation in Windows 10\" https:\/\/support.microsoft.com\/en-au\/help\/12440\/windows-10-activationCheers.","I am trying to activate my windows 10 pro.  I have the product code but don't know where to go to do it. Currently using windows 8.1 but wanting to upgrade.Thank you.Hello,Your statements are contradicting. Are you on Windows 10 or 8.1 atm?Regards.","1. Currently using windows 8.1 but wanting to upgrade.2 I am trying to activate my windows 10 pro3. I have the product code but don't know where to go to do it"]},{"symptom":"'Try again later. Something happened at our end.'        I have a serious problem. I wanted to install NVIDIA Control Panel, but it gives me error: 'Try again later. Something happened at our end.' I have literally watched every single video about this error and nothing helped me. I'm not sure what could be the problem, maybe some disabled service.Also I have tried installing other apps and it gives me the same error.Has someone had this problem before? How to fix it?Thanks a lot","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,I myself have experienced this issue before, and what I did to gain access to nvidia control panel is to download the Nvidia Geforce Experience. My system failed to recognize my nvidia driver therefore, after downloading the Nvidia Geforce Experience the software detected and downloaded the correct driver for my device and install Nvidia control panel afterwards.Under this link is the download for Nvidia Geforce Experience https:\/\/www.nvidia.com\/en-us\/geforce\/geforce-ex...Let me know how it goes. :)","Unfortunately, it didn't help.","hi i am having the same problem but with every app i can not download anything sometime the app just crashes but sometimes some nothing at all happens.","Hello,See if this fix helps you:https:\/\/www.kapilarya.com\/try-again-later-something-happened-on-our-end-store-app-windows-10Hope this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP."]}]}