{"windows":[{"symptom":"Windows 10 October 2019 Update messes up Chrome Browser        My computer just updated to the newest version yesterday. It is Version 10.0.17763 Build 17763. Right after that when I tried to use the Chrome Browser I started getting slow responses loading pages with a message on the bottom of the page saying \" establishing secure connection\". Some pages would finally load, others just kept spinning. Very frustrating. I tried reinstalling chrome, changing network adapter protocols, nothing worked. I have an AMD FX processor with Radeon graphics card. Many people seem to be having the same problem. I finally got it fixed by visiting different forums. I had to go to services, then scroll to cryptographic services and change to local network. I did this as an administrator when opening the services plug-in. All pages load fast now. My problem is that just now I went to log into services, as an administrator, and it said I was blocked for my protection. How can I get back into the services app? I am the one who changed it, why would I now be blocked? I am so upset. First, the update should never have been released with it messing up Chrome that badly. Second I went to answers on the  Microsoft forum and only users gave the fix, not the administrators. Now I am locked out of my services app. What if I need to change something else? Oh yea, and it took me all of last night and 4 hours today to fix it because I was afraid to change the setting. Some people said changing the service to local network would affect updates in the future. I finally did change it because I was so frustrated with my chrome not working. How can I get back into my services app now that it blocks me? I right clicked run as administrator and still am blocked. This is really messed up.","solutions":["Hi Eldon, I'm Stefano an Independent Advisor, here to help you. Windows 10 1903 has been released, so, before trying anything else, I suggest you to manually update to this version. You can Update to Windows 10 1903 using Windows Update Assistant:https:\/\/go.microsoft.com\/fwlink\/?LinkID=799445Once done, please check if everything seems working well, then check if the problem is solved this way, or if you need help restoring the access to services.","I am afraid to update windows again to be honest after what I just went through. I may try it soon, but just for now could you help me get back into my services app? I would be so grateful. Thank you. I appreciate the quick response.","Well then, First of all, I suggest you to check your account. You have to be sure to be administrator. To check that:1. Press WINDOWS + i2. Click on \"Account\"3. Be sure that under your account info there Is AdministratorThen, please check your filesystem:1. Type \"cmd\" in windows search bar2. Right click on \"Command Prompt\"3. Select \"Run as Administrator\"4. Type \"sfc \/scannow\" without quote and press ENTER Please let me know if that procedure returns errors not solved.","Same issue here.  I have even reloaded windows from scratch twice now and every time that Fall update hits it ruins chrome. I ran the cmd you said above on my system and got this back: Windows Resource Protection found corrupt files but was unable to fix some of them.For online repairs, details are included in the CBS log file located atwindir\\Logs\\CBS\\CBS.log. For example C:\\Windows\\Logs\\CBS\\CBS.log. For offlinerepairs, details are included in the log file provided by the \/OFFLOGFILE flag.","This problem is wide spread on PC's with all the latest updates of Windows 10, using Chrome.The quickest way to solve this is to run Chrome in compatibility mode.  Right click Chrome, go to properties, select Compatibility table and tick run this program in compatibility mode and set to Windows 8.We have found this solves the issue.","Same issue here.  For the past week or so, some pages load properly but others absolutely will not load properly.  \"Chrome unresponsive\" is the message received.  The very worst appears to be Facebook, but other also slow at best.   I'm not 'techy' at all, so there's no way I'm going to start messing with systems settings myself.","Absolutely convinced it's intentional effort to drive us to Microsoft Edge and Bing.  Google should look into this.","Absolutely convinced it's intentional effort to drive us to Microsoft Edge and Bing.  Google should look into this.I think you're right.","Well I left Microsoft Explorer years ago due to so many issues there, and have gotten used to Google over the years, so I'm not willing to switch back now.  I was never a fan of Bing.  Our work IT department originally switched all of us to Bing back in the mid 2000's.  That lasted about a year, and then they switched us all back to Google.","I had to set my compatinility mode to Windows 8 tonight. It seems to have fixed all my issues. Hopefully it lasts."]},{"symptom":"Windows 10 stopped detecting ThinkVision M14 monitor        I have been using a ThinkVision M14 monitor with a USB-C adapter for some time, but it suddenly stopped working a few days ago.  It is not detected by Windows 10 64 bit.  The monitor works fine with a different computer and it will turn out with external power.  I cannot see it in the device manager and the display settings say that it cannot detect another monitor.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are unable to use ThinkVision M14 monitor on your computer. I’ll help you with the issue. However, please let us know: Are you aware of any changes made to the computer recently?What is the make and model of the computer that you are using? As you have mentioned that you are able to use the monitor with a different computer, I suspect it could be an issue with the drivers on the computer. I would suggest you to check for hidden drivers on the computer and try to update them. Refer the steps mentioned below: Press Windows Logo key + X, and selectDevice Manager.Click on View and select Show hidden devices.Expand Monitors and check if there is anyhidden device.If there is any hidden device, right click on it and selectUpdate Driver. You can also install ThinkVision M14 Monitor Driver and see if that makes any difference. Since you are using a USB-C adapter, I suggest you to refer the article onFix USB-C problems. You may also try updating the Chipset drivers from the computer manufacturer’s website and then check if the Monitor is detected. Let us know the results. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"WiFi Driver can't be installed properly        Hi,I need the only network cable I currently have for another device, so I have to use my WiFi adapter on my PC for now. However, I noticed that it's very slow (avg 5 Mbps). My internet connection is actually a lot faster (avg 60 Mbps) and it works fine on other devices and on the PC when using the cable. I checked it in the device manager and it used a very old Microsoft compatibility driver from 2017, so I used the update driver feature and it found and installed a driver from 29\/10\/2019 version 19.51.26.1 but it was still very slow. So I decided to try this most recent driver (21.60.2) from the manufacturer (my adapter is an Intel Dual Band Wireless-AC 3168) but for some reason I can't install it. The installation works fine and it even says that it has been completed successfully (first screenshot) but when I check it in the device manager after the installation it's still the compatibility driver 19.51.26.1 (second screenshot) and it's also still very slow. Does anybody have any idea how I can get it to install the Intel driver properly?","solutions":["Ok go back to the \"device manager\" Right click on this driver Click on properties Go to the \"driver\" tab Click on \"update driver\" Then click on \"browse my computer for driver software\" And now click on \"let me pick from a list avaible dirvers on my computers\" Then see if in the list, the new driver is there? If yes, select it, do next ... follow the steps if there are others, and do ok. Then reboot and see if it got updated","Right click on the start button, and go to \"device manager\". Expand \" network adapter \" and you will see your wifi card. Right click on it and select \" uninstall. Then, reinstall the new, and reboot."]},{"symptom":"RED CROSS under status column along nearly all of my files????        What the hell is going on?  Does anyone know?  All of sudden there is this red cross showing up against all my files in My documents and my pictures no longer are showing the images all of a sudden - only a windows 10 icon.  Please help - Annie","solutions":["Hello Annie909, I'm Didi, an independent advisor. These little white crosses on a red background icons means that there is a sync problem with OneDrive.Please follow this guide to fix the issue : https:\/\/support.office.com\/en-us\/article\/onedri...Regards, Didi"]},{"symptom":"Security update - 2020 LDAP channel binding and LDAP signing requirement for Windows        I have a question related to the security update (2020 LDAP channel binding and LDAP signing requirement for Windows) describedin https:\/\/support.microsoft.com\/en-us\/help\/4520412\/2020-ldap-channel-binding-and-ldap-signing-requirement-for-windowsIs there a way to configure the domain controller, so that even if secure binding becomes enabled by default, application servers (sending the windows credentials to domain controller) can override that in some way to support simple binding? ","solutions":["Hi AntoniosIM, This will not be supported, please read the article below: https:\/\/techcommunity.microsoft.com\/t5\/core-inf...If LDAP Channel Binding is enabled, Simple Binding will not be allowed. I hope this answers your question."]},{"symptom":"Change Microsoft family activity report and SMS verifications language        I get family activity report and SMS verification request in two different languages both of which i don't speak.I have tried all suggestions on the site, nothing helps.Anyone know of a solution that works?Thanks","solutions":["Hi ridwanoke and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing thread that might help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Hi ridwanoke and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing thread that might help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Thanks  for the effort.The solutions in the thread did not work.","Hi ridwanoke, I will release the question for other experts come to give his opinion, I am sorry not to find the problem.Thanks and Happy Holidays!","Hi ridwanoke, My name is Riccardo and I'd be happy to assist... Have you tried below: https:\/\/support.microsoft.com\/en-ca\/help\/402677...Please let me know if the fixes above help. Thanks!"]},{"symptom":"Every Reboot , My second monitor is disabled , ever since update month ago. [SOLVED]        I got a windows update a several weeks ago. I had no choice in the matter. When all was said and done , performance was slightly worse and now I have a reoccurring display problem. My extend dual monitor setup goes back to single monitor , with the second monitor recognized but disabled. When I enable it , all the color information is remembered but the Hz is reset. It is really inconvenient and I cannot rollback the update because its been more than 10 days. Why must these updates that suck be forced upon us? You do realize we pay for this garbage? Can I have my money back? Can you please fix this garbage? Something? Hello?Running Laptop , sager , 16 g ddr4 ,i7 6600k , nvidia 1070 , all ssd hd , win10 ,  version 1809 build 17763.914Nothing peculiar in device manager********************* Using a live chat , during troubleshooting , we went into power options \/ what happens when power button pushed \/  and found an option for fast boot and disabled it. Upon shutdown and power on , this problem did not reproduce.************","solutions":["Hello JonPlayers, I am Andrew an independent advisor. Have you tried reinstalling recent updated drivers from Nvidia? Its possible the recent update reset drivers, follow this link to recent drivers for your video card and install.https:\/\/www.nvidia.com\/download\/driverResults.a...Disclaimer: Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Yes I have re-installed my video drivers. I also keep them automatically up to date. The issue started right after a forced and unwanted  windows update , the issue is likely from this.","I am glad this issue was resolved for you. Thank you for letting us know that Fast Boot was the fix."]},{"symptom":"Printer dissapears after Windows Updates        I work on computers in peoples homes. I have had 3 HP printers in the last 3 weeks that have been broken by a MS Update. The printer is no longer able to be seen by the USB port. You can plug other device into it but the printer is not seen by the USB ports anymore. You have to reload the HP program and run HP troubleshooter to fix the problem. I had 1 printer that was able to get working the other 2 the troubleshooter said it could not fix the problem.","solutions":["Hi KerryGish and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that might help you resolve your concern. You can check and see if the instructions provided can help you.You may try following these steps. Check this thread for detailed instructions. It is written by a Windows MVP, Volunteer Moderator, so it is safe.https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this helps. Feel free to ask back any questions and let me know how it goes. I will keep working with you until it's resolved.Thank you!","HI Joseph Thanks for the reply. My main concern is that MS is breaking printers. I am experienced in computer repair and was perplexed by the fact that I could plug in a USB Drive and the system would see it but if I plugged  in the printer it would not make the sound of a device being recognized in any USB port.  I have had 3 of these. The first time I ran into this was on my own computer. I tried removing and reinstalling the printer software and I could not get the computer to see it. So I ran the HP printer troubleshooter and it said it could not fix the problem. I could not sit around without a printer and wait for MS so I pitched it and bought another printer. I worked on one last night and had the same problem to start with but when running the troubleshooter it installed the printer and printed out the picture of the Pears by itself. Then I went into Printers and Devices and the printer was not there. So I started to run the next step of the troubleshooter and before I could click on it the printer started making noises again and then stopped. So I went back into Devices and Printers and there was a Icon there with no name but it was ghosted out and not the right icon. SO I deleted it and started back to run the Install program again and the printer made more noises and I went back into Devices  andPrinters again and the correct Icon for the printer was there. I printed out the text test page and it worked.  My concern is that MS is breaking printers and people are not going to know what to do , and will not get it fixed as in my own case and I had to throw away a good printer because I did not realize it was a update from MS that broke it.MS needs to be aware of this problemKerry","Hi KerryGish, I'm sorry to hear that, have you tried basic troubleshooting on your first printer?1. changing USB connector 2. trying on different PC. I hope this helps. Thanks!","Hi Joseph I tried the trouble shooting. The thing I could not get over was that the USB port would not make a sound when I plugged in the printer in any port. SO I assumed it had died.  Yes I tried a different cord. With no sound or sign of it being recognized I assumed it had died and I junked it. Again MS needs to address this issue. That is why I made this ticket. If I  have had 3 of these just think how many other people are having problems with their printers??Kerry","Hi KerryGish, What I mean is, before assuming your printer has died. Have you tried plugging it to a different PC?Thank you!","      NOWhat I am doing is trying to get someone up here to contact MS about the problem of breaking printers with their updates.  I do not want help on how to troubleshoot.  Would someone just send this problem on to MS.Thanks","Hi KerryGish, I will release the question for other experts come to give his opinion, I am sorry not to find the problem.Thanks!","Hi KerryGish, My name is Riccardo and I will be happy to assist. I totally understand the frustration you are facing with this, it's extremely annoying when something like this happens...what I suggest is submitting this issue into the Feedback Hubhttps:\/\/support.microsoft.com\/en-ca\/help\/402156...By doing this Microsoft Support and Engineers look at this and can fix it for future updates.I hope this helps."]},{"symptom":"Reseting my pc        So, I'm trying to completely reset my pc, and I need space. I've already transferred all of my files to a flash drive and I don't know how to delete my files from my computer. Any help?","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.If you are looking to completely reinstall your computer - without keeping anything (because you've already copied anything you want to keep to USB), then the best way to process is to build the Windows USB recovery media and then use that to reinstall the computer. If you look at the \"Clean install of Windows 10 using installation media\" method on the following page it guides you though how to do this:https:\/\/support.microsoft.com\/help\/4000735\/wind... Regards, David"]},{"symptom":"family account passcode        Hi, I set up family account for my kids . I did have one issue where I set the content to 12 or what ever.  The issue I had was with xbox one games, the child needs a passcode to play the games, I still want  want to block content but the games she is playing I allow. I dont know where to set the passcode so I add the games as allowed.","solutions":["Hi sgtarky, I found a support article from Xbox One which should be able to assist: https:\/\/beta.support.xbox.com\/help\/family-onlin...Please advise if this helps, I will be here to assist until it gets resolved."]},{"symptom":"0x87af040a error code when downloading from Microsoft store        Nothing works. Not one damn download works at the Microsoft store works. From games to the Windows calculator. They all give me the same error code. I talked to customer service and he was clueless. Is there a fix for this or is the Microsoft store completely useless?","solutions":["Hi DonCasey2, First thing you can try is running the windows store troubleshooter to check if it can fix the issue. You can also try disabling firewall or anti-virus temporarily and see if those are preventing you to download the apps. You can also try running the system file checker tool to check if there are any corrupted registry causing the error. Please follow steps below.1. Open an elevated command prompt. To do this, right click the Windows button, and then select Command Prompt (Admin). If you are prompted for an administrator password or for a confirmation, type the password, or click Allow or Yes.2. Type the following command, and then press Enter. DISM.exe \/Online \/Cleanup-image \/Restorehealth - Note It might take several minutes for the command operation to be completed. 3. Type the following command and press Enter. sfc \/scannow - Note It might take several minutes for the command operation to be completed. Let me know how it goes.","I'm still getting the same error code. Nothing downloads from the Microsoft store","Hi DonCasey2, Thanks for giving it a try. Can you try restart the windows store service? Go to start>run> Type services.msc then look for WSService and restart the serviceYou can also clear windows Store cache by following instructions below. Run CMD as administrator, type WSReset.exe and hit Enter.","It still doesn't work","Hi, DonCasey2 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Microsoft photo app problems        my Microsoft photos app stopped importing new photos since August 2019. Is there help for this?","solutions":["Hi VirginiaWard1, My name is Riccardo and I would be happy to assist. There are a few different ways we can fix this...you can try the following: Go to Start > type in Apps & Features > click on Apps & Features icon > go down to Microsoft PhotosClick Advanced Options Scroll down, click Reset Also click Repair Restart your computer... Try it out after that... There are additional ways by going to this thread: https:\/\/answers.microsoft.com\/en-us\/windows\/for...Let me know if these work for you, I will be here to assist."]},{"symptom":"Office 2013 no longer displaying pictures correctly after upgrade to windows 10        After upgrading to windows 10, images in documents opened in Microsoft word 2013 no longer display. Same issue in powerpoint however no issues opening the same .doc in google docs.  My issues match the issues another user was experiencing after the update to windows 10. However there is no solution to this post linked below. Any ideas!?https:\/\/answers.microsoft.com\/en-us\/msoffice\/forum\/all\/office-word-and-powerpoint-no-longer-displaying\/8db88a27-7f2c-4385-9ff9-765be9f83995?page=1","solutions":["Hi cuttheduck, Have you tried performing a reinstall \/ repair of the Office 2013 program? https:\/\/support.office.com\/en-us\/article\/repair...Please check the link above and try reinstalling the software, this may fix the issue.","I have done a repair  (along with a fresh reinstall as well.)  Have also updated video drivers and tried all the steps listed in the link(s) to no avail. Looks like there are other posts with the same issue but i have yet to find a resolution posted. https:\/\/answers.microsoft.com\/en-us\/msoffice\/forum\/all\/pasted-images-are-not-showing-correctly\/e7430849-761e-47e5-bc37-9ab6134b3f5b","Can you send me a screenshot of what you see?","Took a quick video sorry for the quality. https:\/\/youtu.be\/JRrO8HmSquUIn the video I also print to pdf which shows the the image then displaying correctly. I also show what happens when I try to screenshot. Same exact behavior in powerpoint and excel. ","Still haven't found a solution and I use the screenshot feature all the time.  Any ideas on next steps?"]},{"symptom":"Driver  Easy        Hi. I wanted to ask the community if the Software Driver Easy is a legit-able and safe Driver updater. I have an Acer PC running Windows 10. I find the the Acer site don't give all the possible Driver updates that Driver Easy does. Thanks in advance","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.In my opinion the software isn't going to be much help. It will run a scan and supposedly recommend a series of drivers which require to be updated - if I recall correctly it will then want you to subscribe to their service before actually giving you the drivers.Current\/latest drivers are available from the the manufacturer, or directly from Microsoft via Windows Update - for free. There should be no need to use any additional app to assist with obtaining drivers. The developers of the app aren't going to have access to drivers that you can't otherwise obtain yourself. I would advise to stay clear. Regards, David","No driver update software is legitimate.When it comes to updating drivers, there is no replacement for your own judgement.Here are some general principles:1- Only the hardware manufacturer can write drivers for their hardware. Not Microsoft, and not anyone else.2- As a direct result of the above, drivers are available from the manufacturer on the manufacturer's website.  (The drivers that are included with Windows come from hardware manufacturers.)3- Drivers are always free.4- Although it may seem contra-intuitive, your goal is not to always have the most recent drivers for your hardware. With rare exceptions, updated drivers are issued to solve problems. If your hardware is not experiencing a problem that is addressed by an updated driver, you have no reason to install an updated driver."]},{"symptom":"Replacing windows 10 home hard disk with SSD        Hi! I have an HP Envy x360 m6-aq105dx convertible laptop that I bought from Best Buy. I'd like to replace the slow hard disk with an SSD, but I don't have the Windows 10 Product key to create an installable USB flash drive. It looks like there may be some non-trivial ways to recover a product ID from the BIOS, but I was wondering if it would be easier to create a Recovery disk on a USB flash drive and install from it after I replace the hard disk with the SSD. Thanks in advance for any helpful suggestions.","solutions":["Hi rs1946, There are a few ways to do this - if you are willing you can use a clone disk software which would clone the drive and then put it on another drive...Below is a step-by-step of how to do this: https:\/\/windowsreport.com\/move-windows-10-ssd\/There are some free cloning software - do you have the media that came for your computer? In many cases the OEM Product Key is installed on the BIOS which doesn't require the product key.You can also download it from the manufacturer in many cases. DISCLAIMER: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"internet conntion        having trouble with TAP-Windows Adapter V9 connecting to the internet. keeps telling me that is a ethernet  cord not being connected. the TAP-Windows Adapter V9 is being used for a vpn with the software hidster. my base ethernet card is a Broadcom NetXtreme 57xx Gigabit Controller and my last card is ","solutions":["Hi, WilliamBurrell1 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps to repair your Internet connections: Enter the Start menu or by pressing the Win + I key combination, open the Settings and click on the Network and Internet option. Once there, we select the Status option from the menu on the left side and, within the configurations and options that are loaded in the right panel, we have to look for the restoration of the network. When you click on this option, it will show us a new window from where we can restore the network in Windows 10. In this way, all network adapters will be removed and reinstalled, and the original configuration of other network components will be restored. net. This implies that if we were using some software, such as a VPN client or virtual switches, we will have to reinstall them.A process that the system performs automatically by clicking on the Reset button that is now displayed in Network Reset in Windows 10 settings. It is normal for the process to not take long, although we must wait until the end completely and restart the computer to continue with the network configuration in Windows 10 as we have done so far.https:\/\/www.kapilarya.com\/how-to-reset-network-...https:\/\/support.microsoft.com\/en-us\/help\/10741\/...You can also check that your drivers are updated. https:\/\/support.microsoft.com\/en-us\/help\/402844...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Adobe Flash Player interferes with Windows 10.        I am running Windows 10 upgrade 9252. Every time Adobe Flash Player updates it stops  Windows from shutting off the monitor in the preset time and will not let the system complete boot up. I then have to reinstall the Windows upgrade to correct the problem and everything then works fine. What can I do to solve the problem?","solutions":["Hi Ralph, Based on your concern, there's a lot of people experiencing this kind of issue as well.What I can suggest is to rollback and disable your windows update for the mean time.This actually worked for me, please follow this link for detailed guide: https:\/\/www.windowscentral.com\/how-stop-updates...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Thank you Richard for your response. I was hoping that Microsoft or Adobe would fix the problem and I wouldn't have to use an older version of Windows 10.I reinstalled Windows 10 update and when it came time to upgrade Adobe Flash Player I told it to tell me when updates are available and I would do it. After a couple of times of telling it to Remind Me Later it has not bothered me again.Thanks again. I appreciate you taking the time to respond.Ralph  "]},{"symptom":"win10 Media Installation Tool Error Code: 0x8007000D - 0x90002        I'm using Windows 7 Ultimate and I am trying to create a USB Booter to upgrade to Windows 10, however no matter what I do, I continuously get this error. ","solutions":[]},{"symptom":"Display size        I have about an inch of black space at the bottom of my display. The display fills the width of the screen but not the height","solutions":["Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.First, look at the physical buttons that are directly on your screen. You can probably adjust the edges in the options.Otherwise, if you have an nvidia video card, right click in the empty space in the office, and go to \"nvidia control panel\". Then click on \"Adjust desktop size and position\" under the \"display\" menuFor AMD Radeon Settings > Display > HDMI Scaling For Intel this is under, Intel HD Grahpics Control Panel > General Settings > Display > Customize Aspect Ratio under Scaling\""]},{"symptom":"Snip & Sketch reports error notification \"Something Went Wrong\" when attempting to save image as a file        Snip & Sketch App says \"Something went wrong\"When using the Microsft Windows 10 app named Snip & Sketch. Every time I would select an image and attempt to save the image as a file. I would click the icon to save to file and I would get a notification that reads \"Something Went Wrong.\" And the app would not allow me to save the image into a file for later use.I searched the web and couldn't find the fix. So I began searching my computers app options. And I found the fix.Here is an image the Snip & Sketch notification error. The error appears once you have clicked the save icon which is the icon of the floppy disc.THE FIX: Open your SETTINGS then choose APPS. Under the APPS & FEATURES option scroll down to your SNIP & SKETCH app. Select and click the app. There will be a small drop-down menu with two options; (1) Advanced Options (2) Uninstall. Choose (1) Advanced Options.After clicking the advanced options link. You will be viewing the advanced options of the snip & sketch application. (Image below). Under the header that reads APP PERMISSIONS. There is an option named PICTURES that has an on and off switch located beneath the word pictures. You need to click that button and turn the option on.Once you have turned on that advanced app option. You will now be able to save a clipped image into a file.I hope this helps somebody out there in the web. Best wishes!","solutions":["This almost worked... it gave me the clue I needed... App Permissions could not be set to \"on\".  I had to go to Settings:Privacy:App Permissions:Pictures (allow access to picture libraries on this device.   Then I set \"allow apps to access your picture library\" to \"on\" and then lower down set \"choose which apps can access you picture library and selected Snip and Sketch and set it to \"on\"  Now works....."]}]}