{"windows":[{"symptom":"UEFI versus Legacy Boot        I just purchased a refurbished PC (that I an very happy with) but I would like to know how to have this PC use the Legacy Boot rather than the UEFI.  Is this a realistic possibility? I would like to multi-boot Windows 10 Pro with Ubuntu 18.04. It looks as if it is a simple matter of selecting the legacy section of the boot menu, but I would appreciate a response from someone who knows. and are there any issues with having to do other operations, additions or deletions?As always I very much appreciate any responses.Mike Bereece","solutions":["Hi Mike. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Using Legacy instead of the modern UEFI interface is like buying a new car and disabling all of the safety features. You can do it if you want but just be aware of the risks which are that it's much less secure.To do so choose CSM or Legacy BIOS (or disable UEFI) and boot the media as a plain and not UEFI device. Delete all partitions down to Unallocated space to clear formatting, then click Next to let it auto-create and format the needed partitions and begin - this makes it foolproof. Follow the gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... To Dual boot with Ubuntu 18.04 see this guide: https:\/\/www.itzgeek.com\/how-tos\/linux\/ubuntu-ho...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Good morning Greg:I very much appreciate your response which was educational to say the least.I was resigned to convert from UEFI to standard BIOS until i read your comment concerning the superiority of the EFI standard.Using the links you provided as well as others, I am trying to learn how to deal with doing what I want using the EFI standard. This appears to be a long and time consuming process, I should say that I am in my 70,s and not as sharp as I once was. However, I am retired, live alone and have little else to do.My current issue is that I want to have another copy of windows 10 Pro but in 32 Bit instead of 64 bit (I was a Lighting Designer when I worked and have some design software that will only run on a 32 bit platform). I had this multi-boot option on my old computer (and may still have it) but I cannot seem to get a 32 Bit Windows 10 installation to work (I got the 32 bit Windows 10 Pro version via the Media Creation Tool). I understand that the UEFI standard is not happy with 32 Bit. So....1.     Is this an impossible task to dual boot a 64 and 32 version of windows?2.     If not, can you provide some insight as to how this can be accomplished?If it matters, I have a TB C: drive;  a TB D: drive and a USB 2 TB drive. C: and D: have multiple partitions. the D: drive was previously on my old computer.You said I could contact you again so I am here.whatever assistance you can provide will be most appreciated.Mike Bereece"]},{"symptom":"Printing is very slow since upgrading to Windows 10.   Version 1909        My printer is an Epson ET-2650.  Printing is normal from all other devices except my recently updated O.S. from Windows 7 to Windows 10.  Tried resetting spooler didn't help. Reloaded Epson program no help either.  It takes almost 10 minutes for page to print.","solutions":["Delete the AUD file in C:\\ProgramData\\Epson\\PRINTERThe driver will create another one next time you print.","I cannot find that file","Ok.Is the latest driver for Windows 10 installed? You can download the driver from Epson's support site.","Hi Shaun, thanks for posting your question in the community! My name is David, an independent advisor and I am here to help you.We will start with the following process, please remove your printer and reinstall it, follow the steps below: unplug your printer from your PC and turn it off, go to control panel> hardware and sound> devices and printers. In this window you will see the printers you have installed, right click on yours and select remove device and restart your PC.Once you log in, reconnect your printer and turn it on, Windows will detect it again and install the default drivers that your device brings, if the incident still continues, download the latest driver from the pagehttps:\/\/epson.com\/Support\/Printers\/All-In-Ones\/... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let me know the results of the processes and if they have been useful or if you still need more help, I will be aware of your response."]},{"symptom":"touchpad not working Jay#222 i cant reply to your answer        my touch pad stoped working following a windows update, it doesn't even show up in drivers and devices my laptop is a Gemini NC14to recap:my touchpad is switched on in settingsi have tried the f12 button nothing happensthe manufacturer doesnt offer drivers available to download the link that you will send me to update my drivers doesnt work ive done it multiple timesive been send a link to install drivers that may be compatible with my laptop they wernt my partner has the exact same laptop if that helps","solutions":[]},{"symptom":"SERVICE HOST: CONNECTED DEVICES PLATFORM USER SERVICE very high power usage        This service is consuming 15-20% CPU All the time (but never beyond 25%) on my laptop (Dell XPS 15 7590) & its very annoying becuase this triggers fan noise even while doing minimal tasts on my computer & also consumes battery lifeI have referred to other posts around the forum and have already tried the following CMD commandsSfc.exe \/scannowDism.exe \/online \/Cleanup-Image \/StartComponentCleanupDism.exe \/Online \/Cleanup-Image \/RestoreHealth Any help would be much apreciated, TIA","solutions":["Hello! I am an Independent Advisor, I would love to help you out! Has this been happening since you got the laptop? Or has it started happening recently?If it started happening recently and updates have installed recently that I would suggest to rollback the updates:Start > Settings and click on Update & Security. Click the Recovery link on the left and then click on Get started under 'Go back to the previous version of Windows 10.'","Thank you for ur prompt response,This has been the case since day 1 as far as I can tellAll my drivers and windows is uptodate.","Thanks for the info. How long have you had the laptop? You could try to disable the service and see if any errors occur, there are some services that depend on it, but they may not be needed.To do this you can go to service.msc, find connected devices platform service, right click it and select disable.If everything seems to be fine after a while you can then go back, right click > properties > change the startup type to disabled.I disabled the service on my own computer for the last few minutes and have seen no negative impact yet.After disabling the startup type I would recommend restarting your computer and then seeing if there are any issues, or if the issue is gone.You can also see a little bit more information about this service here: http:\/\/servicedefaults.com\/10\/cdpsvc\/Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","While this normally resolves the problem, after the latest Windows update, I get a message that the system cannot go back to a previous version.Any suggestions on how to stop to stop the constant the fan noise? My computer is a Dell 2330 (all in one).","I have had this laptop for a month now , it came with windows 10 home which I upgraded to pro.I have followed ur instructions and disabled the service. However, there were two of them, one ends with \"\"\"\"_5f968 and although I have stopped this service , I am unable to disable its automatic startup from properties, it gives an error saying that parameter in incorrect.I will restart my computer now.","I get the same error on that one. After the computer restarts let me know if you still seem to be seeing the issue or anything else after you have some time to test.","So after the restart service is back on with similar cpu usage , but the code after the name has changed","Do you have any devices connected to your computer such as USB devices, bluetooth devices, etc?If so I would recommend to unplug everything, turn off bluetooth on the laptop, restart and see if there is still a problem.This would more help isolate if this is an issue with just the OS or if it is coupled with some piece of hardware as well.","So I thought of this earlier, given that I use a wireless mouse connected through usb dongle, but the problem exists despite removing everything. only thing my laptop is connected with is the wifi.I have not tried running safe mode, I can try if u think it can help ?","The only devices are a mouse and keyboard via USB. Bluetooth is off. I have restarted several times."]},{"symptom":"Blue screen        How can I fix this?Problem signatureProblem Event Name: BlueScreenCode: 154Parameter 1: ffffe48b343b8000Parameter 2: ffffe1875d051520Parameter 3: 2Parameter 4: 0OS version: 10_0_18362Service Pack: 0_0Product: 768_1OS Version: 10.0.18362.2.0.0.768.101Locale ID: 2057This is the error code making my laptop reboot often in the last 2 days.Please help!","solutions":["Did you installed something nasty from the Internet? All your drivers are updated? You changed some settings....?","Nothing recently installed or changed or updated, I can check if all drivers are up to date however!","For that I will recommend to use Driver Booster from IObit.","Hello anasanto1313, I'm Didi, an independent advisor. Can you please upload and send us your minidump files from the date where you started to have those BSODs so we can analyze it ?You can find those minidump files in the C:\\Windows\\Minidump folder (if you have installed Windows on the C drive).Regards, Didi"]},{"symptom":"GL worker.exe        I have been with Iwin for many years playing games now some of the games I want to play will not download properly it say GL worker.exe not support and to update my drivers but all my drivers are up to date. For example I tried to download Parker  & Lane Twisted Minds but my Kaspersky anti virus would not let it load. It kept deleting it from the system saying it had malicious activity. But the game Parker & Lane Criminal Justice it loaded just find, but I could not play that due to GL Worker.exe not working. Some of the games I use to play I can no longer get into and others are working just fine. How do I fix this problem. I tried turning off my anti-virus  but that did not work. I went online and tried other suggestions like copy and paste GL Worker. exe from one game into the one I wanted to run that did not work. I also tried Iwin support, sent them information about my problem, their suggestions did not work either. My computer is a HP Compaq 6200 refurbish. 32 bit operating system, x64-based processor. I am using Windows 10 pro.Can someone please help.","solutions":[]},{"symptom":"windows hello currently unavailable        Hi guys! I have an issue regarding my windows 10 version 1903 after the update my windows hello's not working already. I have already this issue since the 1803 update i already tried many things including the uninstall\/reinstall of biometric driver which is right now already missing in my device manager. I already enable convenience PIN sign in. I also enable biometrics option in local group policy editor. Appreciate your replies cheers!!","solutions":["Hi, JC_acerswift1 My name is Phillip, an Independent Advisor trying to help. From what you're saying it seems there is no Windows Hello sync and this new Windows update.You must make sure that your system is up to date and also from the technical support of the manufacturer of your equipment, confirm that you have the most updated fingerprint controller.After that, on the Start button, then on Settings - Accounts and finally on Login Options.About Windows Hello, you must select the camera or fingerprint reader. -Select remove to remove the face scan or fingerprint reader. -Configure Windows Hello. I look forward to helping you. Regards.","Unfortunately, this is the screen I see and the options stated above is not available. Please advise for further instructions. ","I have the exact issue, but my fingerprint was working before, did you find a fix?","I have the exact issue, but my fingerprint was working before, did you find a fix?Sam problem but got mine working by deleting it under biometrics in dev mgr.  Unfortunately, can't fix the face recognition, which was working, and now HP is saying the IR camera is bad on my 1 month old laptop.  ","HiYou may try those methods to get it back. 1) Update Windows (As most of  the cases are related to incompatible or out of date drivers.)Go to Start > Settings > Update & Security > Windows Updates > Check for Windows UpdatesAfter getting updates, restart your computer.2) Get help from Windows built-in troubleshooterGo to Start > Settings > Update & Security > Troubleshoot > Hardware and Devices > Run the troubleshooter. Hit Next and then follow the prompts to run it.3) Remove Windows Hello, and then re-add it.Go to Start > Settings > Accounts > Sign in OptionsThere you hit Remove, and then restart your PC.You will then be asked to set up Windows Hello.Regards.","I'm having the same problem and non of your suggestions fix the problem. I cant even remove it because that option is greyed out"]},{"symptom":"I want to know how to sign in my new computer without a password        I want to know how I can set up logging into my compute with a password, I can do it on my old computer with my Microsoft compter and window 10","solutions":["Hello RichardPC1, I'm Didi, an independent advisor. Can you please confirm that you want to sign in your computer WITHOUT a password ?If that's your question then follow this guide, if the the first method you choose doesn't work try the second one :https:\/\/www.kapilarya.com\/how-to-automatically-... Please remember that if you do this anyone having physical access to your computer will be able to sign in to it without restriction.Regards, Didi ------------- Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"PerfMon For Early Incident Detection        Dear Expertise, I need to have something on Windows 10 to detect decreased performance of hardware in the computer and the computer will send a report as a file (let say text file) to a folder path when something inside the PerfMon reach the faulty \/ the condition we have defined.So that we can prevent major faulty of the hardware.Do you have any idea for this on how to set the Perfmon and relate the action above?","solutions":[]},{"symptom":"Solved Android phone stuck on \"obtaining ip address\" while using mobile hotspot in windows 10        I wanted to use mobile hopspot utility of Windows 10 on my laptop to share LAN connected internet with my android mobile phone, but wifi connection with laptop stucked at \"obtaining ip address\". My laptop had internet connection, whereas I could not get internet on my mobile.I tried all the solutions suggested on the different threads, but problem was not solved.I am using Bitdefender Internet Security. I switched off the firewall of this internet security and my mobile connected and got internet immediately. My openion is, Microsoft and Bitdefender should find its better solution so that Switching OFF the firewall of Bitdefender is not required.","solutions":["Hi, DKChauhan My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps to repair your Internet connections: Enter the Start menu or by pressing the Win + I key combination, open the Settings and click on the Network and Internet option. Once there, we select the Status option from the menu on the left side and, within the configurations and options that are loaded in the right panel, we have to look for the restoration of the network. When you click on this option, it will show us a new window from where we can restore the network in Windows 10. In this way, all network adapters will be removed and reinstalled, and the original configuration of other network components will be restored. net. This implies that if we were using some software, such as a VPN client or virtual switches, we will have to reinstall them.A process that the system performs automatically by clicking on the Reset button that is now displayed in Network Reset in Windows 10 settings. It is normal for the process to not take long, although we must wait until the end completely and restart the computer to continue with the network configuration in Windows 10 as we have done so far.https:\/\/www.kapilarya.com\/how-to-reset-network-...https:\/\/support.microsoft.com\/en-us\/help\/10741\/...You can also check that your drivers are updated. https:\/\/support.microsoft.com\/en-us\/help\/402844...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi DKChauhan,it's the manufacturer of your antivirus, Bitdefender, to find the solution to this problem and not Microsoft!They are the software and hardware manufacturers that need to adapt to Windows 10 and not the other way around.Windows 10 already has its native antivirus that works perfectly, there is no need to install third-party antivirus software that is not compatible with this operating system.","My intention is not to blame Microsoft\/Windows or any antivirus, my intention was to help the people having the same problem, as it may be one of the reasons for such problem.Anyway, I have found a better solution for this problem (if antivirus is causing this problem).  ---1. Switch Mobile Hotspot ON; 2. Need to go to \"Firewall Settings\" of antivirus, then look for \"default application behaviour\", Click on \"Edit default Rules\", you will find 2 connections there - one WiFi and second \"Local Area Connection* ## (some number)\". Here you will find to choose one rule from three options of drop down menu - Automatic, Allow, Block; by default value for these connections is Automatic, this prevents from making network connections through windows; you need to select Allow for \"Local Area Connection* ##\" and thats all.3. Now there is no need to Switch OFF Firewall of third party antivirus.Hope, this will be helpful for other persons.","So Microsoft or Windows 10 has nothing to do if some installed third-party software isn't configured correctly."]},{"symptom":"Install Windows 10 Inside OS is show in the updates.        The new inside Windows 10 OS is show up in the updates but not clean out after it update to a new one.  Have try to clean it out but no luck.  Used the Desk Cleaner on here about five or more times try to get it to do the job but no luck on it.  Need help on this, thank you.  ","solutions":["Hi, Thank you for writing to Microsoft Community Forums. For better clarity on the issue you are facing, please let us know: When you say, “The new inside Windows 10 OS” are you referring to Windows 10 Insider Preview?Could you please provide more information on, “not clean out after it update to a new one”?May I know, the files you are trying to clean? If you are looking to free disk space, you can try the steps mentioned in Free up drive space in Windows 10​.  Please reply with detailed information on the issue to help you with the appropriate troubleshooting steps. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"REMOVE OLD EMAIL ACCOUNT WITH MICROSOFT        I have been trying to remove my old email account with Microsoft and am unable to do so.  It is being used for fraudulent purchases and causing me a lot of issues.  This old email was supposed to be disabled in Dec 2019; however it is still active.  I have a gmail address that I know use and just want to get rid of the aol email address from my life.  What can I do? I've read all the emails and tried everything I can and nothing seems to work.  This account is still there. Connie Corwin","solutions":["Is the email address listed under your Microsoft account? https:\/\/account.microsoft.comIf so have you tried deleting it there? You may have to access the AOL account & delete the address there if it’s being used fraudulently.As this involves accessing your account you may need to call Microsoft & have them delete the email address."]},{"symptom":"Small white square in upper left corner of screen can not be removed need help        The small white square is affecting the performance of my computer. i need to get rid of it. HelpI'm using a surface pro with windows 10.","solutions":["Hello Bracey, I'm Didi, an independent advisor. Are you talking about this white square ? https:\/\/www.howtogeek.com\/wp-content\/uploads\/20... If that's not what you are talking about please take a picture or a screenshot of it and send it here.Regards, Didi ------------ Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Re-installed Windows and now my user folder name is completely different        Prior to installing windows my file path was C:\/User\/[first and last name] but ever since reinstalling windows this has changed to \"camer\". I never put this in so why the hell has it done this. It isn't even my whole name, part of it has been cut off. Not happy. ","solutions":["Hello,In the setup process, did you connected with the Microsoft account?","Hello CCUS16, I'm Didi, an independent advisor. To change your user folder name to create a new user account and delete the older one after signing into new :Here's a guide on how to create a new user account : https:\/\/www.tenforums.com\/tutorials\/5440-add-lo...And here's how to delete an account : https:\/\/www.tenforums.com\/tutorials\/5464-delete... Make sure you grant admin privileges to the new account. Regards, Didi -------------- Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Computer slows down after Feature update 1909        Anyone have this issue where the computer slows down after installing the latest update, happened on both my computers.  It especially affects the loading of grafic images.","solutions":["I will be waiting for your response!"]},{"symptom":"How do I view pictures that are saved in a file. All I see are numbers or picture icons. I want to select which picture I want to use.        How do I view pictures that are saved in a file. All I see are numbers or picture icons. I want to select which picture I want to use. ","solutions":["Hi Chlele and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.1. Open \"File Explorer\" 2. Go to the \"View \" tab. 3. Click \"Options\". 4. Click the \"View\" tab. 5. Uncheck the \"Always show icons, never thumbnails\" checkbox. 6. Click \"OK\". Please check the image attached below for your reference. I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","In File Explorer when you are at the list of photos go to the top and click on View.  Click on Large icons."]},{"symptom":"blue windows logo after updating from Windows 7 to 10        Hell everybody,Can somebody help me.Several times i tried to upgrade my laptop Samsung RV711 from windows 7 to 10.After restart the laptop it shows all the time the blue windows logo in a black screen and does nothing.I am open for any suggestions.More users have this problem as i looked the internet.Only not a solution i have.Thanks","solutions":["You don't say if you paid for 10 or if you checked that your device's hardware was suitable to upgrade to 10.You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:Samsung - Find out if your system runs Windows 10.@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700","It appears to be a problem with the Broadcom wifi. There are no Windows 10 drivers. See this:Microsoft forum thread.You have to open up the laptop and remove the wifi. Then replace it. Look for a how-to on Youtube."]},{"symptom":"DVD Drive Problem:  Is it hardware or software?        I have a Dell Inspiron 3650 desktop.   When I insert a \"new\" DVD, then try to open it, I get message:\"Windows cannot read the disk in drive D:\\.   Make sure the disk uses a format the windows recognizes.  If the disk is unformatted, you need to format it before using it\".I have tried 3 different types of CD\/DVD media:  a HP CD-R, a Memorex DVD+R, and a Staples DVD+R.  Same problem with each one.  These are all \"new\" DVD's (have never been used before), so they should not need formatting.Also, when I open the DVD, there is not an option to format the DVD.  So how do I format it ?I have a \"used\" HP CD-R that contains some information I saved to it at one time (when I did not have this problem).  When I insert that CD, I can open it and look at the information on it without any problem.I checked to make sure the DVD driver is up to date.Any idea if this is a hardware problem, or a software problem ?  What should I try to fix it ?thank you","solutions":["Hi,Just a guess, but it might be a problem with your AutoPlay setting for the drive..It may be recognizing the blank disk as something else..A new DVD does not need to be formatted.. That happens while files are being burned to it..There is a type of CD\\DVD that can be formatted and have files added to it later, but that is not the way they are normally used..The only CD\\DVD that routinely may need formatted would be the \"RW\" rewriteable type..","Hi rockydean I'll try to help you out. I think slance310 had a good point. A \"blank\" DVD is empty, and isn't \"readable\" by Windows.In order to \"read\" it, you have to burn some data on it. What happens when you try to burn some data on a CD \/ DVD ? I'll wait for your news Regards","you must check the  dvd writer hardware specifications, for  different  dvd writer  embeds  different  types of  dvd or  cd "]},{"symptom":"AirPods Pro doesn't play any sound when a program uses microphone        when a program is using the microphone (and showing the icon), every sound from the computer completely gets cut off.when i go back to a program that doesn't use microphone, or quit the program, all the sounds come back.is there anyway to fix this?","solutions":["Hi, thanks for posting your question in the community! My name is David an independent advisor and I am here to help you.For the incident you are presenting, I want you to verify the following configuration:Right-click on the sound icon on your taskbar> Select Sound> Go to the Recording tab> Right click on your recording device> Properties> Advanced options> Disable the options exclusively if they are enabled> select accept.Let me know the result of the process, if it has been useful or you still need more help, I will be waiting for your response.","Hi, thanks for posting your question in the community! My name is David an independent advisor and I am here to help you.For the incident you are presenting, I want you to verify the following configuration:Right-click on the sound icon on your taskbar> Select Sound> Go to the Recording tab> Right click on your recording device> Properties> Advanced options> Disable the options exclusively if they are enabled> select accept.Let me know the result of the process, if it has been useful or you still need more help, I will be waiting for your response.nope. it did not work.i disabled both and no sound is still coming out when microphone is used.","Hi! Thank you for keeping in touch and informing me of the results of the process, do not worry, we will perform some other processes.As your incident continues, proceed to perform the following steps: 1. Right-click on the sound icon on your taskbar> Select Sound> Go to the Communications tab> select the “Do nothing” button and then click OK> Restart your PC.2. Update the drivers of your sound card: In the Windows search bar, type \"device manager\" and enter there> Open ‘Audio Inputs and Outputs’> right click on each of the devices you see> properties> driver tab> Click ‘Update Driver’> Click 'Search automatically for updated driver software'.> if a driver is installed restart your computer. 3. Create a restore point by following the steps in the following link https:\/\/support.microsoft.com\/en-us\/help\/402753... and install the Bluetooth Headset Helper driver, this can be downloaded from the following direct linkhttps:\/\/download.lenovo.com\/ibmdl\/pub\/pc\/pccbbs..., just run the installer. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Perform the processes one by one and go testing the result, let me know what happened with each step and the results you obtained, if the information has been useful or you still need more help, I will be waiting for your response."]},{"symptom":"Failed to install Window 10 Version 1903 - 0xc1900101        I have been trying to install feature update to Window 10 Version 1903 without success, with message \"Failed to install on mm\/dd\/yyyy - 0xc1900101.  What should I do?  Thanks!","solutions":["Hi TAYLORWANG7I am an independent advisor here to helpThere have been many recent reports of update failure when using Windows update or the upgrade assistant.I would recommend that you follow the advice given by Andre for Directly in the following threadhttps:\/\/answers.microsoft.com\/en-us\/windows\/for...","Hi,Try updating to 1903 using Media Creation tool and if it fails let us know.The fastest way to get the upgrade is through Media creation tool or ISO file.Please download Media Creation Tool from the link below and select Upgrade this PC at the first screen.https:\/\/go.microsoft.com\/fwlink\/?LinkId=691209All steps, including upgrading using ISO file and Media creation tool, are covered here:https:\/\/www.yourwindowsguide.com\/2019\/05\/update...Content on the above blog is written by a Microsoft MVP so it is safe.","Thank you so much, TechGuy_82!I have spent more than 8 hours trying to update to Window 19 Version 1903, including doing what you suggested, without success. The error message I got was:0xc1900101 - 0xc4000D The installation failed in the SECOND_BOOT phase with an error during MIGRATE_DATA operation.","Hi Taylor,Let us check the Installation log to find why the update failed. Please share the logs as mentioned in this article. You should use a File sharing service like Onedrive or Media Fire to upload files and share link.https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/troubleshoot-feature-update-install-failures\/eaf4ff24-64d6-4c72-824c-3ba3df716fc3The Panther logs. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\PantherThe Rollback logs: These usually are created if Windows Update rolls back.  Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\Rollback[Only if the error code is 0xC1900101-0x30018] The Device Install Log from C:\/$Windows.~bt\\Sources\\Rollback\\setupapi\\setupapi.dev.logAs the log size might be large consider zipping before uploading.","You can look at the Microsoft linked below.  Part way down the page it shows that exact error situation.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/resolution-procedures#0xc1900101","Hi againI am sorry to hear that this didn't helpThe Particular error that you've posted last can be addressed in most cases by working through the steps in the following help guidehttps:\/\/answers.microsoft.com\/en-us\/windows\/for...","Hi Sumit,Here are the Windows update logs created in the last couple of days.https:\/\/www.dropbox.com\/sh\/5o425qwybnxf5hk\/AAD4HgpLvEH3x8h2MM2RkOuKa?dl=0The only external drive I could think of was a stand-alone LG DVD drive which I have caught up with all the updates this morning before I tried to update to the Window 10 Version 1903 again.  It was another failure with the same message:0xc1900101 - 0xc4000D The installation failed in the SECOND_BOOT phase with an error during MIGRATE_DATA operation.","Hi Taylor,Windows update logs aren't relevant in a feature update. Please share the Panther logs as described earlier.","Hi Sumit,Here are the Panther logs files, the Rollback logs files and the Setupapi logs files:https:\/\/www.dropbox.com\/sh\/5o425qwybnxf5hk\/AAD4HgpLvEH3x8h2MM2RkOuKa?dl=0Thank you so much for your help!Taylor","Hi Taylor,The only device driver installation failed was of Synaptics Touchpad as I see. Description - Synaptics SMBus Drive     dvi:                     InfFile     - c:\\windows\\system32\\driverstore\\filerepository\\synsmbdrv.inf_amd64_d3526af0e8f4a51f\\synsmbdrv.inf     dvi:                     Section     - SynapticsInstallIntel     dvi:           {Select Best Driver - exit(0x00000000)}You can uninstall that temporarily and reinstall that after the update. However, there is a slight chance of Touchpad not working after the update. Remove the driver completely:https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-performance\/uninstalling-a-driver-completely\/8b7195cb-0d74-4ddf-ad55-ac0bcbf76f22Use the Media Creation tool to try updating."]}]}