{"windows":[{"symptom":"Snip and Sketch        As of today, all my photos come up in the Snip and Sketch mode.  I cannot find any way to disengage it.  Have tried to terminate the Snip and Sketch App and to Uninstall it through Settings, but it is still operational after a restart.  Any advice to disable this App would be appreciated.","solutions":["Hi Donald Open the Settings App (gear icon on your Start Menu) Go to Apps - Default Apps At the top f that settings page, what is the default Photo Viewer set to, is that Snip and Sketch, if so, change that to the Photos App . . .If that was not the problem, please let me know and we can work from there . . .","Thanks Dave.   I tried for a couple of hours to fix this without success.  Microsoft Help put me through to someone in India who seemed to be not very knowledgeable and he wanted to take over my computer.   With all the scams today, I am not going to allow that.   Your help is greatly appreciated in disabling this App that appeared out of nowhere."]},{"symptom":"Possible to upgrade Vista 64 to any newer supported OS?        I have an older HP desktop running Vista 64.  I would like to at least run an OS that is currently supported.  What are my easiest options without doing a clean install?","solutions":["The only upgrade option would be upgrading to Windows 7 x64bit but this version of Windows will be end of support in few days.In this case, it would be better to do clean install of Windows 10 and you could keep your files and data but your applications and programs will be removed and you will have to reinstall them. However, Windows files will be placed into a folder called Windows.old","Why weren't you told to check to see if your computer manufacturer evens supports Windows 10 on your model?If you don't do these checks you will just be wasting your money.@@@@@@@@@@@@@@@@@@@@@8.1 is still supported until 2023.It depends on the hardware requirements of later operating systems and also whether the computer\/laptop manufacturer supports and supplies drivers for the later operating systems as to whether it is possible or feasible to upgrade or not.Windows 8 is no longer supported.Support for Windows 7 ends on the 14th of this month.Windows 8.1 and 10 installation from Vista are both done by a clean install.@@@@@@@@@@@@@@@@@@@@@@@@Follow these steps before you buy  Windows 8.1; extended support ends January 10, 2023 .Check to see if your Computer\/Laptop Manufacturer has Windows 8.1 Drivers available for your Model.If not available, Windows 8.1 will not install and work correctly for you.\"Windows 8.1 system requirements\"http:\/\/windows.microsoft.com\/en-us\/windows-8\/system-requirementsWindows 8\/8.1 does not come for free; you have to buy itMicrosoft no longer sells 8\/8.1.Try amazon.com, etc.Warning:You do not buy a Product Key by itself, as they are normally stolen\/pirated, Volume Licenses which are not for private use, or MSDN keys which are not to be sold by the original subscription holder.Make sure that you buy the complete sealed package (DVD, license)https:\/\/www.microsoft.com\/en-us\/howtotell\/Shop.aspxRead Section: Beware of Product Keys sold separately.@@@@@@@@@@@@@@@@@@@@@@@For Windows 10:First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:HP Products Tested with Windows 10@@@@@@@@@@@@@@@@@@@@@@How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700","I downloaded windows 10 to replace my outdated windows vista but it wont install on my computer? What am i doing wrong","I downloaded windows 10 to replace my outdated windows vista but it wont install on my computer? What am i doing wrongWindows 10 does not come for free when you want to install 10 in place of Vista.You have to buy it.@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@","Thanks for the response.  I am running an HP A6650F and the HP with 8 GB of ram and a 2.2 GHZ processor.  The HP site does not list same as being tested for Windows 10 as it relates to drivers, etc.  I have no issues buying Windows 10 as long as it runs...we will see.","Thanks for the response.  I am running an HP A6650F and the HP with 8 GB of ram and a 2.2 GHZ processor.  The HP site does not list same as being tested for Windows 10 as it relates to drivers, etc.  I have no issues buying Windows 10 as long as it runs...we will see.","This were the basic checks to do.https:\/\/support.hp.com\/ca-en\/drivers\/selfservice\/hp-pavilion-a6600-desktop-pc-series\/3793920\/model\/3794767First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.HP Products Tested with Windows 10"]},{"symptom":"Unhandled exception has occurred in your application        Unhandled exception has occurred in your application, If you click Continue, the application will ignore this error and attempt to continue. If you click Quit, the application will close immediatelyThe system cannot find the file specifiedSee the end of this message for details on invoking just-in-time (JIT) debugging instead of this dialog box.************** Exception Text **************System.ComponentModel.Win32Exception (0x80004005): The system cannot find the file specified   at System.Diagnostics.Process.StartWithShellExecuteEx(ProcessStartInfo startInfo)   at System.Diagnostics.Process.Start(ProcessStartInfo startInfo)   at fifasetup_csharp.StartingForm.LaunchAndFocusGame()   at System.Windows.Forms.Control.OnClick(EventArgs e)   at System.Windows.Forms.Button.OnClick(EventArgs e)   at System.Windows.Forms.Button.OnMouseUp(MouseEventArgs mevent)   at System.Windows.Forms.Control.WmMouseUp(Message& m, MouseButtons button, Int32 clicks)   at System.Windows.Forms.Control.WndProc(Message& m)   at System.Windows.Forms.ButtonBase.WndProc(Message& m)   at System.Windows.Forms.Button.WndProc(Message& m)   at System.Windows.Forms.NativeWindow.Callback(IntPtr hWnd, Int32 msg, IntPtr wparam, IntPtr lparam)************** Loaded Assemblies **************mscorlib    Assembly Version: 4.0.0.0    Win32 Version: 4.8.4075.0 built by: NET48REL1LAST    CodeBase: file:\/\/\/C:\/Windows\/Microsoft.NET\/Framework64\/v4.0.30319\/mscorlib.dll----------------------------------------fifaconfig    Assembly Version: 1.0.0.0    Win32 Version: 1.0.0.0    CodeBase: file:\/\/\/D:\/Games\/FIFA%2019\/FIFASetup\/fifaconfig.exe----------------------------------------System.Windows.Forms    Assembly Version: 4.0.0.0    Win32 Version: 4.8.4042.0 built by: NET48REL1LAST_C    CodeBase: file:\/\/\/C:\/WINDOWS\/Microsoft.Net\/assembly\/GAC_MSIL\/System.Windows.Forms\/v4.0_4.0.0.0__b77a5c561934e089\/System.Windows.Forms.dll----------------------------------------System    Assembly Version: 4.0.0.0    Win32 Version: 4.8.4001.0 built by: NET48REL1LAST_C    CodeBase: file:\/\/\/C:\/WINDOWS\/Microsoft.Net\/assembly\/GAC_MSIL\/System\/v4.0_4.0.0.0__b77a5c561934e089\/System.dll----------------------------------------System.Drawing    Assembly Version: 4.0.0.0    Win32 Version: 4.8.3752.0 built by: NET48REL1    CodeBase: file:\/\/\/C:\/WINDOWS\/Microsoft.Net\/assembly\/GAC_MSIL\/System.Drawing\/v4.0_4.0.0.0__b03f5f7f11d50a3a\/System.Drawing.dll----------------------------------------DXHelper    Assembly Version: 1.0.6788.24897    Win32 Version: 1.0.0.0    CodeBase: file:\/\/\/D:\/Games\/FIFA%2019\/FIFASetup\/DXHelper.DLL----------------------------------------System.Configuration    Assembly Version: 4.0.0.0    Win32 Version: 4.8.3752.0 built by: NET48REL1    CodeBase: file:\/\/\/C:\/WINDOWS\/Microsoft.Net\/assembly\/GAC_MSIL\/System.Configuration\/v4.0_4.0.0.0__b03f5f7f11d50a3a\/System.Configuration.dll----------------------------------------System.Core    Assembly Version: 4.0.0.0    Win32 Version: 4.8.4075.0 built by: NET48REL1LAST    CodeBase: file:\/\/\/C:\/WINDOWS\/Microsoft.Net\/assembly\/GAC_MSIL\/System.Core\/v4.0_4.0.0.0__b77a5c561934e089\/System.Core.dll----------------------------------------System.Xml    Assembly Version: 4.0.0.0    Win32 Version: 4.8.3752.0 built by: NET48REL1    CodeBase: file:\/\/\/C:\/WINDOWS\/Microsoft.Net\/assembly\/GAC_MSIL\/System.Xml\/v4.0_4.0.0.0__b77a5c561934e089\/System.Xml.dll----------------------------------------WindowsBase    Assembly Version: 4.0.0.0    Win32 Version: 4.8.4075.0 built by: NET48REL1LAST    CodeBase: file:\/\/\/C:\/WINDOWS\/Microsoft.Net\/assembly\/GAC_MSIL\/WindowsBase\/v4.0_4.0.0.0__31bf3856ad364e35\/WindowsBase.dll----------------------------------------************** JIT Debugging **************To enable just-in-time (JIT) debugging, the .config file for thisapplication or computer (machine.config) must have thejitDebugging value set in the system.windows.forms section.The application must also be compiled with debuggingenabled.For example:<configuration>    <system.windows.forms jitDebugging=\"true\" \/><\/configuration>When JIT debugging is enabled, any unhandled exceptionwill be sent to the JIT debugger registered on the computerrather than be handled by this dialog box.","solutions":["Hi Jhames This error is generated by the config file on FIFA 2019, when are you seeing that error on your system is that when you start Windows or try to run that game?","Yes when i try to run the game"]},{"symptom":"Making changes toa file.......        Why can't I make changes to an existing file and save the changes?  i.g. updating or adding information to an existing file.   I can't save the file with the changes because it tells me the file already exists, and I can't change the NAME of the file either.","solutions":["Hi, douglasandres1 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps: Press the Start key and type the word CMD or Powershell, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanu p-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/929833..."]},{"symptom":"Can't do web search in Windows 10 search button. Tells to open browser        Hello I really liked this feature of searching. But now it always shows to open the browser instead of showing results here.How can I set it to show results here?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please refer to the following page and perform the steps to Troubleshoot Windows Search.https:\/\/support.microsoft.com\/en-in\/help\/452014..."]},{"symptom":"Windows 7 Won't boot after motherboard change        I've recently upgraded all the parts (except for my HDD) in my OLD pc. Each time i try to repair it it tells me \"Windows startup repair cannot automatically repair.\" From what i know the hard drive is very old, about 12 years now. However, it worked fine a year ago and it was left untouched until I tried to boot today. Is this a problem with software, or is my hard drive failing? Is there a way to tell if my Hard drive is failing? I am not sure the specs of the hard drive as it was given to me a while ago and, again, is old.I tried scanning it and it told me there were no integrity violations.Any help is appreciated!","solutions":["Hard Drive 12 years old approximately ???Well beyond its eol in my books.The best i have ever got out of a Hard Drive is approx 10 years but it began failing well before then and i ran Sea-tools over it to try to recover bad sectors and clusters.Worked for a while so i then backed everything up as i knew it would continue with more and more sectors failing.Once this issue starts its just seems to cascade.As the older Hard Drives are of a mechanical nature ( ball Bearings platters and read write arms that swing back and forward, they wear out in a relative short order ).If its a Seagate you could download Sea-tools ( a diagnostics program for HDD`s ) and run that over it.I would expect it to find plenty of bad sectors and clusters.Time to back it all up and get a new Hard Drive. ","Test the Hard Drive.Go to your Computer Manufacturer's website > look for your Computer's specifications > find out brand of Hard Drive > go to Hard Drive Manufacturer's website > find and download Hard Drive Diagnostic software and make a Bootable disk from it on the Computer you are using to get here, following their instructions > test your Hard Drive to see if it has failed.And you can also use this Method to test your Hard Drive:\"SeaTools for DOS\"http:\/\/www.seagate.com\/support\/downloads\/seatools\/\"SeaTools for DOS tutorial\"http:\/\/knowledge.seagate.com\/articles\/en_US\/FAQ\/201271en\"How to use SeaTools for Windows\"http:\/\/knowledge.seagate.com\/articles\/en_US\/FAQ\/202435en________________________________And how to save your Data, if you wish to.Saving your files:You can pull the Hard Drive and put it in a USB Hard Drive Enclosure > plug it into another Computer > and attempt to read and copy over your Data that way.@@@@@@@@@@@@@@@@@@@@This Program may interest you too.\"TestDisk, Data Recovery\"http:\/\/www.cgsecurity.org\/wiki\/TestDiskTestDisk can run under DOS (either real or in a Windows 9x DOS-box),Windows (NT4, 2000, XP, 2003, Vista, 2008, Windows 7 (x86 & x64), Windows 10@@@@@@@@@@@@@@@@@@@@Or, you can download Knoppix > make a Bootable disk from it > Boot into your System with it (IF your Hardware is all working) > and copy your Data from the Hard Drive that way.http:\/\/knoppix.net\/\"How to use Knoppix\"http:\/\/lifehacker.com\/192982\/geek-to-live--rescue-files-with-a-boot-cd@@@@@@@@@@@@@@@@@@@@\"Recover files from Windows drives using Puppy Linux\"https:\/\/www.winhelp.us\/recover-files-using-puppy-linux.htmlCheers","From what i understand, although it is 12 years old it was only in use for the first 3 years. The company (where the person who gave it to me came from) only used it for a short time due to them getting better hardware. Its been sitting out of use and worked perfectly 2017-2018. I am currently scanning it with chkdsk thru command prompt so I'll update if i see any bad sectors","Your topic title includes the words \"motherboard change\".When the HDD worked perfectly in 2017-2018 was it with the motherboard you have now or some other motherboard?It is extremely unlikely that taking a HDD from one system with a certain motherboard and installing it into a system with a different motherboard is going to result in a happy ending unless the MBs are close to identical, but you might get lucky sometimes.","And this is the reason why:You can't take a hard drive with an installed operating system on it > put it back in the device with a new motherboard and expect it to boot into Windows.The installed operating system on the hard drive from the device also has the drivers for that device's old motherboard installed on it.And no you can't change them.You have to clean install the OS."]},{"symptom":"cursor        Well, my cursor isnt on my screen and I have no idea what to do with it since its very difficult to do things without a cursor. can someone please tell me how to have my cursor back on my screen??","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Let us reset the Mouse driver and check. As you can't use the mouse cursor, I will try my best to describe the steps in a way that you don't need to click you mouse.1. Press Windows + R keys altogether to bring out the Run box. 2. Type devmgmt.msc and then hit Enter to open Device Manager. 3. Press Tab to switch to devices list. 4. Use arrow keys to scroll down to \"Mice and Other Pointing Devices\" and use the right arrow key to expand it.5. Use the down arrow key to select your mouse device. 6. Press Shift + F10 open the context menu. 7. Choose Uninstall and hit Enter. (Do Not select any check box) 8. Restart the PC."]},{"symptom":"Windows7 update error 80004005        When free version of Windows 10 first came there were numerous attempts to install it on my laptop.  All failed and Windows 7 was reinstalled on my laptop.  Since then none of the monthly security updates have installed on my computer.  Could someone tell me what I can do to install these updates?","solutions":["Start with installing SP1, etc.Here is the information about SP1:Install Windows 7 Service Pack 1 (SP1)To check if Windows 7 SP1 is already installed on your PC, select the Start button, right-clickComputer, and then select Properties.If Service Pack 1 is listed under Windows edition, SP1 is already installed on your PC.@@@@@@@@@@@@@@@@@@@@@@@@@@Installing Windows 7 SP1 using Windows Update (recommended) If your PC is set to automatically install updates, you’ll be prompted by Windows Update to install SP1. Follow the instructions to install the update.Or:And the download link from the above link:Go to the Windows 7 Service Pack 1 download page on the Microsoft website.@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Then:Convenience rollup update for Windows 7 SP1 and Windows Server ...This article describes a convenience rollup for Windows 7 Service Pack 1 (SP1)-based and Windows Server 2008 R2 SP1-based computers. This rollup package includes most updates that were released after the release of SP1 for Windows 7 and Windows Server 2008 R2, through April 2016. This convenience rollup is intended to make it easy to integrate fixes that were released after SP1 for Windows 7 and Windows Server 2008 R2. We recommend that Enterprises include this rollup package in the image creation process to make it easier to quickly set up a computer.There are concise download details about it from aakkam22  in this link:https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_7-update\/how-to-obtain-and-install-windows-7-sp2\/c2c7009f-3a10-4199-9c89-48e1e883051eFurther reading about the above \"convenience update\", dubbed Service Pack 2:https:\/\/www.howtogeek.com\/255435\/how-to-update-windows-7-all-at-once-with-microsofts-convenience-rollup\/Cheers.","Errors that end with 005 are usually rights\/permissions\/access denied kinds of things.For Windows Update the usual culprit is a third party antivirus\/antimalware application that is \"protecting\" the system from changes.If you have a third party AV, temporarily disable it, or uninstall it (you can always reinstall it, right?) and then see what kinds of Windows Update errors you get.Note:  You will never see this Windows Update error with Microsoft Security Essentials (MSE).See this chart from the DOS days and you will know what errors that end with 002 mean, what 003 means and your friend 005:","I have never uninstalled any anti-virus to install the regular Microsoft updates.Some posters even suggest turning off your AV to install programs; that is another no-no.People here forget or don't know about the viruses in the wild that were around even back in XP days."]},{"symptom":"Handling an external hard disk which contains 25 logical partitions        Hope someone can help me out, i have taken the harddisk from one of my old laptops and placed it into an exterior shell. Hence it has been converted into an external hard disk which can be plugged into another laptop through usb port.The concern im having is that it contains 25 logical partitions so drive C: to Z: have been used.I have 2 questions.1)  when i plug this external drive into my laptop  through usb will windows attempt to rename all the partitions (eg C to B)? And will the 25 partitions be visible\/accessible?2) since the laptop already has a C: which is the system drive how will i access the logical partition of C: which is on the external hard disk?Can anybody assist me please, i need to have access to all 25 partitions on the external hard disk, and i dont want windows 10 to change the drive names once i plug the external hard disk in.","solutions":["Hi Munir Yes, Windows will have to re-assign drive letters to that drive when you connect it via USB, since your system is installed onto C of the internal drive . ..Most likely it will assign A to the first partition, even though that is normally reserved for 3.5\" floppy disks, that is most likely the first letter Windows will assignIf you do have any difficulty seeing all partitions on that drive, is WIndows installed on that drive, if so, it would probably be best to temporarily boot from that drive and if necessary, move some data around and remove a partition or two . . .May I ask is there a reasoning for that number of partitions on that drive, is there some sort of mapping going on?"]},{"symptom":"Problem        Hello!Please help me, i installed Windows 7 Lite, and effect aero not supported on my Windows, please how fix it?My Notebook: 1gb RAM processor:1 ghz lenovo s12","solutions":["Windows 7 Lite is not a Microsoft Product.I suggest that you contact whoever you got it from."]},{"symptom":"Bluesreen CRITICAL_STRUCTURE_CORRUPTION        So, i've been having this bluescreen that says critical_structure_corruption from time to time, mostly when i'm playing games.I have tried almost everything that i can find from internet for now.-<Event xmlns=\"http:\/\/schemas.microsoft.com\/win\/2004\/08\/events\/event\">-<System>  <Provider Name=\"Microsoft-Windows-Kernel-Power\" Guid=\"{331c3b3a-2005-44c2-ac5e-77220c37d6b4}\" \/>  <EventID>41<\/EventID>  <Version>6<\/Version>  <Level>1<\/Level>  <Task>63<\/Task>  <Opcode>0<\/Opcode>  <Keywords>0x8000400000000002<\/Keywords>  <TimeCreatedSystemTime=\"2020-01-10T11:01:09.636557400Z\" \/>  <EventRecordID>31858<\/EventRecordID>  <Correlation\/>   <Execution ProcessID=\"4\" ThreadID=\"8\" \/>  <Channel>System<\/Channel>  <Computer>HUPASEMPILAITE<\/Computer>  <Security UserID=\"S-1-5-18\" \/>  <\/System>-<EventData>  <Data Name=\"BugcheckCode\">265<\/Data>  <Data Name=\"BugcheckParameter1\">0xa3a01660f9a8d583<\/Data>  <Data Name=\"BugcheckParameter2\">0xb3b722e74c271e34<\/Data>  <Data Name=\"BugcheckParameter3\">0xfffff80744f000d4<\/Data>  <Data Name=\"BugcheckParameter4\">0x1<\/Data>  <Data Name=\"SleepInProgress\">0<\/Data>  <Data Name=\"PowerButtonTimestamp\">0<\/Data>  <Data Name=\"BootAppStatus\">0<\/Data>  <Data Name=\"Checkpoint\">41<\/Data>  <Data Name=\"ConnectedStandbyInProgress\">false<\/Data>  <Data Name=\"SystemSleepTransitionsToOn\">1<\/Data>  <Data Name=\"CsEntryScenarioInstanceId\">0<\/Data>  <Data Name=\"BugcheckInfoFromEFI\">false<\/Data>  <Data Name=\"CheckpointStatus\">0<\/Data>  <\/EventData>  <\/Event>","solutions":["Hi Joonathan, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.We need log files(called dump files) that tell us what lead to crash. Please share them with us for a better analysis of the problem. Instructions can be found here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Please let us know if you need any assistance about posting dump files.","how i can send .dmp files, onedrive won't let me upload them neither Winrar compress","HiTo upload you need to copy the files to the desktop first. Also you can use any file sharing website you are comfortable with.","here's the link.https:\/\/1drv.ms\/u\/s!AhytutSeed45ixpQAgm581_hu2-D?e=cTJOWl","Hi, All crashes were caused by memory corruption. The next step, Let us try finding any misbehaving driver Enable Driver Verifier: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...(Must create a Restore point before) Upload the newer dumps when you get Driver_Verifier_detected_voilation. Please note that the system might crash before you reach the desktop-if it does please let us know so that we can guide you to disable Verifier."]},{"symptom":"Display is disappired from Control Pannel \/ Realtek hd graphics controll pannel from the PC \/ The pc show 5 extra monitor connected  O.o        Hi I recently reset my PC and reinstalled Windows 10 Home. Never before I encountered a problem like this:1- The Display option that usually and always be in Control Pannel is Disappired !!2-I noticed that Realtek HD Control Pannel is also Disappired3-The strangest thing of all is that there are 5 monitors connected to the PC, while the only screen is that of the laptop,4 Generic Non-Pnp Monitor and 1 Generic nP Monitor.Thank you for the HelpPs. The Monitor Driver \/ Realtek HD Graèhich 4600 are up to date and WindowsUpdate as well..in teory","solutions":["Hello ReKris! My name is Marco, I am an Independent Advisor. I will do my best to help you.For the display option you mentioned in problem number 1, just click on 'Large icons' (as shown in the photo below)For # 2, go to the Device Manager and uninstall the audio drivers and then reinstall them with the latest updated version on the manufacturer's site if possible. Otherwise just uninstall them and restart the pc so that windows reinstalls them.And for the last screeshot you put ... I think you won't like me but the same thing happened to me and the problem was a broken screen ...If you say that your screeshot are normal but not the one taken with your phone, everything suggests that the screen is faulty ... It could be for that it was detected several times in device manager if it tried to reconnect. ....To be sure, if possible, take an hdmi cable and connect your laptop to the television or another screen ... if the image is clean but not on your laptop ... the problem is there."]},{"symptom":"Zune software in 2019        Hello, i have a ZuneHD and want connetc it to my PC. I can't find zune software. Please send me a link od avaleble zune software, or tell me the other way how to connect my zune device to PC. Windows 10.","solutions":["Hi Александр Greetings! I am Vijay, an Independent Advisor. Sorry for being negative answer here, there is no Zune software provided by Microsoft anymore.Open Device Manager > Click View on top > Show hidden devices > Locate the Zune device > Right click on that and Update driver and see whether it gets detected.","Thank you very much. Just found old instalisation file on my PC, and programm works! ","Brilliant work.","I had to uninstall my Zune software yesterday as it was preventing the latest Windows update to complete properly.  Now I need to reinstall it but I cannot find an installer for it.  Would it be possible for you to send me the installer you used so I can try installing it on my Windows 10 system?","wow if you can find this let me know! I found a link to the software but it does not work, it opens and says'to continue, Zune needs to download files to your computer. This might take a while. When the download completes, go to the download location and run the file. Error code 0x80240001 'there is nothing to download though!","Brilliant for him, but the rest of us who still have our Zunes and love them, and the stellar desktop software, are out of luck.It's shameful that Microsoft has pulled some simple files that enable one of their best user experiences. Why? X megabytes in their petabyte cloud? Why can't this continue to work. I'm setting up a new PC to manage my media and I want that software. I know it runs on Win10 because my old HTPC has it installed.","I think I found the correct installer file, but when I run it it just hangs once the install process begins (as shown in the screenshot I attached).  I feel like they made some changes in the latest version of Windows 10 and now the Zune software is no longer compatible with it.I have the installer file on my PC, but now I cannot remember what site I downloaded it from.  The file is called ZunePackage.exe and has a size of 276,992 KB.  I'd share it with you, but not sure how I'd send a file that large.","Sigh. ZunePackage.exe is the (next) missing piece. It's the one the first stage installer (which gets the right .NET Framework) tries and fails to download from Microsoft. Based on the 276K size and the hang, I'd guess that it's trying to pull even more stuff down that also isn't there. Zune is running on my existing Win10 HTPC, so it's not completely incompatible.","Thanks.  I tried to download a Zune setup file from the Xbox site on Google but ran into the same stopper.  Apparently a file is no longer available.  I just want to get the Zune program software on my new computer so I can download and play the fifty or so albums  that currently live on my Zune device.  As it is I have to carry my Zune if I travel and want to access those albums.","It was working on Windows 10 for me until this latest update.  When I get the energy I may try to put together a virtual machine running an older version of Windows just to run the Zune software."]},{"symptom":"Windows 10 - Unwanted Pop-up of DOS window: C:\/windows\/system32\/cmd.exe        This pop-up occurs ever so often, and I cannot find any match between what I'm working with and the sudden pop-up.I'm deleting the window, and it does not seem to have inflicted anything on my pc - but a bit annoyingRegards Finn H","solutions":["Hi Finn,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.To isolate if it is from a PUP or another Unwanted program, please run Malwarebytes full scan. Post the results after completion.https:\/\/www.malwarebytes.comDisclaimer:This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","Hi Sumit,The Malwarebytes has been run (the free version, as I'm using Adaware Pro) and the result is below:Malwarebyteswww.malwarebytes.com -Logoplysninger-Scanningsdato: 04.01.2020Scanningstidspunkt: 14.12Logfil: d0154d1e-2ef3-11ea-973e-a0d3c1634239.json -Softwareoplysninger-Version: 4.0.4.49Komponentversion: 1.0.785Opdatér pakkeversion: 1.0.17229Licens: Gratis -Systemoplysninger-OS: Windows 10 (Build 18362.535)CPU: x64Filsystem: NTFSBruger: HERCHE-PC\\herch_000 -Scanningsoversigt-Scanningstype: TrusselsscanningScanning started af: ManuelResultat: FuldførtScannede objekter: 398534Registrerede trusler: 53Trusler i karantæne: 0Forløbet tid: 7 min, 23 sek. -Scanningsindstillinger-Hukommelse: AktiveretStart: AktiveretFilsystem: AktiveretArkiver: AktiveretRootkits: DeaktiveretHeuristik: AktiveretPUP: RegistrérPUM: Registrér -Scanningsoplysninger-Proces: 0(Ingen skadelige elementer registreret) Modul: 0(Ingen skadelige elementer registreret) Registreringsnøgle: 24PUP.Optional.Reimage, HKLM\\SOFTWARE\\CLASSES\\APPID\\REI_AxControl.DLL, Ingen handling for bruger, 374, 327193, 1.0.17229, , ame,PUP.Opt**** HKU\\S-**** HKLM\\SOFTWARE\\CLASSES\\WOW6432NODE\\APPID\\REI_AxControl.DLL, Ingen handling for bruger, 374, 327193, 1.0.17229, , ame,PUP.Opt****na**** HKLM\\SOFTWARE\\WOW6432NODE\\istartsurfSoftware, Ingen handling for bruger, 655, 399553, 1.0.17229, , ame,PUP.Optional.IStartSurf, HKLM\\SOFTWARE\\WOW6432NODE\\MICROSOFT\\WINDOWS\\CURRENTVERSION\\UNINSTALL\\istartsurf uninstall, Ingen handling for bruger, 6929, 239621, 1.0.17229, , ame,PUP.Optional.WdsManPro, HKLM\\SOFTWARE\\WOW6432NODE\\WdsManPro, Ingen handling for bruger, 6994, 245723, 1.0.17229, , ame,PUP.Opt****na****nal.Revizer.PrxySvrRST, HKLM\\SYSTEM\\CURRENTCONTROLSET\\SERVICES\\NLASVC\\PARAMETERS\\INTERNET\\MANUALPROXIES, Ingen handling for bruger, 42, -1, 0.0.0, , action,PUP.Optional.Reimage, HKLM\\SOFTWARE\\WOW6432NODE\\CLASSES\\APPID\\REI_AxControl.DLL, Ingen handling for bruger, 374, 327193, 1.0.17229, , ame,PUP.Opt****ptional.Reimage, HKU\\S-1-5-21-3772659326-1325289088-2714861399-1001\\SOFTWARE\\LOCAL APPWIZARD-GENERATED APPLICATIONS\\Reimage - Windows Problem Relief., Ingen handling for bruger, 374, 327203, 1.0.17229, , ame,PUP.Optional.Uniblue, HKLM\\SOFTWARE\\WOW6432NODE\\UNIBLUE\\PowerSuite, Ingen handling for bruger, 1467, 519941, 1.0.17229, , ame,PUP.Optional.Uniblue, HKLM\\SOFTWARE\\WOW6432NODE\\UNIBLUE\\Powersuite4, Ingen handling for bruger, 1467, 575145, 1.0.17229, , ame,PUP.Optional.Reimage, HKLM\\SOFTWARE\\REIMAGE\\Reimage Repair, Ingen handling for bruger, 374, 336077, 1.0.17229, , ame,PUP.Optional.Reimage, HKLM\\SOFTWARE\\WOW6432NODE\\CLASSES\\APPID\\{28FF42B8-A0DA-4BE5-9B81-E26DD59B350A}, Ingen handling for bruger, 374, 332494, , , ,PUP.Optional.Reimage, HKLM\\SOFTWARE\\CLASSES\\WOW6432NODE\\APPID\\{28FF42B8-A0DA-4BE5-9B81-E26DD59B350A}, Ingen handling for bruger, 374, 332494, , , ,PUP.Optional.Reimage, HKLM\\SOFTWARE\\CLASSES\\APPID\\{28FF42B8-A0DA-4BE5-9B81-E26DD59B350A}, Ingen handling for bruger, 374, 332494, 1.0.17229, , ame,PUP.Opt**** PUP.Optional.Re****r bruger, 374, 327206, 1.0.17229, , ame,  Registreringsværdi: 9PUP.Opt**** HKU\\S-**** HKU\\S-****nal.Revizer.PrxySvrRST, HKU\\S-1-5-18\\SOFTWARE\\MICROSOFT\\WINDOWS\\CURRENTVERSION\\INTERNET SETTINGS|PROXYENABLE, Ingen handling for bruger, 42, -1, 0.0.0, , action,PUP.Optional.Revizer.PrxySvrRST, HKU\\S-1-5-19\\SOFTWARE\\MICROSOFT\\WINDOWS\\CURRENTVERSION\\INTERNET SETTINGS|PROXYENABLE, Ingen handling for bruger, 42, -1, 0.0.0, , action,PUP.Optional.Revizer.PrxySvrRST, HKU\\S-1-5-21-3772659326-1325289088-2714861399-1001\\SOFTWARE\\MICROSOFT\\WINDOWS\\CURRENTVERSION\\INTERNET SETTINGS|PROXYENABLE, Ingen handling for bruger, 42, -1, 0.0.0, , action,PUP.Optional.Revizer.PrxySvrRST, HKU\\S-1-5-21-3772659326-1325289088-2714861399-1007\\SOFTWARE\\MICROSOFT\\WINDOWS\\CURRENTVERSION\\INTERNET SETTINGS|PROXYENABLE, Ingen handling for bruger, 42, -1, 0.0.0, , action,PUP.Optional.Revizer.PrxySvrRST, HKU\\S-1-5-21-3772659326-1325289088-2714861399-1001\\SOFTWARE\\MICROSOFT\\WINDOWS\\CURRENTVERSION\\INTERNET SETTINGS|PROXYOVERRIDE, Ingen handling for bruger, 42, -1, 0.0.0, , action,PUP.Optional.Revizer.PrxySvrRST, HKU\\.DEFAULT\\SOFTWARE\\MICROSOFT\\WINDOWS\\CURRENTVERSION\\INTERNET SETTINGS|PROXYENABLE, Ingen handling for bruger, 42, -1, 0.0.0, , action, Registreringsdata: 0(Ingen skadelige elementer registreret) Datastrøm: 0(Ingen skadelige elementer registreret) Mappe: 1PUP.Optional.WindowsProtectManager, C:\\ProgramData\\eWMiniProe\\mitest, Ingen handling for bruger, 871, 181216, , , , Fil: 19PUP.Optional.IStartSurf.ShrtCln, C:\\PROGRAM FILES (X86)\\MOZILLA FIREFOX\\BROWSER\\SEARCHPLUGINS\\istartsurf.xml, Ingen handling for bruger, 1241, 186590, 1.0.17229, , ame,PUP.Optional.IStartSurf.ShrtCln, C:\\USERS\\HERCH_000\\APPDATA\\ROAMING\\MOZILLA\\FIREFOX\\PROFILES\\I1L5SHRO.DEFAULT-1392931114046\\PREFS.JS, Ingen handling for bruger, 1241, 301373, 1.0.17229, , ame,PUP.Optional.IStartSurf.ShrtCln, C:\\USERS\\HERCH_000\\APPDATA\\ROAMING\\MOZILLA\\FIREFOX\\PROFILES\\I1L5SHRO.DEFAULT-1392931114046\\PREFS.JS, Ingen handling for bruger, 1241, 301374, 1.0.17229, , ame,PUP.Optional.QuickStart, C:\\USERS\\HERCH_000\\APPDATA\\ROAMING\\MOZILLA\\FIREFOX\\PROFILES\\I1L5SHRO.DEFAULT-1392931114046\\PREFS.JS, Ingen handling for bruger, 1947, 301610, 1.0.17229, , ame,PUP.Optional.IStartSurf.ShrtCln, C:\\USERS\\HERCH_000\\APPDATA\\ROAMING\\MOZILLA\\FIREFOX\\PROFILES\\I1L5SHRO.DEFAULT-1392931114046\\PREFS.JS, Ingen handling for bruger, 1241, 303152, 1.0.17229, , ame,PUP.Optional.Reimage, C:\\WINDOWS\\REIMAGE.INI, Ingen handling for bruger, 374, 412667, 1.0.17229, , ame,PUP.Optional.MySearchDial, C:\\USERS\\HERCH_000\\APPDATA\\LOCAL\\GOOGLE\\CHROME\\USER DATA\\Default\\Secure Preferences, Ingen handling for bruger, 120, 663899, 1.0.17229, , ame,PUP.Optional.WinYahoo, C:\\USERS\\HERCH_000\\APPDATA\\LOCAL\\GOOGLE\\CHROME\\USER DATA\\Default\\Secure Preferences, Ingen handling for bruger, 241, 454791, 1.0.17229, , ame,PUP.Optional.Conduit, C:\\USERS\\HERCH_000\\APPDATA\\LOCAL\\GOOGLE\\CHROME\\USER DATA\\Default\\Web Data, Ingen handling for bruger, 200, 454832, 1.0.17229, , ame,PUP.Optional.ASK, C:\\USERS\\HERCH_000\\APPDATA\\LOCAL\\GOOGLE\\CHROME\\USER DATA\\Default\\Secure Preferences, Ingen handling for bruger, 2, 454825, 1.0.17229, , ame,PUP.Optional.MySearchDial, C:\\USERS\\HERCH_000\\APPDATA\\LOCAL\\GOOGLE\\CHROME\\USER DATA\\Default\\Web Data, Ingen handling for bruger, 120, 663899, 1.0.17229, , ame,PUP.Optional.Conduit, C:\\USERS\\HERCH_000\\APPDATA\\LOCAL\\GOOGLE\\CHROME\\USER DATA\\Default\\Web Data, Ingen handling for bruger, 200, 454832, 1.0.17229, , ame,PUP.Optional.Conduit, C:\\USERS\\HERCH_000\\APPDATA\\LOCAL\\GOOGLE\\CHROME\\USER DATA\\Default\\Secure Preferences, Ingen handling for bruger, 200, 454832, 1.0.17229, , ame,PUP.Optional.MySearchDial, C:\\USERS\\HERCH_000\\APPDATA\\LOCAL\\GOOGLE\\CHROME\\USER DATA\\Default\\Web Data, Ingen handling for bruger, 120, 663899, 1.0.17229, , ame,PUP.Optional.WinYahoo, C:\\USERS\\HERCH_000\\APPDATA\\LOCAL\\GOOGLE\\CHROME\\USER DATA\\Default\\Web Data, Ingen handling for bruger, 241, 454791, 1.0.17229, , ame,PUP.Optional.MySearchDial, C:\\USERS\\HERCH_000\\APPDATA\\LOCAL\\GOOGLE\\CHROME\\USER DATA\\Default\\Secure Preferences, Ingen handling for bruger, 120, 663899, 1.0.17229, , ame,PUP.Optional.MySearchDial, C:\\USERS\\HERCH_000\\APPDATA\\LOCAL\\GOOGLE\\CHROME\\USER DATA\\Default\\Web Data, Ingen handling for bruger, 120, 663899, 1.0.17229, , ame,Adware.Elex.ShrtCln, C:\\USERS\\HERCH_000\\APPDATA\\LOCAL\\GOOGLE\\CHROME\\USER DATA\\Default\\Secure Preferences, Ingen handling for bruger, 291, 454693, 1.0.17229, , ame,PUP.Optional.ASK, C:\\USERS\\HERCH_000\\APPDATA\\LOCAL\\GOOGLE\\CHROME\\USER DATA\\Default\\Web Data, Ingen handling for bruger, 2, 454822, 1.0.17229, , ame, Fysisk sektor: 0(Ingen skadelige elementer registreret) WMI: 0(Ingen skadelige elementer registreret)  (end)","Hi, Yes, PUPs have been removed. So did you check if the issue persists?","Hi Sumit,I ran malwarebytes again and accepted the quarantine optionAfter that a reboot of my pc.During normal activity on my pc, I experienced again the unwanted pop-up of dos window.Unfurtunately I cannot attach a screen dump in Windows Word docx format.RegardsFinn","Hi, To attach a screenshot here you can use the Insert Image button. To upload a file in other formats you need to use Onedrive.https:\/\/onedrive.com Upload File. Right click the file and select Share. Copy the link and paste in the next reply.","Hi Sumit,This is my screen dump from January 5th. https:\/\/1drv.ms\/w\/s!Ahv5KEFfxPKIgox4qsNL8LATbq_JBw?e=kRyErmWhen trying to enter for example CD at the cursor in the DOS screen, no input is acceptedRegards Finn Herche","Thank you Finn. Please download and run Autoruns. Please take screenshot of logon tab and post back:https:\/\/docs.microsoft.com\/en-us\/sysinternals\/d...","Hi Sumit,I hope I have followed your instructions in the right way:)When I'm pressing the Logon tab, nothing happensHere is the screen dump:https:\/\/1drv.ms\/w\/s!Ahv5KEFfxPKIgox5KFjv47KWv2UFFA?e=q0Bu98RegardsFinn","Hi Sumit,I just realized that the different tabs is a way to select the displayRegardsFinn","Thanks Finn. Apparently there are a lot of entries and any one of them is causing the command prompt window.Let us check in batches. 1. Please uncheck everything in the second set (HKLM\/Current version\/Run) except the last two related to Realtek Audio.2. If that doesn't stop, try disabling everything from the second set.(I believe there is nothing which should be enabled)Let us know if it doesn't help."]},{"symptom":"Windows Activation Issue        I am getting an windows Activating issue. I have product key but still it is showing to activate windows.Below is the message shown.Thanks ","solutions":["Hi UmangI am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Likely you have a counterfeit copy of Windows. Get help with Windows 10 Activation errors:https:\/\/support.microsoft.com\/en-in\/help\/10738\/...https:\/\/support.microsoft.com\/en-in\/help\/12440\/...To better diagnose the issue, Please send us the results of both steps.1. Right click Start>Command Prompt-Admin and type in the following command:slmgr.vbs \/dlvYou will get a window, take a screenshot using snipping tool and paste it it next reply.2. Run the activation troubleshooter and send us the snip too.Using the Activation troubleshooter-Windows 10https:\/\/support.microsoft.com\/en-in\/help\/20527\/...How to get a screenshot and post back:https:\/\/answers.microsoft.com\/en-us\/windows\/wik...Please let us know if you need any assistance in posting.","I'm having the same issue he is having I just changed out my motherboard on my pc and it was not allowing me to reactivate windows 10","pcdestination has it for $45 USD and the codes are legit I just bought one and it worked perfectly for me."]},{"symptom":"license key for windows 10 pro        received notice that my windows license will expire soon. PC came installed with windows 10 pro, have long lost original CD, have no idea how to retrieve orig. #   Do I have to buy a new license for $139.00? Computer does show last four numbers\/letters of original; not the whole key.","solutions":["Hi Mark Windows 10 does not expire, this message you are seeing, generally indicates a problem with the Windows 10 licence on that PC, usually that it is a volume licence version of WIndows 10, rather than a consumer version of WIndows 10 . ..1 Do you know the history of your PC or version of Windows? Is your PC second hand or was Windows reinstalled by a PC Repair Shop? 2 Click your Start Button, type cmd then right click Command Prompt and choose 'Run as Administrator'Run or paste this command and hit Enter: slmgr.vbs \/dlv Please post a screenshot of the resulting dialog . . .","Who sent you this notice? How long have you owned your computer? Have you checked the activation on your computer? See example image below, you can find out on yours by going toSettings>Update and Security>Activation."]},{"symptom":"Critical Process Died        So recently I ran my antivirus and my whole windows shut down and showed Critical Process Died error. I tried to run it in safe mode with networking and all, not working. Tried to reset, not working. tried to restore to previous dates, not working Cant go to Login page of windows......only thing that is available is cmd... I think my antivirus changed my registry files and that caused the issue? How to resolve it? Any solutions?thank you...","solutions":["Hi SarbikAcharya Have you tried to run the System File Checker? Run CMD as Administrator then type sfc \/scannow","Hello.How to run cmd as administrator ? I came across same problem.I cannot enter safe mode, but I enter ep system using windows installation media in a usb stick.However, when I tried to retrieve documents, it requires me to provide a recovery key, there is only one recovery key available on my microsoft website, and the identifer is matching. But!!! it still indicated that the key is not right. By the way, I remember I haven't encripted any volume, but on the recovery key page on microsoft website, it tells that the key is for OSV driver, I don't know what is OSV. Please tell me what can I do now, thanks very much. My graduate thesis is inside.","Hi SarbikAcharya Have you tried to run the System File Checker? Run CMD as Administrator then type sfc \/scannow Yes and it says \"Windows Resource Protection could not perform the requested operation\"","I quite empathsize with you, I am experiencing the problem now. If you have solved the problem, please tell me how you handle it , thanks.","Hi, Start your PC in Safe Mode then run the sfc command. You can also try these commands on CMD DISM \/Online \/Cleanup-image \/Scanhealth DISM \/Online \/Cleanup-image \/Restorehealth","Hi, Start your PC in Safe Mode then run the sfc command. You can also try these commands on CMD DISM \/Online \/Cleanup-image \/Scanhealth DISM \/Online \/Cleanup-image \/Restorehealth Hi As i said above i cant go to safe mode. And as far as DISM is concerned. Its showing error 50.Thnx","Hi, SarbikAcharya My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi, SarbikAcharya My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Hi sir.I cant enter safe mode and resetting also doesnt work..and only thing that can resolve my issue is Win 10 bootable. But i want to restore my default registry..can i do that with win 10 bootable?","Try to create the USB to repair Windows, check the links I sent you.","Try to create the USB to repair Windows, check the links I sent you. Definitely sir"]},{"symptom":"I can't play my panda pop game on my Facebook        My game on facebook will not load all the way please help","solutions":["Please help me to get it fix ","Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Could you try use an alternative browser such as Chrome or Firefox? Regards, Ross"]},{"symptom":"Cannot switch out of S mode        After getting 2 viruses in 2 months using s mode, i want to switch out  and get 3rd party anti virus. I went i to mscinfig and checked the selection “boot” safe mode is not checked, so i am assuming i am out of  s modeI did the traditional way and could not get to the selection to switch.So my question is can i uninstall windows  10S and reinstall just windows?","solutions":["I tried everything. Went to a Microsoft store and  they couldnt do it until they wiped my laptop cleanThey un installed 10s and installed just 10. Then I got back home 10s was back on, but was able to switch it off"]},{"symptom":"How do I open an LD file with Windows 10?        How do I open an LD file with Windows 10?","solutions":["Hi Raymond An LD files is generally a Linux or GNU Linker Script, you should be able to open that with Notepad in Windows . . .If you cannot open that in Notepad, where did you obtain that file, do you know what is meant to be in that file?","Thanks Dave. I had transferred a download from 1 computer to another via a cloud back up site and when I tried to open on the 2nd computer it wouldn't open, telling me it was an LD file and suggesting I updated photo viewer.After trying several things unsuccessfully I decided to restart the computer and hey presto it was now showing as a normal word notebook file which I am able to open. Obviously a restart was required to update the cloud on the second computer."]}]}