{"windows":[{"symptom":"windows 7 can not see windows 10        I got a new computer with Windows 10 18363. how can i get my windows 7 computers see it in the network","solutions":["Hi Steve My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Network discovery requires that the DNS Client, Function Discovery Resource Publication, SSDP Discovery, and UPnP Device Host services are started, you may check this on both sides to make sure they are started by pressing the windows key and type services, click on the result and checking the services above are set to automatic and started.Hope this helps.","Hi Steve My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Network discovery requires that the DNS Client, Function Discovery Resource Publication, SSDP Discovery, and UPnP Device Host services are started, you may check this on both sides to make sure they are started by pressing the windows key and type services, click on the result and checking the services above are set to automatic and started.Hope this helps. All set to automatic and started. Restarted both PCs and still the same Win7 can not see Win10","Hi Steve1. Make sure file sharing is switched on the windows 10 computer.Open Control Panel.Choose View network status and tasks under Network and Internet.Select Change advanced sharing settings in Network and Sharing Center.Choose Turn on file and printer sharing or Turn off file and printer sharing, and tap Save changes.2. Enable file sharing through the firewall on the windows 10 pcClick Start, and then click Control Panel.In Control Panel, click Windows Firewall.In the Windows Firewall dialog box, click the Exceptions tab.On the Exceptions tab, select the File and Printer Sharing check box, and then click OK."]},{"symptom":"Meus jogos não rodam mais no Windows 10 [Translation - My games no longer run on Windows 10]        Já faz praticamente um mês que venho tendo dificuldades e muitos inconvenientes com alguns jogos específicos quando tento executá-los no meu computador. Os que apresentaram problemas até o momento são estes:Conan Exiles, Crash Bandicoot N'Sane Trilogy,Spyro Reignited Trilogy e League Of Legends. Também estou tendo problemas com o aplicativo daBlizzard Battle.Net.Todos os jogos são originais, comprados e instalados pelo aplicativo da Steam da Valve, porém mesmo fazendo todos os procedimentos possíveis, não consigo mais jogá-los.  Já tentei diversas alternativas como reinstalar os jogos, verificar a integridade dos arquivos, atualizar o Direct X, atualizar o Visual Basic c++, rodar com compatibilidade, atualizar todos os drives do pc, incluindo o da placa Nvidia, voltar atualização do Windows e da placa Nvidia para a versão anterior e outras coisas mais, porém os mesmos erros ainda persistem.Antes quando instalei a versão pirateada dos mesmos jogos, baixada por Torrent, estavam rodando perfeitamente sem qualquer problema, erro, falha, bug, lag ou delay, consegui até fazer algumas lives pelo Mixer, porém quando tentei reinstalá-las de novo para comparar os arquivos, elas começaram a dar o mesmo problema que os originais. Ou seja, acredito que a questão não é o jogo em si, mas de algo no computador.Eu já não sei mais o que fazer para arrumar ou para o que apelar. São apenas estes jogos que apresentam problemas. Outros que tenho instalados no pc sãoMonster Hunter World, The Witcher 3: Wild Hunt, The Elder Scrolls V: Skyrim - Special Edition, The Elder Scrolls Online, Okami HD entre outros e nenhum deles apresenta qualquer erro ou problema para ser executado.Estas são as especificações do notebook gamer que uso:- Marca: Acer- Modelo: AN515-51-50U2 Sistema Operacional:- Windows 10 Home 64-bitCPU e Chipset:- Intel® Core™ i5-7300HQ- 7ª geração – Quad Core- 2.5 GHz - 3.5 GHz com Turbo Boost- 6 MB SmartCache- Chipset Intel® HM175Memória RAM:- 8 GB tipo DDRPlaca de vídeo:- NVIDIA® GeForce® GTX 1050 com 4 GB de memória dedicada GDDR5Armazenamento:- Disco rígido de 2.5” com capacidade de 1 TB- SATA III (6 GB\/s) – 5.400 RPMO aplicativo da Blizzard Battle.Net não se maximiza na tela, embora eu consiga executar os jogos que tenho (World Of Warcrafte Overwatch) pelos atalhos na tela inicial do pc, porém não posso mais acessar a loja ou mesmo instalar novos jogos já que a janela não se mostra.No caso de League Of Legends, o jogo não abre na tela, embora apareça o ícone na barra de tarefas e a musica da tela de login comece a tocar. Fica apenas um pequeno retângulo branco na tela e que não ajuda em nada.Com Crash Bandicoot N'Sane Trilogy não funciona quando a placa Nvidia é ativada para processas os gráficos do jogo, ele só responde se for deixado para rodar na placa daIntel HD Graphics e que não tem capacidade de suportar e rodar bem o jogo, deixando ele de10 até no máximo 15 fps, isso quando não trava.Já Conan Exiles e Spyro Reignited Trilogy  apresentam os seguintes erros:Conan Exiles:Fatal error:[File:E:\\B\\branch_exiles-stable\\code\\Engine\\Source\\Runtime\\Windows\\D3D11RHI\\Private\\D3D11RHUntil.cpp][Line: 232]Result failedat[File:E:\\B\\branch_exiles-stable\\code\\Engine\\Source\\Runtime\\Windows\\D3D11RHI\\Private\\D3D11Viewport.cpp:289with error 8876017cSpyro Reignited Trilogy:LowLevelFatalError[File:D:\\Bamboo\\buildbot-package\\Engine\\Source\\Runtime\\Windows\\D3D11RHI\\Private\\D3D11Util.cpp] [Line: 233]Result failedat D:\\Bamboo\\buildbot-package\\Engine\\Source\\Runtime\\Windows\\D3D11RHI\\Private\\D3D11Viewport.cpp:303with error 8876017C0x0000000030F89129 KERNELBASE.dll!UnknownFunction []0x000000005D4AE87B Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005D45BB88 Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005D8E9D0E Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005D8DABEA Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005D8E19F1 Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005DCD661A Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005DCD43F1 Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005DE19CE9 Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005DE1A465 Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005D776EA2 Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005D7885DC Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005D78809C Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005E25EC17 Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005E011A40 Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005D0D47EB Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005D0D017C Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005D0D037A Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005D0D6D20 Spyro-Win64-Shipping.exe!UnknownFunction []0x000000005EF880C7 Spyro-Win64-Shipping.exe!UnknownFunction []0x0000000033B77974 KERNEL32.DLL!UnknownFunction []0x000000003456A271 ntdll.dll!UnknownFunction []0x000000003456A271 ntdll.dll!UnknownFunction []Translation: It's been almost a month now that I've been having difficulties and many drawbacks with some specific games when I try to play them on my computer. The ones that have had problems so far are these:Conan Exiles, Crash Bandicoot N'Sane Trilogy, Spyro Reignited Trilogy and League Of Legends. I am also having problems with the Blizzard Battle.Net application.All games are original, purchased and installed by Valve's Steam app, but even though I do everything possible, I can no longer play them. I've tried several alternatives like reinstalling games, checking file integrity, updating Direct X, upgrading Visual Basic c ++, running with compatibility, upgrading all pc drives, including Nvidia card, back windows and card upgrade Nvidia for the previous version and other things, but the same errors still persist.Before when I installed the pirated version of the same games, downloaded by Torrent, they were running perfectly without any problems, errors, crashes, bugs, lags or delays, I even managed to make some lives for Mixer, but when I tried to reinstall them again to compare the ones. files, they started to give the same problem as the originals. That is, I believe the issue is not the game itself, but something on the computer.I no longer know what to do to fix or what to appeal to. It is only these games that have problems. Others I have installed on the pc are Monster Hunter World, The Witcher 3: Wild Hunt, The Elder Scrolls V: Skyrim - Special Edition, The Elder Scrolls Online, Okami HD among others and none of them have any errors or problems to run.These are the specifications of the notebook gamer I use:- Brand: Acer- Model: AN515-51-50U2Operational system:- Windows 10 Home 64-bitCPU and Chipset:- Intel® Core ™ i5-7300HQ- 7th generation - Quad Core- 2.5 GHz - 3.5 GHz with Turbo Boost- 6 MB SmartCache- Intel® HM175 ChipsetRAM memory:- 8 GB DDR typeVideo card:- NVIDIA® GeForce® GTX 1050 with 4 GB of dedicated GDDR5 memoryStorage:- 2.5 ”hard drive with 1TB capacity- SATA III (6 GB \/ s) - 5,400 RPMThe Blizzard Battle.Net app doesn't maximize on the screen, although I can run the games I have (World Of Warcraft and Overwatch) by the shortcuts on the pc home screen, but I can no longer access the store or even install new games since the window is not shown.In the case of League Of Legends, the game does not open on the screen, although the taskbar icon appears and the login screen music starts playing. There is only a small white rectangle on the screen and it doesn't help at all.With Crash Bandicoot N'Sane Trilogy not working when the Nvidia card is enabled to process game graphics, it only responds if it is left to run on the Intel HD Graphics card and is unable to support and run the game well, leaving he from 10 up to a maximum of 15 fps, when not locking.Already Conan Exiles and Spyro Reignited Trilogy have the following errors:Conan Exiles:Fatal error:[File: E: \\ B \\ branch_exiles-stable \\ code \\ Engine \\ Source \\ Runtime \\ Windows \\ D3D11RHI \\ Private \\ D3D11RHUntil.cpp] [Line: 232]Result failedat[File: E: \\ B \\ branch_exiles-stable \\ code \\ Engine \\ Source \\ Runtime \\ Windows \\ D3D11RHI \\ Private \\ D3D11Viewport.cpp: 289with error 8876017cSpyro Reignited Trilogy:LowLevelFatalError[File: D: \\ Bamboo \\ buildbot-package \\ Engine \\ Source \\ Runtime \\ Windows \\ D3D11RHI \\ Private \\ D3D11Util.cpp] [Line: 233]Result failedat D: \\ Bamboo \\ buildbot-package \\ Engine \\ Source \\ Runtime \\ Windows \\ D3D11RHI \\ Private \\ D3D11Viewport.cpp: 303with error 8876017C0x0000000030F89129 KERNELBASE.dll! UnknownFunction []0x000000005D4AE87B Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005D45BB88 Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005D8E9D0E Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005D8DABEA Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005D8E19F1 Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005DCD661A Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005DCD43F1 Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005DE19CE9 Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005DE1A465 Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005D776EA2 Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005D7885DC Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005D78809C Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005E25EC17 Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005E011A40 Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005D0D47EB Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005D0D017C Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005D0D037A Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005D0D6D20 Spyro-Win64-Shipping.exe! UnknownFunction []0x000000005EF880C7 Spyro-Win64-Shipping.exe! UnknownFunction []0x0000000033B77974 KERNEL32.DLL! UnknownFunction []0x000000003456A271 ntdll.dll! Unk","solutions":["Salve Amigo tudo bem? Você por um Acaso tentou após utilizar versões piratas, reinstalar o Windows? Outra questão é, o windows é legitimo? Por isso que versões piratas não são recomendados. mas Pelo que eu vi os jogos com problemas estão em plataformas proprietárias que não são do Windows (como é as plataformas Blizzard e Steam e Riots) sugiro você Reportar para o Windows a Ultima Atualizações mas mais ainda Reportar erro na Steam, no Battle.net e na Riots do LoL","o meu também nao roda mais LoL e hoje baixei conan,rage 2, também nao vai... ja fiz de tudo...depois que atualizei a placa Nvidia gtx 1050 não funciona ,dai voltei p atualização anterior da placa e também nao resolveu... csgo,the witcher 3 ate rodou...se alguém puder ajudar agradeço."]},{"symptom":"Signing in without a Password        Recently, I got a new laptop, which is Windows 10. I tried changing the sign in thing to password (even though the only way to sign in is through pin). Then, I signed out and try to sign back in.However, when I was trying to sign back in, text will be showing up on the screen as shown below:Is there any way for me change the setting without signing back in? Is there a way to sign back in without a password? If so, how?","solutions":["Is there any way for me change the setting without signing back in?-> No, there isn't.Is there a way to sign back in without a password?-> Only if you previously configured Windows to log you in without entering a password.If you could do what you wanted then passwords would be totally useless!","Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.Is the problem that you don't know the password - or are you not seeing an option to enter your password?You should see a \"Sign in options\" text if you clear that message about the PIN not being allowed. If you click that and then click the key symbol you can login by password.It looks like you have your account linked to a Microsoft Account - therefore the password the computer wants is the same as your Microsoft Account password. If you've forgotten that you can use another computer to reset that password provided you can access your email account also. If you need to reset your Microsoft Account password go here: https:\/\/account.live.com\/resetpassword.aspx Regards, David"]},{"symptom":"proxy settings        \"Your device is connected to the internet using a vpn or proxy service.Please disable it and try again.\"Has suddenly appeared on both my laptop and iPhone when accessing media accounts,without me changing settings.The iPhone even when using mobile data.Why would this be?","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.This usually means your connection is being routed via a VPN by your security software. Do you have a security solution which offers a VPN as part of the service on both your devices?That should be pretty easy to check on your iPhone - go to Settings > General > look at the VPN entry.. is it connected to something?Regards, David"]},{"symptom":"Minecraft Windows 10 Edition        Hello,So recently I had factory reset my computer and when I did I had noticed that It says that I do not own Minecraft Windows 10 edition. I had gotten it through the event that Mojang was having because I have had my Minecraft account since 2013. I am confused as to why I had lost the game when I had it prior to me resetting my computer. I have tried resetting the cache in the Microsoft store and refreshing the license of the games as well. I have been trying to find a solution to my problem for many days now with no answer still and I was wondering if anyone would be able to help. Also, I have the Windows 10 version of Minecraft on Xbox, the one where you can play with people on PC, but I don't know if that would make a difference if I have it on there. But if anyone could help that would be greatly appreciated.Thank you, -Peter","solutions":["Hi Peter. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Did you check Microsoft Store settings under My Library and Purchased? Also your MS Account under Purchased Software? If not either place then contact Mahjong Support: https:\/\/help.minecraft.net\/hc\/en-us","Yes to both of those, I have only the version of Minecraft that is there is the Xbox one edition of the game, not the windows 10 edition.","Can you contact Mahjong Support? Maybe it was only a promotional copy. I'd ask them to be sure.","I'll try that. Is there any information you can give me on the support to talk to someone?And also thank you for trying to help.","Easiest is Twitter and Email here: https:\/\/twitter.com\/mojangsupport","Thank you for the help","I'm glad to help. Keep me posted on your progress as I will be here to help until the case is resolved."]},{"symptom":"I cannot type phonetically in Japanese hiragana using qwerty keyboard Windows 10        Hi allI want to type phonetically in hiragana using the Qwerty keyboard. Currently when I type, say, \"h\" + \"a\", instead of getting \"ha\" I get くち. This is odd, since a Japanese keyboard layout would produce a different result again. The \"h\" key would be the hiragana \"mi\" and the \"a\" key would be the hiragana \"wo\".I have read through many threads online here and elsewhere, and watched Youtube tutorials but cannot find a solution to my problem. Most people's issues are to do with toggling between languages or script types in Japanese. This is not my issue.I have tried changing the keyboard from English 101\/102 key to Japanese 106\/109 key and this didn't solve it.I have a new Asus laptop with i7 chip. Can't find the specs of which build of Windows it is, but the laptop itself is only a month old. A previous laptop with an older version of Windows 10 didn't have this problem.Looking forward to some help!b","solutions":[]},{"symptom":"windows 10 pro product key not recognized by installer        I have a brand new product key from Microsoft for Win10 Pro.   I have a blank system with new components, no existing windows installation on it.  I created the dvd installer with the media creation tool and the key is not recognized.  I see no way to proceed at this point.  Ideas welcome.Thakns","solutions":["HI Charles. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Are you choosing the correct version for install? Can you try creating a bootable flash installer which may work better:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... ? Use the BIOS Boot menu key to trigger the media as a UEFI device. You can skip the key during install and add it afterwards in Activation Settings.If further problems contact Customer Service: https:\/\/support.microsoft.com\/en-us\/help\/405170... I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Activating windows 10        I have recently purchased windows 10 for my computer but I see no option to activate my computer now any help is appreciated ","solutions":["Hello. This support article explains the different ways of activating Windows 10. https:\/\/support.microsoft.com\/en-au\/help\/12440\/windows-10-activate","Hi JohnetteWeinberger, My name is Riccardo and I would be happy to assist. Go to Start > type in Control Panel > Click the Control Panel icon > Click System > at the bottom (as in the screenshot) you will see Windows activation - if Windows is already activated you don't have to do anything further (it will say Windows 10 is activated).If you do need to activate it will give you a link that says Activate Windows now and will put you through the process to activate Windows.Let me know if this helps and If you need any further assistance do not hesitate to message me back."," it takes me to the Activation screen it says windows reported that there no product key was found on my computer with the Error code 0xC004f213","Can you do the following... Go to start > type in cmd and press enter Type in: slmgr \/dlv Press enter Can you post the screenshot of the prompt window you get.","here is the screenshot ","Hi JohnetteWeinberger, I recommend contacting Microsoft Support regarding his, the error message given suggest that there may be further requirements than we can give in this Community.You can go here: https:\/\/support.microsoft.com\/contactus\/To open a Chat Support and request a call back.","One last question do you have your product key?"]},{"symptom":"windows 10 knocked out multiple monitors        upgraded from win 7 pro to win 10 pro today. Lost multiple monitors, plus i keep getting a message that nvidia control panel can not be found.I keep getting a message that says that windows can't connect to the graphics driver and has re-verted back to the windows built in graphics. or something like that.any suggestions?its a ge force 8400 gs, compatible with win 10?","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.According to the NVIDIA website that graphics card is supported - it probably will help to re-download the latest available driver manually.You can get the driver here: https:\/\/www.nvidia.com\/Download\/driverResults.a... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Regards, David"]},{"symptom":"Sound cuts in and out when watching video in ANY web browser        I have searched pretty extensively for a solution to my problem and cannot seem to find anything that fixes my situation.  I am currently on Windows 10 Pro v1909.   I am running my sound through an Nvidia 1080 GTX, connected by HDMI to an Onkyo TX-RZ630 Receiver which then runs to a Vizio TV being used as a monitor.  My motherboard has onboard Realtek Audio, which I have disabled for fear that it is causing the issue.  I have disabled all enhancements.   I am using Dolby Atmos sound as my AVR is a full 5.1.2 Atmos setup.  Gaming and movies work as expected and everything is great.  The problem is that anytime I watch any kind of in-browser video, with literally any browser (Chrome, Firefox, IE, Edge), After a few minutes the sound begins to drop in and out.  It makes any web video content unwatchable. If I open the volume mixer overlay, it is not showing these sound dropouts.  My receiver is not registering a sound drop out as an Onkyo receiver typically \"clicks\" when a sound format changes. I have tried running the Windows troubleshooter.  I have updated my Nvidia drivers.  Everything worked fine up until a few weeks ago when I did a fresh install of Windows 10 due to unrelated problems and now I can't watch web video.  Any help or advice will be greatly appreciated. ","solutions":["Bump?  5 days and a microsoft rep can't reply?  ","1st,set sound card in the BIOS,default would be on-board sound chip,if not in use,disable & let the 3rd party sound run..Also,on line video\/audio can be enabled thru  Flash Player,download from macromedia.com\/menu\/flash player,exit all but the installation software so it installs solo.Also,get youre NVIDIA drivers\/software thru  GeForce.com  Geforce is NVIDIA but offers performance software\/add-ons\/etc.Also,youre thinking is good for drivers\/software but you do not show the pc MB Chipset\/Software,this enables all other components to work with the OS..Get this from pc mfg web,or pc hardware mfg (Intel\/AMD\/etc) next would be storage controller software\/driver,follow the link if you run Intel.Also\/And with a upgrade in the OS all software\/drivers must be re-installed.https:\/\/downloadcenter.intel.com\/product\/35125\/Memory-and-Storagethis being win 10 64BIT,edit the tabs for others.Also,for media,open WMP,in now playing mode,R.click on lower L.corner,enhancements,edit the add ons..","So I did literally everything you suggested.  It worked! For a week. I am now back in the same boat but worse than ever.  I feel pretty hopeless here as this computer is my HTPC and I have a brand new TV I bought and I literally can't use it.  I had to buy a firestick so we can watch anything in the living room.  Once the sound goes out, if I mute sound in Windows and unmute, it comes back for about 30 seconds before going out again.  If I open the volume mixer, it still visually shows that sound is playing on both the app (chrome) and AV Receiver.  Any other suggestions would be great. ","Wanted to come back and say that I fixed the issue.  All of your advice was followed and definitely couldn't have hurt anything but it turns out it wasn't the problem.  I purchased a new TV and AV receiver at the same time that I did my format.  Knowing that I was going to be running HDR games and movies on the HTPC, I made sure to replace the HDMI cables with certified premium cables to make sure I was getting the full 18gb\/s to run Atmos and Dolby Vision at 4K.  Turns out the brand new cable I purchased was bunk.  I switched the cable with an old, non premium, 99 cent cable and poof.  Everything works perfectly.  Thanks again and hope this post can help someone else someday. "]},{"symptom":"Reboot Loop Issue        Just now after I have hard resetted my Dell Windows 10 laptop, it had to redownload windows 10 onto it at one where the plugg fell out thus killing the computor. Now when I turn my laptop back on it would say windows 10 failed to install and asks to install by pressing “ok”. I do as the computor just restarts and the same box appears back then asking for me to reboot this again and again. How do I fix this?","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.You might be able to get it in to the recovery mode by interrupting the loading 2 or 3 times - switch it on, while it's still loading up hold in the power button to force a switch off. If you repeat that you should eventually get to the recovery options - from there you should be able to access the Reset option which will start the install from the beginning again.If you can't get that to work another option is to build a USB recovery drive on another working computer and then boot the problem one from that USB drive and reinstall that way. You can download the tool to do that from here:https:\/\/www.microsoft.com\/en-gb\/software-downlo... Regards, David"]},{"symptom":"Rotation Lock missing, Auto-rotate doesn't work.        My SP3 just performed an update. Now the Rotation Lock is missing from the Action Center and Auto-rotate does not work. How can I fix this issue?","solutions":["Hi Paul, I'm Charles, an Independent advisor trying to help. Let's try these steps to verify which of them helps us solve the problem. 1.- This is a link that has been suggested by a Windows MVP, so it is reliable information, follow the steps of regedit.http:\/\/www.surfacetablethelp.com\/2017\/01\/auto-r...I hope the information is useful for you Attentive to any comments Have a happy day Best Regards, Charles. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","My SP3 just performed an update. Now the Rotation Lock is missing from the Action Center and Auto-rotate does not work. How can I fix this issue?DId you find a solution for this Paul? I've been annoyed for hours, and I've tried every tip that has been given on the internet (also the link from CharlesJones32). I've also reset my machine twice, but nothing has worked.Changing the regedit has given me the auto-rotation lock option, but still no rotation is happening when I turn my tablet (of course disconnected from the docking and keyboard).Kind regards,Daniel"]},{"symptom":"What causes my Desktop freezing        For the last month, my desktop freezes after a while and nothing works. I have to do a hard shutdown. Some other times I have to do two or three shutdowns before it will boot up correctly.","solutions":["Hi Milo, My name is Riccardo and I would be happy to assist today with this issue. There are a few things we can do to fix this issue for you... Step 1: Checking Integrity of File System \/ Updates Go to Start > type in cmd > right-click Command Prompt and run as administrator. Type in the following: sfc \/scannow Let the above process run and complete. After that is done, type in the following: dism \/online \/cleanup-image \/restorehealth Let the above process run and then restart your computer. Once logged into Windows 10, go to Start > type in: Check for UpdatesClick the Check for Updates icon Click the Check for Updates button Are you able to get the new Feature Build? 1909? Step 2: Does a Clean Boot keep it from freezing? Perform the steps below: https:\/\/support.microsoft.com\/en-ca\/help\/929135...Does it keep it from freezing? Step 3: Are your Drivers up-to-date? Generally display drivers some times freeze up computers...go to Start > type in Device Manager > click the Device Manager icon > Expand the Display Adapters > choose your display adapter and right-click and update drivers.Step 4: Do a Repair Upgrade If after doing all of the above, it is still not functioning properly, do a Windows 10 Repair Upgrade. Although your files should stay intact; we always suggest backing them up as a precaution.https:\/\/answers.microsoft.com\/en-us\/windows\/for...Let me know if this works for you as I will be here to assist with any further issues.DISCLAIMER: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Dual Monitor not displaying        I hope I'm in the right area as I'm a bit frazzled right now and new to this site.  Setting up a 2nd monitor on my Win10 PC - 1st Monitor is Samsung S27E310 connected to NVidia Quadro NVS 290 graphics card. 2nd is Samsung S270C230 plugged into USB via IOGEAR External VGA converter\/cable. For a while, display setting showed the 2nd monitor not active. It now shows active at least - but still no display. Steps I've taken: uninstalled both monitor drivers and reinstalledrestarted multiple timeschanged display settings on both monitors to be the same - now back to recommended setting.swapped cables between the 2 - this caused the 2nd monitor to display and the first to not display.swapped monitor cables on the 2nd monitor with the one it originally came withrestarted some moreSet 2nd monitor as main display - when I did this all open windows shifted to that monitor - to revert those settings, I logged on to this PC via TeamViewer on my laptop - had no issues seeing both displays via that method. Set 1st monitor as main display and moved windows back.Set display settings to \"Extend\" multiple times Changed power cable - but since I know the monitor already works, I didn't figure that would matter - it didn't.On screen display doesn't offer Factory Reset on the 2nd monitor (but I can see that) so I can't try that option, but I don't think I've ever messed with any of those settings, so should be \"like-new\" settings. Nothing has worked. I've been at this for about 6-1\/2 hours - I figure there is some setting somewhere that I'm missing but for the life of me, I can't find it. I'm not to the point I want to punch the monitor, but close. This has worked before with an older monitor but been a while since I wanted or needed 2 monitors and the old one died a while back. Anyone have a surefire solution? Thanks in advance for any suggestions, whether they work or not.","solutions":[]},{"symptom":"can't scan to email on HP 477 all-in-one since Windows 10 latest upgrade -- help!        My HP 477 wont send an email anymore since the upgrade on Windows 10.  HP wants me to pay for advice on this.  Help!","solutions":["Hi Sandra. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Rather than spending too much more time fiddling I'd simply Clean Install the printer which always works, lasts longer and actually saves time:1) Power up the printer, if wired unplug it's USB cable from PC. 2) Go to Settings>Apps>Apps and Features to find and Uninstall any printer software.3) Use one of these methods to remove all of the old printer drivers: https:\/\/www.tenforums.com\/tutorials\/101274-unin...https:\/\/helpdeskgeek.com\/how-to\/remove-uninstal...4) Now type Control Panel in Start Search, open CP, choose Icon View. In Control Panel open Devices and Printers, right click printer to delete Printer and any scanner or fax of the same name. Restart PC.5) Go to the printer model’s Support Downloads webpage to download and install the latest full software package. Now is also the time to check for any newer printer firmware to install which matters a lot.6) Extract Printer software, right click Setup file to Run as Administrator. Follow the setup screens closely as you install the software. For USB it should prompt when to plug in the printer.Older software may need to be installed in Compatibility Mode to run correctly: https:\/\/www.groovypost.com\/howto\/run-old-softwa... If you have further problems reply back with results of each step. It's also possible that with the latest version of Windows 10 certain features on some software and hardware will not work the same, but this is up to the manufacturer to patch if they become aware of it. A workaround is always to save the Scan to it's folder and attach it from your Email program. Scanning directly to email has always been an iffy feature on most printers. But having the latest software and firmware installed per the above steps assures you'll have the best chance.You can also post in HP forums which can be good: https:\/\/h30434.www3.hp.com\/t5\/Welcome-to-the-Co...I hope this helps. Feel free to ask back any questions and let us know how it goes. If you will wait to rate my post until we are done, I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Sandra. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Rather than spending too much more time fiddling I'd simply Clean Install the printer which always works, lasts longer and actually saves time:1) Power up the printer, if wired unplug it's USB cable from PC. 2) Go to Settings>Apps>Apps and Features to find and Uninstall any printer software.3) Use one of these methods to remove all of the old printer drivers: https:\/\/www.tenforums.com\/tutorials\/101274-unin...https:\/\/helpdeskgeek.com\/how-to\/remove-uninstal...4) Now type Control Panel in Start Search, open CP, choose Icon View. In Control Panel open Devices and Printers, right click printer to delete Printer and any scanner or fax of the same name. Restart PC.5) Go to the printer model’s Support Downloads webpage to download and install the latest full software package. Now is also the time to check for any newer printer firmware to install which matters a lot.6) Extract Printer software, right click Setup file to Run as Administrator. Follow the setup screens closely as you install the software. For USB it should prompt when to plug in the printer.Older software may need to be installed in Compatibility Mode to run correctly: https:\/\/www.groovypost.com\/howto\/run-old-softwa...If you have further problems reply back with results of each step. It's also possible that with the latest version of Windows 10 certain features on some software and hardware will not work the same, but this is up to the manufacturer to patch if they become aware of it. A workaround is always to save the Scan to it's folder and attach it from your Email program. Scanning directly to email has always been an iffy feature on most printers. But having the latest software and firmware installed per the above steps assures you'll have the best chance.You can also post in HP forums which can be good: https:\/\/h30434.www3.hp.com\/t5\/Welcome-to-the-Co...I hope this helps. Feel free to ask back any questions and let us know how it goes. If you will wait to rate my post until we are done, I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.Hi!I ran into the following problem when trying to remove all drivers from the settings drivers  menuFailed to remove package hpne512a4_x64.inf. Access is denied."]},{"symptom":"H-o-w Do I make my \"Cortana\" searchbox work on my desktop?        Hi,     I Can't type Anything in my \"Cortana\" searchbox on my computer, so therefore I Can't use it.... :(H-o-w can I make it work again,like it did before,to find things? I'm mystified... :(Many thanks,Chris","solutions":["Hi,     I Can't type Anything in my \"Cortana\" searchbox on my computer, so therefore I Can't use it.... :(H-o-w can I make it work again,like it did before,to find things? I'm mystified... :(Many thanks,ChrisHi Chris, I'd like to follow up with your concern and help you the best way I can. How is it so far?"]},{"symptom":"How to get file explorer to properly read file names?        So I recently added my music from my sd card to my lenovo laptop. When i go to file explore and click on a music file instead of playing the file it plays the file before it rather the song is in the same folder or not. The name is correct but the title is not. the tile is the song before it and that is what is being played. hopefully there is a way to fix this.","solutions":["I am a little confused by this statement:Instead of playing the file it plays the file before it rather the song is in the same folder or not.To illustrate what you mean, please use snippingtool.exe to create a snapshot of this Explorer screen. Save the snapshot to your desktop, then attach it to your reply.","As you can see the name is somebody else but the title saids its drowning man. So when I go to play it, it plays drowning man and not somebody else. All the titles are one below where they are suppose to be","Hi, please run chkdsk C: \/scan command (change a letter if file are in another drive) and see if it find some errors.When you right-click file and select Properties what properties are open - this file or another?Please reboot PC running reboot command with pressed Shift key.","While in File Explorer, right-click one of the problem files, then left-click Properties. Now examine theDetails tab. On top you have the file name. Under Description you have the title. Does the title agree with the file name? If it does not then your meta-data is jumbled up. You either need to rename the file or recompile your music folder."]},{"symptom":"password and a Microsoft Complaint URL does not work        Can anyone explain why my password is not accepted by Microsoft sign-in when I have two password programs that store my passwords and sign me in automatically? NOTE:I tried to contact the Microsoft complaint dept. at the link below, the link doesn't work any longer. Hmmmmm    I believe it's about time for me to go to Apple, there are so many problems I encounter from Microsoft updates and passwords that are correct, yet I'm forced to change it, I believe Microsoft forces there patrons to change their password for security reasons.    https:\/\/answers.microsoft.com\/en-us\/office\/forum\/office_2010-office_other\/how-do-i-contact-your-complaint-department\/a1b1e81a-8d2b-44 ","solutions":["... I have two password programs that store my passwords and sign me in automatically?Password managers are an excellent idea - everyone should have one. However, you can only use a password manager after you sign in to Windows.You haven't explained anything about the circumstances that lead to your password being rejected, so it's a complete guessing game. I don't think that's what you want.I believe it's about time for me to go to Apple ...Oh, you'll love their complaint department!"]},{"symptom":"Problems with connecting        When I run troubleshooter it says default gateway is not available how do I fix this troubleshooter is unable to fix it","solutions":["This generally means that you're not connected to your router.  Rarely, it could mean that your router is broken.How are you attempting to connect -- wi-fi, Ethernet, cellular?Laptop or desktop\/tower?  Preferably, what is your Dell Service Tag or other brand serial number?Assuming this is at home, what is the make and specific model of your router (or other devices between your computer and the Internet)?Ever been able to get online with this computer and router?  If so, what happened to the computer or other components of the system shortly before the problem began?Are other devices able to access the Internet through the same router?"]},{"symptom":"Minecraft LAN games - Unable to Connect errors.        We have 5 computers in the house:Mom PCDad PCSon PCDaughter LaptopDad LaptopWe get intermittent periods (days and weeks) where some computers can't connect to worlds on other computers.  Other times it's fine.We can always connect to worlds on Son PC and Daughter Laptop.  There was a world on Mom PC that Dad Laptop was playing, and then the next day was unable to connect.  Still unable to connect to it days later.  It seems to go for periods of being fine and then periods of being a problem.We have tried changing what we can think of.  We've tried using it with and without VPN on each side.  As XBox friends and as not friends. Etc.  Google searches have not resulted in anything, and I can't seem to identify what's changing and causing the issue.Any help would be greatly appreciated - we love playing as a family.","solutions":[]}]}