{"windows":[{"symptom":"Windows 10 Font Issue        Hello all,I'm seeing this blurry font a lot now in all browsers, does anyone know the reason and how can I fix it?","solutions":["This may be graphics driver problem.  Have you checked in Device Manager?","Hi Mohamed. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Try resetting the browser to see if that fixes it: https:\/\/www.howtogeek.com\/171924\/how-to-reset-y...Try changing the font in the browser: https:\/\/www.howtogeek.com\/208552\/how-to-change-...Update the Display driver from the PC or Display adapter maker's Support Downloads web page for your exact model number, HP Serial Number or Dell Service Tag - from the sticker on the PC.While there check also for newer chipset, BIOS\/UEFI firmware (very important), network, sound, USB3 and other drivers, comparing to the ones presently installed in Device Manager reached by right clicking the Start Menu.If this doesn't give you the latest or ideal driver for what you need, compare it to the driver offered by the Intel driver update Utility here:http:\/\/www.intel.com\/content\/www\/us\/en\/support\/... or the Nvidia Update utility here: http:\/\/www.nvidia.com\/Download\/Scan.aspx?lang=e... or the AMD autodect utility here: http:\/\/support.amd.com\/us\/gpudownload\/windows\/P... For Display issues one fix that is working is to Roll back or Uninstall the Driver on the Display Device > Driver tab, restart PC to reinstall driver.You can also try older drivers in Device Manager > Display device > Driver tab > Update Driver > Browse > Let Me Pick.Then you will know you've tried everything in addition to Windows Update drivers.Adjust the screen resolution until it fits and looks best at Settings > System > Display.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","My laptop has all graphic drivers updated and working fine ","That is not Device Manager.Win key + x, Device Manager, Display.","Got your point, here you go. all updated and installed properly and the windows is updated too."]},{"symptom":"Toshiba will not change from Tablet mode to Desktop        I am unable to find anywhere in the Windows 10 program where I can change the Tablet Mode to Desktop Mode.  Everything looks fine when it is booting up, then once I type in the password and the final screen with apps appear, this Toshiba becomes stuck in a Tablet Mode","solutions":["Hi Microsoft open the action centre (winkey +A) click on the tablet mode button to turn it offif the tablet mode is not visible click expand. to prevent it starting in tablet mode settings -> system -> tablet mode under \"when i sign in\", select \"use desktop mode\".","Thanks for your help.  Tablet mode does not appear when I press winkey + A.  Where can I find the expand key?"]},{"symptom":"Account Contol pop up        I am trying to update my SIMS  4 game and I keep getting this message:\"Oops… Windows blocked our attempt to download game content. If you'd like to allow Origin to download content to your computer, select \"Retry\" below. When prompted, grant permission within the User Account Control pop-up.\"But no pop-up is coming up at all. HELP ","solutions":["Hi Cindy,There are a number of users reporting this issue with origin, it has been reported that the solution in this thread resolved the issue.https:\/\/answers.ea.com\/t5\/EA-General-Questions\/...It essentially has you clear the origin cache and the launch as administrator.Regards,RossNote: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Cant boot after trying to replace gpu.        Hey all hopefully you can be of assistance.I bought a new\/used rx480 to replace my 1060 3gb. I swapped out the hardware and since then I have not been able to get past my bios screen.For awhile I was getting the diagnosing your pc screen that would sit for ages. I figured it's probably a windows problem so I have now removed my 960 eco and my 2tb wd black drive and am trying to install a fresh copy of windows 10 on my Seagate 1tb hdd. I keep getting past the bios screen to a black screen that doesnt change. Any advice? I have alot of hardware that I bought for a new build but I cant be 100 percent sure of what works because I didnt get a chance to test anything.Ps when I was installing my gpu I did hear an extra click after I thought I had the card seated and thought \" oh **** what was that?\" Hopefully I didnt break anything?My hardware currentlyGtx 1060 3gbRyzen 5 2600Seagate barracuda 1tb16 gb patriot signature ddr4Gigabyte ab350-gaming Thermaltake 500 watt smart series","solutions":["Did you change the motherboard?  If so it is a new computer.","Hi CrazyThugNutzz This is most likely hardware related, you mention an extra 'click' when you added the new GPU . . .If you put your old Gtx 1060 3gb back into your hardware config and remove the rx480 can you get your system to boot?"]},{"symptom":"How Can i Downgrade Windows 10 pro to Windows 10 home single language ?        im in trouble before my laptop was activated to windows 10 home single language by asus company ... but few days ago i using windows 10 pro activation key for the upgrade... everything was fine.. but at the last moment Troubleshoot says already installed windows 10 home single language .. now my windows still in not activated mode.... so pls help me how can i Downgrade Windows 10 pro to Windows 10 home check the images","solutions":["Where did you get the key?","from a giveaway"]},{"symptom":"I CANT SEE ALL THE FOLDERS IN MY SD CARD        I insert the sd card in the sd slot, and it reads it fine on my windows 10 acer, but the problem is that when i open its folder, there is nothing in there, and its at full capacity. It says sdhc (D:) and its at 63.7mb available of 14.4 gb and its in red, because its at full capacity. My cellphone reads all the documents without a problem. I need some help, i want to transfer some files, like my videos and images but ithey dont apprear.","solutions":["have you checked Disk Management?","Hi there, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.Can you perform the following steps: Open File Explorer, and navigate to SDHC (D:) and open it. From the ribbon, choose the \"View\" tab, and then in the Show\/Hide section, checkmark the \"Hidden items\" checkbox.Alternatively, if that does not work, you can click on Options, then in Advanced settings, select \"Show hidden files, folders, and drives\" and press OK.Source: https:\/\/support.microsoft.com\/en-ca\/help\/402831... I hope this has helped you. If this did not work, please reply and let us know and we would be happy to look into providing some different suggestions to make the files visible!Regards, -Ashton","Hi virirangel_2003 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.1. Go to the drive that files are hidden and need to recover. 2. Open CMD as an administrator. 3. Then Type. attrib -s -h -r \/s \/d *.* and press Enter. 4. Check your files. I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Hi virirangel_2003, Rev. 1 Please follow these steps and discard the above steps for more detailed instructions.1. Go to the drive that files are hidden and need to recover. 2. Open CMD as an administrator. 3. Then Type. attrib -H -S E:\\* \/S \/D Command function: – : Clears an attribute. H: Hidden file attribute. S: System file attribute. E:\\*: Drive Path [where the hidden files is located] with * as a wildcard that means process all files.\/S: Processes matching files in the current folder and all subfolders. \/D: Processes folders as well. and press Enter. 4. Check your files. Let me know how it goes. Thanks!"]},{"symptom":"Windows 10 Media Player changes important informaton when transferring loaded music to my phone        I have legally purchased music CD's or single songs legally purchased.  I rip or copy them into my Windows 10 Media Player.  Everything looks and works great.  All the artist, song, album, and other data is shown.When I transfer to my phone, windows media player looses the song information, genre, and other important CD information.This only happens to about 2 % of my music CD's and so far, only with the Rock and Blues Genre.Consequently, I have 5 blues cd's and 1 rock cd that is on the phone but they all have the same cd title, then the song title.Anyone know how to solve this problem.ThanksJREwingRR","solutions":["Windows 10 no longer is being developed for the phone."]},{"symptom":"Cortana not respon to hey cortana        My cortana not respond to Hey Cortana. I need to press windows+c key or the icon to activate it to start talking. Cortana still respond to hey cortana last week.","solutions":["Hello PHANTASM幻 Thanks for posting Microsoft Community. I'm Marcos Independent Advisor. Check Windows updates: On the Taskbar, in the Search window, type Check for updates. Click Check for Updates (in System Settings) in the results. Click Check for Updates and wait for the process to complete. Restart your device. Run the Start Menu Troubleshooter: Navigate to Microsoft’s \"Troubleshoot problems with the Start menu. Click Try the Troubleshooter and then click Start Menu Troubleshooter. Click on the downloaded file and click Next. How you find that file depends on the web browser you’re using.Let the troubleshooter fix them. Let me know if it helps you and if you need further assistance. Regards.","Thanks for helpMy windows is up to date I want to try the Start Menu Troubleshooter but I cant find it.","Try to repair the system files: press the Windows + X keys and select Command Prompt (Administrator) or Windows PowerShell (Administrator), in the window that will open, you must type the commands in their respective order:• DISM.exe \/Online \/Cleanup-image \/Scanhealth • DISM.exe \/Online \/Cleanup-image \/Restorehealth • DISM.exe \/online \/cleanup-image \/startcomponentcleanup • sfc \/scannow Each of these actions can take a few minutes, so it is important to execute one at a time. When finished, you must restart the PC.","Try to repair the system files: press the Windows + X keys and select Command Prompt (Administrator) or Windows PowerShell (Administrator), in the window that will open, you must type the commands in their respective order:• DISM.exe \/Online \/Cleanup-image \/Scanhealth • DISM.exe \/Online \/Cleanup-image \/Restorehealth • DISM.exe \/online \/cleanup-image \/startcomponentcleanup • sfc \/scannow Each of these actions can take a few minutes, so it is important to execute one at a time. When finished, you must restart the PC.I tried the steps above and restart, but the problem still same","Hi Phantasm, There's a lot of things to consider in fixing this issue. However, you may want to check these suggestions: https:\/\/windowsreport.com\/hey-cortana-windows-10\/Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Hi Phantasm, There's a lot of things to consider in fixing this issue. However, you may want to check these suggestions: https:\/\/windowsreport.com\/hey-cortana-windows-10\/Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards, thanks, but I tried the method above before posting here.","Hi PHANTASM幻 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.Have you tried repairing Windows using an in-place upgrade? https:\/\/www.kapilarya.com\/how-to-repair-windows...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Explorer.exe doesn't work        Upon logging into Windows 10, instead of going to my desktop, i am met by the infamous black screen, where all i have is my mouse. I can only go into task manager by pressing ctrl + alt + delete, and ive tried creating a new task to restart and fix explorer.exe, but it says it can not run on my PC, and that i should check with the software publisher, Ive looked at other people's questions online, but none of them help my scenario.","solutions":["Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.Have you tried launching CMD as administrator from Task Manager, then run these commands?Dism \/Online \/Cleanup-Image \/RestoreHealthsfc \/scannowIf you did, were they successful or there were error messages?","Upon logging into Windows 10, instead of going to my desktop, i am met by the infamous black screen, where all i have is my mouse. I can only go into task manager by pressing ctrl + alt + delete, and ive tried creating a new task to restart and fix explorer.exe, but it says it can not run on my PC, and that i should check with the software publisher, Ive looked at other people's questions online, but none of them help my scenario.Hello,Please refer this fix:https:\/\/www.kapilarya.com\/fix-explorer-exe-not-running-on-startup-in-windows-10Let me know if this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP.","Hello, thank you for the help. I did try doing that exact procedure with the regedit and shell files, but that was not effective.","Thank you, but the only thing my computer can do is open the task manager. Ive tried pressing the windows key to open start, but that does not seem to work. I'm still stuck on the black screen.","You can launch CMD with Task Manager. Please see attached image for steps. 1. Click on \"More Details\" (Skip this if you can see the File Menu). 2. Click File > Run New Task. 3. Enter \"cmd\" into Open field, and make sure \"Create this task with administrative privileges.\" is selected. Click OK, and select Yes if prompted.4. Run the command \"Dism \/Online \/Cleanup-Image \/RestoreHealth\". 5. Run the command \"sfc \/scannow\". If successful, please restart the computer (do not shutdown and turn on). If any error messages is encountered, please post them back here."]},{"symptom":"Random restart        I need help understanding why my computer will restart at seemingly random moments. There is no error or lag spike it will just shut off with no warning and then turn back on. It usually happens when I’m playing games but it will restart even when not playing. It will even sometimes corrupt or damage files which i only know by the computer having to “repair” or simply failing to start and asking to restart again. ","solutions":["Hi Matt I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.To better understand the issue, Please see the article below on how to share System logs.http:\/\/www.yourwindowsguide.com\/2017\/12\/how-to-...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads.","Hi Sumit,https:\/\/1drv.ms\/u\/s!AjVpsFS9XnmMgijIuhqE36-d1zid?e=3MvonU this is the link to the system files.Thank you for helping as I have been having this problem for a while.","Thanks Matt. Apparently, except the Ethernet driver issue, nothing constructive was found in the logs to assume the exact cause.You should update\/reinstall Network driver as the first step. Please download a temperature monitor and let us know the temperatures while standard running the same and gaming.https:\/\/openhardwaremonitor.org\/downloads\/Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"Coprocessor\/Graphics Card Driver Issues. Error - Kernel-PnP Event ID 411        I have tried multiple times to install drivers for a coprocessor\/graphics card however when I check Event Viewer I get the following error which I would like to be fixed:- System   - Provider    [ Name]  Microsoft-Windows-Kernel-PnP    [ Guid]  {9c205a39-1250-487d-abd7-e831c6290539}    EventID 411    Version 0    Level 2    Task 0    Opcode 0    Keywords 0x4000000000000000     EventRecordID 919    Correlation    - Execution    [ ProcessID]  4    [ ThreadID]  312     Channel Microsoft-Windows-Kernel-PnP\/Configuration - EventData   DeviceInstanceId PCI\\VEN_8086&DEV_2249&SUBSYS_ED0A8086&REV_30\\4&fc7f53b&0&0018   DriverName oem9.inf   ClassGuid {4d36e97d-e325-11ce-bfc1-08002be10318}   ServiceName micx64   LowerFilters    UpperFilters    Problem 0x15   Status 0x0","solutions":["Hi Dan, Please determine the Model and Brand of your Motherboard and install necessary Chipset Drivers as well.Please let me know if you already did. Thanks and regards,","Hi Richard,I am using an ASUS X99-M WS motherboard. I may try reinstalling chipset drivers if that could be the issue.Thanks,Dan","Hi Dan, Most of the time, yes. Please update me if it will work. I'll be waiting for your feedback. Thanks and regards,","Hi Richard,The latest drivers for the chipset are already installed and I tried reinstalling but I still can't send commands to the device or access it.Best regards,Dan"]},{"symptom":"Crashing: driver power state failure, faulty RAM, driver errors? If anybody could help me identify the problem, and solve it, I would be very grateful.        Hello, I recently got my computer fixed. Graphics card blew out, and hard drive was corrupted.I outlined in the picture below, my computers specs & what hardware I had replaced on it.In the same picture is an error that I have been receiving.I did some research and found that people were saying this error was due to faulty drivers being installed.I bought this software to update all my drivers, and the problem still persisted.I also have an error with my RAM?Outlined in picture below.Also another error I got today, pic below.If anybody has a good lead on where I should begin diagnosing this problem, please reply to this thread or email me at *** Email address is removed for privacy ***Thank you!","solutions":["Hi,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.We need log files(called dump files) that tell us what lead to crash.Please share them with us for a better analysis of the problem. Instructions can be found here:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Please let us know if you need any assistance about posting dump files.","I had a bit of an issue, my dump files on my computer were all stored in a Complete Memory Dump, called \"MEMORY.DMP\"after tinkering around with it in WinDbg, BlueScreenView, and WhoCrashed, and receiving the \"UNEXPECTED-KERNEL-MODE-TRAP\" error,I decided I needed to change the way my dump files were stored into small dump files, and wait for the next crash.I now have a proper crash log right here.( I put the new crash (mini dump) and the complete dump (broken) in this google drive, in case there is more you can do with the complete dump than I can)I compressed the complete dump so that it could be uploaded more easily.Crash Dumps","Here is another crash screenshot that occured while using paint.net.I believe due to the original RAM issue, and not having enough available memory to maintain it running.","Hi Chris, First of all, there was no need for installing a driver updater. Programs that claim to install the newest driver often install wrong or buggy drivers. Suggest uninstalling those as soon as possible.Secondly, Please install the latest BIOS for the motherboard from here: https:\/\/www.msi.com\/Motherboard\/support\/B360M-P...Third, Please do a System File check and run DISM tool and post back the results in the next reply:http:\/\/www.yourwindowsguide.com\/2016\/06\/run-sys...Content on the above blog is written by a Microsoft MVP so it is safe."]},{"symptom":"The device or resource (localhost) is not set up to accept connections on port \"The World Wide Web service (HTTP)\".        Every time i try to access my localhost through any of the browsers it shows that the connection is refused. i tried changing the proxy settings and firewalls setting but all in vain. i tried every possible solutions available on internet to get access to it but of no help. troubleshooting showed that the localhost is not set up to accept connections or port \"the world wide web service(HTTP)\".","solutions":["Hi aakanksha, I am Dexter, an Independent Advisor, here to help you. Are you running any web services that mapped to port 80? When you use the browser to visit http:\/\/localhost, it will send requests to port 80(default HTTP protocol port), you could check if there's any process that uses port 80 by the commandnetstat Press Windows Key + R to open the Run window, type and run cmd to open the command prompt, then run this command: netstat -ano | find \":80\" The output will show which process binds to port 80, the rightmost number is the PID of process.I hope this helps. Feel free to ask back any questions and let me know how it goes. I will keep working with you until it's resolved.","Every time i try to access my localhost through any of the browsers it shows that the connection is refused. i tried changing the proxy settings and firewalls setting but all in vain. i tried every possible solutions available on internet to get access to it but of no help. troubleshooting showed that the localhost is not set up to accept connections or port \"the world wide web service(HTTP)\".Please tell us more about what it is that you're trying to do.   Perhaps we can suggest an alternate technique","\"localhost\" means your own computer. You can't connect to your own computer through a web browser.","well , thanks for listening to my problem and helping me in solving it out. I tried checking the port on cmd and I got nothing related to port 80 . I am naïve in computer networking and ports so could you please tell me step wise step what should I do . I was trying to check my app on localhost and was unable to do so.  ","I was trying to test my python project on localhost."]},{"symptom":"SHAREIT        when using SHAREIT,  error  the port55283 is occupied . can you help me","solutions":["Hi,Please try running the program as an administrator. It's also worth trying to run the program with the \"share files via shareit option* as these have been common fixes for the same issue.I hope that helps"]},{"symptom":"pc not letting downloads run        so when i download something on a browser it will download then i get the option to let it make changes to my pc as normal but then it will open for like 2 seconds then close or just not open at all and its dose this for most things but not everything","solutions":["Have you gone File Explorer and clicked on the downloaded .exe file found in Downloads folder?","Hi TTV. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Find the download by opening File Location, right click to Run as Administrator. If that fails try another browser. I would have several browsers on your task bar so there's always one that's best for the task. I use Firefox, Edge and Chrome in that order of preference. It's easy to share bookmarks between all of them in their settings under Import Favorites from another Browser, and Firefox and Chrome let you sign in to save and\/or sync your Favorites on any other device you sign into. Set the preferred browser as Default in Settings > Apps > Default Apps.If that fails then Reset the browser to see if that fixes it: https:\/\/www.howtogeek.com\/171924\/how-to-reset-y...If this is Edge I'll give you everything that works to fix Edge so at least something will work:Back up your Favorites first in Edge Settings > Import from another Browser > Export to a File. If you can't reach Edge you can install the tiny app Manage Edge Favorites here:http:\/\/www.emmet-gray.com\/Articles\/EdgeManage.html to do this, which also gives Edge all of the Favorites Management enjoyed in Internet Explorer.You can reset Edge in Settings > Apps > Apps and Features, scroll down to Microsoft Edge, highlight it, choose Advanced Options, then Repair, or if that fails, Reset.If that doesn't help then try re-registering the app following Option Two here: http:\/\/www.tenforums.com\/tutorials\/3175-apps-re... Edge is being rebuilt on the Chrome chassis and will be re-released soon: https:\/\/www.windowscentral.com\/faq-edge-chromiumIf you want to preview the new Edge Browser you can join the Edge Insider program and even interact with developers:https:\/\/www.microsoftedgeinsider.com\/en-us\/?for... I would have several browsers on your task bar so there's always one that's best for the task. I use Firefox, Edge and Chrome in that order of preference. It's easy to share bookmarks between all of them in their settings under Import Favorites from another Browser, and Firefox and Chrome let you sign in to save and\/or sync your Favorites on any other device you sign into. Set the preferred browser as Default in Settings > Apps > Default Apps.If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This will also bring it up to the latest version 1909 which you need anyway by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"How to Install .net Core3.1 SDK using vsbuildtools 2019 offline Installer?        Could anyone please advise me how to install .net core3.1 SDK using VSBuildTools 2019 offline Installer?I am trying to install this  on Windows Server 2016I have given a try with below layout. But no luck.\\vs_buildtools__140882496.1541481122.exe --layout .  --add Microsoft.VisualStudio.Workload.NetCoreBuildTools --lang en-US","solutions":["I would suggest you try the Technet forum.","Hi Rajkumar I am sorry, Community is just a consumer forum, due to the scope of your question (Server 2016) can you please post this question to our sister forum on TechNet in the Server 2016 section (linked below)Over there you will have access to a host of Server 2016 experts and will get a knowledgeable and quick answer to this question . ..https:\/\/social.technet.microsoft.com\/Forums\/en-...","Thanks for the suggestion.will the same question in the suggested forum."]},{"symptom":"Stuck in Preparing Automatic Repair        Hey, all. I need some help. Im trying to get some work done, sat down at my laptop (MSI GE62) and for the first time got instead of the spinning dots, just \"Preparing Automatic Repair\" it never actually takes me to the Automatic Repair to run any troubleshooting. Ive tried the whole offonoffon job but just never takes me past the \"Preparing\" stage. What can I do? Ive got some folders on here that i needed to back up (i i kw, stupid) and im afraid running hard shutdowns might jeopardize that even more.","solutions":["Hello BENRASY, I am Andrew an independent advisor. How long did you wait at the repair screen? It could take a while to progress. Is the hard drive activity light flashing?","Hello BENRASY, I am Andrew an independent advisor. How long did you wait at the repair screen? It could take a while to progress. Is the hard drive activity light flashing?I m having the same issue. Mine gets to repaired system partition \\\\?\\system partitionAnd then I sit here and wait but nothing happens. What else can I try?"]},{"symptom":"keyboard settings\/ accuracy        is there a way to lessen the keyboard stroke accuracy? I have a fused wrist because my finger tendons burst due to RA.  If I hit the corner or too high or low on the key the letter doesnt type at all and it would be easier if I hit anywhere on the key. I have a Lenovo Flex 11.","solutions":["Hi,You can adjust the repeat delay in the Control Panel keyboard settings which may go someway towards helping with this. Keyboards are largely limited with settings like this though as it's a linear activation it's generally only detecting on\/off from the hardware. Meaning the issue exists before the OS has the information the they key can been pressed.Sorry I couldn't help with this further."]},{"symptom":"Reinstalling windows 10 on a vista machine                      Was given this vista pc, I Made a mistake and reset the device to its original state. I got this computer very used but in good shape had a lot of things stored from the previous person. this was about 4 or for five months ago. Well I totally messed the computer up because the I didn't do something right. I Got a feeling my computer has been hacked, not 100% but pretty suspicious of it. Just allot of different things going on that I don't fully understand. my brother is a computer guru. and suggested I just reinstall windows 10.If my Microsoft  account is linked to a digital license key. How do I go about this correctly? Will this Digital license key to Windows 10  Home. Allow me to Bypass all the Headache I created last time? ill Pull the files I want to save, Create an Install drive or disk.  Will this work?  And how do I check \/ obtain my license key for Microsoft office. I need to be able to retain that as well.I am not that computer savvy but know enough to get things done. I might be on the right track but want to make sure. pull experience from The community.","solutions":["If the computer was activated there is no longer a need for a key.If asked for a key just go to the bottom of the page and click on Skip, Do this later, or I do not have one.","Hi TeslaGB Because you have previously had windows 10 installed and activated on that device, you can reinstall windows 10 anytime you wish.to get the best install, with fewest issues, use the media creation tool to create bootable media and clean install windows 10.make sure to get the same edition of windows 10 (home,pro etc) that was previously installed.during install, skip the pages that ask for a key, it will activate automatically when you go online.Greg Carmack's article can help in guiding you through a clean install https:\/\/answers.microsoft.com\/en-us\/windows\/for...","Use the Windows 10 media creation tool on the Software download page \"Start fresh with a clean installation of Windows 10\"https:\/\/www.microsoft.com\/en-us\/software-download\/windows10startfreshReinstall Windows 10:https:\/\/support.microsoft.com\/en-us\/help\/4000735\/windows-10-reinstall\"How to Clean Install Windows 10\"http:\/\/www.tenforums.com\/tutorials\/1950-windows-10-clean-install.html_______________________________________________How to Create Bootable USB Flash Drive to Install Windows 10 fromThis tutorial will show you how to create a bootable USB flash drive that can be used to installWindows 10 with or without UEFI.________________________________________________To access BIOS\/UEFI - UEFI\/EFI configuration:https:\/\/neosmart.net\/wiki\/boot-usb-drive\/_____________________________________https:\/\/support.microsoft.com\/en-au\/help\/12440\/windows-10-activation@@@@@@@@@@@@@@@@@@@@@@@@You don't say where you bought Office from.Find your downloads and product keysMost software you buy directly from Microsoft Store as a digital download, like Office, Windows, and Xbox games, can be downloaded, installed, or reinstalled inorder history. Find the software and then selectProduct key\/Install._____________________________________________Or read this: \"Manage, download, back up, or restore Office products\"https:\/\/products.office.com\/en\/download-back-up-restore-microsoft-office-products\"Find your Office product key\"https:\/\/support.office.com\/en-us\/article\/Find-your-Office-product-key-12a5763a-d45c-4685-8c95-a44500213759"]},{"symptom":"Creation of Decoy Administrator        I am stuck with Microsoft Windows Decoy Administrator Vulnerability.Below are the questions i have! Need Help1. Can this be done remotely?2.Can this be done using a patching tool?3. if not patching tool, do i need to login using admin credentials  and perform the below activity?                 1. Login to Server          2. Rename Administrator account          3. Create a user account, name it as Administrator and disable it.          (Source of above steps: Vulnerability report.)Note: Please correct or mention the correct steps to fix this vulnerability.4. Does it require a reboot? after performing this activity?Windows versions which need this implementation:Windows 2008 R2 Std 64bit SP2Windows 2008 R2 Std 64bit SP1Windows 2008 R2 Std 64bitWarm RegardsVidhyadhar ","solutions":["Hi Vidhyadhar I am sorry, Community is just a consumer forum, due to the scope of your question (Server 2008) can you please post this question to our sister forum on TechNet in the Server 2008 section (linked below)Over there you will have access to a host of Server 2008 experts and will get a knowledgeable and quick answer to this question . ..https:\/\/social.technet.microsoft.com\/Forums\/Win...","Your question is beyond the scope of these ForumsThis Community is mainly for home users and their computer problems, not business systems.Kindly post your question in the TechNet Server Forums.http:\/\/social.technet.microsoft.com\/Forums\/windowsserver\/en-US\/home?category=windowsserverTechNet Forums: https:\/\/social.technet.microsoft.com\/Forums\/en-US\/homeMSDN Forums:https:\/\/social.msdn.microsoft.com\/Forums\/en-US\/homeCheers."]}]}