{"windows":[{"symptom":"Screen resolution wrong        I was playing Jurassic World: Evolution when all of a sudden my screen became far too zoomed in, becoming 1024x768 instead of what I assume to be 1920x1080, so I quit the game, and went to find a way to fix it. There was no option to switch it back to 1920x1080, so I had to put it to 1600x1200 just to more easily see what was going on. I also checked my graphics driver, and it said it was up to date, so I don't know what happened. I think it happened because I had kept on pressing the windows key to exit the game temporarily, but I have no idea if this is the case. Hopefully someone knows what to do. I'll have to use 1600x1200 for now.","solutions":["Hi, Are you able to see 1920x1080 under Settings > System > Display > Display Resolution? Full screen programs are able to change the resolution which can lead to issues occasionally when switching between the two as your display resolution changes when you alt tab (or hit the windows key). Every time this happens the desktop is redrawn. If you want to avoid this and make switching quicker try running supported games in borderless window mode. Effectively running the game as a normal window just cutting off the Windows UI. Means the desktop is always drawn out so switching is quicker. I hope that helps.","Nope, no option for 1920x1080, but thanks for the advice!","What's listed as Recommended on the drop down? Also worth looking up the model of your monitor to find out what the resolution should be."]},{"symptom":"Windows 10 Display arrangement        I have always had a difficult time arranging multiple displays.  For instance, if I have two 4k monitors both with the same 4k resolution but one is 40\" the other 32\".   They are obviously not the same size but In WIndows, the rearrange your displays widget shows the monitors the exact same size.  Windows is not querying the monitors correctly for their true \"size\" apparently.Question is, where can I manually specify the display sizes so they appear in the rearrangement tool correctly?","solutions":["Hi gettnmorebetter as far as windows (or any OS) is concerned, if they have the same number of pixels then they are the same size.the larger screen has larger pixels so it has the same number of pixels as the smaller screen.the different physical size has no impact on how windows interacts with the monitors.the only way to make the diagram reflect the physical size is to choose a slightly lower resolution on the smaller monitor","Thanks for the reply.  If this is true, Windows 10 has a bit more to go before it is capable of managing multi-monitors effectively.Windows does know something about the physical size of a monitor as Windows recommends 100-350% scaling depending on the size.  Like my 55\" 1080 TV defaults to 300% and my 4k 40\" defaults to 150%.  Windows obviously has \"some\" idea of the physical size of a device.  My 55\" TV actually shows up BIG in the rearrangement widget even though it's only 1080p so it's not exactly 1:1 based on the resolution.This lack of proper monitor management has a negative impact on comfort and ergonomics.  The problem is, without correct physical sizing, the mouse cannot pass between monitors correctly and often gets stuck at the edges of monitors.  Also, apps that span multiple monitors do not line up properly and are not zoomed correctly.   This is hugely annoying.There must be a way to manually manipulate the physical size, still looking for a solution.","you can drag the boxes in settings -> system -> display to align the monitors so that it doesn't get stuck at the edges.i will release the thread, perhaps an expert has a different idea."]},{"symptom":"How to disable dual monitor shortcut keys        I am having an issue with a shortcut key that causes my windows to move right until they are entirely over to my second monitor. It does this with a single click of the right directional key on my keyboard. The same key I like to use to move around my work when typing (such as this message). If I use the directional key to attempt to move my text line, it instead subs my window from full screen to windowed mode, and then each subsequent click moves the window right until it is entirely on my second monitor. This is frustrating as I type frequently and now I cannot freely move among my work using the directional keys because the right key is now a shortcut for something else. How can I either change this key binding or disable it?","solutions":["Hey there trelam, Evan here an independent adviser here to assist. One thing I would suggest is typing snap settings in your windows search bar and disabling Snap entirely.This should solve the problem. If not please let me know and I will give you some more advice."]},{"symptom":"Black screen spinning circle. Not way to check what's causing it?        Hello, so periodically my windows 10 home system will hang during boot on a black screen with a loading circle forever unless I reboot the system. I have no idea what it's even loading when it hangs, is there no option to have it post what it's initializing like windows used to have? Do I need to upgrade to win10 pro for this feature or does it no longer exist? It's extremely frustrating when I have to do a google search for an issue that has literally hundreds of potential causes and no specific answers.","solutions":["Hi Nathan Did this start happening after a specific update to Windows 10, you are correct, this is widely reported and there does not seem to be a definitive fix for thisThere would be no benefit to upgrading to the Pro edition . . . Click your Start Button, type winver and hit Enter On the resulting dialog, what Version No. and build No. of Windows 10 are you running?"]},{"symptom":"Disable Reserved Storage        I am unable to disable reserved storage, I kept trying and there is just no \"Reserved Storage\" tab in my Registry Editor and I am not sure what to do.","solutions":["Hi AveryMillis1 are you sure that the reserved storage feature is enabled? is this a new machine? or have you clean installed windows 10 1003 or later? check in settings -> system -> storage click on show more categories click on system & reserved is reserved storage in the list? check settings -> system -> about under windows specifications what version is installed?","Yes it is still on the listVersion 1809 is installed","that is strange, reserved storage was introduced with version 1903 and switched on by default in a clean install (sorry about the typo earlier)and should not be showing at all in 1809 how much space does it say is reserved, could you post a screenshot of the system & reserved list","space reserved is 105 GB","that is system reserved, the disk space taken by windows and is not the reserved storage feature.although that does seem more than a little high, i suggest you run a clean up including system filesclick start, type disk clean-up select c: drive and click ok click the clean up system files button select c: drive and click ok i would suggest selecting everything but you may want to check through the list click OK your version is also over a year old, i would suggest upgrading to 1909 use Andre Da Costa's illustrated guide to perform a repair upgrade. https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"Computer goes to sleep when screen goes off        My laptop sleeps when the screen goes off regardless of the sleep time settings. I followed all the steps described in thisthread to fix it but to no avail. Perhaps a fresh reinstall of Windows would fix it?HP ENVY X360 - 13-ar0005na","solutions":["Hi JH, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Before doing a reinstallation, let's see if these indications can help you. The first link is steps offered by a Windows MVP on its website.https:\/\/www.thewindowsclub.com\/windows-10-goes-...https:\/\/www.thewindowsclub.com\/extend-laptop-ba...If the previous steps do not solve the problem, you can test the behavior with the creation of a new user in Windows.https:\/\/support.microsoft.com\/en-us\/help\/402692...If the problem persists, start Windows with a clean boot, it is an error-proof process, which allows us to detect if any third-party program or driver is generating the problem.https:\/\/support.microsoft.com\/en-us\/help\/929135...Let me know if you have something else that I can help you with, I'd be happy to help.Happy holidays Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Auto duplicating action on file copy\/move        Hello, a problem happens with me many times in the latest version of Windows 10 and in older versions as well.When copying\/ moving files Windows asks me what to do with files with same name that do already exist. (Write over\/ skip\/ add both). This is the normal situation. BUT, I had many cases where Windows didn`t ask me and automatically added duplicates by adding a number to the end of file name.This happens with multi-disk operations as well as single disk operations.This happens occasionally, and I don`t know why and when this happens.Latest version in use now: Windows 10 1909 18363.535","solutions":["Hello Eng., I'm Didi, an independent advisor. To solve your issue where Windows doesn't ask you what you want to do when moving or copying files with names that already exists try the procedures provided by Prakhar_Khare on this thread (scroll down and click on \"Replies\" to see his answer, it might be hidden at first) : https:\/\/answers.microsoft.com\/en-us\/windows\/for...Regards, Didi","Thank you for your reply.I followed steps mentioned there, and I`ll see if I`ll have the same problem again.Thank you,Happy holidays!","Hi Eng. and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.Do you still encounter the problem? Please give us an update. Feel free to ask back any questions and let me know how it goes. Thank you!"]},{"symptom":"microphone access by app        Can't figure out if Amazon is hacking my laptop microphone?","solutions":["Hi bronco95, My name is Riccardo - do you believe this is happening because you have possibly talked about something and ads have come up that relate to that discussion?Depending on the apps you have installed, there are some apps that do listen and target ads. You would have to check each apps End User License Agreement and Privacy Policy.Amazon would not be the one listening; they use third-party advertising companies to serve those ads...I have a sticker on the webcam on my laptop, so do other people...do what makes you comfortable and if you believe you are getting targeted ads, you can definitely just disconnect the microphone to the time you need it.Let me know if you have any further questions."]},{"symptom":"remote desktop        windows 10 no longer connects to remote xp computer on same network","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Can you try the steps in this guide on the xp machine and then attempt to connect again.https:\/\/www.sysprobs.com\/enable-ping-in-xpRegards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi JimWilmot, With an XP machine on the network, you may have needed the SMB1 client. This is deprecated and would be turned off by default on the new PC. Compare the settings of one of your working W10 PCs with the new one.(the solution above was copied verbatim from: https:\/\/www.tenforums.com\/network-sharing\/11637...)"]},{"symptom":"Top of the window gets cut off        I got a problem that keeps appearing sometimes when i maximize my windows in windows 10. It looks like this:How can i solve this? I'm running a dual screen setup and windows 10. ","solutions":["A temporary fix is to use the key combination Windows key + Ctrl + Shift + BI think it resets the graphics driver. Note that your screens will go blank for a second.Hopefully the issue is resolved in the new build being released soon."]},{"symptom":"Downloading Word and Excel        I would like to download Word and Excel to my laptop, currently I have the basic Microsoft Office. How can I do this for free, without the added nonsense that comes with it when I go through Microsoft Store. Preferably free of course.","solutions":["Hi Karen Microsoft Office and all the Applications in that Suite are not free, they do not come with Windows and do not come free on a PCIf you are running the Office 2010 Starter edition, that came free with PC's back then, but that version is no longer availableIs that currently installed on your System, then if so, are you intending re-installing Windows and will then need to re-install Office 2010 Starter?"]},{"symptom":"Windows PowerShell        I would like to know how to stop Windows PowerShell from opening every time I start my computer!","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.PowerShell might have been added to the Startup folder for some reason - this article explains how to check common start-up areas - you may find it listed in one of these:https:\/\/support.microsoft.com\/en-gb\/help\/402626... Additionally there could be a scheduled task running at start-up which is causing it to appear. If you click START - and then type \"task scheduler\" you should be able to find and open the Task Scheduler window - review the items in there to see whether something is causing the Powershell to open - you'd be looking for a task which is triggered by \"log on of any user\". You can right-click and disable any scheduled item you think might be responsible and then restart to see if the problem is solved.Regards, David","Hello Glenn,As David posted, it could be something set as a startup item causing Windows PowerShell to run at startup.You can check all the locations in the tutorial below to see if anything may be opening PowerShell. You can disable it first to test in case you need to enable it back, and delete it once confirmed an item is the cause.https:\/\/www.tenforums.com\/tutorials\/2944-add-delete-enable-disable-startup-items-windows-10-a.html","I would like to know how to stop Windows PowerShell from opening every time I start my computer!It's not Powershell that is your problem ... it's what commands are running in Powershell!Powershell doesn't open and close a blank window by itself. It opens to run one or more commands and then closes.What commands are being executed?"]},{"symptom":"Email Attachment is Encoded in ANSI        I have been trying to open an email attachment that is encoded in ANSI. Is there a way to translate this into English? or at least in Latin without the codes\/symbols? It is a poem that was written for a dear friend of mine who recently passed and I am unable to read it...any advise would be greatly appreciated!! Happy New Year!","solutions":[]},{"symptom":"CD Drive keeps disconnecting        Hello, I have an issue with my CD drive. The Drive is a TSSTcorp CDDVDW SH-222 AL.Windows appears to keep disconnecting it. Windows will play the \"Device Disconnected\" sound, and the drive will dissapear. I have repeatedly checked the connections, and the drive is powered, and functions.Once it has disconnected I have to unplug it from the motherboard and then reconnect into another port. It will continue to work correctly, but will disconnect later.I have tried updating the driver whilst it is connected and working properly, but this doesn't work. Windows driver, or manufacturer driver, neither seem to prevent this device from disconnecting.Renaming the drive does not work, I've been through a whole bunch of letters to assign to it, none of them make a difference.Device Manager lists it as disconnected. Power saving options are disabled.My anti-virus is ESET NOD32 Antivirus.This issue persists through restarting. I regularly use windows update.My motherboard is a GA-H67MA-D2H-B3.I would like very much not to have to power off my computer, get down on my hands and knees, disconnect everything from it, unscrew my side panel, disconnect and then reconnect the cables, and then do everything I just stated in reverse, in order to use something connected to my computer.Any help would be greatly appreciated.","solutions":["Hi RegularLogic, My name is Riccardo and I'd be happy to assist. Here are a few troubleshooting steps: Step 1 - BIOS Upgrade to Motherboard Let's try a BIOS upgrade to your motherboard... https:\/\/download.gigabyte.com\/FileList\/BIOS\/mb_...Perform that and see if that works. Step 2 - Uninstall\/Reinstall Drivers Go to Start > type in Device Manager > click the Device Manager icon and go to the CD\/DVD Drive and uninstall the driver, restart Windows 10 and see if this fixes it.If the above does not fix it, I would suggest replacing the SATA connection between your CD drive and motherboard.Let me know if you have any other questions, I will be here until the problem is fixed."]},{"symptom":"My time and timezone settings revert to their old ones immediately after manually changing them.        Hello!I am having a quite annoying problem to say the least, every time I try to change the time on my PC (with Windows 10) the aforementioned changes get reverted almost instantly, same with the timezone, and my timezone isn't even located in the country I have specified the PC's location to be! I've tried changing it through Windows Time, but it was deactivated, so I tried to start it, and I ended up with this:C:\\WINDOWS\\system32>net start w32timeSystem error 5 has occurred.Access is denied.So I mean, clearly it didn't work, and I tried this in both the Admin version of CMD and the standard one.If anyone has any idea how to go forward I'd be glad to hear from them.Cheers,Cosmo Billing","solutions":["Hi my name is Jay, I'm an independent advisor. I'd be happy to help with your issue.I understand that you are having difficulties changing your Timezone. Please follow these steps to fix the issue:1. Type in 'cmd' in search box. You'll see Command Prompt listed. Right-click and select Run as Administrator.2. Type 'tzutil \/l' to see a list of all time zones. Once you find your time zone, copy the description that is on the second line.Example: (UTC-06:00) Central Time (US & Canada) Central Standard Time <---- copy 3. Type 'tzutil \/s \"(paste the time zone here)\" Example: tzutil \/s \"Central Standard Time\" (make sure to include the quotations) then press ENTER.4. Exit the Command Prompt and verify that the Timezone is correct. I hope this helps, please feel free to ask questions and keep me on track. I will keep working on this issue until it's resolved, thank you.Regards, Jay"]},{"symptom":"Defaultuser0 not disappearing, and I don't see any other account.        Hello,I tried resetting my PC and it was stuck at \"Just a moment... \", so I disconnected the wireless keyboard and restarted. The problem, the reset didn't continue and Windows booted. And now I have defaultuser0 as the only account there. I can open the Automatic Repair where I don't require a password for admin permissions, so I have access to CMD. I tried adding another user, setting admin privileges, but the account just got removed upon starting. The administrator account is also active, but not visible, not even in safe mode.What can I do?Thank you, Alvin.","solutions":["Hi TheMatrixAgent22, My name is Riccardo and I'd be happy to assist, it sounds like your computer got stuck in the weird limbo of *almost* finishing the Windows 10 setup.To go over troubleshooting steps, it sounds like you did the first thing which is try to add an admin account; but, it is deleting itself.Would you be comfortable in doing a Clean Install of Windows, backing up your data and perform a clean install...Download the ISO here: https:\/\/www.microsoft.com\/en-ca\/software-downlo... Create a bootable USB and then perform the steps here: https:\/\/answers.microsoft.com\/en-us\/insider\/for...Let me know if you need any further assistance.","I did a clean install, from a USB stick from another PC. The laptop was stuck at \"Just a moment\" so I disabled Wi-Fi and hard rebooted my PC. The \"Just a moment\" went away in seconds and I am stuck with defaultuser0 again. Just a heads up, I deleted and formatted EVERYTHING before the install, so I really don't know what to do anymore..-Alvin","Never mind. I changed the password of defaultuser0 by doing these steps:1. Plug in the USB stick with the media installation tooll\/CD with the iso2. Open the USB\/CD from BIOS.3. Open CMD by pressing Shift+F104. Go to the system drive, in my case C, by typing \"C:\"5. Go to System32 by typing: \"dir Windows\\System32\" (mind the BACKslash)6. Type \"ren utilman.exe utilman1.exe\"    Then \"ren cmd.exe utilman.exe\"What this does, is renaming cmd.exe to utilman.exe. The utility manager is the little button at the login screen in the right bottom corner called \"Ease of access\". Now when you press that button, cmd will open. Why are we doing this? The users are hidden unless windows is open, you can't change defaultuser0, because it is hidden.7. Open Windows normally, and press the button called \"Ease of access\" in the right bottom corner, when you are at the password input.8. Cmd should open. Now type \"net user\" and notice how \"defaultuser0\" is there.9. Type \"net user defaultuser0 *\" and press enter, then enter the password you want. What you type won't be shown there, so don't worry, the input is taken in correctly. Then verify.10. Close cmd, and login to defaultuser0 using the password you used. Wait a little, then the setup will continue immediately.Windows got stuck at \"Just a moment\" before it could put in the password of defaultuser0 which should have lead you to the setup. Hope this helps.-Alvin","Great! All fixed now?","Of course!","Great Happy New Year!"]},{"symptom":"I HAVE INSTALLED A PROGRAMME ON WIN 7 BUT IT IS NOT SHOWING UP ON PROGRAMMES.        Hello,I have installed a programme on Win 7 and I cant find it anywhere except in add\/remove programmes. I have been into folder options\/view and checked show hidden folders but still no luck.Under add\/remove programmes it is showing that it has  a size of 6.80 that is the size of the programme itself.Does anyone have any advice please as to how I can make this programme accessible ?Thanks","solutions":["What is the name of the program?How did you install it?Where did you look for it?Have you done a Windows search for it?","Hi thanks.The programme is Smart Oval vers2 win 7I installed it from the manufacturers website.I looked for it in windows search and under startup.The only place I can find it is in add\/remove programmes as mentioned","Any thoughts? Thanks","Have you tried going to your add\/remove programs and double clicked on the item you can't find? Might work!","There's also a search bar when you press the \"Start\" button. It's just above the \"Start\" button. That's where I find most of the stuff I lose!swakk"]},{"symptom":"cast a touchsmart pc. to a samsung tv?        can I hook my touchsmart pc to a samsung tv? I am running win10","solutions":["Hello Kathi, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemWhat is your exact model? you need to make sure that your device supports Miracast \"the feature which will enable casting your pc to your TV\"To double check, please type in start menu DXDIAG and let it run click then on save all information . Open the saved file and search for Miracast, you'll see if your PC supports it or not.Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolvedCheers! Farah"]},{"symptom":"HEIC EXTENSION        Downloaded pictures from an IPhone7 to an HP but can't view pictures because it has an HEIC extension, help","solutions":["Hi PH55 Click the link below to download and install the HEIF Image Extension for Windows 10 from the Microsoft Store, after a restart, you should be able to video the HEIC images from your iPhone . . .https:\/\/www.microsoft.com\/en-us\/p\/heif-image-ex..."]},{"symptom":"Can't switch graphcis to 2nd GPU        I have 2 GPUs on my laptop as you can see on the pictureR4 is an integrated GPU and R5 is a discrete GPU but I can't switch to R5. I tried setting each game to one GPU but for some reason the 2nd GPUdoesn't appear on the options in Display settings. So, how can I make it available for me to change?I am currently on HIgh Performance in Power Settings, if it helps","solutions":["It’s certainly odd it is not defaulting to the discrete gpu, have you tried disabling the device in device manager to see it that forces the selection of the other gpu?Regards, Ross"]}]}