{"windows":[{"symptom":"microsoft and google        Why does Microsoft continue to disable Google as my chosen browser?  tbolkcom ","solutions":["Hi Tanya, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.You can change this setting by: 1. Select the Start button, and then type Default apps. 2. In the search results, select Default apps. 3. Under Web browser, select the browser currently listed, and then select Google ChromeSource: https:\/\/support.microsoft.com\/en-ca\/help\/402860... I know that Windows tends to suggest Edge heavily especially when changing the default browser. However, you can change it and it shouldn't change it back on you unless Edge opens again and it might prompt to make it the default browser again.I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"Reset MAIL & CALENDER APP in W-10 PRO - What App's Data Will Be Deleted on a RESET?        Question:  Does a RESET of MAIL & CALENDER APPdelete e-mail account pass words, personalize, settings and data?  Have multiple e-mail accounts individually configured with personalized signatures and text, etc.  Will a RESET delete the signature data?Many thanks for quick a reply,FedCURE","solutions":["Hi FedCure. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.The Mail and Calendar apps are just sync services like on a phone. No mail or Calendar accounts actually live there but are just synced from their online or Office accounts. Resetting or reinstalling them don't touch the data which remains in the original mail and calendar account. What often works is to go to Windows 10 Mail Settings (gear icon at bottom of Inbox) then Manage Accounts, then choose the problem account(s), then Delete the Account.Restart PC and retrace that path to add the account back. Make sure the Sync settings are as desired for how far back you want mail Downloaded from, whether to include Calendar and Contacts (People app). See this setup guide to make sure you get everything set as you like: https:\/\/www.windowscentral.com\/how-get-started-... If that's not enough then Reset the Mail app at Settings > Apps and Features > Mail & Calendar > Advanced Options > Reset. Restart PC. Try adding the accounts back to see if it works now.If that fails to fix it then Re-register Mail & Calendar app from Option 2 here: http:\/\/www.tenforums.com\/tutorials\/3175-apps-re... Finally if nothing else works reinstall the Mail and Calendar app from Option Two here:http:\/\/www.tenforums.com\/tutorials\/3175-apps-re... If you have broader performance problems go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Have multiple e-mail accounts individually configured with personalized signatures and text","Hi FedCure. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.The Mail and Calendar apps are just sync services like on a phone. No mail or Calendar accounts actually live there but are just synced from their online or Office accounts. Resetting or reinstalling them don't touch the data which remains in the original mail and calendar account. What often works is to go to Windows 10 Mail Settings (gear icon at bottom of Inbox) then Manage Accounts, then choose the problem account(s), then Delete the Account.Restart PC and retrace that path to add the account back. Make sure the Sync settings are as desired for how far back you want mail Downloaded from, whether to include Calendar and Contacts (People app). See this setup guide to make sure you get everything set as you like: https:\/\/www.windowscentral.com\/how-get-started-... If that's not enough then Reset the Mail app at Settings > Apps and Features > Mail & Calendar > Advanced Options > Reset. Restart PC. Try adding the accounts back to see if it works now.If that fails to fix it then Re-register Mail & Calendar app from Option 2 here: http:\/\/www.tenforums.com\/tutorials\/3175-apps-re... Finally if nothing else works reinstall the Mail and Calendar app from Option Two here:http:\/\/www.tenforums.com\/tutorials\/3175-apps-re... If you have broader performance problems go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.Hi Greg,Many thanks for your quick reply and for your assistance.  We have taken your suggesting under review.  Our hope is that a RESET to MAIL & CALENDER APP will not disturb existing e-mail accounts and each's SETTINGS,e.g., Personalization, Signature, Automatic Replies, etc.?   See these notes, please:ISSUE:  MAIL & CALENDER APP:  MAIL is broke, intermediate APPCRASH and Sync Freeze and or Delays.  Not showing in Diagnostic Data Viewer.RESOLUION:  Considering RESET to repair APP.  QUESTIONS:  1.  Does RESET impact any of the Fields under SETTINGS of existing e-mail accounts,e.g., Personalization, Signature, Automatic Replies, etc.?  2.  On Startup after a RESET will all e-mail accounts and each's settings reload?  Or, will each account have to be re-added (via Add Account) and Settings re-established?Having to re-establish the e-mail accounts would be cumbersome, as each has induvial Settings,e.g., Personalization, Signature, Automatic Replies, etc.  Signature's have a asperate and detailed message with hypertexts. Happy New YearBest,CIO, FedCURE.","Those settings should be done in the actual source mail account (e.g. Office Outlook, Yahoo.com, Outlook.com, Gmail.com, etc) and not a sync service which is all that Windows 10 Mail is. This way whenever you need to Reset or reinstall Windows 10 Mail app, or remove and add back an Account, it won't mess up the Settings. This is because one or all of these repairs may be required semi-regularly and you want them to have little or no impact - which they will not if your customized Settings are done in the source account and not the Mail app.I hope this helps.","Those settings should be done in the actual source mail account (e.g. Office Outlook, Yahoo.com, Outlook.com, Gmail.com, etc) and not a sync service which is all that Windows 10 Mail is. This way whenever you need to Reset or reinstall Windows 10 Mail app, or remove and add back an Account, it won't mess up the Settings. This is because one or all of these repairs may be required semi-regularly and you want them to have little or no impact - which they will not if your customized Settings are done in the source account and not the Mail app.I hope this helps. Greg:Great suggestion, but these are POP3 e-mail accounts running in e-Mail Client (with Default Webmail Applications, e.g., HORDE, RoundCUBE, etc.) on our servers.  There's really know way to configure or store a Signature file let alone with several paragraphs of text with hyperlinks within it.  There's AutoResponder fields, but that's it.  The e-Mal client ware device configuration setup for W-10 is AUTO DISCOVERY.  This may be possible in WEBMAIL CLIENT, but there's no way for W-10 MAIL to pull it down.Perhaps, some type of hyper V-Card file would satisfy us, but MAIL has no Settings for that.We have a few at&t e-mail accounts that your suggestions mail work, but its the .org's POP3 mail accounts that have the heavy Signature file.And bringing POP mail into another mail cloud service won't work either as they only host the accounts.Its a quandary, but among the hundreds of comments in this forum there were a few comments suggesting that after a RESET all the prior accounts and passwords, etc., came back, which gave rise to our questing if a RESET wipes this all out.  Still not sure it does.When W-10 MAIL came along for us we were considering to install Office365 (Outlook) multiple license, but install across our PC network is not the fix we're looking for.  MAIL seemed promising )-:Ps.  MAIL is running smoothly for more then 24 hours, until an hour ago.  The APPCRASH is sporadic.  Really no rhyme or reason.  Could be a sync issue or another program interference.   Best guess, MS Engineers left a port open and its taking generic dev nul calls.  Diagnostic Data Viewer is not reporting M&C APPCRASH, was hoping it was so MS AI could pick it up, but there's no reporting the issue that we can see in Outlook or Sync. are there other logs we can look into to ID the APPCEASH?  Pls Advs.MAIL is a bit more then sync, it stores e-mails on PC drive, that you can't change the location of.  And it would be nicer if the program was stable.Keep thinking about it, there has to be a solution.  Many thanks for your help.CIO,FedCURE","Hi Again - You could try a Repair Install by installing the Media Creation Tool from this linkhttp:\/\/windows.microsoft.com\/en-us\/windows-10\/m... choosing Download Tool Now, install the tool, open it and choose Upgrade this PC Now. This reinstalls WIndows while saving your files and apps in place; takes about an hour, resolves most problems. It also brings it to the latest version by the most stable method. I know of no other way to reset, re-register or reinstall Mail app without losing one or more accounts which need replacement.If you want to express your opinion on this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems. If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it.","Hi Again - You could try a Repair Install by installing the Media Creation Tool from this linkhttp:\/\/windows.microsoft.com\/en-us\/windows-10\/m... choosing Download Tool Now, install the tool, open it and choose Upgrade this PC Now. This reinstalls WIndows while saving your files and apps in place; takes about an hour, resolves most problems. It also brings it to the latest version by the most stable method. I know of no other way to reset, re-register or reinstall Mail app without losing one or more accounts which need replacement.If you want to express your opinion on this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems. If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it.Thanks Greg,Windows 10, version 1909 up to date.  Yes, already have the tool on list of fixes as last resort. Found Outlook APPCRASH being reported.  Another user comments that a fix for MAIL APPCRASH has issue has been outstanding for over 5 years.Best,CIO,FedCURE ","Is this Office Outlook or Outlook.com?","Is this Office Outlook or Outlook.com? Greg:Local at:Microsoft Outlook Communications:  WindowsApps\\microsoft.windowscommunicationsapps_16005.12228.20356.0_x64__8wekyb3d8bbwe\\HxTsr.exeand Microsoft Outlook:  WindowsApps\\microsoft.windowscommunicationsapps_16005.12228.20356.0_x64__8wekyb3d8bbwe\\HxOutlook.exeNote:  There are no Diagnostic Data View reports on the Mail & Calendar APP.  We assume the above to reference the MAIL APPCRASH.Best,CIO,FedCURE"]},{"symptom":"Upgrade to Windows 10        Do I need to download Windows 10 onto my Dell Inspiron N7010 and if so how do I do it.***Modified title from: Windows 10***","solutions":["Hi SherryGlenn2, Thank you for writing to Microsoft Community Forums. I appreciate your interest in Windows 10. I understand that you want to know if you need to download Windows 10 on your Dell Inspiron N7010 laptop. I have been researching on the specifications of the laptop and I see that the manufacturer provides drivers only up to Windows 7. For more information, see https:\/\/www.dell.com\/support\/home\/in\/en\/inbsd1\/product-support\/product\/inspiron-17-n7010\/drivers We would like to know the version of Windows that you are using currently on the laptop. To check pressWindows Logo key + R, type winver and hit Enter.  Since the manufacturer provides drivers only up to Windows 7, upgrading the laptop to Windows 10 may cause performance issues and compatibility issues with the hardware devices and software. Also, to upgrade to Windows 10, we need a valid license and Windows 7 Service Pack 1. For more information, seeWindows 10 system requirements. If you wish to upgrade to Windows 10, you may want to try using the Media Creation tool to upgrade to Windows 10. You can go to the websitehttps:\/\/www.microsoft.com\/en-in\/software-download\/windows10 and click on Download tool now. Once the tool is downloaded, refer the steps mentioned in the article How to perform an In-place Upgrade with Windows 10 Step-by-Step Guide by PaulSey… Let us know if you need further assistance, we will be glad to help you. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Lost digital code        I had to factory reset my windows 10 laptop and now I have lost my upgrade to pro that I purchased through the store. I have an order number showing I bought it but no key to type in. Microsoft seems impossible to get a hold of unless you want to pay .... I've already paid for the license and just want the key.  Can anyone help?","solutions":["Hi LindaHC52, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.The Windows activation is generally linked to the Microsoft Account you use to log in, so activation would hopefully occur seamlessly if you are using the same account.If this is the case, during installation, you can skip the entering of product key during the installation of Windows itself and then use that Microsoft Account to log in.Also, if you purchased it from the Microsoft Store online, you may be able to see your product key online at:https:\/\/account.microsoft.com\/billing\/orders\/(Note, on the left side, choose Ordered within: All available) Otherwise, you may need to contact Microsoft Support directly via phone or live chat:https:\/\/partner.support.services.microsoft.com\/...This article has an overview of the activation process which may be helpful: https:\/\/www.groovypost.com\/howto\/transfer-windo...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"LiveKernelEvent 141        I receive a LiveKernel141 Error when I am gaming. Here is the description via reliability monitor.DescriptionA problem with your hardware caused Windows to stop working correctly.Problem signatureProblem Event Name: LiveKernelEventCode:         141Parameter 1: ffffe20971142060Parameter 2: fffff807442109f0Parameter 3: 0Parameter 4: 2660OS version: 10_0_18363Service Pack: 0_0Product:         768_1OS Version:       10.0.18363.2.0.0.768.101Locale ID:         1033Files that help describe the problemWATCHDOG-20200106-1648.dmpsysdata.xmlWERInternalMetadata.xmlWERInternalRequest.xmlmemory.csvsysinfo.txtMy specs:GPU:  Powercolor Red Dragon Radeon RX 5700CPU:  AMD Ryzen 5 3600PSU:  Corsair TX650M 80+ Gold MOBO:  MSI B450-A PRO MAXMemory: GSkill Ripjaw 16GB (2x8)Memory: 1TB M2 SSD I have tried rolling back drivers as well as reinstalling the gpu. I have reinstalled windows and made sure all other drivers are updated. The problem occurs while running DotA 2 or CoD","solutions":[]},{"symptom":"Can't delete PDF file from Win 10 desktop with a long file name        I created a file using a pdf printer and saved the it to my desktop.The file appears on the desktop; however, I can't do anything with it. I can't open it, delete it, change its name or anything else.I want to delete it. I've tried right click and then delete, shift delete, using File Explorer to delete it, using the \"cmd\" function to try to delete it, looked for a short name (none present) and used PowerShell and nothing works.  I've rebooted several times, but that doesn't seem to do anything.The file name is:  \"ReporterMcCabe on Twitter_ _The ring seems to confirm that one of those killed was Qassim Soleimani, the leader of the Iranian Quds forces. It would not surprise me if the mullahs are grateful to have Soleimani out of the way. He built the box in whic.pdf\"Stored and appearing as a PDF file on my desktop.How do I delete this file?","solutions":["Hi Brian Click the link below to download Iperius Long Path Eraser Free 1.2.0, that should delete that file for you . . .https:\/\/www.majorgeeks.com\/files\/details\/iperiu...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]},{"symptom":"windows 10 reboots - bugcheck 1001 and kernel power        hello,my laptop keeps restarting and i got occasionally bluescreens. also i see critical kernel-power (id 41) events.i need help with the dump files.here is the minidump from a restart:https:\/\/1drv.ms\/u\/s!AryvPTyG-SI1hBx0A4V4vKO1NnCT?e=dj6UnKand this is the minidump from a bluescreen:https:\/\/1drv.ms\/u\/s!AryvPTyG-SI1hB1csrbE4aEYNIRY?e=1V9first i thought hardware was causing this, but the motherboard was replaced just days ago, but the bluescreens und restart still happen.i need your help please.","solutions":["Hi dooglrig Both your minidump files indicate that it is igdkmd64.sys which is the device driver on your Intel HD Graphics that is causing your system crashes . . .Open Device Manager (accessible by right clicking your Start Button) Expand the Display Adapters Section Right click your video card and choose Properties On the Driver Tab, choose 'Roll back Driver' Restart your PC once done . . . If that option is grayed out or does not resolve the issue, go to the support page for your device on the manufacturers website, then download and install the video driver they recommend, it may well be an older version to the one you are currently running","thank you for your quick answer.the option to roll back the drivers was grey out, so i installed driver i got from the lenovo support page. so far everything looks good, got no bluescreen or restart since i installed the driver.i lost trust in lenovos update tool \"lenovo vantage\", i used it to keep all drivers up-to-date.","some hours ago my laptop crahsed again. there was no other crash since i installed the intel graphics driver from the lenovo homepage. cant see any intel graphics updates the lenovo software or windows update made.here is the minidump: https:\/\/1drv.ms\/u\/s!AryvPTyG-SI1hB4IxJaCg5opHGIs?e=xBDh4q"]},{"symptom":"Cannot create new fax        I have set up Windows Fax and Scan using fax server on Server 2012 Essentials. It's working a number of workstations, but on one workstation the computer can connectto the fax server,  it cannot create a new fax. When you click on \"New Fax\" you get the following message:  \"There was an error opening this message. An error has occurred.\"The workstation that has the problem worked fine when it was running Windows 7 Pro. The problem started after it was upgraded to Windows 10. I have deleted the registry keys and turned the fax and scan program on and off, and reconnected to the fax server, but still get the error message. I am aware of the following post, but it did not fix the problem: https:\/\/social.technet.microsoft.com\/Forums\/en-US\/7487f6e8-d13e-46d4-86c0-541a735f5af5\/cannot-create-new-fax-with-windows-fax-and-scan?forum=winserverprintAny suggestions?","solutions":["FWIW, I discovered the fix to my problem. I had siptapi (https:\/\/www.ipcom.at\/en\/telephony\/siptapi\/) installed as well. When I deleted siptapi.tps from windows\/system32, the problem went away. I was able to add back a new version of siptapi.tps and both the TAPI dialer and the windows fax and scan now both work."]},{"symptom":"Sound. Only the right side remote speaker is playing.        Connections were checked. When checking equalizer both sides increase right speaker volume suggesting mono output. How can I fix this?","solutions":[]},{"symptom":"\"critical process died\" -> \"Operating System not found\"        After the latest Windows 10 upgrade, my Sony VAIO desktop computer cannot find the operating system.  The restart said it \"critical process died\" then it went again to a message \"Operating System not found\". What now?","solutions":["Hi JeffMiller_0223, My name is Riccardo and I would be happy to assist today... As soon as your computer starts up > click F11 This will get you to the Windows 10 Advanced Startup Options If you can get there you can hopefully do a Troubleshoot to see if it can fix the issueAlternatively, you can create an ISO by going here: https:\/\/www.microsoft.com\/en-ca\/software-downlo...Create a bootable ISO and then boot from that USB and do an automatic system repair if it can...Let me know how the above works for you, I will be available.","Riccardo,Thank you for your help on this!! I am very grateful!However, the F11 doesn't get me to the Advanced Startup Options. I suspect it is because I am using a wireless bluetooth keyboad.I speculate the bluetooth system turns on too late to allow the F11 keystroke to work.I am going to see if I have a usb  keyboard somewhere around here and try it outJeff","No problem, let me know the ISO on the USB is probably where we need to start for automatic repair","Riccardo,A friend brought me a USB keyboard but I have only gotten the same result when using it.When the computer starts, I see the VAIO logo, then after a very lengthy time, it will get to a solid blue screen with the Windows date & time, which, after a lengthy period, becomes the log-in window.I can input my log-in password, and after a long circling dots with \"one moment\", I get the same blue screen I got before: \"Your PC has encountered an error  and needs to restart. We are collecting information we need and will restart for you\"... with the stopcode Critical Process Died.  The percentage of gathered information never goes beyond 0%. Once it restarted on its own, it came to a solid black screen with \"Operating System not found\".  Any keystroke after that just duplicated that message.I pressed the F11 key as soon as the computer started up but there was no response from the computer other than what I described above. After multiple attempts I am pretty puzzled.Jeff","Ok it sounds like we need to create boot media. Follow the instructions at the link below:https:\/\/www.google.ca\/amp\/s\/www.thewindowsclub....DISCLAIMER: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I was finally able to get to the System Restore function and restore it to a pretty recent working point.  I will check it out thoroughly tomorrow (it just now came up 6:39 pm Central Standard Time).  Good to see it back up!Thank you for all your assistance, Riccardo!Jeff"]},{"symptom":"Windows 7 machine will not change date format        Windows 7 Pro desktop:I go to Control Panel\/Clock, Language, and Region\/Change the date, time, or number format and from there, the 'Region & Language' window  opens. Regardless of the fact that 'location' tab shows United States, the 'Formats' tab shows format as \"English (United Kingdom\" with short date as \"dd\/MM\/yyyy\" and long date as \"dd MMMM yyyy\".  What this does is create the lower right system tray view of \"06\/01\/2020\" (day\/month\/year) as the calendar date which causes Quickbooks to act up, thinking it's June 1st.  I make the change from \"English (United Kingdom\" to \"English (United States)\", to get the standard M\/d\/yyyy, clivk APPLY and OK but the lower right system tray calendar doesn't change and when I return to Control Panel\/Clock, Language, and Region\/Change the date, time, or number format and from there, the 'Region & Language' window  opens and the 'Formats' tab shows format as \"English (United Kingdom\" again.There has been no recent changes to this system so what's up?  Why won't it hold a change in date format?Thank you for your time and ideas.","solutions":[]},{"symptom":"Can't sign in to Windows 10...get blue screen with language option        I haven't seen this one anywhere on the internet... I have a 4 year old Dell Inspiron 5559 that came with Windows 10 already installed.  When I turn on the machine I get the keyboard language option screen.  I select US and it goes to the Troubleshoot Screen.  I then chose Troubleshoot and Start Up Repair, but it could not repair.  I tried to Restore to all the earlier dates, and it said it worked, but when I went to restart, it failed.  I tried going to the Dos Prompt and doing a Chkdsk, and it did not show any issues.  I am beside myself trying to figure out what to do next... please help...I'm not sure if I need to do something with the BIOS...I've also tried all the other things on the internet such as shutting down the computer three times in a row...I'm not sure what the \"Failed to transfer logged messages to the event long with status 50 means...","solutions":["Hi, LJGrady My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I created an installation disk as instructed when I got laptop.  Will that work?  Will I loose my data?  Not sure how to backup data from Dos Prompt.","chkdsk itsnt the thing for system file errors; it is for checking your file system but not your operating system.to check the operating system do this in dos prompt sfc \/scannow","Check the second and third links that I sent you there indicating how to repair Windows without losing your files.","I ran Chkdsk to see if this was a hardware problem or a software problem... am I correct in thinking it is a software problem?  So, I ran the scannow and this is what I got.  Not sure what that means...","Will do and advise.  Waiting for my installation disk to be mailed to me...out of state...uggh.","Ok I understand","Well, my daughter sent me the wrong thumb drive (not the installation one I created) :{So, now I think I may have to back up my data onto a thumb drive and then create a re-installation drive off of another computer.When I go to the dos prompt I see:  X:\\Windows\\System32>My user file is in C: dirI tried doing a fix that I saw online, but it didn't work... c:\\>users\\>attrib -H -R -S \/S \/D E:\\*.*    (with E being the drive that the thumb is in), but I got message '\\users\\' is not recognized as an internal or external command, operable program or batch file.What now?","Thank you for your assistance, I did make a reinstallation disk and also called Microsoft who helped me extensively without charging.  I was quite pleased with their service.  Should have called them before trying to do all this by myself."]},{"symptom":"drop ebay on desktop        how to drop ebay on desktop in windows 10","solutions":["Hello michaelguilmette, I'm Didi, an independent advisor. Go to your desktop, right-click on a blank space and click New > Shortcut, type the address of the website that you want as a shortcut ( in this case www.ebay.com ) then choose a name for this shortcut.You'll have a shortcut on your desktop that should open the eBay website automatically when you click on it.Regards, Didi Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"My second monitor doesn't fill up the entire screen        I am using a second monitor, but the display is too far to the left. The Windows button on the taskbar is partially cut off, and there is a small section to the right of the screen where there's just black before the actual edge of the screen. How can I fix this? The monitor is an ASUS VS207. I've used the monitor's OSD to move the screen as far to the right as I can, but I still can't get the entire screen to show, and I've also tried using a different cable to connect it to my computer, which did not work.","solutions":[]},{"symptom":"restoring my computer to an earlier time in windows 10        restoring my computer to an earlier time in Windows 10","solutions":["Hi williammessuck, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved.If you have a Restore Point(s) you can restore back to it. Start - type in the Search box --> Create a Restore Point Find at top and click on it. There you can configure, create, or use Restore Points. Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all."]},{"symptom":"blue screen error in windows 10 latest update \"PAGE_FAULT_IN_NONPAGED_AREA        i am using windows 10 Home version.i am having trouble with PC after updating the latest windows 1909 update.sudden blue screen error appears and pc stopped responding, ","solutions":["  This is the Windows 10 Insider Preview forum.  We are testing preview builds not yet released to the public.The forum for the public release of Windows 10 is below.http:\/\/answers.microsoft.com\/en_us\/windows\/forum\/windows_10This includes Windows previous to Windows 10 also, XP, 7, 8 ,8.1, etc.Windows 10 help is found here; https:\/\/support.microsoft.com\/en-us\/products\/windows?os=windows-10","Hi,As lacrumb said, the Windows Insider Program forum is just for discussing preview builds of Windows 10, so I have moved your post to the public forum.","Try the following to perform what is called a clean boot:run msconfig and disable all non-Microsoft Servicesyou can check a box to hide the Microsoft Services, to make it easier to disable all the restrun Task Manager and disable all items shown on the Startup tabrestart WindowsIf you now find that everything is stable, you could try enabling things that you think you need, one by one, and then restarting to see if you get the blue-screen crash again. You can just use Task Manager and msconfig, as above, to enable each one."]},{"symptom":"How to find installed apps from Microsoft Store?        I'm an old Newby, and learning as I go. I got free games and apps from Microsoft store. Well, I don't know how to access them. Will someone please Please Help me?  Oh ya, I don't even know how to get any reply from you!! Please email to me: *** Email address is removed for privacy ***..   I'm very grateful, Mark***Original title: I'm old and new to computers. How can I access \"Cribbage Deluxe\" and other things I bought?***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query related to finding apps from Microsoft Store on PC, and I certainly appreciate your interest on using Windows 10, no need to worry I’ll surely help you with the query. Usually, when you install an app from Microsoft Store it will be available on the Start Menu to launch. Here is an article toFind all your apps and programs In case, you are unable to find apps on Microsoft Store, then you can refer the articleI can't find or install an app from Microsoft Store If you need any further assistance, please get back to us and we will be glad to assist you. Regards,Prakhar KhareMicrosoft Community – Moderator","If you're wondering where the games are saved to then it's generally C:\\Program Files\\WindowsApps and to find it in there you need to click view and make sure to show hidden items by ticking the box"]},{"symptom":"Windows 10 only shows Hebrew language        I recently added Hebrew as a second language.  When I restarted my PC the only language became Hebrew only.  I went into time>languages and moved US English to the top. Upon a reboot I get the same problem.  I can only see the Hebrew language in all the help areas.  therefore, I cannot read anything to change what is necessary.  However, when I went into time>language, the Hebrew language does not show up (US English does), but everything is still in Hebrew.I did this because I am taking a course in Biblical Hebrew and now I am truly sorry.  Can you help?","solutions":["Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.Have you checked if English US is downloaded? In control panel, you would be able to choose English and move it to top but that won't apply yet unless you downloaded the pack. Anyway, you could check this tutorial as a guide for you change your display language.https:\/\/www.youtube.com\/watch?v=Ago34bPugBs(Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.)I hope this helps with your concern! Please let me know if you have further questions."]},{"symptom":"How to show\/hide all open Sticky Notes        According to this UserVoice post,as of version 3.7.68 of Sticky Notes there should be an option in the jumplist (which opens when right-clicking the taskbar icon) to show or hide all open notes. However, I'm running version 3.7.106.0 and I'm not seeing these options in the jumplist. Does anyone else see them?","solutions":["Hi there,I'm from the Sticky Notes team. We have just recently finished our rollout of this feature so everyone should be able to see it now. Sometimes you need to restart the app to see new features, which is probably why you saw it without downloading anything new.Thanks for being a fan!Allie"]},{"symptom":"Windows 10 1909, Add someone else to this PC, POP up window \"Search for app in the Store\"        When I try to add a new account in Settings, Accounts under Family & other users a Window pops up to Search for app in the Store? You need to install an app for this task . . . Yes No. Selecting Yes basically gives window that says Try that again.I am using a Local Account Administrator.  When I select \"Sign in with a Microsoft account instead\" in Settings, Accounts Your Info. I get the same pop up again and unable to sign into the Microsoft account.I am only able to log in as a local administrator now. Did SFC and DISM, both were good. Not sure what my next steps would be.","solutions":["Hi, noko59 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]}]}