{"windows":[{"symptom":"Lan connection is steadily disconnected        I need to establish remote connection using a remote desktop. But my Lan connection keeps being disconnected. I have to move the mouse to resume this data connection.","solutions":["Hi Beata, my name is Andrew and I'm an Independent advisor here to help you.I want you to try changing the Power Management settings for the Network Adapter.Please follow this guideline: - Press Windows + X keys together to select Device Manager - Expand Network Adapters and right-click on it - Select Properties. - Move to Power Management tab to remove the check for Allow the computer to turn off this device to save power.- Click on OK. Write me back if it works or not. Thanks, Andrew N."]},{"symptom":"Upgrade from Windows 7 to Windows 10 Pro Recycle Bin is corrupted message        I actually had about 10 hours of help from Microsoft technicians on this and only by accident did it get fixed.  It wasn't actually fixed, as it returned a week or so later.  The reason it returned was that I was asked if I liked the picture on my screen after returning to my computer and beginning another work session.  This is the picture that pops up after you press enter and just before you are about to sign back in to your desktop.  I'm no tech wizard, far from it, but this was what happened next:My screen is initially black, I press enter, my screen saver photo pops up and in the right corner it asks if I like the photo that has been presented by Microsoft.  The sign in screen hasn't shown up yet, but I decided that I wanted to change the screen to a new photo.  There is no choice of photo, only the option to let Windows give me another screen the next time I leave my desktop for enough time to bring up my screen saver.  I had indicated several times at that corner location that I would like a change.  About the 4th time I did that, a green screen popped up instead of a photo.  But now, when I hit enter, instead of getting a sign in option, a black screen with an error message popped up.  The problem became more clear to me and to solve it myself this time all I had to do was reboot once (although the first time I had the problem, Microsoft techs had me reboot 4 times in a row), get to the sign in screen, sign in and then:Go to settings, personalization and change the screen saver photo.  Worked like a charm and I've had no problems since.I hope the Windows tech guys see this, as it could save them a lot of time in the future with this problem, when it arises.The Recycle Bin message is connected to a specific screen saver and not all of them.I hope this helps someone.  Todd","solutions":["Todd again,I reread my post and it doesn't flow well.  Here is the timeline:Upgraded to Windows 10 Pro from Windows 7.  I sign on to my new Windows 10 and get the Recycle Bin error message.  This error message freezes me out of my desktop and I can't bypass it.  I call for technical help 4 times and the 4th time we did some crazy things and stumbled onto something, but the technician didn't know how he had done it.A week later, I pressed enter to start my session and out of the screen saver location a photo pops up, as usual.  It asks, in the right hand corner if I like that photo.  I indicated I would like to change it and did so several times again over the next few days.  One of these photo changes returned me back to the screen I initially had that forced me to call Microsoft for help.  That screen was a green screen that was tied into the Recycle Bin error message, which is on a black screen. I rebooted my computer, as this allowed me to sign in.  You may need to reboot more than once, but when you get in, then you can access Setting, Personalization and a change of the screen saver.While all of this may not be phrased very clearly, I hope it gives you some idea of how this fix is accomplished."]},{"symptom":"Windows Media Player.        Hej! Någon som vet hur inställningar för Media Player bör vara om det inte finns med i datorn.Har det någon betydelse för operativsystemet om funktionen tas bort från Windows-funktioner?Jag har en extern sådan man använder den sällan.Mvh PF  ","solutions":["Vi använder en översättningstjänst för att hjälpa våra användare. Ursäkta grammatiska fel.Hej Mvh PF Om du menar tar bort Windows Media Player från Windows 10 påverka operativsystemet, sedan vara säker på att kommer att ha någon inverkan på resten av ditt system...Du kan lägga till eller ta bort Windows Media Player varje gång du vill från inställningar-Apps-valfria funktioner och om det är aktiverat eller inaktiverat påverkar inte något annat på din dator..."]},{"symptom":"Can't download games from the xbox beta app Error 0x80070424        In the last 6 hours I've tried many different things, first by repairing and resetting both the gaming service and the xbox beta app, then by deleting both the xbox beta app the microsoft store and the gaming service with powershell and reinstalling also them by poweshell after a restart, after I did this the games from the game pass that can be downloaded directly from the microsoft store were working and windows update works (mentioned this because everything I found about this error is linked to windows update not working but mine works fine) but the others that can only be downloaded from the xbox app just didn't even start downloading and failed at preparing. So I went in Services and checked if all the services were running and set to automatic start and noticed that even thought I reinstalled Gaming Services, both GamingServices and GamingServicesNet aren't present in it. After noticing this I tried, in order, to repair it and after it didn't work uninstalled it with powershell, restarted and reinstalled it but there still isn't trace of the services.Any way to fix this ?","solutions":["Hi, YuriSegalini My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Already did all of this yesterday, gave it another try today but it still doesn't work. The main problem is that no matter how many times I uninstall and reinstall the GameServices they don't show in Services and won't start and this are the main services that make the xbox beta app work ... I gives me the same error has windows update and the windows store not working by those run with no problems","I recommend that you repair Windows completely before you must make a backup of your personal files, third-party software will be removed. Here the link to download the Windows ISO.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Activation Error 0x80070057.        Hello! First of: I bought my pc piece by piece and called techinician who knows how to install it properly and i asked him for windows , he put them and after some time it was saying need activation. So i bought a key and use it but it doesnt work giving me this error Activation Error 0x80070057. Even the toubleshooting doesnt work. Can someone help me a little bit. I would appriciate it thanks!","solutions":["Hi ΤαξιάρχηςΚατσάι 1 What edition (Home, Pro . . etc.) of Windows 10 did you purchase a licence key for?2 Open the Settings App, go to System - About, what Edition of Windows 10 is installed on your PC?3 Click your Start Button, type cmd then right click Command Prompt and choose 'Run as Administrator'Run or paste this command and hit Enter: slmgr.vbs \/dlv Please post a screenshot of the resulting dialog . . .","reply of ur 1)windows 10 pro.reply of ur 2)http:\/\/prntscr.com\/qil6t6reply of ur 3)http:\/\/prntscr.com\/qil75a","Hi ΤαξιάρχηςΚατσάι Thank you for that information, you seem to be running the volume licence version of Windows 10 ProThat new licence you are trying to apply to Windows, where did you purchase that, was that from Microsoft or some 3rd party retailer?","3rd party its just the product key","Hi ΤαξιάρχηςΚατσάι Your best option is to contact Microsoft Support and ask them to help you re-activate your Windows 10, they can check that licence key and help you to resolve this . . .Choose a local Phone Number: https:\/\/support.microsoft.com\/en-us\/help\/13948\/...","Thanks for your help Dave,i will try that have a nice day!"]},{"symptom":"Can I change a setting in Windows 10 to make a PC start up automatically when power becomes present?        I have found that when my PC is manually turned off at the plug socket (without shutting down via Windows) and then turned back on, it won't start up again automatically. I need to press the power button on the PC to start it up again. Is there a change that I can make to the PC itself (or in Windows 10) to make it start automatically as soon as power becomes present?","solutions":["Hi BWP_239 The method you are using to shut down your PC can and most probably will at some point corrupt your Windows 10 installation, that is not a safe way to shut down a PC . . .There is no setting to start your PC when power is restored to your PC, because once Window is shut down, your PC needs to apply power to the power board, then BIOS will POST and finally WIndows will begin loading and that can only be done by pressing the power button on the casing of your PC . . .","Hi DaveM121,Thanks for your reply. Just to add a bit more info, I work in a company where we sell machines containing PCs to customers and then support them with any issues remotely. Sometimes our customers will end up turning off the machines at the plug socket for whatever reason (we always tell them not to, but sometimes they'll ignore us). When they want the machines to come back on, they should just have to turn the plug socket power back on. We previously obtained PCs from a company where this worked, but we recently got PCs from a new supplier, and these new PCs won't turn on automatically like the original ones did. The customers would need to open up the machines and press the power button to restart the PCs (which we want to avoid at all costs). I wanted to check if we could change a setting in Windows or BIOS to add this functionality back in.","\"Is there a change that I can make to the PC itself (or in Windows 10) to make it start automatically as soon as power becomes present? \"This setting must be done in BIOS if your PC support that feature.Setting options could be something like:- AC Power ON, Stay Off- AC Power ON, Turn On- AC Power ON, Previous state.","Hi BWP_239 If there is a setting for the PC to boot when power is applied, then that setting would be specific to the PC and you will find that in BIOS under power options, that will definitely not be a Windows setting . . ."]},{"symptom":"Can't see display setting in mail app to turn off reading pane        Hi,I am not able to see display setting in the Settings menu to turn off reading pane. I cannot also maximize the mail to the full screen option.I tried uninstalling the app and reinstalling it but the settings doesn't show display\/view option.Please help.","solutions":["Hi Ritesh, Kindly check these steps if it will help you resolve your concern. Turning Off Message Preview in Mail for Windows 10 In Mail for Windows 10, click on the Settings icon, the cogwheel. Click on Reading Under Conversation, toggle the slider for Show preview text to Off Under External Content, consider also turning off Automatically download external images and file formatsDisable the Preview Pane in Windows Mail or Outlook Express For older versions of Windows Mail, here is how to turn off the message preview pane.Select View | Layout... from the menu. Make sure Show preview pane is not checked. Click OK. You can also click Apply to put the new settings into effect without closing the configuration dialog.Let us know if you need further assistance. Thanks and regards,","Hi Ritesh, Kindly check these steps if it will help you resolve your concern. Turning Off Message Preview in Mail for Windows 10 In Mail for Windows 10, click on the Settings icon, the cogwheel. Click on Reading Under Conversation, toggle the slider for Show preview text to Off Under External Content, consider also turning off Automatically download external images and file formatsDisable the Preview Pane in Windows Mail or Outlook Express For older versions of Windows Mail, here is how to turn off the message preview pane.Select View | Layout... from the menu. Make sure Show preview pane is not checked. Click OK. You can also click Apply to put the new settings into effect without closing the configuration dialog.Let us know if you need further assistance. Thanks and regards, Hi - turning off preview under messages doesn’t help. What if I want to change the position of reading pane? Also I am not able to get full screen option for mail app. This app version looks weired. I have used earlier versions and these were fine.","Greetings.I just got a new PC with Windows 10, and it appears that Microsoft has removed the \"Conversation\" section from the Reading Pane options (also renamed \"Reading\" to now \"Reading Pane\")   Thus the old method to disable reading panes no longer exists.This is a security threat, since someone can easily accidentally single-click on an email and it will automatically open, which can introduce a virus onto the computer.   Anyone who knows about this kind of thing knows to turn off reading panes in their email client.   Has Microsoft taken away this option?   Or perhaps moved it somewhere else?   Thanks to anyone who knows."]},{"symptom":"Personalized Settings Unresponsive (task manager won't open)        Hello,I've seen a lot of posts saying that the black screen and personalized settings being unresponsive is normal after a windows update. But no matter what I do nothing is working.  I can do CTRL + ALT + DEL, and I can see all my options there, but when I click on Task Manager I get thrown back into the black screen.Things I have done: 1.) I have restarted my computer- Nothing has changed, I get the same outcome every time I restart my computer.2.) I have looked at this link: https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_vista-desktop\/personalized-settings-not-responding\/5a229ed9-11f8-4fbd-804a-44d90d59fc53 - I can't do  Run sfc.exe tool because I can't open up the window's search bar. I can't open up task manager, I literally can't do anything.- Going into the control panels, etc, isn't an option because I can't access anything.3.) I have also looked at this link: https:\/\/win10faq.com\/how-to-fix-windows-10-personalized-settings-not-responding\/#prettyPhoto- Restarting my computer does nothing- Can't restart Window's Explorer because I can't see task manager- Can't repair files using SFC, because I can't access anything","solutions":["Hi Ioxior My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.Power on and off your computer three times On the third time, your computer will boot into the Advanced Recovery environmentClick Advanced Options Click Troubleshoot Click Advanced Options Click Startup Settings Click Restart Press (4) to Enable Safe Mode Wait while Windows 10 starts in safe mode. Log in Boot to the Windows 10 desktop Press Windows key + X Click Device Manager Expand Display adapters Right click the current display adapter Click Properties Click Driver tab Click Rollback driver if the option is available If not Right click the current display adapter Click Uninstall Check the box that says, \"Delete the driver software for this device.” Exit Device Manager Restart Click Start > Settings > Update & security > Windows Update > Check for updates Download and install any pending updates Restart your computer","Hi Ioxior My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.Power on and off your computer three times On the third time, your computer will boot into the Advanced Recovery environmentClick Advanced Options Click Troubleshoot Click Advanced Options Click Startup Settings Click Restart Press (4) to Enable Safe Mode Wait while Windows 10 starts in safe mode. Log in Boot to the Windows 10 desktop Press Windows key + X Click Device Manager Expand Display adapters Right click the current display adapter Click Properties Click Driver tab Click Rollback driver if the option is available If not Right click the current display adapter Click Uninstall Check the box that says, \"Delete the driver software for this device.” Exit Device Manager Restart Click Start > Settings > Update & security > Windows Update > Check for updates Download and install any pending updates Restart your computer I got down to the Windows key + X step and now nothing is loading up and my search bar is loading so i cannot search anything. ","For me it's exactly the same.My computer won't work properly in save mode either","Same issue here ... stuck at 1709 and all Feature upgrade results in the same issue;Black screen and personalized settings being unresponsive, do get message about ExplorerCTRL + ALT + DEL works but selecting Task Manager will result in nothing, just back to blank screen.I tried today the new 1909 update and same results.To me it seems upgrade is OK, but there is something not okay with user profile.I tried to create new one and still same result ... pity MS has no 'real' solution to this.Though luck I can do roll-back of Feature upgrade but need to pause updates to avoid another Feature upgrade :-("]},{"symptom":"sd card: wont open,, have adjusted knob on side to unlock\/lock position still no joy        unable to open sd card","solutions":["Hi dreed, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Have you tried it on another computer?"]},{"symptom":"microsoft store app missing and cortana only half working        i have just bought a new lap top for my daughter and have set myself up as administrator and her as a child. initially cortana had the search box witht the mic in it now this has disappeared, cortana is also missing from the start menu. when i go into the cortana settings there is no option to learn my voice which is a problem as it does not recognise my daughter. i can still ask questions which usually end in a web search. there are no boxes along the bottom of the cortana box when i activate it saying search for apps, docs or web.the other issue ive found is that the Microsoft store app has disappeared so i cant download any apps. it was there initially but now it has gone.ive tried;trouble shooting - all finereset the computer ( keeping files) but this has basically returned it to exactly the same state.i am logged into my Microsoft account on my work computer and don't have these issues so i'm presuming its not to do with my Microsoft account\/settingsim not massively computer savey and don't know what to do other than reset the computer again this time not keeping the files and presumably this will return it to the state when i first got it??","solutions":["Hi Belinda,I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Right click the Taskbar>Cortana>Show search box. Can you see Cortana box with mic?If it is search instead of Cortana, make sure the Language, region is set to supported one, like English.","Thanks for your reply.I have checked and it is set to English UK here are here are are a couple of pictures of what I am","Thanks Belinda, the Screenshots make the issue more clear. Cortana and Search have been separated in the update to Windows 10 1903. Rather than being a digital assistant, Cortana would be evolved to become a productivity assistant. More improvements are coming in the next releases of Windows.https:\/\/www.theverge.com\/2019\/1\/16\/18185490\/mic...Regarding Microsoft Store, you may try re-registering it and let us know. https:\/\/www.tenforums.com\/tutorials\/8239-re-reg...Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"security        i have HP probook 440 G1 and i was not able to setup windows hello face and fingerprint security. What should i do?","solutions":["Maybe we do not know enough about what you already know\/did\/tried exactly? For now you might use a pincode?If you mean that nothing physical is working itself (integrated camera, fingerprint unit) you should check the Settings in your BIOS\/UEFI (checkmark for enabled or not for disabled). Restart your Computer and you should probably press the ESC key for the menu to check (and change) this. You should also check if the Camera and Fingerprint scanner is enabled or not in Device Manager. And don't forget to check the Camera settings in Settings > Privacy.","Hi Michael, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Please try the steps from HP Support and let us know. HP PCs - Troubleshooting Windows Hello Face Recognition https:\/\/support.hp.com\/in-en\/document\/c05873680Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"advice on backing up data to an external source please        Sorry but this is a very simple question.I have put in a memory stick into the USB port and it yells me that there are previous files on the stick but on the screen it says drive E is disconnected and all I want to do is to back up my present data, can anyone please tell me what I'm doing wrong.ThanksCarol","solutions":["Hi Carol, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.It looks like you are using File History to backup, right? https:\/\/support.microsoft.com\/en-in\/help\/402656...File History and other backup utlities in Windows are not being developed or maintained. I suggest using a 3rd party Software to backup your external data to a drive."]},{"symptom":"My new Hard Drive is not showing up in My computer but rather in Device manager        Hi,so I just uprgaded my PC with new internal hard disk. Hard disk is properly connected to motherboard so that shouldnt be a problem. The real problem is when I expected to click on My Computer and see my new hard disk. But I see nothing except other ssd's and external hard drives I have had before. I checked Device manager and my hard can be seen there therefore its properly connected to pc. Do i have to map the drive with new letter? Or format it somehow? (I have never formatted) Do I have to do something under disk management?Please help,Fran :)","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Yes you do have to initialise and format the disk before you first use it, it a fairly simple process. Please see this guide under the new partition section:https:\/\/www.windowscentral.com\/how-format-new-h...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Suspicious Registry Entry. Should I remove it?        Hi!Recently, I was tricked into installing a dubious Android emulator called GameLoop. I find it dubious because when it was running, it registered a service that has an string of Asian characters as a name (I think Chinese). I just do not like to have any service I don't know running in my laptop, or a service that has a name that I cannot read.So I uninstalled the emulator and swore to never install any emulator in the future. So, I checked the running services and found that the service with Chinese characters is gone. I felt relieved, but I still have my doubts that it must had left something within my hard drive or even  within the registry. Then, I checked out my registry and found a weird registry entry I never saw before, it is:Computer\\HKEY_USERS\\QMConfigIt only contains a (Default) REG_SZ entry with no data value set.But then, I am always afraid of editing the registry since even I tweak it sometimes, I am still not confident of myself. Perhaps this registry entry is a new feature or is actually not related to the emulator I installed recently.So my question is: should I remove this registry entry (folder)? Thank you and have a great day!","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.If you have already uninstalled the app and services I don’t believe it will really have any effect deleting the reg key too. Essentially all the registry is, is a collection of settings.However if you do wish to delete you can backup the registry from the file menu in regedit, delete the key and then check if you have any problems.If you do then just restore the backup. Regards, Ross"]},{"symptom":"Windows 7 support        so i bought an original windows 7 disc 3 years ago and used it on my now broken gaming laptopi am planning on making a new pc on february this year but apparently windows 7 support will end this month, will i still be able to use my windows 7 key on my new pc and upgrade it to windows 10?i already upgraded to windows 10 on my old laptop before, so will i get windows 10 when i use the key?","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.It depends whether you bought a OEM or Retail version of Windows 7 - the OEM versions cannot be moved to new hardware, so if you activated it on your old laptop you probably won't be able to use it on your new build.However I often find that if the key hasn't been activated for a long time, or of course if you have a Retail key you should be able to use it on your new computer.Build a Windows 10 USB install media from https:\/\/www.microsoft.com\/en-gb\/software-downlo... Use this to install your new build - when it asks for a product key enter your Windows 7 key... this should be accepted and Windows will install.Once you have Windows running check whether you can activate it. If it does then you're fine... if it doesn't you might need to purchase a new license after all. But it's worth a try!Regards, David"]},{"symptom":"Windows Product Key        I used my product key on a computer that I had to return and now I can't sign into windows on my replacement computer. Do I need to purchase it all over again?Office Home & Student 2019 (1 Device) (Product Key Card) - Mac|Windows","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.You should be able to do this without purchasing a new key, please see this thread for a solution. It was for a previous versions but the process should still stand:https:\/\/answers.microsoft.com\/en-us\/msoffice\/fo...Regards, Ross"]},{"symptom":"Feature update to Windows 10, version 1903 will NOT update on my Dell Precision 7520 machine        Feature update to Windows 10, version 1903 will NOT update on my Dell Precision 7520 machineI have a Dell Precision 7520 machine on Windows 10 and I am trying to update the latest window patches but I have encountered an issue with the Feature update to Windows 10, version 1903.As soon as I reached out to around 35% a pop up window appears that Windows needs my attention. This is the message I receive: -\"AMD Ryzen™ or AMD Ryzen™ Threadripper™ configured in SATA or NVMe RAID mode.A driver is installed that causes stability problems on Windows. This driver will be disabled. Check with your software\/driver provider for an updated version that runs on this version of Windows.Click here for more information\"I have clicked on the link and it takes me to a new window and I have scrolled down to resolution and click on the link which takes me todownload the latest AMD RAID drivers directly from AMD at X399 Drivers & Support. So I have clicked on the link to take me to the drivers and when I have made sure to download the latest version 9.2.0.105 or later for AMD RAID Installer (SATA, NVMe RAID), the installation is aborted as this installer is intended to be deployed only on an AMD System. I have extracted the files and ran it but still having issues.What do I need to do in order to download the lest feature update to Windows 10, version 1903?","solutions":["Hi, Steve My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.If you have a third-party antivirus, you must disable or uninstall it. Try reset Windows update components: Right click on the start button and select Powershell (admin) or Command Prompt (admin)Write the next hit enter after each line. net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Restart and try again. You can also download the Windows Error Solver: https:\/\/support.microsoft.com\/en-us\/help\/10164\/...https:\/\/aka.ms\/wudiag You can do it manually by downloading the Windows ISO. When updating with the ISO, disconnect the Internet. https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/answers.microsoft.com\/en-us\/windows\/for...","It appears The Dell Precision Mobile workstation, uses Intel for its SATA drivers..  If that is not correct, exactly which Dell Model do you have?If it is correct, check the Dell download page for possible firmware updates for your drive and new SATA drivers for your system.  There was a situation with older Intel iastorA.sys drivers..","uninstall that particular device driver through device manager, then start upgrading once again","Thanks for the response guys!RAJU.MSC MATHEMATICS - What device driver do I need to uninstall?","amd graphics card device driver","It is a Dell Precision 7520Shall I uninstall the driver from Device Manager to bypass it?","I cannot seem to find it under Device Manager.This is so annoying :(","Check the link to see if your system is effected.  You need SATA drivers..https:\/\/www.intel.com\/content\/www\/us\/en\/support\/articles\/000055130\/technologies\/intel-rapid-storage-technology-intel-rst.html","Each time I've gone into Check for Updates it reaches like 75% before a Windows 10 Setup appears. The title of the screen says \"What needs your attention\". The full message is \"AMD Ryzen or AMD Ryzen Threadripper configured in SATA or NVMe RAID mode. A driver is installed that causes stabaility problems on Windows. This driver will be disabled. Check with your software\/driver provider for an updated version that runs on this version of Windows.So I've gone onto the link and I think I've download the correct version but it still won't update to the latest version of Windows 10, version 1903 under Check for Updates."]},{"symptom":"Windows Live Mail        Following a rebuild of my pc and the installation of Windows 10 I have ended up with the following Windows Live Mail situation. Immediately under my account I have the following folders Inbox, drafts, sent, junk and deleted items but none of my own folders. These folders now appear as sub folders of Imported Folder which is a sub folder of Storage Folders. I assume that to get back to my previous folder structure I would have to create all these “own” folders under my account and transfer\/move all messages from the Storage Folders to the newly created ones? Once done am I able to delete the content of the Storage Folders? Could I delete the Storage Folders themselves? (prior to this event my Storage Folders were “hidden” and I have no idea what folders existed,  what their purpose was and what they contained so I am rather confused) I did read in a post  that after an import or recovery from a corruption you should move folders out of Imported Folder so if it is recommended that I keep all these (empty?) folders should I move them to the root of Storage Folders?","solutions":["Yes, you can delete any folders in Storage Folders section which you are now finished with.Glad you managed to get things sorted out! Let us know if there's anything else. If you don't have any more questions, feel free to choose a rating. Thanks!"]},{"symptom":"Easy fix for two finger scroll disfunction on ASUS notebooks        I've had a very annoying disfunction of my two finger scroll option from the touchpad of my notebook and I've had to fix it several times this year. So far, the easiest and fastest way I've found to fix it is to open theControl Panel, go in Program and open Programs and Features. Find the program called \"Asus Smart Gesture\" and select from the top the buttonrepair or right clic and select the option repair. You might have to restart your notebook but you're basically done. Hope this helps...","solutions":[]},{"symptom":"Visual problem with certain apps        A few weeks ago maybe even 2 month ago I started having the problem that some of my apps start to get like a visual glitch. I don't know how to describe it but I'm including a picture. It always happens with apps that are dark like Discord, Atom, Visual Studio Code. I haven't been able to figure out what it is but I'm sure somebody has the same problem and would be happy to find this with some information about how to fix it.","solutions":["Hello oOsoulsingerOo, I am Andrew an independent advisor. I see in your screenshot the Windows taskbar is not affected. Have you tried updating the drivers for your hardware via the manufacturer? Go to your PCs manufacturer website and be sure video display drivers are most recent. If this continues after this please let us know. Take Care, Andrew","Yes I have already updated, rolled back to drivers were I didn't have but it didn't change. It usually only happens in apps like the PTB of discord or today when I installed Visual Studio Code for the first time. The glitching is also only visibal when I'm using the app or in the case of Discord when I'm connected to a channel and I have it running on my second screen.","One thing I forgot to mention is that I am using a Windows Insider Program OS build. But I manage to fix it by updating my OS to 19536.1000 I now can't use Wallpaper Engine but I at least know that I'm not the only person that is having a problem and I can live without Wallpaper Engine for some time ^^. I really appreciate your help Andrew and thank you for taking the time to help someone in need! ","HI oOsoulsingerOo Thank you for sharing the fix for your issue. Insider program may sometimes lead to some issues. Have a nice day Regards"]}]}