{"windows":[{"symptom":"windows server 2019 activation key        Hello everyone,I recently switched from windows 10 to windows server 2019. I haven't read all requirements before switching. I am currently struggling about activation windows server 2019 on my laptop. I have a laptop HP spectre X360 2in1, Serial 2VL25UA. How I can active windows server 2019. There is any other way to return to windows 10 only? Thank you I will appreciate any help.","solutions":["Hi Paul,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Server isn't for home consumer. Server is for Enterprise users and it is used to manage multiple devices.If Windows 10 was previously activated you should reinstall Windows. It would automatically activate with a digital license. Make sure to install the same version as was before."]},{"symptom":"“Cant connect to this network” error        Hello,I own a Windows 10 Dell laptop, and am having problems with connecting to my home wifi network. It just occurred this morning that I noticed that I didn’t have any wifi. I located my network, and I tried connecting, but it said “Can’t connect to this network.” I tried forgetting it then putting in my password several times, but to know avail, and always receiving the same error message. Any solutions? Thanks.","solutions":["Hi lbarc16, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.The driver might need updating. What is the model of the Dell laptop? Download the driver package, remove the driver and then reinstall the newer one. We can find it for you if you need assistance regarding the same. Remove the driver completely: https:\/\/answers.microsoft.com\/en-us\/windows\/for...","Before that you can try a Network reset and see if that helps. https:\/\/www.tenforums.com\/tutorials\/47937-reset...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads.","Hello,I have performed the Network reset, but i still cannot connect to the internet. The model of my Dell laptop is “Inspiron 3593”. Thank you for your help.","Hi, There are multiple drivers being listed for your model. Please install the one which is compatible.https:\/\/dl.dell.com\/FOLDER05930354M\/3\/Intel-AX2...https:\/\/dl.dell.com\/FOLDER05867607M\/2\/Intel-AX2...https:\/\/dl.dell.com\/FOLDER05821208M\/1\/Qualcomm-...https:\/\/dl.dell.com\/FOLDER05859543M\/2\/Dell-Wire...Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","Unfortunately, I am unable to install these drivers as my computer has no internet. I am using a personal iPad to talk. Any other solutions that doesn’t require wifi? Thank you.","I understand. You should be able to download them on your mobile phone(Sorry, I am not an apple guy hence cannot say if you would be able to transfer the downloads from iPad to computer) and then transfer it to your computer either using a data cable or a transfer software.Also, Did you check if the mobile Hotspot works on the PC?","I do believe hotspot works on my computer so I will try installing the driver. So do I have to uninstall the current network adapter, install the new one, then restart the computer? Is it another method? Is there a website that can correctly take my through what I have to do? Thank you very much again.","Hi,Besides updating the driver, there are still some other ways you could have a try:Press win+R to open Comment Prompt, there you enter the comment and then press Enter: netsh winsock resetBTW, don't forget try to reboot your router.Regards,","Unfortunately, there isn't a website to explain the steps, nicely :) Yes, uninstall the network adapter, install the one that installs from the links I gave and restart the PC.Connect to the network using network credentials and you should be good to go.","Hello,I have uninstalled my current network adapter, installed the new one from one of the links, then restarted my PC. However, I still couldn't connect to my network again :( I even performed a network reset after that, and I still can't connect. Any more solutions?"]},{"symptom":"Personal Vault Will Not Unlock        I received the following error: \"Something went wrong with your Personal Vault\" and goes on to say \"Your personal vault is locked. To access your personal vault please unlock it again.\" The related code is 0x80316003. I recently installed the Windows 10 home build 1903 a few days ago and enabled the personal vault feature the same day.Note, I can access Personal Vault via the browser interface but NOT via file explorer.","solutions":["Have the same problem but can access my file via file explorer."]},{"symptom":"how do i stop windows from stating \"your organization requires you to change your password\"        I am using an HP laptop running windows 10 home edition version 1903. My version was just updated to build 18362.535. This is my personal laptop and noone else has access or an account. I am logging in using my microsoft account. Every time there is a windows update (and even other times) i get the statement 'your organization requires you to change your password\".  I DO NOT HAVE AN ORGANIZATION. This is a PERSONAL laptop. Why is it asking me to change my password at all, as according to microsoft the deault value is to NEVER have a password expire. I am getting tired of changing a password that i dont want to be using at all. This is getting ridiculous. Please do not come back and tell me some type of convoluted way to change my registry and give me 500 steps to follow. Even though i do have some education in computer science, i do not work for MICROSOFT. I am the end user, not the programmer. There should be an easy fix for this. HELP!!","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are being asked to reset the password for your user account. One of the things I suggest you is to run the WMIC command to reset the settings for user accounts. Press Windows + S key together to open Search.Now type CMD and selectRun as administrator.Accept the UAC prompts.Type in the following commands one by one and hit Enter:wmic path Win32_UserAccount set PasswordExpires=FalseRestart the PC. Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator"]},{"symptom":"Trouble activating windows after changing hardware.        Hello, I just recently changed the motherboard and CPU in my computer. I had a retail windows 10 disc and product key that I used to activate windows on my SSD a year or two ago before this upgrade, and promptly linked it to my MS account. I can't seem to get the windows troubleshooter to work reactivating using my Microsoft account. It just says \"unable to activate windows at this time\". I have my product key with me, but using \"change product key\" doesn't work either. Any advice for what I can do? I tried calling in to support but it didn't really help, but I feel like that's about all I can try at this point.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I appreciate the efforts in resolving this issue. I understand that you are unable to reactivate Windows after changing Motherboard and CPU. We would like to know the error message that you receive when you try to activate Windows using the product key. I would suggest you to refer the troubleshooting steps mentioned in the articleGet help with Windows activation errors depending on the error message that you are receiving. You may also want to look at the article on Reactivating Windows 10 after a hardware change. However, the best point of contact will the Activation team, as they will have the access to check your device and account to help you appropriately. Please refer the articleGlobal Customer Service phone numbers to get the Customer support number as per your country. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Computer starts up slowly and then freezes up        My computer is slow starting up and about 30 minutes later it freezes up and I have to turn it off and try to look for the problem. I've looked on HP support assistant and can't find the problem. I recently received the free McAfee antivirus but I didn't want because it was only on a trial basis so I deleted it from the programs. I then bought Total AV. I also installed a free cleaner but it didn't help. I don't know what to do. Can you please help me?","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as the PC is running slow and In order to get clarity and to assist you accordingly, please reply with the answers to the questions below. What is the Windows 10 version and Build installed? (Typewinver in Windows search\/Run command)What is the make and model of the PC?Are you aware of any changes on the PC, prior to this issue? For further investigation, please provide us the screenshot of the task manager, which will let us know the cause of this issue. Follow the steps mentioned in thescreenshot posted by Shawn 'Cmdr' Keene on Oct 2, 2015 to post the screenshots.) Do not share any personal information in the screenshots. Meanwhile, perform the steps (exclude step 10) as mentioned in the article:Tips to improve PC performance in Windows 10 Also refer this article from HP as an additional information: HP All-in-One Products - The Computer Will Not Start or is Slow to Start While the HP All-in-One is Connected Let us know how it goes. Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"Problem in copy of digital signed PDF file to USB Drive        I am getting error message\"There is not enough memory to complete this operation\" when I am transfering digital signed PDF File to USB drive from harddisk in windows 10. I have updated windows 10, Adobe reader dc but still facing problem. Please help me in resolving this issue.","solutions":["Hello Ruchir, I'm Didi, an independent advisor. To fix this error when trying to transfer PDF files to your USB drive, launch Acrobat Reader DC and from the \"Help\" dropdown menu select \"Repair Installation\".Reboot if needed. If it doesn't work disable the preview pane in Explorer by pressing Alt + P, even though it might not look linked it might solve the issue.Regards, Didi","Hello Ruchir, I'm Didi, an independent advisor. To fix this error when trying to transfer PDF files to your USB drive, launch Acrobat Reader DC and from the \"Help\" dropdown menu select \"Repair Installation\".Reboot if needed. If it doesn't work disable the preview pane in Explorer by pressing Alt + P, even though it might not look linked it might solve the issue.Regards, Didi Thanks Didi -I have tried both options but still facing this problem. This problem is with some of PDF files ( Not all) and digitally signed files","Hi Ruchir, Do you have another USB key so we can test if the problem is only with the first USB key ?Also start your PC in safe mode and check if the issue persists : https:\/\/support.microsoft.com\/en-us\/help\/12376\/... Regards, Didi","Thanks Didi for your supportThis problem is because of File System. I was not able to transfer in FAT32 file System USB but there is no issie in transfering in NTFS"]},{"symptom":"internet        I have a desktop computer that has woked fine until a couple weeks ago. I have xfinity wifi. I cannot get on the internet, which means the pc is useless. I have reset and rebooted to no avail. I have had comcast tech out and no reason that this is happening. I had one tech tell me that my pc is old, I don't thing 2 years is old. Now to make it even weirder, I hooked my son's computer up and I still couldn't get on the internet. Lastly, my wife has a laptop downstairs that she has no problem with. We use Windows 10 and have no virus. I hope someone can come up with an answer. I have also checked all my connections","solutions":["Hi ThomasHigginsWP and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.Are the 2 PCs connected via WiFi or Wired Connection? Try obtaining an IP address automatically. https:\/\/www.linksys.com\/us\/support-article?arti...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Joseph, thank you for your response. My wifes laptop and my pc share wifi and that is what makes this so odd. I can't get my wifi or internet to work where she has wifi and internet access. I did what you suggested but I couldn't get it to work. When the time came to click on the local area connection icon, I didn't have one. What I had was four icons. One was Broadband connection(not connected), Ethernet(unplugged), TotalAV(disconnected and wifi(not connected). Is there ant thing else you could suggest, keeping in mind I am pretty much computer illiterate. I don't believe it is my computer because I put another computer in place of mine and I couldn't get it to do anything also. Thanks in advance, Tom","Hi ThomasHigginsWP, 1. Check your PC if it has a built-in Wifi adapter. 2. Check if the Wifi adapter driver is installed. [Please see the image attached below for your reference.] \"Annotation 2020-01-07 132227.jpg\"3. Update your PC. https:\/\/support.microsoft.com\/en-ph\/help\/402766...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Hi ThomasHigginsWP,are your Desktop computer and wi-fi router located on the same floor as the house?Is the level of the wi-fi signal on the computer good?Is your wife's laptop placed closer to the router?Are you connecting to the 2.4 or 5 GHz network?Does the problem occur in both modes?What is the error message you receive when you try to connect with your computer?If you prefer, post the screenshot.Also, post the exact model of your wi-fi adapter.Follow all the tips in the guide carefully:https:\/\/support.microsoft.com\/en-us\/help\/4000432\/windows-10-fix-wi-fi-problems"]},{"symptom":"DCP Watchdog Violation - Windows 10 Insider vb_release_19033        I received this Green Screen of Death (GSOD) stating that I got a \"DCP_WATCHDOG_VIOLATION\". I looked on previous Microsoft Support answers all stating that it was due to old SSD firmware. I am currently running Windows 10 vb_release 19033 (Windows Insider build).I recently changed the BIOS and have now reverted to the default values.I have run the BIOS diagnostic, Windows Diagnostic, System file checker and Windows Startup repair to check if it was my Windows software had been corrupted. Luckily, it wasn't and appears to be a weird software issue.I have attempted to reset my PC using the built-in Windows 10 installer (NOT the Media Creation Tool, this is the one that comes up when you open Windows in the Recovery Environment).I am now downloading an ISO version of the 64-bit Windows 10 1909 (Consumer Version) in the hope of reinstalling Windows. If it doesn't work, then I'll have to use the Media Creation tool to download Windows 10 1909 to reinstall Windows using a USB. I am now currently using Windows 10 in Safe Mode with Networking.My Specs: (Pre-built laptop)Dell Inspiron 7520 15R SECPU: Intel Core i7-3612QM @2.10GHzRAM: 2x4GB DDR3GPU (integrated): Intel HD Graphics 4000GPU (discrete): AMD Radeon HD 7700M Series (2GB)SSD: HGST HTS721010A9E630 (1000GB).Extra Bits:I have also posted this issue on Reddit under r\/Windows10 and r\/pchelp.Links: https:\/\/www.reddit.com\/r\/Windows10\/comments\/ekll1k\/windows_10_loads_into_a_high_cpu_usage_for\/https:\/\/www.reddit.com\/r\/Windows10\/comments\/ekll1k\/windows_10_loads_into_a_high_cpu_usage_for\/https:\/\/www.reddit.com\/r\/pcmasterrace\/comments\/ekq3lz\/win_10_bsod_and_other_errors_cannot_use_win_10\/","solutions":["Hi, It may help to look at the minidump files from the blue screen crashes. Can you zip up the minidump files in the C:\\Windows\\Minidump folder and make available (provide link) via a public folder on OneDrive or similar site.Here's a link on using OneDrive: http:\/\/windows.microsoft.com\/en-ca\/onedrive\/sha...If you have problems zipping the minidump files copy the minidump files to another location such as a folder on the Desktop.Also, you do not necessarily have to zip up the minidump files, you can upload them one at a time.","Were you able to locate the minidump files in Safe Mode with Networking?"]},{"symptom":"Unable to find the GIFs and how to set up as desktop background        I purchased a NASA picture of the day and was charged by my Microsoft account.I cannot find the picture on m computer. Where did it go?Also, how do you get images of gifs to show on the desktop background? They show fine in my pictures in photos?Please help?<Edited for PII>***Modified title: Digital picture purchased from NASA picture of the day thru microsoft account***","solutions":["Hi,Thank you for writing to Microsoft Community Forums.We understand your concern, as you are unable to find the NASA picture that you have purchase using Microsoft account. In this scenario, we would like you to check the Pictures and Downloads folder in this location:C:\\Users\\Username.We as Microsoft community forum, are here to help you with any technical suggestion on Microsoft product. However, anything related to subscription based or purchase and payment related query, you need to check with ourMicrosoft Store support team and see if they can help you with this issue.The second query in your post, where you would like to set the GIF as the desktop background. In this case the GIF’s will be the desktop background but the motions\/movements will not work, it will be like other JPEG pictures that you set for desktop background. To set the GIFs as a normal desktop background, go toWindows Settings > Personalization > Background > browse > select the gif picture.However, this is a valuable suggestion as there may be other users with a similar requirement of GIF’s file as gif desktop background with all the movements. Hence, I suggest you to leave aFeedback for this product so that our developer team can look into this and check if it can be implemented in the future updates.Regards,Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"How do I get all my apps connected        How do I get all my apps connected * Moved from Community Participation Center* Original title: Connect","solutions":["Hi Tammy, Thank you for writing to Microsoft Community Forums. In order to get clarity and to assist you accordingly, please reply with the answers to the questions below.What is the Windows version and Build installed? (Typewinver in Windows search\/Run command)What are the apps you want to connect and where you are connecting?What is the error you get while connecting the apps?Are these apps downloaded and installed from Microsoft Store? However, if you have installed the app from Microsoft store then those apps will be associated with your Microsoft account and if you sign in with the same Microsoft account on any device you will be able to see the apps in Microsoft Store Library. As additional information you can refer to this article: About sync settings on Windows 10 devices. We await your response. Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"my laptop is not connecting to wifi        Hi   I am unable to connect to wifi from my laptop.... tried so many options but not working.... DNS server is not responding...","solutions":["Hi HarithaRani,can other devices connect to your wi-fi network? Check if the wi-fi network icon is present on the taskbar and if it is regular.If you have not already done so, restart the router and the PC and then try again.https:\/\/support.microsoft.com\/en-us\/help\/10741\/windows-fix-network-connection-issues","Hi   I am unable to connect to wifi from my laptop.... tried so many options but not working.... DNS server is not responding...Did it work previously ???If it did then wait a few hours or more and try again.It could just be an outage.We all get a bit antsy when the network is down or out.Restart the computer.Sometime just a restart can fix certain issues.Reset your Modem \/ Router which you are connecting through.Check in your Device Manager \/ Network Adapter.Is this all ok or showing a problem with it ???Does the computer show a WiFi network icon on your task-bar ???If so click on it and see if it states : connections are available.If it states that then the adapter seems to be working. Run the windows troubleshooting.Click on the Start Orb.Type : troubleshooting then press the enter key.Select : network and Internet and press enter key.Select : Internet Connections and run it to see if it finds any issues.Also run the : Network Adapter in the list to see if it finds any issues. "]},{"symptom":"Sleep time for different user        Buna seara,Vreau sa setez pe contul de admin si pe cel al copilului timpi diferiti pentru momentul intrarii in repaus (sleep) si nu merge. setez timpii pe un cont si sunt la fel pe toate conturile. ce pot sa fac?{Mod Edit: Translation:Good evening,I want to set the account of the admin and that of the child different times for the time of sleep and not working. I set the Times on an account and are the same on all accounts. What can I do?}***Modified title: account of the admin and that of the child different times for the time of sleep and not working***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as you are trying to set different sleep time for the Administrator account and the child account. We reproduced the issue on our lab machine and found that the sleep time is not user specific, as this is setup on the hard drive which is hardware specific. However, I commend and appreciate you for recognizing this behavior. This is a valuable suggestion as there may be other users with a similar requirement. Hence, I suggest you to leave aFeedback for this product so that our developer team can look into this and check if it can be implemented in the future updates. Regards, Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"Critical Structure Corruption - again        Hi,Sorry to ask the same question again: after Windows update from 7 to 10, I've got the Critical Structure Corruption error. I have updated all drivers and uninstalled programs that seem to interfere. Yet, the problem persists.I have prepared 3 minidump files and screenshots of the PC and windows characteristics, available here: https:\/\/1drv.ms\/u\/s!Al_amLY8pM34hAPiTsTkyXGOFzkM?e=IgB6CjCould you, please, help me to solve the issue, if it is solvable at all? Thanks in advance!","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as you are facing Blue screen of death after updating the PC from Windows 7 to Windows 10. We analyzed the mini dump file that you have provided in the post, after the analysis we found some unknown module which is causing this issue. In order to get clarity and to assist you accordingly, please reply with the answers to the questions below. What is the Windows 10 version and Build installed? (Typewinver in Windows search\/Run command)What is the make and model of the PC?How many RAM sticks are you using in the PC?Does the computer boots to desktop?When do you get the Bluescreen of Death? Meanwhile, we would suggest you to refer the steps as mentioned in this article:Bug Check 0x109: CRITICAL_STRUCTURE_CORRUPTION If you are using multiple RAM sticks then swap the sticks and check if you face the issue. Also provide us a recent mini dump file, which will help us for further investigation. We await your response. Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"On-Screen Keyboard stops working on Windows 10 IoT        Hi,I am developing an Universal Windows App for textile industry. It's used for quality check process and it's working fine actually. But after some usage on-screen keyboard seems to crash and users started to get annoying about it.I don't know what i can do about it, right now i am tracking memory usage of my software and thinking maybe it's growing to much etc. but OSK is generally handled by windows itself.here is a picture of keyboard when it's stop working:Has anyone experience something like this? Or anybody has any idea how to not crash keyboard?Best regards","solutions":["Your question is outside the scope of this Community..Kindly repost in the TechNet Forums:https:\/\/social.technet.microsoft.com\/Forums\/en-US\/homeOr MSDN Forums as you are developing an App:https:\/\/social.msdn.microsoft.com\/Forums\/en-US\/homehttps:\/\/social.msdn.microsoft.com\/forums\/en-US\/home?forum=WindowsIoTCheers."]},{"symptom":"bit cuc ji ma tra loi ?        lam nhu gioi wa, giai quyet cai me ji dau?","solutions":["You have posted to an English Language forum.And there are no Vietnamese language forums here.Either post in English or click on the World Globe Icon at bottom left of any web page here to select a different languageBạn đã đăng lên một diễn đàn tiếng Anh.Và không có diễn đàn tiếng Việt ở đây.Đăng bài bằng tiếng Anh hoặc nhấp vào Biểu tượng Quả cầu Thế giới ở dưới cùng bên trái của bất kỳ trang web nào tại đây để chọn ngôn ngữ khác"]},{"symptom":"Hard drive completely erased after installing Windows        Hello when i got windows installed my hard drive was completely erase***Modified title from: خرابی سیستم***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that after installing Windows on your computer the hard drive is completely erased. There are two types of Windows installations, i.e. Custom installation and Clean installation. Depending on the type of installation, the data is stored in the Windows.old folder. If you have performed a custom installation on the computer, the data is store in Windows.old folder, however, the programs are lost. You can look for the data in the Windows.old folder. If you have installed Windows by booting from a Disk\/USB and selected format option, all the data and programs from the hard drive are removed.  For more information, see the section Types of reinstalls for Windows 10in the article Reinstall Windows 10 Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Unable to complete the setup for Your Phone app        Here is the situation.  Had a Lenovo Yoga 920 connected to my LG V40.  Your Phone worked fine.  Moved the hard drive from the Yoga 920 to a Thinkpad T480.  Your Phone app won't connect any longer.  I'm stuck on the \"Your almost done\" on the computer with \"Resend notification\" and the phone says \"Check your PC\".  I have unlinked my computer, unlinked my phone from my Windows PC, uninstalled the app from my phone, terminated and reset my Your Phone app in Windows, checked for updates, restarted the phone and computer, and always get back to the exact same location.  The computer has sent a text to my phone, which I get.  I click it and load the Your Phone app on my phone, sign into my correct MSN account (which is the same on the phone and PC), the app says it has to check some final thing and just sits on the \"Check your PC\" screen and says it's waiting on a notification from the PC.  The PC has the \"resend notification\" box, which I click again and again and again, and it spins saying that I have successfully signed in on my phone.  Then it just goes back to \"resend notification\" and I never get a notification on either device.  I have given up.  Any suggestions from the internet hive mind?!  HALP!!!!Bill***Modified title from: Can't get Your Phone to connect to my Android phone***","solutions":["Hi Bill, Thank you for writing to Microsoft Community Forums. I appreciate the efforts taken by you in resolving the issue. I understand that you are unable to setup Your Phone application. I’ll certainly help you with the issue. As per the description, I see that you do not receive a notification on the phone to allow the final permission. Ideally, the Your Phone application needs few permissions to be allowed to complete the setup. Since you are not receiving any notification on the phone, you can manually allow the permissions by going to the Accessibility settings in thePhone Settings.  Also, I would suggest you to ensure that all the required permissions for the Your Phone app is allowed from the Phone. To check that you can go to thePermissions section in the Settings on your phone and allow all the required permissions. For more information, see Your Phone app help. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"64 bit capable?        Hello I just want to ask if my PC can run a 64 bit OS. My processor is Pentium (R) Dual-Core E5200. The system type says that it is x86 based but on the performance information tool (if I’m not mistaken) it says 64 bit | Yes. Please help me. I just don’t want my other RAMs to be used for nothing. ","solutions":["Is this applicable to me? I am from the Philippines. :\/","Dual Core is long time  retired by Intel..Either way,older Pentium processors ran\/run 64BIT.https:\/\/www.intel.com\/content\/www\/us\/en\/support\/articles\/000005495\/processors.htmlhttps:\/\/ark.intel.com\/content\/www\/us\/en\/ark\/products\/37212\/intel-pentium-processor-e5200-2m-cache-2-50-ghz-800-mhz-fsb.html?wapkw=E5200All Intel processors might have same type,but the model Bus speeds can be different,the 1st link gets you the Intel Processor ID utility,simple small utility,the 2nd gets you E5200 specs,yes 64BIT will run w\/o a problem.All that is needed is a Microsoft\/Windows 64BIT OS installation cd,best bet,boot pc to OS cd,set for this in BIOS,boot to cd,follow the menu.Default is delete old partition\/create  one\/Format\/it all runs Auto...","Is this applicable to me? I am from the Philippines. :\/ -That post was spam. It's been deleted.Don","32bit > 64bit is not done by any upgrade.It is done by a clean install.Retail Windows 7 licenses can use 32bit or 64bit (but not both at same time) for free.OEM licenses are for the bit architecture that they are bought with.If you want to change it, you have to buy it.It requires a clean install of the operating system.Save all your data and be prepared to reinstall all your 3rd party programs.Then do a clean install:http:\/\/www.sevenforums.com\/tutorials\/1649-clean-install-windows-7-a.html_______________________________________________But before you attempt it, check with your computer\/laptop manufacturer to make sure that they support and supply 64bit drivers for your machine and for the edition of Windows 7 you are licensed for.Also check your computer specs to see if you have or can upgrade to at least 4GBs of RAM, as without at least 4GBs of RAM you are wasting your time installing a 64bit version.Or it may be easier for you to download the Crucial Scanner which will tell you what is the matching RAM for your Motherboard and the max. amount of RAM your Motherboard can accommodate.Crucial System Scannerhttp:\/\/www.crucial.com\/usa\/en\/systemscannerCheers.","_________________________But before you attempt it, check with your computer\/laptop manufacturer to make sure that they support and supply 64bit drivers for your machine and for the edition of Windows 7 you are licensed for.Also check your computer specs to see if you have or can upgrade to at least 4GBs of RAM, as without at least 4GBs of RAM you are wasting your time installing a 64bit version.Or it may be easier for you to download the Crucial Scanner which will tell you what is the matching RAM for your Motherboard and the max. amount of RAM your Motherboard can accommodate.Crucial System Scannerhttp:\/\/www.crucial.com\/usa\/en\/systemscannerCheers.what component will I check? Is it the motherboard? I have ASUS P5SD2-VM. Sorry I am new to this. I bought this PC wayback 2016. ","Thank you so much! ","_________________________But before you attempt it, check with your computer\/laptop manufacturer to make sure that they support and supply 64bit drivers for your machine and for the edition of Windows 7 you are licensed for.Also check your computer specs to see if you have or can upgrade to at least 4GBs of RAM, as without at least 4GBs of RAM you are wasting your time installing a 64bit version.Or it may be easier for you to download the Crucial Scanner which will tell you what is the matching RAM for your Motherboard and the max. amount of RAM your Motherboard can accommodate.Crucial System Scannerhttp:\/\/www.crucial.com\/usa\/en\/systemscannerCheers.what component will I check? Is it the motherboard? I have ASUS P5SD2-VM. Sorry I am new to this. I bought this PC wayback 2016. I did post this for you before:But before you attempt it, check with your computer\/laptop manufacturer to make sure that they support and supply 64bit drivers for your machine and for the edition of Windows 7 you are licensed for.You can also check here, which seems to have 64bit drivers.Look under Please select OShttps:\/\/www.asus.com\/Motherboards\/P5SD2VM\/HelpDesk_Download\/But you still do not mention what type of Windows 7 license you have to see if you can legally change from 32 to 64bit with the OS you have.And do NOT post a product key.","I think I have OEM Windows 7. What would happen if that is so? ","If you are now asking that question you never read the start of my original reply to you.32bit > 64bit is not done by any upgrade.It is done by a clean install.Retail Windows 7 licenses can use 32bit or 64bit (but not both at same time) for free.OEM licenses are for the bit architecture that they are bought with.If you want to change it, you have to buy it.","Sorry. Thank you so much I just overlooked it. Props to you. "]},{"symptom":"您好，我在重装系统过程发生了蓝屏        蓝屏错误 - 一月 7, 2020 1:27:22 凌晨 错误检查代码 0x0000000a 错误检查参数 0xfffff6fb40000000, 0x0000000000000002, 0x0000000000000000, 0xfffff805477a2d00 设备名称 Microsoft Storage Port Driver 驱动程序版本 10.0.17763.292 (WinBuild.160101.0800) 驱动程序路径 C:\\Windows\\System32\\drivers\\storport.sys - Dell Inspiron 3670 System BIOS. - 2.14.0 - 12.18 MB - 紧急- Intel Rapid Storage Technology Driver and Management Console - A00 - 54.29 MB - 推荐- Dell Wireless 1707\/Qualcomm 9565 WiFi and Bluetooth Driver - A18 - 95.38 MB - 推荐- Intel UHD Graphics Driver - A00 - 372.13 MB - 推荐- Realtek Memory Card Reader Driver - A03 - 21.06 MB - 推荐通知 - 为您的电脑提供支持、保持速度 - 完成 - 一月 7, 2020 1:46:17 下午  已安装的驱动程序和下载 (手动) - 完成 - 一月 7, 2020 2:08:44 下午 - Dell Inspiron 3670 System BIOS. - 2.14.0 - 12.18 MB - 紧急 - 已安装 - Intel Rapid Storage Technology Driver and Management Console - A00 - 54.29 MB - 推荐 - 已安装 - Dell Wireless 1707\/Qualcomm 9565 WiFi and Bluetooth Driver - A18 - 95.38 MB - 推荐 - 已安装 - Intel UHD Graphics Driver - A00 - 372.13 MB - 推荐 - 已安装 - Realtek Memory Card Reader Driver - A03 - 21.06 MB - 推荐 - 已安装  驱动程序和下载扫描 (手动) - 5 可以使用的驱动更新 - 完成 - 一月 7, 2020 1:47:49 下午 这是我上传的https:\/\/send.firefox.com\/download\/0d87705eec0af6b6\/#4Hyh3GHcwVvZViNKqgpiGQ","solutions":["您好，我是Jarl，一名独立顾问 (Independent Advisor) 和Windows 10的资深用户，很荣幸能为您提供技术支持。 经过分析您的蓝屏文件，我会建议您采取下面的方法： ======================================== #【方法A】 卸载与蓝屏相关的第三方应用： -pcdsrvc_x64.（Dell SupportAssist 软体） -QQProtectX64.sys（QQ相关防护软体） -dddriver64Dcsa（Dell Diag Control Device驱动） 如果还有其他相关的问题，我会努力为您解答！ Jarl"]}]}