{"windows":[{"symptom":"synaptics fingerprint not working properly after windows 10 1903 update        Ever Since I have upgraded my windows 10 to 1903 on june-17th-2019, the synaptics wbdi is not at all working properly (for Windows Hello)when I open Device manager>Biometric Devices>Synaptics WBDI>properties: \"this device cannot start. (code 10)\" Although its working sometimes, (may be around 2\/10 times) but mostly its not working - there is no \"fingerprint\" option in \"Sign in options\" (in login screen)My laptop model: Lenovo ideapad 520 15IKB (81bf)i have done all of the common workouts and maneuvers:1) Updating the Windows 10 to latest update.2) uninstalling and again re-installing the synaptics wbdi drivers from Lenovo drivers (official mfg.'s) 3) updating the driver from device manager>update driver (let windows search for the updates)4) Checked and made sure that all (other) drivers on my laptop are latest\/working properly.note:  before upgrading to windows 10 1903 it was working fine.","solutions":["Hi MusabAbdullah18, I'm Stefano an Independent Advisor, here to help you. You can try uninstalling the driver and let the system find the best driver to install instead of download them from Lenovo support site. To do that:1. Press WINDOWS + X 2. Click on \"Device Manager\" 3. Click on \"Biometric Devices\" 4. Right click on your fingerprint device 5. Click on \"Uninstall device\" 6. Click on \"Detects Hardware change\" (monitor icon) 7. Reboot Then try to use fingerprint feature (it could be necessary that you remove your previous fingerprint registered)","Hi MusabAbdullah18, I'm Stefano an Independent Advisor, here to help you. You can try uninstalling the driver and let the system find the best driver to install instead of download them from Lenovo support site. To do that:1. Press WINDOWS + X 2. Click on \"Device Manager\" 3. Click on \"Biometric Devices\" 4. Right click on your fingerprint device 5. Click on \"Uninstall device\" 6. Click on \"Detects Hardware change\" (monitor icon) 7. Reboot Then try to use fingerprint feature (it could be necessary that you remove your previous fingerprint registered)without any driver, how could the fingerprint sensor work? (if I uninstalled and scanned then restart i.e point 5,6,7)as I mentioned in my 3rd point I tried installing without manufacturers website, I did it from \"search automatically from updated driver software\" in Device manager it didn't worked at that time it showed \"you already have the latest version of …\"but I just now tried the same step above it installed the driver and now its running fine, but may be it will again not work after few days, as this same thing was happening before also. (Inconsistent functioning)","Once you check for hardware change, the OS will automatically search for driver from Microsoft driver's server so the fingerprint will work, even if you don't install manually the Lenovo driver.However, please check if the fingerprint works or after some days it stops working again.","I just now opened my laptop it is not working , no option .while it was working just few hours before","Hi MusabAbdullah18, I'm Stefano an Independent Advisor, here to help you. You can try uninstalling the driver and let the system find the best driver to install instead of download them from Lenovo support site. To do that:1. Press WINDOWS + X 2. Click on \"Device Manager\" 3. Click on \"Biometric Devices\" 4. Right click on your fingerprint device 5. Click on \"Uninstall device\" 6. Click on \"Detects Hardware change\" (monitor icon) 7. Reboot Then try to use fingerprint feature (it could be necessary that you remove your previous fingerprint registered)I tried this procedure too just now, its not working.","Have you performed also a REPAIR UPGRADE? https:\/\/answers.microsoft.com\/en-us\/windows\/for...","will my personal files get erased ? after that repair?however its a big and time-consuming solution for just fixing a fingerprint scanner issue.","No, your personal files won't be erased if you pick the Keep all option. I know it is a long operation, however, I think that this should be the only way to fix your issue. After the REPAIR UPGRADE, I suggest also a disk clean up:1. Open \"File Explorer\" 2. Click on \"This PC\" 3. Right click on \"C:\" 4. Click on \"Proprieties\" 5. Click on \"Clean-up disk\" 6. Click on \"Clean up system files\" 7. Select every option in the list, but not \"Download\" 8. Click on \"OK\"","I just contacted technician of Lenovo, he told that windows 10 1903 is not yet compatible with the fingerprint device. I have to downgrade to 1809 version to use it. but I chose to stay with 1903. Microsoft must address this issue via Update. ","Thank you for let us know. This will be useful for other user that has the same problem."]},{"symptom":"Struck on undoing changes made to your computer on a black screen with no other option        During the installation of one of the Microsoft update i accidentally turn off my laptop...When i restarted it,it shows texts on a black screen like undoing the changes made to computer.....and I'm not able to do anything to recover it can anyone help me to get out of this trouble?","solutions":["Hi ayushsinha2 Start your PC, just as Windows attempts to load (spinning dots), press and hold Power Button for 5 - 10 seconds to perform a Hard Shut DownDo this twice On the third start Windows will boot into the Recovery Environment and from there you can access System Repair, Safe Mode, Command Prompt . . . etc.Please try each option one at a time, then see of Windows will boot correctly . . .Go to Troubleshoot - Advanced Option - Startup Repair See if Windows startup can repair itself Go to Troubleshoot - Advanced Option - System Restore Check to see if you have a restore point you can go back to If you do not have a Restore Point, go to Troubleshoot - Advanced Option - Startup Settings and click RestartUpon restart, press 4 to enter Safe Mode Once in Safe Mode, backup your data if you do not already have a backup Reboot to see if Windows will start Normally If the above fails, go to Troubleshoot - Advanced Options - Reset this PC Choose to keep your files and apps, just your files or to keep nothing Then start the Reset"]},{"symptom":"Audio Device Not Detected        Hello everyone,I have an issue with my headset not getting any audio output from the PC. My headset does work when I connect it to my iPhone and it the port on the front of the pc can't be broken because it won't work with the port on the back either. So it has to do something with Windows. I tried updating my drivers but it still isn't detecting my headset. I'm on Windows 10 and I use a Razer Electra V2 headset. When I connect my USB microphone it does detect the mic, but it doesn't work with the headset. I have been using this headset for a long time on this same PC, but it suddenly stopped working. Could anyone please help me?Kind regards,Pyke Nagelkerken","solutions":["Hi, PykeNagelkerken My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps. - Press ‘Windows key + I’ together to open ‘Settings’. - Click on ‘Update & Security’. - Click on ‘Troubleshoot’. - Click on ‘Playing audio’. - Click on ‘Run the troubleshooter’. You can also update the audio drivers. https:\/\/support.microsoft.com\/en-us\/help\/402844..."]},{"symptom":"Lenovo ThinkPad 10 no sound no touchscreen        https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-hardware\/lenovo-thinkpad-10-no-sound-or-touch-screen\/7c9ebaa7-d6ab-455b-b374-3ba62994d73cI had the same Problem after clean install - the solution is to install the Intel Platform Device Driver for Windows 10, now it works fineguh107ww from lenovopage is the Intel z3700 chipsetdriverhttps:\/\/pcsupport.lenovo.com\/nz\/en\/products\/tablets\/thinkpad-tablet-series\/thinkpad-10\/20c1\/downloads\/ds100722","solutions":[]},{"symptom":"Restore files to new SSD after HD crash        I have reinstalled Windows 10 on a new SSD after the hard drive crashed. My back up is on another computer but I haven't been able to restore the files from the backup using Windows Backup and Restore.  Using Backup and Restore, when I select the backup location I can select the backup (which when opened in explorer shows a folder dated the morning before the crash) but I get a message that, \"Windows was not able to find any backup set on...\" \\\\[Network Location].What can I do to get my files back?Any help is greatly appreciated!","solutions":[]},{"symptom":"Microsoft gifting error        When ever I try to gift my friend sea of theives it always pops up with this error u07hEoycAEGEHGUQ","solutions":["Hello! I am an Independent Advisor, I would love to help you out! Could you take a screenshot of the error and send it here? Also, you could try a fresh restart of your computer and then try again. What steps are you taking in order to try to gift it?","You should be able to type any message and include the screenshot with it. Or you can upload the screenshot to something like onedrive and send me the link if that works for you.","here is the image","What payment method are you using? If possible try using a different payment method or card.","I go to the microsoft store and go to sea of theives anniversary edition then I hit gift, then I put in my friends email, my name and then I choose my payment methods ","I should have enough        ","Are you sure that there is enough on the visa gift card as well as the information inputted from the gift card is correct?","I should have enough"]},{"symptom":"How to create a recovery DVD for Windows 10        Hi all,I don't have any free USB Flash drive at the moment. Is there a way to create a recovery DVD for Windows 10?Thank you,Seyed  ","solutions":["Do you have any further questions?","The option to create Recovery DVDs are a feature that computer makers add to their computers to simplify the recovery process. In the past, they have generally been an OEM feature and not a Windows feature. Microsoft has provided methods to download ISOs so you can burn your own OS installation DVD or use USB flash storage. This will allow you to reinstall your OS, not recover\/restore it to OEM factory defaults. You would generally contact your computer maker for such media or to find out what process needs to be run to burn a recovery disk from your computer. This process varies from model to model.If you want to make Windows 10 installation media, that is what Microsoft provides via the Media Creation Tool.All you have to do is click on accept the agreement and choose the option to make an ISO file, not reinstall Windows 10. The Media Creation tool still allows you to save an ISO file that you can use to burn to a DVD or use USB flash drive.However, the size of the Windows 10 install has been steadily increasing. If the ISO file is greater than the size of your burnable media, a larger capacity media will be required. This requirement is satisfied by purchasing dual-layer DVDRs or resorting to purchasing a USB flash drive. Windows 10 1909 installation appears to fit on a single DVDR  as long as the both (32\/64bit) option is not selected."]},{"symptom":"Verizon Message+ Windows10 desktop app        How to download Verizon Message+ to my Windows 10 desktop?  The Microsoft Store does not list it as available and Verizon says it's supposed to.","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.You can download from the Verizon site here: https:\/\/www.vzmessages.com\/introduction\/index.htmlRegards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.You can download from the Verizon site here: https:\/\/www.vzmessages.com\/introduction\/index.htmlRegards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Hi there. This is not correct. They no longer have the W10 client available. You have to use their web client. Which is really crappy. ","Thanks for trying Ross.  However, if you look at the page your link ends with, you will find that the Verizon Message + app for Windows 10 desktop PC's is non-existant.  Why?  Because, as Verizon tech support will tell you, Verizon has yet to provide the app for Windows 10 and doesn't know when it will.Dave.","I have the same issue and just posted to the Community.  Is there a compatible app that I can use and still communicate with those folks who still have the Windows 8 version and still use the Verizon messages?  I am a tad on the slow side when these issues present themselves and rely on younger folks to fix my issue but this time I am on my own.....so if you have an answer give it to me step by step.....many thanks","Hi Ross, I have windows 10 and used to have the messages+ app on my computer,  I took it off and just tried to download it and now it's not available.  I'm confused.","I used to have the Message+ app but it started to not work so I uninstalled it and tried to locate it again and noticed that Windows app store doesn't have anymore. Go figure...I guess they are starting to do what they've been doing with the rest of the products.Why is Verizon so against Microsoft and Sony related products? I really wanted that Sony Xperia Phone...a few years ago. Then I wanted the Windows Phone (that only ATT, Sprint, and T-Mobile...hmmm everyone else had). Now there is the OnePlus and we can't get that either. They are starting to get propriety on everything. There a lot of phones that are unlocked that Verizon doesn't allow. Quite frankly....T-Mobile and ATT or catching up really quick to their service reliability...they need to loosing up because I've leaning towards a switch...the competition is less expensive, has more phones, and more compatible with 3rd parties. If they ever catch up with the reliability...I'm out. ","If they decide to release that or another messaging app for Window's will you let me know please? ","Sure but don't hold your breath...  judging from the statement from the CSR stating that they have no ETA.","Do you know why are they are reluctant with Windows and Sony... Just wondering...","You are correct about Verizon.  The reason is that Verizon is in the beginning of a major corporate business model transition.  Frankly, they are trying to decide to convert to an AT&T model of being a media company.  That's why AT&T isn't improving their existing wireless infrastructure or pushing Direct TV anymore.  So, that leaves us with Sprint\/T-Mobile who is convinced they can be profitable in the wireless market.  Everyone knows that satellite-delivered Internet connectivity is almost here and will be ubiquitous and comprehensive and be the preferred content delivery and communication medium.  Obviously, short term, there will be a need and use for ground stations, etc. but they too will rapidly diminish.  So, the existing cable companies will estentially be out of their current business and be relegated to the short term ground station business.  That's one of the major reasons you see Cox and Comcast venturing into media related business and auto auctions and physical entertainment.  You can thank Elon Musk for the brains and guts of the satellite-delivered   Internet, etc.  He may be as brash as Trump but way more solution-centric and one seriously bright and deep thinking business guy.  I've known him a long time and have always enjoyed his approach to engineered solutions.   I'm fortunate to have been in the Starcast control room during the satellite Internet delivery testing with 250 satellites...  and it just plain works.  So, for the time being, Verizon is the best overall play for wireless\/mobile communication.  All the others just rent time and space from them to augment their own meager infrastructures.  Hope that helps you."]},{"symptom":"Right Click on Start Menu not working in Windows 10 (current in Dec 2019)        Hi!  Back on Nov. 13, 2015, user DBmusic0817 posed the question I mentioned in the subject of this note.  To be more specific, when the right mouse button is clicked on the start button in the lower left corner of the desktop screen, then a menu pops up which has black background, and includes entries for executing the power shell, both administrative and non administrative, and the disk management window and the computer management window, and several other items.  My problem was that some of these worked when I clicked my left mouse button on them, and some did not--absolutely nothing happened when I clicked.   Well, the Blog entry I mentioned above finally solved this problem:  It has to do with NCH software installations which in my case were done without my permission.   Once I removed these programs, mainly 7-zip, then the pop-up start menu worked again as normal.   I just thought it important to bring the 2015 entry to the community's attention because the problem is still occurring!!!   And it appears that it wasn't solved until Sept. 2017.  Thanks.  ","solutions":[]},{"symptom":"After windows 1909 update, Pop up notifications are being duplicated up to and including 30 times.        The absolute easiest one to replicate, has been something like the single pop-up that has always been triggered by a low toner, out of paper, or print error from our Lexmark CX410de printers here. Instead of getting that one pop up now, we get anywhere for 5-30 repeated pop-ups with that same information duplicated over and over. This is by no means isolated to Lexmark, as Outlook, MyAsus, and several other programs consistently have the same issue. The Lexmark is the one I am specifically referencing as it is the easiest to replicate and force to happen at any time by simply hitting print with a known low toner cartridge (Lexmark's version of low toner has nearly 500 pages left in the cartridge so fat chance I am changing all of them early lol)Has anyone had a similar issue? We have 15 computers at our office location, and only a handful of them are doing it, yet we all have the same antivirus, office applications, network hardware, printers, etc. All of which are installed and connected in the same way. Looking for some insight on this, as we have just turned notifications off, but that is just a work around and ideally we would love for ... well you know... Windows to actually work correctly?  (I'll wait until you stop laughing at that...)Thanks in advance,JohnAsus G731Wi7-9750HRTX 2070 Max P32GB HyperX (16gb x 2) 2666MHz DDR$ CL15 RamRunning Windows 10 Home 1909Office Professional Plus 2016","solutions":[]},{"symptom":"Activating expired Windows 10 evaluation        Greetings,I set up Hyper-V on my Win 10 Pro laptop and created a VM using an evaluation of Win 10.That VM has expired now and will only stay active for one hour after restarting the VM.Would I be able to acquire a licensed Win 10 version - and then be able to convert the expired VM version to this new licensed instance?Thanks","solutions":["Hello,this is Roman, I'm a independent adviser.Hyper-V instances are like regular windows systems, so you have to have a license for the virtual system and you can activate windows like a windows running on a normal PC.In your case you only need an windows key to activate the virtual windows instance.If you have any questions please post here,Best regards,Roman"]},{"symptom":"Error Code 0x80073d23 when using Windows applications        Hey everyone,I am having problems with my windows apps. None of them work. Everything from Netflix to calculator. I have tried to uninstall them but all I get is an error message with this reference number below. Is anyone familiar with this and how do I fix it?Many thanksJason ChapmanError Code 0x80073d23.***Modified title from: Having problem with Windows 10 apps***","solutions":["Hi Jason, Thank you for writing to Microsoft Community Forums. I appreciate the efforts taken by you in resolving this issue. I understand that you are unable to open apps on your computer. However, it would be great if you can help us with the details request below: When do you get the error message?Does this issue occur only with Windows apps?Which build version of Windows 10 is installed on the computer? To check type:winver in the search bar on the Taskbar and hitEnter.  If the issue occurs only with Windows apps, I would suggest you to refer the steps mentioned in the articleFix problems with apps from Microsoft Store and see if that helps. You may also want to try re-registering the apps using PowerShell and check. Refer the steps mentioned below: Press Windows Logo key + X, and selectWindows PowerShell (Admin).Paste the following command and press Enter: Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Once the process is complete, restart the computer and check. Let us know how it goes.  Regards,Nikhar KhareMicrosoft Community - Moderator","Thanks for the reply.I have done what you asked but still nothing. What's more annoying is when I reboot, everything gets wiped from my computer. I have to sign back into everything every time I reboot. I have resorted to using an external hard drive so I don't lose anything. I don't play games or anything like that. I purchased a copy of MS Office this year. That's all I have installed. I use MS word a lot because I write. That's all.I guess I'm stuck back at square one.ThanksJason.","Here's a screenshot of what version of windows I am using.","Hi Jason,Thank you for replying.I see that you have mentioned that after every reboot everything is wiped from the computer. I would like to know that do you receive any message stating you are logged in to a Temporary profile when you login to the computer.I would also suggest you to check if there is any Temp folder in the Users folder. You can check the same in C:\\Users\\.Let us know the details.Regards,Nikhar KhareMicrosoft Community - Moderator","HI ..I have the same issue. I checked  C:\\Users\\. there was any \"Temp Folder .  However, I receive a message stating I are logged in to a Temporary profile when I was doing the trouble shooting in the Windows app store. I have a problem to open the app store as well as other apps. How may I resolve this issue ?? thank","Hi Nikhar Khare,There was not any Temp Folder in the the user I also done the step  Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"} , but it was blocked with the following message.Add-AppxPackage : Deployment failed with HRESULT: 0x80073D23, The deployment operation was blocked because Specialprofile deployment is not allowed. Please try logging into an account that is not a Special profile. You can trylogging out and logging back into the current account, or try logging into a different account.The package deployment operation is blocked by the \"Allow deployment operations in special profiles\" policy.NOTE: For additional information, look for [ActivityId] a7da97bf-bf2f-0000-4553-dba72fbfd501 in the Event Log or usethe command line Get-AppPackageLog -ActivityID a7da97bf-bf2f-0000-4553-dba72fbfd501thanks"]},{"symptom":"i wou;d like to speaktp a micosoft person or a 800 number to talk to someone        look I been trying to have a program refunded since 25 Dec as I bought windows 10 pro and found out that I did not need it. I have every day  sent msg. back to  you and get no answers what kind of customer relation do you have  my name stephen m keough, phone #617-529-0091*** Email address is removed for privacy ***would appreciate someone contactingstephen m keough sr","solutions":["Hi Stephen On Community, we are just users like yourself, you will rarely find someone from Microsoft on this forum . . .To contact Microsoft Support directly, please choose a Phone No. from the list below, and hopefully they can arrange fro a refund for that product you purchased . . .Choose a local Phone Number: https:\/\/support.microsoft.com\/en-us\/help\/13948\/...Another way to contact support is by Live chat. On the link below you will find that support bot, keep typing in 'Speak to an Agent' every time that bot prompts you for an answer and you will be put through to a live agent . . .https:\/\/partner.support.services.microsoft.com\/..."]},{"symptom":"Device manager | Device hardware ID Col and MI values – what are they?        I wonder what are Col and MI values in hardware ID of device.I know VID is vendor ID, PID is product ID and REV is revision.","solutions":["Hi User919, This appears to be for multi-function devices with multiple top-level collections, with Col indicating the Collection number and MI indicating the Interface number.Source: https:\/\/docs.microsoft.com\/en-us\/windows-hardwa...I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into this further!Regards, -Ashton"]},{"symptom":"multiple duplicate files listed on computer        how do I just have my one set of files on my computer.    When I go to save as, my file explorer shows  3 different places my file should save to i.e., PC, One Drive, then my file in under my name.  I am always losing my last updated file.  How can I have just one listing on my PC with all my files in it so I won't have to keep making sure I know where the latest file is?  Any advice for me, please.  So Confused,  Wadda","solutions":["Hi Wadda, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.I can suggest changing the default location to store your documents, so you will always know where to find them.https:\/\/www.thewindowsclub.com\/change-default-s...Additional, you can check the information of this official community link Files save to OneDrive by default in Windows 10 https:\/\/support.office.com\/en-us\/article\/files-...Let me know if you have something else that I can help you with, I'd be happy to help.Happy holidays Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Defragment C Drive        My  drive is nearly full.  I wanted to defrag it via \"properties\"=\"tools\" but I get the message that it is currently using customised setting created by another program.  Before you can modify the schedule, you must remove  the customised settings.  How and where do I do it???????????","solutions":["Defragmenting your hard drive will NOT result in more available space.  You need to actually delete things.By default, Windows 7 runs defrag once a week.  You probably have installed some antivirus program or \"optimizer\" utility that has taken over scheduling defrag.  See, e.g.,https:\/\/www.sevenforums.com\/performance-maintenance\/59129-disk-defragmenter-scheduled-using-another-program.htmlInstead of worrying about defrag, download and run TreeSize Free.  This will show you what is taking up space on the drive and from that you can decide what to delete. https:\/\/www.jam-software.com\/treesize_freeIf you find that the culprit is that C:\\Windows\\TEMP is being consumed with hundreds of files with names following the pattern \"cab_XXXX_X\" you are suffering from the known \"CAB file bug.\"  Directions for dealing with this are here: https:\/\/www.computerworld.com\/article\/3112358\/windows-7-log-file-compression-bug-can-fill-up-your-hard-drive.html","LemP is right that defrag will not result in more available space.But you should be able to defrag any time you want.Here is how you might solve the defrag problem.If you mean you are seeing something like this:Has the system ever been upgraded to Windows 10 and then reverted back to Windows 7?Do you now or have you ever had a third party defragmentation application installed?Windows 7 comes with a Scheduled Task to defragment all volumes every Wednesday at 1:00AM.If you have ever upgraded the system to Windows 10 and then reverted back to Windows 7 sometimes that will corrupt every Scheduled Task on your system (sometimes fixable).If you have installed some third party application that includes it's own defrag or other kind of maintenance operations it may have disabled the built in Windows 7 task. If you have disabled the built in Windows 7 task yourself you will see that message when you attempt to open defrag (non believers try it).If the task has been disabled and you click the Remove settings button that should enable the task again and (after a moment) you should see:Something you have installed could prevent or override that setting though.Click the Start button\/orb and in the box enter:Task SchedulerChoose to Run as administrator:If Task Scheduler opens with lots of complaining about corrupted tasks that is a symptom of a botched Windows 7 to Windows 10 back to Windows 7 reversion and is a different problem (sometimes fixable).If Task Scheduler opens fine check the Defrag task to see if it has been Disabled.When you look in Task Scheduler you should see the task and be sure the Status column says Ready and not Disabled:If the task is Disabled, right click and Enable it then see how things look.","Defragging a drive that is almost full will do no good whatsoever.  You must remove something.  Likely big things.If you have a partitioned drive (big mistake), backup everything on the 2nd partition.  Delete everything in that partition.  Extend the C partition.If you just don't have the space and you really need it, replace the drive.  it is not that expensive and although it takes a lot of time to do the re-install, it will result in a vastly improved computer.  Follow the step by step you will find here:https:\/\/www.askwoody.com\/2019\/canadian-tech-how-to-rebuild-a-win7-system-with-minimal-snooping\/"]},{"symptom":"unable to activate oem windows after hardware change        I changed out the cpu and motherboard of my computer and forgot to make sure windows was secure, im unable to activate, troubleshooter doesnt work, I tried changing the activation key I recently purchased and get another error message. I am willing to start over with my software or any solution at this point","solutions":["Hi Jason OEM licences are locked to the first motherboard they are activated on and unlike a full retail licence, they do not have transfer rights to another Motherboard or PC . . .You mention that you recently purchased an activation key, is that for the exact same edition (Windows 10 Pro) as you currently have installed on your PC?","First thing, don't call the number on the other post, it's a scam.An OEM licence cannot be transferred to a new device (motherboard) it is only for the original motherboard it was activated against.Is the new licence key you used from a reputable source. Are you sure it's for Windows 10 Pro, is it also OEM. (system builder)"]},{"symptom":"Windows 10 DPC Watchdog Violation bsod loop        The first time I got this bsod war when listening to songs and at the finish it started making a strange sound so I unpluged it because i didn't know what was happening When i turned my laptop back up i got a DPC Watchdog violation BsodI looked it up and said that it was the ssd driverSo i updated it in safe mode and I war still getting itI also ran SFC \/scannow on normal user not in safe mode and it said that it fiind corupt fillesI used restore this pc with keep my files because i didn't had backup and didn't have any bootable media, turing the end, that part where it says \"this updates will help protect your pc\" it have me again the DPC Watchdog violation bsod but it booted up againNow if i get one it restarts usualy it gets to the blue screen with \"Please wait\" it freezes because the loading circle stops moving then I get the DPC Watchdog violation bsod and it went on again then it booted up to my user but didn't has time to load and the bsod restant bsod happend againIf you can tell me anything about this I will apreciate it.(Sorry for any gramar mistakes)","solutions":["Hi UserJY, to diagnose the underlying issue, I need to analyse your Mini-dump file(s), if you cannot get those, try booting into Safe Mode to get them, because most device drivers do not load in Safe Mode . . .Open Windows File Explorer Navigate to C:\\Windows\\Minidump Zip up the contents of that folder If you have problems zipping those files, copy them out onto your Desktop and zip them from thereUpload the zip file to the Cloud (OneDrive, DropBox . . . etc.) Then post a link here to the zip file, so we can take a look for you . . .","I will try tomorrow if you don't mind","Hi UserJY, no problem, I will be here . ..","I also think that there are more of them i has a lot of DPC Watchdog violation bsods  and an other one when i tried to boot in normal windows by the troubleshooting menuThe code was KMODE EXCEPTION NOT HANDELD and the file that fails was rdyboost.sys","Sorry for grammar","Hi UserJY That is no problem, upload all the minidump files you have and I will look at them all, the more you have, the easier it will be to diagnose the underlying issue . . .","What free service can I use?","Hi UserJY There is no charge for help here on MS Community, we are all volunteers on this forum, we are here to help you and there is absolutely no charge . . .","I meant for uploading the file without a any charge, but i apreciate your answer","Hi UserJY Seeing as you are logged into this websiite, you have a Microsoft account, so you can use OneDrive, which will be free . . .Copy those files into a new folder Log into this page - https:\/\/onedrive.live.com\/Then drag the new folder into your OneDrive page When that uploads, right click the folder on the OneDrive page and choose Share Then click Copy Link Paste that link here and I will be able to analyze those for you . . ."]},{"symptom":"Keeping getting a speaker volume pop up on screen Windows 10        I keeping getting a speaker volume pop up on screen Windows 10","solutions":["Hi William That control is part of your Acer Monitor on-screen controls, it is not part of your PC or WindowsOn the side or bottom of your monitor should be a Menu button and possibly volume buttons, make sure nothing is resting up against those, if that is not the case, press the menu button on your monitor ans see if you can turn off that control from there"]},{"symptom":"Enabled Driver verifyer, system won't boot        Hi, I was trying to fix a ntoskrnl.exe issue that I was having sonI enabled the driver verifyer and now my system won't boot. All I get is a bsod displaying as showed in linked photo. I tried disabling it in the advanced boot menu but no luck. I tried using the windows repair that didn't fix the issue either. Thanks","solutions":["Fixed it by going into safemode and \"disable existing settings\" in the driver verifier. Now back to the ntoskrnl.exe crashes","Drivers are different.  They should NEVER be updated with the singular exception of solving a specific problem and then just that driver.Your only valid source of drivers is the OEM of the equiment.NEVER use any driver update program.  They are almost all bogus, provide bad drivers and are full of malware.Most computers NEVER have a driver update and work just fine for many years."]}]}